{"url": "https://people.com/style/paris-haute-couture-fashion-celebrity-photos/", "text": "01 of 79 NAOMI CAMPBELL WWD/REX/Shutterstock The 47-year-old supermodel proves she's still the reigning catwalk queen at the Azzedine Alaïa show.\n\n02 of 79 KARLIE KLOSS WWD/REX/Shutterstock \"Thank you @azzedinealaiaofficial for inspiring me (and the entire world!) with the passion and love that you bring to all that you do,\" Kloss shared on Instagram of working with the designer on his latest show.\n\n03 of 79 CÉLINE DION Mireya Acierto/GC Images Next up on the Céline takes couture tour, the icon steps out in a bow-embellished Dice Kayek blouse, Céline pants and bag from the upcoming Céline Dion collection.\n\n04 of 79 MICHELLE RODRIGUEZ Bertrand Rindoff Petroff/Getty The actress goes black tie in a glittering midnight blue gown at the Azzedine Alaïa show.\n\n05 of 79 LILY ALDRIDGE Julien Hekimian/Getty No bra, no problem. The supermodel shows off her super-sternum in a blazer (with nothing underneath) teamed with black slacks at the Vogue Foundation Dinner.\n\n06 of 79 BELLA HADID KCS Presse / MEGA This is probably the most covered up we've seen Bella since she landed in Paris for Couture Week.\n\n07 of 79 LILY JAMES Marc Piasecki/WireImage \"Thank you @burberry for this icy blue sequined gem,\" James captioned a photo of her glittering gown, worn to the Vogue Foundation Dinner, on Instagram.\n\n08 of 79 BELLA HADID Continuing her \"naked\" Couture week, Bella skips the bra under her sheer blue gown on the Fendi runway.\n\n09 of 79 KENDALL JENNER PATRICK KOVARIK/AFP/Getty Kendall has a more modest moment on the Fendi catwalk in a caped black dress and fur-trim ankle booties.\n\n10 of 79 KARL LAGERFELD PATRICK KOVARIK/AFP/Getty Images The fashion legend takes his final bow on the Fendi runway -- and even manages a slight smile.\n\n11 of 79 OLIVIA PALERMO AND JOHANNES HUEBL The couture couple were clearly made for each other, as they prove in coordinating Valentino looks at the label's show.\n\n12 of 79 COCO ROCHA Who needs to walk down the runway when you can ride down it in your own high-fashion tricycle as Coco Rocha does in the Jean-Paul Gaultier show.\n\n13 of 79 COCO ROCHA AND JEAN PAUL-GAULTIER Rocha (in a gold unitard) joins the designer and a young model to close out the show.\n\n14 of 79 VIKTOR & ROLF MODEL Some models in the Viktor & Rolf show wore giant doll heads to match their couture looks.\n\n15 of 79 NICKY HILTON The star teamed her pink caped mini with a very summery braid at the Valentino show.\n\n16 of 79 ALESSANDRA MASTRONARDI AND AZIZ ANSARI Bertrand Rindoff Petroff/Getty The Master of None stars dress to impress at the Chanel show.\n\n17 of 79 IAN BOHEN AND JACKIE CRUZ The TV stars took in the style action front row Jean-Paul Gaultier show.\n\n18 of 79 CARLA BRUNI-SARKOZY The former French first lady proves the style power of a sleek black jumpsuit (which she teams with a Bulgari bag) at the Jean Paul-Gaultier show.\n\n19 of 79 ISABELLE HUPPERT The French actress still managed to look très chic in a pair of blue jeans and a simple white cape at the Jean-Paul Gaultier show.\n\n20 of 79 BACKSTAGE AT JEAN-PAUL GAULTIER The designer feels the love from his front row fans including Blanca Li, Catherine Deneuve, Farida Khelfa, Carla Bruni-Sarkozy and Rossy de Palma.\n\n21 of 79 CAMILA COELHO The fashion and beauty blogger puts a street style twist on this Elie Saab star-print tulle mini at the label's show.\n\n22 of 79 NAOMI WATTS AND SOPHIA LOREN Bertrand Rindoff Petroff/Getty We imagine that Naomi was totally fangirling at the moment this photo was taken, as she sits next to the silver screen queen herself at the Armani Privé show.\n\n23 of 79 FRONT ROW AT ARMANI PRIVÉ Bertrand Rindoff Petroff/Getty Naomi Watts, Sophia Loren, Roberta Armani and Kate Winslet are what FROW dreams are mad of.\n\n24 of 79 KENDALL JENNER Marc Piasecki/WireImage The supermodel hasn't been hitting too many runways in Paris, but she is all over the red carpet, seen here in a chic mini dress, $1 million worth of Lorraine Schwartz Jewelry and a chic top knot at the Vogue Foundation Dinner.\n\n25 of 79 BELLA HADID Starface/Splash News The model opened the show for her designer and friend Alexandre Vauthier in a sheer mesh turtleneck, maxi skirt, and military-inspired cap.\n\n26 of 79 BELLA HADID Chesnot/Getty And she didn't stop there. She also hit the Alexandre Vauthier catwalk in a plunging silver gown with a slit-up-to-there.\n\n27 of 79 PRIYANKA CHOPRA Antonio de Moraes Barros Filho/WireImage The actress selects a chic LWD and black heels for the Armani Privé show.\n\n28 of 79 KATE WINSLET Stephane Cardinale /Corbis/Getty And Winslet opts an LBD at the show.\n\n29 of 79 NAOMI WATTS Stephane Cardinale/Corbis/Getty The actress pairs an ivory slip dress with a matching blazer and nude sandals at the Armani Privé show.\n\n30 of 79 KIRSTEN DUNST Marc Piasecki/WireImage The actress's black velvet gown (worn to the Vogue Foundation Dinner) may be demure on top, but the skirt is covered in sheer panels.\n\n31 of 79 KARLIE KLOSS Marc Piasecki/WireImage Now that she's platinum, the supermodel has been experimenting with her makeup look, selecting a vampy, deep purple lipstick to go with her asymmetrical black gown and Repossi jewelry at the Vogue Foundation Dinner.\n\n32 of 79 ZENDAYA Marc Piasecki/GC Images The Vogue covergirl continues her high-fashion style streak in Paris in high-fashion Viktor and Rolf sweatshirt dress, and a effortless top knot. \"I did not do my hair at all,\" she joked on Twitter.\n\n33 of 79 BARBARA PALVIN The model keeps it chic and sleek in a black suit and a red lip at the Armani Privé show.\n\n34 of 79 BELLA HADID Marc Piasecki/WireImage Tangerine dream! Spring 2017 Couture dress with a head-turning train at the Vogue Foundation Dinner.\n\n35 of 79 DOUTZEN KROES Marc Piasecki/WireImage The model knows the power of an LBD as she proves in a this fit-and-flare mini (teamed with platform sandals and a red lip) at the Vogue Foundation Dinner.\n\n36 of 79 KATE MOSS Marc Piasecki/WireImage The model icon attends the Vogue Foundation Dinner in a chic black suit featuring a blazer with crystal-covered lapels.\n\n37 of 79 BELLA HADID WWD/REX/Shutterstock Walking down yet another catwalk, Hadid completely transforms her look at the Maison Margiela show.\n\n38 of 79 KRISTEN STEWART Stephane Cardinale/Corbis/Getty After making her mark at the Chanel show in a glittering onesie, Stewart goes for another sexy look, wearing a sequin-covered black micromini and ankle-strap pumps to the launch party for Chanel's new perfume \"Gabrielle.\"\n\n39 of 79 STELLA MAXWELL Stephane Cardinale/Corbis/Getty The model joins Stewart at the Chanel perfume launch, wearing black ripped skinnies and a sequin cropped jacket.\n\n40 of 79 EMILY RATAJKOWSKI BACKGRID Jewel tone velvets are going to be huge trend this fall, and the model is clearly getting a jumpstart on the look in her emerald J. Brand two piece teamed with a black bandeau and a new bag from her upcoming collection.\n\n41 of 79 LOTTIE MOSS Jacopo Raule/Getty When you're at a Bulgari pop up shop event in Paris, you have to be holding one of the brand's chic bags, and the model got the memo waring her pink-and-white striped purse with a textured strapless cocktail dress.\n\n42 of 79 KAROLINA KURKOVA Marc Piasecki/WireImage The model's legging boots were definitely made for walking, and that fringe dress, worn to the Vogue Foundation Dinner, was made for Boomerang-ing.\n\n43 of 79 EMILY RATAJKOWSKI KCS Presse/MEGA The model attends the Vogue Foundation Dinner in a sexy black gown and effortless updo.\n\n44 of 79 ALICIA VIKANDER Splash News Online The actress adds Bulgari accessories to her black lace dress at the brand's pop up shop event in Paris.\n\n45 of 79 KATY PERRY AND CARA DELEVINGNE Stephane Cardinale/Corbis/Getty The stars (and their platinum buzz cuts) spend July 4th together at the Chanel show in Paris, one year after Cara spent the weekend in Rhode Island at Taylor Swift's epic July 4th party.\n\n46 of 79 CARA AND KATY (CONT.) Bertrand Rindoff Petroff/Getty And of course, they're wearing their couture best for the occasion.\n\n47 of 79 KRISTEN STEWART Stephane Cardinale/Corbis/Getty K-Sizzle. The Chanel muse selects a glittering, second-skin onesie and sky-high pumps at the label's fall/winter 2018 Haute Couture show.\n\n48 of 79 MARY AND KATY PERRY Pascal Le Segretain/Getty The singer brings a very special plus one to the Chanel show -- her mom Mary.\n\n49 of 79 JULIANNE MOORE AND KRISTEN STWEART Bertrand Rindoff Petroff/Getty The actresses (who starred together in Still Alice) reunite front row at the Chanel show.\n\n50 of 79 CARA DELEVINGNE Bertrand Rindoff Petroff/Getty It wouldn't be a Chanel event without the model-turned-actress, who owns her edgy style off the runway as a front row guest.\n\n51 of 79 JULIANNE MOORE Pascal Le Segretain/Getty Très chic! Moore makes her mark at the Chanel show in one of the French's label's signature tweed mini dresses.\n\n52 of 79 TRACEE ELLIS ROSS Bertrand Rindoff Petroff/Getty The actress continues her couture week takeover in chic allover white with red accents (perhaps her nod to the 4th of July).\n\n53 of 79 TILDA SWINTON Pascal Le Segretain/Getty Swinton has her own brand of style swagger, which she shows at the Chanel show in chic white separates, including a belted coat, floor-skimming maxi skirt and gold loafers.\n\n54 of 79 CLAUDIA SCHIFFER Pascal Le Segretain/Getty From the catwalk to the frow, the forever Chanel girl attends the show in a black zip-front jumpsuit teamed with It girl accessories.\n\n55 of 79 PHARRELL WILLIAMS AND HELEN LASICHANH Bertrand Rindoff Petroff/Getty The couple that Chanels together, stays together.\n\n56 of 79 LILY COLLINS Pascal Le Segretain/Getty The star braves a denim moment in a pair of cropped jeans teamed with a fringe embellished Chanel top and ankle-strap sandals.\n\n57 of 79 KATY PERRY AND PHARRELL WILLIAMS Pascal Le Segretain/Getty Because they're happy (they're wearing Chanel).\n\n58 of 79 KATY PERRY, KARL LAGERFELD, CARA DELEVINGNE AND CLAUDIA SCHIFFER Dominique Charriau/WireImage Presenting the many muses of Chanel Kaiser Karl Lagerfeld at his latest show.\n\n59 of 79 ROWAN BLANCHARD Bertrand Rindoff Petroff/Getty The 15-year-old star almost wore a \"cupcake dress\" to the Chanel show, but in the end she has a chic menswear moment in a embellished tweed jumpsuit with a matching cropped blazer.\n\n60 of 79 JENNIFER LAWRENCE Dominique Charriau/WireImage The Dior darling reps the brand hard (she's a long-time ambassador), attending the show in a head-to-toe look including a white lace mini dress, fringe sweater, wide-brim hat, embellished bag and sneakers that go up her calf.\n\n61 of 79 JENNIFER LAWRENCE PART 2 GEOFFROY VAN DER HASSELT/AFP/Getty Images First the show, then the after party. Lawrence wears a sheer skirt with exposed \"Dior\" briefs and fringe top to the opening of the Dior exhibition marking the 70th anniversary of Christian Dior.\n\n62 of 79 CÉLINE DION Pierre Suu/Getty Images The eternal fashion icon brings her sartorial A-Game to the Giambattista Valli show (and some serious cheering to the front row).\n\n63 of 79 BELLA HADID Jacopo Raule/Getty Images for Christian Dior Another fashion week, another naked gown for Bella, seen here on the red carpet at the Dior 70th anniversary exhibition party.\n\n64 of 79 ELLE FANNING Pascal Le Segretain/Getty Images The Beguiled star has a major mini moment in a pink Miu Miu design covered in oversized paillettes at the label's cruise collection show.\n\n65 of 79 ZENDAYA Samir Hussein/Samir Hussein/WireImage Better from the back! Zendaya goes full on glam in an all white Ralph & Russo Couture look and Chopard earrings at the label's show, and outfit which she describes as \"fit for a princess.\"\n\n66 of 79 CARA DELEVINGNE Pascal Le Segretain/Getty Images for Christian Dior Proving over-the-knee boots are here to stay, Delevingne teams her flirty white mini with some daring black thigh-highs at the Dior exhibition.\n\n67 of 79 NATALIE PORTMAN Antonio de Moraes Barros Filho/WireImage Portman opts for a chic LWD at the Dior exhibtion launch.\n\n68 of 79 KIRSTEN DUNST Dominique Charriau/WireImage Dunst has a Dior moment at the show in a black embroidered dress covered in a star print.\n\n69 of 79 JENNIFER LAWRENCE, NATALIE PORTMAN AND ROBERT PATTINSON Bertrand Rindoff Petroff/Getty Images The trio brings some A-list star wattage to the Dior show.\n\n70 of 79 KARLIE KLOSS \"Went platinum without the album,\" the model says of her new white blonde hue, which she debuted at the Dior show.\n\n71 of 79 KARLIE KLOSS PART 2 Jacopo Raule/Getty Images for Christian Dior She also pulls quick change, putting on another head-turning Dior dress for the label's 70th anniversary party.\n\n72 of 79 KENDALL JENNER, JOAN SMALLS AND BELLA HADID Pascal Le Segretain/Getty Images The model squad poses backstage at the Miu Miu Cruise Collection show.\n\n73 of 79 FELICITY JONES Jacopo Raule/Getty Images for Christian Dior Jones keeps it simple in a black, belted dress the Dior 70th anniversary exhibition.\n\n74 of 79 EVA HERZIGOVA The model wears the new It Dior accessory (that hat!) with a chic black gown and fashion draped blazer at the 70th anniversary exhibition ecent.\n\n75 of 79 ELIZABETH OLSEN Stephane Cardinale - Corbis/Corbis via Getty Images What's black and white and chic all over? The actress's two piece set worn to the Dior show.\n\n76 of 79 WINNIE HARLOW Jacopo Raule/Getty Images for Christian Dior The model of the moment wears a romantic gray lace gown to the Dior 70th anniversary exhibition.\n\n77 of 79 BIANCA JAGGER Dominique Charriau/WireImage The fashion icon doesn't let the heat in Paris prevent her from wearing a velvet coat dress at the Dior show.\n\n78 of 79 GEMMA ARTERTON Stephane Cardinale - Corbis/Corbis via Getty Images The actress wears a white suit over a sexy black bandeau at the Dior show.", "images": ["https://people.com/thmb/tH-vXjOXjwLJOpdwLBRb5rK_uVI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/celine-dion-1-2000-831e0db29acf4625af4907a79bbe96b2.jpg", "https://people.com/thmb/S9gHF6XQ5sWijBbIxF60LQeysiI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/kim-kardashian-tout-b65b6602c0a94f48b4c1a33ac3567bb3.jpg", "https://people.com/thmb/HyH2sUznV3XU11W88sDRsoGR3y4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(721x0:723x2)/rowan-blanchard-56091446447244cc9cf688222cef0c35.jpg", "https://people.com/thmb/jvZvmV34ZoKWcW1OPyUT0GTzl_E=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(558x0:560x2)/doutzen-kroes1-9caa296a1cf248bb932ce84c2915c567.jpg", "https://people.com/thmb/UiImBtmQZKyiGCQmIxBkeyULhUQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(708x0:710x2)/natalie-jennifer-rob-2000-1384c4136c52467b8670d9d671b8641d.jpg", "https://people.com/thmb/IiEms7j9lnUgV-7SGhSABPadlp0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(571x0:573x2)/bella-hadid-2-2ea7ebb9c6174ee4ae495206e13cdf24.jpg", "https://people.com/thmb/H6lFqH1CM7J391tQsk2SGqJDz-g=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(657x0:659x2)/oco-rocha-1aa72b0065dd4318882cedd2db6c163b.jpg", "https://people.com/thmb/djHiWf_ReMnLfaM5AfsQDmASxqw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(609x0:611x2)/isabelle-hupert-6da68d40795549f6b6e4bf83e9d63340.jpg", "https://people.com/thmb/8UZcSpL9WN5ryTxGWZQRkJAVGCM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(645x0:647x2)/naomi-watts-2000-029a63461db84086a9430a7424e45b7e.jpg", "https://people.com/thmb/8cJmVZc7Ok6w5_4Wwxc14qmMsU4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/people_generic-1885945d8bd544778fbbf4be88a63f00.jpg", "https://people.com/thmb/fZ8uv_tcp4YyiIrwrFDnpeGJPBo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/emma-e501188e6136444b9028c21a2fc0abd3.jpg", "https://people.com/thmb/fi_75JzoFCYN_fn4L1haYiigCdk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(649x0:651x2)/zendaya-1-2000-2358d989b4c84b2a8bc4f91f49d27d50.jpg", "https://people.com/thmb/gVJmWQ-F15Cl8W_xs5ngBcWrUaU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/cara-delevingne-1-2000-9cbbdc10480647829326a0e299f8797f.jpg", "https://people.com/thmb/3GqzID19HWC62shCsYjhEhJx-Xs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/halle-berry-e83b62b7f7a44878a87106cac1e1c3ad.jpg", "https://people.com/thmb/OoyQX6le5P7n5FVV0tW7jLSkWAo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(585x0:587x2)/lily-james-b9c72c2234024f6abd507c99fbda91b3.jpg", "https://people.com/thmb/m_65nFU11RNPw9881xGuNtfzR1g=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/gemma-arterton-1-2000-a44f938e5ea14b18b52a8cade907000a.jpg", "https://people.com/thmb/3jqQ9HTHa8C63Ln51F-w7sM8duo=/1135x2000/filters:fill(auto,1)/naomi-campbell-14b0148bedfe4e65939448785e51e6a9.jpg", "https://people.com/thmb/dBMiTMbl1FyIEY4BfXNJ8tnbmos=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(616x0:618x2)/michelle-rodriguez1-2bdc62552c7c4020a9b253c8c8ef0279.jpg", "https://people.com/thmb/LWRep2TBvMvro81PbYWvSw6ZuoE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(660x0:662x2)/paris-couture-week-bella-2000-ab9b1fa1a6dc4d6e843ffa52d26ea685.jpg", "https://people.com/thmb/lJZySU5t26Y5oTJp7GZGp0pxAHQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(700x0:702x2)/katy-cara-a29f824f92944cb4a41e761dc46bb7a0.jpg", "https://people.com/thmb/oflKUpm9p3SmxZi-ujAM2-0ooz4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(579x0:581x2)/olivia-palermo-1-9912645ddfe24687b90e69a111dcf621.jpg", "https://people.com/thmb/2ML737RUNaKlq9Y4j2aIpOQg8zA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(594x0:596x2)/karlie-kloss1-0110f017e425446c84b2c417369152f6.jpg", "https://people.com/thmb/26FUbDTdnBF2E5kkl5KK4fmSlOc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/eva-herzigova-1-2000-1020f11a09b74752ab8d8c13c371b30c.jpg", "https://people.com/thmb/8KfnjojlwNErg928sLTUxfZ9kys=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(656x0:658x2)/victor-rolf-f2a60a1ed5ce46ea9d7a7d3568378ae4.jpg", "https://people.com/thmb/E2nwp3m-K96eW9nw3jUC1sw_udg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(596x0:598x2)/jackie-cruz-b244d36937674a0db6adc60322210c3b.jpg", "https://people.com/thmb/tHaGf1gUt2WTQRZ7-897wupuibU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(684x0:686x2)/aziz-ansari1-44ade7de33754f0b848b2fbe83771a65.jpg", "https://people.com/thmb/2FWyjvIpnXrKNNt1nxq-n-Ngz0E=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(801x0:803x2)/bella-hadid4-1e3eae9a404d43bd99abc7d83a93a3c3.jpg", "https://people.com/thmb/ZYXl2-EHf6vrAC0rQdn-AkB8vSc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(712x0:714x2)/katy-mom-923025ad9f854ea4b013bd2255aa1730.jpg", "https://people.com/thmb/6iq-R6P9DBnFpSUqiLYfAxkxT6U=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(566x0:568x2)/naomi-campbell-14b0148bedfe4e65939448785e51e6a9.jpg", "https://people.com/thmb/Y0shA94igTuWpbucNFg2pmealNw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/bella-hadid-1-20001-14b020b9aaf2444dbef5e78313baa2ab.jpg", "https://people.com/thmb/UVv9QzXXz7CTlucjpage0hDo0ps=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(706x0:708x2)/tracee-ellis-ross1-2a4f4b318e7f412cb03eb34a9328e328.jpg", "https://people.com/thmb/5XIa8K_ygtoh0RADFDtEB-Ak6Cs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/carrie-underwood-1-2000-785275b434634cc0bbd9adbcc41eab5f.jpg", "https://people.com/thmb/zj5DDFF3i-oHCwBCYSfXTCf6J0g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/karl-lagerfeld-660-4bed0a79435f405dbe9ea6b2a8b4762f.jpg", "https://people.com/thmb/507G7jQxK0R_PFlatE09W5sBePs=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(602x0:604x2)/bella-hadid-3-d3467094544f4e23a3bc5fc9e978bc69.jpg", "https://people.com/thmb/LhkXnd4PPOhvnUgypfXcA938jbM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(707x0:709x2)/lily-collins-3c22fb4b4c0e4c08ab04df67843e16f8.jpg", "https://people.com/thmb/3_1ZObG5eABs5B8JCsJYnqCFuJ8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(604x0:606x2)/priyanka-chopra2-98560eaecfce476a8e3ab7e850dcefab.jpg", "https://people.com/thmb/XHgcqCQqR7GXEksQR3oDFPHn888=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(562x0:564x2)/bella-hadid1-f5d1bb13a7584643a4e33231c4e3b8e1.jpg", "https://people.com/thmb/Xlj-Iv8oEF1wEk1OtVkAA51SvnM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(735x0:737x2)/tilda-swinton-dc20852d724742c0b5e16e4714bf19c1.jpg", "https://people.com/thmb/Lp7pfreMImhhCazMNN_Yw9zFWV8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(577x0:579x2)/lottie-moss-85137f62050948408d1aa4fa984e2b95.jpg", "https://people.com/thmb/p-hlm-EEUSNQMdNnrb701UlVF50=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(585x0:587x2)/stella-maxwell-13bb06551ef642a38fd38b577e2f79fc.jpg", "https://people.com/thmb/quXTLKiRA2K8Ciwz83FQmgjCdiE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(732x0:734x2)/rihanna-b75ac04093a24d6ca02ec81657d6a900.jpg", "https://people.com/thmb/mfbViO_nhCOh9d3llLWaCL4d1UU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(531x0:533x2)/lily-aldridge-c740b4da970c473f930b733727b0d470.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/1WQv1NYZ5EtUAE4vH19Y6xbOJgw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(513x0:515x2)/em-rata-2-07b3272556d24fe99f465d2832b5db47.jpg", "https://people.com/thmb/rhyAd-2eibxwyDOLULWb9kmTh60=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(696x0:698x2)/carla-bruni-ab0bb51f2b114a789c50e994e86df3f5.jpg", "https://people.com/thmb/iv-PkMb2ZNb-55bW_aRkE4e9AtU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(666x0:668x2)/alessandra-ambrosio-7850411bbed94291872bf81ab28dd1d7.jpg", "https://people.com/thmb/ft3puj9UwTdDv_bfxnTospRTWfo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(606x0:608x2)/barbra-palvin-2000-3aef6b81eb044d4698509ec1e14d5e0b.jpg", "https://people.com/thmb/AJm-Dsdp-vXcLEVDWl1H1sgQYg4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(593x0:595x2)/kate-winslet-2e290b476c634212a84c7c1feb1d8347.jpg", "https://people.com/thmb/2pSX37qJNMxLWlmg1H1aErAjkkU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(585x0:587x2)/em-rata-1-2a5b36cf1c844d6ca079525622295924.jpg", "https://people.com/thmb/y4sz3JZMtYxY9oVxQ58cjH9VyAY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/katy-cara-tout-c73f752e5959489f9df61be200d86f00.jpg", "https://people.com/thmb/Cc1mBfpen-MA-zdtUSBXzwV0ELc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(608x0:610x2)/celine-dion4-8836212d391b428e89926cfc2ee4a205.jpg", "https://people.com/thmb/ukTxf6LyJIdzh1JDc_mN-3oVZyE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(585x0:587x2)/karolina-kurkova-fe1c0d09f57b4aaea44b071c022621f4.jpg", "https://people.com/thmb/dSTHSQS1B9Mw_p0JeOIV6ASBzmU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/winnie-harlow-2-2000-3a11a641f3834f949d57f364158df4e2.jpg", "https://people.com/thmb/BDPIxJbrTLGmVX3TUk08u7O56Y0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/vanessa-hudgens-5-76c25640fe674b999afaf34c25545310.jpg", "https://people.com/thmb/LzSO9MneGZV52fJR6RI02oivMI4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/lili-8e30337019ed4e20a1cf19ac40e880a3.jpg", "https://people.com/thmb/uUi8hP8daQS8OiULBVfQDm9eZuI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(701x0:703x2)/kristen-stewart-3000eee3b7914dd39053f5f199f8dd15.jpg", "https://people.com/thmb/3xfBHytDrWECS0QFBJ0DpdqxyNw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/kendall-bella-2000-e8903e3eba234f98b03766800ee19ffe.jpg", "https://people.com/thmb/rphIeOnJcmpEbqUb1RImxVmWOZQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(601x0:603x2)/nicky-hilton-d0b9080d033445e48ea1483d48e128fd.jpg", "https://people.com/thmb/8zcWSyRAwcX69kEAejTcUvf-Kjs=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(590x0:592x2)/camila-coelho-72af21440e164adbb46a435f5f4b8771.jpg", "https://people.com/thmb/GJTR-b6YSiO4PUMQXPFHTAOCDsA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(519x0:521x2)/karlie-kloss3-45d5089de33d407c996d258897df8136.jpg", "https://people.com/thmb/dIoZPpHZ7QVOMH_FDhAOeavYtaM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(679x0:681x2)/lrd-1-2000-92c3aa86e7584503aa8cf0d924209cd6.jpg", "https://people.com/thmb/AlgrQgP2OVBySHnVzDdVFb1dYcs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(144x0:146x2)/cameron-diaz-290-1-1b370d97aaeb4f6a9032ef2b9537c426.jpg", "https://people.com/thmb/uKLveoU-DL39oUnCfQauy-3QrPI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/jennifer-lawrence-2-2000-70b0c9d38d9347af8007d6b5232e96e5.jpg", "https://people.com/thmb/jW5flkeTCZG39qsU-ZkfON0DdA4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/cannes-tout-32c7b83bfc96456e9fa07504dc5e969a.jpg", "https://people.com/thmb/BZln1NOX2LxIAqZTcIxKGA5zN68=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(704x0:706x2)/pharrell-wife-7489dc9b90074c079089770f8774082f.jpg", "https://people.com/thmb/p723u04Lg6lkb7yUgictxnEF394=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/bella-hadid-1-2000-8a20cd3266f04b19965537d24c4f5bc7.jpg", "https://people.com/thmb/soMd1IZIpbcYH9iR2WIiseg0twk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(684x0:686x2)/paris-couture-week-kendall-2000-6ec4932390524ed1a894a504df320f75.jpg", "https://people.com/thmb/gpku-FqHxTceE5z20lHch6c5N88=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(731x0:733x2)/claudia-schiffer-8bcbe6dfc82642e08a8a1c14f8b250b6.jpg", "https://people.com/thmb/kUkfU33w6fhR-zNyWYl82ziPI30=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/karlie-kloss-2-2000-1e1dea0c4c4544d4a0d743907d02c340.jpg", "https://people.com/thmb/SL8CwY58_EsnnKYvPPIacB3_hnA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(613x0:615x2)/kirsten-dunst2-9335177ac53a43b4aa3f69ea1919d7fe.jpg", "https://people.com/thmb/ap1CEz3MWfey0nirEkHA4tdBvGI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(600x0:602x2)/kristen-stewart1-c9a69e7756c64b64a5ad800b32bfbfc0.jpg", "https://people.com/thmb/Ei88Fp9ibyYrwQp3u_MEQ25x1-s=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/jennifer-lawrence-1-2000-6c2181cf41b9478ead0ca680db9c16cc.jpg", "https://people.com/thmb/y1kSqr5ZA0kgjXn0k0eFk17gCto=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(608x0:610x2)/zendaya2-4b41e0d3f0754e5b80dabb603ed6a953.jpg", "https://people.com/thmb/KSCmfhltdNB1fcl_KXGcmd-QVTA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(714x0:716x2)/cara-delevigne-29e74fb0f0204c5e9152152555852de7.jpg", "https://people.com/thmb/2PfEZBSHi6OxaQg4les-ubl7Bis=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/naomi-watts-1-f967179538d44cc0994e338ce5e434ae.jpg", "https://people.com/thmb/4rBsav9YMM0iU6D5mzg6ehSR9lw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(696x0:698x2)/kaia-gerber5-359eabf648de44cd817c1e2b7099f3b0.jpg", "https://people.com/thmb/0DNaZG9pZ6NdsRAW78xgAocYJgo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(631x0:633x2)/paris-couture-week-karl-1-2000-f450c7addccd48259d7e31f127b93f03.jpg", "https://people.com/thmb/1MqKD2JS6jckmMHZxIoINBJZp-I=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(570x0:572x2)/kate-moss-08bff250435949799a4447a6f38d9bf8.jpg", "https://people.com/thmb/X67q3D0iyMAnWuksmdCpU3Ur8hc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/kirsten-dunst-1-2000-aa60f25e2b994900aeca9c2eabe1c8e2.jpg", "https://people.com/thmb/rVyL-BNyhybU1CeCmkrr-SKGu6E=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(691x0:693x2)/naomi-watts-2-a72d37a5851f463da0055ca1fbed1587.jpg", "https://people.com/thmb/RzJFAk1kbT4HLaGIi3-ZtRhc7bI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/elizabeth-olsen-1-2000-4a5505764e0649daa3fd64803843c720.jpg", "https://people.com/thmb/e99S-G0YAvbzQiVoPwGXih22IPc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/bianca-jagger-1-2000-db1f975bd1db4d06b16834c79ec118d1.jpg", "https://people.com/thmb/seVvrgR0-Vg8iWhrOGc4HIcaUVc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/elle-fanning-1-2000-d98fb4def47644159382620d9e289945.jpg", "https://people.com/thmb/yEgrSjfX-ukrCSDpYVoVhzFWaCs=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(730x0:732x2)/julianne-moore1-a43a27296b6f4bac9dbfe44aeb526622.jpg", "https://people.com/thmb/BhMWLl5MhTaW9qmN77jelPYQEn4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/coco-rocha-12-541758a820964b02a9a4fc89149138af.jpg", "https://people.com/thmb/mtm7iV4miAv1zuAe78RbzAtmfN4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(704x0:706x2)/julianne-moore-f96c43de2c6b48ba8f2f82a5bec72ccb.jpg", "https://people.com/thmb/SeVwh8hs3gMnWNwaUbRJylu29Tg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/natalie-portman-1-2000-d86bc46cc64f445ab243ee1d4acebc25.jpg", "https://people.com/thmb/M1oS89yoZO2M0cUEpM_WZQpdCa8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(614x0:616x2)/alicia-vikander-72d7cc997f764ceabb9eba609732ea61.jpg", "https://people.com/thmb/nvG4aEgusKaLiVnzhNyvrflgPqQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/carla-bruni-1-af30816cfd364eac8be04b1479e30776.jpg", "https://people.com/thmb/E_JBCUqasTGwHU_oPKAYNETpJtk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(562x0:564x2)/kedall-jenner-1544f5844a86483ebb4887fb2f948671.jpg", "https://people.com/thmb/-9gPLimfzU88mEUbYc6UALKKfOY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/christina-1-b5a6bc4f3d014dc8905190d2a023d839.jpg", "https://people.com/thmb/zhq0kE9ogKLg-SkVLCQMyAJJ8_s=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/karlie-kloss-1-2000-2dac4075be6047e9843cc830a069344a.jpg", "https://people.com/thmb/im8FGixjKZJMLHeiD-7JkK_NQc4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/zendaya-tout-6881206752b04ccfb3bc94d9b19af564.jpg", "https://people.com/thmb/37FbHL0B8roW8EcMER7L31vSWFE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(725x0:727x2)/katy-pharrell-9866409a5a364561954b4aaef90b0e9c.jpg", "https://people.com/thmb/XpLch6NkUQkWPkOB8MBnHf5e7qM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/karl-93729976a9614f6a9d7eda09dc30e409.jpg", "https://people.com/thmb/BH0HA7kYiUW5AZZ-nVnup-Mdj0s=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/felicity-jones-1-2000-b3fad66ce65a4823889e838c7709ed03.jpg", "https://people.com/thmb/zMYUn_NMgLmR9M58r1LQc9bU22U=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/olivia-palermo-1-2000-add409c0a329400e9cf2a7b5f8abe0bb.jpg"], "top_img": "https://people.com/thmb/3jqQ9HTHa8C63Ln51F-w7sM8duo=/1135x2000/filters:fill(auto,1)/naomi-campbell-14b0148bedfe4e65939448785e51e6a9.jpg", "keywords": [], "authors": ["Brittany Talarico", "People Editorial Guidelines"], "canonical_link": "https://people.com/style/paris-haute-couture-fashion-celebrity-photos/", "title": "Paris Haute Couture Week 2017 Celebrity Photos", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Summer style is heating thanks to Kristen Stewart, Katy Perry and more stars hitting the front rows and after parties in the finest high-fashion looks", "emailcontenttype": "LISTSC", "emailvertical": "PEOPLE", "sailthru.author": "Brittany Talarico", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/style/paris-haute-couture-fashion-celebrity-photos/", "title": "Paris Haute Couture Week 2017 Celebrity Photos", "description": "Summer style is heating thanks to Kristen Stewart, Katy Perry and more stars hitting the front rows and after parties in the finest high-fashion looks", "image": "https://people.com/thmb/3jqQ9HTHa8C63Ln51F-w7sM8duo=/1135x2000/filters:fill(auto,1)/naomi-campbell-14b0148bedfe4e65939448785e51e6a9.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Paris Haute Couture Week 2017 Celebrity Photos", "description": "Summer style is heating thanks to Kristen Stewart, Katy Perry and more stars hitting the front rows and after parties in the finest high-fashion looks", "image": "https://people.com/thmb/3jqQ9HTHa8C63Ln51F-w7sM8duo=/1135x2000/filters:fill(auto,1)/naomi-campbell-14b0148bedfe4e65939448785e51e6a9.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}