{"url": "https://www.closerweekly.com/posts/jason-george-leaving-greys-anatomy-141654/", "text": "Don’t go, Dr. Ben Warren! Another Grey’s Anatomy actor bites the dust. Jason George revealed in September that he is sadly leaving the medical drama after seven years, but that’s not the end of Ben! He will be joining a still-unnamed spin-off. Scroll down to learn everything we know about his exit!\n\nWhat is the Grey’s Anatomy spin-off about?\n\nThe spin-off is set to be about a group of Seattle firefighters, and will focus on both their professional and their home lives. If you remember from the Season 13 finale, Ben ran inside the fire to try and save his fellow doctor Stephanie Edwards — who also left the show for another TV opportunity — so this role sounds totally fitting for him.\n\nJason on Grey’s Anatomy.\n\nJason also opened up about the upcoming show. “I think the fun thing about firefight spin-off is that firefighters are on for 24-hour shifts and they become like a family. They eat together, they’re sleeping there – it’s like the Grey‘s family, except for when the Grey’s family makes mistakes, a patient dies,” he said. “When these guys make mistakes your partner dies, your friend dies, your lover, whatever, dies. That’s an interesting new level and new twist to the work-family kind of thing.”\n\nWill there be crossover episodes of Grey’s Anatomy and the spin-off?\n\nYou bet! On Dec. 7 Jason revealed that the two worlds will be much more closely connected than Private Practice was! “My understanding is, Ben will be popping up in Grey’s Anatomy some and some of your favorite Grey’s Anatomy folks will be popping up in the spin-off,” Jason told Entertainment Weekly. “When it was Private Practice, the show was located in Los Angeles, so by definition, it had to be an event when they came up to Seattle or vice versa. This one can be an event, but it also doesn’t have to be. The fun part is, the writers have an embarrassment of riches, they can play it any way they want it at any given time. They could have a mega event that goes across both shows, or they could just drop off a person for a little bit and go have a beer. ‘Hey Avery, this is my friend from the firehouse.'” So cool!\n\nWhen can we expect to see Jason George on the Grey’s Anatomy spin-off?\n\nThe new series has yet to be named (any suggestions?), is officially airing on Thursday, March 22! Jason previously shared that they had already started filming as well. “We’ve been training and we’ve been shooting,” he told Variety in November. “I was out with two of the guys last night, hanging out. They’re a fantastic cast I think people are going to fall in love with!” We can’t wait!\n\nWhat does Jason George’s departure mean for Chandra Wilson?\n\nWe don’t know, but we’re really hoping Miranda Bailey stays around Grey Sloan Memorial Hospital for a while. However, when Ben did admit that he didn’t tell his wife, she wasn’t very happy!\n\nAfter the news, it sort of hasn’t been brought up again. Will they divorce? Will she go with him? Will he die in the show? We’re not saying that’s out of the question knowing the show’s creator Shonda Rhimes. We’re dying to find out! Jason admitted to Variety, “I love testing the Ben and Bailey relationship, so we’ll see if it breaks, if this is the straw that breaks that back.”\n\nHas Jason George left Grey’s Anatomy yet?\n\nNot yet, but his character, Dr. Ben Warren, finally brought it up for the first time during Grey’s earlier in Season 14. While hanging out on Jackson Avery’s (Jesse William) new yacht drinking beers with Owen Hunt (Kevin McKidd), Andrew DeLuca (Giacomo Gianniotti), and Alex Karev (Justin Chambers), Ben spilled the beans! “I applied to the fire training academy and I got in,” he revealed, which was followed by disbelief from all the men. He later told Miranda.\n\nHe also opened up about his changing role. “It’s exhausting and exhilarating at the same time. I’ve always been like the Energizer bunny. I can just keep going for days and days, but I realized there is a wall. I’m tired, but I’m ecstatic,” he said. “So I just go to bed and wake up the next day excited because every actor is always looking for new challenges. What I love about playing Ben is that Ben’s always looking for new challenges. He was an anesthesiologist, became a surgeon, and now he’s a surgeon who’s looking for new challenges. He applied to the firefighting academy.”\n\nHow long has Jason George been on Grey’s Anatomy?\n\nJason has appeared on the hit medical drama since its sixth season in 2010. He became a series regular during Season 12 of the ABC series.\n\nJoin our Facebook group for the latest news and updates on Grey’s Anatomy!", "images": ["https://www.closerweekly.com/wp-content/uploads/2018/01/jason-george-leaving-greys-anatomy.jpg?resize=1200%2C630&quality=86&strip=all", "https://www.closerweekly.com/wp-content/uploads/2018/01/jason-george-leaving-greys-anatomy.jpg?resize=940%2C529&quality=86&strip=all", "https://www.closerweekly.com/wp-content/themes/ami-bauer/assets/build/images/placeholders/placeholder-16x9.svg", "https://www.closerweekly.com/wp-content/uploads/2022/08/TITANIC_300x490_7_11r.gif?fit=300%2C490&quality=86&strip=all", "https://www.closerweekly.com/wp-content/themes/ami-bauer/assets/build/images/placeholders/placeholder-1x1.svg", "https://www.closerweekly.com/wp-content/uploads/2018/01/jason-george-greys-anatomy.jpg?fit=400%2C533&quality=86&strip=all&resize=400%2C533"], "top_img": "https://www.closerweekly.com/wp-content/uploads/2018/01/jason-george-leaving-greys-anatomy.jpg?resize=1200%2C630&quality=86&strip=all", "keywords": [], "authors": ["Samantha Faragalli"], "canonical_link": "https://www.closerweekly.com/posts/jason-george-leaving-greys-anatomy-141654/", "title": "Jason George Is Leaving Grey's Anatomy to Join Show's Spin-Off", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "theme-color": "#ffffff", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Don't go, Dr. Ben Warren! Another Grey's Anatomy actor bites the dust. Jason George revealed in September that he is sadly leaving the medical drama after", "og": {"locale": "en_US", "type": "article", "title": "Jason George Is Leaving Grey's Anatomy to Join Show's Spin-Off", "description": "Don’t go, Dr. Ben Warren! Another Grey’s Anatomy actor bites the dust. Jason George revealed in September that he is sadly leaving the medical drama after seven years, but that’s not the end...", "url": "https://www.closerweekly.com/posts/jason-george-leaving-greys-anatomy-141654/", "site_name": "Closer Weekly", "updated_time": "2018-01-24T16:01:29+00:00", "image": {"identifier": "https://www.closerweekly.com/wp-content/uploads/2018/01/jason-george-leaving-greys-anatomy.jpg?resize=1200%2C630&quality=86&strip=all", "secure_url": "https://www.closerweekly.com/wp-content/uploads/2018/01/jason-george-leaving-greys-anatomy.jpg?resize=1200%2C630&quality=86&strip=all", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/closerweekly", "published_time": "2018-01-24T11:50:00+00:00", "modified_time": "2018-01-24T16:01:29+00:00"}, "author": "Samantha Faragalli", "twitter": {"card": "summary_large_image", "title": "Jason George Is Leaving Grey's Anatomy to Join Show's Spin-Off", "description": "Don’t go, Dr. Ben Warren! Another Grey’s Anatomy actor bites the dust. Jason George revealed in September that he is sadly leaving the medical drama after seven years, but that’s not the end...", "image": "https://www.closerweekly.com/wp-content/uploads/2018/01/jason-george-leaving-greys-anatomy.jpg?resize=1200%2C630&quality=86&strip=all", "creator": "@closerweekly", "site": "@closerweekly"}, "fb": {"admins": 593583017, "pages": 487501061346187}, "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://www.closerweekly.com/wp-content/uploads/2020/11/android-chrome-192x192-1.png?fit=192%2C192&quality=86&strip=all"}, "movies": [], "publish_date": 1516794600.0, "source": "https://www.closerweekly.com", "summary": ""}