{"url": "https://en.wikipedia.org/wiki/Mary-Kate_Olsen", "text": "American businesswoman and actress (born 1986)\n\nFor details about Mary-Kate Olsen's career and activities shared with her sister, see Mary-Kate and Ashley Olsen\n\nMary-Kate Olsen (born June 13, 1986)[1] is an American businesswoman, fashion designer, equestrian, and former actress. She began her acting career nine months after her birth, sharing the role of Michelle Tanner with her twin sister Ashley Olsen in the television sitcom Full House (1987–1995). They also starred in numerous films together.\n\nIn 1993, the production company Dualstar Entertainment Group was founded, which produced a long string of television films and direct-to-video releases featuring the girls; they starred in Passport to Paris (1999), Our Lips Are Sealed (2000), Winning London (2001), Holiday in the Sun (2001) and in the television series, So Little Time (2001–2002), for which she was nominated for a Daytime Emmy Award for Outstanding Performer in Children's Programming. They starred in Getting There (2002), When in Rome (2002), The Challenge (2003) and made cameos in Charlie's Angels: Full Throttle (2003). The last film she starred in with her twin sister was New York Minute (2004). She continued with her acting career independently, appearing with a few guest-star roles in films and television shows, and with her last film being Beastly (2011).\n\nIn March 2012, both Mary-Kate and Ashley officially indicated their interest to retire as actresses in order to focus on their careers in the fashion industry. She and her twin sister co-founded luxury fashion brand The Row, lifestyle brand Elizabeth and James, and more affordable fashion lines Olsenboye and StyleMint.[2] They are members of the Council of Fashion Designers of America.\n\nEarly life and education [ edit ]\n\nMary-Kate Olsen was born on June 13, 1986, in Sherman Oaks, California. She is the daughter of Jarnette \"Jarnie\" (née Jones;[3] b. 1954), a personal manager, and David \"Dave\" Olsen, a real estate developer and mortgage banker.[4] Along with her twin Ashley, she has an older brother Trent, a younger sister and actress Elizabeth, and two half-siblings Taylor and Jake (from her father's second marriage).[5] Olsen's parents divorced in 1996.[6] The twins and their siblings have Norwegian ancestry while their mother is of French, German and Italian ancestry.[7]\n\nOlsen attended the Campbell Hall School in Los Angeles.[8] After graduating from Campbell Hall in 2004, Olsen and her twin sister went on to attend the Gallatin School of Individualized Study at New York University.[9]\n\nActing career [ edit ]\n\nCareer beginnings [ edit ]\n\nOlsen began her acting career at the age of nine months old when she and her twin sister, Ashley Olsen, were hired to share the role of Michelle Tanner on the popular television sitcom Full House (1987–1995). She starred alongside her twin sister in the films, To Grandmother's House We Go (1992), Double, Double, Toil and Trouble (1993), How the West Was Fun (1994), It Takes Two (1995), Billboard Dad (1998) and in the television series, Two of a Kind (1998–1999). In 1997, the Olsen twins guest starred in an episode of Sister, Sister, which starred twin actresses Tia Mowry and Tamera Mowry.\n\nDualstar [ edit ]\n\nIn 1993, following Mary-Kate and Ashley's success on Full House, a limited liability company, Dualstar Entertainment Group was created to produce Mary-Kate and Ashley-branded products. It produced a successful long string of TV movies and direct-to-video releases featuring the girls. They starred in Passport to Paris (1999), Switching Goals (1999), Our Lips Are Sealed (2000), Winning London (2001), Holiday in the Sun (2001) and in the television series, So Little Time (2001–2002).\n\nThey became household names and popular figures in the preteen market during the late 1990s and early 2000s, with Mary-Kate's likeness seen in clothes, books, fragrances, magazines, movies, and posters, among others. There were fashion dolls of her made by Mattel from 2000 to 2005. They also starred in the films Getting There (2002), When in Rome (2002), The Challenge (2003) and made cameos in Charlie's Angels: Full Throttle (2003). In 2004, the twins appeared in their final and light-hearted romantic comedy film, New York Minute.\n\nThat same year upon their 18th birthday, both Mary-Kate and Ashley took control of Dualstar, becoming joint-CEOs and presidents of the company, which at the time had its merchandise being carried in over 3,000 stores in America and 5,300 stores worldwide.\n\nThese ventures, combined with an array of licensing deals for their names and likenesses, made Olsen wealthy at a young age. In 2004, Olsen's and her twin sister’s wealth was estimated at $137 million each.[10]\n\nRetirement [ edit ]\n\nOlsen's first solo acting appearance was in the movie Factory Girl (2006). Her one short scene was ultimately cut from theatrical release, but was included on the film's Unrated version on DVD and Blu-ray.\n\nIn 2007, she had a recurring role on television show, Weeds, and the twins said that if they became involved in movies together again, it would be as producers.[11][12]\n\nIn 2008, Olsen made a guest appearance on the ABC comedy Samantha Who? as a self-destructive girl that Samantha tries to help.[13] That same year, she also appeared in the film The Wackness. In 2011, Olsen appeared in the motion picture adaption of the Alex Flinn novel Beastly, which was her final acting project.[14][15]\n\nIn March 2012, both Mary-Kate and Ashley indicated their interest to retire as actresses in order to focus on their careers in fashion.[16] They felt that their futures were in fashion, not in acting and discussed wanting to open a store as one of their future fashion-based endeavors.[17]\n\nIn 2015, it was announced that John Stamos signed on with Netflix to produce and co-star in Fuller House, a spin-off of Full House that would reunite the original cast members for a 13-episode series. However, in May of that year, Mary-Kate and Ashley originally announced that they will not reprise their role as Michelle Tanner.[18] A month prior to the announcement, Nickelodeon acquired the rights to the twins' video library.[19]\n\nNet worth and influence [ edit ]\n\nIn 2007, Forbes ranked the twins jointly as the eleventh-richest women in entertainment, with an estimated combined net worth of $100 million.[20]\n\nFashion career [ edit ]\n\nCareer beginnings [ edit ]\n\nFollowing a high volume of public interest in their fashion choices, the Olsen twins began work in collaboration on a string of fashion lines available to the public. Starting as young girls, they started a clothing line in Wal-Mart stores across America for girls ages 4 to 14 as well as a beauty line called \"Mary-Kate and Ashley: Real fashion for real girls\".[21][better source needed]\n\nIn 2004, they made news by signing a pledge to allow all the workers that sew their line of clothing in Bangladesh full maternity leave. The National Labor Committee, which organized the pledge, later praised the twins for their commitment to worker rights.[22]\n\nBusiness [ edit ]\n\nAs adults, the Olsen twins have devoted much of their attention to the world of fashion. They head a designer fashion label, \"The Row,\" as well as \"Elizabeth and James\",[21] \"Olsenboye\", and \"StyleMint\"[23] retail collections. The idea for The Row started as a personal project in 2005 when her twin sister, Ashley Olsen, challenged herself to create a perfect T-shirt.[24] She tested the design on a variety of women of all body shapes and ages in an attempt to find a \"commonality in fit and attitude.\"[25]\n\nIn 2006, they were tapped as the faces of the upscale fashion line Badgley Mischka.[26] In 2008, the Olsen twins co-authored Influence, a book featuring interviews with fashion designers that have inspired the twins' fashion lines.[27]\n\nIn 2011, Mary-Kate and Ashley collaborated with TOMS Shoes to design footwear for kids without shoes in more than 20 countries worldwide.[28] That same year, the sisters designed an Olsenboye Change Purse and donated the money to \"Pennies From Heaven\".[29]\n\nIn October 2012, Ashley and Mary-Kate won the WSJ magazine Innovator of The Year Award.\n\nMary-Kate and Ashley released an Elizabeth and James perfume in Spring 2013.[30]\n\nMary-Kate's controversial fashion choices have often found her on both the best[31][32] and worst dressed fashion lists, particularly for her decision to wear fur.[33]\n\nShe and Ashley are members of the Council of Fashion Designers of America, CFDA[34] a not-for-profit trade association of over 450 prominent American fashion and accessory designers. The twins are now the creative directors for Superga.[35]\n\nEquestrian career [ edit ]\n\nOlsen began horseback riding in 1992 when she was six years old.[36] During her time at Campbell Hall, she was a member of the school's equestrian team.[37] After moving to New York to attend NYU, Olsen temporarily quit riding, but she eventually started again, stating \"I came back to the sport because I missed it every day that I wasn't riding. It was the hardest thing to leave and the hardest thing to come back to.\"[38] In 2013, her horse Marvelous, ridden by James Anderson, won the 38th Hampton Classic Horse Show.[39]\n\nOlsen is a competitive equestrian. She began riding in the Hampton Classic Horse Show in Bridgehampton, New York in 2013.[40] On September 17, 2016, she competed at The American Gold Cup in North Salem, New York.[41] In August–September 2017, she competed at the Hampton Classic Horse Show: on August 29, Olsen and her horse Dunotaire V finished in sixth place in the amateur owner jumper (1.20 meter) event;[40] and on September 1, she and Dunotaire V finished in third place in the amateur owner jumper classic event.[38] In September 2017, Olsen and her horse Feu d'Amour won The American Gold Cup.[42] She also has horses named Prem' Dollar Boy and Hertog Van't Merdehof.[42]\n\nIn 2018, Olsen and Dunotaire V ranked 7 out of 40 in a category at the Palm Beach Masters in Wellington, Florida.[42] In May 2019, Olsen competed at the Longines Global Champions Tour in Madrid, Spain; she and her horse Naomi finished in sixth place in their event, while she and her horse Fatum were disqualified from their event due to an \"error of course\".[43] On July 12, 2019, Olsen and Fatum won a 1.25m two-phase showjumping class at the Longines Global Champions Tour in Chantilly, France.[44] In September 2021, she competed at the Longines Global Champions Tour in Rome, Italy: on September 16, she and her horse Iowa Van Het Polderhof finished in second place in the 2 Phases Special event;[45] and on September 18, Olsen and Dunotaire V finished in third place in an Against the Clock No Jump Off event.[46]\n\nWritings [ edit ]\n\nIn 2008, Mary-Kate and Ashley released their book Influence.[47]\n\nPersonal life [ edit ]\n\nRelationships [ edit ]\n\nOlsen has dated David Katzenberg (son of DreamWorks cofounder Jeffrey Katzenberg),[48] photographer Maxwell Snow,[49] and artist Nate Lowman.[50]\n\nIn May 2012, Olsen began a relationship with Olivier Sarkozy, half-brother of former French president Nicolas Sarkozy.[51] In March 2014, photos were published showing Olsen wearing what appeared to be an engagement ring.[52] Olsen and Sarkozy were married on November 27, 2015, at a private residence in New York City.[53] On April 17, 2020, Olsen filed for divorce from Sarkozy.[54][55] On May 13, she filed an emergency order to proceed despite delays due to the COVID-19 pandemic.[56][57] The emergency order was denied a day later.[56][57] On January 25, 2021, the divorce was finalized.[58]\n\nHealth issues [ edit ]\n\nIn 2004, shortly after graduating from high school, Olsen announced she had entered treatment for anorexia nervosa.[59] A Got Milk? advertisement featuring the twins was pulled following the announcement.[60][61] On November 20, 2007, she was hospitalized for a reported kidney infection.[62]\n\nDeath of Heath Ledger [ edit ]\n\nOlsen was a close friend of late actor Heath Ledger.[63][64] After discovering Ledger unconscious in his bed on January 22, 2008, his massage therapist called Olsen twice before contacting police. Olsen sent a private security guard to the scene.[65]\n\nResponding to a claim by an anonymous law enforcement official that she would not speak to federal investigators without a promise of legal immunity, Olsen's attorney Michael C. Miller said, \"We have provided the government with relevant information including facts in the chronology of events surrounding Mr. Ledger's death and the fact that Ms. Olsen does not know the source of the drugs Mr. Ledger consumed\".[66]\n\nFilmography [ edit ]\n\nTelevision Year Title Role Notes 2007 Weeds Tara Lindman Recurring role (Season 3) 2008 Samantha Who? Natalie Episode: \"Help!\"\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Mary-Kate_Olsen_2011_Shankbone.jpg/1200px-Mary-Kate_Olsen_2011_Shankbone.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Mary-Kate_Olsen_2011_Shankbone.jpg/220px-Mary-Kate_Olsen_2011_Shankbone.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Mary-Kate_Olsen_2011_Shankbone.jpg/1200px-Mary-Kate_Olsen_2011_Shankbone.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Mary-Kate_Olsen", "title": "Mary-Kate Olsen", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Mary-Kate_Olsen_2011_Shankbone.jpg/640px-Mary-Kate_Olsen_2011_Shankbone.jpg", "width": 640, "height": 918}, "title": "Mary-Kate Olsen - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}