{"url": "https://pitchfork.com/features/lists-and-guides/the-story-of-girl-groups-in-45-songs/", "text": "Kick Your Game: A Conversation with TLC\n\nPitchfork: Next year is the 25th anniversary of CrazySexyCool. In that time period, do you think it’s become any easier for women in the music industry to be independent, both artistically and financially?\n\nRozonda “Chilli” Thomas: Women have more of a voice now. I think it was definitely harder before we came out and during the time that we came out. You had to fight a lot harder to make sure your voice was heard. We kicked down a lot of doors. It makes us feel really good when we hear someone like Lady Gaga thank us for paving the way for them. I definitely think that it’s different and the struggle is not over, but not the same.\n\nSo much about TLC broke the girl group formula, but there are also aspects of your music that fall into the girl group history: harmonies, choreography, a sense of unity. Did you see yourself as fitting into that lineage when you were forming TLC?\n\nTionne “T-Boz” Watkins: I don’t think we had girl groups on our minds at that time. I didn’t know if I wanted to be in a group or just be an artist, period… But growing up [performing] in a band with my family, my mother and my father singing, of course I knew about the Ronettes. Patti LaBelle was one of my mom’s favorite singers. The Supremes, I loved them. But honestly, it wasn’t until I was put in the situation of a group that I started paying attention to the dynamics of being with girls, because I never got along with women growing up. I was like, “Uh oh, is this gonna be super hard for me?” Then I started paying attention to groups.\n\nDid you ever sing girl group music growing up?\n\nT-Boz: Oh, yeah. [singing] “Wait a minute, Mister Postman!” Of course. Even that song that’s out now [“Feel It Still” by Portugal, the Man] sounds just like it and it’s a major hit. When you hear something familiar to your ear that was already a hit, you don’t know why you like it, you’re just drawn to it. And I think that’s why that single did so well, because it was a classic from the Marvelettes.\n\nWomen’s self-esteem has always been a big topic for TLC, from “Unpretty” through your more recent song “Perfect Girls.” Do you have any thoughts on this now, in the age of Instagram?\n\nT-Boz: Social media has made it to where young girls are striving to be something that’s not real. They have all these apps and filters where you can adjust your body shape. So I just want the younger generation to understand: None of us are perfect. We all have flaws. I just wish people would be more forthcoming about that. It cracks me up when you see somebody with a clearly fake booty; you wanna lie and say you was doing squats and you got on a push-up bra? Come on, man. Just say, “I got some injections in my lips. I got cheekbones. I got a butt ’cause I didn’t like mine being flat,” and keep it moving.\n\nChilli: It’s the deceitful part that makes it not okay. Nobody has this super-smooth everything from your head to your toenails.\n\nT-Boz, I know you have a teenage daughter and a younger son. And Chilli, you have an older son and you founded Chilli’s Crew, an Atlanta nonprofit for disadvantaged teen girls. What are you trying to teach your daughter and your program girls today about how to live in this world?\n\nT-Boz: My daughter understands how to respect herself. She’s been knowing that since she could talk. I’ve heard her even tell her friends about how they should respect themselves. And I don’t have to worry about nobody else raising my child, because I do. I’m secure in knowing that I’ve done my job as a parent and she’s not looking to Instagram to raise her.\n\nChilli: It’s sad because a lot of those girls [in Chilli’s Crew] are in group homes and they have a lot of challenges. I tell them to tell themselves,“I’m not going to allow these circumstances to be the reason that I can’t be successful.” You don’t always have to be a product of your environment…. And with my son, I’m just raising him to not be the average dude. That would not be acceptable to me. I’m teaching him to be respectful not only to women but to adults. I tell him,“I don’t care how old you become, I’m always gonna be older, so you’re never gonna be my equal.”", "images": ["https://cdn.pitchfork.com/longform/782/the%20shirelles%20_Will%20You%20Love%20Me%20Tomorrow_.jpg", "https://cdn.pitchfork.com/longform/782/The-Bobbettes.jpg", "https://cdn4.pitchfork.com/longform/782/GirlGroups.jpg", "https://cdn.pitchfork.com/longform/782/The%20Chantels%20_maybe_.jpg", "https://cdn.pitchfork.com/longform/782/15%20The%20Primettes%20_pretty%20baby_.jpg", "https://media.pitchfork.com/photos/5b3651720e04ca4ea852e76d/2:1/w_790/GirlGroups.jpg", "https://cdn.pitchfork.com/longform/782/13%20The%20Marvelettes%20_Please%20Mr.%20Postman_.jpg", "https://cdn.pitchfork.com/longform/782/18%20The%20Crystals_He%20Hit%20Me%20And%20It%20Felt%20Like%20a%20Kiss.jpg", "https://cdn4.pitchfork.com/longform/782/05%20The%20Andrews%20Sister_Boogie%20Woogie%20Bugle%20Boy.jpg", "https://cdn3.pitchfork.com/longform/782/GirlGroups_TLC_Inline.jpg", "https://cdn4.pitchfork.com/longform/782/03%20The%20Crystals_He_s%20a%20Rebel.jpg", "https://cdn2.pitchfork.com/longform/782/The-Cookies-Chains.jpg"], "top_img": "https://media.pitchfork.com/photos/5b3651720e04ca4ea852e76d/2:1/w_790/GirlGroups.jpg", "keywords": [], "authors": [], "canonical_link": "https://pitchfork.com/features/lists-and-guides/the-story-of-girl-groups-in-45-songs/", "title": "The Story of Girl Groups in 45 Songs", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no", "og": {"site_name": "Pitchfork", "url": "https://pitchfork.com/features/lists-and-guides/the-story-of-girl-groups-in-45-songs/", "title": "The Story of Girl Groups in 45 Songs", "description": "Starring the Supremes, TLC, the Ronettes, Destiny's Child, and more", "type": "article", "image": "https://media.pitchfork.com/photos/5b3651720e04ca4ea852e76d/2:1/w_790/GirlGroups.jpg"}, "description": "Starring the Supremes, TLC, the Ronettes, Destiny's Child, and more", "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "site": "@pitchfork", "title": "The Story of Girl Groups in 45 Songs", "description": "Starring the Supremes, TLC, the Ronettes, Destiny's Child, and more", "image": "https://media.pitchfork.com/photos/5b3651720e04ca4ea852e76d/2:1/w_790/GirlGroups.jpg"}, "keywords": "The Shangri-Las,The Emotions,The Crystals,The Andrews Sisters,The Dixie Cups,The Supremes,The Pointer Sisters,TLC,Labelle,En Vogue", "news_keywords": "The Shangri-Las,The Emotions,The Crystals,The Andrews Sisters,The Dixie Cups,The Supremes,The Pointer Sisters,TLC,Labelle,En Vogue", "msvalidate.01": "2E96EF3F0014FF765EEE9A9CE8B22E64", "fb": {"app_id": 207089362687909, "pages": 28015075999}}, "movies": [], "publish_date": null, "source": "https://pitchfork.com", "summary": ""}