{"url": "www.washingtonpost.com/news/early-lead/wp/2017/07/14/ryan-lochte-cleared-of-false-report-charge-after-incident-at-rio-olympics/", "text": "Gift Article Share\n\nAn appellate court in Brazil ruled Friday that the case against Ryan Lochte should be dismissed. The U.S. swimmer had been accused of fabricating a story about getting robbed at gunpoint in Rio de Janeiro during August’s Olympics, causing an international scandal that drew in some of his teammates. Wp Get the full experience. Choose your plan ArrowRight Lochte was charged with a false crime report, which could have resulted in a sentence of one to six months in jail, although he would have been unlikely to serve it. The 12-time Olympic medalist returned to the United States before the Games ended and the charge was filed, but he was given a 10-month suspension by USA Swimming for his behavior in Rio.\n\nAccording to USA Today, the court concluded that Lochte, who eventually admitted he “over-exaggerated” the story and apologized for his “immature behavior,” did not break Brazilian law. The three-judge panel, in a 2-1 ruling, noted that Rio police, not Lochte, had initiated the investigation and that the story he first told NBC did not meet the standard of a false report.\n\nAdvertisement\n\nProsecutors could still challenge the ruling, and they have 15 days to do so. Lochte’s lawyers have been pressing for a dismissal of the case, but a lower court had ruled 2-1 to uphold the charge.\n\n“We are pleased that the court has finally dismissed the criminal prosecution against Mr. Lochte, while at the same time, appropriately recognizing that he committed no crime,” Jeff Ostrow, a Florida-based attorney for Lochte, told USA Today. “It has been a long year, but in the end, justice prevailed.”\n\nLochte had said that he and three other U.S. swimmers, Jimmy Feigen, Gunnar Bentz and Jack Conger, were on their way back to the Olympic Village from a party when their car was pulled over by gun-toting robbers pretending to be police officers. Citing surveillance video footage and eyewitness accounts, Brazilian authorities claimed that Lochte and his teammates vandalized and urinated on a gas station, after which security guards pointed a gun at them and demanded recompense before they left.\n\nAdvertisement\n\nLochte subsequently said that he “definitely had too much to drink” that night, adding that he was still intoxicated when he provided false details to NBC’s Billy Bush the day after the incident. While he was able to leave Brazil quickly, his three teammates were detained, with Feigen agreeing to pay a fine of nearly $11,000 to expedite his departure.\n\nIn the wake of the firestorm, which overshadowed the second week of the Olympics, Lochte lost several sponsors. His suspension left him unable to compete at last month’s U.S. nationals, making him ineligible for the world championships later this month in Budapest.\n\nThe notoriety Lochte earned from the incident resurfaced at the ESPY awards this week, when host Peyton Manning joked that last year’s host, professional wrestler John Cena, “is an athlete the same way that Ryan Lochte is a reliable witness.”\n\nLochte’s suspension ended on July 1, and he had planned on competing this week at the Los Angeles Invitational, but he pulled out, citing the birth last month of his first child. The 32-year-old has said he wants to return to top-level competitions, though, and represent the U.S. at the 2020 Olympics in Tokyo.\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/Wires/Images/2017-07-12/AP/Lochte_Return_Swimming_75668-5e35d.jpg&w=1440"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/Wires/Images/2017-07-12/AP/Lochte_Return_Swimming_75668-5e35d.jpg&w=1440", "keywords": [], "authors": ["Des Bieler"], "canonical_link": "https://www.washingtonpost.com/news/early-lead/wp/2017/07/14/ryan-lochte-cleared-of-false-report-charge-after-incident-at-rio-olympics/", "title": "Ryan Lochte cleared of false-report charge after incident at Rio Olympics", "meta_data": {"description": "The U.S. swimmer had caused a firestorm at the Rio Olympics with a tale of getting robbed at gunpoint that he later admitted he had “over-exaggerated.”", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/early-lead/wp/2017/07/14/ryan-lochte-cleared-of-false-report-charge-after-incident-at-rio-olympics/", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/Wires/Images/2017-07-12/AP/Lochte_Return_Swimming_75668-5e35d.jpg&w=1440", "title": "Ryan Lochte cleared of false-report charge after incident at Rio Olympics", "description": "The U.S. swimmer had caused a firestorm at the Rio Olympics with a tale of getting robbed at gunpoint that he later admitted he had “over-exaggerated.”"}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Ryan Lochte cleared of false-report charge after incident at Rio Olympics", "description": "The U.S. swimmer had caused a firestorm at the Rio Olympics with a tale of getting robbed at gunpoint that he later admitted he had “over-exaggerated.”"}, "last_updated_date": "2021-11-27T06:55:31.818Z", "article": {"published_time": "2017-07-15T03:35:17.000Z", "modified_time": "2021-11-27T06:55:31.818Z", "section": "Sports", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 70, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/news/early-lead/wp/2017/07/14/ryan-lochte-cleared-of-false-report-charge-after-incident-at-rio-olympics/"}, "movies": [], "publish_date": 1499986800.0, "source": "http://www.washingtonpost.com", "summary": ""}