{"url": "https://web.archive.org/web/20171110162711/https://www.forbes.com/sites/hughmcintyre/2017/11/10/taylor-swifts-lack-of-promotion-around-reputation-highlights-how-powerful-she-really-is/", "text": "By now, you’ve probably heard that Taylor Swift’s new album Reputation is out on Friday, November 10 (how could you have avoided it). With only a few days to go before it is finally unleashed, one might assume that the country-turned-pop singer would be frantically bouncing from event to event and media appearance to media appearance, as is the case with most artists, but that’s not what she’s doing. In fact, Swift has taken the opposite approach, and she’s been surprisingly quiet.\n\nSince first kicking off this latest era of her career in late August, Swift has been nearly silent when it comes to the media. She hasn’t done interviews, she hasn’t appeared on any late night programs, she hasn’t showed up on Good Morning America or its competitors and she hasn’t even stolen the show at any recent award shows to showcase her latest singles (though she is slated to be the musical guest on Saturday Night Live the day after her album drops).\n\nAlmost every other musician would have their team working on overdrive to snag them every opportunity possible. Any interview, red carpet, any performance...any possibility to be on camera or in front of a large crowd is to be treasured, and anything that gets their face, name, and if possible, their music out there could help them rack up sales and streams of their latest offering in the extremely important first week, and it’s well-known that the weeks before the record is finally unleashed and the few days following are some of the most important in the entire campaign.\n\nInstead of covering magazines and giving exclusive televised on-camera interviews, Swift has kept her outreach limited to her social media channels, where she is the queen, and where everything she says is the gospel truth. She is smart enough to know that much of what she tweets or shares on Instagram (she has a combined 190 million followers between the two platforms) will end up as a headline on hundreds of blogs and digital outlets, and this way, she gets to control the message and the imagery completely.\n\nBeyond that, she’s let the music speak for itself, which I’m willing to bet most musicians wish they could do. She’s already released four songs—“Look What You Made Me Do,” “...Ready For It?,” “Gorgeous” and “Call It What You Want”—and three of them have thus far peaked inside the top 15 on the Hot 100. The first two tracks, now the two official singles taken from the release, also have proper visual treatments, while the other two have been promoted with popular lyric videos. Either way, Swift is yet again in charge of what the people see and hear, which is how she likes things.\n\nOnly a handful of artists on the planet are big enough to even attempt a strategy like this and still make it to No. 1, but even some of them don’t try. When she was promoting her third album 25, which was always going to be a chart-topper, Adele still made the rounds and stuck to fairly traditional methods of getting the word out there, and it led to her moving more than three million units in her first week, breaking the record for the biggest opening for an album.\n\nSwift might not have a shot at besting Adele’s massive start, but she’s destined for a huge first frame, and despite her lack of promotion, Reputation looks like it’s already on track to score the biggest opening week of 2017, and it could end up being one of the largest of all time. Swift let the media do the heavy lifting here, while she sat back and watched the world eat up whatever she shared.", "images": ["https://web.archive.org/web/20171110162711im_/https://specials-images.forbesimg.com/imageserve/488990904/960x0.jpg?fit=scale", "https://web.archive.org/web/20171110162711im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F488990904%2F960x0.jpg%3Ffit%3Dscale", "https://web.archive.org/web/20171110162711im_/https://secure.gravatar.com/avatar/853c59789c520784fcfecc68c6c34217?s=400&d=mm&r=g", "https://web.archive.org/web/20171110162711im_/https://specials-images.forbesimg.com/imageserve/5914a7594bbe6f6c4b152c11/400x400.jpg?fit=scale&background=000000"], "top_img": "https://web.archive.org/web/20171110162711im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F488990904%2F960x0.jpg%3Ffit%3Dscale", "keywords": [], "authors": ["Hugh Mcintyre"], "canonical_link": "https://web.archive.org/web/20171110162711/https://www.forbes.com/sites/hughmcintyre/2017/11/10/taylor-swifts-lack-of-promotion-around-reputation-highlights-how-powerful-she-really-is/", "title": "Taylor Swift's Lack Of Promotion Around 'Reputation' Highlights How Powerful She Really Is", "meta_data": {"viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "Taylor Swift's Lack Of Promotion Around 'Reputation' Highlights How Powerful She Really Is", "image": "https://web.archive.org/web/20171110162711im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F488990904%2F960x0.jpg%3Ffit%3Dscale", "updated_time": "2017-11-09T08:45:03-05:00", "url": "https://web.archive.org/web/20171110162711/https://www.forbes.com/sites/hughmcintyre/2017/11/10/taylor-swifts-lack-of-promotion-around-reputation-highlights-how-powerful-she-really-is/", "description": "Despite the fact that she's about to release one of the biggest albums in recent memory, Swift has been oddly quiet recently.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "Taylor Swift's Lack Of Promotion Around 'Reputation' Highlights How Powerful She Really Is", "description": "Despite the fact that she's about to release one of the biggest albums in recent memory, Swift has been oddly quiet recently.", "image": "https://web.archive.org/web/20171110162711im_/https://thumbor.forbes.com/thumbor/600x300/smart/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F488990904%2F960x0.jpg%3Ffit%3Dscale", "creator": "@hughmcintyre"}, "description": "Despite the fact that she's about to release one of the biggest albums in recent memory, Swift has been oddly quiet recently.", "author": "Hugh McIntyre", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Hugh McIntyre", "section": "Business", "section_url": "https://www.forbes.com/business/", "id": "blogAndPostId/blog/post/3113-23886", "published": "2017-11-10", "modified": "2017-11-09"}}, "movies": [], "publish_date": 1510272000.0, "source": "https://web.archive.org", "summary": ""}