{"url": "http://www.parkerxl.com/celebs-who-actually-took-a-fashion-risk-at-the-2017-emmys/", "text": "The perfect and worst dressed stars have already been named, however extra type accolades want distributing. For example, let’s reward the celebs who truly took an opportunity, who ventured away from the standard mermaid robes and black fits, who stored us alive with opinions whether or not good or dangerous. It may be daunting getting dressed for such a excessive-profile event—most celebs do what’s protected with a view to keep away from criticism. So, for the danger-takers on the pink carpet Sunday night time, we applaud you.\n\nThe 2017 Emmys has come to an finish, however probably the most daring style will stay on.\n\nHold scrolling for 2017 Emmys’ largest style danger-takers, from Reese Witherspoon to Leslie Jones.\n\nRichard Shotwell/Invision/AP Reese Witherspoon\n\nThe Massive Little Lies star was an enormous winner of the night time, for her position within the present and as an government producer. Whereas Reese’s Stella McCartney tuxedo gown and matching Christian Louboutin pumps appeared like protected decisions, the ensemble was an enormous departure from her extremely-female, physique-hugging robes of Emmys’ previous. She confirmed as much as the purple carpet making a method assertion: “I am not just a few fairly Hollywood actress; I am a boss.” Her males’s-impressed piece stated all of it, and we listened.\n\nFrazer Harrison/Getty Pictures Titus Burgess\n\nMellow, this isn’t. The Unbreakable Kimmy Schmidt star turned heads in a mustard-yellow jacket that checked out each occasions luxe and enjoyable. Cheers to extra males taking a trend danger on the purple carpet!\n\nJohn Shearer/WireImage Evan Rachel Wooden\n\nThere isn’t any greater trend danger-taker in Hollywood than the Westworld actress. You’ll by no means discover her in only a fairly, match-and-flare gown, so when Evan confirmed as much as the Emmys in an all-white, three-piece Moschino go well with, we have been completely enthralled. Not solely did she channel main circus ringmaster vibes with stylish execution, however, truthfully, have you learnt how onerous it’s to tug off all white? Brava!\n\nFrazer Harrison/Getty Photographs Lena Waithe\n\nThe Emmy winner appeared like a golden statue in a brocade tuxedo jacket, proving you do not have to put on a metallic gown to get consideration.\n\nJ. Merritt/Getty Photographs Claire Foy\n\nPants on an Emmys pink carpet all the time deserve consideration. It is 2017—however for some purpose, glamorous robes and fairly clothes are nonetheless main indicators of femininity. Properly, not for The Crown actress, who confirmed everybody how regal you possibly can look in a jewel-encrusted Oscar de la Renta jumpsuit and Harry Winston jewels. We gotta say: The over-the-shoulder practice was fairly majestic.\n\nFrazer Harrison/Getty Pictures Leslie Jones\n\nSlay, woman, slay! A horny, see-via, black gown on a pink carpet? Been there, completed that…besides on the comic, which makes her look within the Christian Siriano robe so refreshing. Leslie, who’s extra recognized for comedic timing than as a style plate, proved you might be humorous and ooze intercourse attraction. It is all about confidence.\n\nJohn Shearer/WireImage Viola Davis\n\nOrange you so pleased Viola wore such a cheerful colour on the pink carpet. OK, perhaps not so humorous joke, however the Easy methods to Get Away With Homicide star stood aside from the black and sequins pack in her Zac Posen frock.\n\nFrazer Harrison/Getty Photographs MacKenzie Davis\n\nThe Canadian actress deserves applause for being the one star sporting such a vibrant, electrical colour. Sporting highlighter inexperienced is a daring selection, particularly in the event you’re not operating at night time or on a bicycle, however MacKenzie appeared assured within the tied Delpozo quantity. The fuschia, gem-encrusted heels pushed the bounds even additional.\n\nKevin Mazur/WireImage Cicely Tyson\n\nAll the things about this ensemble says style danger-taker. Depart it to the Hollywood veteran to set the bar. Not solely did the ninety two-yr-previous actress put on vibrant pink from head to toe, however the slit sleeves, exaggerated lapel and round bag might make a press release by itself. The perfect factor about this outfit? Cicely’s smile.", "images": ["https://parkerxl.com/wp-content/uploads/2015/06/logo-mycmora.png", "https://parkerxl.com/wp-content/uploads/2020/04/photo_2020-04-27_16-01-50-125x125.jpg", "https://parkerxl.com/wp-content/uploads/2017/10/rs_634x1024-170917170107-634-Emmys-reese-witherspoon.cm.91717.jpg", "https://parkerxl.com/wp-content/uploads/2017/10/rs_634x1024-171025184542-634-Uriah-Shelton-mv-102517.jpg", "https://parkerxl.com/wp-content/uploads/2017/10/rs_1024x759-170817173935-1024.Cynthia-bailey-Glasses.jpg", "https://parkerxl.com/wp-content/uploads/2020/05/ParkerXL.png"], "top_img": "https://parkerxl.com/wp-content/uploads/2017/10/rs_634x1024-170917170107-634-Emmys-reese-witherspoon.cm.91717.jpg", "keywords": [], "authors": [], "canonical_link": "https://parkerxl.com/celebs-who-actually-took-a-fashion-risk-at-the-2017-emmys/", "title": "Celebs Who Actually Took a Fashion Risk at the 2017 Emmys", "meta_data": {"description": "Lifestyle And Fashion Magazine From Parker XL, Get Daily Reports On Trends And Self Help.", "og": {"image": {"identifier": "https://parkerxl.com/wp-content/uploads/2017/10/rs_634x1024-170917170107-634-Emmys-reese-witherspoon.cm.91717.jpg", "width": 634, "height": 1024}, "url": "https://parkerxl.com/celebs-who-actually-took-a-fashion-risk-at-the-2017-emmys/", "type": "article", "title": "Celebs Who Actually Took a Fashion Risk at the 2017 Emmys - Parker XL | Lifestyle & Fashion", "description": "Lifestyle And Fashion Magazine From Parker XL, Get Daily Reports On Trends And Self Help.", "locale": "en_US", "site_name": "Parker XL | Lifestyle & Fashion", "updated_time": "2017-10-25T21:43:14+00:00"}, "robots": "index, follow", "format-detection": "telephone=no", "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "article": {"section": "mainheader", "published_time": "2017-10-25T21:43:12+00:00", "modified_time": "2017-10-25T21:43:14+00:00", "publisher": "https://www.facebook.com/parkerxl/"}, "googlebot": "index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1", "bingbot": "index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1", "twitter": {"card": "summary", "creator": "@RealParkerXL", "site": "@RealParkerXL"}, "generator": "Powered by Slider Revolution 6.2.6 - responsive, Mobile-Friendly Slider Plugin for WordPress with comfortable drag and drop interface.", "msapplication-TileImage": "https://parkerxl.com/wp-content/uploads/2015/11/66416_Parker_XL_logo_01-e1461634559462.png"}, "movies": [], "publish_date": 1508967792.0, "source": "http://www.parkerxl.com", "summary": ""}