{"url": "www.inquisitr.com/3995404/does-kristen-stewart-stink/", "text": "Does Twilight star Kristen Stewart stink? Unfortunately, the actress has recently been slammed by tabloids for her poor hygiene and her putrid body odor. Is there any truth to this latest celebrity slam?\n\nA quick search of Google will reveal a story by Hollywood Life from seven years ago which claims part of the reason why Robert Pattinson and Kristen Stewart made such a great couple is because they both had poor hygiene and rank body odor. Digging a little deeper into the sources used for the story, however, you will find a second story which claims that while Kristen's ex Robert looks a little rough around the edges at time – he doesn't have a funky smell.\n\nIn fact, the sources in the story claiming Robert and Kristen smell bad note Pattinson wasn't too pleased with the circulating rumor that he had a body odor problem.\n\nSo, is what tabloids are saying about Kristen Stewart true? Does she stink? Gossip Cop caught wind of the story roughly three hours after tabloids began to slam the Twilight actress for her putrid body odor.\n\nTabloids have begun to claim that Kristen Stewart has an \"overwhelming\" body odor. The tabloids go on to claim that insiders who worked close to the actress noted that she didn't shower regularly and that was the main reason why she smelled so bad.\n\nThe tabloids which are currently slamming the actress for having an \"overwhelming stink\" speculates Kristen has a \"glam squad\" that does such a good job cleaning her up so she looks great for the camera that her fans would never suspect she stinks.\n\nGossip Cop, however, claims this is nothing more than a \"ridiculous tabloid report\" and describes the rumor as \"nonsense.\" The inside source the tabloids claim to have received this information was quoted saying Stewart will \"go weeks\" without washing her hair. There, however, is no way of knowing whether or not this inside source actually exists.", "images": ["https://imgb.srgcdn.com/c2fbdf24-a0a4-40f9-ad23-b0cb57bf8766.jpg", "https://imgb.srgcdn.com/d258d2ec-e52b-4489-9950-908cc366bacf.jpg", "https://secure.gravatar.com/avatar/7f0bcb1a7b8778e2f34be683ed39af06?s=800", "https://imgb.srgcdn.com/fe42e24b-1fa1-4cf2-b7ef-0bcd25a6f5c9.png", "https://imgb.srgcdn.com/1740626a-9ecf-4723-b66a-d7ca5e1d678c.jpg", "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "https://imgb.srgcdn.com/a5ba8e20-c5b5-4c82-ae2b-4f343261a07b.jpg", "https://imgb.srgcdn.com/6977b3f9-ffc5-44c5-866c-e80c13668077.jpg"], "top_img": "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.inquisitr.com/3995404/does-kristen-stewart-stink/", "title": "Does Kristen Stewart Stink? Actress Slammed By Tabloids With False Rumor", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimal-ui, user-scalable=no", "msapplication-TileImage": "/static/inquisitr/favicon-128x128.png", "robots": "max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Does Kristen Stewart Stink? Actress Slammed By Tabloids With False Rumor", "url": "https://www.inquisitr.com/3995404/does-kristen-stewart-stink/", "site_name": "The Inquisitr", "description": "Does Kristen Stewart Stink? Actress Slammed By Tabloids With False Rumor", "updated_time": "2021-08-16 18:13:43Z"}, "article": {"modified_time": "2021-08-16 18:13:43Z", "published_time": "2017-02-19 16:10:53Z", "section": "Rumors"}, "description": "Does Kristen Stewart Stink? Actress Slammed By Tabloids With False Rumor", "keywords": "Rumors", "twitter": {"card": "summary_large_image"}}, "movies": [], "publish_date": 1487520653.0, "source": "http://www.inquisitr.com", "summary": ""}