{"url": "http://diffuser.fm/chester-bennington-chris-cornell-friendship/", "text": "Professional peers and musical collaborators as well as close friends, Chester Bennington and Chris Cornell shared a bond beyond the stage — and one that has taken on a poignant weight in the wake of Bennington's apparent suicide on what would have been Cornell's 53rd birthday.\n\nWhile the duo didn't work together often, they shared the stage when Cornell toured with Bennington's band Linkin Park in 2007 — and again the following year, when Cornell and Linkin Park headed up the Projekt Revolution package tour. As Cornell told Rolling Stone at the time, one of the joys of being on the road with the band was watching Bennington's intense dedication as a performer.\n\n\"When we toured Australia, Chester broke his wrist on like, the third song and then finished the whole set with a broken wrist,\" recalled Cornell. \"That kind of dedication and passion, like, 'This is what I'm doing, this is the most important thing there is, I'm onstage right now.' That affects me.\"\n\n\"I'm such a fan I think that's the most important aspect of why I do what I do and how I do it. I've got to play with a lot of guys that I've grown up loving; I get to sing on stage with Chris Cornell,\" added Bennington. \"I'm just like, 'What world do I live in? 'Cause this can't be real.'\"\n\nThe two frontmen shared a fondness for similarly dynamic approaches to music, but they had personal similarities, too — not least their separate struggles with addiction, which they'd both discussed openly in an effort to help others. In the wake of Cornell's passing earlier this year, his family and fans speculated regarding the role prescription medication may have played in his suicide; given the close similarities between Cornell and Bennington's deaths, similar questions are likely to follow Bennington's passing.\n\nWhatever led to Bennington's death, it's clear he was profoundly shaken when Cornell ended his life. In an open letter posted after the news of Cornell's death broke, Bennington wrote that he woke up with the Beatles' \"Rocky Raccoon\" in his head the morning he heard the news, and wondered whether it was a subconscious or supernatural reflection of Cornell's absence.\n\n\"I’m still weeping, with sadness, as well as gratitude for having shared some very special moments with you and your beautiful family. You have inspired me in many ways you could never have known. Your talent was pure and unrivaled. Your voice was joy and pain, anger and forgiveness, love and heartache all wrapped up into one. I suppose that’s what we all are,\" wrote Bennington. \"You helped me understand that. I just watched a video of you singing ‘A Day in the Life' by the Beatles and thought of my dream. I’d like to think you were saying goodbye in your own way. I can’t imagine a world without you in it. I pray you find peace in the next life. I send my love to your wife and children, friends and family. Thank you for allowing me to be a part of your life.\"\n\nLooking back on the days after Cornell's death, Bennington's fellow Linkin Park co-founder Mike Shinoda recalled the band's performance of its new song \"One More Light\" — a song he described as being \"about the loss of a friend\" — in tribute to Cornell. Although it wasn't being promoted as the single from their latest LP, and Bennington \"just couldn't finish the song\" when they played it, Shinoda reaffirmed the value of its message — now more than ever.\n\n\"One of the things I think you can do is reach out to people and offer them community, let them know we’re a family, we’re community, we care about each other,\" said Shinoda. \"Whether a friend who lost somebody, a family member or whatever, to reach out and let them know even that you’re thinking about them, sometimes that’s enough.\"\n\nWatch Linkin Park and Chris Cornell Perform \"Crawling / HHH\"", "images": ["http://townsquare.media/site/443/files/2018/04/diffuser-high-rez.png", "https://townsquare.media/site/443/files/2017/07/Screen-Shot-2017-07-21-at-9.41.39-AM.jpg?w=1200&h=0&zc=1&s=0&a=t&q=89"], "top_img": "https://townsquare.media/site/443/files/2017/07/Screen-Shot-2017-07-21-at-9.41.39-AM.jpg?w=1200&h=0&zc=1&s=0&a=t&q=89", "keywords": [], "authors": ["Diffuser Staff"], "canonical_link": "https://diffuser.fm/chester-bennington-chris-cornell-friendship/", "title": "Inside the Close Friendship Between Chester Bennington and Chris Cornell", "meta_data": {"instagram_profile": "diffuserfm", "description": "Professional peers and musical collaborators as well as close friends, Chester Bennington and Chris Cornell shared a bond beyond the stage.", "keywords": "chris cornell chester bennington friendship,news", "fb": {"app_id": 322042254510234, "admins": 581803834, "pages": 318447131511500}, "og": {"title": "Inside the Close Friendship Between Chester Bennington and Chris Cornell", "description": "Professional peers and musical collaborators as well as close friends, Chester Bennington and Chris Cornell shared a bond beyond the stage.", "url": "https://diffuser.fm/chester-bennington-chris-cornell-friendship/", "site_name": "Diffuser.fm", "type": "article", "image": {"identifier": "https://townsquare.media/site/443/files/2017/07/Screen-Shot-2017-07-21-at-9.41.39-AM.jpg?w=1200&h=0&zc=1&s=0&a=t&q=89", "width": 1200, "height": 630}}, "twitter": {"card": "summary_large_image", "site": "@diffuserfm"}, "sailthru.description": "Professional peers and musical collaborators as well as close friends, Chester Bennington and Chris Cornell shared a bond beyond the stage.", "sailthru.date": "2017-07-21 13:48:54", "sailthru.title": "Inside the Close Friendship Between Chester Bennington and Chris Cornell", "sailthru.tags": "tsmsite-diffuser, tsmmarket-national, tsmtype-national, chester-bennington, chris-cornell, news", "sailthru.author": "diffuser", "sailthru.image.full": "https://townsquare.media/site/443/files/2017/07/Screen-Shot-2017-07-21-at-9.41.39-AM.jpg", "sailthru.image.thumb": "https://townsquare.media/site/443/files/2017/07/Screen-Shot-2017-07-21-at-9.41.39-AM.jpg", "google-site-verification": "QimE0-TSO-bEIzf2TwBYpzYIbPzcvhiowdXP5urhnes", "msvalidate.01": "38FB0DB5D97FA0CEE1853CB708082BF1", "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1500641334.0, "source": "http://diffuser.fm", "summary": ""}