{"url": "https://www.nbcnews.com/storyline/sexual-misconduct/r-kelly-addresses-sexual-assault-allegations-19-minute-song-i-n893776", "text": "NEW YORK — R. Kelly sings about his troubles and battles in a new 19-minute song, addressing sexual abuse claims against him that have put a screeching halt on his career.\n\nThe song, \"I Admit,\" was posted to Soundcloud on Monday. The track begins with the lyrics, \"I admit I have made some mistakes/And I have some imperfect ways.\"\n\nR. Kelly, whose real name is Robert Sylvester Kelly, gets personal throughout the track, singing that he likes \"all the ladies, that's both older and young ladies,\" following it up with: \"But tell me how they call it pedophile because that (expletive) is crazy.\"\n\nThe embattled entertainer has long been accused of behavior that has ranged from questionable to criminal. He was accused of child pornography after a widely circulated videotape appeared to show him having sex with, and urinating on, a teenage girl. He was acquitted of all charges in 2008 and continued to rack up hits and sell out stadiums around the country.\n\nOn \"I Admit,\" he sings that he's \"not convicted, not arrested, dragged my name in the dirt/All this work to be successful, when you abandon me 'cause of what you heard.\"\n\nR. Kelly is one of pop music's best-selling artists and his hits include \"Ignition,\" ''I Believe I Can Fly,\" ''Step in the Name of Love\" and \"Bump N' Grind.\" He has also written hits for artists ranging from Celine Dion to Michael Jackson to Lady Gaga. While he's written classic love songs and even gospel music, he is defined by sexually explicit songs such as \"Feelin' on Yo Booty,\" ''Your Body's Calling Me,\" ''Sex Me\" and even more explicit fare.\n\nOn the new song, he says he was sexually abused as a child, singing \"a family member touched me\" and revealing he was \"so scared to say something, so I just put the blame on me.\"\n\nHe also says that he does not own his music, that he dropped out of school and that he \"couldn't read the teleprompter when the Grammy's asked me to present (an award).\"\n\n\"I Admit\" was not released on Sony's RCA Records, where R. Kelly is signed. The label said it had no comment about the song. R. Kelly posted a link to the song Monday with the caption: \"Today is the day you've been waiting for.\"\n\nIn April, R. Kelly's concert in his hometown of Chicago was canceled around the time the Times' Up campaign took aim at the singer over allegations he sexually abused women. Weeks later, Spotify removed his music from its playlists, citing its new policy on hate content and hateful conduct.\n\n\"Now the truth in this message is I'm a broke (expletive) legend/The only reason I stay on tour is 'cause I gotta pay my rent,\" he sings on the new track.\n\nIn May, a woman filed a lawsuit against R. Kelly, accusing the singer of sexual battery, knowingly infecting her with herpes and locking her in rooms for punishment.\n\n\"They're brainwashed, really?/Kidnapped, really?/Can't eat, really?/Real talk, that (expletive) sound silly,\" he sings.\n\nR. Kelly says in the song he had a recent conversation with talk show host Wendy Williams, who asked him about the late singer Aaliyah, who was 15 when she married a 27-year-old R. Kelly in 1994. The marriage was later annulled.\n\n\"(Wendy) said, 'What about Aaliyah said?,' R. Kelly sings, responding with: \"Love.\"\n\n\"She said, 'What about the tape?'/I said hush,\" he continues. \"I said my lawyer said 'don't say noth'/But I can tell you I've been set up.\"\n\nThe song sparked outrage on social media, with celebrities and activists condemning R. Kelly and calling for his arrest.\n\n\"His lack of self awareness is atrocious. There are several lyrics I take offense to,\" Rapper Talib Kweli Greene said in a Twitter post. \"The one I will address is “I’m just a man.” I am also a man. I would never use that to defend this behavior.\" Questlove of The Roots, who apparently listened to R. Kelly's new track, tweeted he wanted his 19 minutes back.\n\nI just listened to a 20 minute R. Kelly song. It was my decision. I made it. Therefore I have no one to blame but myself. In the future I promise to be better. — VanLathan (@VanLathan) July 23, 2018\n\nI’m excited for the new R Kelly music video Trapped In the Courtroom. — Ronald Funches (@RonFunches) July 23, 2018\n\nHOW ARE Y'ALL STILL NOT DONE WITH R. KELLY?!?! — Brittany Packnett (@MsPackyetti) July 23, 2018\n\nI’m not listening to I’m a victim for 19 minutes ... #RKelly — Loni Love (@LoniLove) July 23, 2018\n\nIn conjunction to the #MeToo movement, Viola Davis, Shonda Rhimes and Ava DuVernay and other celebrities participated in the Time's Up movement's #MuteRKelly social media campaign in April, calling for a boycott of his music and performances.", "images": ["https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_18/2417136/180501-r-kelly-al-0839.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2018_18/2417136/180501-r-kelly-al-0839.jpg"], "top_img": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_18/2417136/180501-r-kelly-al-0839.jpg", "keywords": [], "authors": ["Associated Press", "Chandelis R. Duster"], "canonical_link": "https://www.nbcnews.com/storyline/sexual-misconduct/r-kelly-addresses-sexual-assault-allegations-19-minute-song-i-n893776", "title": "R. Kelly addresses sexual assault allegations in 19-minute song 'I Admit'", "meta_data": {"msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/nbcnews/all-other-sizes-PNG.ico/browserconfig.xml", "robots": "max-image-preview:large", "fb": {"app_id": 10150138890205613, "pages": 1508175089456029}, "og": {"site_name": "NBC News", "locale": "en_US", "url": "https://www.nbcnews.com/storyline/sexual-misconduct/r-kelly-addresses-sexual-assault-allegations-19-minute-song-i-n893776", "title": "R. Kelly addresses sexual assault allegations in 19-minute song 'I Admit'", "description": "The R&B singer admits to 'imperfect ways' but still denies committing any specific crimes.", "image": {"identifier": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_18/2417136/180501-r-kelly-al-0839.jpg", "secure_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_18/2417136/180501-r-kelly-al-0839.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@NBCNews", "creator": "NBCNews", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1024-512,f_auto,q_auto:best/newscms/2018_18/2417136/180501-r-kelly-al-0839.jpg", "title": "R. Kelly addresses sexual assault allegations in 19-minute song 'I Admit'", "description": "The R&B singer admits to 'imperfect ways' but still denies committing any specific crimes.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1, user-scalable=yes", "description": "R. Kelly sings about his troubles and battles in a new 19-minute song, addressing sexual abuse claims against him that have put a screeching halt on his career.", "branch": {"deeplink": {"title": "R. Kelly addresses sexual assault allegations in 19-minute song 'I Admit'", "description": "The R&B singer admits to 'imperfect ways' but still denies committing any specific crimes.", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_18/2417136/180501-r-kelly-al-0839.jpg", "type": "article", "unibrow": "NBCBLK", "authorName1": "Associated Press", "authorName2": "Chandelis R. Duster"}}, "article": {"opinion": "false", "content_tier": "free", "published": "Mon Jul 23 2018 21:31:00 GMT+0000 (UTC)", "modified": "Wed Jul 25 2018 23:25:06 GMT+0000 (UTC)"}, "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x768_scale,f_auto,q_auto:best/newscms/2018_18/2417136/180501-r-kelly-al-0839.jpg", "next-head-count": 93}, "movies": [], "publish_date": 1532381460.0, "source": "https://www.nbcnews.com", "summary": ""}