{"url": "https://www.biography.com/people/oprah-winfrey-9534419", "text": "Born in the rural town of Kosciusko, Mississippi, Winfrey moved to Baltimore in 1976, where she hosted People Are Talking. Afterward, she was recruited by a Chicago TV station to host her own morning show.\n\nOprah Winfrey is a talk show host, media executive, actress and billionaire philanthropist. She’s best known for being the host of her own, wildly popular program, The Oprah Winfrey Show, which aired for 25 seasons, from 1986 to 2011. In 2011, Winfrey launched her own TV network, the Oprah Winfrey Network (OWN).\n\nEarly Life and Education\n\nWinfrey was born in the rural town of Kosciusko, Mississippi, on January 29, 1954. After a troubled adolescence in a small farming community, where she was sexually abused by a number of male relatives and friends of her mother, Vernita, Winfrey moved to Nashville to live with her father, Vernon, a barber and businessman.\n\nIn 1971, Winfrey entered Tennessee State University. She began working in radio and television broadcasting in Nashville.\n\nEarly Broadcasting Career\n\nIn 1976, Winfrey moved to Baltimore, Maryland, where she hosted the TV chat show People Are Talking. The show became a hit and Winfrey stayed with it for eight years, after which she was recruited by a Chicago TV station to host her own morning show, A.M. Chicago.\n\nHer major competitor in the time slot was Phil Donahue. Within several months, Winfrey's open, warm-hearted personal style had won her 100,000 more viewers than Donahue and had taken her show from last place to first in the ratings.\n\n'The Oprah Winfrey Show'\n\nWinfrey launched The Oprah Winfrey Show in 1986 as a nationally syndicated program that ran for 25 years, until 2011. With its placement on 120 channels and an audience of 10 million people, the show grossed $125 million by the end of its first year, of which Winfrey received $30 million.\n\nShe soon gained ownership of the program from ABC, drawing it under the control of her new production company, Harpo Productions ('Oprah' spelled backwards) and making more and more money from syndication.\n\nIn 1994, with talk shows becoming increasingly trashy and exploitative, Winfrey pledged to keep her show free of tabloid topics. Although ratings initially fell, she earned the respect of her viewers and was soon rewarded with an upsurge in popularity.\n\nProjects with Harpo have included the highly-rated 1989 TV miniseries, The Women of Brewster Place, in which Winfrey also starred.\n\nIn 2004, Winfrey signed a new contract to continue The Oprah Winfrey Show through the 2010-11 season. At the time, the syndicated show was seen on nearly 212 U.S. stations and in more than 100 countries worldwide.\n\nIn 2009, Winfrey announced that she would be ending her program when her contract with ABC ended, in 2011.\n\nREAD MORE: Why Oprah's Car Giveaway Is the Most Epic Talk Show Moment Ever\n\nOprah’s Book Club\n\nWinfrey contributed immensely to the publishing world by launching her \"Oprah's Book Club,\" as part of her talk show. The program propelled many unknown authors to the top of the bestseller lists and gave pleasure reading a new kind of popular prominence.\n\nWinfrey has continued her book club. In 2018, she famously interviewed former First Lady Michelle Obama for the release of her memoir, Becoming.\n\nOprah’s Favorite Things\n\nIn 1997, Winfrey introduced \"Oprah's Favorite Things,\" an annual list of holiday gifts curated by the mogul, on her talk show.\n\nEven after moving onto other projects, Winfrey continued the annual tradition. For the 20th edition in 2017, the list was featured on Amazon. She became the first celebrity voice behind Alexa, the company's voice-control system, allowing shoppers to hear Winfrey herself explain her top picks for the season.\n\nHalf-Sister\n\nIn the final season of her talk show, Winfrey made ratings soar when she revealed a family secret: she has a half-sister named Patricia.\n\nWinfrey's mother, Vernita Lee, gave birth to a baby girl in 1963. At the time, Winfrey was 9 years old, and living with her father. Lee put the child up for adoption because she believed that she wouldn't be able to get off public assistance if she had another child to care for. Patricia lived in a series of foster homes until she was seven years old.\n\nPatricia tried to connect with her birth mother through her adoption agency after she became an adult, but Lee did not want to meet her. After doing some research, she approached a niece of Winfrey's, and the two had DNA tests done, which proved they were related.\n\nWinfrey only learned of her sister's existence a few months before she made the decision to publicize the knowledge. \"It was one of the greatest surprises of my life,\" she said on her show.\n\nREAD MORE: Oprah Winfrey's Best Talk Show Moments\n\nWeight Loss\n\nWinfrey has publicly struggled with her weight, and her numerous weight loss efforts have been well-documented. In 1988, she revealed on her talk show that she lost 67 pounds on a liquid diet and exercise. \"I had literally starved myself for four months - not a morsel of food,\" she later said. By 1992, she had gained most of the weight back.\n\nIn 1995, she lost an estimated 90 pounds (dropping to her ideal weight of around 150 pounds). That year, she competed in the Marine Corps Marathon in Washington, D.C.\n\nIn the wake of her highly publicized success, Winfrey's personal chef, Rosie Daley, and trainer, Bob Greene, both published best-selling books. However Winfrey’s weight continued to fluctuate through the years.\n\nWeight Watchers\n\nIn 2015, Winfrey bought a 10 percent stake in Weight Watchers (WW). She also became and advisor for the company and secured herself a seat on the board, and she appeared in TV ads as a spokesperson for the company.\n\nWW had been in a funk for a few years, but Winfrey’s involvement revived the company seeing a surge in membership and stock prices.\n\nIn early 2017, Winfrey revealed that she had again lost 42 pounds, which she credited to WW. More than two years later, she wrote a letter to WW members saying that she was diagnosed with pre-diabetes before her most recent weight loss journey, but that her blood pressure and sugar were now under control.\n\nOxygen Media and 'O Magazine'\n\nIn 1999 Winfrey debuted Oxygen Media, a company she co-founded that’s dedicated to producing cable and Internet programming for women. In doing so, Winfrey ensured her spot in the forefront of the media industry as one of the most powerful and wealthy people in show business. In 2002, she concluded a deal with the network to air a prime-time complement to her syndicated talk show.\n\nWinfrey’s highly successful monthly magazine, published by Hearst, O: The Oprah Magazine, debuted in 2000.\n\nOprah Winfrey Network (OWN)\n\nSoon after The Oprah Winfrey Show ended in 2011, Winfrey moved to her own network, the Oprah Winfrey Network, a joint venture with Discovery Communications.\n\nDespite a financially rocky start, the network made headlines in January 2013, when it aired an interview between Winfrey and Lance Armstrong, the American cyclist and seven-time Tour de France winner who was stripped of his Tour titles in 2012 due to doping charges.\n\nDuring the interview, Armstrong admitted to using performance-enhancing substances throughout his cycling career, including the hormones cortisone, testosterone and erythropoietin (also known as EPO). \"I am deeply flawed ... and I'm paying the price for it, and I think that's okay. I deserve this,\" he stated. The interview reportedly brought in millions of dollars in revenue for OWN.\n\nOf her interview with Armstrong, Winfrey said in a statement, \"He did not come clean in the manner I expected. It was surprising to me. I would say that, for myself, my team, all of us in the room, we were mesmerized by some of his answers. I felt he was thorough. He was serious. He certainly prepared himself for this moment. I would say he met the moment. At the end of it, we both were pretty exhausted.\"\n\nIn March 2015, Winfrey announced that her Chicago-based Harpo Studios would close at the end of the year to consolidate the company’s production operations to the Los Angeles-based OWN headquarters. Winfrey’s television empire was launched at the studio and it had been home to her daily syndicated talk show through its finale in 2011.\n\n\"The time had come to downsize this part of the business and to move forward. It will be sad to say goodbye,\" said Winfrey, \"but I look ahead with such a knowing that what the future holds is even more than I can see.\"\n\nWinfrey returned to acting in Greenleaf, which marked her first recurring scripted television role. The original family drama, which revolves around a Memphis megachurch, premiered on OWN in June 2016.\n\nIn December 2017, it was announced that Discovery had become the majority owner of OWN, with the purchase of 24.5 percent of the company from its founder for $70 million. Winfrey retained 25.5 percent of OWN and remained its chief executive under the terms of the agreement.\n\nPartnership with Apple\n\nIn June 2018, Winfrey agreed to a multi-year deal in which she would create original content for Apple.\n\nIn September 2019, it was announced that Winfrey was bringing Oprah's Book Club to the Apple TV+ streaming subscription service, with Ta-Nehisi Coates' The Water Dancer to be featured on the inaugural November 1 episode.\n\nAs part of her partnership with Apple, Winfrey signed on as executive producer of On the Record, a documentary about several of the women who accused music producer Russell Simmons of sexual misconduct. However, Winfrey abruptly pulled her support of the doc shortly before it was scheduled to premiere at the 2020 Sundance Film Festival.\n\nREAD MORE: Oprah Winfrey: All the Ways the First Black Female Billionaire Has Made History\n\nWealth, Charity and Awards\n\nAccording to Forbes magazine, Winfrey was the richest African American of the 20th century and the world's only Black billionaire for three years running. Life magazine hailed her as the most influential woman of her generation.\n\nIn September 2002, Winfrey was named the first recipient of the Academy of Television Arts & Sciences' Bob Hope Humanitarian Award.\n\nIn 2005, Business Week named Winfrey the greatest Black philanthropist in American history. Oprah's Angel Network raised more than $50 million for charitable programs, including girls' education in South Africa and relief to the victims of Hurricane Katrina.\n\nWinfrey is a dedicated activist for children's rights; in 1994, President Bill Clinton signed a bill into law that Winfrey had proposed to Congress, creating a nationwide database of convicted child abusers.\n\nShe also founded the Family for Better Lives foundation and also contributes to her alma mater, Tennessee State University.\n\nIn November 2013, Winfrey received the nation's highest civilian honor, the Presidential Medal of Freedom. President Barack Obama gave her this award for her contributions to her country.\n\nIn February 2018, after a shooting at Florida's Marjory Stoneman Douglas High School left 17 people dead, Winfrey announced she would follow the example set by George and Amal Clooney and donate $500,000 to the March for Our Lives demonstration scheduled for the following month.\n\nOprah Winfrey and Michelle Obama hug it out as they campaign for Barack Obama in Des Moines, Iowa, in 2007 Photo: Getty Images\n\nPolitical Activism\n\nCampaigning for Barack Obama\n\nWinfrey campaigned for Democratic presidential hopeful Barack Obama in December 2007, attracting the largest crowds of the primary season to that point. Winfrey joined Obama for a series of rallies in the early primary/caucus states of Iowa, New Hampshire, and South Carolina. It was the first time Winfrey had ever campaigned for a political candidate.\n\nThe biggest event was at the University of South Carolina football stadium, where 29,000 supporters attended a rally that had been switched from an 18,000-seat basketball arena to satisfy public demand.\n\n\"Dr. (Martin Luther) King dreamed the dream. But we don't have to just dream the dream any more,\" Winfrey told the crowd. \"We get to vote that dream into reality by supporting a man who knows not just who we are, but who we can be.\"\n\nCampaigning for Stacey Abrams\n\nIn November 2018, Winfrey campaigned with Georgia gubernatorial candidate Stacey Abrams, the first Black female nominee for a major party to run for governor in any state. Winfrey knocked on doors and even participated in a town-hall meeting with the Democratic candidate. In the end, Abrams narrowly lost her election bid to Republican Brian Kemp.\n\nRelationship with Trump\n\nWinfrey and President Donald Trump have a long history together. In 1999, Trump said on Larry King Live that were he to run for president, he’d want Winfrey as his running mate.\n\nTrump has also endorsed Winfrey on Twitter many times, from her decision to launch a television network to praising her interview with Lance Armstrong.\n\nAfter becoming president, Trump said that he was friends with Winfrey until he ran for office. For her part, Winfrey did not mention Trump by name but did talk about “noise,” “vitriol” and “crazy talk” in politics.\n\nIn 2018, Trump tweeted that Winfrey looked “very insecure” appearing as a special correspondent on 60 Minutes and saying that he hoped she would run for president “so she can be exposed and defeated just like all of the others.”\n\nCalls for 2020 Presidency\n\nSince Winfrey’s speech at the 2018 Golden Globes, where she criticized the racially-charged environment in America, fans speculated that she might run for U.S. president in the 2020 elections. However, Winfrey has said that she does not want to and has no intention of running for president.\n\nGolden Globes Award\n\nIn January 2018, Winfrey became the first African American woman to be honored with the Golden Globes' Cecil B. DeMille Award, for lifetime achievement. In a powerful speech, she recalled being inspired by seeing Sidney Poitier honored at the Globes decades earlier, before emphasizing the importance of a free press and the power of speaking the truth in a \"culture broken by brutally powerful men.\"\n\n\"So I want all the girls watching here and now to know that a new day is on the horizon,\" she said, in closing. \"And when that new day finally dawns, it will be because of a lot of magnificent women, many of whom are right here in this room tonight, and some pretty phenomenal men, fighting hard to make sure that they become the leaders who take us to the time when nobody ever has to say, 'Me too' again.\"\n\nFamous Movies\n\n‘The Color Purple’\n\nWinfrey’s success on television led to nationwide fame and a role in Steven Spielberg's 1985 film The Color Purple, for which she was nominated for an Academy Award for Best Supporting Actress.\n\nIn 2005, Winfrey helped give The Color Purple a new life onstage as one of the producers of the 11-time Tony-nominated musical, which ran on Broadway until 2008. A revival of the musical, which Winfrey co-produced in 2015, won a Tony Award.\n\n‘Beloved’\n\nWinfrey signed a multi-picture contract with Disney. The initial project, 1998's Beloved, based on the Pulitzer Prize-winning novel by Toni Morrison and starring Winfrey and Danny Glover, got mixed reviews and generally failed to live up to expectations.\n\nFood Line: Soups, Pizzas and Sides\n\nIn 2017, Winfrey launched O That’s Good, a line of prepared foods with a nutritious twist. The line includes pizzas, soups, and sides like mashed potatoes and pasta.\n\n'60 Minutes'\n\nIn January 2017, CBS announced that Winfrey would join the newsmagazine 60 Minutes as a special contributor in the fall.\n\nIn April 2019, Winfrey revealed that she had left her special post on the show because it wasn’t “the best format” and that she spoke with “too much emotion” for the producers.\n\nPersonal Life\n\nWinfrey has been in a relationship with Stedman Graham, a public relations executive, since the mid-1980s. They became engaged in 1992 but never tied the knot.\n\nThe couple lives in Chicago. Winfrey also has homes in Montecito, California, Rolling Prairie, Indiana, and Telluride, Colorado.", "images": ["https://www.biography.com/.image/ar_1:1%2Cc_fill%2Ccs_srgb%2Cg_face%2Cq_auto:good%2Cw_300/MTY2NTIzMDQzOTIzODk1NTM4/oprah-photo-by-vera-anderson_wireimage.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTgwOTkzMjcyNDY0ODExMzY4/gettyimages-171061310.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTYxMTg4NDkxMDY4MTg4MTYy/oprah-winfrey-attends-the-oprah-winfrey-show-season-24-kickoff-party-on-michigan-avenue-on-september-8-2009-in-chicago-illinois-photo-by-tasos-katopodis_getty-images.jpg", "https://www.biography.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyNjEyMDExODE5OTM1MjY4/gettyimages-1082526236.jpg", "https://www.biography.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyMTY3MzE1MjAxMDc0MzU3/gettyimages-1404884042.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTgwODI3NDI1NTIzOTAxODAw/toni-morrison-gettyimages-481665793.jpg", "https://www.biography.com/.image/t_share/MTY2NTIzMDQzOTIzODk1NTM4/oprah-photo-by-vera-anderson_wireimage.jpg", "https://www.biography.com/.image/t_share/MTczNDc5NDY0MjA4OTY3MDYw/oprahwinfrey_facts_desktop.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_1280/MTY4Mjc5OTY4NzQ3ODg5ODI5/black-background.jpg", "https://www.biography.com/.image/cs_srgb%2Cq_auto:good/MTQ1NTM0MTQ5NzA3NDQxNzE5/navbarwhite.png", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTgwMzE3ODExMjc5NjY5MTAw/gettyimages-1052566600.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTQzMzAyMTU3MjA5MTgzODE1/tyra-banks_gettyimages-516572662jpg.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTQ3NjM5NTA5NjU4Mzc5NjUy/maya_angelou_photo_by_deborah_feingold_corbis_entertainment_getty_533084708.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTgwNDU1NDE3NDY4NDI5NDYy/gettyimages-1054782700.jpg", "https://www.biography.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyMTcwNjUwMjQzMTc5Njk2/gettyimages-1146332483.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyODY5ODkyMzkzODA1MDIx/sara-gilbert-gettyimages-1175735368.jpg", "https://www.biography.com/.image/c_fit%2Ccs_srgb%2Cq_auto:good%2Cw_458/MTQ1NTMzOTkyNDA0MjY0NTAz/sitelogowhite.png", "https://www.biography.com/.image/t_share/MTE4MDAzNDEwMzY4NjI4MjM4/michelle-obama-9-raw.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTgwOTk0NTY3Mzk4NTY1MjI0/joan-rivers-gettyimages-98726635.jpg"], "top_img": "https://www.biography.com/.image/t_share/MTY2NTIzMDQzOTIzODk1NTM4/oprah-photo-by-vera-anderson_wireimage.jpg", "keywords": [], "authors": ["Biography.Com Editors"], "canonical_link": "https://www.biography.com/media-figure/oprah-winfrey", "title": "Oprah Winfrey", "meta_data": {"author": "Biography.com Editors", "description": "Billionaire media executive and philanthropist Oprah Winfrey is best known for hosting her own internationally popular talk show from 1986 to 2011. From there she launched her own television network, OWN.", "section": "Media Figures", "pagetype": "person", "robots": "max-image-preview:large", "item-id": "ci01a8bfd61a40860b", "published": "2018-03-21T11:51:24Z", "modified": "2021-02-17T21:02:11Z", "dcterms.rightsHolder": "Biography and the Biography logo are registered trademarks of A&E Television Networks, LLC.", "dcterms.dateCopyrighted": 2022, "twitter": {"card": "summary_large_image", "site": "@bio", "url": "https://www.biography.com/media-figure/oprah-winfrey", "image": "https://www.biography.com/.image/t_share/MTY2NTIzMDQzOTIzODk1NTM4/oprah-photo-by-vera-anderson_wireimage.jpg", "description": "Billionaire media executive and philanthropist Oprah Winfrey is best known for hosting her own internationally popular talk show from 1986 to 2011. From there she launched her own television network, OWN.", "domain": "www.biography.com"}, "og": {"type": "website", "url": "https://www.biography.com/media-figure/oprah-winfrey", "title": "Oprah Winfrey", "description": "Billionaire media executive and philanthropist Oprah Winfrey is best known for hosting her own internationally popular talk show from 1986 to 2011. From there she launched her own television network, OWN.", "image": "https://www.biography.com/.image/t_share/MTY2NTIzMDQzOTIzODk1NTM4/oprah-photo-by-vera-anderson_wireimage.jpg", "site_name": "Biography"}, "fb": {"pages": 123492867697144, "app_id": 104784826244596}, "pinterest-rich-pin": "true", "apple-mobile-web-app-title": "Biography", "parsely-title": "Oprah Winfrey - Biography", "parsely-link": "https://www.biography.com/media-figure/oprah-winfrey", "parsely-image-url": "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cfl_progressive%2Ch_400%2Cq_auto:good%2Cw_620/MTY2NTIzMDQzOTIzODk1NTM4/oprah-photo-by-vera-anderson_wireimage.jpg", "parsely-post-id": "ci01a8bfd61a40860b", "parsely-pub-date": "2018-03-21T11:51:24Z", "parsely-section": "Media Figures", "parsely-author": "Biography.com Editors", "parsely-tags": "Oprah Winfrey's Best Talk Show Moments,Oprah Winfrey: All the Ways the First Black Female Billionaire Has Made History,Why Oprah's Car Giveaway Is the Most Epic Talk Show Moment Ever,Oprah Winfrey Once Described Longtime Friend Toni Morrison as 'Our Conscience',Maya Angelou,Toni Morrison,Phil Donahue,Michelle Obama", "sailthru.title": "Oprah Winfrey", "sailthru.image.full": "https://www.biography.com/.image/t_share/MTY2NTIzMDQzOTIzODk1NTM4/oprah-photo-by-vera-anderson_wireimage.jpg", "sailthru.date": "2018-03-21T11:51:24Z", "sailthru.description": "Billionaire media executive and philanthropist Oprah Winfrey is best known for hosting her own internationally popular talk show from 1986 to 2011. From there she launched her own television network, OWN.", "phx": {"content-item-id": "ci01a8bfd61a40860b", "content-object-type": "ContentPerson", "exclusive-content-type": "free", "site-keyword": "biography"}, "google-site-verification": "NtA82m_nY0RdVtIFdXEAhFcaqEr43II3Z2UEuVRe4vA", "viewport": "width=device-width, initial-scale=1", "referrer": "unsafe-url", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-mobile-web-app-capable": "no", "apple-mobile-web-app-status-bar-style": "black", "format-detection": "address=no", "msvalidate.01": "565AA37CB662E60BF24DDCABEC686D8F", "generator": "Tempest - maven.io", "pinterest": "nohover"}, "movies": [], "publish_date": 1521633084.0, "source": "https://www.biography.com", "summary": ""}