{"url": "https://www.wmagazine.com/story/cfda-awards-2017-oscars-of-fashion-inside-gossip", "text": "The CFDA Awards are routinely called the Oscars of fashion, though mainly by fashion people, as host Seth Meyers quipped.\n\n“It doesn’t work the other way around,” Meyers said. “You never hear the Oscars described as the CFDA Awards of Hollywood.”\n\nMeyers’ monologue got to the self-importance of this particular awards show, but also its esteem within the fashion universe, its unique position as the industry’s highest honor outside of leading a legacy European house or going public on the New York Stock Exchange.\n\nAnd, so, on Monday afternoon all of fashion schlepped to Manhattan’s Hammerstein Ballroom, just a block away from 7th Avenue, a thoroughfare also known as Fashion Avenue, though no one’s actually ever called it that since 1972. “If you say to a cab driver, take me to the corner of 33rd and Fashion Avenue, they legally have the right to rob you,” Meyers said to a chummy crowd that appreciated all the in-the-know jokes.\n\nInside, a room that might have felt bereft without the star power of a Rihanna and Beyoncé instead radiated with the combined wattage of the girls of the moment—both Gigi and Bella Hadid were with us—Nicole Kidman in Oscar de la Renta, a bevy of young It girls (Chloë Grace Moretz, Sasha Lane, Rowan Blanchard, the Haim sisters), model legends like Karen Elson and Amber Valetta, James Franco and Suki Waterhouse canoodling at the Coach table while Hari Nef vaped nearby, and international design talent, represented by Raf Simons and Demna Gvasalia.\n\nInside the 2017 CFDA Awards’ Most Candid Moments, from the Red Carpet to the Winner’s Walk Hailey Baldwin attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Bella Hadid attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Anna Cleveland attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Karlie Kloss attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Alek Wek attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Ashley and Mary-Kate Olsen attend the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Raf Simons attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Karen Elson attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Janet Mock attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Nicole Kidman attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Alexi Ashe and Seth Meyers attend the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Adriana Lima attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Josephine Skriver attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Stuart Vevers and James Franco attend the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Meg Ryan attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Janelle Monae attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Julia Restoin Roitfeld attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Pom Klementieff attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Joseph Altuzarra and Pom Klementieff attend the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Delilah Belle Hamlin attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Hari Nef attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Joan Smalls attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Arizona Muse attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Heidi Klum attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Gigi Hadid attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Rowan Blanchard attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Mia Moretti attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Constance Jablonski attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Francesco Carrozzini and Bee Shaffer attend the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. Kenneth Cole attends the 2017 CFDA Awards. Photo by Nick Delieto for W Magazine. INFO 1/30\n\nIt wouldn’t be an awards show, though, without some tears, many of them shed by Simons, fashion’s resident emo boy, who in just one season took home both the Menswear Designer of the Year and Womenswear Designer of the Year Award for his debut Fall 2017 collection at Calvin Klein—a feat previously only previously accomplished by Calvin Klein himself, in 1993.\n\nIn accepting the first award, for menswear, Simons set a tone of sincerity for the evening. “If we as creatives can be an inspiration for how the world should look,” Simons said, wiping at tears. “I think that it’s something we should take as a very important task in our existence.” He also thanked “my man,” a reference to Jean-Georges D’Orazio, sharing that when they moved to New York knowing no one, they only had each other, inciting a chorus of “Aw’s” around the room.\n\nUpon accepting the Founder’s Award, Pat McGrath, too, delivered touching remarks reflecting on her own climb up the ladder from working-class London. “Fashion is an industry where all the insiders are outsiders,” she said in a much quoted line.\n\nAnna Wintour, editor in chief of Vogue and Condé Nast artistic director, choked up when honoring her late friend Franca Sozzani, before presenting a posthumous Fashion Icon award to Sozzani’s son—and Wintour’s soon-to-be son-in-law— Francesco Carrozzini.\n\n“An eye for romance was one of Franca’s editorial gifts,” Wintour said haltingly. “Franca’s deep imagination drew on drama and a feeling that fashion meant more than just clothes.”\n\nCFDA Awards 2017: From Rowan Blanchard and Hari Nef to the Olsen Twins, Here Are the Best Dressed Celebrities on the Red Carpet Chloe Grace Moritz, Sasha Lane, Hari Nef, and Rowan Blanchard wear Coach. Jamie McCarthy Kate Bosworth wears Brock Collection. Jamie McCarthy Ashley and Mary-Kate Olsen in The Row Jamie McCarthy Gabrielle Union wearing Rodarte. Dimitrios Kambouris Gloria Steinem in Michael Kors and Kathy Najimy in Christian Siriano. Photo by Getty Images. Gigi Hadid. Jamie McCarthy Diane Kruger in Monse. Jamie McCarthy The Haim sisters wearing Diane Von Furstenberg. Dimitrios Kambouris Karen Elson in Anna Sui. Presley Ann Bella Hadid in Off-White. Photo by Getty Images. INFO 1/10\n\n“Welcome to the inner sanctum of winningness,” Kerry Washington, who had presented the Swarovski Award for Emerging Talent, said to Kim and Garcia as they entered the so-called “Winner’s Walk,” a makeshift war room with a mini step-and-repeat for winners to pose with their statue.\n\n“I didn’t have a speech, but Laura still had her speech from last year, so she deleted a few names who are no longer part of our lives, and then added a couple, and then improvised. And I just rode on her coattails,” Garcia said, fresh off the podium.\n\n“Oh god, it all went blank. I wasn’t sure where to go, and I didn’t know what I was going to say. I don’t know what I said,” said Stuart Vevers after winning Accessory Designer of the Year for his work at Coach. Luckily the hard part was over. “I think I’m going to get drunk now.”\n\nFor some, the CFDAs are a night out with an old friend, for others, something of a supremely glamorous first date. “I’ve been wearing his designs for a long time, but we only finally met two weeks ago and it was stellar. It was cosmic,” said Brit Marling on the red carpet of her date, Sies Marjan’s Sander Lak.\n\nBlanchard ventured the carpet alone, clad in Coach and sequined eye makeup, having just had a glamorous date of her own: prom, where she attended alongside Yara Shahidi.\n\n“It was really fun! Our school is an online version, so it was really fun to go in person,” she said. “Prom was weird, though, because I was the youngest person there because I was only a sophomore. They were all like, ‘You’re a baby,’ and I’m like, ‘You’re a year older than me.’ That was sort of amusing, and they had a weird DJ, but it was fun.”\n\nCFDA Awards 2017: See What Gigi Hadid, Priyanka Chopra and More Wore on the Red Carpet Gigi Hadid at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Actresses Chloe Grace Moretz, Sasha Lane, Hari Nef, and Rowan Blanchard wear Coach to the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Bella Hadid wears Off-White by Virgil Abloh to the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Gabrielle Union wears Rodarte to the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Diane Kruger poses with Monse’s Laura Kim and Fernando Garcia at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Lupita Nyong’o wears a Jason Wu dress and Paul Andrew shoes at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Kerry Washington at Prabal Gurung at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Gloria Steinem in Michael Kors Collection and Kathy Najimy in Christian Siriano at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Joan Smalls in Michael Kors Collection at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Mary Kate and Ashley Olsen at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Kate Bosworth in Brock Collection at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Priyanka Chopra wears Michael Kors Collection to the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Planned Parenthood’s Cecile Richards in Gabriela Hearst at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Janet Mock in Jonathan Simkhai at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Mandy Moore in Kate Spade at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Brit Marling in Sies Marjan at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Haim in Diane von Furstenberg at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Karlie Kloss in Diane von Furstenberg at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Actress Ashley Benson in Kate Spade at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. CFDA president Diane von Furstenberg at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Brooke Shields in Sachin & Babi at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Model Adriana Lima in Urban Zen at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Dimitrios Kambouris Ellie Kemper in Kate Spade at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Heidi Klum in Zac Posen at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Lily Aldridge at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Olivia Munn wears Tanya Taylor at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Model Elsa Hosk wears a Philosophy dress and Valentino heels at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Sara Sampaio at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Public School Designers Maxwell Osborne and Dao-Yi Chow at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. Anna Wintour wears Proenza Schouler at the 2017 CFDA Fashion Awards at Hammerstein Ballroom on June 5, 2017 in New York City. Photo by Getty Images. INFO 1/30\n\nAs if on cue, Elson spotted Blanchard, running up to gush. “I’m so lucky that my daughter has someone like you to look up to,” she said. She also had someone she wanted to introduce her to: Gloria Steinem.\n\n“My heart is racing so fast right now,” Blanchard said, as she approached the living legend. It was a feeling that resounded on the carpet and, later, inside the venue.\n\nThe feminist icon was being awarded with the Board of Directors Tribute, along with Janelle Monáe and Planned Parenthood’s Cecile Richards, and was easily the most popular woman in the venue. “I think this is a group of very socially conscious people who are making beauty not guns,” Steinem told W. “I think the fashion industry have often been on the forefront of many different kinds of social change. There has been especially more consciousness about how are garments are produced and making sure they are ethically produced and create good jobs. And it’s a sign of freedom. Oppressive regimes dictate uniforms, so clothing that is self-expression is democratic.”\n\nThe trio of women closed out the night with a series of rousing speeches. “You can’t be a feminist without being anti-racist, and vice versa,” Steinem said. Echoed by Monáe, who added, “As human beings it is our responsibility to take care of one another,” a fitting conclusion to a particularly poignant evening.\n\nWith all the waterworks, perhaps Calvin Klein should make handkerchiefs next season? Surely Accessory Designer of the Year would go nicely with Simons’ two other trophies.\n\nCFDA Awards: Rihanna, Gwyneth Paltrow, and 23 More of the Best Red Carpet Looks of All Time Rihanna was a showstopper in the 2014 awards wearing a custom Adam Selman gown that left little to the imagination. Getty At the 2016 Awards, Tilda Swinton arrived in a perfectly-Tilda look of tailored pants, and a strong-shouldered sweater. Gety Gwyneth Paltrow arrived at the 2010 awards on the arm of Michael Kors, wearing a sequined gown of his design. Getty In 2012, Dakota Fanning wore an kimono-inspired piece by Proenza Schouler. GEtty Aleca Chung made the case for beige in 2010, in a tea-length frock with a glittery bow and matching shoes. Getty Karlie Kloss was Jason Wu’s date in 2011, arriving in a show-stopping red gown of his design. Getty Kate Bosworth was festive in Altuzarra at the 2012 ceremony. Getty Mary-Kate Olsen truly embraced the dark side of her new brunette hair in 2012, wearing an all-black ensemble. Getty Karen Elson contrasted her red hair with a two-piece emerald green Proenza Schouler ensemble in 2012. Getty Adriana Lima was an early adopter of the sheer trend, wearing a Givenchy gown to the 2013 awards. Getty Claire Danes kept it simple in 2009 wearing a plunging black gown by Narciso Rodriguez. Getty Janelle Monae looked especially regal in a gold, caped frock at the 2015 awards. Getty Gigi Hadid was a shimmering vision in a sequined Michael Kors jumpsuit at the 2015 ceremony. Getty Alessandro Ambrosio arrived at the 2013 awards in clean, one-shouldered white gown. Getty Diane Kruger had a glamorous outing in 2015 in this red column gown with contrast black bands around the top. Getty Miranda Kerr chose Proenza Schouler for the 2013 awards, an ocean-like combination of greens and blues. Getty Lily Alridge showed some leg in 2015 in a sparkly black dress that also featured a plunging neckline. Getty In 2015, Amanda Seyfried opted for a whimsical floral number, courtesy of Rodarte. Getty Jemima Kirke pulled off a voluminous Rosie Assoulin dress at the 2015 ceremony. Getty Solange Knowles went super glam in 2014, wearing a silver dress by Calvin Klein. Getty Kirsten Dunst wore Rodarte, her perennial red carpet go-to, in 2016. Getty Also in 2016, Naomi Campbell showed off her incredible figure in a revealing black dress. Getty Caroline Murphy paired a button down shirt with a full sequined skirt in 2016. Michael Stewart Chloe Sevigny buttoned up in black and white in 2006. Getty Alek Wek had some fun on the red carpet in her pleated dress in 2016. Getty INFO 1/25\n\n“Women’s Rights Are Human Rights”: 62 Fashion Insiders Speak Out in a Powerful Video for International Women’s Day", "images": ["https://imgix.bustle.com/wmag/2017/06/05/5935e44c3cc2b0622bc243c9_GettyImages-692703850.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5935f9eddb3235692cf39e1b_GettyImages-692713240.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592c83cc2b0622bc24371_GettyImages-145727013_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592ca3cc2b0622bc24375_GettyImages-145742540_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5935f771db3235692cf39e17_GettyImages-692715382.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c70960e4502677864719_IMG_9132.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/59360090db3235692cf39e1e_GettyImages-692723068.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/5935ed8e60e45026778646e7_GettyImages-692712688.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/5935ef5d60e45026778646e9_GettyImages-692713246.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c6cb3cc2b0622bc2441c_IMG_9680.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c6ef3cc2b0622bc2441e_IMG_9350.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c7ca60e4502677864739_IMG_7546.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/5935e59460e45026778646be_GettyImages-692708490.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/5935e44f60e45026778646ba_GettyImages-692701368.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c7363cc2b0622bc2442a_IMG_8782.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592cfdb3235692cf39d9b_GettyImages-475588152_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c6f6db3235692cf39e31_IMG_9316.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592d3db3235692cf39d9f_GettyImages-538529386_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c75260e450267786471f_IMG_8594.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5935f481db3235692cf39e10_GettyImages-692708920.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c79d3cc2b0622bc24434_IMG_7937.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592ca3cc2b0622bc24373_GettyImages-145742527_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592cf60e4502677864659_GettyImages-475591292_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/59360094db3235692cf39e21_GettyImages-692733614.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592d060e450267786465b_GettyImages-475596890_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c71a3cc2b0622bc24424_IMG_8986.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5935f7703cc2b0622bc243f8_GettyImages-692709736.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c6ea60e4502677864715_IMG_9401.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c709db3235692cf39e33_IMG_9155.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5935f7703cc2b0622bc243f7_GettyImages-692709170.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/5935ef5bdb3235692cf39e08_GettyImages-692712820.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/5935e7b3db3235692cf39dfe_GettyImages-692708868.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c70960e4502677864719_IMG_9132.jpg?w=414&h=276&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/593600943cc2b0622bc24401_GettyImages-692715856.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5935fae060e45026778646fd_GettyImages-692723484.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592c8db3235692cf39d93_GettyImages-145729418_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5935f77060e45026778646fb_GettyImages-692716958-1.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592ca3cc2b0622bc24376_GettyImages-169875562_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592cfdb3235692cf39d99_GettyImages-475585084_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c72a3cc2b0622bc24428_IMG_8846.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c778db3235692cf39e3d_IMG_8257.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5935f76d3cc2b0622bc243f5_GettyImages-692719144.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c6e460e4502677864713_IMG_9446.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c75f3cc2b0622bc2442e_IMG_8540.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c73cdb3235692cf39e39_IMG_8748.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592d360e4502677864661_GettyImages-538521906_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592d4db3235692cf39da1_GettyImages-604652992_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5935f76d60e45026778646f7_GettyImages-692715528.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/10/7/57a17fc6-db10-4b37-a156-73c2e1678557-getty-109479454.jpg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5013&fp-y=0.2027", "https://imgix.bustle.com/wmag/2017/06/05/5935e4463cc2b0622bc243c5_GettyImages-692706764.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/5935e7493cc2b0622bc243cf_GettyImages-692708844.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/wmag/2017/06/05/5935e5943cc2b0622bc243cc_GettyImages-692708486.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c7103cc2b0622bc24422_IMG_9027.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c728db3235692cf39e35_IMG_8892.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c6da60e4502677864711_IMG_9549.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5935f76edb3235692cf39e13_GettyImages-692706244.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5935f22760e45026778646eb_GettyImages-692715430.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/5935e59a60e45026778646c0_GettyImages-692708464.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/wmag/2017/06/06/5936035d3cc2b0622bc24406_GettyImages-692722938.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592c73cc2b0622bc2436d_GettyImages-101753971_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936009460e45026778646ff_GettyImages-692725704.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936043ddb3235692cf39e23_GettyImages-692722836.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/593600903cc2b0622bc243ff_GettyImages-692733544.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592cd3cc2b0622bc24379_GettyImages-169888931_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592d360e450267786465f_GettyImages-538530320_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5935f8273cc2b0622bc243fb_GettyImages-692715382.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592d03cc2b0622bc2437b_GettyImages-495368519_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c7d860e450267786473d_IMG_7379.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c6d160e450267786470f_IMG_9606.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c71d3cc2b0622bc24426_IMG_8951.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592d160e450267786465d_GettyImages-495392871_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c76b60e4502677864727_IMG_8462.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/9/28/c8ad6ebe-709c-4888-a70f-b638ff680c42-6365e708-22b9-45af-aa29-7dfbfc143d2b-getty-1428143481.jpeg?w=160&h=160&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c70960e4502677864719_IMG_9132.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/wmag/2017/06/06/5935f76d60e45026778646f9_GettyImages-692715430-1.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592cedb3235692cf39d97_GettyImages-169892561_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/5935e449db3235692cf39dee_GettyImages-692706554.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/5935ed11db3235692cf39e06_GettyImages-692712112.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c6ef60e4502677864717_IMG_9370.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592d1db3235692cf39d9d_GettyImages-538510374_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/5935e446db3235692cf39dea_GettyImages-692706878.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c76560e4502677864725_IMG_8466-2.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c7003cc2b0622bc24420_IMG_9184.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592c73cc2b0622bc2436e_GettyImages-101870179_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592d5db3235692cf39da3_GettyImages-538531584_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592ccdb3235692cf39d95_GettyImages-475572698_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c73c3cc2b0622bc2442c_IMG_8755.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592cd60e4502677864657_GettyImages-475573512_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c74a60e450267786471d_IMG_8631.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5936c6c560e450267786470d_IMG_9873.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/5935e44fdb3235692cf39df4_GettyImages-692701298.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5935f8793cc2b0622bc243fd_GettyImages-692719492.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/5935e5943cc2b0622bc243cb_GettyImages-692708426.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592c8db3235692cf39d91_GettyImages-115404737_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/05/593592c6db3235692cf39d8d_GettyImages-88503485_master.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/06/06/5935f38360e45026778646f1_GettyImages-692716958.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/wmag/2017/06/06/5936c73660e450267786471b_IMG_8776.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/wmag/2017/06/06/5936c70960e4502677864719_IMG_9132.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wmagazine.com/story/cfda-awards-2017-oscars-of-fashion-inside-gossip", "title": "All the Inside Gossip, Drama and Tears from the 2017 CFDA Awards, the Oscars of Fashion", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@wmag", "card": "summary_large_image"}, "article": {"publisher": "https://www.facebook.com/wmagazine"}, "og": {"site_name": "W Magazine", "url": "https://www.wmagazine.com/story/cfda-awards-2017-oscars-of-fashion-inside-gossip", "type": "article", "title": "All the Inside Gossip, Drama and Tears from the 2017 CFDA Awards, the Oscars of Fashion", "description": "Raf Simons cries! Gloria Steineim rallies! James Franco and Suki Waterhouse canoodle! And more inside intel from the 2017 CFDA Awards, where Calvin Klein, Coach, and Monse were the evening's big winners.", "image": {"identifier": "https://imgix.bustle.com/wmag/2017/06/06/5936c70960e4502677864719_IMG_9132.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Raf Simons cries! Gloria Steineim rallies! James Franco and Suki Waterhouse canoodle! And more inside intel from the 2017 CFDA Awards, where Calvin Klein, Coach, and Monse were the evening's big winners."}, "movies": [], "publish_date": null, "source": "https://www.wmagazine.com", "summary": ""}