{"url": "https://www.chicagotribune.com/entertainment/tv/ct-american-idol-abc-20170507-story.html", "text": "(L-R Front Row) Mentor Scott Borchetta, Host Ryan Seacrest, Judge Keith Urban, Judge Jennifer Lopez, Judge Harry Connick, Jr., Executive Producer Trish Kinane, (L-R Back Row), S14 Winner Nick Fradiani, S10 Runner-Up Lauren Alaina, S10 Scotty McCreery, S8 Winner Kris Allen, S7 Winner David Cook, S6 Winner Jordin Sparks, S2 Winner Ruben Studdard speak onstage during the \"American Idol\" panel discussion at the FOX portion of the 2015 Winter TCA Tour at the Langham Huntington Hotel on January 15, 2016 in Pasadena, California. (Frederick M. Brown / Getty Images)\n\nIt's officially happening: After going dark in 2016 on Fox, \"American Idol\" will be back on your television sets.\n\nThe singing competition show that once reigned as ratings king will air on ABC for the 2017-2018 season, the network announced Tuesday, following rumors of its return that surfaced last week.\n\nAdvertisement\n\n\"'American Idol' is a pop-culture staple that left the air too soon,\" Channing Dungey, president of ABC Entertainment, said in a statement.\n\nIt's not clear who will serve as host or on the panel of judges. ABC said an announcement would come later, but one name is obviously swirling about: Ryan Seacrest.\n\nAdvertisement\n\nThe former \"Idol\" host has a jam-packed work schedule these days, including a new gig he started this month: serving as Kelly Ripa's co-host on ABC's \"Live,\" the second-most watched daytime TV show. On Monday, Ripa asked Seacrest on air about the reports that \"Idol\" would return.\n\n\"I said at the end of the series, 'Goodbye for now,' hoping it would come back,\" Seacrest told her. \"It was rumored to be going to other networks. I had no idea that it was being talked about to come here until late last week. I saw some rumor in the news, so I made a phone call, and they said, 'Yeah it may actually end up here,' and I said, 'That'd be good to know, since I work here.\"\n\nBut, he added, \"I don't know if I can host,\" given the preparation he has to do every night to be ready for \"Live.\" Ripa cut him off -- \"Yes, you can!\" -- and said that the morning after \"Idol\" shows, \" you won't even have to think, I will do it all!\"\n\nSeacrest had been based in Los Angeles, but announced he'd move to New York City for the \"Live\" job and continue his other commitments out of studios there. He's still a staple radio presence, hosting \"On Air with Ryan Seacrest\" every weekday morning and \"American Top 40\" on the weekends.\n\nOh, and Seacrest will continue to interview celebrities before all award shows on the E! red carpet; host \"Dick Clark's New Year's Rockin' Eve with Ryan Seacrest\" on Dec. 31; and executive produce the E! Kardashian empire shows.\n\nBut how much Seacrest is too much Seacrest? He was a constant, but not a standout presence on \"Idol\" -- which is why he was so good at the job, The Washington Post's Emily Yahr wrote last year.\n\n\"Sometimes, you just forget he's there. That's intentional, and really, the mark of an excellent host,\" she wrote. \"Move the proceedings along; banter with contestants; throw in a quip or two; and make it look so easy that no one realizes how hard you're working.\"\n\n\"It's not that he's multi-talented; he's anti-talented, not a performer but a professional 'personality,' the latest variation on a type as old as broadcasting: the guy who stands there and introduces the acts,\" former Post TV critic Tom Shales wrote in a 2008 profile of Seacrest. \"He's a low-key cheerleader who keeps the show moving and, with the judges as natural foils, allies himself with the audience and the contestants, never threatening to upstage the performers, even if he could.\"\n\nAdvertisement\n\n\"Idol\" was a ratings juggernaut in its early years -- at times, it was America's most-watched show -- but the numbers dropped toward the end of the series' run. At its peak, it drew more than 30 million viewers. But by its 15th season, that number hovered around 9 million.\n\nStill, the show had a profound and lasting influence on pop culture, shaping public perceptions of what qualified as \"good singing\" and ushering in a new era of reality TV shows, particularly competition shows (\"The Apprentice\" debuted two years after \"Idol\"). The show also helped launch singing careers -- Jennifer Hudson, Kelly Clarkson, Carrie Underwood, Adam Lambert, etc. -- and past contestants have collectively netted 14 Grammys, two Golden Globes and an Oscar.\n\nClearly, ABC sees massive potential in trying to recapture some of that magic, even if the playing field of reality TV remains crowded. NBC has aired its own singing competition show \"The Voice\" since 2011, and ABC is home to \"The Bachelor\" and \"Dancing with the Stars.\"\n\n\"All of the intense ‎speculation surrounding the comeback of 'American Idol' demonstrates just how popular and powerful this brand remains,\" Peter Hurwitz, CEO of Core Media CEO, which produces \"Idol,\" said in a statement. \"ABC shares our belief in the enduring value of 'Idol' and will provide us with the perfect new home to showcase the gold standard of singing competition shows.\"\n\nRELATED STORIES:\n\nNBC in talks to revive 'American Idol'\n\nAdvertisement\n\n'American Idol' exits with largest finale audience in three years\n\nHow former Chicago-area contestants said goodbye to 'American Idol'", "images": ["https://www.chicagotribune.com/resizer/zdKDkD8QEPRzIHOafFLQ5u68uks=/1440x1080/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/WS2GNZWSKSA2DMJOHJXPT4SKEY.jpg", "https://www.chicagotribune.com/resizer/gZnUIVYPOoiOje307lmxUlyPFGc=/1440x1080/filters:format(jpg):quality(70):focal(788x13:798x23)/cloudfront-us-east-1.images.arcpublishing.com/tronc/QXEG474RL5CEJFPQPFE4PG3B2U.jpg", "https://www.chicagotribune.com/pf/resources/icons/Menu_Icon.svg?d=87", "https://www.chicagotribune.com/resizer/LPp3r19OwnG0wav8FhKq4R381y4=/1440x1080/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/YWP5N5QGBFHABC4COYJJGCSZ2Q.jpg", "https://www.chicagotribune.com/resizer/R8SS7BkTUJyiJiSs2gWDuCIKtZk=/800x0/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/Y6ZAQC7D2BA6LIMTUXUVBK56GI.jpg", "https://static.themebuilder.aws.arc.pub/tronc/1657752787005.svg", "https://www.chicagotribune.com/resizer/ONw8Six2hq_zMh2AgkE6k4F5HGk=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/Y6ZAQC7D2BA6LIMTUXUVBK56GI.jpg"], "top_img": "https://www.chicagotribune.com/resizer/ONw8Six2hq_zMh2AgkE6k4F5HGk=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/Y6ZAQC7D2BA6LIMTUXUVBK56GI.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.chicagotribune.com/entertainment/tv/ct-american-idol-abc-20170507-story.html", "title": "'American Idol' is coming back &#8212; does that mean even more Ryan Seacrest? – Chicago Tribune", "meta_data": {"language": "English (United States), en-US", "viewport": "width=device-width, initial-scale=1", "content-id": "5YHANQ5SYJEM3DIV3AC65KQCG4", "apple-itunes-app": "app-id=383137151, app-argument=http://www.chicagotribune.com/deeplinkid5YHANQ5SYJEM3DIV3AC65KQCG4", "description": "It's officially happening: After going dark in 2016 on Fox, \"American Idol\" will be back on your television sets.", "twitter": {"description": "It's officially happening: After going dark in 2016 on Fox, \"American Idol\" will be back on your television sets.", "title": "'American Idol' is coming back &#8212; does that mean even more Ryan Seacrest?", "image": "https://www.chicagotribune.com/resizer/ONw8Six2hq_zMh2AgkE6k4F5HGk=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/Y6ZAQC7D2BA6LIMTUXUVBK56GI.jpg", "site": "@chicagotribune", "card": "summary_large_image"}, "og": {"description": "It's officially happening: After going dark in 2016 on Fox, \"American Idol\" will be back on your television sets.", "title": "'American Idol' is coming back &#8212; does that mean even more Ryan Seacrest?", "image": "https://www.chicagotribune.com/resizer/ONw8Six2hq_zMh2AgkE6k4F5HGk=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/Y6ZAQC7D2BA6LIMTUXUVBK56GI.jpg", "type": "article", "site_name": "Chicago Tribune", "url": "https://www.chicagotribune.com/entertainment/tv/ct-american-idol-abc-20170507-story.html", "locale": "en_US"}, "keywords": "american idol,abc,ryan seacrest", "robots": "noarchive", "distribution": "global", "rating": "general", "googlebot-news": "index", "copyright": "Copyright © 2022, Chicago Tribune", "fb": {"page_id": "5953023255,104061989632161,330360537007411,264870045299,73734231949,53310156364,40762490776,60569705796,121922684499844,182379588445160,62915602634,1987930441432108,119608021389933,745745225518281", "pages": "https://www.facebook.com/chicagotribune", "app_id": 306836229411287, "admins": 100000786395051}, "fb_title": "'American Idol' is coming back &#8212; does that mean even more Ryan Seacrest?", "y_key": "cee2fe4077f8d050", "msvalidate.01": "AAC9C18F70AC386BC4DCF4DDF9BF1786", "article": {"publisher": "Chicago Tribune", "tag": "American Idol,ABC,Kelly Ripa,Ryan Seacrest,Dick Clark,Carrie Underwood,Kelly Clarkson", "content_tier": "locked"}, "google": "nositelinkssearchbox"}, "movies": [], "publish_date": 1494111600.0, "source": "https://www.chicagotribune.com", "summary": ""}