{"url": "https://www.vanityfair.com/hollywood/2018/07/sacha-baron-cohen-who-is-america-corinne-olympios-bachelor-in-paradise", "text": "The second episode of Sacha Baron Cohen’s predictably controversial Who Is America?, which aired Sunday night, showcased the team’s effort to get reality star Corinne Olympios to say something stupid on TV. She did, of course: Cohen, as “reclusive Italian billionaire” Gio Monaldo, had Corinne pose in a hazmat suit in front of a greenscreen so that she could be Photoshopped into real charity work fighting Ebola, and then prodded her to invent a story about how she saved 6,000 innocents from being massacred in Sierra Leone. Olympios looked a little confused at points, but overall, fell for Cohen’s ruses. When he asked her to assert that she was in Sierra Leone for a month, she dropped her “interviewee” voice to point out that “they” would know she was never really there. Cohen, as the expansive, ponytailed art director, waved this away, explaining it was his charity.\n\nOnce she realized she’d been duped, Olympios spoke with Vanity Fair about the encounter. She seemed fairly good-natured about the setup—and in her line of work, any publicity works to her benefit. But reading between the lines, Who Is America?’s devices appear more like entrapment than sportsmanlike hoodwinking. Olympios was separated from her manager and her phone, and when she tried to ask questions about what was happening to her, Cohen and his team repeatedly assured her that everything was “fine”—“It’s a big deal. You’re going to be on the cover of this magazine. It’s fine.”\n\nShe described being so nervous that she was shaking, and said the crew evaded her questions about her manager, pretending that he was on the phone elsewhere when they’d actually sent him home. At one point, she said, she thought to herself, while panicked and hyperventilating, “Oh my God, am I going to die? Is this O.K.? Am I O.K.?” When she left, she said, she cried for hours. Discovering she had merely been subjected to a prank from Cohen was a relief, she said, because “imagine if that was real.”\n\nOlympios became famous after her heel turn on The Bachelor, known for vapid quips that made the audience, and the other contestants, love to hate her. As Vulture’s Kathryn VanArendonk wrote, she never quite fit into the villain edit, but she was certainly memorable—a woman who bragged about her “platinum vagine” and was especially fond of cheesy pasta. In classic reality-star form, Olympios seemed to thrive on the controversy she created—a necessary character trait in the vicious world of reality television, albeit one that tends to incense viewers.\n\nBut after that show ended, Olympios moved to another series in the Bachelor-verse, and became known for something quite different: a drunken hookup she had with DeMario Jackson that unnerved a Bachelor in Paradise producer so much that the producer filed a complaint, reportedly over the conviction that Olympios was not in a position to consent to the sex act. Production on the show was subsequently halted. After the incident made headlines, Olympios made an unambiguous statement to People: “I am a victim . . . As a woman, this is my worst nightmare and it has now become my reality.”\n\nThe scandal hit a few months before the #MeToo moment swept the industry; one wonders how it would have played just a few months later. At the time, though, the franchise managed to squash it; an internal investigation by Warner Bros., which produces The Bachelor, concluded that no misconduct had occurred. The series returned in a dog-and-pony show my colleague Laura Bradley dubbed Bachelor in Paradise: We Are Not Liable. After the investigation, Olympios also appeared for an interview with host Chris Harrison in which she said that, actually, she didn’t blame Jackson for what happened, instead attributing it to a medication she had been taking during filming that should not be combined with alcohol.\n\nCohen has long expressed contempt for anyone who yearns for media exposure, and so in that regard, Olympios fits the bill. But even if Olympios weren’t the possible victim of a sexual assault—if Who Is America? had targeted any other Bachelor contestant from this past season—this sketch would still be a troubling one. Olympios was called to be a model on a photo shoot, which is to say, she was asked to come in and defer to someone else’s artistic vision and direction. Sure, she was there as a celebrity, but the person behind the camera was in charge. It’s beyond reason why Cohen and Who Is America? would choose to target a figure at the center of such a sordid story. The show is calling her integrity into question in the same way that it is calling the integrity of conservative politicians into question, as if that is an apples-to-apples comparison.\n\nAnd in high-fashion photography and modeling, which is the industry Cohen pretends to be affiliated with as his character Gio, abuse and exploitation are rampant. Under the guise of art direction, male photographers like Terry Richardson have simulated sex acts, whipped out their genitals, and pressured their usually female subjects to remove their clothing. A Boston Globe Spotlight investigation involved interviews with more than 50 models and found that almost 60 percent reported inappropriate physical contact, in offenses ranging from touching to rape—typically early in their careers. And male models can be just as vulnerable as their female counterparts. (In the wake of multiple misconduct allegations, Condé Nast, which owns Vanity Fair, severed ties with several photographers—first Richardson, in the fall of 2017, then Mario Testino and Bruce Weber in January of 2018.)", "images": ["https://media.vanityfair.com/photos/62100dc174854b6731411914/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/5b522c657afbd52d21c835dd/master/w_1600%2Cc_limit/Elon-Musk-Thailand-Cave-Movie-SS03.jpg", "https://media.vanityfair.com/photos/61e0aaf2b8d453b000d50805/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/606484055e531a46c84d7e57/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/5b522c646674802aa17a52fd/master/w_1600%2Cc_limit/Elon-Musk-Thailand-Cave-Movie-SS01.jpg", "https://media.vanityfair.com/photos/5b48bec94da5840c0f8c07ce/1:1/w_350%2Ch_350%2Cc_limit/Sacha-Baron-Cohen-Victims.jpg", "https://media.vanityfair.com/photos/633dac5a42c2d8adf3fa7d9c/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/620ad531f518ba2b0f8f82d6/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/5b4b7ed86c0055288786d9c4/1:1/w_350%2Ch_350%2Cc_limit/WHOISAMERICA_PRArt_01.R.jpg", "https://media.vanityfair.com/photos/59f7a0246ed7fa227a5ed15f/1:1/w_350%2Ch_350%2Cc_limit/Bachelor-Lawsuit.jpg", "https://media.vanityfair.com/photos/5b573eed11d0902df883bd17/master/w_2560%2Cc_limit/SBC-Corinne.png", "https://media.vanityfair.com/photos/5b522c6586e0bf2bba310a34/master/w_1600%2Cc_limit/Elon-Musk-Thailand-Cave-Movie-SS02.jpg", "https://media.vanityfair.com/photos/63370d0bb02ed9e1f657fa60/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://www.vanityfair.com/verso/static/hwd/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/5d3d1e975989820008deba1f/1:1/w_90%2Cc_limit/Sonia_Saraiya%2520(1).png", "https://media.vanityfair.com/photos/623a28a1e700ab34afc82b7f/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/633d9bec72fe11ef3849c3ef/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/5b573eed11d0902df883bd17/16:9/w_1280,c_limit/SBC-Corinne.png", "https://media.vanityfair.com/photos/61a697e0140a0a2a376e0967/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://www.vanityfair.com/verso/static/hwd/assets/logo-header.ea437ae89b8c3c7aabbb46bb45a04f1a514e5803.svg", "https://media.vanityfair.com/photos/5b5211a081c38c357c286f51/1:1/w_350%2Ch_350%2Cc_limit/Corinne-Olympios-Who-is-America.jpg"], "top_img": "https://media.vanityfair.com/photos/5b573eed11d0902df883bd17/16:9/w_1280,c_limit/SBC-Corinne.png", "keywords": [], "authors": ["Condé Nast", "Sonia Saraiya"], "canonical_link": "https://www.vanityfair.com/hollywood/2018/07/sacha-baron-cohen-who-is-america-corinne-olympios-bachelor-in-paradise", "title": "The Troubling Truth Behind Who Is America?’s Corinne Olympios Prank", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "Sacha Baron Cohen has made a career skewering the powerful, but something else altogether happened when he went after the former Bachelor contestant.", "id": "5b573de6c888a076c603b707", "keywords": "corinne olympios,sacha baron cohen,who is america,showtime", "news_keywords": "corinne olympios,sacha baron cohen,who is america,showtime", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "5b573de6c888a076c603b707", "parsely-metadata": "{\"description\":\"Sacha Baron Cohen has made a career skewering the powerful, but something else altogether happened when he went after the former Bachelor contestant.\",\"image-16-9\":\"https://media.vanityfair.com/photos/5b573eed11d0902df883bd17/16:9/w_1000,c_limit/SBC-Corinne.png\",\"image-1-1\":\"https://media.vanityfair.com/photos/5b573eed11d0902df883bd17/1:1/w_1000,c_limit/SBC-Corinne.png\"}", "og": {"description": "Sacha Baron Cohen has made a career skewering the powerful, but something else altogether happened when he went after the former Bachelor contestant.", "image": "https://media.vanityfair.com/photos/5b573eed11d0902df883bd17/16:9/w_1280,c_limit/SBC-Corinne.png", "site_name": "Vanity Fair", "title": "The Troubling Truth Behind Who Is America?’s Corinne Olympios Prank", "type": "article", "url": "https://www.vanityfair.com/hollywood/2018/07/sacha-baron-cohen-who-is-america-corinne-olympios-bachelor-in-paradise"}, "article": {"content_tier": "metered", "opinion": "false", "section": "tags", "published_time": "2018-07-24T16:45:09.739Z", "modified_time": "2018-07-24T16:45:09.739Z", "author": "Sonia Saraiya"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "Sacha Baron Cohen has made a career skewering the powerful, but something else altogether happened when he went after the former Bachelor contestant.", "domain": "https://www.vanityfair.com", "image": "https://media.vanityfair.com/photos/5b573eed11d0902df883bd17/16:9/w_1280,c_limit/SBC-Corinne.png?mbid=social_retweet", "site": "@VanityFair", "title": "The Troubling Truth Behind Who Is America?’s Corinne Olympios Prank"}, "fb": {"app_id": 256281040558, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": 1532450709.739, "source": "https://www.vanityfair.com", "summary": ""}