{"url": "https://www.elle.com/culture/celebrities/a25654362/taylor-swift-joe-alwyn-relationship-timeline/", "text": "When Taylor Swift first began dating actor Joe Alwyn more than four years ago, it was almost immediately clear the couple had come to an agreement: Their relationship would be an intimate but private one, and they’d be a united front in protecting that privacy. Gone were the paparazzi photo ops of Swift’s days with Tom Hiddleston, and gooey Instagram pics—like the ones she’d posted with Calvin Harris—would no longer populate her social media. Instead, her accounts would focus on promoting her work and sharing photos of her other loves: cats Olivia, Meredith, and Benjamin.\n\nStill, a love story like Swift and Alwyn’s couldn’t stay behind closed doors forever, and since 2020, they’ve been more public about their relationship than ever before. This includes Swift’s confirmation that Alwyn co-wrote two songs on folklore under the pseudonym William Bowery and also helped pen three tracks from Swift’s latest record, evermore. As we eke out the details, scroll below for a timeline of their coupledom, leading up to their collaboration on Swift’s ninth album and the brewing engagement rumors.\n\nMay 2, 2016: They meet at the Met Gala (probably).\n\nNobody knows for sure when Swift and Alwyn first met. But sleuths have determined that the song “Dress” on her 2017 album Reputation might refer to their first meeting.\n\nThe lyrics in question: “Flashback to when you met me, your buzzed cut and my hair bleached.” Swift’s hair was, indeed, bleached at the Met Gala, and Alwyn’s hair was buzzed.\n\nNeilson Barnard // Getty Images\n\nAt the time, Swift was still dating Harris—and this was also the night she met Hiddleston and danced goofily with him in a video that went viral, and later sparked the rebound heard ‘round the world . It was an eventful night for Tay.\n\nOct. 12, 2016: Swift and Alwyn attend the same Kings of Leon concert.\n\nA month after breaking up with Hiddleston, Swift went to a Kings of Leon show with her friends. Online sleuths have since determined that Alwyn was at the show, too.\n\nNov. 12, 2016: Swift attends Alwyn’s movie screening.\n\nSwift and a gaggle of squad members went to the premiere of Alwyn’s film, Billy Lynn’s Long Halftime Walk. If she and Alwyn were dating at this point, it was so under the radar that press coverage of the premiere didn’t even mention his name. It’s not clear if he was in attendance.\n\nAlwyn at the photo call for Billy Lynn’s Long Halftime Walk. Kris Connor // Getty Images\n\nMay 16, 2017: Reports emerge that they’re dating.\n\nA source close to the pair told The Sun that Swift and Alwyn had been together for a few months, and that their friends and families were in on it:\n\n“This isn’t a new couple alert or a secret relationship - the only people this has been a secret to is the media because all of us, Taylor and Joe’s closest friends and their families, were aware they have been together for several months and have known each other for a long time.\n\n“After her 1989 tour and all the attention Taylor received, she learned she had to be more protective of her personal life and she and Joe decided early on to keep their private life private.”\n\nJune 5, 2017: They’re caught by the paparazzi in Nashville.\n\nThe paparazzi finally caught the couple in action : sitting on a balcony in Nashville, where Alwyn was allegedly meeting Swift’s parents for the first time.\n\nJuly 25, 2017: They’re caught again, this time in New York.\n\nHoodies pulled tight over their faces, the couple were caught leaving Swift’s apartment.\n\nSwift and Alwyn seemed desperate to go incognito in these pics .\n\nOct. 20, 2017: Swift tells fans her new single “Gorgeous” is about Alwyn.\n\nSwift hosted a “secret” listening session for her new album, Reputation. She allegedly told fans the single “Gorgeous” is about Alwyn.\n\n“Basically Taylor made us all promise that if anyone made any accusations of who this song is about, we tell them it is 100 percent about her angel boyfriend of one year,” a fan wrote on Tumblr. “This isn’t a secret. She wanted us to tell people.\"\n\nOct. 27, 2017: Ed Sheeran spills the beans on Alwyn.\n\nOn the heels of Swift’s revelation that “Gorgeous” is about Alwyn, her good friend Ed Sheeran was asked about Alwyn on a British radio show.\n\n“He’s really nice,” he said . “Really, really friendly, really good dude.”\n\nDec. 11, 2017: The couple is spotted snuggling during an Ed Sheeran performance.\n\nMomentarily letting their guard down, Swift and Alwyn engaged in some honest-to-god PDA while Ed Sheeran performed at iHeartRadio’s Jingle Bell Ball in New York City.\n\n“THEY LITERALLY SLOW DANCED TO ALL EDS SONGS WITH THEIR ARMS AROUND ONE ANOTHER AND JUST KEPT LOOKING AT EACH OTHER AND KISSING,” a fan tweeted, according to EW .\n\nMay 8, 2018: They post coordinating cactus photos to Instagram.\n\nBoth Alwyn and Swift posted photos of themselves, solo, standing next to the same cactus.\n\nAlwyn later said they didn’t even realize the photos coordinated.\n\n“I didn’t even think of that until I was in New York and someone else mentioned it,” he said, according to ET . \"It wasn’t purposeful at all!”\n\nThis is the closest we’ve come to an “Instagram-official” moment for the couple.\n\nSept. 19, 2018: Alwyn talks about Swift for the first time—but only to say he doesn’t want to talk about her.\n\n“I’m aware people want to know about that side of things,” he said to British Vogue. “I think we have been successfully very private and that has now sunk in for people…but I really prefer to talk about work.”\n\nOct. 18, 2018: Alwyn speaks very, very briefly about Swift’s newfound political activism.\n\nIn early October, Swift finally waded into the political world to endorse two Tennessee congressional candidates, after a career-long silence.\n\nA few days later, an interviewer asked Alwyn how he felt about Swift’s post.\n\n“I think it’s great, and I think it’s important,” he said, before uncomfortably shuffling away.\n\nNov. 23, 2018: Swift acknowledges Alwyn’s existence on social media.\n\nAfter two years of knowing him, Swift finally posted something about Alwyn—or at least, his work—on Instagram.\n\nIt was a clipped trailer for his new movie, The Favourite, with a caption calling the film “phenomenal” and imploring her followers to go see it. She tagged the movie’s account, plus Alwyn’s and Nicholas Hoult’s.\n\nNov. 25, 2018: Alwyn reiterates that he’d like to keep his private life private.\n\nIn an interview with GQ , he skirted around the topic of Taylor, saying, “Someone’s private life is, by definition, private. No one is obliged to share their personal life.”\n\nHe also declined to name a favorite Swift song. “I’m just not even going to go into that side of the world,” he said .\n\nDec. 7, 2018: Alwyn opens up a teeny bit about their relationship.\n\nJust to mix things up, Alwyn provided a tiny kernel of information about his relationship with Swift, before saying he didn’t want to talk about it.\n\nEsquire asked him if he sought out any guidance from friends when he started dating Swift.\n\n“I didn’t seek out advice on that,” he said. “Because I know what I feel about it. I think there’s a very clear line as to what somebody should share, or feel like they have to share, and what they don’t want to and shouldn’t have to.”\n\nDec. 11, 2018: Swift attends Alwyn’s movie premiere in London.\n\nSwift popped up at the Cineworld Leicester premiere of Mary Queen of Scots as well as an after-party.\n\nJan. 6, 2019: Swift and Alwyn attend the Golden Globes (separately).\n\nAlwyn attended the awards show for his nominated film The Favourite, and Swift presented Best Original Score and Best Original Song during the 2019 Golden Globes. Although they didn’t walk the red carpet together, an Us Weekly source claimed the two got quite flirty while she was onstage.\n\n“While Taylor presented, Joe watched the teleprompter near him and smiled and (his Favourite costar) Nicholas Hoult patted him on the back,” the source said. “After Gaga walked on stage, Joe shifted his gaze to the stage near Taylor.” The insider added, “She was smiling at him while she walked off the stage. She looked over her shoulder and gave a sassy cute little smile at his table’s direction.”\n\nHandout // Getty Images\n\nFeb. 10, 2019: Swift and Alwyn step out at a BAFTAS after party.\n\nSwift skipped the Grammy Awards in favor of attending a BAFTAs after party with her beau. Clad in a pale blue Stella McCartney gown, Swift gave off major Cinderella vibes alongside Alwyn. The two were even photographed walking together hand-in-hand. (A rare occurrence for this secretive duo!)\n\nGOR // Getty Images\n\nMarch 2019: Engagement rumors begin.\n\nAs Swift continued filming the big screen version of Cats in London, reports swirled that getting engaged to Alwyn was not far off. “Taylor’s friends are all talking about a proposal and how she really wants to marry Joe,” an Us Weekly source shared. “He’s her dream guy.”\n\nA People source echoed those sentiments, saying, “Taylor really got lucky to meet Joe, and she is the first one to say it. Joe really is one of a kind.”\n\nMay 2019: The couple is spotted on a couple dates.\n\nSwift and Alwyn ate breakfast at Café de Flore and then took a stroll through the city of Paris in a rare public outing.\n\nLater in the month, the couple made it a double date with similarly private pair Robert Pattinson and Suki Waterhouse. Per an Us Weekly onlooker, the four low-key celebs dined at San Vicente Bungalows in Hollywood, spending the night laughing and talking.\n\nAugust 2019: Swift releases Lover—and fans go nuts dissecting the lyrics.\n\nAhead of the August 23 release of her album Lover, Swift revealed to fans that new music would address her current relationship…in so many words. During a YouTube Live, she explained, “It’s a really romantic album, but it really celebrates love in all its complexity. Not just flowers and sunshine but the patchwork emotions that go into any love you feel.”\n\nOnce the album dropped, fans began dissecting every song for hidden clues about the couple. Some were even convinced the songs “Lover” and “Paper Rings” were Swift’s big marriage reveal.\n\nSwift continued to avoid talking about Alwyn in interviews. While speaking to The Guardian about why she wouldn’t speak on her relationship, she said, “I’ve learned that if I do, people think it’s up for discussion, and our relationship isn’t up for discussion,” she said with a laugh. “If you and I were having a glass of wine right now, we’d be talking about it—but it’s just that it goes out into the world. That’s where the boundary is, and that’s where my life has become manageable. I really want to keep it feeling manageable.”\n\nShortly after a People source gave an update on the relationship saying, “Joe’s personality is great for Taylor. He is very calm and always very supportive. He’s sympathetic and understanding and supports her speaking out about things that she doesn’t agree with.”\n\nEven her inner circle likes Joe, the source added: “There’s something refreshing and different about their relationship. Joe makes Taylor very happy, and it’s hard to picture her not spending the rest of her life with him. Her family loves him. He seems older than he is and is a fantastic guy.”\n\nAs for future comment from either party regarding the romance? The source says it’s unlikely: “Joe loves acting but doesn’t want to be a celebrity,” the source said. “They both agree that for their relationship to keep working, they want to keep things more quiet. She’s the happiest she’s ever been.”\n\nSeptember 2019: The couple is photographed on a private plane.\n\nThe two were photographed boarding Swift’s private plane after a low-key trip to her beach house in Watch Hill, Rhode Island.\n\nOctober 5, 2019: They’re seen together after SNL.\n\nIn a rare sighting for the couple, Alwyn and Swift were seen holding hands after the singer’s Saturday Night Live performances. They headed to New York’s Zuma for the show’s after party.\n\nJackson Lee // Getty Images\n\nNovember 2019: Swift joins Alwyn for Thanksgiving.\n\nSwift celebrated Thanksgiving in London with Alwyn, according to E!, but not before hosting a splashy American Friendsgiving with friends including Gigi Hadid, Antoni Porowski, and Martha Hunt.\n\nInstagram\n\nEarly December 2019: The lovers spend time in London.\n\nUs Weekly and E! both ran reports early in the month stating things between the couple are still going well. “Taylor has had a tough year and Joe has been a rock for her,” a source told Us. “They are still going very strong.”\n\nMeanwhile, E! reported that,“Taylor has been spending a lot of down time in London,” per a source. “She doesn’t go out much other than to take a walk with Joe or go to the local pub. They spend a lot of time with Joe’s family and friends. All weekend they had people come over or they went to family members’ homes.”\n\nFurther proving the couple is doing just fine, Swift shared a photo of her Vogue UK cover on Instagram, which Alwyn liked right away.\n\nDecember 16, 2019: Alwyn supports Swift’s acting career.\n\nAlwyn was on hand to subtly support Swift at the NYC premiere of her new movie, Cats.\n\nJose Perez/Bauer-Griffin // Getty Images\n\nDecember 26, 2019: The couple spends Christmas together.\n\nAfter spending Thanksgiving together, E! reported that Swift spent her Christmas holiday in London, too. “Taylor spent the holidays in England with Joe,” a source told the outlet. “She was there for the week leading up to Christmas and spent time with Joe’s family and friends. Some of Taylor’s family also flew in from Nashville to spend time with them.”\n\nJanuary 1, 2020: The duo are serenaded in the Maldives.\n\nAlwyn and Swift rang in New Year’s Eve with a concert in the Maldives. Although neither party revealed the travel plans themselves, singer Matthew Crane posted the news himself on Instagram. “So I can now finally reveal who I sung to on New Year’s Eve in the Maldives, probably the most notable Pop Star at the moment, the one and only @taylorswift and @joe.alwyn,” he wrote on his Instagram. “They were both so friendly and kind to me when I performed, they even gave me a standing ovation and complimented on my voice. It was truly an honor and an experience that I will never forget. 🎤🎶”\n\nJanuary 5, 2020: Alwyn and Swift sit together at the 2020 Golden Globes.\n\nThe couple had their most public outing to date at the 2020 Golden Globes, where Swift was a presenter and nominee for Best Original Song - Motion Picture for her and Andrew Lloyd Webber’s new original song for Cats, “Beautiful Ghosts.” While they didn’t walk the red carpet together, onlookers captured Swift and Alwyn taking their seats next to each other inside the ballroom:\n\nE! also tweeted out a photo of the pair sitting side-by-side, Alwyn in a tux and Swift in an Etro gown:\n\nNext, the couple of more than three years was spotted at the Golden Globes CAA after party. A source told E! that Swift (in a a sparkly navy Alexandre Vauthier dress) wasn’t afraid to show PDA with Alwyn. “They looked inseparable and really in love,” the source noted. “Taylor had her arm on Joe, and she leaned in to kiss him several times.”\n\nJanuary 31, 2020: Miss Americana drops on Netflix.\n\nWith the release of Swift’s documentary Miss Americana, came new insight into her romance with Alwyn. She spoke vaguely about why she fell for Alwyn in the fall of 2016, after her Kim Kardashian Snapchat drama had tarnished her reputation. “I felt alone, I felt really bitter,” she explained. “I felt sort of like a wounded animal lashing out. I figured I had to reset everything. I had to reconstruct an entire belief system for my own personal sanity. I also was falling in love with someone who had a wonderfully normal, balanced life.”\n\n\n\nSwift also revealed why she and Alwyn chose to keep their relationship quiet. “We decided together we wanted our relationship to be private,” she said. “Even though it [Swift’s public image in 2016] was really horrible, I was happy. But I wasn’t happy in the way I was trained to be happy. It was happiness without anyone else’s input. We were just…happy.”\n\nThose searching for Alwyn appearances won’t find much. He kissed her hand in the car at one point and hugged her backstage after a performance of “Getaway Car” on tour. Swift also serenaded Alwyn with a song believed to be about him from her album Reputation. She sang the song “Call It What You Want” to him while he filmed her.\n\nFebruary 12, 2020: They’re spotted at the NME Awards.\n\nJust before Valentine’s Day, Swift and Alwyn got close in the audience of the NME Awards in London. An audience member spotted Swift, sporting a two-tone Monse short suit, and Alwyn kiss and hug when she was announced the winner of Best Solo Act.\n\nFebruary 23, 2020: They celebrate Alwyn’s birthday.\n\nFor Alwyn’s 29th birthday, Swift joined her beau, along with Ed Sheeran and his wife, Cherry Seaborn, for a celebration in London. The foursome and a few other friends hung out at restaurant Bob Bob Richard in Soho, per E! News. “They had fun drinking champagne at the table by pushing a button that says ‘Press for Champagne’ and having it immediately dispensed,” a restaurant source told E!. “They were there for several hours enjoying the night.”\n\nMarch 24, 2020: We learn they’ve talked about marriage.\n\nAn Us Weekly source gave an update on marriage talks between Alwyn and Swift. “[They] have talked about their future and marriage,” a source told the outlet. “They don’t have a set deadline in place, but they’re very much in love.” The source added, “Taylor considers Joe one of the only safe constants in her life. He has always been a huge support and stuck by her.”\n\n\n\nApril 29, 2020: The lovers finally share some details on social media.\n\nAlwyn shared a rare glimpse into his relationship with Swift on social media, leading fans to believe they’re quarantining together. He posted several photos of Swift’s cat Benjamin Button around her place. (The decor matches the background of this recent Swift post.)\n\nInstagram\n\nInstagram\n\nAlwyn also shared a photo of himself drinking a large glass of white wine, which is similar to a May 7 post from Swift where she’s holding a glass of vino. “I love spending a full evening cooking a meal while sipping a glass of wine and listening to old music,” Swift even told People of her quarantine routine, via Billboard.\n\nInstagram\n\nMay 13, 2020: More photos arise.\n\nA couple weeks later, Alwyn delivered another quarantine update on Instagram. He posted several photos on his Instagram Story, including a few that showcase Swift’s cat, Benjamin.\n\nInstagram\n\nInstagram\n\nAlwyn also shared a black-and-white photo of himself drinking coffee and glancing over at the camera. Fans have speculated that Swift took that photo, just as they’ve guessed Alwyn is quietly taking hers.\n\nInstagram\n\nJuly 23, 2020: folklore speculation begins.\n\nSeveral months into Swift and Alwyn’s relatively quiet quarantine, Swift announced the surprise release of her eighth album, folklore. While fans awaited the 16-track release, social media was already speculating about which songs were inspired by Alwyn.\n\nThe first song that some lyrics were available for was \"cardigan.\" An excerpt of the track’s lyrics were found on the back of a new merch item on Swift’s website. “But I knew you / Playing hide-and-seek and / Giving me your weekends / I knew you / Your heartbeat on the High Line / Once in twenty lifetimes / And when I felt like I was an old cardigan / Under someone’s bed / You put me on and said / I was your favorite,” the romantic lyrics read, hinting at her longtime love with Alwyn.\n\nAnother theory regarding Alwyn and folklore was that the song “betty” refers to Alwyn’s mother of the same name. Since then, it’s been reported that the track actually reveals the name of Blake Lively and Ryan Reynolds’ third daughter. Even more interesting: Some seemed to think that Swift’s album collaborator, William Bowery, is Alwyn himself. When announcing her album, Swift shared her co-writers and producers for folklore, but didn’t tag Bowery. Conspiracy theorists seemed to think Alwyn and Swift being spotted outside the Bowery Hotel in October 2016, coupled with the fact that Alwyn’s great-grandfather is named William, means he’s behind the pseudonym.\n\nJuly 24, 2020: folklore is released.\n\nWith the release of folklore, answers to several questions about Alwyn’s musical inspiration were provided. On the track “invisible string,” Swift references a London yogurt shop that Alwyn worked in as a teen, as well as the dive bars of their early relationship and a trip for their third anniversary. Other songs, including bonus track “the lakes” and “peace” also allude to Swift and Alwyn’s relationship. An excerpt from “Peace,” for example:\n\nAll these people think love’s for show/But I would die for you in secret/The devil’s in the details, but you got a friend in me/Would it be enough if I could never give you peace? And you know that I’d swing with you for the fences/Sit with you in the trenches/Give you my wild, give you a child/Give you the silence that only comes when two people understand each other/Family that I chose, now that I see your brother as my brother.\n\nNovember 13, 2020: More lyrics are explained.\n\nSwift confirmed that Alwyn helped inspire “peace” during a conversation with Paul McCartney for Rolling Stone. She said that the song “is actually more rooted in my personal life. I know you have done a really excellent job of this in your personal life: carving out a human life within a public life, and how scary that can be when you do fall in love and you meet someone, especially if you’ve met someone who has a very grounded, normal way of living. I, oftentimes, in my anxieties, can control how I am as a person and how normal I act and rationalize things, but I cannot control if there are 20 photographers outside in the bushes and what they do and if they follow our car and if they interrupt our lives. I can’t control if there’s going to be a fake weird headline about us in the news tomorrow.”\n\nWhen McCartney asked if Swift’s partner was able to “sympathize with that and understand,” she replied, “Oh, absolutely.” But Swift added that her relationship with Alwyn had changed her viewpoint on maintaining privacy in her personal life. “But I think that in knowing him and being in the relationship I am in now, I have definitely made decisions that have made my life feel more like a real life and less like just a storyline to be commented on in tabloids,” she explained. “Whether that’s deciding where to live, who to hang out with, when to not take a picture—the idea of privacy feels so strange to try to explain, but it’s really just trying to find bits of normalcy. That’s what that song ‘Peace’ is taking about. Like, would it be enough if I could never fully achieve the normalcy that we both crave? [McCartney’s designer daughter] Stella always tells me that she had as normal a childhood as she could hope for under the circumstances.”\n\nNovember 25, 2020: Swift confirms William Bowery’s identity.\n\nMonths after the release of folklore, Swift finally confirmed what her fans had long suspected: songwriter William Bowery is Alwyn. Speaking to the album’s producers, Jack Antonoff and The National’s Aaron Dessner, Swift revealed that “betty” and “exile” were co-written by Alwyn in the Disney+ film, folklore: the long pond studio sessions. “So, William Bowery is Joe…as we know,” she teased.\n\n“Joe plays piano beautifully and he’s always just playing and making things up and kind of creating things. And ‘exile’ was crazy because Joe had written that entire piano part,” Swift explained, adding, “He was singing the Bon Iver part, the ‘I can see you standing honey, with his arms around your body, laughing but the joke’s not funny at all.’ He was just singing it. And I was entranced and asked if we could keep writing that one.” Swift said the fact that she and Alwyn are “really, really, really big Bon Iver fans” helped make the collaboration happen.\n\nAs for “betty” Swift said she heard Alwyn singing “the entire fully formed chorus from another room.” She added, “And I was just like ‘Hello.’ It was a step that we would never have taken because, why would we have ever written a song together?”\n\nIt was the couple’s first time working together, something Swift said she and Alwyn approached cautiously. “So this was the first time we had a conversation where I came in and I was like, ‘Hey, this could be really weird, and we could hate this, so because we’re in quarantine and there’s nothing else going on, could we just try to see what it’s like if we write this song together?’” she recalled.\n\nDecember 3, 2020: The engagement rumors heat up again.\n\nIn early December, Swift released a snippet of her re-recorded version of “Love Story,” which could be heard in a Match.com commercial featuring friend Ryan Reynolds. The new recording made waves as it was the first concrete indication that Swift was re-recording her entire catalogue owned by Scooter Braun. But it also sparked rumors about Swift and Alwyn potentially being engaged. Some fans noticed that the lyric “Baby, just say, ‘Yes’” might have been changed to “Baby, just said, ‘Yes.’” Several Swifties tweeted this theory in the hours after the song’s release. Multiple sources told E!, however, that the lyrics to the song had not changed.\n\nWhile Entertainment Tonight wasn’t able to confirm engagement theories, a source said the couple does talk about “their future together.” The insider said, “Joe has provided such a great support system for Taylor. He is the one constant in her life that she can truly rely on. Joe has helped Taylor with her music, inspiring it. She is so grateful for him and in love with him. He is her cheerleader and rock. They have spoken about their future together, and they love celebrating the holidays together and are looking forward to that.”\n\nET’s source also spoke about how Alwyn is supporting Swift as she deals with her mother Andrea’s cancer diagnosis. “[Taylor] has been having a tough time with her mom’s health, but her mom is getting treatment and she and her family have been trying to stay optimistic,” the source said. “She has been focusing on her music and spending a lot of time with Joe. Taylor wanted to take some time to herself and her family this year, so in that regard, the quarantine and break has been positive for her.”\n\nDecember 8, 2020: Swift shuts down engagement rumors.\n\nIn an interview with Entertainment Weekly, Swift subtly shut down engagement rumors when she called Alwyn her “boyfriend.” Swift had been discussing who knew she was making folklore during the interview, conducted in early November: “The only people who knew were the people that I was making it with, my boyfriend, my family, and then my management team,” she said. “So that’s the smallest number of people I’ve ever had know about something.”\n\n\n\nDecember 11, 2020: evermore appears.\n\nAbout five months after dropping folklore, Swift announced the surprise release of her ninth album, evermore. When the 15-track record debuted at midnight, Swifties quickly began dissecting which songs could be about her relationship with Alwyn. At least three songs directly involve the actor: “champagne problems,” “coney island” and “evermore.” William Bowery, Alwyn’s songwriting pseudonym, is credited on those tracks. Beyond that, lyrics for \"long story short\" and \"willow\" seem to reference Swift’s long-lasting love with Alwyn.\n\nBut for those hoping Swift would confirm either an engagement or marriage to Alwyn, no such luck. The only song that references a proposal, “champagne problems,” appears to be about a fictional couple and ends with the woman declining the offer. Additionally, multiple sources confirmed to TMZ that the two are not secretly married either.\n\nJanuary 11, 2021: The couple is finally photographed again.\n\nAfter 11 months of not being seen out together, Swift and Alwyn were photographed in London while on a walk with Alwyn’s mother, Elizabeth. The two were bundled up in winter gear. According to E!’s sources, Swift had been going back and forth between Nashville and London to spend time with her family and Alwyn’s family.\n\nJanuary 14, 2021: Swift hints she’s ready to bring the relationship into the public eye.\n\nA source told Entertainment Tonight that Swift is ready to be more public with her and Alwyn’s relationship. “Taylor has gotten more and more comfortable being public with Joe and letting fans in on their romance in a way that she feels is still protecting it,” the source explained. “She loves Joe so much and, of course, is not trying to hide their relationship, but she prefers to keep specific details private.” Additionally, the source said the couple was in it for the long haul and sees a future together.\n\nFebruary 17, 2021: Swift reveals Alwyn helped her decide to speak out on political issues.\n\nSwift wrote to Vanity Fair to discuss her documentary Miss Americana, and how she found her voice during the 2018 midterm elections—with the help of Alwyn.\n\nSwift opened up about how her partner helped her become more comfortable speaking out about politics, in rare public remarks about him.\n\nSwift wrote, “As a country musician, I was always told it’s better to stay out of [politics]...The Trump presidency forced me to lean in and educate myself. I found myself talking about government and the presidency and policy with my boyfriend [Joe Alwyn], who supported me in speaking out.”\n\nMay 11, 2021: Swift shouts out Alwyn (and many others) in a BRIT Awards speech.\n\nAfter becoming the first woman and youngest person ever to win BRIT Awards’ Global Icon award, Swift took the stage to thank friends and family—including Alwyn.\n\nDressed in a Miu Miu crop top and skirt, Swift told the audience about the joys and challenges of creating her most recent albums: “The world changed, and I ended up putting out three albums instead, so making folklore and evermore was one of the most unique, cathartic, extraordinary experiences I’ve ever had. I would love the opportunity to thank the amazing creative people that I made those albums with. Thank you, Aaron Dessner, thank you Jack Antonoff, Joe [Alwyn, Swift’s boyfriend], Justin Vernon, the National, Marcus Mumford, Jon Low, Serban Ghenea, Laura Sisk, and HAIM. I want to thank my friends and family who know exactly who they are: Whose opinion of me never changed whether my stock was up or down.”\n\nIn the clip below, you can watch Swift thank Alwyn specifically (around the 2:20 mark), accented by a slight pause and a sweet smile.\n\nMay 20, 2021: Marriage rumors continue to swirl.\n\nIn late May, Entertainment Tonight released a story confirming that Alwyn and Swift’s engagement rumor mill was alive and well.\n\n“They grew closer than ever during the quarantine and she really trusts him,” a source told ET. “They’ve been continuing to be pretty low-key about their relationship to the outside world to continue to protect it…They’ve discussed future plans and Taylor can see herself marrying Joe one day.”\n\nNovember 23, 2021: Swift visits Alwyn on set for latest movie.\n\nAlwyn did not make an appearance at Swift's Saturday Night Live musical guest spot in November, and it was because he was away on set filming a new movie. A source told E! that, “Taylor visited her boyfriend on the set of his movie.”\n\nShooting for The Stars at Noon began in October 2021, according to ScreenDaily. and Alwyn joined the cast to replace Taron Egerton, per Deadline, who “had to leave the project due to personal reasons.”\n\nDecember 19, 2021: Swift likes Alwyn's Instagram post from Panama.\n\nOn Sunday, December 19, Alwyn posted a series of photographs seemingly from the set of The Stars at Noon, and Swift liked it within minutes.\n\nInstagram\n\nAlwyn posed in the photos with director Claire Denis, who signaled she was in Panama as well with an image featuring the Panama flag.\n\nFebruary 9, 2022: Alwyn makes his first brief comment on Swift in years.\n\nWhile discussing his upcoming project Conversations With Friends, Alwyn confirms his relationship with Swift is closed. “I think people can do what they want and makes them happy. I’m obviously happy in a monogamous relationship,” Alwyn said, referring to Swift, via E!.\n\nFebruary 18, 2022: After engagement rumors spread, a source says that Swift and Alwyn have spoken about their future.\n\nLife & Style reported on February 17 that Swift and Alwyn privately got engaged. Their reps didn't comment on the rumor. A source spoke to Entertainment Tonight, not addressing engagement speculation but saying that the two prefer to keep their personal relationship private.\n\nSwift and Alwyn “are very happy in their relationship,” the source said. “They've been enjoying their time as a couple. They have spoken about their future together and feel very secure about their relationship.”\n\nThe source added that they've mastered balancing their careers with their relationship. “They're supportive of each other's careers and of each other in general,” the source said. “Both of them have been busy with work and they completely understand how to balance hectic schedules and still make time for each other. It's part of why their relationship really works.”\n\nMarch 26, 2022: Swift and Alwyn attend a pre-Oscars party together.\n\nIn a very rare public sighting of the couple, Alwyn and Swift hit up the CAA's pre-Oscars party at the San Vicente Bungalows. Two sources spoke to E! about what the two were like there. “Taylor was introducing Joe to many people around her,” the first source said. “She looked smitten and proud to be there with him.”\n\nA second source said that Swift and Alwyn “were very coupley and cute and seemed happy to be there together. Taylor and Joe were together all night. He was leading her around introducing her to people, and Taylor also introducing people to Joe. When Joe was leading Taylor around, he held his arm around her back.”\n\nApril 2022: In a series of interviews to promote Conversations With Friends, Alwyn touches on Swift...very slightly, including engagement rumors.\n\nOn April 13, he told ELLE UK of why he doesn't discuss their relationship in interviews: “It's not really [because I] want to be guarded and private, it's more a response to something else,” he said with a shrug. “We live in a culture that is so increasingly intrusive… The more you give—and frankly, even if you don't give it—something will be taken.” And that's all he offered about his personal life this time.\n\nOn April 19, to ELLE US, Alwyn said on the subject of writing more songs with Swift, “It’s not a plan of mine [to continue writing songs], no,” Alwyn said.\n\nOn April 20, he told WSJ on the subject of engagement rumors: “If I had a pound for every time I think I’ve been told I’ve been engaged, then I’d have a lot of pound coins. “I mean, the truth is, if the answer was yes, I wouldn’t say, and if the answer was no, I wouldn’t say.”\n\nOn April 30 to The Guardian, Alwyn addressed why he keeps his relationship with Swift private again and how he felt about them winning a Grammy for Folklore.\n\nOn what it's like dating Swift and the attention it garners, he said, “It’s not something I think about, unless I’m in situations like this, and someone says, ‘What’s it like?’ and I have to think about what to say about it. It’s just not for other people [our relationship]. And I don’t say that with aggression.”\n\n“I don’t know how best to talk about it,” he continued. “I mean, I’m aware of people’s … of that size of interest, and that world existing. It’s just not something I particularly care about, or have much interest in feeding, I guess, because the more it’s fed, the more you are opening a gate for intrusion. I think that’s just my response to a culture that has this increasing expectation that everything is going to be given. If you don’t post about the way you make your coffee in the morning, or if you don’t let someone take a picture when you walk out of your front door, is that being private? I don’t know if it is. So I just don’t really feed that. If you and I were having a conversation, and having a shandy in my house, and it wasn’t being recorded, then, of course, other things would be said.” (Alwyn's last remark echoed the one Swift made to The Guardian in 2019.)\n\nAnd on winning that Grammy and writing songs with Swift, he said, “It wasn’t like, ‘It’s five o’clock, it’s time to try and write a song together.’ It came about from messing around on a piano, and singing badly, then being overheard, and being, like, ‘Let’s see what happens if we get to the end of it together.’ I mean fun is such a stupid word, but it was a lot of fun. And it was never a work thing, or a ‘Let’s try and do this because we’re going to put this out’ thing. It was just like baking sourdough in lockdown. The Grammy was obviously this ridiculous bonus.”\n\nMay 2022: Joe Alwyn says he hopes people “stop caring” about their relationship in new interview.\n\nIn a new interviews with GQ, Alwyn reiterated again why he chooses not to speak about his relationship, “I think because the precedent was set—that our choice is to be private and not feed that side of things—the more you do that, hopefully, the more that intrusiveness or intrigue drops off.”\n\nJune 2022: Joe Alwyn and Taylor Swift are seen kissing during their vacation in the Bahamas.\n\nTMZ shared photos of the couple kissing for the summer solstice while vacationing together in the Bahamas. The blurry images show them embracing while neck-deep in the blue ocean waters.\n\nJuly 2022: Joe Alwyn and Taylor Swift go out for a date in London.\n\nOn July 15, the couple went out on a rare public date in London, where they were photographed by the waiting paparazzi. They enjoyed some ice coffee and time in a public park together. Swift's hand was briefly visible and there was no ring on her left hand, which some people took to mean that she is definitely not engaged.\n\nAugust 2022: Joe Alwyn and Taylor Swift are photographed on a dinner date in New York City ahead of the MTV VMAs.\n\nSwift and Alwyn signaled their relationship is going strong nearly six years in when the two were photographed grabbing dinner with Swift's longtime friend Lena Dunham during the last week of August. The three dined at Manhattan private members club Casa Cipriani, and once again, Swift appeared without any engagement ring on her left finger, debunking engagement rumors once more.\n\nMolly Mulshine Molly Mulshine is a writer and performer living in New York City by way of the Jersey Shore.\n\nSavannah Walsh Editorial Fellow Savannah Walsh is an Editorial Fellow at ELLE.com.", "images": ["https://hips.hearstapps.com/hmg-prod/images/taylor-swift-and-joe-alwyn-arrive-at-zuma-on-october-06-news-photo-1665150988.jpg?crop=0.591xw:0.531xh;0.226xw,0.0403xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/actor-joe-alwyn-attends-the-billy-lynns-long-halftime-walk-news-photo-614891796-1545408728.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1664981510.jpg?crop=1.00xw:0.735xh;0,0.0444xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/brad-pitt-and-angelina-jolie-attend-a-private-reception-as-news-photo-1664913566.jpg?crop=0.668xw:1.00xh;0.146xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/rihanna-bgus-2478374-004-1664978615.jpg?crop=0.566xw:0.377xh;0.186xw,0.0331xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/te-le-chargement-1665080515.png?crop=0.505xw:1.00xh;0.162xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-attends-the-manus-x-machina-fashion-in-an-age-news-photo-528535550-1545408497.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-and-joe-alwyn-seen-attending-the-vogue-bafta-news-photo-1128835856-1565280314.jpg?crop=1xw:0.6669xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/image-from-ios-100-1588247622.png?resize=320:*", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-is-seen-on-december-16-2019-in-new-york-city-news-photo-1576596521.jpg?crop=1.00xw:0.751xh;0,0.0536xh&resize=480:*", "https://hips.hearstapps.com/vidthumb/images/gettyimages-1179298962.jpg?crop=0.732xw:0.292xh;0.171xw,0.0535xh&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/prince-charles-prince-of-wales-catherine-duchess-of-news-photo-1665070899.jpg?crop=0.668xw:1.00xh;0.0817xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/in-this-handout-photo-provided-by-nbcuniversal-presenters-news-photo-1078365726-1565280614.jpg?crop=1xw:0.66667xh;center,top&resize=480:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/1600x800/landscape-1494974194-taylor-joe.jpg?resize=1200:*", "https://www.elle.com/_assets/design-tokens/elle/static/images/logos/network-logo.a5366f4.svg", "https://hips.hearstapps.com/hmg-prod/images/joe-taylor-1639952412.jpg?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/sarah-jessica-parker-and-kristin-davis-are-seen-on-the-set-news-photo-1664990757.jpg?crop=1.00xw:0.751xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/image-from-ios-98-1588247621.png?resize=320:*", "https://hips.hearstapps.com/hmg-prod/images/image-from-ios-114-1589465418.png?resize=320:*", "https://hips.hearstapps.com/hmg-prod/images/leo-gigi-gettyimages-1662584674.jpg?crop=0.492xw:0.984xh;0.508xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/catherine-princess-of-wales-prince-william-prince-of-wales-news-photo-1665073240.jpg?crop=0.668xw:1.00xh;0.269xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-and-joe-alwyn-arrive-at-zuma-on-october-06-news-photo-1576597524.jpg?crop=1.00xw:0.700xh;0,0.0463xh&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/image-from-ios-113-1589465424.png?resize=320:*", "https://hips.hearstapps.com/hmg-prod/images/taylor-joe-quaranting-1588248266.jpg?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/image-from-ios-115-1589465456.png?resize=320:*", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-friendsgiving-1575217023.jpg?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/catherine-princess-of-wales-smiles-during-her-visit-to-the-news-photo-1665066747.jpg?crop=0.655xw:0.444xh;0.175xw,0.0369xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/jennifer-lopez-and-ben-affleck-are-seen-on-september-04-news-photo-1665077679.jpg?crop=0.758xw:0.569xh;0.143xw,0.0276xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1665078833.jpg?crop=0.388xw:0.259xh;0.304xw,0.0578xh&resize=180:*"], "top_img": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/1600x800/landscape-1494974194-taylor-joe.jpg?resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.elle.com/culture/celebrities/a25654362/taylor-swift-joe-alwyn-relationship-timeline/", "title": "Taylor Swift and Joe Alwyn’s Relationship Complete Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Taylor Swift and Joe Alwyn’s Relationship Complete Timeline", "description": "Things are getting serious between Taylor Swift and boyfriend of four years, Joe Alwyn. Here’s a timeline of their coupledom.", "keywords": "Joe Alwyn, Taylor Swift, Taylor joe, taylor swift and joe alwyn, taylor swift joe alwyn relationship", "theme-color": "#000000", "og": {"site_name": "ELLE", "title": "A Complete Timeline of Taylor Swift and Joe Alwyn’s Five-Year Relationship", "description": "Alwyn and Swift were seen out in New York City the week before the MTV VMAs.", "image": {"identifier": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/1600x800/landscape-1494974194-taylor-joe.jpg?resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.elle.com/culture/celebrities/a25654362/taylor-swift-joe-alwyn-relationship-timeline/", "type": "article"}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "section": "Celebrity News 2022", "modified_time": "2022-08-26T19:37:29Z", "published_time": "2022-08-26T19:37:00Z"}, "twitter": {"site": "@ELLEmagazine", "image": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/1600x800/landscape-1494974194-taylor-joe.jpg?resize=640:*", "card": "summary_large_image"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "thumbnail": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/980x980/square-1494974194-taylor-joe.jpg?resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/980x980/square-1494974194-taylor-joe.jpg?resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/20/980x980/square-1494974194-taylor-joe.jpg", "auto-publish": "timely", "sailthru.excerpt": "When Taylor Swift first began dating actor Joe Alwyn more than four years ago, it was almost immediately clear the couple had come to an agreement: Their relationship would be an intimate but private one, and they’d be a united front in protecting that privacy. Gone were the paparazzi photo", "sailthru.tags": "culture,Culture,celebrities,Celebrity News 2022", "sailthru.date": "2022-08-26 19:37:00", "sailthru.socialtitle": "A Complete Timeline of Taylor Swift and Joe Alwyn’s Five-Year Relationship", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 45}, "movies": [], "publish_date": 1661542620.0, "source": "https://www.elle.com", "summary": ""}