{"url": "https://www.hollywoodreporter.com/heat-vision/james-gunn-exits-guardians-galaxy-vol-3-1128786", "text": "James Gunn is exiting Guardians of the Galaxy Vol. 3.\n\nThe move comes after conservative personalities resurfaced old tweets Thursday in which the filmmaker joked about controversial topics such as pedophilia and rape. Gunn has been an outspoken critic of President Donald Trump.\n\n“The offensive attitudes and statements discovered on James’ Twitter feed are indefensible and inconsistent with our studio’s values, and we have severed our business relationship with him,” Walt Disney Studios chairman Alan Horn said in a statement Friday.\n\nOn Thursday, Gunn tweeted in response to the tweets being resurfaced, “Many people who have followed my career know, when I started, I viewed myself as a provocateur, making movies and telling jokes that were outrageous and taboo. As I have discussed publicly many times, as I’ve developed as a person, so has my work and my humor.”\n\nHe added: “It’s not to say I’m better, but I am very, very different than I was a few years ago; today I try to root my work in love and connection and less in anger. My days saying something just because it’s shocking and trying to get a reaction are over.”\n\nThe offensive tweets came to light after conservative website The Daily Caller dug up the social media posts, which were mostly posted in 2008 and 2009. Soon after, conservative personalities were tweeting to followers to confront Gunn at Comic-Con. Gunn had been expected to be at Sony’s presentation on Friday. Insiders say Gunn is not expected to be part of the panel now.\n\nGunn issued a statement on Friday afternoon, saying that he “regretted” the tweets in question and stressed that “they don’t reflect the person I am today.”\n\n“My words of nearly a decade ago were, at the time, totally failed and unfortunate efforts to be provocative,” his statement read. “I have regretted them for many years since — not just because they were stupid, not at all funny, wildly insensitive, and certainly not provocative like I had hoped, but also because they don’t reflect the person I am today or have been for some time.”\n\nHe continued: “Regardless of how much time has passed, I understand and accept the business decisions taken today. Even these many years later, I take full responsibility for the way I conducted myself then. All I can do now, beyond offering my sincere and heartfelt regret, is to be the best human being I can be: accepting, understanding, committed to equality, and far more thoughtful about my public statements and my obligations to our public discourse. To everyone inside my industry and beyond, I again offer my deepest apologies. Love to all.”\n\nGunn has been writing the script for Guardians 3, and the movie was expected to begin shooting in Atlanta in the fall for an expected 2020 release date, though Marvel Studios had never officially announced the date. The Guardians movies have been a massive success for Disney and Marvel. The first movie made more than $773 million worldwide while the second made $863 million. The films stood out from other Marvel movies as they were infused with Gunn’s off-kilter filmmaking sensibilities that owed more to indie genre movies than slicker cookie-cutter studio fare. Marvel Studios head Kevin Feige had previously indicated that Gunn would continue to work with Marvel after Guardians 3, helping shepherd the cosmic side of the studio’s universe.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/07/james_gunn_at_e3_gaming_industry_conference_-_getty_-_h_2018.jpg?w=1296&h=730&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/james_gunn_at_e3_gaming_industry_conference_-_getty_-_h_2018.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/james_gunn_at_e3_gaming_industry_conference_-_getty_-_h_2018.jpg?w=1024", "keywords": [], "authors": ["Borys Kit Aaron Couch", "Borys Kit", "Aaron Couch"], "canonical_link": "https://www.hollywoodreporter.com/movies/movie-news/james-gunn-exits-guardians-galaxy-vol-3-1128786/", "title": "James Gunn Fired as Director of ‘Guardians of the Galaxy Vol. 3’", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "James Gunn has left 'Guardians of the Galaxy Vol. 3' after controversial tweets resurfaced online.", "news_keywords": "Guardians of the Galaxy, James Gunn, Marvel Studios", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Aaron Couch", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1128786, "title": "James Gunn Fired as Director of 'Guardians of the Galaxy Vol. 3'", "published_at": "2018-07-20 12:19:43", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/james_gunn_at_e3_gaming_industry_conference_-_getty_-_h_2018.jpg?w=1024", "comment_count": 0, "tags": "Marvel Studios", "topics": "Movies", "body": "James Gunn is exiting Guardians of the Galaxy Vol. 3.\r\nThe move comes after conservative personalities resurfaced old tweets Thursday in which the filmmaker joked about controversial topics such as pedophilia and rape. Gunn has been an outspoken critic of President Donald Trump.\r\n\"The offensive attitudes and statements discovered on James' Twitter feed are indefensible and inconsistent with our studio's values, and we have severed our business relationship with him,\" Walt Disney Studios chairman Alan Horn said in a statement Friday.\r\nOn Thursday, Gunn tweeted in response to the tweets being resurfaced, \"Many people who have followed my career know, when I started, I viewed myself as a provocateur, making movies and telling jokes that were outrageous and taboo. As I have discussed publicly many times, as I've developed as a person, so has my work and my humor.\"\r\nHe added: \"It's not to say I'm better, but I am very, very different than I was a few years ago; today I try to root my work in love and connection and less in anger. My days saying something just because it's shocking and trying to get a reaction are over.\"\r\nThe offensive tweets came to light after conservative website The Daily Caller dug up the social media posts, which were mostly posted in 2008 and 2009. Soon after, conservative personalities were tweeting to followers to confront Gunn at Comic-Con. Gunn had been expected to be at Sony's presentation on Friday. Insiders say Gunn is not expected to be part of the panel now.\r\nGunn issued a statement on Friday afternoon, saying that he \"regretted\" the tweets in question and stressed that \"they don't reflect the person I am today.\"\r\n\"My words of nearly a decade ago were, at the time, totally failed and unfortunate efforts to be provocative,\" his statement read. \"I have regretted them for many years since — not just because they were stupid, not at all funny, wildly insensitive, and certainly not provocative like I had hoped, but also because they don't reflect the person I am today or have been for some time.\"\r\nHe continued: \"Regardless of how much time has passed, I understand and accept the business decisions taken today. Even these many years later, I take full responsibility for the way I conducted myself then. All I can do now, beyond offering my sincere and heartfelt regret, is to be the best human being I can be: accepting, understanding, committed to equality, and far more thoughtful about my public statements and my obligations to our public discourse. To everyone inside my industry and beyond, I again offer my deepest apologies. Love to all.\"\r\nGunn has been writing the script for Guardians 3, and the movie was expected to begin shooting in Atlanta in the fall for an expected 2020 release date, though Marvel Studios had never officially announced the date. The Guardians movies have been a massive success for Disney and Marvel. The first movie made more than $773 million worldwide while the second made $863 million. The films stood out from other Marvel movies as they were infused with Gunn's off-kilter filmmaking sensibilities that owed more to indie genre movies than slicker cookie-cutter studio fare. Marvel Studios head Kevin Feige had previously indicated that Gunn would continue to work with Marvel after Guardians 3, helping shepherd the cosmic side of the studio's universe.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "James Gunn Fired as Director of ‘Guardians of the Galaxy Vol. 3’", "url": "https://www.hollywoodreporter.com/movies/movie-news/james-gunn-exits-guardians-galaxy-vol-3-1128786/", "description": "James Gunn has left ‘Guardians of the Galaxy Vol. 3’ after controversial tweets resurfaced online.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/james_gunn_at_e3_gaming_industry_conference_-_getty_-_h_2018.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-07-20T12:19:43+00:00", "modified_time": "2018-07-22T16:38:53+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "James Gunn Fired as Director of ‘Guardians of the Galaxy Vol. 3’", "description": "James Gunn has left ‘Guardians of the Galaxy Vol. 3’ after controversial tweets resurfaced online.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/james_gunn_at_e3_gaming_industry_conference_-_getty_-_h_2018.jpg?w=1296"}}, "movies": [], "publish_date": 1532089183.0, "source": "https://www.hollywoodreporter.com", "summary": ""}