{"url": "https://www.chicagotribune.com/entertainment/tv/ct-ent-monica-raymund-life-after-chicago-fire-0914-story.html", "text": "After six seasons playing Gabriela Dawson on \"Chicago Fire,\" Monica Raymund talks about why she was ready to take on something new. She will be announcing her next project shortly. (Brian Cassella/Chicago Tribune)\n\nThis story has been updated to reflect the correct date for the season premiere of “Chicago Fire.”\n\nWhen the long-running NBC drama “Chicago Fire” returns for its seventh season Sept. 26, it will mark a major cast shakeup. Last spring Monica Raymund, who played paramedic (and for a time, firefighter) Gabriela Dawson for the show’s entire run, announced she was leaving.\n\nAdvertisement\n\nCast and crew have been back at work since July, and this is the first year Raymund hasn’t been part of that routine. “It does feel surreal,” she told me when we spoke this week.\n\n“I mean, I’ve given six years of my life to that show and created a family there, so it was a bit like a dismemberment, if you will. I miss them terribly, of course. But I have the opportunity to start the next chapter of my life and I’m very much looking forward to that.”\n\nAdvertisement\n\nWe talked about her decision to leave and what she has planned next. The following is an edited transcript.\n\nQ: Walk me through the decision to say goodbye to Gabby and the show.\n\nA: I’m not sure the exact moment when it happened, but I knew that my six-year contract was coming to an end and I felt like I was hungry to explore a different role, a different story. I wanted to explore a different world. I had been in Chicago for five years and just personally where I was in my life, I was ready to create my home and kind of plant some roots in Los Angeles.\n\nIt’s kind of a double-edged sword because on the one hand, it’s wonderful to be employed for that long and to have job security. And to be able to delve into a storyline and to flush it out over that amount of time. To get that opportunity is extremely rare and special. Job security is always the two favorite words an actor can say! But sometimes you have to take a risk to diversify your opportunities.\n\nIt was a rocky end for Matt (Jesse Spencer) and Gabby (Monica Raymund) as Season 6 of \"Chicago Fire\" came to a close. (Elizabeth Morris/NBC)\n\nQ: What did you like most about playing Gabby and what were your biggest frustrations with her as a character?\n\nA: Oh, I loved being able to play a first responder. I don’t have anyone in my family that’s a first responder and I didn’t really know the different trials and tribulations that they face everyday. So that was the greatest part about playing Gabby, that I got to get to know the paramedics, I got to know the firefighters in Chicago, and hopefully to the best of my ability, represent them honorably.\n\nAs for frustrations, I mean … I’ve gotta say, Wolf Films, the producers were really accommodating to me. I had the idea to see if we could flirt with Gabby Dawson going on the firetruck and they wrote me on the firetruck for two years! I did not know that they were going to take that bait and they did!\n\nQ: As an actor, was there a difference playing a firefighter vs. a paramedic?\n\nAdvertisement\n\nA: Yes! Yes, yes, yes, for sure. Firefighters, it’s just a way more physical, active role by nature. You’re carrying around 50 pounds of gear, on and off the truck, all day long. It’s just physically exhausting, so in a way I wonder if as an actor, it got me out of my own way because you’re just too tired to fake it or lean into your habits.\n\nTo be honest with you, I actually think that was the most fun I had the six years I was on the show, playing a firefighter. Running into burning buildings and rappeling down buildings from a roof, I mean, that’s extremely fun and thrilling. I got to play an action hero for a while.\n\nThe paramedics are doing all these intricate procedures that actually require true extensive academic knowledge, so I got to learn a lot. I had to learn about anatomy and physiology, so I understood what I was actually doing and I could have an actual authentic response.\n\nHauling 50 pounds of gear is no joke, but the two years she hung up her character's paramedic togs to play a firefighter on the show were Monica Raymund's favorite. (Elizabeth Morris/NBC)\n\nQ: Showrunner Derek Haas has said that when you initially told him you weren’t going to sign a new contract for Season 7, he thought you were just negotiating.\n\nA: Yeah (laughs). I guess he did. I couldn’t have been any more transparent or clear! I was like, “Hey, I’m leaving, I’m giving my notice.” And he was like, “No you’re not!” And I said, “No Derek, I am.” And he just couldn’t believe it! I mean, I didn’t quite know how to take that except to just … leave. I thought it was hilarious.\n\nYou could just see this absolute case of extreme denial. I mean, when the season wrapped he called me, like: “So, you’re not really leaving.” … And I was like, “Derek, honey. I love you, but I gotta go.” He was just having separation anxiety from me, that’s all.\n\nAdvertisement\n\nQ: I have a memory of you taking a chair and sitting down in front of the Trump building downtown a couple years ago ...\n\nA: Yes, that is correct. I created a performance piece because I didn’t know what else to do! This was shortly after the election and I was so confused and enraged and sad and I had all these feelings and I didn’t have a creative outlet to express it, so created a piece of performance art. I sat outside on Wacker just across the street from Trump Tower asking Trump voters to come sit down across from me and speak and I would listen. I did it for two weeks. Sometimes I was out there for five or six hours at a time. I’d go after I wrapped on set, or I’d go on my days off.\n\nThe whole purpose was to offer the chair. Because the entire argument was that they didn’t feel heard, so I tried to create a safe space for them to be heard. I had a lot of people sit down and I heard a lot of interesting things.\n\nYou know, like when Marina Abramovic sits there and she has an empty chair in front of her (from her 2010 performance piece “The Artist Is Present” at the Museum of Modern Art) and her eyes are closed until somebody sits down, she doesn’t know who it’s going to be — that’s the art.\n\nQ: Did you just listen or interact with them?\n\nAdvertisement\n\nA: I listened and I asked questions, but I never asserted my opinion — that was a very important part of the piece. I never imposed my own beliefs on them. The entire objective was that they felt safe so that they could say what they believed and feel heard. That their feelings were validated. That was the social experiment.\n\nThe most memorable takeaway was that there were a few people who were single-issue voters and that was extremely surprising to me. That took priority over everything else, all the other political issues, the behavior of the candidates, that single issue — they were pro-life — was the most important to them.\n\nIt was worthwhile for me because I was able to do something artistic. Maybe it wasn’t productive for the world, but it was a way for me to wrap my brain around what was happening and kind of humanize what was going on.\n\nQ: Did you get any blowback professionally, either from your bosses or colleagues?\n\nA: Not at all. In fact, when I went to set a lot of people were like, “Hey, I think what you’re doing is really cool.” And I was shocked: “Are you sure?”\n\nQ: It’s rare to see a recognizable actor being so accessible. You were just sitting on a chair, there was no entourage.\n\nAdvertisement\n\nA: Oh, my dad was so pissed. He was like, “What if there’s a crazy person? You’re on TV!” And he got so scared that somebody would do something violent or dangerous. And that’s kind of part of the art, I think. I’m actually not done with this. I’m planning on doing a performance piece, maybe in Los Angeles, maybe in New York depending on where I am, but I want to do something that’s a site-specific immersive piece that’s about political activism.\n\nQ: What projects do you have in the works?\n\nA: I can’t quite mention it yet. I have a project that is going to go public soon. It’s a new TV show and it’s very dark and suspenseful. They’ll issue a press release about it probably in the next week or two. It’s an opportunity for me to get really gritty and dirty.\n\nI wanted to be a part of something’s that topical. Something that was extremely meaningful to the current time, something that was relevant — whether political or social or economic. As a viewer and a consumer of television, I’m very attracted to dark suspenseful storytelling, post-apocalyptic storytelling. I watch things like “The Handmaid’s Tale” or “Ozark,” which I’m actually watching right now. I’m just very attracted to that. There’s a sense of gravity to it and that’s the well I want to dip my feet in.\n\n\"As a viewer and a consumer of television, I’m very attracted to dark suspenseful storytelling, post-apocalyptic storytelling,\" said Monica Raymund, who will be announcing her next project shortly. (Alex Garcia/Tribune)\n\nQ: You’ve started directing, too.\n\nA: Yeah, I was accepted into the Female Forward directing program at NBC and I’ve been shadowing at “Law & Order: SVU” and I will be directing Episode 8 of this season! So I’m like totally focused on directing right now. I wrap my episode mid-October.\n\nAdvertisement\n\nI’d like to eventually direct features.\n\nQ: Let me close out with a couple quick “Chicago Fire” questions: Would you ever go to Lottie’s (the bar known as Molly’s on the show) to hang out on your off time?\n\nA: We did actually, in the first and second season! We would just go; I’ve been there a couple times. But they built the set to look exactly like the interior of Lottie’s so it was like, “I feel like film here all the time, I don’t want to be here when I’m not on the clock!” It was just too much.\n\nQ: Your wardrobe on the show was pretty specific: T-shirt and the department-issue jacket. Did you take either with you as mementos?\n\nA: No! I actually don’t think I’m allowed! They have to keep those until the show wraps. But maybe they’ll send me my jacket when it’s all done. Maybe I’ll put in a special request.\n\nnmetz@chicagotribune.com\n\nAdvertisement\n\nTwitter @Nina_Metz\n\n[ MORE COVERAGE: 'Chicago Fire' showrunner Derek Haas on Season 6 cliffhangers ]\n\n[ Commentary: How committed is CBS to change? Not much, by the looks of it ]\n\n[ My worst moment: Rupert Grint and the prosthesis no one could ignore ]", "images": ["https://www.chicagotribune.com/resizer/XbF6mSQp9N_VYd_zu8M9aD0NelY=/1440x1080/filters:format(jpg):quality(70):focal(671x8:681x18)/cloudfront-us-east-1.images.arcpublishing.com/tronc/WSLFWOKALJFLZB6ZIJUJUGC3NY.jpg", "https://www.chicagotribune.com/pf/resources/icons/Menu_Icon.svg?d=87", "https://www.chicagotribune.com/resizer/Wvo5X9plGWxVfPUeSQD50C_AU-E=/1440x0/filters:format(jpg):quality(70)/www.trbimg.com/img-5b9835f7/turbine/ct-1536701939-i1e2f6blkf-snap-image", "https://www.chicagotribune.com/resizer/K03c6nlW66iuuQMoeZFhXu8k6zI=/800x0/filters:format(jpg):quality(70)/www.trbimg.com/img-5b983403/turbine/ct-1536701440-azu3ywq192-snap-image", "https://www.chicagotribune.com/resizer/J_f7jhyPsUrFeJRBy04_qP3PtY4=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/G2AUGVFVGZHDXKH6JRESV6XQ5I.jpg", "https://www.chicagotribune.com/resizer/qu1n4LptTX-ftSfEnEQWI0IXzpw=/1440x0/filters:format(jpg):quality(70)/www.trbimg.com/img-5b9834a4/turbine/ct-1536701601-pql9q2c0y6-snap-image", "https://www.chicagotribune.com/resizer/0GnMKYzX5DZlr8LO9EjOx5b-TOQ=/1440x1080/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/LGCQSAHPDBBAHMODNFQQ2NT434.jpg", "https://www.chicagotribune.com/resizer/Uikmjep0R2DcMaIRV9b4jCH7i08=/1440x0/filters:format(jpg):quality(70)/www.trbimg.com/img-5b98352d/turbine/ct-1536701737-eatoihiwaj-snap-image", "https://www.chicagotribune.com/resizer/OTKXwLs6Cwlc60DCbCTkaSJH5cg=/1440x1080/filters:format(jpg):quality(70):focal(704x35:714x45)/cloudfront-us-east-1.images.arcpublishing.com/tronc/VZJH2ENN5FDT7KCR2MLQS7NXEE.jpg", "https://static.themebuilder.aws.arc.pub/tronc/1657752787005.svg"], "top_img": "https://www.chicagotribune.com/resizer/J_f7jhyPsUrFeJRBy04_qP3PtY4=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/G2AUGVFVGZHDXKH6JRESV6XQ5I.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.chicagotribune.com/entertainment/tv/ct-ent-monica-raymund-life-after-chicago-fire-0914-story.html", "title": "'Chicago Fire' star Monica Raymund reveals why she left the NBC series", "meta_data": {"language": "English (United States), en-US", "viewport": "width=device-width, initial-scale=1", "content-id": "ZEYQCZKSUBDOFN64FF2MJKQDOE", "apple-itunes-app": "app-id=383137151, app-argument=http://www.chicagotribune.com/deeplinkidZEYQCZKSUBDOFN64FF2MJKQDOE", "description": "A conversation with \"Chicago Fire's\" Monica Raymund about why she decided to leave the show after six seasons and what she has planned next.", "twitter": {"description": "A conversation with \"Chicago Fire's\" Monica Raymund about why she decided to leave the show after six seasons and what she has planned next.", "title": "'Chicago Fire' star Monica Raymund reveals why she left the NBC series", "image": "https://www.chicagotribune.com/resizer/J_f7jhyPsUrFeJRBy04_qP3PtY4=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/G2AUGVFVGZHDXKH6JRESV6XQ5I.jpg", "site": "@chicagotribune", "card": "summary_large_image"}, "og": {"description": "A conversation with \"Chicago Fire's\" Monica Raymund about why she decided to leave the show after six seasons and what she has planned next.", "title": "'Chicago Fire' star Monica Raymund reveals why she left the NBC series", "image": "https://www.chicagotribune.com/resizer/J_f7jhyPsUrFeJRBy04_qP3PtY4=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/G2AUGVFVGZHDXKH6JRESV6XQ5I.jpg", "type": "article", "site_name": "Chicago Tribune", "url": "https://www.chicagotribune.com/entertainment/tv/ct-ent-monica-raymund-life-after-chicago-fire-0914-story.html", "locale": "en_US"}, "robots": "noarchive", "distribution": "global", "rating": "general", "googlebot-news": "index", "copyright": "Copyright © 2022, Chicago Tribune", "fb": {"page_id": "5953023255,104061989632161,330360537007411,264870045299,73734231949,53310156364,40762490776,60569705796,121922684499844,182379588445160,62915602634,1987930441432108,119608021389933,745745225518281", "pages": "https://www.facebook.com/chicagotribune", "app_id": 306836229411287, "admins": 100000786395051}, "fb_title": "'Chicago Fire' star Monica Raymund reveals why she left the NBC series", "y_key": "cee2fe4077f8d050", "msvalidate.01": "AAC9C18F70AC386BC4DCF4DDF9BF1786", "article": {"publisher": "Chicago Tribune", "content_tier": "locked"}, "google": "nositelinkssearchbox"}, "movies": [], "publish_date": null, "source": "https://www.chicagotribune.com", "summary": ""}