{"url": "https://web.archive.org/web/20100226081256/http://www.cbsnews.com:80/blogs/2010/02/23/politics/politicalhotsheet/entry6235624.shtml'", "text": "(AP Photo/Pablo Martinez Monsivais)\n\nSenate Majority Leader Harry Reid told reporters Tuesday that Republicans \"should stop crying\" about the possible use of the parliamentary procedure known as budget reconciliation to pass a health care reform bill.Reid said reconciliation had been used 21 times since 1981, mostly by Republicans when they were in control of the Senate for the passage of items like the Bush tax cuts. ( Here's a handy chart of when the procedure has been used .)Under reconciliation, Democrats would need a simple majority in the Senate to pass legislation, as opposed to the 60 votes needed to break a filibuster.\"They should stop crying about reconciliation as if it's never been done before,\" Reid said.Following Senate Democrats' weekly luncheon, Reid said \"nothing is off the table\" but that \"realistically, they should stop crying about this. It's been done 21 times before.\"\"The question is: Is reconciliation the only way we can do health-care reform?\" he said. \"The answer to that is no. But I've been told that my Republican friends are lamenting reconciliation, but I would recommend for them to go back and look at history.\"\"It's done almost every Congress, and they're the ones that used it more than anyone else,\" he added.In his own press availability Tuesday, Senate Republican Leader Mitch McConnell said \"it appears as if the administration has already made up their mind to go forward with a beefed up Senate version and to try to jam it through under a seldom-used process that we commonly refer to around here as reconciliation.\"Republican Whip Sen. Jon Kyl told reporters that \"it's hard for us to quite understand why, with reconciliation being planned, we're having a meeting [Thursday] which is allegedly designed to engender some bipartisan agreement for a way forward.\"\"It seems to me at least that, until the Democratic leaders take reconciliation off the table, it'll be very hard for Republicans to believe that they intend to engage us in good faith,\" Kyl added.", "images": ["https://web.archive.org/web/20100226081256im_/http://www.cbsnews.com/i/tim//2010/02/25/eve_reid_22510_100x75.jpg", "https://web.archive.org/web/20100226081256im_/http://dw.com.com/clear/c.gif?sid=162&im=img", "https://web.archive.org/web/20100226081256im_/http://wwwimage.cbsnews.com/images/2009/12/04/image5890389x.jpg", "https://web.archive.org/web/20100226081256im_/http://www.cbsnews.com/i/tron/vader/go.gif", "https://web.archive.org/web/20100226081256im_/http://digg.com/img/diggThisCompact.png", "https://web.archive.org/web/20100226081256im_/http://www.cbsnews.com/blogs/2010/02/23/politics/politicalhotsheet/%profilePic%", "https://web.archive.org/web/20100226081256im_/http://wwwimage.cbsnews.com/common/images/digg_sponsor.png", "https://web.archive.org/web/20100226081256im_/http://www.cbsnews.com/i/tim//2010/02/25/eve_mason_22510_100x75.jpg", "https://web.archive.org/web/20100226081256im_/http://www.cbsnews.com/b.gif"], "top_img": "https://web.archive.org/web/20100226081256im_/http://wwwimage.cbsnews.com/images/2009/12/04/image5890389x.jpg", "keywords": [], "authors": ["Political Hotsheet"], "canonical_link": "https://web.archive.org/web/20100226081256/http://www.cbsnews.com/blogs/2010/02/23/politics/politicalhotsheet/entry6235624.shtml", "title": "Harry Reid Says GOP Should \"Stop Crying\" About Reconciliation", "meta_data": {"keywords": "Harry Reid, Reconciliation", "description": "Senate Majority Leader Says Republicans Were All to Happy to Use Maneuver in the Past.", "author": "Political Hotsheet", "robots": "index, follow", "date_created": "01/23/2010, 15:19:52"}, "movies": [], "publish_date": 1266883200.0, "source": "https://web.archive.org", "summary": ""}