{"url": "https://www.elle.com/uk/life-and-culture/culture/a20726056/serena-williams-father-didnt-walk-down-aisle/", "text": "Following the news that Meghan Markle's father will no longer attend the royal wedding, the star can take solace from close friend Serena Williams who has revealed her father pulled out of walking her down the aisle when she married Alexis Ohanian last year.\n\nIn her HBO documentary Being Serena, the tennis legend recalls how her father and longtime coach Richard texted her just an hour before her wedding was due to begin to say he didn't feel comfortable giving her away.\n\n'He was in New Orleans, he had a suit, and I know he was really excited,' Serena says in a voiceover (via Vogue).\n\n\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n'But then he wrote me and said: \"Serena, I don't want you to be mad at me, but I just can’t walk you down the aisle. I'm not myself anymore. I’m just too nervous\".'\n\n\n\nThe 36-year-old sports star - who had welcomed her first child with Reddit co-founder Ohanian just two months before their wedding - managed to remain calm and sympathetic.\n\nShe wrote back and said: 'Daddy, it's okay, if you don't want to come to the wedding at all, that's okay too. I'm not going to be upset with you about it, so I don't want you to be upset about it.'\n\n\n\nGetty Images\n\nSerena added that while Richard's health is better now, at the time he wasn't feeling good about himself, and although many daughters may have reacted differently, all she wanted was for her family to be happy.\n\n'Maybe a lot of daughters wouldn't react the same way, but I know the struggles he’s had these last few years,' she reflected.\n\nGetty Images\n\n'His health is better now, but I know he still doesn’t feel like himself, doesn’t feel like he's perfect. And if he doesn’t want to be up there in front of a lot of people, I completely understand.\n\n'Look, when we first came on the scene, there were a lot of people who didn’t get him. I don’t think a lot of them wanted to get him.\n\nGetty Images\n\n'I don’t think a lot of him could have anyway. Our family knows what we have. We just want each other to be happy. That's what matters. I don’t think anything could ever change that.'\n\n\n\nSerena - the greatest female athlete in the world - walked down the aisle by herself, with her daughter Alexis looking on from the front row.\n\nBeing Serena chronicles the star's pregnancy, difficult birth, marriage to Ohanian, and her successful return to tennis.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMeanwhile, Serena is believed to be attending Meghan's wedding to Prince Harry this weekend in Windsor.\n\nThe royal wedding has been marred by family drama. It was recently reported that former lighting director wouldn't be able to attend as he had to undergo a heart procedure this week.\n\nMeghan Markle has now confirmed that her father won't be attending the ceremony, but he had previously said he would be there to walk his daughter down the aisle - health permitting.\n\nGetty Images\n\nThe furore began when it was alleged that Thomas had staged recent paparazzi photos, which had left him feeling 'deeply embarrassed'. However, certain press outlets had been writing disparaging articles about him and his Mexico home, and it appeared as though he had been harassed by photographers.\n\nIn his absence, it's believed Meghan's mother Doria Ragland will walk Meghan down the aisle, which royal expert Penny Junor said would be 'enormously touching'.\n\nIt would also be a nice gesture towards gender equality, with Meghan being a vocal feminist and women's rights advocate.\n\nOur thoughts go out to the Markles and the Royal Family during this difficult time.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kaia-gerber-style-1645702284.jpg?crop=1xw:0.5xh;center,top&resize=300:*", "https://hips.hearstapps.com/elleuk.cdnds.net/18/11/1520934756-gettyimages-873811544.jpg?resize=480:*", "https://www.elle.com/sites/elle/assets/images/logos/ipso_regulated_hires.png", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-951305846-1526548669.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "https://hips.hearstapps.com/elleuk.cdnds.net/18/08/4000x2000/landscape-1519035570-blakelively1.jpg?resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-951305846-1526548669.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Naomi Gordon", "Naomi Gordon Is News Writer Mainly Covering Entertainment News With A Focus On Celebrity Interviews"], "canonical_link": "https://www.elle.com/uk/life-and-culture/culture/a20726056/serena-williams-father-didnt-walk-down-aisle/", "title": "Serena Williams Reveals Why Her Father Didn't Walk Her Down The Aisle", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "Serena Williams Reveals Why Her Father Didn't Walk Her Down The Aisle", "description": "The tennis champion says her dad pulled out last minute", "url": "https://www.elle.com/uk/life-and-culture/culture/a20726056/serena-williams-father-didnt-walk-down-aisle/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-951305846-1526548669.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 201742389861242}, "article": {"publisher": "https://www.facebook.com/ELLEuk", "modified_time": "2018-05-17T15:57:44Z", "published_time": "2018-05-17T09:18:00Z", "section": "Culture", "opinion": "false"}, "twitter": {"site": "@ELLEUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-951305846-1526548669.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Serena Williams Reveals Why Her Father Didn't Walk Her Down The Aisle", "description": "Meghan Markle can take solace from close friend Serena Williams who has revealed that her father pulled out of walking her down the aisle when she married Alexis Ohanian​ last year.", "keywords": "Meghan Markle, Alexis Ohanian, Serena Williams, Being Serena, Prince Harry, royal wedding", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-951305846-1526548669.jpg?crop=0.502xw:1.00xh;0.250xw,0&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Life + Culture,life-and-culture,culture", "sailthru.date": "2018-05-17T09:18:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-951305846-1526548669.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-951305846-1526548669.jpg?crop=0.502xw:1.00xh;0.250xw,0", "sailthru.socialtitle": "Serena Williams Reveals Why Her Father Didn't Walk Her Down The Aisle", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1526548680.0, "source": "https://www.elle.com", "summary": ""}