{"url": "https://www.hollywoodreporter.com/news/bekah-martinez-bachelor-star-pregnant-first-child-1142596", "text": "Another baby is joining Bachelor Nation. Bekah Martinez, who competed for Arie Luyendyk Jr.’s heart on season 22 of The Bachelor, revealed Wednesday that she is pregnant and expecting her first child with her boyfriend, Grayston Leonard.\n\nMartinez shared the news in an interview with PureWow. “I was in disbelief and thought, ‘Is this really happening?'” Martinez told the site. “I immediately called Grayston and then went across the street to the Dollar Tree and bought two more pregnancy tests. They, of course, were both positive.”\n\nAccording to Martinez, who has been dating Leonard for seven months, becoming a mother is “legitimately a dream come true.” The 23-year-old elaborated, “It’s the one thing that I’ve known with certainty for so long. I’ve gone back and forth on the idea of marriage and relationships, but I’ve always felt sure that I want to be a mom.”\n\nMartinez’s pregnancy announcement comes months after she was named a castmember on season five of Bachelor in Paradise, which just wrapped its season Tuesday night. Host Chris Harrison had announced her participation during the Bachelorette reunion show earlier this summer, but then her casting never materialized.\n\nIt was never explained why she opted not to do the show. Now, Martinez explains that her relationship with Leonard — and their forthcoming bundle of joy — got in the way.\n\n“I think pregnancy is better than Bachelor in Paradise,” she says. “Although I’m probably equally as sweaty, exhausted, nauseous, stressed out and emotional, at least I don’t have to worry about finding a man. I already have that one covered.”\n\nMartinez made headlines back in February when she appeared on a missing persons list while The Bachelor was still airing. Martinez’s mother reported her missing, telling police in November 2017 that she hadn’t communicated with her daughter after she supposedly left to work on a marijuana farm. Martinez later clarified the situation during an appearance on Jimmy Kimmel Live!.\n\n“I just decided to go to the mountains with my friends for a couple weeks [after filming The Bachelor] and I was there for six or seven days without phone service, which I thought I was going to have phone service and I told my mother that I would,” she explained at the time. “I just had this weird feeling on the sixth or seventh day. ‘I need to go home now.’ So, I got in my car, drove to where I had service, called my parents and then come to find out [that] only 12 hours before, my mother had called the Humboldt Sheriff’s Department saying that I was missing.”\n\nDuring her chat with PureWow, Martinez joked that she plans to keep her child out of the spotlight to avoid drama: “I don’t really want my child to get reported missing on a weed farm.”\n\nMartinez also made headlines in August when sexual harassment claims surfaced against Bachelor in Paradise star Leo Dottavio, who appeared on Becca Kufrin’s recent season of The Bachelorette.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/09/jordan_jenna_0.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/09/jordan_jenna_0.jpg?w=1024", "keywords": [], "authors": ["Evan Real"], "canonical_link": "https://www.hollywoodreporter.com/lifestyle/style/bekah-martinez-bachelor-star-pregnant-first-child-1142596/", "title": "‘Bachelor’ Star Bekah Martinez Pregnant With Her First Child", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "'Bachelor' star Bekah Martinez is pregnant and expecting her first child with boyfriend Grayston Leonard. The news explains her absence on season five of 'Bachelor in Paradise.'", "news_keywords": "Bachelor In Paradise, The Bachelor", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Evan Real", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1142596, "title": "'Bachelor' Star Bekah Martinez Pregnant With Her First Child", "published_at": "2018-09-12 09:07:32", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/09/jordan_jenna_0.jpg?w=1024", "comment_count": 0, "tags": "The Bachelor", "topics": "Style", "body": "Another baby is joining Bachelor Nation. Bekah Martinez, who competed for Arie Luyendyk Jr.'s heart on season 22 of The Bachelor, revealed Wednesday that she is pregnant and expecting her first child with her boyfriend, Grayston Leonard.\r\nMartinez shared the news in an interview with PureWow. \"I was in disbelief and thought, 'Is this really happening?'\" Martinez told the site. \"I immediately called Grayston and then went across the street to the Dollar Tree and bought two more pregnancy tests. They, of course, were both positive.\"\r\nAccording to Martinez, who has been dating Leonard for seven months, becoming a mother is \"legitimately a dream come true.\" The 23-year-old elaborated, \"It’s the one thing that I’ve known with certainty for so long. I’ve gone back and forth on the idea of marriage and relationships, but I’ve always felt sure that I want to be a mom.\"\r\nMartinez's pregnancy announcement comes months after she was named a castmember on season five of Bachelor in Paradise, which just wrapped its season Tuesday night. Host Chris Harrison had announced her participation during the Bachelorette reunion show earlier this summer, but then her casting never materialized.\r\n\r\nIt was never explained why she opted not to do the show. Now, Martinez explains that her relationship with Leonard — and their forthcoming bundle of joy — got in the way.\r\n\"I think pregnancy is better than Bachelor in Paradise,\" she says. \"Although I’m probably equally as sweaty, exhausted, nauseous, stressed out and emotional, at least I don’t have to worry about finding a man. I already have that one covered.\"\r\nMartinez made headlines back in February when she appeared on a missing persons list while The Bachelor was still airing. Martinez's mother reported her missing, telling police in November 2017 that she hadn't communicated with her daughter after she supposedly left to work on a marijuana farm. Martinez later clarified the situation during an appearance on Jimmy Kimmel Live!.\r\n\"I just decided to go to the mountains with my friends for a couple weeks [after filming The Bachelor] and I was there for six or seven days without phone service, which I thought I was going to have phone service and I told my mother that I would,\" she explained at the time. \"I just had this weird feeling on the sixth or seventh day. 'I need to go home now.' So, I got in my car, drove to where I had service, called my parents and then come to find out [that] only 12 hours before, my mother had called the Humboldt Sheriff’s Department saying that I was missing.\"\r\nDuring her chat with PureWow, Martinez joked that she plans to keep her child out of the spotlight to avoid drama: \"I don’t really want my child to get reported missing on a weed farm.\"\r\nMartinez also made headlines in August when sexual harassment claims surfaced against Bachelor in Paradise star Leo Dottavio, who appeared on Becca Kufrin's recent season of The Bachelorette.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Bachelor’ Star Bekah Martinez Pregnant With Her First Child", "url": "https://www.hollywoodreporter.com/lifestyle/style/bekah-martinez-bachelor-star-pregnant-first-child-1142596/", "description": "‘Bachelor’ star Bekah Martinez is pregnant and expecting her first child with boyfriend Grayston Leonard. The news explains her absence on season five of ‘Bachelor in Paradise.&#8…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/09/jordan_jenna_0.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-09-12T09:07:32+00:00", "modified_time": "2018-09-12T14:14:49+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Bachelor’ Star Bekah Martinez Pregnant With Her First Child", "description": "‘Bachelor’ star Bekah Martinez is pregnant and expecting her first child with boyfriend Grayston Leonard. The news explains her absence on season five of ‘Bachelor in Paradise.&#8…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/09/jordan_jenna_0.jpg?w=1280"}}, "movies": [], "publish_date": 1536743252.0, "source": "https://www.hollywoodreporter.com", "summary": ""}