{"url": "https://tvline.com/2018/01/17/supernatural-spinoff-wayward-sisters-spoilers-briana-buckmaster-katherine-ramdeen/", "text": "Supernatural fans who have long championed a spinoff centered around Kim Rhodes’ Sheriff Jody Mills and her surrogate daughters are finally getting their wish. On Thursday, the Wayward Sisters backdoor pilot makes its debut (The CW, 8/7c), and the female-led offshoot’s timing couldn’t be more, well, timely.\n\n“Now is the time that television and movies are discovering that a lot of women want to have their stories told by women, [and] they want to have their voices heard,” Briana Buckmaster, who plays Jody’s friend/ally Sheriff Donna Hanscum, says. “This is an opportunity that Supernatural and The CW is giving to all of us as a viewership and a fandom.”\n\nRELATED STORIES Resident Evil Boss Addresses Supernatural Comparisons, Teases Show's Connection to the Video Games\n\nResident Evil Boss Addresses Supernatural Comparisons, Teases Show's Connection to the Video Games The Winchesters Stars Call Playing John and Mary 'An Honor' and Praise EP Jensen Ackles' Guidance -- Watch\n\nHer Wayward co-star Katherine Ramdeen, aka Jody’s surrogate daughter Alex Jones, echoes the sentiment: “Starting off 2018 with this powerful show, with six powerful, strong, female leads, is exactly what the world needs right now. I think people are going to love it.”\n\nThe sisterhood — which also includes hunter Claire Novak (Kathryn Newton), psychic Patience (Clark Backo) and dreamwalker Kaia (Yadira Guevara-Prip) — is brought together by a rescue mission after Dean and Sam go missing. (Quick refresher: They got transported to The Bad Place, unbeknownst to Jody & Co.) Like many of the Wayward characters, Alex “owes the boys her life,” Ramdeen notes. “I think she thinks of them as uncles. So she wants to help in any way she can.”\n\nBut the episode is not about propping up Dean and Sam. “The women in the pilot are not there to solely serve the Winchesters, or to serve any men. They’re there to help others and save themselves,” Buckmaster says. “That’s an exciting opportunity for viewers to see six regular women from all walks of life learning to save themselves and be their own heroes.”\n\nWith so many diverse characters, the dynamics among the ensemble are bound to be as complicated as they are rich. Case in point: When prodigal daughter Claire returns home, she finds that her bed is being occupied by Patience, who “comes from a different background than a lot of the women,” Buckmaster explains. “A lot of the women come from rougher beginnings, and Patience was raised at a little bit of a higher class. It will be interesting to see what that character brings, or learns, even.”\n\nMeanwhile, established faves Claire and Alex — the latter of whom is now living a “double life” as a nursing assistant and a part-time hunter — are “as close to sisters as sisters can be,” even if they’re not blood siblings, Ramdeen shares. “Alex loves Claire, and Claire loves Alex, but sisters can fight and just annoy each other.” At the end of the day, however, “it’s such a loving relationship that they’re able to press each others’ buttons, but know that there’s love behind that.”\n\nAs Jody opens her home and heart to even more lost young women with Patience and Kaia, the potential spinoff establishes that it has more in common with its mothership series than just hunters and monsters. “There’s a saying in Supernatural: ‘Family doesn’t end with blood,’ and that’s the show,” Ramdeen says. “That’s Wayward.“\n\nWatch a trailer for the episode airing this Thursday, then hit the comments with your hopes for the offshoot.", "images": ["https://tvline.com/wp-content/uploads/2022/08/october-streaming-2022.jpg?w=280", "https://www.sportico.com/wp-content/uploads/2022/03/transax-copy.jpg?resize=180,101", "https://tvline.com/wp-content/uploads/2022/10/Rings-of-Power-Morfydd-Clark-Galadriel.jpg?w=620", "https://tvline.com/wp-content/uploads/2018/01/supernatural-wayward-sisters1.jpg?w=620&h=420&crop=1", "https://tvline.com/wp-content/uploads/2022/10/agt-all-stars-sofia-vergara.jpg?w=620", "https://deadline.com/wp-content/uploads/2022/10/jennifer-lawrence-LFF.jpg?resize=180,101", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://www.indiewire.com/wp-content/uploads/2022/10/GettyImages-1431553933.jpg?resize=180,101", "https://spy.com/wp-content/uploads/2022/09/Yale-Assure-Lock-2-with-phone-access-e1665187447718.png?resize=180,101", "https://tvline.com/wp-content/uploads/2018/01/supernatural-wayward-sisters1.jpg?w=620", "https://tvline.com/wp-content/uploads/2022/09/teen-wolf-movie-release-date.jpg?w=620", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-203220h&cg=0&cc=1&ts=noscript", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://tvline.com/wp-content/uploads/2022/07/Netflix-Resident-Evil-Supernatural-.jpg?w=210&h=140&crop=1", "https://variety.com/wp-content/uploads/2022/09/Ajoomma.jpg?resize=180,101", "https://tvline.com/wp-content/uploads/2022/10/wheel-of-time-season-2-teaser-photos.jpeg?w=620", "https://tvline.com/wp-content/themes/pmc-tvline-2014/library/images/follow_us_on_facebook_graphic.png", "https://tvline.com/wp-content/uploads/2022/06/the-winchesters-video.jpg?w=210&h=140&crop=1", "https://tvline.com/wp-content/uploads/2018/01/supernatural-wayward-sisters-31.jpg", "https://tvline.com/wp-content/uploads/2022/10/fire-country-bode-freddy.jpg?w=630", "https://tvline.com/wp-content/uploads/2018/01/supernatural-wayward-sisters-21.jpg"], "top_img": "https://tvline.com/wp-content/uploads/2018/01/supernatural-wayward-sisters1.jpg?w=620", "keywords": [], "authors": ["Vlada Gelman"], "canonical_link": "https://tvline.com/2018/01/17/supernatural-spinoff-wayward-sisters-spoilers-briana-buckmaster-katherine-ramdeen/", "title": "‘Supernatural’ Spinoff: ‘Wayward Sisters’ Cast Previews Backdoor Pilot", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1.0 maximum-scale=1, user-scalable=no", "p": {"domain_verify": "9ad238c78ee34da2d6d96a41981790d2"}, "description": "The cast of \"Supernatural's\" \"Wayward Sisters\" spinoff talks about the timely project and its ensemble of powerful female characters.", "news_keywords": "Briana Buckmaster, Katherine Ramdeen, Supernatural, Wayward Sisters", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=1377345661", "generator": "WordPress 6.0.2", "author": "Vlada Gelman", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "TVLine", "application-name": "TVLine", "content_type": "Article", "post_id": 904477, "title": "<I>Supernatural</i>: The <I>Wayward</i> Cast Hails Timely Spinoff's 'Powerful' Females", "published_at": "2018-01-17 07:00:45", "image": "https://tvline.com/wp-content/uploads/2018/01/supernatural-wayward-sisters1.jpg?w=300&h=208&crop=1", "comment_count": 34, "tags": "Wayward Sisters", "topics": "Previews", "body": "Supernatural fans who have long championed a spinoff centered around Kim Rhodes' Sheriff Jody Mills and her surrogate daughters are finally getting their wish. On Thursday, the Wayward Sisters backdoor pilot makes its debut (The CW, 8/7c), and the female-led offshoot's timing couldn't be more, well, timely.\r\n\r\n\r\n\r\n\"Now is the time that television and movies are discovering that a lot of women want to have their stories told by women, [and] they want to have their voices heard,\" Briana Buckmaster, who plays Jody's friend/ally Sheriff Donna Hanscum, says. \"This is an opportunity that Supernatural and The CW is giving to all of us as a viewership and a fandom.\"\r\n\r\nHer Wayward co-star Katherine Ramdeen, aka Jody's surrogate daughter Alex Jones, echoes the sentiment: \"Starting off 2018 with this powerful show, with six powerful, strong, female leads, is exactly what the world needs right now. I think people are going to love it.\"\r\n\r\nThe sisterhood — which also includes hunter Claire Novak (Kathryn Newton), psychic Patience (Clark Backo) and dreamwalker Kaia (Yadira Guevara-Prip) — is brought together by a rescue mission after Dean and Sam go missing. (Quick refresher: They got transported to The Bad Place, unbeknownst to Jody & Co.) Like many of the Wayward characters, Alex \"owes the boys her life,\" Ramdeen notes. \"I think she thinks of them as uncles. So she wants to help in any way she can.\"\r\n\r\n\r\n\r\nBut the episode is not about propping up Dean and Sam. \"The women in the pilot are not there to solely serve the Winchesters, or to serve any men. They're there to help others and save themselves,\" Buckmaster says. \"That's an exciting opportunity for viewers to see six regular women from all walks of life learning to save themselves and be their own heroes.\"\r\n\r\nWith so many diverse characters, the dynamics among the ensemble are bound to be as complicated as they are rich. Case in point: When prodigal daughter Claire returns home, she finds that her bed is being occupied by Patience, who \"comes from a different background than a lot of the women,\" Buckmaster explains. \"A lot of the women come from rougher beginnings, and Patience was raised at a little bit of a higher class. It will be interesting to see what that character brings, or learns, even.\"\r\n\r\n\r\n\r\nMeanwhile, established faves Claire and Alex — the latter of whom is now living a \"double life\" as a nursing assistant and a part-time hunter — are \"as close to sisters as sisters can be,\" even if they're not blood siblings, Ramdeen shares. \"Alex loves Claire, and Claire loves Alex, but sisters can fight and just annoy each other.\" At the end of the day, however, \"it's such a loving relationship that they're able to press each others' buttons, but know that there's love behind that.\"\r\n\r\nAs Jody opens her home and heart to even more lost young women with Patience and Kaia, the potential spinoff establishes that it has more in common with its mothership series than just hunters and monsters. \"There's a saying in Supernatural: 'Family doesn't end with blood,' and that's the show,\" Ramdeen says. \"That's Wayward.\"\r\n\r\nWatch a trailer for the episode airing this Thursday, then hit the comments with your hopes for the offshoot.\r\n\r\nhttps://www.youtube.com/watch?v=Gl6d3uxHWCk", "fb": {"pages": 187516444593639}, "fragment": "!", "og": {"type": "article", "title": "Supernatural: The Wayward Cast Hails Timely Spinoff's 'Powerful' Females", "url": "https://tvline.com/2018/01/17/supernatural-spinoff-wayward-sisters-spoilers-briana-buckmaster-katherine-ramdeen/", "description": "Supernatural fans who have long championed a spinoff centered around Kim Rhodes’ Sheriff Jody Mills and her surrogate daughters are finally getting their wish.", "site_name": "TVLine", "image": {"identifier": "https://tvline.com/wp-content/uploads/2018/01/supernatural-wayward-sisters1.jpg?w=620", "width": 620, "height": 420, "alt": "Supernatural Wayward Sisters"}, "locale": "en_US"}, "article": {"published_time": "2018-01-17T15:00:45+00:00", "modified_time": "2018-01-17T15:00:47+00:00"}, "twitter": {"site": "@TVLine", "creator": "@VladaGelman", "card": "summary_large_image", "title": "Supernatural: The Wayward Cast Hails Timely Spinoff's 'Powerful' Females", "description": "The cast of \"Supernatural's\" \"Wayward Sisters\" spinoff talks about the timely project and its ensemble of powerful female characters.", "image": "https://tvline.com/wp-content/uploads/2018/01/supernatural-wayward-sisters1.jpg?w=620"}, "msapplication-TileImage": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=270"}, "movies": ["https://www.youtube.com/embed/Gl6d3uxHWCk?feature=oembed"], "publish_date": 1516147200.0, "source": "https://tvline.com", "summary": ""}