{"url": "https://www.celebritynetworth.com/richest-celebrities/singers/christina-perri-net-worth/", "text": "Christina Perri net worth: Christina Perri is an American singer/songwriter and musician who has a net worth of $4 million. Christina Perri's songs have been featured in major films and television shows. Her single, \"A Thousand Years,\" has gone 4x platinum.\n\nEarly Life: Perri was born on August 19, 1986 in Bensalem, Pennsylvania. Her mother, Mary, is of Polish descent, while her father, Dante, is Italian. She has one older brother, Nick Perri, who is also a musician and played guitar with the bands Shinedown and Silvertide.\n\nAs a child, Perri enjoyed singing and acting. She participated in musical theater while growing up and began teaching herself how to play the guitar at age 16 by watching tapes of the music group Blind Melon perform on VH1. She graduated from Archbishop Ryan High School in 2004 and then enrolled in college, where she planned to study communication. However, she decided to drop out after completing a year in order to pursue her career as a musician.\n\nCareer: On her 21st birthday in 2007, Perri decided to move to Los Angeles. Her first few years in LA were challenging, as she was trying to establish her music career but producing music videos in order to earn a living. She decided to move back to Philadelphia, PA by the end of 2009 in order to save money. She continued working on her music and it was during this time that she first wrote the song, \"Jar of Hearts.\" The following year, she moved back to LA and got a job as a waitress at the Melrose Café. She\n\nIn 2010, one of Perri's friends, Keltie Knight, passed Perri's song \"Jar of Hearts\" to one of the choreographers on the popular show, \"So You Think You Can Dance.\" The choreographer, Stacey Tookey, decided to use the song in a performance by Billy Bell and Kathryn McCormick. Following its use on the show, \"Jar of Hearts\" sold 48,000 digital copies in a week and reached number 28 on the Billboard Hot Digital Songs. After a month, the song sold more than 100,000 copies and peaked at number 17 on the Billboard Hot 100.\n\nPerri had been unsigned at the time that \"Jar of Hearts\" was featured on \"So You Think You Can Dance\" Following its success, Perri signed a record deal with Atlantic Records in July of 2010. She recorded her first EP, \"The Ocean Way Sessions,\" which was released in November of 2010. The following year, in May of 2011, she released her debut album, \"Lovestrong,\" which became the thirteenth highest selling debut album of 2011.\n\nIn July of 2011, she began a world tour which consisted of 71 concerts. She also released her new single, \"A Thousand Years,\" which was subsequently featured on the soundtrack of \"The Twilight Saga: Breaking Dawn – Part 1.\" The song has become Perri's most successful to date, having been certified 4x platinum with over 4 million sales in the United States alone. After completing her tour, Perri began touring again as an opening act for Jason Mraz's tour during late 2012. She also released a holiday EP, \"A Very Merry Perri Christmas\" in October of 2012.\n\nPerri spent the end of 2012 and much of 2013 working on her second album. In November of 2013, she released the first single from the album, \"Human.\" She announced also that the album would be entitled \"Head or Heart.\" The album was officially released in April of 2014 and she announced a new tour which began the same month. She also toured with Demi Lovato's North American tour in 2014.\n\nPerri announced in May of 2016 that she was working on her third album. In the meantime, she also collaborated with Lindsey Stirling and was featured on the title track of Stirling's album, \"Brave Enough.\" In January of 2019, Perri released her third album, \"Songs for Carmella: Lullabies & Sing-a-Longs.\" The album was released on her daughter Carmella's birthday and featured children's lullabies.\n\nPersonal Life: Perri was first married early in her life at the age of 21 when she first moved to Los Angeles. She has not disclosed much about her first husband and the couple divorced after 18 months together, sometime in 2008 or 2009.\n\nPerri first met future second husband, entertainment reporter Paul Costabile, during an interview in 2013, as Costabile was working for iHeart Media at the time. They began officially dating in January of 2016 and then got engaged in June of 2017. They were married on December 12, 2017. In August of 2017, Perri announced that she was pregnant with their first child. The couple had their daughter, Carmella, in January of 2018.", "images": ["https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/wp-content/uploads/2012/07/Christina-Perri.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2012/07/Christina-Perri.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/singers/christina-perri-net-worth/", "title": "Christina Perri Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Christina Perri net worth: Christina Perri is an American singer/songwriter and musician who has a net worth of", "cnw_share_fb_count": 66, "cnw_share_tw_count": 31, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Christina Perri Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/singers/christina-perri-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2012/07/Christina-Perri.jpg", "site_name": "Celebrity Net Worth", "description": "Christina Perri net worth: Christina Perri is an American singer/songwriter and musician who has a net worth of"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2021-06-30T16:23:28+00:00", "published_time": "2021-06-02T14:01:47+00:00", "section": "Singers", "tag": "richest singers"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2012/07/Christina-Perri.jpg", "title": "Christina Perri Net Worth", "description": "Christina Perri net worth: Christina Perri is an American singer/songwriter and musician who has a net worth of"}}, "movies": [], "publish_date": 1622642507.0, "source": "https://www.celebritynetworth.com", "summary": ""}