{"url": "https://www.cheatsheet.com/entertainment/audrina-patridge-and-ryan-cabrera-the-real-reason-this-celebrity-couple-split-up-again.html/", "text": "History is definitely repeating itself. Reality TV star Audrina Patridge and musician Ryan Cabrera have officially called it quits — again. Back in 2010, the two dated for five months, which we saw unfold on The Hills. They rekindled their romance in 2018, but after once again dating for five months, they’ve decided to pull the plug. Here’s everything we know about why the couple split up for the second time.\n\nThey’re better off as friends\n\n“Ryan and I have been good friends for years,” Patridge told E! News. “He is currently on tour, and I am focusing on my daughter. Even though we are not in a romantic relationship right now, we will continue to be friends and are still in touch.”\n\nApparently, by the time their split was confirmed on Sept. 24, 2018, the couple had already broken up a few weeks prior. And as a source told Us Weekly, Patridge was the one to break things off with Cabrera.\n\n“They are really good friends first and foremost. Even though they’re not together romantically anymore, they have hung out and spent time with each other,” the source confirmed.\n\nThey ‘live two different lives’\n\nAside from working better as friends, their lives simply aren’t compatible enough for a relationship. “Ryan considers her a friend first and foremost,” Us Weekly’s source noted. “They were just having fun together. Ryan enjoys his bachelor style life. They just live two different lives.”\n\nThe source added, “[They’re] both busy and not in a place to be focusing on their relationship.”\n\nHow they rekindled their relationship\n\nPatridge and Cabrera seemed happy as could be when they first rekindled their relationship after eight years apart. They initially sparked romance rumors in April 2018 when they were spotted at W Hollywood jazz nights and at the Stagecoach country music festival. It didn’t take long for the two to pick up where they left off, as they quickly became “pretty serious.”\n\nAn insider told E! News at the time, “Audrina feels very lucky to be dating Ryan again. He is extremely kind and supportive of everything she does. He treats her very well and it’s a nice feeling for her. They have always been friends and know each other well. It was all very familiar and comfortable right from the beginning.”\n\nTheir relationship felt ‘natural’\n\nBack in June 2018, Patridge couldn’t stop raving about her relationship with Cabrera. She spilled to People, “[I’m] the happiest I’ve ever been right now.”\n\n“We’re just having fun. Nothing is forced,” she continued. “You know, great things happen when it’s not forced, and things are naturally just happening. And that’s what it is. We just have the best time together.”\n\nPatridge got married after her first split from Cabrera\n\nBefore Patridge and Cabrera gave their relationship another go, the Hills star was briefly married to someone else. She dated professional BMX rider Corey Bohan on and off for years, leading up to their wedding in November 2016. They had one daughter together, Kirra Max Bohan, who was born just a few months before they tied the knot. By September 2017, however, Patridge not only filed for divorce, but obtained a temporary restraining order against Bohan. She accused her ex of domestic violence, though charges were never filed against him.\n\nAt the time of their split, Patridge told Us Weekly, “My main focus is raising and protecting my daughter. I’m in mom mode every day and trying to get through this.”\n\nPatridge will be returning to The Hills in 2019\n\nWe’ll get to see Patridge return to the TV screen, as The Hills has officially been given a reboot. The Hills: New Beginnings will come back to MTV in 2019, and Patridge is one of the many original stars set to return.", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/09/GettyImages-96602041-1024x764.jpg?w=1200", "https://www.cheatsheet.com/wp-content/uploads/2018/09/GettyImages-1033002530-1.jpg", "https://www.cheatsheet.com/wp-content/uploads/2018/09/GettyImages-96602041.jpg?w=1024&h=764", "https://pixel.quantserve.com/pixel/p-73816c7sp-TNg.gif", "https://www.cheatsheet.com/wp-content/uploads/2018/09/GettyImages-1020273276.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=27134408&cv=2.0&cj=1", "https://www.cheatsheet.com/wp-content/uploads/2021/09/showbiz_2x.png", "https://www.cheatsheet.com/wp-content/themes/remoter/images/f_logo_RGB-Blue_58.png", "https://www.cheatsheet.com/wp-content/themes/remoter/images/youtube.png", "https://www.cheatsheet.com/wp-content/themes/remoter/images/instagram.png", "https://www.cheatsheet.com/wp-content/themes/remoter/images/twitter_icon.png"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/09/GettyImages-96602041-1024x764.jpg?w=1200", "keywords": [], "authors": ["Chelsea Leary"], "canonical_link": "https://www.cheatsheet.com/entertainment/audrina-patridge-and-ryan-cabrera-the-real-reason-this-celebrity-couple-split-up-again.html/", "title": "Audrina Patridge and Ryan Cabrera: The Real Reason This Celebrity Couple Split Up (Again)", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Audrina Patridge and Ryan Cabrera: The Real Reason This Celebrity Couple Split Up (Again)", "description": "History is definitely repeating itself. Reality TV star Audrina Patridge and musician Ryan Cabrera have officially called it quits — again. Back in 2010, the two dated for five months, which we saw unfold on The Hills. They rekindled their romance in 2018, but after once again dating for five months, they’ve decided to pull …", "url": "https://www.cheatsheet.com/entertainment/audrina-patridge-and-ryan-cabrera-the-real-reason-this-celebrity-couple-split-up-again.html/", "site_name": "Showbiz Cheat Sheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/09/GettyImages-96602041-1024x764.jpg?w=1200"}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "published_time": "2018-09-25T19:50:39+00:00"}, "author": "Chelsea Leary", "twitter": {"card": "summary_large_image", "creator": "@cheatsheet", "site": "@cheatsheet", "label1": "Written by", "data1": "Chelsea Leary", "label2": "Est. reading time", "data2": "3 minutes"}, "generator": "WordPress 6.0.2"}, "movies": [], "publish_date": 1537905039.0, "source": "https://www.cheatsheet.com", "summary": ""}