{"url": "https://www.usatoday.com/story/life/entertainthis/2017/07/07/lena-dunham-animal-shelter-feud-over-her-abused-dog-lamby/458303001/", "text": "Animal shelter disputes Lena Dunham's account of her 'abused' dog Lamby\n\n2017's unlikeliest feud involves Lena Dunham, her dog Lamby and BARC, the Brooklyn shelter where the actress originally adopted the rescue pup.\n\nSeveral weeks ago, Dunham revealed on Instagram that she sent Lamby to the Zen Dog canine rehabilitation center in Los Angeles, before the dog was eventually re-homed. \"Lamby suffered terrible abuse as a pup that made having him in a typical home environment dangerous to him and others,\" she wrote.\n\nHowever, the BARC Shelter is disputing Dunham's account of Lamby's history of abuse. On Thursday, Robert Vazquez, a spokesman for the no-kill animal shelter, gave a stinging interview to Yahoo denying that Dunham's dog was as mistreated as she claimed.\n\n“It’s just hard to believe the dog was nasty when she took Lamby to every green room with her when Girls was still a thing four years ago,\" he said, noting that he wouldn't have adopted the dog out if he felt it had insurmountable issues.\n\nVazquez also took issue with Dunham's claims that Lamby had “three other homes (and) three other names” before she owned him.\n\n“We checked the records for Lamby ... He was ‘owner-surrendered\" he said, adding that it was because the owner said they didn't have enough time for him. \"So we do not know where she got ‘multiple owners that abused the dog,\"\n\nIn an Instagram post Thursday night, Dunham shared a painting of Lamby that hangs in her home, while defending her version of events in the caption. \"It's come to my attention that the staff at the shelter where I adopted Lamby have a very different account of his early life and behavioral issues than I do. While I'm sorry to have disappointed them, I can't apologize,\" she wrote.\n\n\"I have weathered a lot of micro-scandals but this one hurts MOST, because of the vulnerability of letting people know Lamby and my story, and because I miss him so damn much,\" she continued. This is the painting that greets me every day when I walk into my home. This is the animal who taught me about loving and letting go. I know I'm a lot of fun to place your issues on, but I won't let anyone hang their hat on this peg. Not this time.\"\n\nDunham isn't the only celebrity angering animal advocates this week. Katy Perry, who visited Australia to promote her upcoming tour, appeared in an ad for a n Australian department store chain, where she tells her dog Nugget to \"go chase some koalas.\"\n\nApparently, that's a big no-no in a country where koalas are endangered species and dogs are among their biggest threats. \"[It's] inappropriate on so many levels,\" an Australian wildlife expert told the country's Courier-Mail newspaper. \"Perry is a role model to so many young people, and this just destroys all the good work we do to try to encourage people not to let their dogs come into contact with koalas.\"\n\nWatch the original ad below, which has since been re-edited without Perry's offending line.", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png", "https://www.gannett-cdn.com/-mm-/80a5c83d5082c1f02ad93c057d3787b3da2ef66c/c=0-264-2716-1798/local/-/media/2017/07/07/USATODAY/USATODAY/636350148228818605-671577118-90413286.JPG?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/-mm-/3e5b49fed9a480ba61cead0af52b711833a5a46c/c=0-10-2716-2052/local/-/media/2017/07/07/USATODAY/USATODAY/636350148228818605-671577118-90413286.JPG?width=320&height=240"], "top_img": "https://www.gannett-cdn.com/-mm-/80a5c83d5082c1f02ad93c057d3787b3da2ef66c/c=0-264-2716-1798/local/-/media/2017/07/07/USATODAY/USATODAY/636350148228818605-671577118-90413286.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Maeve Mcdermott"], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2017/07/07/lena-dunham-animal-shelter-feud-over-her-abused-dog-lamby/458303001/", "title": "Animal shelter disputes Lena Dunham's account of her 'abused' dog Lamby", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/entertainthis/2017/07/07/lena-dunham-animal-shelter-feud-over-her-abused-dog-lamby/458303001/life/entertainthis", "theme-color": "#ffffff", "og": {"type": "article", "title": "Animal shelter disputes Lena Dunham's account of her 'abused' dog Lamby", "description": "Dunham claimed to give up her dog Lamby because of its history of abuse, but the\\u00a0BARC Shelter where the actress adopted the pup disagrees.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/80a5c83d5082c1f02ad93c057d3787b3da2ef66c/c=0-264-2716-1798/local/-/media/2017/07/07/USATODAY/USATODAY/636350148228818605-671577118-90413286.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Dunham claimed to give up her dog Lamby because of its history of abuse, but the\\u00a0BARC Shelter where the actress adopted the pup disagrees.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": ["https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FeXCHBhzlAYA%3Ffeature%3Doembed&url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DeXCHBhzlAYA&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FeXCHBhzlAYA%2Fhqdefault.jpg&key=205dfc3e29a54717b61d110ab0ac5a3d&type=text%2Fhtml&schema=youtube"], "publish_date": 1499382000.0, "source": "https://www.usatoday.com", "summary": ""}