{"url": "https://www.usatoday.com/story/life/entertainthis/2018/10/12/royal-wedding-princess-charlotte-prince-georges-cutest-moments/1612049002/", "text": "Princess Charlotte and Prince George's cutest moments at Princess Eugenie's royal wedding\n\nShow Caption Hide Caption Royals make a quick, blustery entrance into Princess Eugenie's wedding British royal family members hold on to their hats as they make their way inside Princess Eugenia's wedding at Windsor Castle. USA TODAY\n\nPrince George and Princess Charlotte always seem to quietly steal the show wherever they go – and their appearance at the royal wedding of their father's cousin, Princess Eugenie, was no different.\n\nThe royal siblings, ages five and three respectively, had some adorable moments as a page boy and bridesmaid at the St George's Chapel ceremony in Windsor Castle in Windsor, England Friday.\n\nAll dressed up in their uniforms designed by Amaia Arrieta of Amaia Kids, they attended the wedding along with more cute kids, including their second cousins and the great-great nephew of fashion designer Hubert de Givenchy (the French label that designed Duchess Meghan's wedding dress).\n\nCuteness overload: See George and Charlotte at Harry and Meghan's wedding\n\nHere are some of the Cambridge kids' cutest moments:\n\nThe little royals hammed it up with cousin Savannah Phillips (the granddaughter of Princess Anne who was seen covering George's mouth at Trooping the Colour in June). This time, the third in line to the throne was all smiles as Phillips appeared to play a pretend instrument at the event.\n\nWhen he was caught being mischievous this time, George covered his own mouth as he realized the cameras were on him.\n\nThe personalities were on display out the steps outside the chapel – the young princess waved to the crowd as her older brother shyly hid behind the other bridesmaids.\n\nThe design on the bridesmaid and page boy uniforms incorporated the Mark Bradford artwork included in the Order of Service.\n\nCharlotte had no compunction with modeling for the cameras.\n\nHer bridesmaid flowers, which included posies of Lily of the Valley and spray roses, reflected the bridal bouquet designed by Rob Van Helden.\n\nShe also gave a smile and waved to the crowd while arriving for the ceremony in a car with other bridesmaids and page boys.\n\nMarried! Princess Eugenie weds Jack Brooksbank at star-studded royal wedding\n\nMore: Fergie makes waves with outfit, expressions at Princess Eugenie's royal wedding\n\nMore: Eugenie's wedding dress by Peter Pilotto gives nod to battle with scoliosis", "images": ["https://www.gannett-cdn.com/presto/2018/10/12/USAT/97402283-4ba2-4331-994e-1803720be308-AFP_AFP_19Y9NQ.jpg?auto=webp&crop=2904,1634,x1,y151&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/presto/2018/10/12/USAT/700ad38d-a82d-458b-9b08-aa2c27c40bcd-VPCLIFE_ROYAL_WEDDING_TUMBLE.jpg", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/presto/2018/10/12/USAT/97402283-4ba2-4331-994e-1803720be308-AFP_AFP_19Y9NQ.jpg?auto=webp&crop=2904,1634,x1,y151&format=pjpg&width=1200", "keywords": [], "authors": ["Sara M Moniuszko"], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2018/10/12/royal-wedding-princess-charlotte-prince-georges-cutest-moments/1612049002/", "title": "Princess Charlotte and Prince George's cutest moments at Princess Eugenie's royal wedding", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/entertainthis/2018/10/12/royal-wedding-princess-charlotte-prince-georges-cutest-moments/1612049002/life/entertainthis", "theme-color": "#ffffff", "og": {"type": "article", "title": "Princess Charlotte and Prince George's cutest moments at Princess Eugenie's royal wedding", "description": "The royal siblings had some adorable moments as a page boy and bridesmaid at Princess Eugenie's wedding. Prepare to squee as you check out the photos.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/10/12/USAT/97402283-4ba2-4331-994e-1803720be308-AFP_AFP_19Y9NQ.jpg?auto=webp&crop=2904,1634,x1,y151&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "The royal siblings had some adorable moments as a page boy and bridesmaid at Princess Eugenie's wedding. Prepare to squee as you check out the photos.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1539298800.0, "source": "https://www.usatoday.com", "summary": ""}