{"url": "https://web.archive.org/web/20140913013502/http://abc7.com:80/archive/8355669", "text": "Brad Pitt opens up in new interviews about his past marriage to actress Jennifer Aniston, his current relationship with Angelina Jolie and what he calls his \"pathetic\" former lifestyle.\n\nThe 47-year-old actor, named People magazine's \"People's Sexiest Man Alive\" twice, rose to fame playing a hunky con artist in the 1991 film \"Thelma & Louise\" and is currently promoting his latest film, \"Moneyball,\" a baseball drama starring Jonah Hill that is set to be released on September 23.\n\nPitt and Aniston, his first and only wife, married in 2000 and divorced in 2005. Pitt and Jolie, 36, have been together since then and have a family. The actor and actresses make up one of Hollywood's most-talked about love triangles.\n\n\"I spent the '90s trying to hide out, trying to duck the full celebrity cacophony,\" Pitt told Parade magazine. \"I started to get sick of myself sitting on a couch, holding a joint, hiding out. It started feeling pathetic.\"\n\n\"It became very clear to me that I was intent on trying to find a movie about an interesting life, but I wasn't living an interesting life myself,\" he said. \"I think that my marriage had something to do with it. Trying to pretend the marriage was something that it wasn't.\"\n\nRumors of a romantic affair between Pitt and Jolie began to circulate in 2004, when they filmed the spy movie \"Mr. & Mrs. Smith,\" which saw them playing a married couple.\n\n\"That was just a great collaboration that turned into a greater collaboration,\" Pitt told Entertainment Weekly in a recent interview, when asked about the film. \"We should be doing everything together, and then we could work less. We could have more time off.\"\n\nPitt and Aniston, who have no children together, announced in January 2005 that they had broken up. Aniston, 42, filed for divorce two months later. Pitt and Jolie went public with their relationship in April 2005 and his divorce from Aniston was finalized the following October.\n\n\"I put much more emphasis on being a satisfied man,\" Pitt told Parade. \"I'm satisfied with making true choices and finding the woman I love, Angie, and building a family that I love so much.\"\n\nIn December 2005, the actor's spokesperson confirmed that Pitt had filed papers to adopt Jolie's adopted son, Maddox. The actress also brought home a girl, Zahara, from Ethiopia. The couple welcomed their first biological child, daughter Shiloh, in 2006. They adopted another son, Pax, a year later and Jolie gave birth to their twins, Knox and Vivienne, in 2008.\n\n\"When Angie and I first met, we came together quite quickly and we decided we were adopting,\" Pitt told Parade. \"Now the rules are that because we are not married, I can't adopt. Angie adopts. We decided we were adopting a daughter. We were going to do it right out of the gate. We were not going to mess around.\"\n\n\"Angie said, 'No shopping [for kids],' Pitt added. \"I thought that was astute and beautifully put. It took the pressure off of adoption and brought a magic to it. We had set our parameters - we had room in our family if anyone needed a home. We got the call, and that's our eldest daughter, Zahara.\"\n\nJolie said in a 2006 interview with Vogue magazine that she and Pitt fell for one another on the set of \"Mr. & Mrs. Smith,\" but remained \"good friends\" until he and Aniston announced their split.\n\nAniston told the magazine in 2008: \"There was stuff printed there that was definitely from a time when I was unaware that it was happening. I felt those details were a little inappropriate to discuss. That stuff about how she couldn't wait to get to work every day? That was really uncool.\"\n\nIn July of this year, Aniston said in an interview on the Bravo show \"Inside The Actor's Studio\" that her 2006 comedy film \"The Break-Up\" helped her cope with her real-life split from Pitt. The movie also stars Vince Vaughn, who Aniston dated for about a year after her breakup. Vaughn also appeared in \"Mr. & Mrs. Smith.\"\n\nAniston has been dating actor Justin Theroux since at least May. It was reported in August that they had recently moved in together and were looking for a new house to rent.", "images": ["https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/assets/news/kabc/images/logos/default_800x450.jpg", "https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/assets/news/kabc/images/logos/header-large.png", "https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/assets/news/global/images/nav/traffic.png", "https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/assets/news/global/images/social/facebook/circle-white.png", "https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/assets/news/kabc/images/logos/header-small.png", "https://web.archive.org/web/20140913013502im_/http://secure-us.imrworldwide.com/cgi-bin/m?ci=us-606744h&cg=0&cc=1&ts=noscript", "https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/images/otrc/2010/photos/8237678_1280x720.jpg", "https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/assets/news/global/images/social/googleplus/circle-white.png", "https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/assets/news/global/images/nav/sections.png", "https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/assets/news/global/images/logos/origin-otrc.png", "https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/assets/news/global/images/social/twitter/circle-white.png", "https://web.archive.org/web/20140913013502im_/http://pixel.quantserve.com/pixel/p-9e_QHc34iBt22.gif?labels=ABCLocalTV%2eKABC-TV", "https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/assets/news/global/images/social/email/circle-white.png", "https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/assets/news/global/images/nav/video.png", "https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/assets/news/kabc/images/mapmynews.png"], "top_img": "https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/assets/news/kabc/images/logos/default_800x450.jpg", "keywords": [], "authors": ["Corinne Heller"], "canonical_link": "https://web.archive.org/web/20140913013502/http://abc7.com/archive/8355669/", "title": "Brad Pitt opens up about Jennifer Aniston split, Angelina Jolie", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "description": "Brad Pitt opens up about past marriage to Jennifer Aniston, Angelina Jolie relationship and former &#39;pathetic&#39; lifestyle.", "keywords": "brad pitt jennifer aniston, brad pitt angelina jolie, brad pitt split aniston, jennifer aniston break-up brad pitt, jennifer aniston inside the actor studio, jennifer aniston breakup brad pitt, jennifer aniston brad pitt", "robots": "NOODP,NOYDIR", "google-site-verification": "EdOBOAYqKfbqQJzNUJrGqoH-NtxxBX7CsrhINpBYeKg", "msvalidate.01": "59C39F9AA91BE12CB90B7EF18335463D", "og": {"type": "article", "url": "https://web.archive.org/web/20140913013502/http://abc7.com/archive/8355669/", "title": "Brad Pitt opens up about Jennifer Aniston split, Angelina Jolie", "description": "Brad Pitt opens up about past marriage to Jennifer Aniston, Angelina Jolie relationship and former &#39;pathetic&#39; lifestyle.", "image": "https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/assets/news/kabc/images/logos/default_800x450.jpg", "site_name": "ABC7 Los Angeles"}, "fb": {"app_id": 1422894341291785}, "twitter": {"card": "summary", "url": "https://web.archive.org/web/20140913013502im_/http://abc7.com/archive/8355669/", "title": "Brad Pitt opens up about Jennifer Aniston split, Angelina Jolie", "description": "Brad Pitt opens up about past marriage to Jennifer Aniston, Angelina Jolie relationship and former &#39;pathetic&#39; lifestyle.", "image": "https://web.archive.org/web/20140913013502im_/http://cdn.abclocal.go.com/assets/news/kabc/images/logos/default_800x450.jpg", "site": "@abc7", "creator": "@abc7"}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}