{"url": "https://www.seventeen.com/celebrity/celebrity-couples/a21050217/scott-disick-sofia-richie-relationship-timeline/", "text": "Scott Disick and Sofia Richie's three-year relationship came to an end this summer. It seems like this classic Kardashian-adjacent couple just couldn't make it past their 15-year age difference. Don't worry, though, because you can relive their relationship with this in-depth timeline as you mourn the end of an era.\n\nOctober 5, 2020\n\nIt looks like there's little to no chance of a reconciliation between Scott and Sofia as Sofia has officially unfollowed her ex on Instagram.\n\nInstagram\n\nThis comes a few days after Scott was seen out with model Bella Banos, according to Us Weekly. The pair has actually been connected before. Back in 2017, Bella joined Scott in Costa Rica as he filmed for Keeping Up With the Kardashians.\n\n\"At first, Scott was just my friend,\" Bella explained to InTouch at the time. \"But he got to know me on a different level. We’re super connected.\"\n\n\n\nAfter their fling, Scott started seeing Sofia, but now that it's over, it seems like Scott is back to rekindling things with the model.\n\nAugust 20, 2020\n\nAfter two months of will they/won't, Scott and Sofia have reportedly broken up for good. According to E! News, while Sofia is the one who initiated the break back in May, it was Scott who ended things for good.\n\n\"Friends attributed their 15-year age difference becoming an issue,\" a source said about the reason for their breakup. \"[Scott's] in a very much different place in his life, really focused on a more quiet lifestyle, his kids and his investment businesses. And Sofia, at 21 years, really still trying to figure what she wants to do which drove them apart over time.\"\n\nApparently, Sofia \"really pushed to make things work between them after they initially broke up,\" but at this point, \"they are no longer speaking.\"\n\nJuly 15, 2020\n\nLess than two months after it was reported that Scott and Sofia had broken up, it seems like they may be back together. According to Us Weekly, the pair is \"hanging out again romantically\" and \"it's back on.\"\n\nApparently, Scott and Sofia \"weren’t getting along before – hence the split.\" Now though, a source is saying that Sofia wanted Scott to \"get through and overcome any issues\" he was facing. According to Us, \"Scott has returned to a place where Sofia feels comfortable being around him and being in his life again.\"\n\nJuly 6, 2020\n\nScott and Sofia were just spotted together again in Los Angeles during the Fourth of July weekend, according to the Daily Mail. The on-and-off-again couple grabbed a bite at Nobu and then hit up a Fourth of July party by the beach.\n\nA source told People, \"they seemed happy together but more friendly than romantic.\"\n\nScott and Sofia didn't post any pics together from their big reunion on social media, but it looks like things might be going well for them once again.\n\nMay 28, 2020\n\nFollowing reports that Scott and Sofia were on a break after Scott spent some time in a treatment facility, it seems like the pair might have officially called it quits. According to reports, Sofia ended things with Scott so she could \"do her own thing\" while he \"take[s] care of his health.\"\n\nApparently, Sofia wants to try to make a name for herself outside of her relationship with Scott. As a result, she has been spending more time with her family and has moved out of his house.\n\nDespite that, the breakup might not be permanent. A source told E! that \"it's very likely they will reconcile,\" so we will have to wait and see.\n\nMay 21, 2020\n\nAfter some speculation about the state of Sofia and Scott's relationship, we may finally have some clarity. According to Us Weekly, Scott and Sofia are on a break until Scott \"straightens himself out more.\"\n\nEarlier this month, Scott allegedly checked into a treatment facility, though not for substance abuse, but because he's been having a hard time dealing with the coronavirus pandemic and quarantine.\n\nAccording to a source, while \"at the beginning of the quarantine Scott was doing really well and was doing a great job at taking care of himself and staying positive and healthy,\" that is no longer the case. \"The quarantine has taken a toll on him and brought up old feelings and habits that may have not been fully resolved.\"\n\nNow, Scott seems to be working on himself, so he and Sofia are taking some time apart. \"Scott is in an OK place right now and is trying to get better and focus on work, but he has to prove himself,\" said the source.\n\nMay 17, 2020\n\nTMZ reports that Scott and Sofia may have broken up and she may even have a new man. Sofia has reportedly been in Malibu the past three days and TMZ says the mansion she's been staying at is owned by an unnamed man she's is rumored to be dating. Neither Scott or Sofia has confirmed anything.\n\nMarch 26, 2020\n\nSofia and Scott have been quarantine-ing together and are taking the cutest selfies. This one features their dog, Hersh.\n\nScott Disick // Instagram\n\nFebruary 11, 2020\n\nRumors that the couple might be on the rocks emerged after the two weren't seen much on social media. But it doesn't sound like you need to be worried about the two. A source told E! News, \"things are okay with them.\" Apparently, they just 'bicker\" like any other couple. \"They make empty threats that it's over and then they get back together. They are comfortable together, so it's easy to say things that you don't mean,\" the source said.\n\nThe source went on to say that the conflict might be because they spend so much time together so it's easy to annoy each other.\n\nNovember 1, 2019\n\nScott and Sofia showed off the cutest Halloween costumes. Sofia posted on her Insta this pic of them as Barbie and Ken.\n\nOctober 6, 2019\n\nIt seems like it took forever, but Sofia finally made her first appearance on KUWTK. In the episode, she goes on a family vacay with Scott, Kourtney and their kids to Finland. Seems kind of awkward, I know. While they're on the trip, Sofia even tells Scott, \"You're a lot more sophisticated with me when Kourtney's around. You turn into a five year old when it's just us.\"\n\nJune 5, 2019\n\nCelebrities CANNOT stop getting married these days! Seriously, it seems like every day there is a new rock to admire or a new white dress to check out. I'm not complaining, I love a good celebrity wedding, but this most recent engagement rumor is still pretty shocking.\n\nThat's right, according to Us Weekly, Scott and Sofia \"have talked seriously about getting engaged.\" The two have been dating for almost two years and at this point, they reportedly \"look at each other as life partners.\"\n\nI know what you're thinking: where is Kourtney and is she OK? Well, apparently she's is more than fine with this news! A source told Us that the couple has Kourtney's \"full support.\" Apparently it helps that \"Sofia is really so good with his kids and she has a good friendship and relationship with Kourtney.\"\n\nOK, this news is nice and all, but am I the only one who assumed that Kourtney and Scott would eventually get back together?! I mean they have three gorgeous kids together, and astrologically, they're EXTREMELY compatible, while Sofia's chart just doesn't mesh as well with Scott's.\n\nStill, if this is happening, I'll jump on board, especially if they film the wedding for an ep of Keeping Up With the Kardashians.\n\n\n\n\n\nApril 29, 2019\n\nThe love triangle between Kourtney, Scott, and Sofia continues to get more complicated as Kourtney and Scott discuss their meeting with a healer in Bali where they learned that they are soulmates. Obviously, this freaked Scott out a little considering the fact that he is dating Sofia Richie.\n\n\"I don’t really know what to think. I’m in another relationship,\" he said on Keeping Up with the Kardashians. Obviously Khloé was concerned about that too. \"If I was Sofia, I would be so insecure,” she told Scott. \"I don’t care how confident you are. It’s weird if you’re Sofia.\"\n\nScott revealed that Sofia is OK with her boyfriend's relationship with Kourtney. \"I mean, Sofia knew going into this that I was extremely close with Kourtney,\" he said. \"She was like, 'Listen, I will never get between you and your family and your children. Just speak to me and make me comfortable.'\"\n\nStill, Scott wasn't sure how his girlfriend would react to the \"soulmate\" news. \"I definitely don’t want to disrespect my relationship with Sofia because it means a lot to me,\" he said. And even if they aren't really soulmates, Scott still cares a lot about his ex and prioritizes her needs. \"Whether Kourtney and I are soulmates or not, I feel like I owe a lot to Kourtney for the times that I missed when I wasn’t the best partner to her. So I feel like I will forever be making up for that lost time for the rest of her life.\"\n\nFinally, the exes were able to talk about the whole situation and come to a conclusion. While they are no longer together, they have reached a \"more transparent phase\" in their relationship. \"I don’t know what the definition of soulmate is, but Scott and I, we’re going to be in each other’s lives forever,\" Kourtney said. \"We are soulmates, in a sense. No matter what, whether we’re ever together or not.\"\n\nApril 25, 2019\n\nIt's safe to say that Kourtney and Scott have an extremely complicated relationship. Despite the fact that they have been broken up for a few years now, Kourtney has admitted that she wants to have another kid with Scott, and now she's saying he's her soulmate...\n\nIt all went down when the famous fam went to Bali together, which will play out on an upcoming episode of Keeping Up With the Kardashians. All the sisters met with a healer while on the vacation, but while Kim and Khloe's experiences sounded pretty strange (Kim had to cut her hair and Khloé got her knee sucked), Kourtney's was the weirdest by far.\n\n\"Scott came in, and the guy was basically saying that in a past life that we were together, and that we’re soulmates,\" Kourt told her sisters. \"So he was like 'You have to decide if you want to be together or not be together.'\"\n\nWild, right? Well, apparently Khloé and Kim agree. \"I'm surprised from Kourtney's recap,\" Khloé says in her interview. Meanwhile, Kourtney is just sitting their smiling after dropping that MAJOR piece of information. She doesn't confirm that, yes, she and Scott are soulmates, but she doesn't deny it either. She's just sitting there like:\n\nE!\n\nSo, what does this mean for the future of Kourtney and Scott? And what does Sofia think about all of this? Honestly, who the heck knows.\n\nMarch 10, 2019\n\nScott and Sofia have a lot of haters. People are always coming after them because of their age difference, Scott's past, and their obsession with spon con. I mean, did you see how they celebrating Valentine's Day?\n\nLike any other celebrity, Sofia is probably constantly getting hateful comments left on her Instagrams regarding her relationship, but this time she actually responded to one. Instagram user, Amy, commented on a photo of Sofia, leaving a very strange message: \"Leave Scott alone and face your future.\"\n\nOK, let's pause for a sec because this comment is honestly confusing af. Amy is saying leave Scott alone, so does that mean that she's team Scott and thinks Sofia is bad for him? Or is she looking out for Sofia, but just wording it in a weird way? And then the whole \"face your future\" thing is super creepy. Overall, a weird comment.\n\nAnyway, Sofia was not having it, so she commented back, writing, \"Leave me alone and face your future,\" which is honestly the perfect comeback and makes a lot more sense than the original comment, if you ask me.\n\nDecember 2018\n\nScott and Sofia are spending more time together on vacation and they also have a special guest joining them.\n\nScott recently posted about their vacation in Cabo and Kourtney Kardashian is also there to take some time with them.\n\nPenelope, Reign, and Mason are also there and they even had a special movie night on the beach.\n\nLooks like there's not drama between Kourt and Sofia after all.\n\nNovember 2018\n\nThings might be on the rocks between Sofia and Scott. To start, Scott is completely absent from Sofia's Instagram account during the month of November. Most of Sofia's pics show her jet-setting around the world, hanging with her squad, and spending some quality time with her dad, Lionel.\n\nBut Sofia does make one appearance on Scott's IG page. On November 17, the two shared a couch (and a pic together). Sofia seems to be reading on an iPad as Scott posts a promo-y caption: \"Wondering how long it’s gonna take before she steals my hoodie.\" Other than that, it looks like Scott spent a lot of time with his kids in November. He posted a video and two pics of the kids around Thanksgiving.\n\nEarlier in the month they were spotted together during a Derby Day in Melbourne, Australia.\n\nWhile it seemed everything was going as planned for the couple, something else must have happened between them as Sofia was seen wiping away some tears as she argued with Scott, according to People. The two of them left right after their fight.\n\nAs for Kourt, she seems to be moving on, too. She is most recently linked to Grownish star Luka Sabbat. You can read all about their whirlwind fling here.\n\nOctober 2018\n\nSofia starts off the Halloween season with a sexy AF and super suggestive pic of herself in bed. The image features Sofia smoldering in a skin-tight, spaghetti strap onesie (VERY Kardashian of her) as she sits in a boudoir (I'm assuming it's a hotel and not their bedroom?) looking longingly at Scott, who can be seen in the mirror's reflection. She captioned the pic: \"The man in the mirror 😍\"\n\nThings got interesting a few weeks later after Scott was seen vacationing with Kourtney and her sisters for a family vacation in Bali. While many thought that Sofia would be there, it turns out that she didn't make an appearance. Some fans were starting to believe that Sofia and Scott broke things off and he was back together with Kourt.\n\nHowever, after spending a couple of days in Bali, Scott posted a cute picture of him and Sofia together in Singapore, putting breakup rumors to rest.\n\nInstagram\n\nSeptember 2018\n\nThis month, we get a true glimpse into Scott and Sofia's relationship.\n\nDespite the fact that the two have been dating for over a year, a sneak peek for a Keeping Up with the Kardashians episode revealed that he's apparently thinking of having another baby with his ex, Kourtney!\n\n\"So, Scott just texts me that he wants to have another baby with Kourtney,” Kim tells a friend in the clip “I think he just wants one more, and she wants one more.”\n\nSimple enough, right? Except for the fact that both Scott and Kourtney are in relationships (Kourtney was dating Younes at the time, and she's now linked to Luka Sabbat).\n\nApparently, Kim doesn't see that as a roadblock, she has a solution. \"They don’t even have to have sex. It could be IVF.\" Kim decides to email the rest of the family to help encourage the two to go for another kid. She believes it makes sense that all of Kourtney's kids should have the same father.\n\nHmmm, we wonder what Sofia thinks about all of this.\n\nAnd as for Sofia, we learn a little more about her this month, as well.\n\nAfter reports emerge stating that Richie has a rule where she will not talk about Scott in interviews, her resolve is put to the test.\n\nIn an awkward AF interview with Australia's The Morning Show, Sofia was more or less forced to talk about Scott as the interviewers tried to insert his name into almost every single question they asked. They even went as far as calling out the fact that she doesn't like to talk about him on camera.\n\nThe host said: \"Are you happy answering all these questions? Because when we want to talk to you, people invariably want to bring up your relationships and stuff with your dad and with your sister as well. Does that ever get tiring, do you wish we wouldn't ask that? Or you're happy for us to sit here and ask you those questions?\"\n\nSofia totally kept her cool, saying \"I mean, I can't deny the fact that that's my life. By the way, that's been my life forever, it's nothing new to me. I'm not upset that I have to answer these questions, but there are moments that I have where I'm like, I want to be my own person and I want to stand as my own person. And I think that's actually what drives me to work and do my own thing, and to want to make my own mark. I be want to seen as my own person, even though I have all these amazing people in my life that I love so much.\"\n\nWatch the interview below:\n\nSo, what's Scott up to while all this is going on? Well, according to a recent clip from Keeping Up With The Kardashians, he's fighting with Kourtney about some Sofia stuff. Apparently, Scott introduced their kids to Richie without checking in with Kourt first, and she was NOT having it.\n\n\"It's called giving someone a heads up and having a respectful conversation, giving someone the respect,\" Kourtney tells Scott in the tense clip. \"I make sacrifices all the time and you're not following through with the things that you say you're gonna do. Then you just go and do whatever you want and I'm not okay with it.\"\n\nBut Scott's def not on the same page as Kourtney, saying, \"I think you expect a lot from a lot of people. Not always can your expectations always be met, even though people are trying their hardest to please you.\"\n\nWatch it all go down below:\n\nJuly 2018\n\nThe couple recently hit up Greece together and Scott shared a very interesting goodbye as they headed back to the States.\n\nScott posted the scandalous photo of Sophia in a very teeny black thong while the couple seemed to take in the sights together. She also wore a matching black bikini top and a crossbody that helped cover part of her behind.\n\nInstagram\n\nLooks like the couple are doing just fine, even after Scott's big cheating scandal the month before.\n\nJune 2018\n\nOn June 1, photos surface that show Scott partying it up in Jackson Hole, Wyoming for the release of Kanye's new album, Ye. In the photos, Scott has his arms around a woman with dirty blonde hair who is NOT Sofia, according to TMZ. People at the event also claim that Scott appeared drunk.\n\nSo where was Sofia that night? The 19-year-old model posted a pic from Nobu restaurant in Malibu.\n\n\n\nBut bad news travels fast. Upon learning on Scott's behavior with this mystery woman, Sofia reportedly called it quits.\n\n“He cheated on her, and she confronted him,” a source close to the couple told People.\n\nThe 19-year-old model has also reportedly moved out of Scott's home. Sources said she was looking for a place of her own.\n\n\n\nSources also said that, Sofia's dad, Lionel Richie, was not heartbroken over the split. “Lionel hasn’t approved of the relationship since the beginning,” an insider told People. “He joked about it publicly but he was livid.”\n\nBut, after all the drama, it seems Scott and Sofia are still going strong. According to TMZ, they're very much still together. Although Sofia wasn't happy about the photo of Scott and the mystery woman, she hasn't ended their relationship just yet. But wasn't Scott telling everyone at the party he was single? A source told the site that was just the alcohol talking...\n\nIn response to TMZ's report, Scott posted a screenshot of the news story on his Instagram stories and wrote, \"We had no idea we even broke up but thanks for thinking of us.\" So guess everything's good, right?\n\nInstagram\n\nSofia also got on IG Stories to set everyone straight. She posted a pic of her and Scott cuddling on a plane with the text \"whole heart\" written across the image. Then, she posted a second image that said, \"Don't believe the internet.\"\n\nThe couple even took things to the next level by reportedly moving in together. Sofia is currently staying at Scott's house, with a source confirming to People, \"Sofia again lives with him. Everything seems good now. It’s back to normal.\"\n\n\n\nMay 2018\n\nSofia spends more and more time with Scott's 3 kids Mason, Penelope, and Reign. “It helps that Kourtney now trusts Sofia,” a source tells PEOPLE. “The kids are allowed to spend time with her. Sofia likes having them and helps Scott. So far, the kids are giving Kourtney good reports about Sofia.”\n\n“Sofia has shown over and over again that she is willing to stay with Scott even when things are not great — but Scott is doing well lately.\"\n\nThe two go on vacation with the kids for Scott's birthday. Sofia posts this beach pic with the caption: \"Happy Birthday babe! Thank you for being you. Love you.\"\n\nView full post on Instagram\n\nEarlier this month, Sofia and Scott are seen babysitting the kids while Kourtney is off on a romantic getaway with boyfriend and model Younes Bendjima.\n\nMarch 2018\n\nThe two are snapped grabbing frozen yogurt together.\n\nFebruary 2018\n\nScott confirms his relationship with Sofia on Keeping Up With the Kardashians. During the episode, Kris grills Scott on his new relationship, and it gets awkward AF.\n\nHere's their dialogue:\n\n“What’s going on? Are you dating?” Kris asked.\n\n“Sure,” Scott replied.\n\n“Are you dating one person? Just one?” she asked.\n\n“Yeah. It’s something new,” Scott responded.\n\n“Are you going steady?” Kris continued.\n\n“I guess that’s what the kids are calling it,” Scott responded.\n\n“Is it Sofia?” Kris asked, finally cutting to the chase.\n\nJanuary 2018\n\nSofia and Scott live it up in Mexico, chilling on yachts and making out in pools.\n\n\n\nDecember 2017\n\nThe couple waste no time getting out and about with their relationship. The two are spotted strolling on a beach in Miami on December 6. That same night, they make their first public appearance as a couple at DuJour magazine’s Art Basel kickoff party. There, they kiss all night.\n\nA few days later, Sofia and Scott share a passionate kiss at Sugar Factory in Miami Beach in front of all their friends AND paparazzi. They are making their love KNOWN.\n\nNovember 2017\n\nIt seems like Scott might still be using dating apps even though he's official with Sofia, and someone has serious feels about it. And no, it's not Sofia. Kylie Jenner's now-ex Tyga gets a hold of a screenshot of Scott's profile on the dating app Badoo and posts it on his Instagram story. Interesting.\n\nOctober 2017\n\nLionel Richie tells Us Weekly that he's “scared to death” about Sofia's new relationship. But that doesn't seem to bother the Keeping Up with the Kardashians star. A source later says: “Scott wasn’t bothered by Lionel’s recent comments.”\n\n\n\nAnd, tbh, the two don't look bothered as they make out on a jet ski in the middle of the ocean that same month.\n\nSeptember 2017\n\nAfter months of dating rumors swirling around the pair, Sofia and Scott make it Instagram official on September 24 when Scott posts some PDA-packed pics on Instastories.\n\nInstagram\n\nThe two also post a picture of a dessert that says: Congratulations Scott and Sofia (except Sofia is spelled wrong, lol). And they even go a step further by posting a video of them kissing while the dessert is placed in front of them. Reports say that the two are \"inseparable.\"\n\n\n\nInstagram\n\nScott is 15 years older than Sofia.\n\nThis news comes shortly after Scott's whirlwind spring and summer, during which he gets cozy with a few different women (including Bella Thorne).\n\nREGISTER TO VOTE HERE\n\nAlison Caporimo Digital Deputy Editor As the digital deputy editor of Seventeen, I help our site director oversee content on the site and across all of our social media platforms. In 2013, I published a DIY book for beginners called InstaCraft (Ulysses Press). In 2015, I served as a jewelry designer for The Jewelry Recipe Book (Artisan). Before coming to Seventeen, I held positions at The New Yorker, Allure, Every Day with Rachael Ray, Reader's Digest and BuzzFeed.\n\nTamara Fuentes Associate Entertainment Editor Tamara Fuentes is the current Associate Entertainment Editor at Cosmopolitan, where she covers TV, movies, books, celebrities, and more. She can often be found in front of a screen fangirling about something new. Before joining Cosmopolitan, she was the entertainment editor over at Seventeen. She is also a member of the Television Critics Association and the Latino Entertainment Journalists Association. Follow her on Twitter and Instagram.", "images": ["https://hips.hearstapps.com/hmg-prod/images/lead-image-kardashian-01-1634846843.png?crop=0.502xw:1.00xh;0.258xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/khloetristan-1652104698.jpg?crop=0.998xw:0.812xh;0.00160xw,0.0869xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/scott-disick-and-sofia-richie-arrive-at-sophia-richies-21st-news-photo-1576708821.jpg?crop=0.870xw:0.307xh;0.0593xw,0.0734xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/kim-kardashian-attends-the-tiah-4th-annual-fundraiser-at-news-photo-1661969683.jpg?crop=1.00xw:0.668xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1413338821-1-1662993024.jpg?crop=1.00xw:0.801xh;0,0.0513xh&resize=180:*", "https://hips.hearstapps.com/vidthumb/images/sofia-1597953035.jpg?crop=1.00xw:1.00xh;0,0&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/img-2909-1601900399.jpg?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/kendall-jenner-and-devin-booker-attend-the-nba-2k-launch-news-photo-1662729282.jpg?crop=1.00xw:0.668xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1188903916-1-1662561609.jpg?crop=1.00xw:0.667xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/jaden-smith-kendall-jenner-and-hailey-baldwin-attend-march-news-photo-1664978073.jpg?crop=0.601xw:0.900xh;0.0521xw,0.100xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/165512-7146-e658dd58-1664889952.jpeg?crop=1.00xw:0.668xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/lead-image-side-by-side-2-02-16-1663684456.jpg?crop=1.00xw:1.00xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/sophia-richie-scott-disick-1540846186.jpg?crop=1xw:1xh;center,top&resize=320:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2019-04-25-at-12-47-53-pm-1556210897.png?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/kendall-jenner-is-seen-on-august-24-2022-in-los-angeles-news-photo-1661527336.jpg?crop=0.564xw:0.403xh;0.221xw,0.0664xh&resize=180:*", "https://www.seventeen.com/_assets/design-tokens/seventeen/static/images/logos/network-logo.21081f5.svg", "https://hips.hearstapps.com/hmg-prod/images/sofia-richie-bikini-scott-disick-instagram-photo-1531418612.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/scott-disick-instagram-story-1528209200.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2020-03-27-at-4-52-59-pm-1585591735.png?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/image-1527865161.jpeg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/khloe-kardashian-arriving-for-lunch-at-the-abbey-of-san-news-photo-1664981897.jpg?crop=0.572xw:0.381xh;0.239xw,0.0391xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/rs-634x1127-170923160714-634-scott-disick-sofia-richie-kf-92317-png-1527864200.jpeg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/kim-kardashian-west-of-the-justice-project-speaks-onstage-news-photo-1665099501.jpg?crop=0.670xw:1.00xh;0.0897xw,0&resize=180:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/scott-disick-and-sofia-richie-arrive-at-sophia-richies-21st-news-photo-1576708821.jpg?crop=0.870xw:0.307xh;0.0593xw,0.0734xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.seventeen.com/celebrity/celebrity-couples/a21050217/scott-disick-sofia-richie-relationship-timeline/", "title": "Scott Disick and Sofia Richie's Relationship Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Scott Disick and Sofia Richie's Relationship Timeline - Sofia Richie and Lord Disick Age Difference", "description": "If you loved Scott on 'Keeping Up with the Kardashians,' then you wondered what would become of his love life after his split with Kourtney. Here's everything you need to know about Scott and his girlfriend Sofia Richie.", "keywords": "scott disick, sofia richie, scott disick sofia richie, scott disick relationship, scott disick sofia richie relationship, scott disick dating 2018, who is scott disick dating, sofia richie age, kourtney kardashian and scott disick, lord disick, kourtney kardashian scott disick, lionel richie daughter, scott disick age", "theme-color": "#000000", "og": {"site_name": "Seventeen", "title": "Sofia Richie Unfollowed Scott Disick on Instagram After He Was Seen Out With Another Woman", "description": "Guess that's over.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/scott-disick-and-sofia-richie-arrive-at-sophia-richies-21st-news-photo-1576708821.jpg?crop=0.870xw:0.307xh;0.0593xw,0.0734xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.seventeen.com/celebrity/celebrity-couples/a21050217/scott-disick-sofia-richie-relationship-timeline/", "type": "article"}, "fb": {"app_id": 112965278727107, "pages": 8028997215}, "article": {"publisher": "https://www.facebook.com/seventeen", "section": "Celeb Couples", "modified_time": "2021-09-20T22:03:39Z", "published_time": "2020-10-05T20:17:00Z"}, "twitter": {"site": "@seventeen", "image": "https://hips.hearstapps.com/hmg-prod/images/scott-disick-and-sofia-richie-arrive-at-sophia-richies-21st-news-photo-1576708821.jpg?crop=0.870xw:0.307xh;0.0593xw,0.0734xh&resize=640:*", "card": "summary_large_image"}, "google-site-verification": "uQMdsrh02fvs6lNVGcB04v0iEtK1MpGMQ3UF-Fy0RVI", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/scott-disick-and-sofia-richie-arrive-at-sophia-richies-21st-news-photo-1576708821.jpg?crop=1.00xw:0.707xh;0,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/scott-disick-and-sofia-richie-arrive-at-sophia-richies-21st-news-photo-1576708821.jpg?crop=1.00xw:0.707xh;0,0&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/scott-disick-and-sofia-richie-arrive-at-sophia-richies-21st-news-photo-1576708821.jpg?crop=1.00xw:0.707xh;0,0", "auto-publish": "timely", "sailthru.excerpt": "Scott Disick and Sofia Richie's three-year relationship came to an end this summer. It seems like this classic Kardashian-adjacent couple just couldn't make it past their 15-year age difference. Don't worry, though, because you can relive their relationship with this in-depth timeline as you mourn the end of an era.", "sailthru.tags": "celebrity,Celebs & Entertainment,celebrity-couples,Celeb Couples", "sailthru.date": "2020-10-05 20:17:00", "sailthru.socialtitle": "Sofia Richie Unfollowed Scott Disick on Instagram After He Was Seen Out With Another Woman", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 45}, "movies": [], "publish_date": 1601929020.0, "source": "https://www.seventeen.com", "summary": ""}