{"url": "https://www.hollywoodreporter.com/live-feed/james-corden-stages-andrew-lloyd-webber-themed-crosswalk-musical-london-1121396", "text": "James Corden has brought “Crosswalk the Musical” to London. While shooting The Late Late Show across the pond, Corden staged an Andrew Lloyd Webber-themed edition of the segment, featuring songs from some of the composer’s best-known musicals.\n\n“So we’re back. We’re on home shores,” says Corden, introducing the segment. “There are really only two events that everyone in Britain circled on their calendar this year. One, the royal wedding, which, you know, happened, and two, this: Crosswalk the Musical.”\n\n“Gather around everyone. Gather around,” Corden tells his theater troupe. “To commemorate our return to this greatest of isles, Great Britain, we will be celebrating the work and career of one of the true legends of the stage. None other than Mr. the Lord Lloyd Andrew Lloyd Webber.”\n\nThe performers then crowd the legendary composer before Corden yells at them. He then curtsies in front of Lloyd Webber, who asks, “What are you doing down there? Get up.”\n\n“To have Lloyd Andrew Lloyd Webber choose us to help him celebrate his 70th year is the icing on the icing on the cake. It’s a cake with two icings, which sounds incredible,” says Corden.\n\nHe explains that the group will perform a medley of songs from the composer. The host then realizes that he may have been saying Lloyd Webber’s name wrong. “I feel like I’m saying it wrong. Is it Lloyd Lord Andrew Lloyd Webber?” he asks. The composer responds, “Lord Lloyd.”\n\n“To be honest, when James asked me if he could perform my musicals at the crosswalk I couldn’t believe it,” says Lloyd Webber while Corden pushes a huge ball of red yarn as he trains the performers. “I thought the production could use some youth and energy, so I’ve asked the cast of my School of Rock musical to come by. I think James is going to absolutely love it.”\n\nAfter watching the young cast perform, Corden appears unimpressed. “Yeah, we had to let them go. Attitude problems,” he says.\n\nCorden later gives Lloyd Webber the opportunity to read the cast list, which reveals that Corden has been cast in all the main roles.\n\nThe first musical number the ensemble performs is from Evita. Corden wears a strapless white dress as he takes on the role of Eva Peron. Lloyd Webber can be seen watching the performance and holding a playbill on the sidewalk. The composer throws a bouquet of roses to the cast after the performance, at which Corden screams, “He’s throwing them to me.”\n\n“Patti LuPone, Madonna, Elaine Paige and I don’t want to say it, but I think James Corden is now top of that list, ” says Corden of his place among well-known actresses that played Eva Peron. Lloyd Webber later says, “Yeah, well, he’s definitely bottom of the list.”\n\nThe theater group then takes on a musical number from Cats. While preparing for the performance, they easily get distracted by a pedestrian’s dog.\n\nThe group then performs a number from Phantom of the Opera. “Where’s my Christine?” asks Corden, who is dressed as the phantom. “We don’t have a Christine. Who is playing Christine?”\n\nIn desperate need of an actor for Christine, Corden calls in a favor. Josh Gad then shows up to help out. “You know, once you’ve appeared in one Crosswalk the Musical, you become like a member of the company for life. We’re like theatrical Navy SEALs,” says the star of Crosswalk the Musical: Beauty and the Beast.\n\nFollowing the number, Lloyd Webber praises Gad’s performance. “Josh, you’re gorgeous and marvelous,” he says. A jealous Corden tells Gad he can leave.\n\nThe final performance by the group is “Any Dream Will Do” from Joseph and the Amazing Technicolor Dreamcoat. The elaborate performance draws a positive review from Lloyd Webber. The group, including the composer, then take their final bow and receive a round of applause from the people stuck in traffic.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/06/crosswalk_the_musical_andrew_lloyd_webber_classics_screen_shot-h_2018_0.jpg?w=768", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/crosswalk_the_musical_andrew_lloyd_webber_classics_screen_shot-h_2018_0.jpg?w=768", "keywords": [], "authors": ["Katherine Schaffstall"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/james-corden-stages-andrew-lloyd-webber-themed-crosswalk-musical-london-1121396/", "title": "James Corden Stages Andrew Lloyd Webber-Themed “Crosswalk the Musical” in London", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "James Corden and Josh Gad staged an Andrew Lloyd Webber-themed edition of \"Crosswalk the Musical\" — performing songs from 'Evita,' 'Cats,' 'Phantom of the Opera' and 'Joseph and the Amazing Technicolor Dreamcoat' — during the 'Late Late Show's' return to London.", "news_keywords": "Andrew Lloyd Webber, international, James Corden, Late-Night TV, London Theater, The Late Late Show", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Katherine Schaffstall", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1121396, "title": "James Corden Stages Andrew Lloyd Webber-Themed \"Crosswalk the Musical\" in London", "published_at": "2018-06-19 12:38:06", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/crosswalk_the_musical_andrew_lloyd_webber_classics_screen_shot-h_2018_0.jpg?w=768", "comment_count": 0, "tags": "The Late Late Show", "topics": "TV News", "body": "James Corden has brought \"Crosswalk the Musical\" to London. While shooting The Late Late Show across the pond, Corden staged an Andrew Lloyd Webber-themed edition of the segment, featuring songs from some of the composer's best-known musicals.\r\n\"So we're back. We're on home shores,\" says Corden, introducing the segment. \"There are really only two events that everyone in Britain circled on their calendar this year. One, the royal wedding, which, you know, happened, and two, this: Crosswalk the Musical.\"\r\n\"Gather around everyone. Gather around,\" Corden tells his theater troupe. \"To commemorate our return to this greatest of isles, Great Britain, we will be celebrating the work and career of one of the true legends of the stage. None other than Mr. the Lord Lloyd Andrew Lloyd Webber.\"\r\nThe performers then crowd the legendary composer before Corden yells at them. He then curtsies in front of Lloyd Webber, who asks, \"What are you doing down there? Get up.\"\r\n\"To have Lloyd Andrew Lloyd Webber choose us to help him celebrate his 70th year is the icing on the icing on the cake. It's a cake with two icings, which sounds incredible,\" says Corden.\r\nHe explains that the group will perform a medley of songs from the composer. The host then realizes that he may have been saying Lloyd Webber's name wrong. \"I feel like I'm saying it wrong. Is it Lloyd Lord Andrew Lloyd Webber?\" he asks. The composer responds, \"Lord Lloyd.\"\r\n\"To be honest, when James asked me if he could perform my musicals at the crosswalk I couldn’t believe it,\" says Lloyd Webber while Corden pushes a huge ball of red yarn as he trains the performers. \"I thought the production could use some youth and energy, so I've asked the cast of my School of Rock musical to come by. I think James is going to absolutely love it.\"\r\nAfter watching the young cast perform, Corden appears unimpressed. \"Yeah, we had to let them go. Attitude problems,\" he says.\r\nCorden later gives Lloyd Webber the opportunity to read the cast list, which reveals that Corden has been cast in all the main roles.\r\nThe first musical number the ensemble performs is from Evita. Corden wears a strapless white dress as he takes on the role of Eva Peron. Lloyd Webber can be seen watching the performance and holding a playbill on the sidewalk. The composer throws a bouquet of roses to the cast after the performance, at which Corden screams, \"He's throwing them to me.\"\r\n\"Patti LuPone, Madonna, Elaine Paige and I don't want to say it, but I think James Corden is now top of that list, \" says Corden of his place among well-known actresses that played Eva Peron. Lloyd Webber later says, \"Yeah, well, he's definitely bottom of the list.\"\r\nThe theater group then takes on a musical number from Cats. While preparing for the performance, they easily get distracted by a pedestrian's dog.\r\nThe group then performs a number from Phantom of the Opera. \"Where's my Christine?\" asks Corden, who is dressed as the phantom. \"We don't have a Christine. Who is playing Christine?\"\r\nIn desperate need of an actor for Christine, Corden calls in a favor. Josh Gad then shows up to help out. \"You know, once you've appeared in one Crosswalk the Musical, you become like a member of the company for life. We're like theatrical Navy SEALs,\" says the star of Crosswalk the Musical: Beauty and the Beast.\r\nFollowing the number, Lloyd Webber praises Gad's performance. \"Josh, you're gorgeous and marvelous,\" he says. A jealous Corden tells Gad he can leave.\r\nThe final performance by the group is \"Any Dream Will Do\" from Joseph and the Amazing Technicolor Dreamcoat. The elaborate performance draws a positive review from Lloyd Webber. The group, including the composer, then take their final bow and receive a round of applause from the people stuck in traffic.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "James Corden Stages Andrew Lloyd Webber-Themed “Crosswalk the Musical” in London", "url": "https://www.hollywoodreporter.com/tv/tv-news/james-corden-stages-andrew-lloyd-webber-themed-crosswalk-musical-london-1121396/", "description": "James Corden and Josh Gad staged an Andrew Lloyd Webber-themed edition of “Crosswalk the Musical” — performing songs from ‘Evita,’ ‘Cats,’ ‘Phantom of the …", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/crosswalk_the_musical_andrew_lloyd_webber_classics_screen_shot-h_2018_0.jpg?w=768", "width": 768, "height": 433}, "locale": "en_US"}, "article": {"published_time": "2018-06-19T12:38:06+00:00", "modified_time": "2018-06-19T15:52:55+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "James Corden Stages Andrew Lloyd Webber-Themed “Crosswalk the Musical” in London", "description": "James Corden and Josh Gad staged an Andrew Lloyd Webber-themed edition of “Crosswalk the Musical” — performing songs from ‘Evita,’ ‘Cats,’ ‘Phantom of the …", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/crosswalk_the_musical_andrew_lloyd_webber_classics_screen_shot-h_2018_0.jpg?w=768"}}, "movies": [], "publish_date": 1529411886.0, "source": "https://www.hollywoodreporter.com", "summary": ""}