{"url": "https://www.nbcnews.com/news/nbcblk/pepsi-ad-kendall-jenner-echoes-black-lives-matter-sparks-anger-n742811", "text": "If the Black Lives Matter movement were led by a 21-year-old white supermodel armed with a can of fizzy soda, then maybe everyone would just get along.\n\nThat's the vision presented in Pepsi's new ad featuring reality TV star Kendall Jenner. The ad was pulled on Wednesday after being met with widespread condemnation, with critics accusing the drinks giant of appropriating a nationwide protest movement following police shootings of African Americans.\n\n\"Pepsi was trying to project a global message of unity, peace and understanding. Clearly we missed the mark, and we apologize,\" Pepsi wrote in a statement on Wednesday. \"We did not intend to make light of any serious issue. We are removing the content and halting any further rollout. We also apologize for putting Kendall Jenner in this position.\"\n\nIn the ad released Tuesday, Jenner is in the middle of a photo shoot when she happens to notice a protest march making its way down the street.\n\nIt's not clear what the smiling, attractive demonstrators are upset about, the only clues being their placards reading \"peace\" and \"love\" and \"join the conversation.\"\n\nBut Jenner decides to join them anyway, beckoned into the throng by a handsome man with a cello. She rips off her blonde wig, wipes away her lipstick and joins the marchers. The beaming, break-dancing protesters are a far cry from the often fractious demonstrations that have broken out across the United States over the past few years.\n\n\"They ain't have no more damn Pepsi at the store!\" pic.twitter.com/lVb8hA7Feo — malibu nova (@theBrittdoll) April 5, 2017\n\nIn Pepsi's version, no one seems too worked up about anything. Jenner fist-bumps one of her recently adopted activists, before grabbing a can of Pepsi from a well-stocked ice-bucket.\n\nThen comes the ad's climax — and perhaps the part that has caused most uproar. Jenner reaches the remarkably calm front-line of the protest. She spots an officer, walks up to him and hands him the Pepsi.\n\nHe takes a sip, a woman wearing a nose-ring and a traditional Muslim headscarf takes a photograph and everybody cheers.\n\nThe ad has sparked accusations that Pepsi has appropriated a racial protest movement to sell a global fizzy drinks brand.\n\n\"This ad trivializes the urgency of the issues and it diminishes the seriousness and the gravity of why we got into the street in the first place,\" activist DeRay McKesson told NBC News correspondent Gabe Gutierrez.\n\nMcKesson, who organized and protested in Ferguson after the death of Michael Brown, also takes issue with the brand's apology. \"Pepsi didn't apologize to all of the people who have been protesting for two years, didn't apologize to the people who dedicated their lives and their time to these issues and to understand the urgency of them because in so many cases, there's so much at stake including people's lives,\" he said.\n\nIt drew scathing criticism on social media from Bernice King, the youngest daughter of Dr. Martin Luther King Jr. She posted an image of her father mid-peaceful protest — literally being pushed back by a police line and tweeted: \"If only Daddy would have known about the power of #Pepsi.\"\n\nIf only Daddy would have known about the power of #Pepsi. pic.twitter.com/FA6JPrY72V — Be A King (@BerniceKing) April 5, 2017\n\nPepsi in turn responded directly to King, \"We at Pepsi believe in the legacy of Dr. King & meant absolutely no disrespect to him & others who fight for justice.\"\n\n@BerniceKing We at Pepsi believe in the legacy of Dr. King & meant absolutely no disrespect to him & others who fight for justice. pic.twitter.com/rM8W8i0Euu — Pepsi™ (@pepsi) April 5, 2017\n\nMany people believe the final scene of the ad in particular is a direct reference to one of the defining images of the Black Lives Matter movement: a photograph of Ieshia Evans, a 28-year-old nurse being detained in Baton Rouge, Louisiana.\n\nI'm boycotting all @Pepsi products until they apologize for this blasphemy. Here's a list of their brands: https://t.co/9Rf91nLVyX pic.twitter.com/HsvUvj27Bl — Charles M. Blow (@CharlesMBlow) April 5, 2017\n\nSome took to Twitter, calling out the brand with satire.\n\nThe Pepsi commercial shows us that capitalism will steal our lives and then find multiple ways to make a profit of our death. — Brotha B (@BlakeDontCrack) April 5, 2017\n\nPepsi said the film, titled \"Jump In,\" was produced by PepsiCo's in-house content creation arm, Creators League Studio.\n\nThe company said the ad \"features multiple lives, stories and emotional connections that show passion, joy, unbound and uninhibited moments.\"\n\nKendall Jenner in the new Pepsi ad (L) and Ieshia Evans during the Baton Rouge Protest (R). Jonathan Bachman (R) / You Tube/Reuters\n\nIt was designed to \"truly reflect today's generation and what living for now looks like\" and it described Jenner as someone who \"exemplifies owning 'Live For Now' moments.\"\n\nPepsi is not the first multinational brand to attempt to use counterculture and protest movements to sell its product. In 1971, Coca-Cola’s iconic \"I’d Like to Teach the World to Sing,\" advertisement rode the wave of flower-power protest that had emerged in opposition to the Vietnam War.", "images": ["https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2017_14/1955161/170405-pepsi-composite-cr-0807.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2017_14/1955116/170405-pepsi-cr-0736.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_14/1955116/170405-pepsi-cr-0736.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-760x428,f_auto,q_auto:best/MSNBC/Components/Video/201704/2017-04-05T22-53-31-2Z--1280x720.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-60x60,f_auto,q_auto:best/newscms/2020_03/3183816/alex-smith-circle-byline-template.jpg"], "top_img": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_14/1955116/170405-pepsi-cr-0736.jpg", "keywords": [], "authors": ["Https", "Media-Cldnry.S-Nbcnews.Com Image Upload Newscms Alex-Smith-Circle-Byline-Template.Jpg", "Alexander Smith", "Alexander Smith Is A Senior Reporter For Nbc News Digital Based In London."], "canonical_link": "https://www.nbcnews.com/news/nbcblk/pepsi-ad-kendall-jenner-echoes-black-lives-matter-sparks-anger-n742811", "title": "Pepsi Pulls Controversial Kendall Jenner Ad After Outcry", "meta_data": {"msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/nbcnews/all-other-sizes-PNG.ico/browserconfig.xml", "robots": "max-image-preview:large", "fb": {"app_id": 10150138890205613, "pages": 1508175089456029}, "og": {"site_name": "NBC News", "locale": "en_US", "url": "https://www.nbcnews.com/news/nbcblk/pepsi-ad-kendall-jenner-echoes-black-lives-matter-sparks-anger-n742811", "title": "'We missed the mark': Pepsi pulls ad featuring Kendall Jenner after controversy", "description": "Pepsi's a short film echoing the Black Lives Matter movement was met with widespread condemnation following its release.", "image": {"identifier": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_14/1955116/170405-pepsi-cr-0736.jpg", "secure_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_14/1955116/170405-pepsi-cr-0736.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@NBCNews", "creator": "NBCNews", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1024-512,f_auto,q_auto:best/newscms/2017_14/1955116/170405-pepsi-cr-0736.jpg", "title": "'We missed the mark': Pepsi pulls ad featuring Kendall Jenner after controversy", "description": "Pepsi's a short film echoing the Black Lives Matter movement was met with widespread condemnation following its release.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1, user-scalable=yes", "description": "Pepsi's a short film echoing the Black Lives Matter movement was met with widespread condemnation following its release.", "branch": {"deeplink": {"title": "'We missed the mark': Pepsi pulls ad featuring Kendall Jenner after controversy", "description": "Pepsi's a short film echoing the Black Lives Matter movement was met with widespread condemnation following its release.", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_14/1955116/170405-pepsi-cr-0736.jpg", "type": "article", "unibrow": "NBCBLK", "authorThumbnail1": "https://media-cldnry.s-nbcnews.com/image/upload/newscms/2020_03/3183816/alex-smith-circle-byline-template.jpg", "authorName1": "Alexander Smith", "contributorName1": "Rima Abdelkader"}}, "article": {"opinion": "false", "content_tier": "free", "published": "Wed Apr 05 2017 22:15:00 GMT+0000 (UTC)", "modified": "Wed Apr 05 2017 23:42:46 GMT+0000 (UTC)"}, "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x768_scale,f_auto,q_auto:best/newscms/2017_14/1955116/170405-pepsi-cr-0736.jpg", "next-head-count": 102}, "movies": ["https://www.youtube.com/embed/2msbfN81Gm0"], "publish_date": 1491430500.0, "source": "https://www.nbcnews.com", "summary": ""}