{"url": "https://www.vice.com/en_us/article/9kg7pa/everything-you-should-know-before-seeing-infinity-war", "text": "This article originally appeared on VICE Canada. So you’re ready to put away that too-cool-for-school getup and trek down to the movies this weekend to see the latest in a long-ass line of Marvel cinematic goodness, huh? Based on the sheer volume of comic films that have come out in the last decade, there’s a good chance you haven’t been paying attention to this whole superhero thing for a bit.\n\nStill, I’ll bet you’ve got at least one friend who won’t shut up about how epic this one will be. And that friend is likely too lazy to explain any damn part of it. Well, I’ve spent way too much time reading up about this to leave you hanging. Remember, a lot of the backstory I’m about to tell you isn’t Avengers: Infinity War guaranteed, but let’s begin the class anyway.\n\nAdvertisement\n\nWhat’s this war all about?\n\nThe Avengers: Infinity War, as we know it, is basically a battle between a big purple Alien named Thanos with his intergalactically evil posse called The Black Order. They’re all looking to wreck some shit and find a particular set of items to do so. The Avengers, non-avengers, Black Panther, and Doctor Strange included are the only individuals equipped to put a stop to their antics. Basically, one side wants to destroy half the universe, and everyone else is trying to stop them.\n\nWho’s this purple dude?\n\nIf you’ve glanced at a poster, you know the biggest head belongs to the aforementioned purple alien. Thanos is a dude who talks a big game, but follows through in some major ways. Jim Starlin himself describes the villain as the following:\n\n“Thanos is an amoral philosopher. He’s not the Devil, although he sometimes has the devil standing next to him.”\n\nBorn of two eternals—which is basically Marvel's version of evolutionary humans who helped create us on the side—he's a titan with a shitty upbringing. These are high-browed eternals we’re talking about here, who were too damn high-browed to multitask as decent parents. His mother Sui-San, who was kind of nuts, tried to off Thanos because he came out with an ugly mug from the jump. And his father was just an absentee dad. So the dude has trust issues. All in all, he had some next-level trash parents who fostered his whole “universe destroyer” thing.\n\nAdvertisement\n\nListen, I got mother issues too, but I don’t want to destroy the world. So what’s his deal?\n\nIt’s not like you had death whispering in your ear since you were a child, egging you on like a psychotic cheerleader (I hope). And we’re not talking about the full-on skull-and-bones type either. Mistress Death actually isn’t bad looking in a marrow to bone sort of way; she’s a fully skinned dominatrix with a hood. Thanos already had issues with abandonment, so thanks to his own relationships with killing and destruction, Mistress Death took an interest in his potential, and convinced him that she’d be the only one that could truly love him for who he became.\n\nOf course, like all toxic relationships, her love had a price: destroy half the universe because she’s death, I guess. If getting put in the friend zone were a thing, Thanos would be the first villain to off entire galaxies to escape it.\n\nSo how does he manage this?\n\nThe purple bad guy needs some serious firepower if he’s going to complete his mission, so he sets out to get his hands on six ancient gems called Infinity Stones. These stones were created by a really powerful being who felt lonely one day and split itself apart into six different fragments on some suicidal shit. (Note: The Marvel Cinematic Universe is explained by the big bang and six singularities that went bang with it.) Like a lovesick puppy, Thanos embarks on a quest to get the stones and mount them in a gauntlet for greater control of their power—like a steering wheel on a car.\n\nAdvertisement\n\nSo what can these gems do, and who has them in the MCU?\n\nOK, let me break this down *cracks knuckles*:\n\nThe Mind Stone:\n\nThe Mind Stone makes specific appearances in both Avengers films. The first pops up in Loki’s (Tom Hiddleston) mind-control scepter from The Avengers, and in Avengers: Age of Ultron. It’s later seen within the forehead of the sentient robot, Vision, after the stone helped to create the lethally intelligent AI named Ultron.\n\nPowers: An OP ability to hold energies that allow for mind control, energy, and astral projection, along with telekinetic and telepathic powers.\n\nThe Space Stone:\n\nThis stone is first seen in The Avengers and Captain America films through the Tesseract (just think of a big blue glowing cube that holds a really powerful stone). Loki is the first to use it by opening a portal from one universe to Earth itself in The Avengers. It then takes up residence in Odin’s (Thor’s pops) vault for safe keeping.\n\nPowers: If you haven’t already guessed, the space stone has the power to create any sort of bridge between one end of space to another; it's the ultimate lazy man’s way to travel.\n\nThe Power Stone:\n\nIt made its first appearance in Guardians of the Galaxy, which was used by Ronan (Lee Pace), only to be taken from Star-Lord (Chris Pratt) and the Guardians. Right now, the Nova Corps (intergalactic police) are hanging onto it.\n\nPowers: If you ever wanted to see a Superman knock-off within the Marvel Universe, this is the gift that keeps on regifting. If you’re a jogger, you’re now a sprinter. If you’re a 20-pound lifter, you’re now a 20,000-pound lifter. It has the ability to boost the effects of power, from the other gems themselves to the duplication of any physical superhuman ability.\n\nAdvertisement\n\nThe Reality Stone:\n\nBetter known as the Aether from Thor: The Dark World, the stone deals in dark matter (which means it doesn’t interact with shit like light, it’s invisible, and hard to detect). At the moment, it’s in the possession of The Collector (Benicio Del Toro), whose whole shtick is to collect shit.\n\nPowers: It's the most powerful stone in this list. Reality is what is, and this stone manipulates that with a single thought. If Thanos wants Mistress Death to put a ring on it, he could make it happen (though he’d consider that cheating). No one can detect a change, nor see it coming, and if Thanos wanted to wipe out half a universe with a snap of his fingers (in the comic books, he did), he could.\n\nThe Time Stone:\n\nThis is nested in the Eye of Agamotto (a necklace by a powerful Sorcerer) from Doctor Strange, where it’s first employed by our doctor-turned-reality-bender for spoilerific reasons.\n\nPowers: The Time Stone is exactly what the name implies—it controls time in a wide or specific space. Reversed, sped up, slowed down, it’s all at the discretion of the wearer. Comic book-wise, Thanos even had an altercation where he aged an astral being by a billion years or so, and then turned him into a thumb-sucking infant just for kicks.\n\nThe Soul Stone: The only stone that hasn’t appeared in a MCU-based film and we still don’t know who’s rocking them.\n\nPowers: The Soul Stone, like all these plainly named gems, is an absorber of souls, but with a twist. It can also snatch the knowledge of all those it swallows. There’s no such thing as a secret with this bastard.\n\nAdvertisement\n\nJesus Christ, they don’t have some purple kryptonite for the guy? How do you stop that?\n\n'Infinity Gauntlet' (1991) via Wikipedia Commons\n\nThat’s kind of the point. The heroes themselves shouldn’t really stand a chance on their own. When the six-issue limited series Infinity Gauntlet landed in December, 1991, it became an immediate success by the suggestion that heroes would die. It had never really been done on that scale. Sure, half of the universe came back, but imagine being the fan waiting patiently for the next issue, knowing that Thor, Captain America, Spiderman, and Iron Man could be gone for good. MCU-wise, every hero that has appeared from the Black Panther (Chadwick Boseman), all the way to Ant-Man (Paul Rudd) are combining their chops to take this guy out thanks to the foreboding by Gamora (Zoe Saldana), the daughter of Thanos (yes he has kids). According to her, it won't be pretty.\n\nSo who deserves the credit for this whole thing?\n\nFrom left to right, Jim Starlin and Mike Friedrich via Wikipedia Commons\n\nIn the tradition of white men being behind most legacy comics, both Jim Starlin and Mike Friedrich came up with the purple baddie that inspired this whole Infinity War business from the start. According to Jim Starlin, he wanted to woo a woman with some higher education wordplay by attending a psychology class, but that got him interested in the Freudian concepts of Thanatos—humanity’s obsession with death and destruction. So even before putting pen to paper, Starlin already had some sick thoughts about a universe-destroying villain alternatively named Thanos. The villain eventually came to life in February 1973, well before his six-part comic book series called The Infinity Gauntlet; it's the series that Avengers: Infinity War is partially based around.\n\nAdvertisement\n\nDo I have to watch all the other Avengers movies first?\n\nI don’t have time to give you a full recap of all the films up to this moment—we’re now 18 films down the line. Just know that the most recent events involved a civil war between Captain America and Iron Man around the government registration of super-powered individuals. This, of course, split the MCU heroes down a line; those for superhuman registration, and those against. If you want to dig deeper, save me some time and Wiki/YouTube that shit in the following order:\n\nIron Man (2008)\n\nThe Incredible Hulk (2008)\n\nIron Man 2 (2010)\n\nThor (2011)\n\nCaptain America: The First Avenger (2011)\n\nThe Avengers (2012)\n\nIron Man 3 (2013)\n\nThor: The Dark World (2013)\n\nCaptain America: The Winter Soldier (2014)\n\nGuardians of the Galaxy (2014)\n\nAvengers: Age of Ultron (2015)\n\nAnt-Man (2015)\n\nCaptain America: Civil War (2016)\n\nDoctor Strange (2016)\n\nGuardians of the Galaxy Vol. 2 (2017)\n\nSpider-Man: Homecoming (2017)\n\nThor: Ragnarok (2017)\n\nBlack Panther (2018)\n\nSo that’s why people are freaking out about this?\n\nYup. This is a ten-year build up of heroism, where fans will finally see said heroes die in several horrible and possibly ugly ways and possibly never see them again. (MCU contracts are ending.) That’s some good watching.\n\nSign up for our newsletter to get the best of VICE delivered to your inbox daily.", "images": ["https://video-images.vice.com/contributors/58ce96b12e23161c471f762d/lede/1508181231570-AAEAAQAAAAAAAAIiAAAAJDQ0ZjViNjcxLTU1MDMtNDc3Ny05ZDA0LWJjZTUxNzdjYmRhYw.jpeg?crop=1xw:1xh;center,center&resize=100:*", "https://video-images.vice.com/articles/5ae10731b273b900065f248b/lede/1524698259427-infinitywar1.jpeg?image-resize-opts=Y3JvcD0xeHc6MXhoO2NlbnRlcixjZW50ZXImcmVzaXplPTEyMDA6KiZyZXNpemU9MTIwMDoq"], "top_img": "https://video-images.vice.com/articles/5ae10731b273b900065f248b/lede/1524698259427-infinitywar1.jpeg?image-resize-opts=Y3JvcD0xeHc6MXhoO2NlbnRlcixjZW50ZXImcmVzaXplPTEyMDA6KiZyZXNpemU9MTIwMDoq", "keywords": [], "authors": [], "canonical_link": "https://www.vice.com/en/article/9kg7pa/everything-you-should-know-before-seeing-infinity-war", "title": "Everything You Should Know Before Seeing ‘Avengers: Infinity War’", "meta_data": {"description": "Another crash course for the person that knows just about nothing.", "viewport": "initial-scale=1.0, width=device-width", "thumbnail": "https://video-images.vice.com/articles/5ae10731b273b900065f248b/lede/1524698259427-infinitywar1.jpeg?crop=1xw:1xh;center,center&resize=1200:*", "og": {"title": "Everything You Should Know Before Seeing ‘Avengers: Infinity War’", "description": "Another crash course for the person that knows just about nothing.", "locale": "en", "image": "https://video-images.vice.com/articles/5ae10731b273b900065f248b/lede/1524698259427-infinitywar1.jpeg?image-resize-opts=Y3JvcD0xeHc6MXhoO2NlbnRlcixjZW50ZXImcmVzaXplPTEyMDA6KiZyZXNpemU9MTIwMDoq", "type": "website", "url": "https://www.vice.com/en/article/9kg7pa/everything-you-should-know-before-seeing-infinity-war"}, "twitter": {"image": "https://video-images.vice.com/articles/5ae10731b273b900065f248b/lede/1524698259427-infinitywar1.jpeg?image-resize-opts=Y3JvcD0xeHc6MXhoO2NlbnRlcixjZW50ZXImcmVzaXplPTEyMDA6KiZyZXNpemU9MTIwMDoq", "card": "summary_large_image", "site": "@vice", "title": "Everything You Should Know Before Seeing ‘Avengers: Infinity War’", "description": "Another crash course for the person that knows just about nothing."}, "fb": {"app_id": 213518685373476}, "apple-itunes-app": "app-id=591496838", "theme-color": "#000000", "snapchat": {"publisher": 5700553057239040, "sticker": "https://vice-web-statics-cdn.vice.com/images/snap/snap-share-sticker.png"}, "recirc-variant": "C"}, "movies": [], "publish_date": 1524747600.0, "source": "https://www.vice.com", "summary": ""}