{"url": "https://www.hollywoodreporter.com/news/jason-priestley-says-he-punched-harvey-weinstein-face-1995-1068866", "text": "To start, we just want to iterate that we don’t condone violence of any kind.\n\nNow that we’ve got that out of the way, we also weren’t terribly upset to hear this story about how Jason Priestley once punched Harvey Weinstein in the face at a Miramax Golden Globes afterparty in 1995.\n\nThe actor tweeted that at the height of his Beverly Hills 90210 stardom, he got into a bit of a scrum with the now-disgraced movie mogul. The tiff escalated and ended with Priestley being hauled out of the party by security after he hurled a jab Weinstein’s way.\n\nThe drama was dragged into the spotlight on Monday after Mira Sorvino tweeted her reaction to the confirmation that Weinstein had blacklisted her for rebuffing his advances, telling director Peter Jackson not to hire her or fellow actress Ashley Judd. “There it is, confirmation that Harvey Weinstein derailed my career, something I suspected but was unsure,” she wrote.\n\nIn response to her tweet, actress Tara Strong speculated that perhaps Priestley had been blacklisted by the producer as well after he punched him in the face. Priestley replied that it probably was not true, as he did not work with Weinstein, but, for our reading pleasure, he recounted the details of their encounter 22 years ago.\n\n“Harvey told me I had to leave… I was leaving when he grabbed me by the arm and said ‘what are you doing?'” tweeted Priestley. “I said ‘you told me leave, I’m leaving.'”\n\nPriestley continued that there was a bit more back-and-forth drama about whether or not Weinstein had told the actor to leave, and then things got heated and Weinstein got punched.\n\nSome drama is truly timeless.\n\nRead the full exchange below.\n\nJust seeing this after I awoke, I burst out crying. There it is, confirmation that Harvey Weinstein derailed my career, something I suspected but was unsure. Thank you Peter Jackson for being honest. I’m just heartsick https://t.co/ljK9NqICbm — Mira Sorvino (@MiraSorvino) December 15, 2017\n\nIDK about that @tarastrong… I know I never worked for Miramax… and boy was my team HORRIFIED when they heard about what I had done! Harvey was powerful, my team STRONGLY ADVISED me to write him an apology the next day… — Jason Priestley (@Jason_Priestley) December 17, 2017\n\nOf course there is more to the story… ‘95 Golden Globes… at the Miramax Party… Harvey told me I had to leave… I was leaving when he grabbed me by the arm and said “ what are you doing?” I said “ you told me leave, I’m leaving” — Jason Priestley (@Jason_Priestley) December 15, 2017\n\n“I didn’t say you had to leave” he replied. “You just told me to leave… right over there” I tell him once again. Getting heated now. He then grabs me tighter and says “why don’t we go outside and talk about this”. That was all I needed to hear, — Jason Priestley (@Jason_Priestley) December 15, 2017", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/jason_priestley_and_harvey_weinstein_-_split_-_getty_-_h_2017.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/jason_priestley_and_harvey_weinstein_-_split_-_getty_-_h_2017.jpg?w=1296&h=730&crop=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/jason_priestley_and_harvey_weinstein_-_split_-_getty_-_h_2017.jpg?w=1024", "keywords": [], "authors": ["Sam Reed"], "canonical_link": "https://www.hollywoodreporter.com/lifestyle/style/jason-priestley-says-he-punched-harvey-weinstein-face-1995-1068866/", "title": "Jason Priestley Says He Punched Harvey Weinstein in the Face in 1995", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Here's some drama that's aged well.", "news_keywords": "nsfs, Style News, THRX", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Sam Reed", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1068866, "title": "Jason Priestley Says He Punched Harvey Weinstein in the Face in 1995", "published_at": "2017-12-18 11:54:11", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/jason_priestley_and_harvey_weinstein_-_split_-_getty_-_h_2017.jpg?w=1024", "comment_count": 0, "tags": "THRX", "topics": "Style", "body": "To start, we just want to iterate that we don't condone violence of any kind. \r\nNow that we've got that out of the way, we also weren't terribly upset to hear this story about how Jason Priestley once punched Harvey Weinstein in the face at a Miramax Golden Globes afterparty in 1995. \r\nThe actor tweeted that at the height of his Beverly Hills 90210 stardom, he got into a bit of a scrum with the now-disgraced movie mogul. The tiff escalated and ended with Priestley being hauled out of the party by security after he hurled a jab Weinstein's way. \r\n\r\nThe drama was dragged into the spotlight on Monday after Mira Sorvino tweeted her reaction to the confirmation that Weinstein had blacklisted her for rebuffing his advances, telling director Peter Jackson not to hire her or fellow actress Ashley Judd. \"There it is, confirmation that Harvey Weinstein derailed my career, something I suspected but was unsure,\" she wrote.\r\nIn response to her tweet, actress Tara Strong speculated that perhaps Priestley had been blacklisted by the producer as well after he punched him in the face. Priestley replied that it probably was not true, as he did not work with Weinstein, but, for our reading pleasure, he recounted the details of their encounter 22 years ago. \r\n\"Harvey told me I had to leave... I was leaving when he grabbed me by the arm and said 'what are you doing?'\" tweeted Priestley. \"I said 'you told me leave, I’m leaving.'\"\r\nPriestley continued that there was a bit more back-and-forth drama about whether or not Weinstein had told the actor to leave, and then things got heated and Weinstein got punched. \r\nSome drama is truly timeless. \r\nRead the full exchange below.\r\n\r\n\tJust seeing this after I awoke, I burst out crying. There it is, confirmation that Harvey Weinstein derailed my career, something I suspected but was unsure. Thank you Peter Jackson for being honest. I’m just heartsick https://t.co/ljK9NqICbm\r\n\t— Mira Sorvino (@MiraSorvino) December 15, 2017\r\n\r\n\tIDK about that @tarastrong... I know I never worked for Miramax... and boy was my team HORRIFIED when they heard about what I had done! Harvey was powerful, my team STRONGLY ADVISED me to write him an apology the next day...\r\n\t— Jason Priestley (@Jason_Priestley) December 17, 2017\r\n\r\n\tOf course there is more to the story... ‘95 Golden Globes... at the Miramax Party... Harvey told me I had to leave... I was leaving when he grabbed me by the arm and said “ what are you doing?” I said “ you told me leave, I’m leaving”\r\n\t— Jason Priestley (@Jason_Priestley) December 15, 2017\r\n\r\n\t“I didn’t say you had to leave” he replied. “You just told me to leave... right over there” I tell him once again. Getting heated now. He then grabs me tighter and says “why don’t we go outside and talk about this”. That was all I needed to hear,\r\n\t— Jason Priestley (@Jason_Priestley) December 15, 2017\r\n\r\n\t“I’m not going anywhere with you” I said as I pushed him back and punched him with a right hand to his face. Suddenly, there were security guards pulling us apart and I was escorted out of the party...\r\n\t— Jason Priestley (@Jason_Priestley) December 15, 2017", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Jason Priestley Says He Punched Harvey Weinstein in the Face in 1995", "url": "https://www.hollywoodreporter.com/lifestyle/style/jason-priestley-says-he-punched-harvey-weinstein-face-1995-1068866/", "description": "Here’s some drama that’s aged well.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/jason_priestley_and_harvey_weinstein_-_split_-_getty_-_h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-12-18T11:54:11+00:00", "modified_time": "2018-05-25T18:02:13+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Jason Priestley Says He Punched Harvey Weinstein in the Face in 1995", "description": "Here’s some drama that’s aged well.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/jason_priestley_and_harvey_weinstein_-_split_-_getty_-_h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1513598051.0, "source": "https://www.hollywoodreporter.com", "summary": ""}