{"url": "https://deadline.com/2018/01/joel-kramer-sexual-assault-accusations-stunt-women-eliza-dushku-1202243343/", "text": "Two veteran stunt women have come forward with allegations of sexual misconduct by famed stunt coordinator Joel Kramer. One involves a 10th grade girl who came to the North Carolina set of Virus in the spring of 1997 to see how movies are made, while a second woman claims that more than 30 years ago Kramer forced her to perform oral sex on him.\n\nThe latest claims come after Eliza Dushku accused Kramer this weekend of sexually molesting her during the making of the 1994 movie True Lies when she was 12 years old.\n\nKramer, who for many years was Arnold Schwarzenegger’s personal stunt double, has denied Dushku’s allegations. But he acknowledged that few years later, he had a sexual encounter with the 16-year-old friend of the 15-year-old sister of a stunt woman who worked for him on Virus. The police were called, but said they couldn’t do anything because the age of consent in the state is 16.\n\nLaura Albert, who worked as a stunt woman for Kramer on both films, told Deadline that her sister and her sister’s friend visited the Virus set in Wilmington, NC, in February or March of 1997. Albert would not identify the girl – now in her 30s – “because she does not want me to.”\n\n“I invited my younger sister to the set as she resided there,” Albert said in a written statement. “I wanted her to come to the set in an effort to mentor her, to show her the motion picture industry from the inside, as she had desired to become a makeup artist. One day after we finished work, I had my sister and her friend, who were 15 and 16 and in the 1oth grade, come out to hang with all the stunt personnel as we were going to go go-karting. I wanted her to have the experience of having some ‘good clean fun’ in the setting of a professional industry.\n\n“That night, after going karting, the stunt department had to leave as we all had early calls the next day. Unbeknownst to me, my boss, Joel Kramer, had lured the girls to go swimming at the pool in his hotel. It wasn’t until a month later that I learned of the events that happened that night.”\n\nAlbert said Kramer brought the girls back to the hotel to swim, and that while the three of them were in the pool, “he pulled his dick out and said, ‘You cannot handle this,’ and then began to swim towards them. That’s when my sister left. Even today, she feels guilty for having left her friend.”\n\nShe continued, “My sister ended up leaving and she left her friend there with Joel. Joel had sex with the 16-year-old girl. She was 16. He was 39. His room number was 424.” (Albert said that whenever the girls – now women with children of their own – refer to the incident, they use “424” as code.)\n\nKramer disputed several elements of Albert’s account.\n\n“I did not invite the two girls up to my room,” he said. “One girl on her own came to my room as she was legal age.” In a written statement, he said that “The stunt crew all stay at that hotel. I was swimming laps one early evening and the sister of one of my stunt doubles and her friend showed up at the pool. I did not invite them. They swam around and I finished my laps and went up to my room alone. Period. You don’t know me, but I am not a liar. Thirty minutes later there was a knock at my door and her friend was there and asked to come in. She came in and we fooled around but no intercourse. She left about 1/2 hour later. I honestly did not know she was 17. Tattoos, and yes, pretty. When I found out I was devastated. I also checked with the local laws and found out 16 was the consensual age. It bothered me for years. Yes all was consensual.”\n\n“Yes, I absolutely almost made a huge mistake with the girl from the Wilmington shoot, as I said, I won’t lie about it,” he added.\n\nAlbert, however, says Kramer is being dishonest about several key aspects of the incident, including the girl’s age. “He’s a liar,” she told Deadline. “I’ll go toe-to-toe with him to his face. He lured the girls after we went to our rooms that night after go-karting. He’s so full of sh*t.”\n\nAlbert said in her written statement she was “furious” when she found out, a month later, about what happened. “I questioned the girl and asked her what happened. She had tears streaming down her eyes. She told me that he had sex with her. I was so angry. After I found out, I called the Wilmington Police Department to see what the law was about statutory rape. I was told that the legal age of consent in the state of N.C. was 16. “\n\n“The next day I went to work and confronted Joel Kramer. It was just he and I in his stunt trailer and I point blank said to him: ‘I’m going to ask you one question, and if you lie to me, I am going to let the parents come in and go to the producers and let all of hell rain down on you. Did you have sex with her?’ And he said ‘Yes.’ He went on to try to vindicate himself, but it was too late. I said to him, ‘I’m not going to go back to LA and talk about this, but if I am asked, I am not going to lie for you.’ And that is how I still feel today.”\n\nHer account is supported by a stuntman on the film who was then just breaking into the business. “I was told by Laura and her sister that Joel had sex with a 16-year-old girl, and to me that was morally wrong,” he told Deadline, asking that his name not be used. “It wasn’t right. So I said to Laura, ‘We gotta do something.’ So we called the police and they informed Laura that 16 was the legal age of consent.”\n\n“It might be legal,” he told Deadline, “but as a moral issue, it’s gross. I was just grossed out by the situation. I told who I could tell, but nothing happened. I spoke to a couple of the older stuntmen, and they said they didn’t think it was right either. So the question is: Did the studio production system fail this girl, or was it the legal system? Or both?”\n\nHe said he never spoke to Kramer about it. “I was a brand new stunt guy and he was my boss. He was the biggest stunt coordinator in the business. Joel was powerful and could affect people’s careers, and did.”\n\nHe said he is speaking out in support of all the women in the industry who have come forward with tales of being sexually harassed and abused. “Back then, nobody was questioning it. But now that all these women have stepped up and taken a stand, it’s empowering. I don’t know if it’s going to matter in the courts, but in the court of public opinion, that’s what’s going to matter here.”\n\nSaid Albert: “It is with great compassion for the victims of Joel Kramer that I am compelled to tell the truth about what happened on the set of Virus in 1997. I stood up against this 20 years ago, when nothing was done about it, and I still stand up against it today.”\n\n“The saddest part of this whole thing,” she said, “is that when I read the story of Eliza Dushku, this is exactly the same scenario as what happened in North Carolina.”\n\nDushku claims Kramer sexually assaulted her in Miami when she was 12 after taking a swim in his hotel pool during a break in production of True Lies. Kramer has flatly denied the allegation. “These are outlandish, manipulated lies,” he told Deadline. “I never sexually molested her. I’m sick to my stomach. It’s not true. I think she’s making this up in her imagination. This is all lies. Lies, lies, lies. This is just crazy. I treated her like a daughter. We all looked out for her.”\n\nDushku’s account is supported by her mother, her brother, her former agent, a longtime friend and her legal guardian at the time Sue Booth-Forbes, who told Deadline she “reported Joel Kramer’s inappropriate sexual behavior towards 12-year-old Eliza to a person in authority.”\n\nJamie Lee Curtis, who co-starred in the film, says Dushku “shared that story with me privately a few years ago. I was shocked and saddened then and still am today.” The film’s director, James Cameron, said he only learned of the incident after Dushku posted it on Facebook. Schwarzenegger has not commented.\n\nAnother stunt woman, meanwhile, has also come forward with a claim that Kramer sexually assaulted her in the late 1970s or early ’80s. The woman, who asked to remain anonymous, wasn’t sure of the exact date, but said it was a few years after she’d entered the business. She alleges the assault happened one night in the San Fernando Valley after she and a group of stunt people had gotten together for a drink.\n\n“It was then decided to go to a different place,” she told Deadline. “It was also suggested that we car-pool due to parking. I ended up in Joel Kramer’s vehicle. Other than I knew him by face, we had never worked together, he had never hired me, and we were not dating – nor was I looking to date him. It was just a group of stunt people getting together.\n\n“When I got into Joel’s vehicle, instead of driving me to the other place, he drove us up into the hills on the south side of Ventura Boulevard into a quiet residential area. He pulled his vehicle over, unzipped his pants, pulled out his penis. He grabbed me by the back of my head and forced my face down onto his penis and came in my mouth. He then released my head and cleaned himself up. I must have as well. I really don’t remember if he gave me tissues. I cannot remember if words were exchanged of any type, but he did drive me to the other place, where the group had gone.”\n\nShe never told anyone of the incident, but decided to speak up after reading about Dushku going public with what he’d allegedly done to her. “I did not tell anyone, because I was frightened, scared and ashamed. I also knew that if I were to report this to the stunt group, the police or SAG, I would have no chance in a career as a stunt woman.”\n\nKramer called the allegation a “fabrication,” saying he never forced himself on anyone. “It saddens me that now people will use me as their target of opportunity. Please do not take these at face value. I am sorry for this witch hunt.”\n\nHe added: “I have been upfront and truthful on all facets. I am not this damned A-hole the media and others portrays me as. I am so depressed and shocked over all of this. There’s nothing I can say or do that many just want to chastise myself and kick me to the curb. We all make mistakes, but do I have to pay dearly for those that are not of my doing?”", "images": ["https://deadline.com/wp-content/uploads/2018/01/virus-jamie-lee-curtis.jpg?w=681&h=383&crop=1", "https://deadline.com/wp-content/uploads/2018/01/virus-jamie-lee-curtis.jpg?w=1024", "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1"], "top_img": "https://deadline.com/wp-content/uploads/2018/01/virus-jamie-lee-curtis.jpg?w=1024", "keywords": [], "authors": ["David Robb"], "canonical_link": "https://deadline.com/2018/01/joel-kramer-sexual-assault-accusations-stunt-women-eliza-dushku-1202243343/", "title": "Two More Sexual Misconduct Allegations Against Stunt Coordinator Joel Kramer Include One Involving 10th Grade Girl", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Two veteran stunt women have come forward with allegations of sexual misconduct by famed stunt coordinator Joel Kramer.", "news_keywords": "Eliza Dushku, Harassment, Joel Kramer", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=533209613", "generator": "WordPress 6.0.2", "author": "David Robb", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Deadline", "application-name": "Deadline", "content_type": "Article", "post_id": 1202243343, "title": "Two More Sexual Misconduct Allegations Against Stunt Coordinator Joel Kramer Include One Involving 10th Grade Girl", "published_at": "2018-01-15 13:26:50", "image": "https://deadline.com/wp-content/uploads/2018/01/virus-jamie-lee-curtis.jpg?w=296&h=166&crop=1", "comment_count": 78, "tags": "Joel Kramer", "topics": "TV", "body": "Two veteran stunt women have come forward with allegations of sexual misconduct by famed stunt coordinator Joel Kramer. One involves a 10th grade girl who came to the North Carolina set of Virus in the spring of 1997 to see how movies are made, while a second woman claims that more than 30 years ago Kramer forced her to perform oral sex on him.\r\n\r\nThe latest claims come after Eliza Dushku accused Kramer this weekend of sexually molesting her during the making of the 1994 movie True Lies when she was 12 years old.\r\n\r\nKramer, who for many years was Arnold Schwarzenegger’s personal stunt double, has denied Dushku's allegations. But he acknowledged that few years later, he had a sexual encounter with the 16-year-old friend of the 15-year-old sister of a stunt woman who worked for him on Virus. The police were called, but said they couldn't do anything because the age of consent in the state is 16.\r\n\r\nLaura Albert, who worked as a stunt woman for Kramer on both films, told Deadline that her sister and her sister’s friend visited the Virus set in Wilmington, NC, in February or March of 1997. Albert would not identify the girl – now in her 30s – “because she does not want me to.”\r\n\r\n“I invited my younger sister to the set as she resided there,” Albert said in a written statement. “I wanted her to come to the set in an effort to mentor her, to show her the motion picture industry from the inside, as she had desired to become a makeup artist. One day after we finished work, I had my sister and her friend, who were 15 and 16 and in the 1oth grade, come out to hang with all the stunt personnel as we were going to go go-karting. I wanted her to have the experience of having some ‘good clean fun’ in the setting of a professional industry.\r\n\r\n“That night, after going karting, the stunt department had to leave as we all had early calls the next day. Unbeknownst to me, my boss, Joel Kramer, had lured the girls to go swimming at the pool in his hotel. It wasn’t until a month later that I learned of the events that happened that night.\"\r\n\r\nAlbert said Kramer brought the girls back to the hotel to swim, and that while the three of them were in the pool, “he pulled his dick out and said, ‘You cannot handle this,' and then began to swim towards them. That’s when my sister left. Even today, she feels guilty for having left her friend.\"\r\n\r\nShe continued, \"My sister ended up leaving and she left her friend there with Joel. Joel had sex with the 16-year-old girl. She was 16. He was 39. His room number was 424.” (Albert said that whenever the girls – now women with children of their own – refer to the incident, they use \"424\" as code.)\r\n\r\nKramer disputed several elements of Albert's account.\r\n\r\n“I did not invite the two girls up to my room,” he said. “One girl on her own came to my room as she was legal age.” In a written statement, he said that “The stunt crew all stay at that hotel. I was swimming laps one early evening and the sister of one of my stunt doubles and her friend showed up at the pool. I did not invite them. They swam around and I finished my laps and went up to my room alone. Period. You don’t know me, but I am not a liar. Thirty minutes later there was a knock at my door and her friend was there and asked to come in. She came in and we fooled around but no intercourse. She left about 1/2 hour later. I honestly did not know she was 17. Tattoos, and yes, pretty. When I found out I was devastated. I also checked with the local laws and found out 16 was the consensual age. It bothered me for years. Yes all was consensual.”\r\n\r\n“Yes, I absolutely almost made a huge mistake with the girl from the Wilmington shoot, as I said, I won’t lie about it,” he added.\r\n\r\nAlbert, however, says Kramer is being dishonest about several key aspects of the incident, including the girl's age. “He’s a liar,” she told Deadline. “I’ll go toe-to-toe with him to his face. He lured the girls after we went to our rooms that night after go-karting. He’s so full of sh*t.”\r\n\r\nAlbert said in her written statement she was “furious” when she found out, a month later, about what happened. “I questioned the girl and asked her what happened. She had tears streaming down her eyes. She told me that he had sex with her. I was so angry. After I found out, I called the Wilmington Police Department to see what the law was about statutory rape. I was told that the legal age of consent in the state of N.C. was 16. “\r\n\r\n“The next day I went to work and confronted Joel Kramer. It was just he and I in his stunt trailer and I point blank said to him: ‘I’m going to ask you one question, and if you lie to me, I am going to let the parents come in and go to the producers and let all of hell rain down on you. Did you have sex with her?’ And he said ‘Yes.’ He went on to try to vindicate himself, but it was too late. I said to him, ‘I’m not going to go back to LA and talk about this, but if I am asked, I am not going to lie for you.’ And that is how I still feel today.”\r\n\r\nHer account is supported by a stuntman on the film who was then just breaking into the business. “I was told by Laura and her sister that Joel had sex with a 16-year-old girl, and to me that was morally wrong,” he told Deadline, asking that his name not be used. “It wasn’t right. So I said to Laura, ‘We gotta do something.’ So we called the police and they informed Laura that 16 was the legal age of consent.”\r\n\r\n“It might be legal,” he told Deadline, “but as a moral issue, it’s gross. I was just grossed out by the situation. I told who I could tell, but nothing happened. I spoke to a couple of the older stuntmen, and they said they didn’t think it was right either. So the question is: Did the studio production system fail this girl, or was it the legal system? Or both?”\r\n\r\nHe said he never spoke to Kramer about it. “I was a brand new stunt guy and he was my boss. He was the biggest stunt coordinator in the business. Joel was powerful and could affect people's careers, and did.”\r\n\r\nHe said he is speaking out in support of all the women in the industry who have come forward with tales of being sexually harassed and abused. “Back then, nobody was questioning it. But now that all these women have stepped up and taken a stand, it’s empowering. I don’t know if it’s going to matter in the courts, but in the court of public opinion, that’s what’s going to matter here.”\r\n\r\nSaid Albert: “It is with great compassion for the victims of Joel Kramer that I am compelled to tell the truth about what happened on the set of Virus in 1997. I stood up against this 20 years ago, when nothing was done about it, and I still stand up against it today.\"\r\n\r\n“The saddest part of this whole thing,” she said, “is that when I read the story of Eliza Dushku, this is exactly the same scenario as what happened in North Carolina.”\r\n\r\nDushku claims Kramer sexually assaulted her in Miami when she was 12 after taking a swim in his hotel pool during a break in production of True Lies. Kramer has flatly denied the allegation. “These are outlandish, manipulated lies,” he told Deadline. “I never sexually molested her. I’m sick to my stomach. It’s not true. I think she’s making this up in her imagination. This is all lies. Lies, lies, lies. This is just crazy. I treated her like a daughter. We all looked out for her.”\r\n\r\nDushku’s account is supported by her mother, her brother, her former agent, a longtime friend and her legal guardian at the time Sue Booth-Forbes, who told Deadline she “reported Joel Kramer’s inappropriate sexual behavior towards 12-year-old Eliza to a person in authority.”\r\n\r\nJamie Lee Curtis, who co-starred in the film, says Dushku “shared that story with me privately a few years ago. I was shocked and saddened then and still am today.” The film’s director, James Cameron, said he only learned of the incident after Dushku posted it on Facebook. Schwarzenegger has not commented.\r\n\r\nAnother stunt woman, meanwhile, has also come forward with a claim that Kramer sexually assaulted her in the late 1970s or early '80s. The woman, who asked to remain anonymous, wasn't sure of the exact date, but said it was a few years after she’d entered the business. She alleges the assault happened one night in the San Fernando Valley after she and a group of stunt people had gotten together for a drink.\r\n\r\n“It was then decided to go to a different place,” she told Deadline. “It was also suggested that we car-pool due to parking. I ended up in Joel Kramer's vehicle. Other than I knew him by face, we had never worked together, he had never hired me, and we were not dating – nor was I looking to date him. It was just a group of stunt people getting together.\r\n\r\n“When I got into Joel's vehicle, instead of driving me to the other place, he drove us up into the hills on the south side of Ventura Boulevard into a quiet residential area. He pulled his vehicle over, unzipped his pants, pulled out his penis. He grabbed me by the back of my head and forced my face down onto his penis and came in my mouth. He then released my head and cleaned himself up. I must have as well. I really don't remember if he gave me tissues. I cannot remember if words were exchanged of any type, but he did drive me to the other place, where the group had gone.”\r\n\r\nShe never told anyone of the incident, but decided to speak up after reading about Dushku going public with what he’d allegedly done to her. “I did not tell anyone, because I was frightened, scared and ashamed. I also knew that if I were to report this to the stunt group, the police or SAG, I would have no chance in a career as a stunt woman.”\r\n\r\nKramer called the allegation a “fabrication,” saying he never forced himself on anyone. \"It saddens me that now people will use me as their target of opportunity. Please do not take these at face value. I am sorry for this witch hunt.\"\r\n\r\nHe added: “I have been upfront and truthful on all facets. I am not this damned A-hole the media and others portrays me as. I am so depressed and shocked over all of this. There’s nothing I can say or do that many just want to chastise myself and kick me to the curb. We all make mistakes, but do I have to pay dearly for those that are not of my doing?”", "fb": {"pages": 105558754896}, "ia": {"markup_url_dev": "https://deadline.com/2018/01/joel-kramer-sexual-assault-accusations-stunt-women-eliza-dushku-1202243343/?ia_markup=1"}, "onesignal": "wordpress-plugin", "fragment": "!", "og": {"type": "article", "title": "Two More Sexual Misconduct Allegations Against Stunt Coordinator Joel Kramer Include One Involving 10th Grade Girl", "url": "https://deadline.com/2018/01/joel-kramer-sexual-assault-accusations-stunt-women-eliza-dushku-1202243343/", "description": "Two veteran stunt women have come forward with allegations of sexual misconduct by famed stunt coordinator Joel Kramer. One involves a 10th grade girl who came to the North Carolina set of Virus in…", "site_name": "Deadline", "image": {"identifier": "https://deadline.com/wp-content/uploads/2018/01/virus-jamie-lee-curtis.jpg?w=1024", "width": 1024, "height": 658, "alt": "Virus Jamie Lee Curtis"}, "locale": "en_US"}, "article": {"published_time": "2018-01-15T21:26:50+00:00", "modified_time": "2018-01-15T21:30:04+00:00"}, "twitter": {"site": "@DEADLINE", "card": "summary_large_image", "title": "Two More Sexual Misconduct Allegations Against Stunt Coordinator Joel Kramer Include One Involving 10th Grade Girl", "description": "Two veteran stunt women have come forward with allegations of sexual misconduct by famed stunt coordinator Joel Kramer.", "image": "https://deadline.com/wp-content/uploads/2018/01/virus-jamie-lee-curtis.jpg?w=1024"}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1516051610.0, "source": "https://deadline.com", "summary": ""}