{"url": "https://www.hollywoodreporter.com/live-feed/sophia-bush-leaving-chicago-pd-1007813", "text": "Chicago P.D. is saying goodbye to one of its stars.\n\nSophia Bush is departing the NBC cop drama after four seasons.\n\nThe departure comes after a surprising season finale in which Bush’s character, Det. Erin Lindsay, was faced with moving to New York for an undercover assignment with the FBI’s counter-terrorism unit in order to protect her troubled mother, Bunny (Markie Post), who had become embroiled in a murder investigation.\n\nThe potential job change also came just as Lindsay’s on-and-off boyfriend, Det. Jay Halstead (Jesse Lee Soffer), was thinking about proposing.\n\nOffscreen, this is the latest change for Chicago P.D., which also recently saw the departure of series regular Jon Seda, who moved to Chicago Justice, as well as the exit of co-creator and showrunner Matt Olmstead, who left for a lucrative overall deal with ABC Studios.\n\nIn addition to Olmstead, executive producers Michael Brandt and Mark Tinker also left at the end of season four. Rick Eid, who most recently served as showrunner of Law and Order: SVU, will take over as showrunner for Chicago P.D‘s upcoming fifth season, where it will hit its 100th episode.\n\n(It also remains to be seen if Seda will return to Chicago P.D. following Chicago Justice‘s cancellation earlier this week.)\n\nBush was one of several actors brought onto Chicago P.D. after the backdoor pilot was shown as a season one episode of Chicago Fire. Bush, as well as Soffer and Patrick John Flueger, were brought onto the Dick Wolf procedural after starring together in NBC’s Hatfields & McCoys pilot, which was not picked up to series.\n\nLike Chicago Fire, which has written out at least five series regulars in as many seasons, Chicago P.D. has also not shied away from mixing up the core ensemble. Archie Kao’s character was killed off the show at the end of season one, and Brian Geraghty departed at the end of season three.\n\nThis past season saw Chicago P.D. welcome several new recurring faces for multi-episode arcs, including Quantico alum Li Jun Li, Revenge grad Nick Wechsler, NYPD Blue alum Esai Morales and, most recently, former Revolution star Tracy Spiridakos, who was introduced in the final episodes of the season as a new member of the Intelligence Unit, temporarily taking over for Marina Squerciati’s Burgess. (In real life, Squerciati was on maternity leave and is expected to return for season five.)\n\n“We didn’t start off at the beginning of this season with a big whiteboard like, who can we move out? Who can we move in? But we certainly wanted to be this season, as you do every season, ready for anything,” Olmstead told The Hollywood Reporter in January. “[We thought], ‘Let’s be light on our feet. If there is any change, whether long-term or short-term, let’s embrace it and use it as an opportunity for storytelling and conflict.'”\n\nIn addition to Chicago P.D., Bush appeared multiple times on the other Chicago shows as well as Law and Order: SVU. Her starring role on Chicago P.D. followed a nine-season run on One Tree Hill, and her other credits include Nip/Tuck and John Tucker Must Die. Bush next appears in the Bruce Willis film Acts of Violence.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/05/nup_177891_1654_-_h_2017.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/nup_177891_1654_-_h_2017.jpg?w=1296&h=730&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/nup_177891_1654_-_h_2017.jpg?w=1024", "keywords": [], "authors": ["Kate Stanhope"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/sophia-bush-leaving-chicago-pd-1007813/", "title": "Sophia Bush Leaving ‘Chicago P.D.’ After Four Seasons", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The actress is the latest to exit the cop drama, following co-creator Matt Olmstead and star Jon Seda.", "news_keywords": "Chicago PD, Sophia Bush", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Kate Stanhope", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1007813, "title": "Sophia Bush Leaving 'Chicago P.D.' After Four Seasons", "published_at": "2017-05-25 13:10:28", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/nup_177891_1654_-_h_2017.jpg?w=1024", "comment_count": 0, "tags": "Sophia Bush", "topics": "TV News", "body": "Chicago P.D. is saying goodbye to one of its stars.\r\nSophia Bush is departing the NBC cop drama after four seasons.\r\nThe departure comes after a surprising season finale in which Bush's character, Det. Erin Lindsay, was faced with moving to New York for an undercover assignment with the FBI's counter-terrorism unit in order to protect her troubled mother, Bunny (Markie Post), who had become embroiled in a murder investigation.\r\nThe potential job change also came just as Lindsay's on-and-off boyfriend, Det. Jay Halstead (Jesse Lee Soffer), was thinking about proposing.\r\n\r\nOffscreen, this is the latest change for Chicago P.D., which also recently saw the departure of series regular Jon Seda, who moved to Chicago Justice, as well as the exit of co-creator and showrunner Matt Olmstead, who left for a lucrative overall deal with ABC Studios. \r\nIn addition to Olmstead, executive producers Michael Brandt and Mark Tinker also left at the end of season four. Rick Eid, who most recently served as showrunner of Law and Order: SVU, will take over as showrunner for Chicago P.D's upcoming fifth season, where it will hit its 100th episode.\r\n(It also remains to be seen if Seda will return to Chicago P.D. following Chicago Justice's cancellation earlier this week.)\r\nBush was one of several actors brought onto Chicago P.D. after the backdoor pilot was shown as a season one episode of Chicago Fire. Bush, as well as Soffer and Patrick John Flueger, were brought onto the Dick Wolf procedural after starring together in NBC's Hatfields & McCoys pilot, which was not picked up to series.\r\n\r\nLike Chicago Fire, which has written out at least five series regulars in as many seasons, Chicago P.D. has also not shied away from mixing up the core ensemble. Archie Kao's character was killed off the show at the end of season one, and Brian Geraghty departed at the end of season three.\r\nThis past season saw Chicago P.D. welcome several new recurring faces for multi-episode arcs, including Quantico alum Li Jun Li, Revenge grad Nick Wechsler, NYPD Blue alum Esai Morales and, most recently, former Revolution star Tracy Spiridakos, who was introduced in the final episodes of the season as a new member of the Intelligence Unit, temporarily taking over for Marina Squerciati's Burgess. (In real life, Squerciati was on maternity leave and is expected to return for season five.)\r\n\"We didn't start off at the beginning of this season with a big whiteboard like, who can we move out? Who can we move in? But we certainly wanted to be this season, as you do every season, ready for anything,\" Olmstead told The Hollywood Reporter in January. \"[We thought], 'Let's be light on our feet. If there is any change, whether long-term or short-term, let's embrace it and use it as an opportunity for storytelling and conflict.'\"\r\nIn addition to Chicago P.D., Bush appeared multiple times on the other Chicago shows as well as Law and Order: SVU. Her starring role on Chicago P.D. followed a nine-season run on One Tree Hill, and her other credits include Nip/Tuck and John Tucker Must Die. Bush next appears in the Bruce Willis film Acts of Violence.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Sophia Bush Leaving ‘Chicago P.D.’ After Four Seasons", "url": "https://www.hollywoodreporter.com/tv/tv-news/sophia-bush-leaving-chicago-pd-1007813/", "description": "The actress is the latest to exit the cop drama, following co-creator Matt Olmstead and star Jon Seda.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/nup_177891_1654_-_h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-05-25T13:10:28+00:00", "modified_time": "2017-05-25T14:37:07+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Sophia Bush Leaving ‘Chicago P.D.’ After Four Seasons", "description": "The actress is the latest to exit the cop drama, following co-creator Matt Olmstead and star Jon Seda.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/nup_177891_1654_-_h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1495717828.0, "source": "https://www.hollywoodreporter.com", "summary": ""}