{"url": "https://www.hollywoodreporter.com/live-feed/bachelorettes-dean-unglert-says-hes-not-ready-be-next-bachelor-1025680", "text": "Monday’s The Bachelorette: Men Tell All special was a big night for fan-favorite Dean Unglert.\n\nThe 26-year-old startup recruiter from Venice addressed the ABC reality franchise’s portrayal of his controversial hometown date and came face-to-face with Bachelorette Rachel Lindsay for the first time since she broke up with him on TV.\n\n“That was the realest and most raw moment that I’ve had throughout the entire experience,” he told host Chris Harrison during the annual cast reunion show.\n\nTwo weeks ago, Bachelorette viewers met his father, Harold Unglert, who now goes by the chosen name of Paramroop S. Khahsa. Previously on the show, Unglert disclosed that his mother died during his teen years and his father “abandoned” him and later converted to Sikhism. He hadn’t seen his father in two years before their TV reunion, during which Khahsa barked during their emotional conversation, “You didn’t feel love from your father? Is that what you are saying? You’ve still got one fucking foot stuck in the past!”\n\nIn front of a live TV audience and 17 of his fellow castmembers, Unglert continued to reflect on the eye-opening experience. “Had I not gone there with Rachel,” he said, “I don’t think that I ever would have addressed the feelings that I had suppressed for so long.”\n\nSpeaking to The Hollywood Reporter following the taping, Unglert said he hopes the real takeaway from his hometown experience is religious tolerance. Some viewers criticized ABC for sensationalizing Sikhism via dramatic previews leading up to the episode’s airdate. In response, Unglert took to social media days before the episode to urge viewers not to criticize his father “for his appearance or his beliefs because by doing so we are disparaging an entire faith and culture.”\n\nHe elaborated further to THR on set: “I hate that it even has to be a topic, to be honest. I think that the real takeaway for America is just a thought of tolerance and to not be too quick to judge anyone just because they look a certain way. There’s a lot of people, whether it be in America or somewhere else, that dress like that for religious purposes, so it’s sort of unfair to the whole culture.”\n\nThe Bachelorette castoff revealed Monday that he gave show producers his father’s phone number after realizing Lindsay could be the one. “I saw myself getting to the point where I could propose to Rachel. I would never ask someone to marry me without them having full knowledge of my family dynamic,” Unglert explained.\n\nThough his time with Lindsay during the special was brief, Unglert elaborated further to THR that he “definitely received closure” from her, but that processing the breakup was initially challenging.\n\n“It was definitely different than every other breakup because you’re so invested in the relationship,” he says. “In a normal relationship, you’re also invested in, like, work and friends, but [on The Bachelorette] you’re only invested in that one person. So, I think initially it’s very, very difficult. But once your friends are there to help you through it, it definitely helps you cope.”\n\nUnglert was one of four men who met Lindsay ahead of her official season premiere during Nick Viall’s Bachelor: After the Final Rose special. He received some backlash for his pickup line (“I’m ready to go black and I’m never going back”), but it appears Lindsay was not turned off by it, as the Californian made the final four. She broke up with Unglert directly after his dramatic hometown date, but asserted during Men Tell All that she was in fact “falling in love” with him. Before wrapping the special, Unglert made it clear “she’s always going to have a piece of my heart.”\n\nUnglert confirmed Monday he will have another opportunity to find love on the franchise, when Bachelor in Paradise season four debuts with a two-night premiere on Aug. 14 and Aug. 15. The spinoff series based in Sayulita, Mexico, was initially set to bow Aug. 8, but filming was temporarily suspended after a producer filed a misconduct allegation over a sexual encounter between two of the contestants, Corinne Olympios and DeMario Jackson, the latter of whom was also present at Men Tell All. Producers continued filming once the internal investigation found no signs of misconduct. Unglert offered no hints of his Paradise experience, other than a wide smile from ear-to-ear during Harrison’s announcement. A week ago, Unglert posted a video on Instagram of him and confirmed Paradise castmember Raven Gates.\n\nThe rest of Unglert’s on-set chat with THR follows.\n\nDeMario Jackson has been in the public eye on and off TV in the wake of the Bachelor in Paradise investigation. What did you think of the way he was today on set in comparison to how he usually was in the house?\n\nDeMario tonight was very exemplative of what he typically is. He’s got a big heart. He’s in a rebellious phase right now, I would say.\n\n#DeanForBachelor was trending after your elimination. Have you thought about being the next Bachelor?\n\nI’d say I don’t think I’m ready yet, at this point in my life. Of course, I would never immediately dismiss any offer, but I think I’d really have to sit down and really think about it.\n\nThe Lee Garrett vs. Kenny King feud and the topic of racism was discussed frequently on the show and again during the Men Tell All reunion. Yet, Rachel said she didn’t want race to dictate her season. How do you feel about the spotlight that was put on race, not just tonight, but throughout the entire season?\n\nI think it was pretty inevitable. I thought about this a little beforehand. There are two schools of thought you can have going into it: either celebrate Rachel’s proud African-American heritage, or you can completely disregard it and just treat it as a regular season. So there’s really no right or wrong answer to that question, I guess. But the spotlight that the whole Lee situation put on it was definitely unfair to Rachel because it took away from her experience and Kenny’s. I feel for them more so than anything else.\n\nHow do you feel about the fact that there was so much time devoted to it during the Men Tell All, especially in regards to Lee?\n\nI think the fact that we spent so much time talking about it as we did tonight was good. It was a very difficult topic, but at the end of the day, it needs to be talked about. There’s a lot of people that feel the same way that Lee does, and until those conversations are able to stop being had then it’s worth talking about.\n\nDid any of those heavy conversations while filming ever make you feel uncomfortable or overwhelmed?\n\nNo, I mean I’m always uncomfortable. So the conversation about race doesn’t affect me whatsoever. We’re all people at the end of the day.\n\nIs there anything you would change this season if you could go back in time?\n\nI’d probably pack more clothes.\n\nThe Bachelorette returns Aug. 7 for its three-hour season finale. In a franchise first, three (instead of two) suitors will continue vying for Lindsay’s heart during the final episode.\n\nSydney Odman contributed to this report.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/08/147165_2873-h_2017.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/147165_2873-h_2017.jpg?w=1024", "keywords": [], "authors": ["Christina Schoellkopf"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/bachelorettes-dean-unglert-says-hes-not-ready-be-next-bachelor-1025680/", "title": "‘Bachelorette’ Star Dean Unglert on Being the Next Bachelor: “I Don’t Think I’m Ready Yet”", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Unglert will once again compete for love on this summer's 'Bachelor' spinoff series 'Bachelor in Paradise.'", "news_keywords": "ABC, Bachelor In Paradise, The Bachelor, The Bachelorette", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Christina Schoellkopf", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1025680, "title": "'Bachelorette' Star Dean Unglert on Being the Next Bachelor: \"I Don’t Think I'm Ready Yet\"", "published_at": "2017-08-01 07:10:52", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/147165_2873-h_2017.jpg?w=1024", "comment_count": 0, "tags": "The Bachelorette", "topics": "TV News", "body": "Monday's The Bachelorette: Men Tell All special was a big night for fan-favorite Dean Unglert.\r\nThe 26-year-old startup recruiter from Venice addressed the ABC reality franchise's portrayal of his controversial hometown date and came face-to-face with Bachelorette Rachel Lindsay for the first time since she broke up with him on TV.\r\n\"That was the realest and most raw moment that I've had throughout the entire experience,\" he told host Chris Harrison during the annual cast reunion show.\r\nTwo weeks ago, Bachelorette viewers met his father, Harold Unglert, who now goes by the chosen name of Paramroop S. Khahsa. Previously on the show, Unglert disclosed that his mother died during his teen years and his father \"abandoned\" him and later converted to Sikhism. He hadn't seen his father in two years before their TV reunion, during which Khahsa barked during their emotional conversation, “You didn’t feel love from your father? Is that what you are saying? You’ve still got one fucking foot stuck in the past!” \r\n\r\nIn front of a live TV audience and 17 of his fellow castmembers, Unglert continued to reflect on the eye-opening experience. \"Had I not gone there with Rachel,\" he said, \"I don't think that I ever would have addressed the feelings that I had suppressed for so long.\"\r\nSpeaking to The Hollywood Reporter following the taping, Unglert said he hopes the real takeaway from his hometown experience is religious tolerance. Some viewers criticized ABC for sensationalizing Sikhism via dramatic previews leading up to the episode's airdate. In response, Unglert took to social media days before the episode to urge viewers not to criticize his father \"for his appearance or his beliefs because by doing so we are disparaging an entire faith and culture.\"\r\nHe elaborated further to THR on set: \"I hate that it even has to be a topic, to be honest. I think that the real takeaway for America is just a thought of tolerance and to not be too quick to judge anyone just because they look a certain way. There’s a lot of people, whether it be in America or somewhere else, that dress like that for religious purposes, so it’s sort of unfair to the whole culture.\"\r\nThe Bachelorette castoff revealed Monday that he gave show producers his father's phone number after realizing Lindsay could be the one. \"I saw myself getting to the point where I could propose to Rachel. I would never ask someone to marry me without them having full knowledge of my family dynamic,\" Unglert explained.\r\n\r\nThough his time with Lindsay during the special was brief, Unglert elaborated further to THR that he \"definitely received closure\" from her, but that processing the breakup was initially challenging.\r\n\"It was definitely different than every other breakup because you’re so invested in the relationship,\" he says. \"In a normal relationship, you’re also invested in, like, work and friends, but [on The Bachelorette] you’re only invested in that one person. So, I think initially it’s very, very difficult. But once your friends are there to help you through it, it definitely helps you cope.\"\r\nUnglert was one of four men who met Lindsay ahead of her official season premiere during Nick Viall's Bachelor: After the Final Rose special. He received some backlash for his pickup line (\"I'm ready to go black and I'm never going back\"), but it appears Lindsay was not turned off by it, as the Californian made the final four. She broke up with Unglert directly after his dramatic hometown date, but asserted during Men Tell All that she was in fact \"falling in love\" with him. Before wrapping the special, Unglert made it clear \"she's always going to have a piece of my heart.\"\r\nUnglert confirmed Monday he will have another opportunity to find love on the franchise, when Bachelor in Paradise season four debuts with a two-night premiere on Aug. 14 and Aug. 15. The spinoff series based in Sayulita, Mexico, was initially set to bow Aug. 8, but filming was temporarily suspended after a producer filed a misconduct allegation over a sexual encounter between two of the contestants, Corinne Olympios and DeMario Jackson, the latter of whom was also present at Men Tell All. Producers continued filming once the internal investigation found no signs of misconduct. Unglert offered no hints of his Paradise experience, other than a wide smile from ear-to-ear during Harrison's announcement. A week ago, Unglert posted a video on Instagram of him and confirmed Paradise castmember Raven Gates. \r\n\r\nThe rest of Unglert's on-set chat with THR follows. \r\nDeMario Jackson has been in the public eye on and off TV in the wake of the Bachelor in Paradise investigation. What did you think of the way he was today on set in comparison to how he usually was in the house?\r\nDeMario tonight was very exemplative of what he typically is. He’s got a big heart. He’s in a rebellious phase right now, I would say.\r\n#DeanForBachelor was trending after your elimination. Have you thought about being the next Bachelor? \r\nI’d say I don’t think I’m ready yet, at this point in my life. Of course, I would never immediately dismiss any offer, but I think I’d really have to sit down and really think about it.\r\nThe Lee Garrett vs. Kenny King feud and the topic of racism was discussed frequently on the show and again during the Men Tell All reunion. Yet, Rachel said she didn’t want race to dictate her season. How do you feel about the spotlight that was put on race, not just tonight, but throughout the entire season?\r\nI think it was pretty inevitable. I thought about this a little beforehand. There are two schools of thought you can have going into it: either celebrate Rachel’s proud African-American heritage, or you can completely disregard it and just treat it as a regular season. So there’s really no right or wrong answer to that question, I guess. But the spotlight that the whole Lee situation put on it was definitely unfair to Rachel because it took away from her experience and Kenny’s. I feel for them more so than anything else.\r\nHow do you feel about the fact that there was so much time devoted to it during the Men Tell All, especially in regards to Lee?\r\nI think the fact that we spent so much time talking about it as we did tonight was good. It was a very difficult topic, but at the end of the day, it needs to be talked about. There’s a lot of people that feel the same way that Lee does, and until those conversations are able to stop being had then it’s worth talking about.\r\nDid any of those heavy conversations while filming ever make you feel uncomfortable or overwhelmed?\r\nNo, I mean I’m always uncomfortable. So the conversation about race doesn’t affect me whatsoever. We’re all people at the end of the day.\r\nIs there anything you would change this season if you could go back in time?\r\nI’d probably pack more clothes.\r\n\r\nThe Bachelorette returns Aug. 7 for its three-hour season finale. In a franchise first, three (instead of two) suitors will continue vying for Lindsay's heart during the final episode. \r\nSydney Odman contributed to this report.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Bachelorette’ Star Dean Unglert on Being the Next Bachelor: “I Don’t Think I’m Ready Yet”", "url": "https://www.hollywoodreporter.com/tv/tv-news/bachelorettes-dean-unglert-says-hes-not-ready-be-next-bachelor-1025680/", "description": "Unglert will once again compete for love on this summer’s ‘Bachelor’ spinoff series ‘Bachelor in Paradise.’", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/147165_2873-h_2017.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2017-08-01T07:10:52+00:00", "modified_time": "2017-08-01T15:14:37+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Bachelorette’ Star Dean Unglert on Being the Next Bachelor: “I Don’t Think I’m Ready Yet”", "description": "Unglert will once again compete for love on this summer’s ‘Bachelor’ spinoff series ‘Bachelor in Paradise.’", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/147165_2873-h_2017.jpg?w=1280"}}, "movies": [], "publish_date": 1501571452.0, "source": "https://www.hollywoodreporter.com", "summary": ""}