{"url": "https://www.wmagazine.com/story/kourtney-kardashian-scott-disick-sofia-richie-vacation-together-cabo", "text": "There’s just something about the holiday season that can make people set their differences aside and come together over a tropical vacation in Cabo San Lucas, or at least that seems to be the case for Kourtney Kardashian, Scott Disick, and Sofia Richie.\n\nThe impetus of the trip was to celebrate the birthdays of Kardashian and Disick’s sons Mason and Reign Disick, who turned 9 and 4, respectively, on December 14. After rumors and reports circulated that Kardashian had brought her kids down to Cabo and joined Disick and Richie for a holiday vacation, Disick revealed that he and his ex were indeed vacationing together with the kids, with Richie in tow. On Instagram, he shared a photograph of himself sitting between Kardashian—who appeared to be deeply involved in her beach read (Paulo Coelho’s The Alchemist)—and Richie, sunning in an orange bikini. After your grandma gives you a $3,000 Versace puffer coat for your 9th birthday, what else is there to do besides fly down to Cabo with your brother who shares the same birthday, your mom, your dad, and his girlfriend who is just barely a decade older than you?\n\nKardashian wasn’t always so approving of the fact that Disick, the 35-year-old father of her three young children, has been dating Richie, who turned 20 in August, for over a year, but it looks like all it takes is a little family vacation down to Mexico to smooth things over. And Kardashian, who is 39, has been spending enough time with Luka Sabbat, the 21-year-old model-influencer-actor, that he has leveled up to the “attending family birthday parties” stage, and showed up to Mason’s Fortnite-themed birthday party before the Kardashian-Disick family flew down to Mexico just before Christmas. Looks like they all appear to be on good enough terms to enjoy an afternoon in the sun together.\n\nAccording to Instagram Stories, and some eagle-eyed fans, the blended family enjoyed dinner together and a movie night on the beach in honor of Mason and Reign. They also received support from Khloe Kardashian, who tweeted that she was “beyond proud of all of them” and praised her sister and Disick for placing their “children before anything else.” Leave it to the oldest Kardashian to set the ultimate co-parenting example.\n\nRelated: Luka Sabbat Is Now Joining Kourtney Kardashian at Family Birthday Parties", "images": ["https://imgix.bustle.com/wmag/2018/12/24/5c20ea8ebe23fd75b93d4e7f_46931652_2109143969396054_5116463969066983401_n.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/wmag/2018/12/24/5c20ea8ebe23fd75b93d4e7f_46931652_2109143969396054_5116463969066983401_n.jpg?w=414&h=414&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2022/10/5/47b5fa0f-fc48-4cb1-9604-6f5821fa832d-getty-1430611960.jpg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5093&fp-y=0.3502", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2022/8/29/9f122c0b-8ad0-4d04-b2cf-3379547870db-tswifty.jpeg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.532&fp-y=0.228"], "top_img": "https://imgix.bustle.com/wmag/2018/12/24/5c20ea8ebe23fd75b93d4e7f_46931652_2109143969396054_5116463969066983401_n.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wmagazine.com/story/kourtney-kardashian-scott-disick-sofia-richie-vacation-together-cabo", "title": "Kourtney Kardashian, Scott Disick, and Sofia Richie Are Vacationing in Cabo Together", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@wmag", "card": "summary_large_image", "creator": "@brkmrn"}, "article": {"publisher": "https://www.facebook.com/wmagazine"}, "og": {"site_name": "W Magazine", "url": "https://www.wmagazine.com/story/kourtney-kardashian-scott-disick-sofia-richie-vacation-together-cabo", "type": "article", "title": "Kourtney, Scott, and Sofia Richie Are All Sunning in Cabo Together", "description": "A truly modern family.", "image": {"identifier": "https://imgix.bustle.com/wmag/2018/12/24/5c20ea8ebe23fd75b93d4e7f_46931652_2109143969396054_5116463969066983401_n.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "A truly modern family."}, "movies": [], "publish_date": null, "source": "https://www.wmagazine.com", "summary": ""}