{"url": "en.wikipedia.org/wiki/Emma_Stone", "text": "American actress\n\nEmily Jean Stone (born November 6, 1988), known professionally as Emma Stone[a], is an American actress. She is the recipient of various accolades, including an Academy Award, a British Academy Film Award, and a Golden Globe Award. In 2017, she was the world's highest-paid actress and named by Time magazine as one of the 100 most influential people in the world.\n\nBorn and raised in Scottsdale, Arizona, Stone began acting as a child in a theater production of The Wind in the Willows in 2000. As a teenager, she relocated to Los Angeles and made her television debut in In Search of the New Partridge Family (2004), a reality show that produced only an unsold pilot. After small television roles, she appeared in a series of well-received teen comedy films, such as Superbad (2007), Zombieland (2009), and Easy A (2010). The last of these was Stone's first leading role, earning her a nomination for the Golden Globe Award for Best Actress. Following this breakthrough, she had supporting roles in the romantic comedy Crazy, Stupid, Love (2011) and the period drama The Help (2011), and gained wider recognition as Gwen Stacy in the 2012 superhero film The Amazing Spider-Man and its 2014 sequel.\n\nIn 2014, Stone played a recovering drug addict in the black comedy Birdman, which earned her a nomination for the Academy Award for Best Supporting Actress, and made her Broadway debut as Sally Bowles in a revival of the musical Cabaret. For playing an aspiring actress in the romantic musical La La Land (2016), she won the Academy Award for Best Actress. She received a third Academy Award nomination for portraying Abigail Masham in the historical comedy-drama The Favourite (2018). After a leading role in the Netflix dark comedy miniseries Maniac (2018), she reduced her workload, starring in the sequel Zombieland: Double Tap (2019) and the crime comedy Cruella (2021). Stone is married to comedian and writer Dave McCary, with whom she has a daughter.\n\nEarly life and education\n\nEmily Jean Stone was born on November 6, 1988, in Scottsdale, Arizona, to Jeffrey Charles Stone, the founder and CEO of a general-contracting company, and Krista Jean Stone (née Yeager), a homemaker.[4][5] She lived on the grounds of the Camelback Inn resort from ages twelve to fifteen.[6][7] She has a younger brother, Spencer.[8] Her paternal grandfather, Conrad Ostberg Sten, was from a Swedish family that anglicized their surname to \"Stone\" when they immigrated to the United States through Ellis Island. She also has German, English, Scottish, and Irish ancestry.[9]\n\nAs an infant, Stone had baby colic and cried frequently; she consequently developed nodules and calluses on her vocal cords while she was a child.[10] She has described herself as having been \"loud\" and \"bossy\" while growing up.[11] Stone was educated at Sequoya Elementary School and attended Cocopah Middle School for the sixth grade. Although she did not like school, she has stated that her controlling nature meant that \"I made sure I got all As\".[12] Stone suffered panic attacks and anxiety as a child,[13] which she says caused a decline in her social skills.[14] She underwent therapy but claims it was her participation in local theater plays that helped cure the attacks; she recalled:\n\nThe first time I had a panic attack I was sitting in my friend's house, and I thought the house was burning down. I called my mom and she brought me home, and for the next three years it just would not stop. I would go to the nurse at lunch most days and just wring my hands. I would ask my mom to tell me exactly how the day was going to be, then ask again 30 seconds later. I just needed to know that no one was going to die and nothing was going to change.[13]\n\nStone wanted to act since age four;[7] she wanted a career in sketch comedy initially, but shifted her focus toward musical theater, and took vocal lessons for several years.[15] Her acting debut, at age eleven, came in a stage production of The Wind in the Willows, playing the part of Otter.[16] Stone was homeschooled for two years, during which time she appeared in sixteen productions at Phoenix's Valley Youth Theatre—including The Princess and the Pea, Alice's Adventures in Wonderland, and Joseph and the Amazing Technicolor Dreamcoat[4]—and performed with the theater's improvisational comedy troupe.[17] Around this time, she traveled to Los Angeles and auditioned unsuccessfully for a role on Nickelodeon's All That.[1] Her parents later sent her for private acting lessons with a local acting coach, who had worked at the William Morris Agency in the 1970s.[5]\n\nStone attended Xavier College Preparatory—an all-girl Catholic high school—as a freshman, but dropped out after one semester to become an actress.[4] She prepared a PowerPoint presentation for her parents titled \"Project Hollywood\" (featuring Madonna's 2003 song \"Hollywood\") to convince them to let her move to California to pursue an acting career.[15] In January 2004, she moved with her mother to an apartment in Los Angeles. She recalled, \"I went up for every single show on the Disney Channel and auditioned to play the daughter on every single sitcom\", adding, \"I ended up getting none.\"[7] Between auditions for roles, she enrolled in online high-school classes, and worked part-time at a dog-treat bakery.[5][13]\n\nCareer\n\nEarly roles (2004–2008)\n\nStone made her television debut as Laurie Partridge on the VH1 talent competition reality show In Search of the New Partridge Family (2004). The resulting show, retitled The New Partridge Family (2004), remained an unsold pilot.[18] She followed this with a guest appearance in Louis C.K.'s HBO series Lucky Louie.[13] She auditioned to star as Claire Bennet in the NBC science fiction drama Heroes (2007) but was unsuccessful and later called this her \"rock bottom\" experience.[5] In April 2007, she played Violet Trimble in the Fox action drama Drive, but the show was canceled after seven episodes.[4]\n\nStone made her feature film debut in Greg Mottola's comedy Superbad (2007), co-starring Michael Cera and Jonah Hill. The film tells the story of two high school students who go through a series of comic misadventures after they plan to buy alcohol for a party. To play the role of Hill's romantic interest, she dyed her hair red.[19] A reviewer for The Hollywood Reporter found her to be \"appealing\", but felt that her role was poorly written.[20] Stone has described the experience of acting in her first film as \"amazing ... [but] very different than other experiences I've had since then\".[21] The film was a commercial success, and earned her the Young Hollywood Award for Exciting New Face.[22][23]\n\nThe following year, Stone starred in the comedy The Rocker (2008) playing Amelia Stone, the \"straight face\" bass guitarist in a band; she learned to play the bass for the role.[24] The actress, who describes herself as \"a big smiler and laugher\", admitted that she found it difficult playing a character whose personality traits were so different from her own. The film, and her performance, received negative reviews from critics and was a commercial failure.[25][26] Her next release, the romantic comedy The House Bunny, performed better at the box office, becoming a moderate commercial success.[27] The film saw her play the president of a sorority, and perform a cover version of the Waitresses' 1982 song \"I Know What Boys Like\".[28] Reviews for the film were generally negative,[29] but Stone was praised for her supporting role,[30] with TV Guide's Ken Fox stating she \"is well on her way to becoming a star\".[31]\n\nBreakthrough (2009–2011)\n\nStone appeared in three films released in 2009. The first of these was opposite Matthew McConaughey, Jennifer Garner and Michael Douglas in Mark Waters' Ghosts of Girlfriends Past. Loosely based on Charles Dickens' 1843 novella A Christmas Carol, the romantic comedy has her playing a ghost who haunts her former boyfriend. Critical reaction to the film was negative, though it was a modest commercial success.[32][33] Her most financially profitable venture that year was Ruben Fleischer's $102.3 million-grossing horror comedy film Zombieland,[34] in which she features alongside Jesse Eisenberg, Woody Harrelson and Abigail Breslin. In the film, she appeared as a con artist and survivor of a zombie apocalypse, in a role which Chris Hewitt of Empire magazine thought was \"somewhat underwritten.\"[35] In a more positive review, Tim Robey of The Daily Telegraph found \"the hugely promising Stone\" to be \"a tough cookie who projects the aura of being wiser than her years\".[36] Stone's third release in 2009 was Kieran and Michelle Mulroney's Paper Man, a comedy-drama which disappointed critics.[37]\n\nStone voiced an Australian Shepherd in Marmaduke (2010), a comedy from director Tom Dey, which is based on Brad Anderson's long-running comic strip of the same name.[38] Her breakthrough came the same year with a starring role in Easy A, a teen comedy directed by Will Gluck.[39][40] Partially based on Nathaniel Hawthorne's 1850 historical romance novel The Scarlet Letter, the film tells the story of Olive Penderghast (Stone), a high school student who becomes embroiled in a comic sex scandal after a false rumor circulates that she is sexually promiscuous. Stone read the script before the project was optioned for production, and pursued it with her manager while production details were being finalized. She found the script \"so different and unique from anything I'd read before\", saying that it was \"funny and sweet\". When Stone discovered that the film had begun production, she met with Gluck, expressing her enthusiasm for the project. A few months later, the audition process started and she met again with Gluck, becoming one of the first actresses to audition.[41] The film received positive critical reviews, and Stone's performance was considered its prime asset.[42] Anna Smith of Time Out wrote, \"Stone gives a terrific performance, her knowing drawl implying intellect and indifference with underlying warmth.\"[43] The film was a commercial success, grossing $75 million against its $8 million budget.[44] Stone was nominated for a BAFTA Rising Star Award and a Golden Globe Award for Best Actress in a Musical or Comedy, and won the MTV Movie Award for Best Comedic Performance.[45]\n\nIn October 2010, Stone hosted an episode of NBC's late-night sketch comedy Saturday Night Live; her appearances included a sketch playing off her resemblance to Lindsay Lohan.[46] Stone described it as \"the greatest week of my life\".[7][47] She hosted it again in 2011, appeared in an episode in 2014, and in its 40th anniversary special in 2015.[48] A brief appearance in the sex comedy Friends with Benefits (2011) reunited her with Gluck.[49] She followed this with a supporting role in Glenn Ficarra and John Requa's romantic comedy Crazy, Stupid, Love (2011) alongside Steve Carell, Ryan Gosling and Julianne Moore. The film featured her as a law school graduate, and the love interest of Gosling's character. Despite finding \"some inevitable collapses into convention\" in the film, Drew McWeeny of HitFix wrote that Stone \"ties the whole film together\".[50] At the 2012 Teen Choice Awards, she won the Choice Movie Actress – Comedy award for her performance in the film.[51] Crazy, Stupid, Love was a box office success, grossing $142.9 million worldwide against a production budget of $50 million.[52]\n\nDismayed at being typecast as \"the sarcastic interest of the guy\", Stone co-starred with Viola Davis in Tate Taylor's period drama The Help (2011), a film she found challenging.[53] The film is based on Kathryn Stockett's 2009 novel of the same name and is set in 1960s Jackson, Mississippi. She met with Taylor to express a desire to work on the film. The director said, \"[Stone] was completely awkward and dorky, with her raspy voice, and she sat down and we got a little intoxicated and had a blast, and I just thought, 'God! God! This is Skeeter.\"[54] She was cast as Eugenia \"Skeeter\" Phelan, an aspiring writer learning about the lives of the African-American maids. In preparation for the part, she learned to speak in a Southern accent and educated herself on the Civil Rights Movement through literature and film.[55] With a worldwide gross of $216 million against a $25 million budget, The Help became Stone's highest-grossing film to that point.[56] The film, and her performance, received positive reviews from critics. Writing for Empire, Anna Smith thought Stone was \"well-meaning and hugely likable\" despite finding flaws in the character.[57] The film was nominated for an Academy Award for Best Picture,[58] and won Best Ensemble Cast from the Women Film Critics Circle and the Broadcast Film Critics Association.[59][60]\n\nThe Amazing Spider-Man, Birdman, and Broadway (2012–2015)\n\nStone at the 2012 WonderCon\n\nStone turned down a role in the action comedy 21 Jump Street after signing on to Marc Webb's 2012 film The Amazing Spider-Man, a reboot of Sam Raimi's Spider-Man series.[61][62] She portrayed Gwen Stacy, the love interest of the titular superhero (played by Andrew Garfield).[63] Stone returned to her natural blonde hair color for the role, having dyed it red previously.[64][65] She admitted to having never read the comics, and therefore felt responsible to educate herself about Spider-Man: \"My experience was with the Sam Raimi movies ... I always assumed that Mary Jane was his first love\",[66] adding that she was only familiar with Stacy's character as portrayed by Bryce Dallas Howard in Spider-Man 3.[67][68] The Amazing Spider-Man was a commercial success and was the seventh highest-grossing film of the year with global revenues of $757.9 million.[69] Entertainment Weekly's Lisa Schwarzbaum found Stone to be \"irresistible\",[70] and Ian Freer of Empire was particularly impressed with Stone's and Garfield's performances.[71] At the annual People's Choice Awards ceremony, she was nominated for three awards, including Favorite Movie Actress.[72] Later that year, Stone voiced a role in the crime-based video game Sleeping Dogs, which earned her a Spike Video Game Award for Best Performance by a Human Female.[73]\n\nStone began 2013 with a voice role in the DreamWorks Animation film The Croods, which was nominated for the Academy Award for Best Animated Feature.[74] This followed with an appearance in Movie 43, an anthology film which consists of sixteen short stories—she played the title role in the segment entitled \"Veronica\".[75] She next starred alongside Ryan Gosling and Sean Penn in Ruben Fleischer's Gangster Squad (2013), a crime thriller set in Los Angeles during the 1940s.[76] A. O. Scott of The New York Times dismissed the film as \"a hectic jumble of fedoras and zoot suits\", but praised Stone's pairing with Gosling.[77] She expressed a desire to work with Gosling on more projects.[78] In 2014, Stone reprised the role of Gwen Stacy in The Amazing Spider-Man 2. She believed that her character did not depend on the film's protagonist, asserting: \"She saves him more than he saves her. She's incredibly helpful to Spider-Man ... He's the muscle, she's the brains.\"[79] Her performance was well received by critics;[80] an Empire reviewer commended her for standing out in the film, writing, \"Stone is the Heath Ledger of this series, doing something unexpected with an easily dismissed supporting character.\"[81] The role won her the Favorite Movie Actress award at the 2015 Kids' Choice Awards.[82] Later that year, Stone took on a role in Woody Allen's romantic comedy Magic in the Moonlight, a modest commercial success.[83] A. O. Scott criticized her role, and pairing with Colin Firth, describing it as \"the kind of pedantic nonsense that is meant to signify superior intellect\".[84]\n\nThe black comedy-drama Birdman, directed by Alejandro González Iñárritu, was Stone's final film release of 2014. Co-starring Michael Keaton and Edward Norton, it featured her as Sam Thomson, the recovering-addict daughter of actor Riggan Thomson (Keaton), who becomes his assistant. Iñárritu created the character based on his experience with his daughter.[85] Birdman was critically acclaimed,[86] and was the most successful film at the 87th Academy Awards; it was nominated for nine awards, winning four, including Best Picture.[87] The Movie Network deemed it one of Stone's best performances to date, and Robbie Collin of The Daily Telegraph found her to be \"superb\" and \"tremendous\" in her role, while also highlighting her monologue in the film which he believed to have been \"delivered like a knitting needle to the gut.\"[88][89] She received numerous accolades for her performance, including nominations for an Academy, a BAFTA, a Golden Globe, a Screen Actors Guild, and a Critics' Choice Movie award for Best Supporting Actress.[90]\n\nFrom November 2014 to February 2015, Stone starred in a revival of the Broadway musical Cabaret as Sally Bowles, taking over the role from Michelle Williams.[91] Deeming it \"the most nerve-racking thing ever\", Stone listened to a French radio station to mentally prepare herself for the role.[92][93] Marilyn Stasio of Variety was critical of her singing abilities and found her performance to be \"a bit narrow as an emotional platform, but a smart choice for her acting skills, the perfect fit for her sharp intelligence and kinetic energy.\"[94] Both of Stone's 2015 films—the romantic comedy-drama Aloha, and the mystery drama Irrational Man—were critical and commercial failures, and her roles were panned by critics.[83][95] In Cameron Crowe's Aloha, she played the role of an air force pilot alongside Bradley Cooper, and in Woody Allen's Irrational Man, she played the love interest of Joaquin Phoenix's character, a philosophy professor. The former was controversial for whitewashing the cast, as Stone's character was meant to be of Asian, Hawaiian, and Swedish descent. She later regretted taking part in the project, acknowledging whitewashing as a widespread problem in Hollywood.[96] Despite the backlash, Stone was nominated for Choice Movie Actress – Comedy at the 2015 Teen Choice Awards.[97] She also appeared in the music video for Win Butler's single \"Anna\".[98]\n\nEstablished actress (2016–present)\n\nDuring her run in the Cabaret revival, Stone met filmmaker Damien Chazelle, who, impressed with her performance, cast her in his musical comedy-drama La La Land.[99] The project, which marked her third collaboration with Gosling, starred Stone as Mia Dolan, an aspiring actress living in Los Angeles.[100] Stone borrowed several real-life experiences for her character, and in preparation, watched The Umbrellas of Cherbourg and films of Fred Astaire and Ginger Rogers.[101][102] For the film's soundtrack, she recorded six songs.[b] La La Land served as the opening film at the 2016 Venice Film Festival, where it generated critical acclaim and earned Stone the Volpi Cup for Best Actress.[104] In addition to being her best-reviewed film on the review aggregator Rotten Tomatoes,[105] it emerged as a commercial success, with a worldwide gross of over $440 million against a production budget of $30 million.[106] Peter Bradshaw of The Guardian wrote that \"Stone has never been better: superbly smart, witty, vulnerable, her huge doe eyes radiating intelligence even, or especially, when they are filling with tears.\"[107] For her performance, Stone won the Academy, Golden Globe, SAG, and BAFTA Award for Best Actress.[108]\n\nStone's sole release of 2017 was the sports comedy-drama Battle of the Sexes, based on the 1973 eponymous match between tennis players Billie Jean King (Stone) and Bobby Riggs (Steve Carell). In preparation, Stone met with King, watched old footage and interviews of her, worked with a dialect coach to speak in King's accent, and drank high-calorie protein shakes to gain 15 pounds (6.8 kg).[109][110] The film premiered to positive reviews at the 2017 Toronto International Film Festival, and certain critics considered Stone's performance to be the finest of her career.[111] Benjamin Lee of The Guardian praised her for playing against type, and for being \"strong\" and \"convincing\" in the part.[112] Even so, the film earned less than its $25 million budget.[113] Stone received her fourth Golden Globe nomination for it, and attended the ceremony with King.[114]\n\nIn 2018, Stone and Rachel Weisz starred as Abigail Masham and Sarah Churchill, two cousins fighting for the affection of Queen Anne (Olivia Colman), in Yorgos Lanthimos' historical comedy-drama The Favourite. She found it challenging being an American among an all-British cast, and struggled with mastering her character's accent.[115] The film premiered at the 75th Venice International Film Festival to critical acclaim.[116] Michael Nordine of IndieWire praised Stone for taking on such a bold role following the success of La La Land, and termed the three lead actresses \"a majestic triumvirate in a period piece that's as tragic as it is hilarious.\"[117] For The Favourite, she received her fifth Golden Globe nomination and third Oscar nomination.[118][119] She then executive-produced and starred in the Netflix dark comedy miniseries Maniac, directed by Cary Joji Fukunaga. It featured Stone and Jonah Hill as two strangers, whose lives are transformed due to a mysterious pharmaceutical trial. An admirer of Fukunaga's work, she agreed to the project without reading the script.[120] Lucy Mangan of The Guardian commended both Stone and Hill for playing against type and delivering career-best performances;[121] Judy Berman of Time magazine was similarly impressed with their growth as actors since Superbad and noted the complexity in their performances.[122] In the same year, Stone appeared alongside Paul McCartney in a music video for his song \"Who Cares\".[123]\n\nStone reprised her role as Wichita in Zombieland: Double Tap (2019), the sequel to 2009's Zombieland, which received mixed reviews and has grossed $122 million worldwide.[124][125] She narrated the Netflix documentary series The Mind, Explained (2019) and reprised the voice role of Eep in The Croods: A New Age (2020), the sequel to 2013's The Croods.[126][127][128] In 2021, Stone played Cruella de Vil (originally played by Glenn Close in the 1996 live-action adaptation and its 2000 sequel) in Craig Gillespie's crime comedy Cruella, a Disney live-action based on the 1961 animation One Hundred and One Dalmatians. Starring opposite Emma Thompson, Stone also served as an executive producer of the film alongside Close.[129][130] The film was released in US theaters and on Disney+ Premier Access to positive reviews and grossed $233 million worldwide against its $100 million budget.[131][132] Justin Chang of Los Angeles Times wrote that despite the film's flawed screenplay, Stone was \"wholly committed, glammed-to-the-nines\"; Chang favorably compared it with her performance in The Favourite, adding that she \"nailed every nuance as another lowly young woman turned ambitious schemer\".[133] For Cruella, Stone garnered another Golden Globe nomination.[134]\n\nUpcoming projects\n\nStone will next reteam with Yorgos Lanthimos on two projects, the short film Bleat and Poor Things. The latter film is based on the novel of the same name by Alasdair Gray and co-stars Willem Dafoe and Mark Ruffalo.[135][136] She will reprise her role as Cruella de Vil in a sequel to Cruella and will also star in the Showtime comedy series The Curse.[137][138]\n\nPublic image\n\nCommenting on her performance in The Help, Kirk Honeycutt of The Hollywood Reporter called her \"one of our very best young actresses\".[141] She is known for starring both in high-profile, mainstream productions and in low-budget independent films. Time's Daniel D'Addario describes the latter as \"substantive risk\" and adds that taking on a role in them provides her an opportunity to \"try something new and to get credibility\".[142] Analyzing her on-screen persona, Jessica Kiang of IndieWire noted that Stone \"usually [plays] the approachable, down-to-earth, girl-next-door type, [and] in person she demonstrates many of those qualities too, along with an absolute refusal to take herself too seriously.\"[143]\n\nIn 2008, she topped Saturday Night Magazine's Top 20 Rising Stars Under 30 and was included in a similar list compiled by Moviefone.[144][145] LoveFilm placed her on their list of 2010 Top 20 Actresses Under 30, and her performance in Easy A was included in Time's Top 10 Everything of 2010.[146][147] She appeared in the 2013 Celebrity 100 list, a compilation of the 100 most powerful people in the world, as selected annually by Forbes. The magazine reported that she had earned $16 million from June 2012 to June 2013.[148] That same year, she was ranked first in the magazine's Top 10 Best Value Stars.[149] In 2015, Forbes published that she had become one of the world's highest-paid actresses with earnings of $6.5 million.[150] The magazine would rank her as the world's highest-paid actress two years later with annual earnings of $26 million.[151] In 2017, she was included on Time's annual list of the 100 most influential people in the world.[152]\n\nStone has been described as a style icon—the media lists her hair, eyes, and husky voice as her trademark features.[139][140] Vogue credits the actress for her \"sophisticated, perfectly put-together looks\", writing that \"her charisma, both on-screen and off-, has charmed many.\"[153] In 2009, she was featured on FHM's 100 Sexiest Women in the World and Maxim's Hot 100;[154][155] the latter also placed her on the list on three other occasions—2010, 2011, and 2014.[156] In 2011, she featured on Victoria's Secret's list of \"What is Sexy?\" as the Sexiest Actress.[157] She was mentioned in other media outlet listings that year, including People's 100 Most Beautiful Women, each of FHM's and FHM Australia's 100 Sexiest Women in the World, and Men's Health's 100 Hottest Women.[158] She was ranked sixth on Empire's list of the 100 Sexiest Movie Stars in 2013.[159] Stone was named the best-dressed woman of 2012 by Vogue and was included on similar listings by Glamour in 2013 and 2015, and People in 2014.[160][161]\n\nPersonal life\n\nStone moved from Los Angeles to Greenwich Village, New York, in 2009.[15] In 2016, she moved back to Los Angeles.[13] Despite significant media attention, she refuses to publicly discuss her personal life. Concerned with living a \"normal\" life, Stone has said she finds little value in media attention.[162] She has expressed her fondness for her profession,[13] and has cited Diane Keaton as an acting influence, calling her \"one of the most covered-up actresses of all time\". She has also named Marion Cotillard as one of her inspirations.[5] Stone has a close relationship with her family.[5] She says, \"I am blessed with a great family and great people around me that would be able to kick me in the shins if I ever for one minute got lost up in the clouds. I've been really lucky in that sense.\"[154]\n\nDuring the filming of The Amazing Spider-Man in 2010, Stone began dating her co-star Andrew Garfield.[163] Their relationship was reported in the media with various speculations; the pair refused to speak publicly about it, though they made several appearances together. In 2014, on an occasion in New York City, Stone and Garfield encouraged paparazzi to visit websites that spread awareness of causes such as autism.[164] In 2015, they were reported to have broken up.[165][166]\n\nIn 2017, Stone began a relationship with Saturday Night Live segment director Dave McCary.[167] They became engaged in December 2019 and married the following year.[168] In January 2021, the couple were reported to be expecting their first child together.[169] In March 2021, they had their first child, a daughter.[170] The couple named their daughter Louise Jean McCary—a tribute to Stone's grandmother, Jean Louise. Jean is also Stone's middle name.[171]\n\nPhilanthropy\n\nStone has said she suffers from asthma, which she discovered after having difficulty breathing during the filming of Easy A.[172] Her mother was diagnosed with triple-negative breast cancer and was cured in 2008.[173] Stone and her mother celebrated by getting tattoos of birds' feet, designed by Paul McCartney, a reference to The Beatles song \"Blackbird\", which she and her mother love.[174] She appeared in a Revlon campaign that promoted breast cancer awareness.[175] In 2011, Stone featured in a collaborative video between Star Wars and Stand Up to Cancer, which aimed to raise funds for cancer research.[176] Two years later, she attended an event by Gilda's Club, an organization working for a similar purpose.[177] From 2012 to 2014, she hosted the Entertainment Industry Foundation's Revlon Run/Walk, which helps fight women's cancer.[178]\n\nStone, alongside three other celebrities, was present at the 2012 Nickelodeon HALO Awards, a television special that profiled four teenagers who are \"Helping And Leading Others\" (HALO).[179] She attended the 2014 Earth Hour, a worldwide movement for the planet organized by the World Wide Fund for Nature.[180] In 2015, she was part of a fundraising event in support of the Motion Picture & Television Fund, which helps people in the film and television industries with limited or no resources.[181] In 2018, she collaborated with 300 women in Hollywood to set up the Time's Up initiative to protect women from sexual harassment and discrimination.[182]\n\nActing credits and awards\n\nAccording to the review aggregator site Rotten Tomatoes and the box-office site Box Office Mojo, Stone's most critically acclaimed and commercially successful films are Superbad (2007), Zombieland (2009), Easy A (2010), Crazy, Stupid, Love (2011), The Help (2011), The Amazing Spider-Man (2012), The Amazing Spider-Man 2 (2014), Birdman (2014), La La Land (2016), Battle of the Sexes (2017), The Favourite (2018), and Cruella (2021).[105][183]\n\nStone has been nominated for three Academy Awards: Best Supporting Actress for Birdman and The Favourite, and Best Actress for La La Land; and four British Academy Film Awards: BAFTA Rising Star Award, Best Supporting Actress for Birdman and The Favourite, and Best Actress in a Leading Role for La La Land. She won both her nominations for La La Land.[45][90][108] Other awards for the film include Best Actress in a Comedy or Musical at the 74th Golden Globe Awards, Outstanding Performance by a Female Actor in a Leading Role at the 23rd Screen Actors Guild Awards and Volpi Cup for Best Actress at Venice Film Festival.[108][184][185]\n\nSee also\n\nNotes", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/19px-Video-x-generic.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Ballerina-icon.jpg/16px-Ballerina-icon.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Emma_Stone_at_Maniac_UK_premiere_%28cropped%29.jpg/220px-Emma_Stone_at_Maniac_UK_premiere_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Emma_Stone_2011_2.jpg/180px-Emma_Stone_2011_2.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/21px-Flag_of_the_United_States.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e0/WPVG_icon_2016.svg/19px-WPVG_icon_2016.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Emma_Stone_by_Gage_Skidmore.jpg/170px-Emma_Stone_by_Gage_Skidmore.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/19px-P_vip.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/ValleyYouthTheatre.jpg/220px-ValleyYouthTheatre.jpg", "https://upload.wikimedia.org/wikipedia/commons/3/31/Emma_Stone_at_Maniac_UK_premiere_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Emma_Stone_%285094692254%29.jpg/170px-Emma_Stone_%285094692254%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Emma_Stone_2014.jpg/170px-Emma_Stone_2014.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Emma_Stone_Deauville_2011_%28cropped%29.jpg/170px-Emma_Stone_Deauville_2011_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/21px-Blank_television_set.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Emma_Stone%2C_Justin_Hurwitz%2C_Damien_Chazelle_%2830116702391%29_%28cropped_3%29.jpg/220px-Emma_Stone%2C_Justin_Hurwitz%2C_Damien_Chazelle_%2830116702391%29_%28cropped_3%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Flag_of_New_York_City.svg/21px-Flag_of_New_York_City.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/31/Emma_Stone_at_Maniac_UK_premiere_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Emma_Stone", "title": "Emma Stone", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/3/31/Emma_Stone_at_Maniac_UK_premiere_%28cropped%29.jpg", "width": 640, "height": 972}, "title": "Emma Stone - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}