{"url": "https://www.hollywoodreporter.com/live-feed/rent-set-as-foxs-next-931551", "text": "Fox has found its follow-up to Grease Live.\n\nFollowing prolonged negotiations, Jonathan Larson’s Tony-winning HIV/AIDS-themed musical Rent is set as the network’s next live musical, The Hollywood Reporter has learned. Larson’s estate is on board to executive produce alongside Marc Platt (La La Land, Wicked). Rent marks Platt’s latest live project for following NBC’s Jesus Christ Superstar and Fox’s newly announced A Christmas Story and last year’s Grease. Additional auspices, as well as a premiere date and casting, will be announced later.\n\nThe rock musical, loosely based on La Boheme, tells the story of a group of impoverished young artists struggling to survive and create a life in New York’s East Village in the days of the Bohemian Alphabet City and under the shadow of HIV/AIDS.\n\nThe Pulitzer Prize-winning play was created by Larson, who died suddenly before Rent opened off-Broadway in 1996 and then moved to Broadway. Rent won Tony Awards for best musical, book of a musical and original score — all for Larson — and scored co-lead Wilson Jermaine Heredia a win for featured actor for his performance as Angel Dumott Schunard, a drag queen drummer with HIV/AIDS.\n\n“Rent?? was Jonathan’s dream of sharing the ?theater and the passion he had for it with a whole new generation,” Julie and Al Larson said in a statement. “None of us could have imagined the massive impact that the messages and themes in Rent would have on the ?theater? community or the world … except for Jonathan. We are absolutely thrilled to be continuing Jonathan’s legacy and ?the still-relevant ?themes of ?the show in this way.”\n\n\n\nThe original Broadway cast also included Adam Pascal, Daphne-Rubin-Vega and Idina Menzel , who all collected Tony nominations, as well as Anthony Rapp , Jesse L. Martin and Taye Diggs .\n\n\n\n“We are so honored to partner with the estate of the brilliant Jonathan Larson and producer Marc Platt on one of the great musicals of our time,” said Dana Walden and Gary Newman, chairmen and CEOs of Fox Television Group. “The title is so iconic, the music is so beloved, and the themes are as meaningful today as they were when the show first premiered on Broadway. With Marc overseeing this project, we are sure it will have a profound impact on the legions of fans who know and love this musical.”\n\nThe production was adapted for the big screen in 2005 with Chris Columbus directing and produced by Robert DeNiro , Jane Rosenthal, Columbus, Mark Radcliffe and Michael Barnathan . Stephen Chbosky adapted Larson’s book, with nearly all of the original Broadway cast returning to reprise their roles. With a $40 million budget, the pic grossed a disappointing $31.6 million. The play marked its 20th anniversary in 2016 with a tour.\n\nFox’s production will be exec produced by Platt, Adam Siegel, Julie Larson, Al Larson and Revolution Studios’ Vince Totino , Scott Hemming and Marla Levine. The original production was produced by the New York Theatre Workshop and on Broadway by Jeffrey Seller, Kevin McCollum, Allan S. Gordon and the NYTW . Larson, for his part, also earned a Pulitzer Prize for the production.\n\nSpeaking with THR at the Emmys, Walden said Rent “would be a dream — a dream your biggest dream” to land as the network’s next live production. “That would be a title that’s perfect for Fox and something that we could do in a meaningful way. Our network is distinguished by cutting-edge programming and being able to take subject matter — whether it was Glee or Shots Fired — I think our brand is perfect for that title. I would love it.”\n\nRent, with a legion of loyal and diehard fans, has big shoes to fill. Grease Live ranked third this year at the Emmys, collecting a total of five statuettes including for outstanding special class program and directing for Tony winner Thomas Kail (Hamilton).\n\nThe news comes after Fox announced A Christmas Story would air in December, opposite NBC and Jennifer Lopez with Bye Bye Birdie. NBC also noted this week that it would tackle Jesus Christ Superstar for Easter 2018. (There remains no word on NBC’s A Few Good Men live production.)\n\nParadigm and Carol Contes of the Guzman Law Group brokered the deal.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.hollywoodreporter.com/wp-content/uploads/2016/09/rent_broadway_closing_night_-_curtain_call_-_h_-_2016_.jpg?w=1296&h=730&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2016/09/rent_broadway_closing_night_-_curtain_call_-_h_-_2016_.jpg?w=1024"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2016/09/rent_broadway_closing_night_-_curtain_call_-_h_-_2016_.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/rent-set-as-foxs-next-931551/", "title": "‘Rent’ Set as Fox’s Next Live Musical", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The estate of Tony winner Jonathan Larson will exec produce the live musical of the HIV/AIDS-themed play. Marc Platt is also on board.", "news_keywords": "Fox", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 931551, "title": "'Rent' Set as Fox's Next Live Musical", "published_at": "2017-05-12 14:30:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/09/rent_broadway_closing_night_-_curtain_call_-_h_-_2016_.jpg?w=1024", "comment_count": 0, "tags": "Fox", "topics": "TV News", "body": "Fox has found its follow-up to Grease Live.\r\nFollowing prolonged negotiations, Jonathan Larson's Tony-winning HIV/AIDS-themed musical Rent is set as the network's next live musical, The Hollywood Reporter has learned. Larson's estate is on board to executive produce alongside Marc Platt (La La Land, Wicked). Rent marks Platt's latest live project for following NBC's Jesus Christ Superstar and Fox's newly announced A Christmas Story and last year's Grease. Additional auspices, as well as a premiere date and casting, will be announced later.\r\nThe rock musical, loosely based on La Boheme, tells the story of a group of impoverished young artists struggling to survive and create a life in New York's East Village in the days of the Bohemian Alphabet City and under the shadow of HIV/AIDS.\r\nThe Pulitzer Prize-winning play was created by Larson, who died suddenly before Rent opened off-Broadway in 1996 and then moved to Broadway. Rent won Tony Awards for best musical, book of a musical and original score — all for Larson — and scored co-lead Wilson Jermaine Heredia a win for featured actor for his performance as Angel Dumott Schunard, a drag queen drummer with HIV/AIDS.\r\n\r\n\r\n\t\"Rent?? was Jonathan’s dream of sharing the ?theater and the passion he had for it with a whole new generation,” Julie and Al Larson said in a statement. “None of us could have imagined the massive impact that the messages and themes in Rent would have on the ?theater? community or the world ... except for Jonathan. We are absolutely thrilled to be continuing Jonathan’s legacy and ?the still-relevant ?themes of ?the show in this way.”\r\n\t \r\n\r\n\tThe original Broadway cast also included Adam Pascal, Daphne-Rubin-Vega and Idina Menzel, who all collected Tony nominations, as well as Anthony Rapp, Jesse L. Martin and Taye Diggs.\r\n\t \r\n\r\n\t\r\n\t\t\"We are so honored to partner with the estate of the brilliant Jonathan Larson and producer Marc Platt on one of the great musicals of our time,\" said Dana Walden and Gary Newman, chairmen and CEOs of Fox Television Group. \"The title is so iconic, the music is so beloved, and the themes are as meaningful today as they were when the show first premiered on Broadway. With Marc overseeing this project, we are sure it will have a profound impact on the legions of fans who know and love this musical.\"\r\n\t\r\n\t\t\r\n\t\tThe production was adapted for the big screen in 2005 with Chris Columbus directing and produced by Robert DeNiro, Jane Rosenthal, Columbus, Mark Radcliffe and Michael Barnathan. Stephen Chbosky adapted Larson's book, with nearly all of the original Broadway cast returning to reprise their roles. With a $40 million budget, the pic grossed a disappointing $31.6 million. The play marked its 20th anniversary in 2016 with a tour. \r\n\t\r\n\t\t\r\n\t\tFox's production will be exec produced by Platt, Adam Siegel, Julie Larson, Al Larson and Revolution Studios' Vince Totino, Scott Hemming and Marla Levine. The original production was produced by the New York Theatre Workshop and on Broadway by Jeffrey Seller, Kevin McCollum, Allan S. Gordon and the NYTW. Larson, for his part, also earned a Pulitzer Prize for the production.\r\n\r\nSpeaking with THR at the Emmys, Walden said Rent \"would be a dream — a dream your biggest dream\" to land as the network's next live production. \"That would be a title that's perfect for Fox and something that we could do in a meaningful way. Our network is distinguished by cutting-edge programming and being able to take subject matter — whether it was Glee or Shots Fired — I think our brand is perfect for that title. I would love it.\"\r\nRent, with a legion of loyal and diehard fans, has big shoes to fill. Grease Live ranked third this year at the Emmys, collecting a total of five statuettes including for outstanding special class program and directing for Tony winner Thomas Kail (Hamilton). \r\nThe news comes after Fox announced A Christmas Story would air in December, opposite NBC and Jennifer Lopez with Bye Bye Birdie. NBC also noted this week that it would tackle Jesus Christ Superstar for Easter 2018. (There remains no word on NBC's A Few Good Men live production.)\r\nParadigm and Carol Contes of the Guzman Law Group brokered the deal.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Rent’ Set as Fox’s Next Live Musical", "url": "https://www.hollywoodreporter.com/tv/tv-news/rent-set-as-foxs-next-931551/", "description": "The estate of Tony winner Jonathan Larson will exec produce the live musical of the HIV/AIDS-themed play. Marc Platt is also on board.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2016/09/rent_broadway_closing_night_-_curtain_call_-_h_-_2016_.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-05-12T14:30:00+00:00", "modified_time": "2017-05-14T20:35:35+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Rent’ Set as Fox’s Next Live Musical", "description": "The estate of Tony winner Jonathan Larson will exec produce the live musical of the HIV/AIDS-themed play. Marc Platt is also on board.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/09/rent_broadway_closing_night_-_curtain_call_-_h_-_2016_.jpg?w=1296"}}, "movies": ["https://www.youtube.com/embed/Hs-2YwxefTA"], "publish_date": 1494599400.0, "source": "https://www.hollywoodreporter.com", "summary": ""}