{"url": "en.wikipedia.org/wiki/Super_Bowl_XXXVIII_halftime_show_controversy", "text": "2004 controversy over indecent exposure on television\n\nJanet Jackson and Justin Timberlake immediately after Timberlake tore off part of Jackson's clothes at the end of the Super Bowl XXXVIII halftime show\n\nThe Super Bowl XXXVIII halftime show, which was broadcast live on February 1, 2004, from Houston, Texas, on the CBS television network, is notable for a moment in which Janet Jackson's breast—adorned with a nipple shield—was exposed by Justin Timberlake to the viewing public for approximately half a second. The incident, sometimes referred to as Nipplegate or Janetgate, led to an immediate crackdown and widespread debate on perceived indecency in broadcasting.\n\nThe halftime show was produced by MTV and was focused on the network's Choose or Lose campaign (the year 2004 was a presidential election year in the United States). The exposure was broadcast to a total audience of 150.0 million viewers. Following the incident, the National Football League (NFL) excluded MTV, which had also produced the halftime show for Super Bowl XXXV, from future halftime shows. In addition, CBS parent company Viacom and its co-owned subsidiaries, MTV and Infinity Broadcasting, enforced a blacklist of Jackson's singles and music videos on many radio formats and music channels worldwide. The Federal Communications Commission (FCC) fined CBS for an indecency violation of $27,500 and increased it to $325,000. They eventually fined CBS a record $550,000 for the incident, but that fine was ultimately voided by the Third Circuit Court of Appeals in 2011, and a case to reinstate the fine was refused in 2012.\n\nThe incident was ridiculed both within the United States and abroad, with a number of commentators opining that it was a planned publicity stunt. Some American commentators, including Jackson herself, argued it was being used as a means to distract the public from the ongoing Iraq War. The increased regulation of broadcasting raised concerns regarding censorship and free speech in the United States.\n\nYouTube co-founder Jawed Karim credits the incident with leading to the creation of the video sharing website. The incident also made Janet Jackson the most-searched person and term of 2004 and 2005. The incident broke the record for \"most-searched event over one day\". It became the most-watched, recorded and replayed television moment in TiVo history and \"enticed an estimated 35,000 new [TiVo] subscribers to sign up\". The term \"wardrobe malfunction\" was coined as a result of the incident, and was eventually added to the Merriam-Webster's Collegiate Dictionary.\n\nIn April 2021, celebrity stylist Wayne Scot Lukas claimed that it was planned by Timberlake, who sought to upstage his ex-girlfriend Britney Spears' MTV Video Music Awards appearance at which she kissed Madonna.[1] In 2015, Lukas had stated that he was not aware of what happened with Timberlake.[2] In 2018, USA Today reported Lukas was seen purchasing a sunburst nipple shield from Byriah Dailey the weekend prior to the Super Bowl, telling Dailey \"OK, watch the halftime show. There's going to be a surprise at the end.\"[3]\n\nBackground and development [ edit ]\n\nJanet Jackson was the original choice to perform at the halftime show for Super Bowl XXXVI, but the NFL ultimately selected U2 after a group of NFL owners and officials attended the band's concert in New York City shortly after the September 11 attacks.[4] In September 2003, the NFL chose Jackson as the headline performer of the Super Bowl XXXVIII halftime show.[5] Because the event was occurring during an election year, MTV decided that the show's theme would heavily focus on the network's \"Choose or Lose\" campaign, which encouraged younger viewers to be politically active and register to vote.[6]\n\nTimberlake had attended Jackson's Rhythm Nation Tour as a kid, and Jackson's energetic dance routines and daring performing style had made a deep impression on him.[7] While Timberlake was a member of pop group 'N Sync, Jackson selected the boy band as the opening act for many dates of her blockbuster Velvet Rope World Tour, which helped promote and introduce the then-relatively unknown group and Timberlake to the public worldwide.[8] While on the tour, Jackson further promoted the group by performing with 'N Sync on several dates, including joining the group for a live a cappella duet of Stevie Wonder's \"Overjoyed\".[9] Following the tour, Timberlake and Jackson became \"good friends\", with Jackson also praising Timberlake.[10] Timberlake recreated Jackson's \"That's the Way Love Goes\" video with 'N Sync and was inspired by Jackson's performing style.[11] When asked who he thought was \"the sexiest woman on the planet\", Timberlake had said \"I've thought Janet Jackson has nothing but sex appeal, so I'd probably say her.\"[12] Timberlake later asked Jackson to sing backing vocals on \"(And She Said) Take Me Now\", a song from his debut solo album Justified.[13][14]\n\nAt Live Aid 1985 Mick Jagger ripped off Tina Turner's skirt on stage, an event that created widespread media publicity.[15]\n\nIncident [ edit ]\n\nDuring the halftime show at Super Bowl XXXVIII, Jackson performed a medley of hits, beginning with \"All for You\", \"Rhythm Nation\" and a brief excerpt of \"The Knowledge\". Surprise guest Timberlake then appeared onstage to perform a duet of his song \"Rock Your Body\" with Jackson.[16][17] The performance contained several suggestive dance moves by both singers. As Timberlake reached his final line of \"Rock Your Body\" (\"Gonna have you naked by the end of this song\"), he pulled off a part of Jackson's costume; the move revealed Jackson's right breast—adorned by a sun-shaped nipple shield—for less than a second, after which the CBS broadcast immediately cut to a wide shot of the stage for a pyrotechnic effect, then to an aerial view of Reliant Stadium.[18]\n\nResponses [ edit ]\n\n\"It's truly embarrassing for me to know that 90 million [140 million] people saw my breast, and then to see it blown up on the Internet the size of a computer screen [...] But there are much worse things in the world, and for this to be such a focus, I don't understand.\" – Jackson on Super Bowl incident.[19]\n\nThe baring of Jackson's breast during the Super Bowl performance became referred to as a \"wardrobe malfunction\".[20]\n\nFollowing the Super Bowl, both MTV and CBS apologized for the incident and asserted that they had no prior knowledge that Jackson and Timberlake's duet would involve partial nudity.[21][22] MTV's CEO Tom Freston claimed in an interview with the Reuters news agency that the exposure was a stunt orchestrated by Jackson.[23] However, an MTV representative confirmed that the costume tear was conceptualized by the MTV staff, but added that nudity was not the intended result.[24] The incident was publicly criticized by NFL Commissioner Paul Tagliabue,[25] FCC Chairman Michael Powell,[26][27] and NFL Executive Vice President Joe Browne.[21] An hour-long MTV documentary titled \"Making the Super Bowl Halftime Show\" as part of its Making the Video series was pulled from the schedule before it could air.[28][29]\n\nJackson's representative explained the incident, saying, \"Justin was supposed to pull away the rubber bustier to reveal a red lace bra. The garment collapsed and her breast was accidentally revealed.\"[30] According to Rolling Stone, CBS required Jackson to make a public apology for the incident.[31] Jackson released a video apology in which she said, \"The decision to have a costume reveal at the end of my halftime show performance was made after final rehearsals. MTV was completely unaware of it. It was not my intention that it go as far as it did. MTV, CBS, [and] the NFL had no knowledge of this whatsoever and, unfortunately, the whole thing went wrong in the end. I apologize to anyone offended, including the audience, MTV, CBS and the NFL.\"[22] Speaking to USA Today, Jackson said she felt humiliated that tens of millions of people saw her exposed breast, but did not feel the outrage was justified.[19] Regarding continued backlash, she responded, \"Who knows...Maybe they'll get mad at something that I do in my show, but at least it won't be new to me, since I've already gone through all of this. But I feel very positive that things are going to work out just fine. Everything happens for a reason.\"[19]\n\nJackson later briefly discussed the incident on Good Morning America and the Late Show with David Letterman. Jackson's outfit was designed by famed designer Alexander McQueen, with Jackson later commenting, \"I don't blame him; he didn't rip it. Alexander is so great at what he does—he's a genius.\"[32] In January 2018 it was revealed that Jackson asked Marcello Garzon to alter the leather outfit she brought to Houston to wear during the halftime show and signed a confidentiality agreement before altering the garment.[33]\n\nIn an interview with Australia's Herald Sun, Producer Jimmy Jam revealed Jackson considered writing a song about the incident for her Damita Jo album.[34]\n\n\"[The furor] is hypocritical, with everything you see on TV. There are more important thing to focus on than a woman's body part, which is a beautiful thing. There's war, famine, homelessness, AIDS. [...] They needed something to focus on instead of the war, and I was the perfect vehicle for that. [...] People are going to think what they want. It was an accident. It was not a stunt.\" – Jackson questioning media's focus on the event.[19]\n\nMichael Musto of The Village Voice commented on the media's reaction to the incident, saying, \"Janet became a symbolic Joan of Arc to burn at the stake. I actually do think her breast was used as a diversionary tactic—I'm not sure to distract from Iraq specifically—but it did distract from important issues, from things we actually should be appalled by. The story got an undue amount of attention when the fact is nobody has proved how her breast harmed anyone.\"[35] Speaking to Robert Tannenbaum of Blender Magazine, Jackson had strong, if guarded, views on the reactions, reiterating her embarrassment at being exposed but argued that there was no sense in complaining about part of a woman's body while world events as grim as war and disease occurred.[36] Jackson declared the reaction to the accidental exposure as \"contradictory\", noting it to occur in an era where commercials for beer and Viagra are both \"very sexual\" and \"practically omnipresent\".[35] Jackson also said the mishap was \"not intentional\" and a \"costume accident\", also commenting on some media outlets editing her taped apology, saying, \"Sometimes they cut out that I said it was an accident...That's what the media does, that's the way they are because they want it to be told a different way.\"[37] In Glamour Magazine, Jackson exclaimed, \"It's hard to believe that there's a war and famine going on in the world and yet people made such a big deal about a breast. People said that it was done intentionally to sell records. Do you know what? I have never pulled a stunt. Why would you do that and have your album come out two months later? It doesn't make sense.\" In the ensuing months, Jackson felt overwhelmed by the hostility towards her. \"People think I'm immune to being hurt by what's said. They ask me questions that shock me. Not everybody is as strong as the next person and words can kill. People push you and you start to think can I handle this? But I know I can.\"[38]\n\nImmediately following the incident, Timberlake sounded unapologetic for his actions, telling Access Hollywood, \"Hey man, we love giving you all something to talk about.\"[39] Timberlake later released a statement saying, \"I am sorry that anyone was offended by the wardrobe malfunction during the halftime performance of the Super Bowl. It was not intentional and is regrettable.\"[21] Timberlake also addressed the incident at the Grammy Awards the following week, saying, \"I know it's been a rough week on everybody. What occurred was unintentional, completely regrettable and I apologize if you guys are offended.\"[31] Timberlake gave an additional interview at the Grammy event and stated, \"All I could say was, 'Oh, my God. Oh, my God,'\" Timberlake said. \"I looked at her. They brought a towel up on stage. They covered her up. I was completely embarrassed and just walked off the stage as quickly as I could. I'm frustrated at the whole situation. I'm frustrated that my character is being questioned.\"[40]\n\nMedia diversion theories [ edit ]\n\nJackson suspected ulterior motives in the media's reaction, expressing, \"It was just perfect timing to take people's focus off of other things. That's what happens, and it happened to me.\"[19] Comments from Michael Rich, director of Harvard's Center on Media and Child Health; Jay Rosenthal, attorney for the Recording Artists' Coalition; and Simon Renshaw of management group The Firm expressed similar sentiments.[41] The Boston Legal episode \"Let Sales Ring\" likened the incident to being used as a distraction, portraying a news corporation which used the mishap to attract attention over other important events in the media.[42] Daniel Kreps of Rolling Stone opined, \"For the FCC, Nipplegate provided an opportunity to restore order and flex whatever power they had left. Faced with lax broadcast standards for cable TV and satellite radio, as well as the absolute lawlessness of the Internet, the FCC becomes hell-bent on preserving common decency in the family-friendly realm of network television... While the aftermath of Nipplegate starts to fade, the FCC will continue to carry its torch for the next half-decade.\"[43] Cynthia Fuchs of Popmatters stated, \"It behooves TV producers and consumers to focus their attentions on significant \"news\", rather than the daily distractions offered up by politicians, performers, professional spinners, and journalists. Janet is not that person you watch on TV. And neither is anyone else.\"[44]\n\nPowell's response [ edit ]\n\nA decade after the incident, former FCC chairman Michael Powell gave his first interview regarding Jackson's performance, saying Jackson was treated unfairly and the controversy, including his own reaction, was completely overblown. Powell stated, \"I think we've been removed from this long enough for me to tell you that I had to put my best version of outrage on that I could put on. Part of it was surreal, right? Look, I think it was dumb to happen, and they knew the rules and were flirting with them, and my job is to enforce the rules, but, you know, 'Really? This is what we're gonna do?' ⁠\" Powell also said the treatment of Jackson, who was lambasted for causing \"an outrageous stunt\", was unfair, and commented on Timberlake not receiving the same backlash. \"I personally thought that was really unfair\", he said. \"It all turned into being about her. In reality, if you slow the thing down, it's Justin ripping off her breastplate.\"[45]\n\nPublic reaction [ edit ]\n\nUnited States [ edit ]\n\nIn the United States, the exposure of Jackson's breast by Timberlake led to much media attention and headlines. The incident was sometimes referred to as \"Nipplegate\".[46][47] The socially conservative media watchdog group Parents Television Council (PTC) issued a statement condemning the halftime show, and called on PTC members to file indecency complaints with the FCC.[48] In addition, the FCC received nearly 540,000 complaints from Americans,[49] with the PTC claiming responsibility for around 65,000 of them.[50] (In its appeal to the Third Circuit Court of Appeals, CBS disputed how many of the complaints were filed by individual, non-organized viewers.)[51] Columnists Phyllis Schlafly[52] also expressed criticism of the halftime show in their weekly columns. Democratic senator Zell Miller of Georgia, both on the floor of the United States Senate[53] and in an editorial on Salon.com,[54] denounced the halftime show as an example of declining morality in America. The day immediately following the Super Bowl, then-FCC chairman Michael Powell ordered an investigation into the halftime show.[20] However, an Associated Press poll conducted nearly three weeks after the Super Bowl found that although 54% of American adults considered the exposure distasteful, only 18% supported the FCC's investigation.[55] Film director Spike Lee, speaking at Kent State University at Stark on February 3, called the incident a \"new low\" in entertainment.[46] Democratic presidential candidate Howard Dean called the FCC's investigation \"silly\", commenting: \"I think the FCC probably has a lot of other things they should be pursuing.\"[56]\n\nThe Super Bowl controversy was also a subject of humor on late-night talk shows. For example, CBS's own Late Show with David Letterman mocked the incident all week following the Super Bowl. The day after the Super Bowl, host David Letterman joked that he \"was happy to see this thing happen ... because that meant for one night I wasn't the biggest boob on CBS\".[57] The next day, he also joked that President George W. Bush formed a \"Department of Wardrobe Security\" to prevent further wardrobe malfunctions.[58] On February 4, Letterman opened his monologue by joking about having a wardrobe malfunction[59] and referenced the incident in this night's Top Ten List.[60] Jackson's appearance on the Late Show the following month increased the show's ratings 20% from the program's usual weeknight opener.[61] Larry King also stated Jackson jokingly gave him a pair of suspenders with open holes around the nipples, commenting \"I wore them once, they were cute.\"[62]\n\nThe halftime show continued to be a subject of discussion in 2005. The parody newspaper The Onion ran a lead article on January 26, 2005 entitled \"U.S. Children Still Traumatized One Year After Seeing Partially Exposed Breast On TV\". The article's satirical target was the nation's reaction to the incident rather than the incident itself.[63] On February 1, 2005, exactly one year after the halftime show, the PTC released a report titled MTV Smut Peddlers: Targeting Kids with Sex, Drugs, and Alcohol, covering MTV programming during the network's \"Spring Break\" week from March 20 to 27, 2004, accusing MTV of irresponsibly promoting sex, drugs and alcohol to impressionable youth. In response to the report, MTV network executive Jeannie Kedas argued that the report \"underestimates young people's intellect and their level of sophistication.\"[64] On February 6, New York Times columnist Frank Rich argued that censorship on television was becoming more prevalent following the halftime show. Examples he cited included PBS editing obscene language out of certain programs such as the British terrorist drama Dirty War and more than 60 ABC-affiliated stations (including those owned by the Sinclair Broadcast Group, E. W. Scripps Company, Hearst-Argyle Television and Cox Broadcasting) refusing to broadcast Saving Private Ryan due to the profanity prevalent throughout the film. (The latter, which would later be ruled by the FCC to not violate regulations, would air on cable afterwards to avoid controversy.)[65] The ESPN series Playmakers was also canceled following the incident.[66][67] A commercial from Budweiser, which depicted a man opening a beverage on the outfit's breastplate and tearing it before it was worn, was intended to be aired during Super Bowl XXXIX the following year, but was pulled before its broadcast.[68][69]\n\nCanada [ edit ]\n\nIn Canada, where the Super Bowl telecast was broadcast by the Global Television Network, the incident passed largely without controversy: only about 50 Canadians complained about the incident to the Canadian Broadcast Standards Council (CBSC).[70] The CBSC received roughly twice as many complaints about other aspects of the Super Bowl broadcast, including music and advertising issues (though some were expected complaints about Canadian content/simsub issues preventing viewing of the popular American advertisements, which is a common issue among Canadian viewers of the Super Bowl to the present day).[71] Professor Robert Thompson, director of the Center for the Study of Popular Television at Syracuse University, stated: \"I know many people in other countries are scratching their heads and thinking 'What in the world is the big fuss over there?'\"[72]\n\nNew Zealand [ edit ]\n\nNew Zealand news outlets re-broadcast the \"nipplegate\" moment (some in slow motion) with commentary explaining that US ultra-conservatives had made the incident into a major controversy. The nation's largest newspaper, the New Zealand Herald, ran an op-ed from a New Zealander living in America detailing his bafflement at his American friends, who had expressed outrage at the glimpse of a nipple while supporting their country's invasion of Iraq and being fans of the television show Sex and the City.[73]\n\nLegal action [ edit ]\n\nOn February 4, Terri Carlin, a banker residing in Knoxville, Tennessee, filed a class action lawsuit against Jackson and Timberlake on behalf of \"all American citizens who watched the outrageous conduct\". The lawsuit alleged that the halftime show contained \"sexually explicit acts solely designed to garner publicity and, ultimately, to increase profits for themselves\". The lawsuit sought maximum punitive and compensatory damages from the performers. Carlin later dropped the lawsuit.[74] Three months later, Eric Stephenson, a lawyer from Farmington, Utah, filed a US$5,000 lawsuit in small-claims court against Viacom for false advertising of the Super Bowl halftime show, as he, the father of three young children, claimed that pre-game advertising led him to believe that the halftime show would consist of marching bands, balloons and a patriotic celebration.[75] The lawsuit was rejected because Stephenson should have filed a federal lawsuit or complaint to the FCC, which was already investigating the halftime show.[76]\n\nAmerica Online, the Internet service provider that sponsored the halftime show, demanded a refund of the approximately US$7.5 million that it paid to sponsor and advertise on the halftime show. However, no other advertisers of the Super Bowl had similar demands.[77]\n\nThe halftime show led to a great spike in FCC-issued fines and received complaints compared to those from previous years.\n\nThe incident triggered a rash of fines that the FCC levied soon after the Super Bowl, alleging that the context of the \"wardrobe malfunction\" was intended \"to pander, titillate and shock those watching\" because it happened within the lyrics within Timberlake's performance of Rock Your Body: \"Hurry up 'cause you're taking too long ... gonna have you naked by the end of this song.\"[78] In addition, the FCC cited a news article on MTV's website (MTV.com) claiming that the halftime show would promise \"shocking moments\"[79] and that \"officials of both CBS and MTV were well aware of the overall sexual nature of the Jackson/Timberlake segment, and fully sanctioned it—indeed, touted it as 'shocking' to attract potential viewers\".[78] CBS, however, argued that the exposure was unplanned,[80] although in later statements CBS asserted that while the exposure was unplanned by CBS, it was deliberately planned by Timberlake and Jackson \"independently and clandestinely\".[81] On September 22, 2004, the FCC fined Viacom the maximum penalty of US$27,500 for each of the 20 CBS-owned television stations (including satellites of WFRV in Green Bay, WCCO in Minneapolis and KUTV in Salt Lake City; current CBS owned-and-operated station KOVR in Sacramento at the time was owned by the Sinclair Broadcast Group) for a fine totaling US$550,000, the largest ever placed against a television broadcaster at that time.[82][83] However, the Parents Television Council[84] and even some of the FCC commissioners[78] criticized the Commission for fining only 20 CBS stations, not all of them, for the halftime show. 66% of respondents to a March 2005 Time magazine poll believed that the FCC overreacted to the halftime show by fining CBS.[85]\n\nOn November 24, 2004, Viacom paid out US$3.5 million to settle outstanding indecency complaints and stated that it would challenge the US$550,000 penalty related to the incident, on the grounds that the broadcast was unintentional and thus exempt from indecency regulation.[86] In March 2006, the FCC affirmed that the Super Bowl halftime show was indecent,[87] so CBS paid the FCC's issued fine in July 2006 in order to take their appeal against their fine to federal court.[88] CBS appealed the fine on September 17 at the U.S. Third Circuit Court of Appeals in Philadelphia.[89]\n\nOn July 21, 2008, the Third Circuit Court of Appeals ruled[90] in favor of CBS, voiding the FCC's fine on the grounds that the enforcement involved a significant deviation from prior practice that was not issued as a clear policy change.[91][92][93] On May 4, 2009, however, the Supreme Court vacated and remanded the case back to the Third Circuit for reconsideration in light of the previously decided Federal Communications Commission v. Fox Television Stations (2009).[94][95]\n\nOn November 2, 2011, the Third Circuit Court ruled 2–1 that its earlier decision was correct, citing that the broadcast was legal under the FCC's then-current policy of allowing \"fleeting\" indecency on the airwaves, and that it was unfair of the FCC to change the policy retroactively.[96][97] On June 29, 2012, the Supreme Court declined an FCC appeal.[98][99]\n\nOther controversies [ edit ]\n\nCommercials [ edit ]\n\nPrior to the broadcast, CBS rejected the MoveOn.org Super Bowl ad Bush in 30 Seconds because it was deemed too controversial. CBS stated that it had a \"decades-old\" policy of rejecting advertisements regarding \"controversial issues of public importance\", although MoveOn charged that the networks had previously accepted similar advertisements from other groups.[100] The Super Bowl broadcast contained numerous commercials for erectile dysfunction medicines and advertisements for Anheuser-Busch's Bud Light brand featuring a flatulating horse and a dog attacking male genitalia; however, no politically charged advertisements appeared during the telecast.[101] CBS, which also held the rights to Super Bowl XLIV, later aired a commercial during that game featuring then-Florida Gators quarterback Tim Tebow and his mother that discreetly refer to their anti-abortion viewpoints. The ad, sponsored by Focus on the Family, received similar controversy.[102][103] In a league-mandated policy meant to clear the airwaves of such advertisements, the NFL banned those types of commercials from Super Bowl broadcasts (the league ended an advertising relationship with Levitra in March 2007 as an official league sponsor).[104]\n\nIn January 2005, Fox, the network that carried Super Bowl XXXIX under the NFL's alternating network contract for the championship game, rejected an advertisement for the cold remedy Airborne that briefly showed the naked buttocks of veteran actor Mickey Rooney.[65]\n\nStreaking [ edit ]\n\nMoments after the Jackson-Timberlake tangle, streaker Mark Roberts added to the controversial halftime by running around the field naked except for a well-placed G-string attached to half of a miniature football. Part of Roberts' stunt was broadcast in the United States before players from both teams tackled him, allowing stadium security and police to take Roberts into custody.[105]\n\nOther performers [ edit ]\n\nAside from Jackson's exposure, minor controversy was created when rapper Nelly performed his song \"Hot in Herre\" when a group of female backup dancers all pulled the top-layer of their costumes off, revealing shorter shorts and smaller shirts underneath.[106] Kid Rock appeared in a poncho made from a slit American flag, which he later threw towards the audience.[46][107] U.S. Senator Zell Miller complained that Kid Rock's outfit was a desecration of the American flag.[108]\n\nAftermath and effects [ edit ]\n\nCensorship and regulation of broadcasting [ edit ]\n\nWebsite Soap Opera Central speculated that the fallout from this incident may have had a subtle effect on daytime television. These television shows are known for \"love in the afternoon\" and regularly depict romantic couplings; shortly before the Super Bowl, the Procter & Gamble soap operas As the World Turns and Guiding Light had gone as far as featuring rear male nudity during sexual scenes. After the Super Bowl controversy, FCC commissioner Michael J. Copps stated that it was time for a crackdown on inappropriate sexual content in daytime television, and indicated that he was reviewing whether soap operas were violating the agency's indecency prohibitions.[109] In The NewsHour with Jim Lehrer, NewsHour correspondent Tom Bearden reports the excerpts from hearings today on regulating broadcast decency.[110]\n\nTwo other major sporting events that followed the Super Bowl that year also changed their respective halftime shows following the incident. At the Pro Bowl, which would be played on February 8 at Aloha Stadium in Hawaii, singer JC Chasez, a member of boy band 'N Sync as was Timberlake, was to sing the National Anthem before the game and perform his hit song \"Blowin' Me Up (with Her Love)\" at halftime. However, the NFL did not allow Chasez to perform during halftime due to the sexually suggestive content of his chosen song (even though the game was carried by ESPN, which is not under the content purview of the FCC as it is a cable network, and therefore only self-regulates content as an advertiser-supported service), replacing it with traditional Hawaiian hula dancers.[111][112] The 2004 NBA All-Star Game also changed its act, despite being broadcast on TNT (which is not bound by FCC content regulations as a cable network), having halftime performer Beyoncé perform \"Crazy in Love\" instead of \"Naughty Girl\", which they feared would incite controversy given its sexual content. Jackson was in attendance at the game, and dressed conservatively.[113] The networks that were to broadcast the 46th Grammy Awards (CBS) and the 76th Academy Awards (ABC), live events scheduled for February 8 and February 29 respectively, enhanced their broadcast delays to accommodate editing of inappropriate video in addition to audio.[114][115]\n\nGuiding Light[clarification needed] edited out nudity from an episode that had already been taped. A week later, the show's executive producer John Conboy was fired and replaced by Ellen Wheeler. All nine American network soaps began to impose an unwritten rule of avoiding any sort of risqué adult scenes, and in the months following, editors of soap opera periodical Soap Opera Digest wrote about how daytime television was losing its steam.[109] NBC also re-edited a scene from an episode of its medical drama ER where paramedics were wheeling an elderly woman into the hospital, and her breast could be seen in the context of her injury and treatment.[116] Even as late as Veterans Day (November 11) of 2004, 65 ABC-affiliated stations pre-empted the uncut network presentation of the film Saving Private Ryan over concerns about the film's violent content and FCC regulations. Benjamin Svetkey of Entertainment Weekly quoted L. Brent Bozell III and Peggy Noonan associating the mass pre-emption of the film with the halftime show incident.[117] The annual Victoria's Secret Fashion Show was cancelled for that year in reaction to the incident.[118]\n\nA petition was filed by a consortium of broadcasters (which included Viacom) and the RIAA over an FCC indecency ruling, regarding fleeting expletives uttered by Bono of U2 when accepting an award at the 60th Golden Globe Awards in 2003. It argued that the FCC had implemented a standard \"that would allow it to censor all kinds of things—anything considered blasphemous, coarse or vulgar\", and observed that many radio stations, especially rock-formatted stations, had been engaging in self-censorship by censoring or removing songs from their libraries, so that they would not run afoul of the stricter regulation.[119] Clear Channel Communications removed talk-radio host Howard Stern from several of its large-market radio stations within a month of the incident, citing the raunchy content of Stern's show. The FCC fined Clear Channel over allegedly indecent content on the Bubba the Love Sponge radio show.[120] As a result of the incident, some networks established regulations requiring time delays of as much as five minutes for live broadcasts such as awards shows and sporting events.[121] In late 2004, the United States House of Representatives passed a bill to raise the maximum FCC fine penalty from said US$27,500 to US$500,000 per violation; the United States Senate voted to decrease it to US$275,000 per incident, with a cap of US$3 million per day.[82] By June 2006, the two houses reconciled the differences in fine levels, settling for a fine of US$325,000 per violation in the Broadcast Decency Enforcement Act of 2005.[122]\n\nThe incident also prompted tighter control over content by station owners and managers. Viacom, at the center of the controversy, also employed the controversial Howard Stern in its radio division (at the time called Infinity Broadcasting). The expanding control on content is said to be a contributing factor that drove Stern away from terrestrial radio and onto Sirius Satellite Radio, and is sometimes credited as the media figure most responsible for introducing a new era in radio.[24] It has also been reported that some teen-oriented awards shows in the summer of 2004 had also been purged of most sexual and profane content that had been perceived as staples in such awards telecasts in the past, including Fox's Teen Choice Awards and MTV's self-created Video Music Awards.[123] Author Frederick S. Lane stated in an interview with John Eggerton of Broadcasting & Cable magazine that the controversy surrounding the halftime show was the primary inspiration for his 2006 book The Decency Wars: The Campaign to Cleanse American Culture, which explains moral controversies in the American media over the years.[124]\n\nBeginning with Super Bowl XXXIX in 2005, the halftime show began to be produced by Don Mischer Productions and White Cherry Entertainment; those shows contained classic rock artists who mainly performed songs from the 1970s and 1980s (with a notable exception being Bruce Springsteen and the E Street Band performing their 2008 single \"Working on a Dream\" during the Super Bowl XLIII halftime show in 2009). This practice ended after Super Bowl XLIV in 2010; beginning with Super Bowl XLV in 2011, the halftime performance returned to having pop artists.\n\nIn 2012, during the halftime show for Super Bowl XLVI, rapper M.I.A. pointed up her middle finger during her performance. That incident drew comparisons with the exposure of Janet Jackson's breast in the Super Bowl halftime show eight years prior. The Associated Press asserted that people learned what M.I.A. did only when reports surfaced in the media and quoted TV critic James Poniewozik: \"I had no idea she even did it until NBC issued an apology for it.\"[125] NBC blurred the entire screen albeit a second too late to obscure M.I.A. giving the finger.[126] The NFL ultimately sued M.I.A. for US$1.5 million on breach of contract grounds.[24] The lawsuit was settled in August 2014 and the terms of the settlement remained private.[127] As an indication of the reduced level of complaints, only 222 complaints were filed over the incident.[128]\n\nSports broadcasting [ edit ]\n\nSports would be greatly affected by the controversy. Three weeks later, NASCAR stiffened penalties on use of improper language or gestures including larger fines, loss of points (if it occurred in a post-race interview or after the driver fell out of a race), ejection of a team from the race, or lap penalties (if in-race) under the circuit's \"detrimental to NASCAR\" rule.[129] Johnny Sauter was fined US$10,000 and 25 points a week after the new rule took effect for obscene language in an interview.[130] Later in 2004, Dale Earnhardt Jr. received a 25-point penalty and a US$50,000 fine when he used an obscenity after winning the 2004 EA Sports 500 at Talladega Superspeedway.[131] He lost the championship lead after that incident and lost the championship by 100 points. In 2007, Tony Stewart received a similar penalty after using an obscenity in a post-race interview following his Brickyard 400 win. Kyle Busch, in November 2010, was fined US$25,000 for an obscene gesture caught on ESPN, along with an in-race two-lap penalty, as the gesture was aimed at a NASCAR official.[132]\n\nThe NFL also came under some smaller controversies over its telecasts. The FCC received a complaint about Fox's telecast of a January 2005 playoff game between the Green Bay Packers and Minnesota Vikings; the complainant alleged that Minnesota player Randy Moss, who scored a touchdown, apparently made movements appearing to moon the spectators. However, the FCC denied the complaint because Moss was fully clothed at all times, and his gestures were shown for only a few seconds, thus warranting that the display was not indecent; game commentator Joe Buck also immediately condemned the act (and additionally, Moss was fined by the NFL).[133] On January 13, 2007, during Fox's coverage of an NFL playoff game between the New Orleans Saints and Philadelphia Eagles, the camera cut to the stands, showing for four seconds a shirt with the words \"Fuck DA EAGLES\" that was worn by a female spectator. That drew a backlash from the Parents Television Council, which filed complaints with the FCC.[134]\n\nDuring NBC's live broadcast of Super Bowl XLIII on February 1, 2009, the five-year anniversary of the original incident, affiliate KVOA-TV's analog broadcast feed (the high definition feed of the station was unaffected) over Comcast's Tucson, Arizona system was interrupted by an unknown party, when an excerpt of a film aired by adult cable channel Shorteez was broadcast for 30 seconds to local Comcast subscribers just after Larry Fitzgerald scored his fourth-quarter touchdown to take the Cardinals to a 23–20 lead. Afterwards, 10 seconds of an end credit segment from ClubJenna (which, like Shorteez, is owned by Playboy Enterprises) was shown.[135] Comcast offered a US$10 credit for customers who claimed to have seen the incident,[136] and the Federal Communications Commission investigated the cause of the incident. E! Online columnist Josh Grossberg stated: \"This almost makes us nostalgic for the days of Nipplegate.\"[137]\n\n2004 presidential election [ edit ]\n\nFrederick S. Lane argued in his 2006 book The Decency Wars that the Super Bowl halftime show controversy influenced the primary focus on \"moral values\" and \"media decency\" in the 2004 Democratic Party primaries.[138] Jackson claimed the incident was used in the media as a diversion for President George W. Bush's poor approval ratings and the Iraq War, with Bush and First Lady Laura Bush giving public commentary on the incident rather than focusing on other issues.[36]\n\nImpact on Jackson [ edit ]\n\n\"[We are] absolutely bailing on the record [...] The pressure is so great, they can't align with anything related to Janet. The high-ups are still pissed at her, and this is a punitive measure.\" \"[...] radio wouldn't play it and MTV wouldn't play her videos for \"I Want You\" and \"All Nite\", two songs that would've been out-of-the-park hits at any other point in Jackson's career.\" – Viacom revealing Jackson's blacklist; commentary from The Charlotte Observer[36]\n\nViacom CEO Les Moonves ordered that Janet Jackson's singles and music videos be blacklisted from all of its properties, including CBS, MTV, and its radio station group Infinity Broadcasting.[139] Jackson was intended to appear at the 46th Grammy Awards, which was being held the following week and televised by CBS, but her invitation was withdrawn due to the incident. Jackson was originally scheduled to appear as a presenter for a tribute to Luther Vandross, performed by Celine Dion, Richard Marx and Alicia Keys, and was chosen due to previously collaborating with Vandross on the number-one hit \"The Best Things in Life Are Free\". According to People Magazine, Jackson \"had been slated to speak before the accolade but was being pressured to bow out gracefully—or face being uninvited\", before later being completely barred from attending. However, Timberlake was still allowed to attend and perform at the event.[140][141] Both Jackson and Timberlake were initially disinvited[142] and later re-invited under the condition that they agree to apologize on air.[143] The majority of the artists at the ceremony were also asked to comment on Jackson's incident.[144] Jackson's long-time producer Jimmy Jam during a pre-Grammy party \"Last time I talked to her about it, she was up in the air about it\", Jam told CNN. \"She was literally sitting on the fence about whether she was going to come or not, or whether she was going to sit back and watch it on TV.\".[145]\n\nJackson had also been cast to play Lena Horne in a movie about the singer and activist's life, which was to be produced by ABC, but was forced to resign following the performance incident.[30] A statue of Mickey Mouse wearing Jackson's iconic \"Rhythm Nation\" outfit was mantled at Walt Disney World theme park the previous year to honor Jackson's legacy, but was removed following Jackson's controversial performance. A spokesman for Disney said, \"Considering all the controversy [the performance] drew, we talked it over for a couple of days and decided it would be best to replace hers with a new one.\"[146]\n\nThe blacklisting affected promotion of Janet Jackson's first album released since the incident Damita Jo—her eighth studio album. A majority of the reviews for the album, including those by AllMusic, the BBC, Entertainment Weekly, The Guardian and The New York Times focused on the negative backlash suffered by Jackson as a result of the incident but gave favorable reviews to the album itself.[147][148][149] Despite the blacklisting, Damita Jo was a success and certified Platinum, selling over three million copies worldwide and also receiving a Grammy nomination. Singles from the album like \"Just a Little While\" and \"All Nite (Don't Stop)\" reached #1 on the Hot Dance Club Songs chart. Although receiving positive reception, the incident also affected the performance of following albums 20 Y.O. and Discipline due to the blacklist. However, 20 Y.O. managed to sell over 1.5 million copies worldwide, was certified Platinum in the US and received a Grammy nomination.[16][150] Additionally, \"Feedback\" reached the top 20 pop hit on the Billboard Hot 100, selling one million copies worldwide. Subsequent releases \"Make Me\" peaked atop the Hot Dance Club Songs and top 20 internationally; \"Nothing\" reached #1 on the digital pop and music video charts, also considered for an Oscar nomination.[36][43][151]\n\nIn her first interview since the incident, Jackson appeared on CBS's Late Show with David Letterman on March 29, 2004, which increased the show's ratings over 20%.[152] In April 2004, Jackson poked fun at herself in an appearance on Saturday Night Live, first while playing Condoleezza Rice in a skit, nervously answering a question by exposing her right breast (which was pixelated by NBC), and again by viewing a mock home video from her childhood in which her bathing suit top came off in a wading pool, calling it a \"swimsuit malfunction\".[153] An NBC spokesman said Jackson was wearing a bra beneath her blouse during the skit.[154] During a performance on ABC's Good Morning America, the network promoted Jackson's appearance as her \"first live performance since the Super Bowl\", hinting at the chance of shock value.[36] In 2006, during an interview on The Oprah Winfrey Show, Jackson upheld her claim that the Super Bowl scandal was an accident.[155]\n\nImpact on Timberlake [ edit ]\n\nPeople Magazine stated Timberlake was referred to as \"the Teflon man\" at the 46th Annual Grammy Awards because the incident did not affect him as it did Jackson.[30] Media coverage overwhelmingly minimized Timberlake's role, largely mentioning him only in passing, if at all.[156] In a 2006 interview with MTV, Timberlake said that compared to the huge backlash Jackson suffered, he himself received only about 10% of the blame; and he accused American society of being both \"harsher on women\" and \"unfairly harsh on ethnic people\".[157] Prior to plans for the Super Bowl performance, Jackson and Timberlake had discussed potentially recording a duet for Jackson's Damita Jo album, as well as a rumored collaboration for a Quincy Jones album, though neither came to fruition.[158][159] In November 2013, Timberlake performed a cover of Jackson's \"Let's Wait Awhile\" on The 20/20 Experience World Tour before transitioning into one of his song which was regarded as a sign of affection or apology to Jackson.[160]\n\nMedia commentators stated Jackson was treated too harshly by the media and public, while Timberlake's career was not affected much by the incident. Shannon L. Holland in Women's Studies in Communication argued that the media reaction after the incident focused disproportionately on Jackson, \"represent[ing] her as a contemporary Jezebel in that her racial and gendered Otherness was often juxtaposed with the 'normalcy' of Timberlake's white masculinity. That is, she emerged in a public discourse as the primary (if not sole) instigator of the lewd act, a scheming seductress who manipulated Timberlake for her own economic gain.\"[161] Rob Sheffield of Rolling Stone stated \"Justin isn't exactly Mr. Loyalty—he totally left Janet Jackson to take the heat after the Super Bowl.'\"[162] E! Online also commented \"Timberlake wasted no time placing the bulk of the blame for the incident on Jackson. And, of course, the woman takes the blame even though the man stripped her. Pathetically typical.\"[40][163] A reporter for VH1 said \"JT still gets a side eye for leaving her out to dry.\"[164]\n\nOne observer claimed \"Despite her 'wardrobe malfunction'—for which we think Justin Timberlake wasn't punished nearly as severely for—Janet put on a pretty amazing show.\"[165] The New York Times noted \"[a]fter her right breast upstaged the Super Bowl, she was criticized by the first lady, vilified by media executives and abandoned by her co-conspirator, Justin Timberlake; less excitable commentators suggested she was merely a shrewd publicity-stunt woman with a new album to promote.\"[149] Jackson's parents, Joe and Katherine Jackson, also expressed concern that Timberlake did not stand by Janet following the incident, commenting, \"What I didn't like is there wasn't one person on that stage, there were two people. After a while, there was only Janet Jackson. That's all there was. Janet Jackson\", adding \"Janet don't [sic] pull that thing open herself. He did it. We were surprised that they didn't say anything to Justin about it.\"[166]\n\nTimberlake would eventually be given a \"second chance\", being invited back to the Super Bowl halftime show when he was named headlining act for the Super Bowl LII halftime show in February 2018.[167] During his performance, Timberlake again sang a portion of \"Rock Your Body\", but stopped right before reaching the \"Gonna have you naked by the end of this song\" lyric, saying \"hold up! Stop!\" and smiling,[168] as a reference to the 2004 incident.[169][170]\n\nOn June 12, 2009, in an interview with Entertainment Weekly, Timberlake stated his biggest regret of the decade was not defending Janet Jackson more after the media backlash. “I wish I had supported Janet more. I am not sorry I apologised, but I wish I had been there more for Janet,” he said.[171]\n\nOn February 12, 2021, after social media backlash from the documentary Framing Britney Spears aired, Timberlake publicly apologized to both Britney Spears and Janet Jackson in an Instagram post, pledging to \"take accountability\" and that \"I can do better and I will do better.\"[172]\n\nPopular culture [ edit ]\n\nPop singer Katy Perry parodied Jackson's Super Bowl incident in the music video for her single \"Last Friday Night (T.G.I.F.)\" during a scene where Perry's breast is accidentally exposed at a school event.[173] Jackson's incident is also recreated in Eminem's \"Ass Like That\" music video. The controversy and sexual nature surrounding Miley Cyrus' performance of \"We Can't Stop\" and \"Blurred Lines\"/\"Give It 2 U\" with guest artist Robin Thicke at the 2013 MTV Video Music Awards was likened to Jackson's performance with Timberlake at the Super Bowl event.[174]\n\nThe term \"wardrobe malfunction\" began to be used by various entertainers when describing accidental public exposures or nudity, or revealing outfits. The term's frequent usage also led to numerous entertainment outlets compiling various celebrity \"wardrobe malfunctions\", with Jackson included in the lists as the most infamous example and originator of the term.[175]\n\nOn the April 10, 2004 episode of Saturday Night Live, Janet Jackson as Condoleezza Rice is told by Darrell Hammond as Vice President Dick Cheney that she should show her breast at 9-11 hearings. It appears that she did, with her breast pixellated, but NBC said Jackson was wearing a bra.[176]\n\nJustin Timberlake referenced the incident when ripping off part of Kristen Wiig's outfit during an appearance on Saturday Night Live in 2009.[177] The Family Guy episode \"PTV\" was written as a parody of the FCC's strict measures and regulations following Jackson's Super Bowl halftime show performance controversy.[178] A scene from the episode involving the fictional portrayal of an extreme reaction to actor David Hyde Pierce having a wardrobe malfunction at the Emmy Awards was also a recreation and reference to the incident.[179] Jackson's performance is again referenced in a brief scene where Peter Griffin is dressed in Jackson's Super Bowl outfit and has his breast exposed by Justin Timberlake during the musical number \"The Freaking FCC\".[180] The song itself was introduced when Lois called the FCC in response to Peter's TV show antics. The episode received Primetime Emmy Award and Annie Award nominations for its subject matter. Jackson's performance also inspired the South Park episode \"Good Times with Weapons\". In the episode, the show's creators draw attention to the media and public's unnecessary reaction to Jackson's brief exposure while disregarding or accepting extreme acts of violence during a scene where the public is outraged when Eric Cartman is seen naked and having a \"wardrobe malfunction\" on stage, while character Butters Stotch is ignored although he is bleeding and severely injured. Several game shows have also mentioned Jackson's performance.\n\nSeveral presenters at award shows have referenced the incident, including Anna Nicole Smith at the first annual MTV Australia Video Music Awards, Dave Chappelle at the MTV Video Music Awards, and singer Alanis Morissette at the Juno Awards, commenting, \"It's disturbing and curious to me to see what came of that. We're all sexual beings, and if we don't let it out organically, we repress ourselves. If we repress anger, it turns to depression. If we repress our sexuality, it turns to pornography and rape. To think that the country was in an uproar because of a nipple.\"[123][181] Comedian Russell Brand referenced the incident when hosting the 2008 MTV Video Music Awards, saying \"I can almost guarantee a Janet Jackson-style Super Bowl nip slip.\"[182]\n\nLegacy [ edit ]\n\nThe performance incident made \"Janet Jackson\" the most searched term, event and image in Internet history.[183][184] Jackson was later listed in the 2007 edition of Guinness World Records as \"Most Searched in Internet History\" and the \"Most Searched for News Item\".[185] It also broke the record for \"most searched event over one day\".[186] 'Janet Jackson' also became the most searched term and person for 2004 and also of the following year.[187][188] It also set a record for being the most watched, recorded and replayed moment on TiVo.[189] A company representative stated \"The audience measurement guys have never seen anything like it. The audience reaction charts looked like an electrocardiogram.\"[190] Monte Burke of Forbes magazine reported, \"[t]he fleeting moment enticed an estimated 35,000 new [TiVo] subscribers to sign up.\"[191] Janet's Super Bowl halftime incident also coined the phrase \"wardrobe malfunction\", which was later officially added to the Webster's English Dictionary in 2008.[192] In the immediate aftermath of the incident, Entertainment Weekly stated \"Radio stations rushed to add Jackson's new single, \"Just a Little While\" to playlists on Monday following the incident [...] And USA Today reports that jewelry stores and piercing studios are seeing increased customer interest in silver sunburst-shaped nipple shields.\"[39]\n\nYouTube co-founders Jawed Karim, Steve Chen, and Chad Hurley revealed that their frustration at not being able to easily find a video clip of the incident provided the inspiration for the creation of YouTube.[193] The launch of Facebook commenced three days following the incident, in a potential attempt to capitalize on its publicity through social networking.[24]\n\nRolling Stone stated Jackson's Super Bowl performance \"is far and away the most famous moment in the history of the Super Bowl halftime show\".[194] PopCrush called the performance \"one of the most shocking moments in pop culture\" as well as a \"totally unexpected and unforgettable moment\".[195] Gawker ranked the performance among the most recent of the \"10 Shows that Advanced Sex on Television\", commenting the set \"had all the elements of a huge story\" and \"within seconds the world searched furtively for pictures\", concluding \"it remains so ubiquitous, it's impossible to look at a starburst nipple shield without thinking \"Janet Jackson\"\".[196] E! Online ranked it among the top ten most shocking celebrity moments of the prior two decades.[163] A study of television's most impactful moments of the last 50 years conducted by Sony Electronics and the Nielsen Television Research Company ranked Jackson's Super Bowl performance at #26. The incident was the only Super Bowl event on the list and the highest music and entertainment event aside from the death of Whitney Houston.[197] TV Guide Network ranked it at #2 in a 2010 special listing the \"25 Biggest TV Blunders\".[198] Complex stated \"It's the Citizen Kane of televised nip-slips—so unexpected, and on such a large stage, that nothing else will ever come close. If Beyoncé were to whip out both breasts and put on a puppet show with them when she performs this year in New Orleans, it would rate as just the second most shocking Super Boob display. Janet's strangely ornamented right nipple is a living legend, and so is Justin Timberlake's terrified reaction.\"[199] Music channel Fuse listed it as the most controversial Super Bowl halftime show, saying the \"revealing performance remains (and will forever remain) the craziest thing to ever happen at a halftime show. Almost immediately after the incident, the FCC received a flood of complaints from parents who just wanted their children to enjoy a nice, wholesome three hours of grown men inflicting damaging and long-lasting pain on each other for sport. Halftime shows would never be the same.\"[200] Patrick Gipson of Bleacher Report ranked it as #1 in its list of the most \"Jaw Dropping Moments of the Last Decade\", stating Janet \"changed the landscape of live television forever\". Gipson explained \"It prompted a million mothers to cover their childrens' [sic] eyes, fathers and sons to jump out of their seats in shock and numerous sanctions by the Federal Communications Commission, including a US$550,000 fine against CBS. Talk about a halftime show that will be hard to top.\"[201] The incident was also declared \"the most memorable Super Bowl halftime show in history\", as well as \"the most controversial\", adding \"you can't talk about this halftime show, or any subsequent halftime show from here to eternity, without mentioning the wardrobe malfunction\".[202]\n\nNew York City-based production studio Left/Right began developing a documentary on the incident with The New York Times, with FX and sister service Hulu stated to be carrying it on linear television and streaming respectively, shortly after the four entities collaborated on Framing Britney Spears.[203] The documentary, Malfunction: The Dressing Down of Janet Jackson, premiered on November 19, 2021, nine months after Framing Britney Spears.[204]\n\nReferences [ edit ]\n\nGeneral", "images": ["http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/8/8d/Janet_Jackson_%26_Justin_Timberlake%27s_wardrobe_malfunction.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8d/Janet_Jackson_%26_Justin_Timberlake%27s_wardrobe_malfunction.jpg/220px-Janet_Jackson_%26_Justin_Timberlake%27s_wardrobe_malfunction.jpg", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Fcc_complaints_and_fines_2001-2004.JPG/500px-Fcc_complaints_and_fines_2001-2004.JPG"], "top_img": "https://upload.wikimedia.org/wikipedia/en/8/8d/Janet_Jackson_%26_Justin_Timberlake%27s_wardrobe_malfunction.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Super_Bowl_XXXVIII_halftime_show_controversy", "title": "Super Bowl XXXVIII halftime show controversy", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/8/8d/Janet_Jackson_%26_Justin_Timberlake%27s_wardrobe_malfunction.jpg", "width": 640, "height": 853}, "title": "Super Bowl XXXVIII halftime show controversy - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}