{"url": "www.hollywoodreporter.com/live-feed/greys-anatomy-season-14-premeire-explained-krista-vernoff-interview-1044299", "text": "[This story contains spoilers from the two-hour Grey’s Anatomy season 14 premiere, “Break Down the House” and “Get Off on the Pain.”]\n\nABC’s Grey’s Anatomy returned for its 14th season Thursday, delivering a fast-paced and jam-packed two-hour premiere that featured a few key returns (onscreen and off), several nods to its past and one massive bombshell.\n\nKim Raver’s Teddy returned to support old friend/crush Owen (Kevin McKidd) and his former POW sister Megan (Abigail Spencer), with the latter setting up a new love triangle that involved Meredith (Ellen Pompeo) and Nathan (Martin Henderson).\n\nOwen planted a long-awaited kiss on Teddy, who — with his mother and sister — agreed that his wife Amelia (Caterina Scorsone) was just not his person. Head of neuro Amelia, meanwhile, delivered the premiere’s biggest stunner — as she learned in the closing moments that she had a brain tumor.\n\nApril (Sarah Drew) realized it’s time to move out of ex-husband/baby daddy Jackson’s (Jesse Williams) place — despite her feelings for him — while he pursued Maggie (Kelly McCreary).\n\nJo (Camilla Luddington) and Alex (Justin Chambers) patched things up, with her estranged and violent husband Paul (Matthew Morrison) still looming if the couple really want to get married.\n\nBen (Jason George) admitted to feeling a “rush” when he helped save Stephanie (Jerrika Hinton) in the season 13 finale, as the series set the stage for the character to segue over to the firefighter spinoff.\n\nAfter Eliza (Marika Dominczyk) ghosted her, Arizona (Jessica Capshaw) got her groove back (again) — with Andrew’s (Giacomo Gianniotti) Italian sister Carina (Stefania Spampinato), whose study about the female orgasm helped reveal Amelia’s tumor.\n\nPeppered in among all the twists and turns were several nods to the past — including multiple references to Mer’s late mom Ellis (Kate Burton), and nods to George (T.R. Knight), Derek (Patrick Dempsey), Callie (Sara Ramirez) and a photo of Cristina (Sandra Oh) in a medical journal. The blasts from the past — and return to its classic humor — came from Krista Vernoff (Shameless), who returned to the ABC Shondaland medical drama as the co-showrunner after helping to launch Grey’s as part of its core writing staff for its first seven seasons.\n\nBelow, Vernoff opens up about season 14’s eventful start and where ABC’s top drama goes next.\n\nThe first two hours are really eventful. How much of that is setting the new pace of Grey’s vs. setting the stage for the season to come?\n\nSetting the stage.\n\nThere were a lot of nods to the past — we see Cristina’s photo and there’s a reference to George. Why was it important to acknowledge the past?\n\nI’m not sure that it was important so much as it felt natural to me. I think it’s a little bit like, “I’m back so they are, too!” Also, we are doing the 300th episode this year. I think I came into the season planning to acknowledge where it all started.\n\nWebber points out a few times how similar Meredith is to Ellis. Is that part of bringing the show back to its origins or part of looking forward to a potential Alzheimer’s story?\n\nIt’s neither. It just felt really organic for a man who grew up with the mother of the woman he is now working with to acknowledge similarities and even be a little haunted by them. Also, Meredith has a surgical birthright that we are leaning into this season. This is the season of Meredith being something of a medical superhero — like Ellis was.\n\nThere’s a lot of humor in the first two episodes — all that was missing was a “seriously?!” Is bringing that humor back part of a larger effort to bring the show back to its roots?\n\nIt’s not about the roots so much as where my heart lives right now. I’m not interested in writing darkness. I feel like the world has gone dark enough. I feel like we who are part of the resistance right now need some relief in our entertainment. I feel like it’s part of my personal activism to help people sit down and laugh at night so they can get back up in the morning and fight the good fight.\n\nThere’s a parallel between Megan returning home and creating the triangle with Nathan and Meredith to when Addison returned and created the same for Derek and Meredith. Will you be exploring that more?\n\nThat’s interesting, and it honestly hadn’t even occurred to me! No, I don’t want to give away too much — but I am writing this story very differently.\n\nIs there a potential for Abigail Spencer and Kim Raver to stick around longer — maybe series regular status — this season?\n\nIf I had the budget for it I would bring them both back forever, immediately. They are incredible talents and it’s a joy to write for them and to work with them.\n\nAmelia has a brain tumor. Talk about the decision to go that route — does that explain her behavior last season too? What’s the larger story you’re looking at with her?\n\nWhen I caught up on the show, I thought Amelia had been behaving really oddly. It got my wheels turning and this is where they landed!\n\nHas Owen given up on his marriage to Amelia when he kisses Teddy?\n\nI believe that he has. Which is why when he learns that a brain tumor may be the answer for how Amelia’s been treating him — it will be really complicated.\n\nHow might Meredith respond to Amelia’s tumor? Is there a place where she goes dark and twisty again?\n\nNo, Meredith has already survived too much to return to dark and twisty. I really believe that. I believe that as people survive the unimaginable they tend to get lighter because they know now that they can survive anything — unless they go completely the opposite direction, which Meredith, happily has not!\n\nJo and Alex are moving forward — and Paul is coming back. Where do they go from here and what will that look like?\n\nI can’t answer that without giving away too much! But I will say — for all my talk of light and hope and joy — that it wouldn’t be Grey’s Anatomy if there were not some dark and twisty turns here and there.\n\nBen felt a “rush” from saving Stephanie. How will he lean into that and what does that mean for Bailey?\n\nWell, since it’s been announced that Jason George is going to the firefighting show I think everyone can anticipate how he’s leaning into that! And as you can imagine, that is an extremely complicated thing for Bailey to process. It makes for great drama and Chandra Wilson is so incredible. I’m really enjoying writing it.\n\nApril is moving out of Jackson’s apartment as he has interest in Maggie. Will he fight for her?\n\nApril is moving out of Jackson’s apartment because it is causing her pain to continue living with the man she divorced. When she thought she recognized feelings between Jackson and Maggie, she realized that living with a man you still love but are divorced from is maybe not the smartest thing to do. I feel like it’s a really beautiful, grown-up move from April. I also think that there were not necessarily feelings between Maggie and Jackson last season! I think her jealousy led her to that conclusion but when she said it, she opened a kind of Pandora’s box. I think it will be a lot of fun to see how it all plays out.\n\nArizona and Carina are really funny, together with Andrew. How will this relationship be different for Arizona?\n\nThis is a season of fun! And Carina brings so much fun! Because I am anti-spoiler, that’s all I’m going to give you on that!\n\nGrey’s Anatomy airs Thursdays at 8 p.m. on ABC. Bookmark THR.com/GreysAnatomy for full coverage all season long.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/147480_0195.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/147480_0195.jpg?w=1293&h=733&crop=1", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/147480_0195.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/greys-anatomy-season-14-premeire-explained-krista-vernoff-interview-1044299/", "title": "‘Grey’s Anatomy’: Making Sense of the Jam-Packed Season 14 Premiere", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "New co-showrunner Krista Vernoff, who returned to the Shondaland drama after working as a writer for its first seven seasons, talks with THR about the ups and downs of the two-hour opener.", "news_keywords": "Fall TV Preview, Grey's Anatomy", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1044299, "title": "'Grey's Anatomy': Making Sense of the Jam-Packed Season 14 Premiere", "published_at": "2017-09-28 19:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/147480_0195.jpg?w=1024", "comment_count": 0, "tags": "Grey's Anatomy", "topics": "TV News", "body": "[This story contains spoilers from the two-hour Grey's Anatomy season 14 premiere, \"Break Down the House\" and \"Get Off on the Pain.\"]\r\nABC's Grey's Anatomy returned for its 14th season Thursday, delivering a fast-paced and jam-packed two-hour premiere that featured a few key returns (onscreen and off), several nods to its past and one massive bombshell.\r\nKim Raver's Teddy returned to support old friend/crush Owen (Kevin McKidd) and his former POW sister Megan (Abigail Spencer), with the latter setting up a new love triangle that involved Meredith (Ellen Pompeo) and Nathan (Martin Henderson).\r\nOwen planted a long-awaited kiss on Teddy, who — with his mother and sister — agreed that his wife Amelia (Caterina Scorsone) was just not his person. Head of neuro Amelia, meanwhile, delivered the premiere's biggest stunner — as she learned in the closing moments that she had a brain tumor.\r\nApril (Sarah Drew) realized it's time to move out of ex-husband/baby daddy Jackson's (Jesse Williams) place — despite her feelings for him — while he pursued Maggie (Kelly McCreary).\r\n\r\nJo (Camilla Luddington) and Alex (Justin Chambers) patched things up, with her estranged and violent husband Paul (Matthew Morrison) still looming if the couple really want to get married.\r\nBen (Jason George) admitted to feeling a \"rush\" when he helped save Stephanie (Jerrika Hinton) in the season 13 finale, as the series set the stage for the character to segue over to the firefighter spinoff.\r\nAfter Eliza (Marika Dominczyk) ghosted her, Arizona (Jessica Capshaw) got her groove back (again) — with Andrew's (Giacomo Gianniotti) Italian sister Carina (Stefania Spampinato), whose study about the female orgasm helped reveal Amelia's tumor.\r\nPeppered in among all the twists and turns were several nods to the past — including multiple references to Mer's late mom Ellis (Kate Burton), and nods to George (T.R. Knight), Derek (Patrick Dempsey), Callie (Sara Ramirez) and a photo of Cristina (Sandra Oh) in a medical journal. The blasts from the past — and return to its classic humor — came from Krista Vernoff (Shameless), who returned to the ABC Shondaland medical drama as the co-showrunner after helping to launch Grey's as part of its core writing staff for its first seven seasons.\r\nBelow, Vernoff opens up about season 14's eventful start and where ABC's top drama goes next.\r\nThe first two hours are really eventful. How much of that is setting the new pace of Grey's vs. setting the stage for the season to come?\r\nSetting the stage. \r\nThere were a lot of nods to the past — we see Cristina's photo and there's a reference to George. Why was it important to acknowledge the past?\r\nI'm not sure that it was important so much as it felt natural to me. I think it's a little bit like, \"I'm back so they are, too!\"  Also, we are doing the 300th episode this year. I think I came into the season planning to acknowledge where it all started. \r\nWebber points out a few times how similar Meredith is to Ellis. Is that part of bringing the show back to its origins or part of looking forward to a potential Alzheimer's story?\r\nIt's neither. It just felt really organic for a man who grew up with the mother of the woman he is now working with to acknowledge similarities and even be a little haunted by them. Also, Meredith has a surgical birthright that we are leaning into this season. This is the season of Meredith being something of a medical superhero — like Ellis was.  \r\n\r\nThere's a lot of humor in the first two episodes — all that was missing was a \"seriously?!\" Is bringing that humor back part of a larger effort to bring the show back to its roots?\r\nIt's not about the roots so much as where my heart lives right now.  I'm not interested in writing darkness. I feel like the world has gone dark enough. I feel like we who are part of the resistance right now need some relief in our entertainment. I feel like it's part of my personal activism to help people sit down and laugh at night so they can get back up in the morning and fight the good fight.  \r\nThere's a parallel between Megan returning home and creating the triangle with Nathan and Meredith to when Addison returned and created the same for Derek and Meredith. Will you be exploring that more?\r\nThat's interesting, and it honestly hadn't even occurred to me! No, I don't want to give away too much — but I am writing this story very differently. \r\nIs there a potential for Abigail Spencer and Kim Raver to stick around longer — maybe series regular status — this season?\r\nIf I had the budget for it I would bring them both back forever, immediately. They are incredible talents and it's a joy to write for them and to work with them.  \r\nAmelia has a brain tumor. Talk about the decision to go that route — does that explain her behavior last season too? What's the larger story you're looking at with her?\r\nWhen I caught up on the show, I thought Amelia had been behaving really oddly. It got my wheels turning and this is where they landed! \r\n \r\nHas Owen given up on his marriage to Amelia when he kisses Teddy?\r\nI believe that he has. Which is why when he learns that a brain tumor may be the answer for how Amelia's been treating him — it will be really complicated.  \r\n\t\r\n\tHow might Meredith respond to Amelia's tumor? Is there a place where she goes dark and twisty again?\r\nNo, Meredith has already survived too much to return to dark and twisty. I really believe that. I believe that as people survive the unimaginable they tend to get lighter because they know now that they can survive anything — unless they go completely the opposite direction, which Meredith, happily has not! \r\nJo and Alex are moving forward — and Paul is coming back. Where do they go from here and what will that look like?\r\nI can't answer that without giving away too much! But I will say — for all my talk of light and hope and joy — that it wouldn't be Grey's Anatomy if there were not some dark and twisty turns here and there.  \r\n\r\nBen felt a \"rush\" from saving Stephanie. How will he lean into that and what does that mean for Bailey?\r\nWell, since it's been announced that Jason George is going to the firefighting show I think everyone can anticipate how he's leaning into that! And as you can imagine, that is an extremely complicated thing for Bailey to process. It makes for great drama and Chandra Wilson is so incredible. I'm really enjoying writing it. \r\nApril is moving out of Jackson's apartment as he has interest in Maggie. Will he fight for her?\r\nApril is moving out of Jackson's apartment because it is causing her pain to continue living with the man she divorced. When she thought she recognized feelings between Jackson and Maggie, she realized that living with a man you still love but are divorced from is maybe not the smartest thing to do. I feel like it's a really beautiful, grown-up move from April. I also think that there were not necessarily feelings between Maggie and Jackson last season! I think her jealousy led her to that conclusion but when she said it, she opened a kind of Pandora's box. I think it will be a lot of fun to see how it all plays out.  \r\nArizona and Carina are really funny, together with Andrew. How will this relationship be different for Arizona?\r\nThis is a season of fun! And Carina brings so much fun! Because I am anti-spoiler, that's all I'm going to give you on that!\r\nGrey's Anatomy airs Thursdays at 8 p.m. on ABC. Bookmark THR.com/GreysAnatomy for full coverage all season long.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Grey’s Anatomy’: Making Sense of the Jam-Packed Season 14 Premiere", "url": "https://www.hollywoodreporter.com/tv/tv-news/greys-anatomy-season-14-premeire-explained-krista-vernoff-interview-1044299/", "description": "New co-showrunner Krista Vernoff, who returned to the Shondaland drama after working as a writer for its first seven seasons, talks with THR about the ups and downs of the two-hour opener.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/147480_0195.jpg?w=1024", "width": 1024, "height": 581}, "locale": "en_US"}, "article": {"published_time": "2017-09-28T19:00:00+00:00", "modified_time": "2017-10-16T12:59:12+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Grey’s Anatomy’: Making Sense of the Jam-Packed Season 14 Premiere", "description": "New co-showrunner Krista Vernoff, who returned to the Shondaland drama after working as a writer for its first seven seasons, talks with THR about the ups and downs of the two-hour opener.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/147480_0195.jpg?w=1293"}}, "movies": [], "publish_date": 1506625200.0, "source": "http://www.hollywoodreporter.com", "summary": ""}