{"url": "https://web.archive.org/web/20220828213607/https://www.thetalko.com/a-complete-timeline-of-niall-horan-hailee-steinfelds-relationship-in-25-pics/", "text": "Remember when Niall Horan was in a deeply loving and supportive relationship with the members of One Direction? In case you didn’t keep up with the news, I hate to break it to you, but they all went separate ways, breaking the entire fandom’s heart in two in the process. Each member started his own solo career, and it seems they’re all doing pretty good now, even while being apart.\n\nLet's be honest, some of us are still not over the fact that One Direction isn't a thing anymore which can make you want to sob into the now-vintage One Direction merch for days on end. But once we've gathered our emotions together, we really should celebrate the fact the boys are positively flourishing these days. This means career-wise as well as in their romantic relationships. Zayn is dating one of the hottest girls on the planet (supermodel Gigi Hadid), Harry is fighting the good fight for human rights and Louis and Liam are now happy and proud papas'. But what about the Irish blondie Niall Horan?\n\nWell, Niall has recently moved onto greener relationship pastures, by which we mean he's been romantically linked to singer and actress Hailee Steinfeld. But let’s take a step back and see how this relationship has flourished from a strong (and funny!) friendship. Here’s a complete timeline of Niall Horan and Hailee Steinfeld’s relationship in 25 pictures.\n\nTHETALKO VIDEO OF THE DAY\n\n25 May 17, 2015: Hailee & Niall Attend The BBMAS & Taylor Swift's Afterparty\n\nDuring the BBMAS held on May 17, 2005, One Direction won in two out of the four categories they were nominated in. They won Top Touring Artist and Top Duo/Group but were also nominated for Top Billboard 200 Artist and Top Artist, both won by Taylor Swift - that undoubtedly killed it that night.\n\nTaylor actually even threw an epic after party - which was also attended by Hailee Steinfeld and Niall Horan who was there with the other members of One Direction. It’s unsure whether Niall and Hailee met and talked, but they were there, together, so we couldn’t exclude that.\n\n24 November 22, 2015: They Attend The Purpose Afterparty With Selena Gomez\n\nFollowing the big show on November 22, Justin Bieber and Selena Gomez hit Justin’s American Music Awards after-party at Nice Guy in Los Angeles together, also joined by their many celebrity friends. The party’s purpose was to celebrate Justin’s no. 1 album, Purpose. It’s been reported a cake was brought out for Justin and that the Canadian pop star even played “Let it Be” on the piano.\n\nAmong the guests, Hailee and Niall were also there to celebrate. And since Niall is known to be a close friend to Justin and Hailee is close to Selena, it’s pretty sure the two ran into each other at some point!\n\n23 October 1, 2016: Hailee & Niall Flirt Over Twitter\n\nIs it actually possible that Hailee Steinfeld somehow anticipated her relationship with Niall Horan through a tweet a couple years ago? After knowing Ariana said she predicted she’d marry Pete Davidson three whole years ago, we think everything is possible for Hollywood couples.\n\nAt least, if that’s the case, this is the closest thing we have to a proof. On October 1 of 2016, Hailee tweeted “I love ‘This Town’” and Niall replied saying “thank you love”. She then liked Niall’s tweet. Yes, “love” could’ve been intended as a joking way to call his friend...but still, there might have been some truth in it!\n\n22 December 1, 2016: They Perform At The WILD 94.9 Jingle Ball & Are Seen Hugging Backstage\n\nIn case you didn’t know, the WILD 94.9 Jingle Ball is one of the most important Christmas-time events for celebrities. Year after year, big names have performed here, including Taylor Swift - who last time surprised everyone with not only her performance but also a super-adorable Santa Snake sweater - Ed Sheeran, Demi Lovato and many more.\n\nNiall Horan has also performed for the WILD 94.9 Jingle Ball, in 2017 as well as in 2016 when Hailee Steinfeld was also there to sing. During the occasion in Santa Monica, the two were also seen hugging and talking backstage.\n\n21 December 9, 2016: Niall Introduces Hailee At Z100 Jingle Ball In NYC\n\nOn December 9 of 2016, Niall Horan and Hailee Steinfeld both performed at Z100 Jingle Ball in New York. The two were even scheduled to sing together but didn’t have time to rehearse, so Niall ended up introducing Hailee instead: “Alright well, I’ve been given the job to tell you who’s coming next and it’s a very very special girl and a very good friend of mine and I’m glad that I get to do this. Ladies and gentlemen, Hailee Steinfeld! HAILEE STEINFELD!” he shouted before she jumped in to perform.\n\n20 December 14, 2016: They Perform At KISS Jingle Ball In Chicago & Share Backstage Videos\n\nOn December 14 of 2016, only a few days after Z100 Jingle Ball in NYC, Niall and Hailee performed at KISS Jingle Ball in Chicago. Hailee even posted stories while they were backstage about their “fight”.\n\nIn the video, she says: “We’re fighting so he came to serenade me.” Niall smiles and asks: “We’re still fighting?”. “YES” Hailee replies. They both laugh. Later she published a picture of their cute pairs of socks captioning it: ”We made up over our socks”.\n\nWhether they were only friends or there were already some sparks in the air, they look like such a fun couple to hang out with!\n\n19 May 12, 2017: The Two Perform At 93.3 Summer Kickoff Concert In San Diego & Niall Posts An Adorable Video Of Hailee\n\nNiall and Hailee performed at 93.3 Summer Kickoff concert in San Diego on May 12, 2017, and this time Niall posted an adorable video of the two fighting over Niall Horan’s “Slow Hands” lyrics.\n\nHailee forgot the lyrics to ‘Slow Hands’, one of Niall’s most popular hits and this is his reaction: “Can’t believe you don’t know the words to your best friend’s song. It’s bullsh*t.” Hailee claimed it was because: “It just came out!” But Niall replies: “I know all the words to every one of yours!” so she says: “Give me time.” showing off her best “sorry” face.\n\nUgh! Even their fights are adorable!\n\n18 May 15, 2017: Niall Talks About Hailee In An Interview With Zach Sang\n\nOn May 15, 2017, Niall got interviewed by Zach Sang, known for his podcast episodes on which he interviews celebrities like Selena Gomez, Justin Bieber, Ariana Grande and many more.\n\nDuring the interview, the main topics of discussion were the new album, One Direction, and his blonde hair. But at some point Zach asks Niall about his friendship with Hailee Steinfeld: “You do have really cool friends. You and Hailee Steinfeld, I saw that.” This is what he replied: “I love Hailee. She’s a legend. She is the funniest person I know. She’s great.” Wow...sounds like somebody already had a crush!\n\n17 June 10, 2017: They Both Perform At Capital Summertime Ball In London & She Talks About Him On The Red Carpet\n\nSome of Britain's biggest stars take to the stage of Capital Summertime Ball in London every year. This mini-festival became the fastest ever selling Summertime Ball with 80,0000 people attending and the last tickets being snapped up just 90 minutes after sales started this year.\n\nOther acts who performed were Bruno Mars, Little Mix, Shawn Mendes, Dua Lipa, Maroon 5, Charlie Puth, Clean Bandit, Anne-Marie, Sean Paul - and of course Niall Horan and Hailee Steinfeld. On the red carpet, Hailee got asked about Niall’s performance and she replied: “Niall is a great friend and I’m very excited to see him, as well”\n\n16 June 24, 2017: Niall & Hailee Perform At B96 Summer Bash & Hailee Uploads Multiple Stories Of Her Watching Niall’s Performance\n\nWith showstopping performances from some of the biggest names in music, the Windy City crowd knew that the show would be full of some of pop radio’s biggest tracks. Indeed, the B96 Pepsi Summer Bash 2017 absolutely delivered for yet another yet.\n\nAfter Noah Cyrus’ set, Hailee Steinfeld returned for another B96 performance. The highlight of Steinfeld’s set came with the performance of her new and empowering anthem for women, ‘Most Girl’. Soon after Hailee, it was Niall’s turn to perform and he sang ‘Slow Hands’. Apart from performing amazingly, Hailee also decided to share multiple stories of her watching Niall’s performance with her social followings - which pretty much appreciated the gesture.\n\n15 June 27, 2017: Niall Starts Following Hailee On Instagram\n\nThese two have been rumored to be dating since November 2017, when they seemed to be getting along very well at the Music Awards. However, when Niall started to follow Hailee on Instagram, eagle-eyed fans started wondering if they were already getting closer by this time.\n\nEven though they decided to go ‘Instagram official’ only recently with various pictures in which they pose together (and adorable birthday wishes!) Niall started following Hailee in June 27, 2017, only shortly before their dating rumors began.\n\n14 November 18, 2017: The Musical Duo Get On Very Well At The 2017 Music Awards\n\nWhile it is unknown when exactly the Pitch Perfect actress and the former One Direction band member first met, they have been romantically linked since November 2017.\n\nThe musical duo indeed got on very well at the 2017 Music Awards at California’s Microsoft Theatre in November 2017. They cozied up for photographs at the event together and were spotted engrossed in conversation and giggling with one another at the annual bash. More recently, the Mail Online has even reported the pair have locked lips in public during the occasion.\n\n13 November 29, 2017: Niall & Hailee Fly To San Francisco Together\n\nNot too long after the Music Awards 2017 held in California - where they already seemed perfectly comfortable in each other’s company - Hailee and Niall were spotted taking a flight to San Francisco together.\n\nThe whole thing was kept very low-profile and all we got were a bunch of photos the two took with some fans at the airport, which reported they were in San Francisco - and together! To many, the trip appeared like a romantic getaway and seemed to prove the musical duo was getting closer and closer.\n\n12 December 11, 2017: Niall Wishes Hailee Happy Birthday & Calls Her One Of His Best Friends\n\nThe dating rumors became even louder and more frequent when the former ex-1D singer wished Hailee a happy 21st birthday on his Instagram profile, calling her one of his best friends and “the loveliest person on the planet”, which is frankly quite a claim.\n\nThe picture showed the two at the American Music Awards and the caption read: “Happy birthday to the loveliest person on the planet and one of my best friends @haileesteinfeld. Have no idea what the hell is going on in this photo. Love ya hails”\n\n11 January 2, 2018: They Reportedly Go To See The West End Production Of The Musical Hamilton In London\n\nRumors Steinfeld and the ex-One Direction singer were dating began fueling after they were seen together on January 2 at London’s West End production of Hamilton. The two have taken advantage of the trip to also spend time with their friends and have some fun together.\n\nAccording to Us Weekly, Niall even showed up to Hailee’s brother’s birthday party the next week. The “Slow Hands” singer also posted videos of himself having a bit of a jam session with Hailee on his Instagram story.\n\n10 January 21, 2018: Hailee Is Asked Directly About Their Dating Rumors By US Weekly\n\nTo this point, ignoring the dating rumors for the musical duo became almost impossible. They could either deny or confirm them, but Hailee chose the third option. So when she got interviewed by Us Weekly, she probably saw a chance to do so.\n\nWhen asked about Niall, indeed, the “Starving” singer decided to give a kind of vague answer, saying: “I feel so lucky that [my fans] care enough about me to know what I’m doing every second of every day, but I think that sometimes it’s hard for people, in general, to realize that there are boundaries to a person’s life and personal life.”\n\nAnd while she said that she’s a “very private person” she also added: “I do love that I have the opportunity to share with them what I’m comfortable with and they’re there to listen and support me.” Sounds fair enough, don’t you think?\n\n9 February 17, 2018: Niall & Hailee Are Spotted Attending A Backstreet Boys Concert Together\n\nOn February 17, 2018, the friends/couple are spotted at a Backstreet Boys concert in Las Vegas, singing their hearts out to “I want it that way” - which ignites even more speculation that they could definitely be an item.\n\nAround this time, a source tells People, “[Hailee's] not actively pursuing anything. Niall is really into her but she’s unsure if she wants to get into something new right away.”\n\nA source also confirmed to E! News that after the show, the duo hit up XS Nightclub where they sat together at a stage table with a few friends and enjoyed a DJ set by Diplo.\n\n8 March 24, 2018: Hailee Posts A Photo Of Herself Wearing Niall’s Tour Shirt\n\nWe already know fans are always eager to see their favorite celebrities get together, so when rumors circulated that Hailee Steinfeld and Niall Horan might be more than friends, the internet went wild.\n\nPlus, Hailee made the thirsty corners of Twitter abandon all chill when she posted a photo of herself wearing Niall's $35 tour shirt which she styled with blue jeans and black boots. The caption read “51.4613° N, 0.1156°.” If you input the coordinates, it takes you to the neighborhood of Brixton, London.\n\nEven though it couldn’t be considered a concrete proof she was seeing the singer, this photo definitely demanded - and obtained - some attention!\n\n7 April 10, 2018: The Two Spend A Romantic Getaway In The Bahamas\n\nWhen fans captured a pretty stalker-y video of Hailee and Niall kissing at a restaurant in the Bahamas, it quickly made the rounds on Twitter. In the fan-captured clip that surfaced online, Niall could be seen wrapping his arm around Hailee while talking to one of their friends. At one point, however, the “Slow Hands” crooner leaned in for a kiss.\n\nAn onlooker revealed that they looked “really loved up,” adding, “They were chatting away for ages”. The love was in the air for these two lovebirds, and it was undeniable at this point.\n\n6 April 14, 2018: Niall Invites Hailee To Watch The U.S. Masters Tournament In Augusta, Georgia\n\nThese days golf tournaments seem to be the new “let's go to Paris for the weekend!” for celebrities. And even though you might not consider this gesture as romantic as a trip to Paris, it’s quite an important step for a Hollywood couple.\n\nOn April 14, 2018, according to the Mail, Hailee, Niall - and his professional player friend Thomas Bjorn - all shared a house in Augusta, Georgia, for the four-day U.S. Masters Tournament.\n\nPerhaps Niall wanted to show Hailee he was serious about the relationship by taking her to watch his favorite sport. Who knows!\n\n5 April 18, 2018: The Couple Apparently Holidays In The Tropical Exuma Islands\n\nAfter the Masters, the couple decided to head back on to the Bahamas, according to the Daily Mail. They apparently spent some time in the tropical Exuma islands, having cold drinks and laughing.\n\nAfter months and months of keeping their fans guessing and speculating on their relationship, this romantic getaway seemed somehow to confirm the two were definitely spending more time together than two casual pals would!\n\n4 May 20, 2018: The Two Are Seen Partying In Los Angeles\n\nOn May 20, 2018, Niall and Hailee are seen partying together in Los Angeles. A source tells People they can't keep their hands off each other: “Niall had his arm around Hailee and they were holding hands. They definitely looked like a couple.”\n\nThe budding couple also enjoyed a low-key date in the city at hot spot E.P. & L.P. and showed off some subtle P.D.A - as people that spotted the pair at the restaurant revealed. A few months earlier a close source said: “She’s not actively pursuing anything. Niall is really into her but she’s unsure if she wants to get into something new right away,” The “Slow Hands” singer, however, seems to have won her over!\n\n3 May 31, 2018: Hailee & Niall Are Spotting Kissing Backstage At BBC Music’s The Biggest Weekend\n\nOn May 31, 2018, both Hailee and Niall perform at Radio One's Big Weekend in Swansea, Wales and are seen hanging out with friends in an Instagram from the weekend that gets snapped up by the media.\n\nHailee and Niall are also spotted kissing (or, as the British say, “snogging”) backstage at BBC Music's The Biggest Weekend event in Swansea. BBC Radio 1 producer Fiona Hanlon spied the couple making out and confirmed laughing: “They were snogging, they were! So cute”\n\n2 July 16, 2018: The Couple Make Another One Of Their Rare Public Appearances In NYC\n\nOn July 16, 2018, Niall and Hailee make a rare public appearance together, stepping out in NYC for some casual shopping at Saks Fifth Avenue before Hailee's performance at Radio City Music Hall. The pictures leave everybody surprised and many jaws drop. The visit, however, was short as Niall had to go back to touring.\n\n“Niall flew to New York City to hang out with Hailee during his three-day break from tour. He had a show in Mexico on Saturday and another one in Houston on Wednesday. He’s in New York alone - no staff, crew, friends, etc. They’ve been staying at a hotel together in New York,” a source told Us Weekly.\n\nIf flying 2000+ miles only to see your girlfriend for a couple of days is not romantic, we really don’t know what is!\n\n1 August 15, 2018: They Are Seen Kissing & Shopping In Matching Outfits\n\nNow we finally got the proof we needed, guys. This is one of the last public appearances the two lovebirds made which confirmed they are officially an item and are more than happy in each other's company.\n\nOn 15 August Hailee and Niall are spotted kissing in a car park after shopping at a Target in Los Angeles - in which they reportedly spent 15 minutes. More importantly, the couple was twinning in matching white T-shirts and shoes and blue pants and shorts. If that's not love, what is?\n\nReferences: UsWeekly.com; Cosmopolitan.com; DailyMail.co.UK; People.com\n\nShare Share Tweet Email", "images": ["https://web.archive.org/web/20220828213607im_/https://www.thetalko.com/public/build/images/bg-logo-full-colored-light.2bae128a.svg", "https://web.archive.org/web/20220828213607im_/https://static1.thetalkoimages.com/wordpress/wp-content/uploads/2018/09/BeFunky-collagedsxz.jpg", "https://web.archive.org/web/20220828213607im_/https://www.thetalko.com/public/build/images/tv-logo-full-colored-light.8d65e7f9.svg", "https://web.archive.org/web/20220828213607im_/https://www.thetalko.com/public/build/images/mm-logo-full-colored-light.53763959.svg", "https://web.archive.org/web/20220828213607im_/https://www.thetalko.com/public/build/images/re-logo-full-colored-light.4b543c53.svg"], "top_img": "https://web.archive.org/web/20220828213607im_/https://static1.thetalkoimages.com/wordpress/wp-content/uploads/2018/09/BeFunky-collagedsxz.jpg", "keywords": [], "authors": ["Celeste Galizia"], "canonical_link": "https://web.archive.org/web/20220828213607/https://www.thetalko.com/a-complete-timeline-of-niall-horan-hailee-steinfelds-relationship-in-25-pics/", "title": "A Complete Timeline Of Niall Horan & Hailee Steinfeld's Relationship In 25 Pics", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "robots": "max-image-preview:large", "description": "Let’s take a step back and see how this relationship has flourished from a strong friendship.", "og": {"title": "A Complete Timeline Of Niall Horan & Hailee Steinfeld's Relationship In 25 Pics", "type": "article", "image": {"identifier": "https://web.archive.org/web/20220828213607im_/https://static1.thetalkoimages.com/wordpress/wp-content/uploads/2018/09/BeFunky-collagedsxz.jpg", "width": 1200, "height": 628}, "url": "https://web.archive.org/web/20220828213607/https://www.thetalko.com/a-complete-timeline-of-niall-horan-hailee-steinfelds-relationship-in-25-pics/", "locale": "en_US", "description": "Let’s take a step back and see how this relationship has flourished from a strong friendship.", "site_name": "TheTalko"}, "article": {"published_time": "2018-09-04T19:00:23Z", "modified_time": "2018-09-04T19:00:23Z", "section": "Entertainment"}, "twitter": {"card": "summary_large_image", "site": "@thetalko", "title": "A Complete Timeline Of Niall Horan & Hailee Steinfeld's Relationship In 25 Pics", "description": "Let’s take a step back and see how this relationship has flourished from a strong friendship.", "image": "https://web.archive.org/web/20220828213607im_/https://static1.thetalkoimages.com/wordpress/wp-content/uploads/2018/09/BeFunky-collagedsxz.jpg"}, "fb": {"app_id": 1470061169975403}}, "movies": [], "publish_date": 1536087623.0, "source": "https://web.archive.org", "summary": ""}