{"url": "https://www.cnn.com/2018/01/30/sport/super-bowl-memorable-moments-trnd/index.html", "text": "CNN —\n\nIt may be a bloated, over-hyped spectacle, but the Super Bowl usually is good for a memorable moment or two.\n\nSome of them even happen on the field.\n\nFrom dramatic plays to big blunders to a certain dancing fish, here’s a look back at some of game’s most indelible moments – in no particular order.\n\n2013: The Blackout Bowl\n\nJamie Squire/Getty Images\n\nFans had barely returned to their seats for the second half of Super Bowl XLVII when a partial power outage smothered New Orleans’ Superdome in murky dusk. The Baltimore Ravens and San Francisco 49ers left the field, people had to be rescued from a stalled stadium elevator and fans took to their phones to try and decipher what was going on. Some people joked that Beyonce’s halftime show was so hot it fried the power. Play was stopped for 34 minutes while the electrical glitch was fixed. Many observers think the blackout stalled the Ravens’ momentum and helped the 49ers storm back from a 28-6 deficit to make the game close.\n\n1986: ‘The Fridge’ scores a touchdown\n\nKidwiler Collection/Diamond Images/Getty Images\n\nThe 1985 Chicago Bears were best known for hard-nosed coach Mike Ditka, star running back Walter Payton, their so-bad-it’s-good “Super Bowl Shuffle” rap video and William Perry, a fun-loving rookie defensive lineman so enormous his nickname was “The Refrigerator.” Late in the Bears’ beatdown of the Patriots in Super Bowl XX, Dikta put The Fridge in the game at running back and watched him barrel into the end zone for a 1-yard touchdown. The stunt amused TV viewers and helped make The Fridge a cult hero.\n\n1993: Michael Jackson’s dramatic intro\n\nMike Powell/Getty Images\n\nAfter a Michael Jackson stunt double faked out the Rose Bowl crowd by popping up atop a large video screen, the King of Pop himself emerged from a stage in the middle of the field. As the crowd cheered and swarmed the stage, Jackson stood frozen in place. And stood. And stood … for a full minute and a half. Finally, he broke into “Bad,” “Billie Jean” and a medley of other hits, kicking off the modern-day tradition of Super Bowl halftime shows by big-name performers. Nobody could pull that introduction off today, though.\n\n1968: Vince Lombardi’s players carry him off the field\n\nFocus On Sport/Getty Images\n\nIt’s one of the most iconic sports moments of the 1960s. Vince Lombardi, coach of the victorious Green Bay Packers, is hoisted off the field on the shoulders of his players at the end of Super Bowl II. Everything about it screams old-school: His suit and tie, the players’ retro helmets, the fact that THEY WERE ACTUALLY CARRYING THEIR COACH OFF THE FIELD (teams don’t do that anymore). It was Lombardi’s last game as the Packers’ coach.\n\n1984: Apple launches the Macintosh with ’1984’ ad\n\nAPPLE\n\nThe Raiders were blowing out the Redskins in the third quarter of Super Bowl XVIII when TV viewers were startled from their cheese dip by a striking TV commercial. The ad channeled George Orwell’s dystopian novel by featuring a lone female athlete disrupting a drab, conformist society by hurling a hammer at a “Big Brother”-like figure. Let the revolution begin! Directed by Ridley Scott, the iconic spot plugged Apple’s new Macintosh personal computer – “Think Different,” get it? – and signaled the upstart company’s arrival as a major player. It also helped make the Super Bowl an annual showcase for splashy, big-budget commercials.\n\n1973: The Miami Dolphins cap a perfect season\n\nap\n\nThe game itself was sort of a yawner. But when the Dolphins beat the Washington Redskins, 14-7, in Super Bowl VII, they capped a 17-0 season and became the first NFL team to go undefeated on their way to a championship. Today, 45 years later, they remain the only team to do it. They were snubbed by the White House that year – then-President Richard Nixon was a Redskins fan – but President Obama made up for it by hosting them in 2013.\n\n1991: Whitney Houston’s national anthem brings down the house\n\nGeorge Rose/Getty Images\n\nPatriotism was at a peak during the Persian Gulf War in January 1991 when Whitney Houston stepped to the microphone in Tampa to sing the national anthem. And wow, did she nail it. Houston’s soaring performance brought goose bumps to listeners around the world and was so popular it became a top-20 single, making her the only singer to turn “The Star Spangled Banner” into a pop hit. It was re-released after 9/11, and many consider it the finest version of the national anthem ever.\n\n2008: David Tyree’s helmet catch\n\nJim Davis/The Boston Globe/Getty Images\n\nIt may be the greatest play the Super Bowl has ever seen. In the final moments of the game, with the New York Giants trailing 14-10 and facing third down, quarterback Eli Manning twisted away from three Patriots tacklers and heaved a pass downfield to David Tyree. The little-used receiver leaped in the air, wrestled the ball away from a Patriots defender and somehow pinned it to his helmet as he fell to the ground. The Helmet Catch, as it became known, gained 32 yards and instant renown. Four plays later, the Giants scored the winning touchdown, ending the undefeated Patriots’ chance at a perfect season.\n\n1991: Scott Norwood misses game-winning kick\n\nRick Stewart/Getty Images\n\nSuper Bowl XXV ended in agony for Buffalo Bills fans when Scott Norwood barely missed what would have been a game-winning 47-yard field goal in the final seconds. Norwood had hit more than 70% of his kicks that season, but this one sailed just wide to the right. The New York Giants erupted in celebration. The Bills and their fans stood stunned. The defeat marked the first of four consecutive Super Bowl appearances by the Bills – all of them losses. Even today, if you want to make a Buffalo sports fan cringe, just go up to them and whisper, “Scott Norwood.”\n\n1992: Thurman Thomas misplaces his helmet\n\nBILL SIKES/AP\n\nOh, the poor Bills. It was probably a bad omen when Thomas, their star running back, couldn’t find his helmet on the sidelines at the start of the game. The Bills had to run two plays with his backup before Thomas finally found his headgear and dashed onto the field. The miscue personified the Bills’ early-’90s Super Bowl woes and was the beginning of a miserable day for Thomas and his team, who lost 37-24 to the Washington Redskins.\n\n2004: Janet Jackson’s wardrobe malfunction\n\nFrank Micelotta/Getty Images\n\nYes, it was the Nipple Seen ‘Round the World. When Justin Timberlake closed Super Bowl XXXVIII’s halftime show by tearing off part of Janet Jackson’s costume, he did much more than briefly expose her right breast to 140 million people. The “wardrobe malfunction” sparked outrage, spurred an FCC crackdown on “indecency” and became the most TiVo-ed moment ever. Years later, many think the controversy was overblown and unfairly torpedoed Jackson’s career. Timberlake, meanwhile, will be this year’s Super Bowl halftime act.\n\n1993: Leon Lett’s goal-line fumble\n\nRick Stewart/Getty Images North America/Getty Images\n\nThe Dallas Cowboys were pounding the Bills (yes, them again) 52-17 late in Super Bowl XXVII when Cowboys lineman Leon Lett scooped up a fumble and rumbled, alone and untouched, some 60 yards towards yet another Dallas touchdown. But Lett began showboating as he neared the end zone, allowing Buffalo receiver Don Beebe to catch him and slap the ball from his hand at the one-yard line. The ball bounced into the end zone for a touchback – and a little moral victory for the sad-sack Bills.\n\n2000: The Tackle\n\nPETER NEWCOMB/AFP/Getty Images\n\nWith six seconds left in the game and the Tennessee Titans trailing the St. Louis Rams by a touchdown, Titans QB Steve McNair tossed a quick slant pass to receiver Kevin Dyson, who appeared on his way to a game-tying score when he was corralled by Rams linebacker Mike Jones at the 2-yard line. Dyson fell forwards, stretching his right hand – and the ball – towards the end zone as time expired. “Can he get in?” shouted incredulous announcer Al Michaels as the ball hovered inches from the goal line. “No, he cannot!” The Tackle, as it became known, is the most thrilling final play in Super Bowl history.\n\n2007: Prince performs in a downpour\n\nHahn Lionel/Sipa USA/AP\n\nThe rain was coming down in sheets before Prince and his band took the stage in Miami for Super Bowl XLI’s halftime show. It had all the makings of a disaster. Water and electricity don’t mix. Prince’s two backup dancers would be tottering around a slippery stage in 5-inch heels. And yet when the producer asked Prince if he was OK to perform, he responded, “Can you make it rain harder?” Then the pop star went out and killed it, closing with a transcendent version of – what else? – “Purple Rain” as 70,000 fans waved flashlights and the elements raged around him. It was magical, and probably the best Super Bowl halftime show ever.\n\n1969: Joe Namath pulls upset after guaranteeing victory\n\nFocus On Sport/Getty Images\n\nNobody gave flamboyant Joe Namath and the upstart New York Jets much of a chance against the mighty Baltimore Colts, who were 18-point favorites. But three days before the game, a tipsy Namath boasted publicly, “We’re gonna win the game. I guarantee it.” It’s the kind of reckless comment that gets pinned up in the opposing team’s locker room and drives coaches crazy. But Namath backed it up, leading the Jets to a 16-7 win and cementing his Broadway Joe legend.\n\n2015: Katy Perry is upstaged by #LeftShark\n\nRob Carr/Getty Images\n\nDuring her campy halftime show, pop star Katy Perry rode in on a mechanical lion, dueted with Lenny Kravitz and flew over the stadium crowd on a shooting star. But that’s not what anybody remembers. What they remember is Perry singing “Teenage Dream” against a cartoony tropical backdrop with palm trees, beach balls and two dancers in cuddly shark costumes. To the internet’s great amusement, it soon became clear that the shark to the left of Perry seemed a little … off. While the other shark followed the choreography, Left Shark flailed and spun around and seemed at times to be making it up as he went along. #LeftShark became a meme before halftime was even over.\n\n2015: The Seahawks’ disputed play call\n\nKathy Willens/AP\n\nIt’s probably the most-criticized play call in Super Bowl history. Trailing New England 28-24, the Seahawks’ Russell Wilson drove his team to the Patriots’ 1-yard line with 26 seconds left. Since it was only second down and the Seahawks had a timeout left, everyone figured they knew what was coming next: a handoff or two to star running back Marshawn Lynch, who would go full Beast Mode and rumble into the end zone for the win. Instead, Wilson threw a slant pass to Ricardo Lockette that was intercepted by the Patriots’ Malcolm Butler at the goal line. TV announcer Chris Collinsworth spoke for many stunned Seattle fans when he said, “I’m sorry, but I can’t believe the call.”", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/210206170516-mindy-kaling.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180126190147-super-bowl-moments-1969-namath-restricted.jpg?q=x_353,y_435,h_1445,w_2568,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180126173154-super-bowl-moments-1991-whitney.jpg?q=x_550,y_309,h_1659,w_2948,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180126164217-super-bowl-moments-2004-janet-jackson.jpg?q=x_3,y_226,h_1684,w_2993,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/200902114954-nfl-logo-file-2019.jpg?q=x_3,y_156,h_1684,w_2993,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180126172611-super-bowl-moments-1993-jackson.jpg?q=x_118,y_135,h_1575,w_2799,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/210122171623-super-bowl-ads-budweiser.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/140926154319-brandon-griggs-profile-image.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/210202142003-bud-light-seltzer-super-bowl-ad.jpg?q=x_59,y_0,h_1824,w_3241,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/140130205120-super-bowl-halftime-orig-00004203.jpg?q=x_58,y_0,h_637,w_1133,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/210125091746-02-mahomes-brady-split.jpg?q=x_0,y_0,h_619,w_1100,c_fill/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/140122182835-apple-1984-ad.png?q=x_111,y_34,h_948,w_1684,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180126165534-super-bowl-moments-1986-perry-touchdown-restricted.jpg?q=x_47,y_446,h_1604,w_2851,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/210122123141-nfl-roger-goodell-surprise-super-bowl-tix-for-health-workers-1.jpg?q=x_2,y_0,h_1078,w_1915,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180129134815-super-bowl-moments-1972-dolphins.jpg?q=x_0,y_0,h_1686,w_2996,c_fill/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180128185524-coach-vince-lombardi-1968-restricted.jpg?q=x_0,y_0,h_3024,w_5373,c_fill/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/210201123109-waynes-world-uber-eats-super-bowl-ad.jpg?q=x_2,y_0,h_1078,w_1915,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180128105321-super-bowl-moments-1992-thurman.jpg?q=x_3,y_0,h_1460,w_2594,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180126172145-super-bowl-moments-2007-prince.jpg?q=x_871,y_58,h_1479,w_2629,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/210205111755-tom-brady-kimmel-mean-tweets-1.jpg?q=x_2,y_0,h_1078,w_1915,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180126174925-super-bowl-moments-1991-norwood.jpg?q=x_252,y_416,h_1412,w_2510,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/170119103304-06-georgia-dome.jpg?q=x_0,y_0,h_1152,w_2047,c_fill/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/210203154734-cdc-expert.jpg?q=x_94,y_156,h_893,w_1588,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180130152046-super-bowl-moments-split.jpg?q=x_0,y_0,h_1125,w_1999,c_fill/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/210207045749-snl-thumbnail.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180126170132-super-bowl-moments-1993-leon-lett.jpg?q=x_168,y_356,h_1526,w_2712,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180126191258-super-bowl-moments-2015-interception.jpg?q=x_0,y_242,h_1803,w_3205,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180126164726-super-bowl-moments-2015-katy-perry-sharks.jpg?q=x_2,y_50,h_1228,w_2182,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180126163655-super-bowl-moments-2013-power-outtage.jpg?q=x_4,y_215,h_1228,w_2182,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180126171210-super-bowl-moments-2008-tyree-restricted.jpg?q=x_11,y_147,h_1351,w_2402,c_crop/h_270,w_480"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/180130152046-super-bowl-moments-split.jpg?q=x_0,y_0,h_1125,w_1999,c_fill/w_800", "keywords": [], "authors": ["Brandon Griggs"], "canonical_link": "https://www.cnn.com/2018/01/30/sport/super-bowl-memorable-moments-trnd/index.html", "title": "Super Bowl: 17 most-talked about moments in its history", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "17 most talked-about moments in Super Bowl history | CNN", "description": "Nipplegate. The Helmet Catch. #LeftShark. It may be a bloated, over-hyped spectacle, but the Super Bowl usually is good for a memorable moment or two.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180130152046-super-bowl-moments-split.jpg?q=x_0,y_0,h_1125,w_1999,c_fill/w_800", "type": "article", "url": "https://www.cnn.com/2018/01/30/sport/super-bowl-memorable-moments-trnd/index.html", "site_name": "CNN"}, "twitter": {"title": "17 most talked-about moments in Super Bowl history | CNN", "description": "Nipplegate. The Helmet Catch. #LeftShark. It may be a bloated, over-hyped spectacle, but the Super Bowl usually is good for a memorable moment or two.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180130152046-super-bowl-moments-split.jpg?q=x_0,y_0,h_1125,w_1999,c_fill/w_800", "card": "summary_large_image", "site": "@CNNSport"}, "description": "Nipplegate. The Helmet Catch. #LeftShark. It may be a bloated, over-hyped spectacle, but the Super Bowl usually is good for a memorable moment or two.", "template_type": "article_leaf", "type": "article", "meta-section": "sport", "theme": "sport", "article": {"published_time": "2018-01-30T20:45:17Z", "modified_time": "2018-02-05T02:15:56Z", "tag": "celebrities, football (american), football (american) events, janet jackson, joe namath, michael jackson (entertainer), nfl, ridley scott, sports and recreation, sports events, sports figures, sports organizations and teams, super bowl, whitney houston, katy perry, animals, fish and shellfish, life forms, marine animals, sharks", "publisher": "https://www.facebook.com/CNN"}, "keywords": "celebrities, football (american), football (american) events, janet jackson, joe namath, michael jackson (entertainer), nfl, ridley scott, sports and recreation, sports events, sports figures, sports organizations and teams, super bowl, whitney houston, katy perry, animals, fish and shellfish, life forms, marine animals, sharks", "author": "Brandon Griggs", "robots": "max-image-preview:large", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1517270400.0, "source": "https://www.cnn.com", "summary": ""}