{"url": "https://www.womenshealthmag.com/relationships/a22501893/jenna-dewan-channing-tatum-interview/", "text": "First things first: Jenna Dewan smells great. I get a hint of summer florals with a white-musk base note as she breezes up to the Beverly Hills Hotel Polo Lounge. The scent, I find out, is very exclusive. Only one bottle exists, and it was custom-made at a DIY perfumery by her 5-year-old daughter, Everly, who also named it: Mermaid Dreams.\n\n“I was like, ‘Ah, this child kills me,’” Jenna says, beaming. And though today Jenna has on a white, wide-legged linen jumpsuit with strappy wedges and several delicate gold necklaces, Mermaid Dreams is pretty much all she was wearing at our Naked Truth cover shoot, outside Joshua Tree National Park in California. Nudity is something the 37-year-old has zero qualms about. “I’ve been a dancer my entire life, so I’m used to little clothing,” she says with a laugh. “You lose a sense of modesty.”\n\n“It’s challenging to go through a big change and have the whole world have an opinion about it.\"\n\nMovie star, TV host (the season-two finale of her reality competition show World of Dance airs this month), and producer are now part of Jenna’s multi-hyphenate description, but dancing is still what moves her. She was in kindergarten when her mom enrolled her in dance classes after she noticed Jenna mimicking the moves in Jane Fonda’s Workout. At 19, Jenna was tapped to join Janet Jackson’s All for You tour—even now, the routines live on in her muscle memory: “I could do ‘Rhythm Nation’ and ‘If’ in my sleep,” she says. Dance didn’t only affect Jenna’s sense of modesty; it also shaped her entire future.\n\nIf you’ve seen 2006’s Step Up, you’re familiar with the precise-yet-fluid, insane-strength-requiring moves she’s known for. You’re also familiar with the crackling chemistry she had with her costar, Channing Tatum. That chemistry sparked offscreen as well—the two married in 2009 and, four years later, had their daughter, Everly. But even if that chemistry was not entirely eclipsed, it at least dimmed enough for the couple to call it quits.\n\n\n\nDENNIS LEUPOLD\n\n\n\n\n\n“It’s been a journey, and it’s been a transformation of myself—my needs and wants as a woman,” Jenna says of the past year. “I think everyone wants to hold on to what’s in front of them, but when you open your mind, saying, ‘I want what’s best for myself and my daughter,’ you have to be okay with however that looks.” In this case, it was a parting of ways.\n\nRelated Story Channing Tatum and Jenna Dewan Announce Split\n\nIn April, Jenna and Channing announced their split on Instagram. “I feel I’ve been on a wave of growth,” she says. “It does look different; it’s a new normal, and I really think we’ll get used to that.” And though she talks about the uncoupling with an air of practiced positivity, she admits it’s been far from painless. “It’s always challenging to go through a big change and have the whole world have an opinion about it,” she says.\n\nEnduring other people’s opinions comes with the territory of fame, and Jenna is no stranger to putting herself out there. She recently learned the term mom-shaming the hard way: After posting a photo of her lingerie-clad backside on Instagram, followers claimed disappointment in her “too sexy” behavior.\n\nRelated Story Everyone Is Freaking Out About Jenna Dewan's Photo\n\nBut Jenna isn’t having it. “Apparently, when you become a mother, you’re supposed to leave your sexuality at the door, and I never understood that,” she says. “I think there’s nothing sexier than becoming a mother. You give life. It’s everything. And you don’t change who you are inside just because you have a kid.”\n\nFeeling sexy is certainly one result of her workouts, but it’s not her main goal. “I really like to feel strong, and I like to feel curvy. And when I say ‘curvy,’ I mean ‘muscular.’ In the gym, I add more weight rather than increasing reps because I want to build muscle, so I can pick up my daughter,” she says. “Before, it used to be like, ‘I wanna get long, lean muscles.’ Now, I’m just like, ‘I wanna feel strong and good.’”\n\n\n\nDENNIS LEUPOLD\n\nThough she loves taking a jazz-funk or contemporary dance class, she works regularly with trainer Jennifer “JJ Dancer” Johnson. Their sessions are typically 45 minutes, and according to JJ, Jenna makes the most of every second. “[She’s like,] ‘Let’s go hard or go home!’” JJ says. “She is a beast.” JJ even named one of her moves the Jenna Squat; it involves some hip-hop-inspired movement. “It’s a little fun, a little sexy, and a lot hard,” Jenna says. An apt move for the woman sitting across from me who somehow makes forking through her favorite salad (packed with cucumber, golden raisins, and sunflower seeds) low-key sensual.\n\n“It’s okay for a relationship to change into a new form that is actually better for both people.\"\n\nIt’s this kind of well-roundedness she seeks to exemplify for her daughter. “I’m cautious not to always say, ‘You’re beautiful,’ or ‘You look pretty.’ I say those things, but I follow it up with, ‘You’re smart, you’re strong, you’re opinionated.’” She wants future Everly to appreciate sexuality, one of the reasons she defends her intimate images. “I want my daughter to see that and be like, ‘Wow, my mother was a fully actualized, sensual woman.’” It’s clear Jenna will keep posting the pics she wants and hope the haters will learn to live and let live. “Women are so much stronger and more powerful, and living in our goddess energy, when we come together to lift each other up rather than tear each other down.”\n\nThe ease with which Jenna drops a phrase like “goddess energy” indicates that her wellness isn’t based on workouts alone. Meditation, breath work, and hosting shaman-led goddess circles are among her practices. When I ask if she’s had her aura photographed, Jenna pulls out her phone to show me a snap of her vibrant violet energy (magical, mystical, intuitive, according to the aura photographer).\n\nDENNIS LEUPOLD\n\nI realize toward the end of our chat that neither one of us has mentioned Channing by name. But when I grab the check from our server, it bears an inescapable reminder. The reservation name the restaurant has in its system is printed in all caps at the top: DEWAN-TATUM. Jenna assures me she views the situation less as an ending and more as an evolution. “It’s okay for a relationship to change into a new form that is actually better for both people involved, and I think that’s maybe what shocked everyone so much—that it can be a positive thing,” she says. “That was ultimately what happened with us.”\n\nEmerging from that change is a woman clearly in the process of coming into her own. “I did a lot of work healing from the inside out, becoming more in touch with my womanly power,” she says. “It was always, ‘I’m a dancer,’ or ‘I’m married,’ or ‘I’m an actress.’ Over the last couple of years, it became about learning about myself.” I’m reminded of something Jenna said earlier in the afternoon, about the warm Southern California weather. “I am from Texas; I’m used to heat. I’m like a snake that comes out in the sun,” she said, turning her face toward the light and smiling. Much like she shed her clothes for this story, Jenna is shedding her proverbial skin, and what’s underneath is truly a sight to behold.\n\nThis interview also appears in the September issue of Women's Health, on newsstands now.", "images": ["https://hips.hearstapps.com/hmg-prod/images/091322-love-1663947500.jpg?crop=0.502xw:1.00xh;0.247xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/jenna-dewan-3-1532118754.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/tom-brady-of-the-tampa-bay-buccaneers-celebrates-with-news-photo-1663094193.jpg?crop=0.548xw:0.776xh;0.324xw,0.0658xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/natalia-verza-wears-vuitton-sunglasses-a-white-t-shirt-and-news-photo-1663013717.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gabby-and-rachel-are-each-down-to-one-man-looking-for-news-photo-1663795755.jpg?crop=0.771xw:0.964xh;0.101xw,0.00601xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/766/articles/2017/10/jenna-dewan-tatum-lingerie-shamed-1509280212.jpg?crop=1xw:0.786xh;center,top&resize=300:*", "https://hips.hearstapps.com/vidthumb/images/2018-wh-jennadewanvegantastetest-tx-v1-edit-15-patty-1533165792.jpg?crop=1.00xw:1.00xh;0,0&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/091322-1663356184.jpg?crop=0.502xw:1.00xh;0.240xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/following-last-weeks-shocking-canceled-rose-ceremony-gabby-news-photo-1662990094.jpg?crop=0.612xw:0.766xh;0.191xw,0.0261xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/jenna-dewan-4-1532118826.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/wh-index-2000x1000-relatonship-behati-prinsloo-and-adam-levin-1664559741.jpg?crop=0.502xw:1.00xh;0.250xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/marilyn-monroe-and-joe-dimaggio-circa-1954-news-photo-1664566741.jpg?crop=0.761xw:1.00xh;0.0849xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/channing-tatum-jenna-dewan-golden-globes-2014-1522722084.jpg?crop=1.00xw:0.752xh;0,0.0457xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/gabby-and-rachel-enter-a-crucial-week-of-getting-to-know-news-photo-1663007176.jpg?crop=0.647xw:0.810xh;0.179xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/wh-ptm-hhm-lovea-1661374861.png?crop=0.5xw:1xh;center,top&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/jenna-dewan-2-1532118685.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://www.womenshealthmag.com/_assets/design-tokens/womenshealthmag/static/images/logos/network-logo.6f764c4.svg", "https://hips.hearstapps.com/hmg-prod/images/jenna-dewan-main-1532118424.jpg?crop=1.00xw:0.358xh;0,0.0743xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/woman-having-coffee-and-texting-on-her-phone-at-royalty-free-image-1641918176.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/bunch-of-red-heart-shaped-balloons-royalty-free-image-1664470945.jpg?crop=0.667xw:1.00xh;0.215xw,0&resize=180:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/jenna-dewan-main-1532118424.jpg?crop=1.00xw:0.358xh;0,0.0743xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.womenshealthmag.com/relationships/a22501893/jenna-dewan-channing-tatum-interview/", "title": "Jenna Dewan Poses Nude, Talks Channing Tatum And Motherhood", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Jenna Dewan Poses Nude, Talks Channing Tatum And Motherhood", "description": "Actress, dancer, mother, and wellness warrior Jenna Dewan bares all in a new interview, from her split with Channing Tatum to her new positive outlook on life.", "keywords": "jenna dewan, jenna dewan naked, jenna dewan channing tatum and jenna dewan", "theme-color": "#000000", "og": {"site_name": "Women's Health", "title": "Jenna Dewan Bares All: Her Relationship With Channing Is Different—In A Good Way", "description": "\"I feel I’ve been on a wave of growth.\"", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/jenna-dewan-main-1532118424.jpg?crop=1.00xw:0.358xh;0,0.0743xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.womenshealthmag.com/relationships/a22501893/jenna-dewan-channing-tatum-interview/", "type": "article"}, "fb": {"app_id": 223993857646230}, "article": {"publisher": "https://www.facebook.com/womenshealthmagazine/", "section": "Relationships", "modified_time": "2021-11-02T14:45:27Z", "published_time": "2018-07-26T13:00:00Z"}, "twitter": {"site": "@WomensHealthMag", "image": "https://hips.hearstapps.com/hmg-prod/images/jenna-dewan-main-1532118424.jpg?crop=1.00xw:0.358xh;0,0.0743xh&resize=640:*", "card": "summary_large_image"}, "google-site-verification": "mJMUXwyIdtxgKFgxuJIMK0pLRtYTrhduC6K_LFpAP8Y", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/jenna-dewan-main-1532118424.jpg?crop=1.00xw:0.714xh;0,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/jenna-dewan-main-1532118424.jpg?crop=1.00xw:0.714xh;0,0&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/jenna-dewan-main-1532118424.jpg?crop=1.00xw:0.714xh;0,0", "auto-publish": "timely", "sailthru.excerpt": "First things first: Jenna Dewan smells great. I get a hint of summer florals with a white-musk base note as she breezes up to the Beverly Hills Hotel Polo Lounge. The scent, I find out, is very exclusive. Only one bottle exists, and it was custom-made at a DIY perfumery", "sailthru.tags": "relationships,Relationships", "sailthru.date": "2018-07-26 13:00:00", "sailthru.socialtitle": "Jenna Dewan Bares All: Her Relationship With Channing Is Different—In A Good Way", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 44}, "movies": [], "publish_date": 1532610000.0, "source": "https://www.womenshealthmag.com", "summary": ""}