{"url": "https://www.independent.co.uk/arts-entertainment/films/guillermo-del-toro-golden-globes-refuse-leave-stage-music-speech-shape-of-water-a8147196.html", "text": "Get our free weekly email for all the latest cinematic news from our film critic Clarisse Loughrey Get our The Life Cinematic email for free Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nThe Life Cinematic email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nGuillermo Del Toro won 'Best Director' for his film The Shape of Water at the 2018 Golden Globe Awards, and he wasn't about to let anyone steal his glory.\n\nAfter the orchestra began playing music after he barely began his speech, Del Toro insisted he deserved more time since he had waited so long for this accolade.\n\nThe Shape of Water director wasn't going to let mood music ruin his moment.\n\n\"Lower the music,\" he said, once the music began. \"It's taken 25 years. Give me a minute. Give me a minute!\"\n\nHis wish was the Golden Globes' command because he got to continue his acceptance speech.\n\n\"For 25 years I have handcrafted very strange little tales made of motion, colour, light and shadow,\" he explained. \"In three precise instances, these strange stories, these fables, have saved my life. Once with Devil's Backbone, once with Pan's Labyrinth, and now with Shape of Water, because as directors, these things are not just entries in a filmography. We have made a deal with a particularly inefficient devil that trades three years of our lives for one entry on IMDb. And these things are biography and they are alive.\"\n\nThe Shape of Water stars Octavia Spencer, Michael Shannon, Sally Hawkins and Doug Jones.\n\nWearing black for women – activists and actors at the Golden Globes Show all 55 1 /55 Wearing black for women – activists and actors at the Golden Globes Wearing black for women – activists and actors at the Golden Globes Meryl Street and Ai-jen Poo Rex Features Wearing black for women – activists and actors at the Golden Globes Rosa Clemente and Susan Sarandon Getty Images Wearing black for women – activists and actors at the Golden Globes Shailene Woodley and activist Calina Lawrence NBCU Photo Bank via Getty Images Wearing black for women – activists and actors at the Golden Globes Emma Watson and Marai Larasi Rex Features Wearing black for women – activists and actors at the Golden Globes Amy Poehler and Saru Jayaraman Rex Features Wearing black for women – activists and actors at the Golden Globes Laura Dern and Mónica Ramírez Rex Features Wearing black for women – activists and actors at the Golden Globes Michelle Williams and Tarana Burke Rex Features Wearing black for women – activists and actors at the Golden Globes Debra Messing Rex Features Wearing black for women – activists and actors at the Golden Globes Caitriona Balfe Rex Features Wearing black for women – activists and actors at the Golden Globes Allison Williams Rex Features Wearing black for women – activists and actors at the Golden Globes Zoe Kravitz Rex Features Wearing black for women – activists and actors at the Golden Globes Viola Davis and Julius Tennon Rex Features Wearing black for women – activists and actors at the Golden Globes Tracee Ellis Ross Rex Features Wearing black for women – activists and actors at the Golden Globes Sarah Paulson Rex Features Wearing black for women – activists and actors at the Golden Globes Sadie Sink Rex Features Wearing black for women – activists and actors at the Golden Globes Rita Moreno Rex Features Wearing black for women – activists and actors at the Golden Globes Octavia Spencer and Jessica Chastain Rex Features Wearing black for women – activists and actors at the Golden Globes Millie Bobby Brown Rex Features Wearing black for women – activists and actors at the Golden Globes Michelle Pfeiffer Rex Features Wearing black for women – activists and actors at the Golden Globes Margot Robbie Rex Features Wearing black for women – activists and actors at the Golden Globes Mandy Moore Rex Features Wearing black for women – activists and actors at the Golden Globes Maggie Gyllenhaal Rex Features Wearing black for women – activists and actors at the Golden Globes Lily James Rex Features Wearing black for women – activists and actors at the Golden Globes Kendall Jenner Rex Features Wearing black for women – activists and actors at the Golden Globes Kit Harrington Rex Features Wearing black for women – activists and actors at the Golden Globes Kerry Washington Rex Features Wearing black for women – activists and actors at the Golden Globes Kelly Clarkson Rex Features Wearing black for women – activists and actors at the Golden Globes Dakota Johnson Rex Features Wearing black for women – activists and actors at the Golden Globes Kate Hudson Rex Features Wearing black for women – activists and actors at the Golden Globes Jessica Biel Rex Features Wearing black for women – activists and actors at the Golden Globes Jamie Chung Rex Features Wearing black for women – activists and actors at the Golden Globes James Franco and Dave Franco Rex Features Wearing black for women – activists and actors at the Golden Globes Issa Rae Rex Features Wearing black for women – activists and actors at the Golden Globes Isabelle Huppert Rex Features Wearing black for women – activists and actors at the Golden Globes Heidi Klum Rex Features Wearing black for women – activists and actors at the Golden Globes Gwendoline Christie Rex Features Wearing black for women – activists and actors at the Golden Globes Geena Davis Rex Features Wearing black for women – activists and actors at the Golden Globes Claire Foy Rex Features Wearing black for women – activists and actors at the Golden Globes Elisabeth Moss Rex Features Wearing black for women – activists and actors at the Golden Globes Diane Kruger Rex Features Wearing black for women – activists and actors at the Golden Globes Catherine Zeta-Jones Rex Features Wearing black for women – activists and actors at the Golden Globes Angelina Jolie Rex Features Wearing black for women – activists and actors at the Golden Globes Nicole Kidman Rex Features Wearing black for women – activists and actors at the Golden Globes Mary J. Blige Rex Features Wearing black for women – activists and actors at the Golden Globes Mariah Carey Rex Features Wearing black for women – activists and actors at the Golden Globes Katherine Langford Rex Features Wearing black for women – activists and actors at the Golden Globes Salma Hayek and Ashley Judd Rex Features Wearing black for women – activists and actors at the Golden Globes Gillian Anderson Rex Features Wearing black for women – activists and actors at the Golden Globes Gal Gadot Rex Features Wearing black for women – activists and actors at the Golden Globes Emilia Clarke Rex Features Wearing black for women – activists and actors at the Golden Globes Alicia Vikander Rex Features Wearing black for women – activists and actors at the Golden Globes America Ferrera and Natalie Portman Rex Features Wearing black for women – activists and actors at the Golden Globes Sally Hawkins Rex Features Wearing black for women – activists and actors at the Golden Globes Saoirse Ronan Rex Features Wearing black for women – activists and actors at the Golden Globes Reese Witherspoon and Eva Longoria Rex Features\n\nDel Toro was nominated alongside Martin McDonagh for Three Billboards Outside Ebbing, Missouri, Christopher Nolan's Dunkirk, Ridley Scott for All The Money In The World and Steven Spielberg for The Post.\n\nThe director's speech wasn't the only impassioned one of the night - Oprah Winfrey gave a memorable monologue for her acceptance of the Cecil B. DeMille award for excellent contributions to the entertainment industry.\n\nThis is Del Toro's first Golden Globe win.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/08/05/guillermo-del-toro-golden-globes.jpg?quality=75&width=1200&auto=webp", "https://www.independent.co.uk/img/pixels-player-logo.svg", "https://www.independent.co.uk/img/logo-white-out.svg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/08/05/guillermo-del-toro-golden-globes.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Ilana Kaplan", "New York"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/films/guillermo-del-toro-golden-globes-refuse-leave-stage-music-speech-shape-of-water-a8147196.html", "title": "Guillermo Del Toro refuses to leave Golden Globes stage despite time being up: 'It's taken 25 years'", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "He stood his ground", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "Film", "sitename": "The Independent", "page path": "/arts-entertainment/films", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2018-01-08T12:47:58.000Z", "site_name": "The Independent", "title": "The Golden Globes tried to get Guillermo Del Toro off stage but he refused with a glorious response", "url": "https://www.independent.co.uk/arts-entertainment/films/guillermo-del-toro-golden-globes-refuse-leave-stage-music-speech-shape-of-water-a8147196.html", "type": "article", "description": "He stood his ground", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/08/05/guillermo-del-toro-golden-globes.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/08/05/guillermo-del-toro-golden-globes.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2018-01-08T12:47:58.000Z", "modified_time": "2018-01-08T12:47:58.000Z", "section": "Culture", "subsection": "Film", "author_name": "Ilana Kaplan", "content_type": "story", "word_count": 312, "image_count": 1, "embed_count": 2, "video_count": 1, "internal_link_count": 1, "external_link_count": 0}, "date": "2018-01-08T12:47:58.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "The Golden Globes tried to get Guillermo Del Toro off stage but he refused with a glorious response", "site": "@Independent", "card": "summary_large_image", "description": "He stood his ground", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/08/05/guillermo-del-toro-golden-globes.jpg?quality=75&width=1200&auto=webp"}, "keywords": "Golden Globes 2018,Guillermo Del Toro,The Shape of Water,All the Money in the World,Dunkirk,Oprah Winfrey,post,Internal"}, "movies": [], "publish_date": 1515415678.0, "source": "https://www.independent.co.uk", "summary": ""}