{"url": "https://www.hollywoodreporter.com/live-feed/handmaids-tale-season-2-refresher-1103615", "text": "“They should have never given us uniforms if they didn’t want us to be an army.”\n\nOffred offers these prophetic words in “Night,” the tenth and final episode of The Handmaid’s Tale‘s first season. At least, one hopes they are prophetic, given the state of the world in which the show takes place: Gilead, a grotesque reimagining of America in which religious extremists have seized control and repainted the nation in sickening shades of misogyny, fanaticism and fascism.\n\nBased on the Margaret Atwood novel of the same name, Handmaid’s Tale landed on Hulu in 2017 with cosmic impact, meteoric in quality, holding a dark mirror up against the world in which we live. For its second act, which debuts April 25 on the streaming service with two new episodes, the series, from executive producer and showrunner Bruce Miller, charts a path forward that’s largely untethered from Atwood’s novel. As a result, the future is far from certain for Offred and the other denizens of Gilead.\n\nBefore the season premiere, which promises to launch straight back into the next phase of Offred’s life, catch up on exactly how The Handmaid’s Tale closed out for the show’s series regulars, as well as a look ahead at what’s coming next, based on minor spoilers already revealed by cast and crew.\n\nJune, also known as Offred\n\nPlayed by: Elisabeth Moss\n\nLast seen: Stepping into a van for parts unknown, delivering one last piece of narration: “Whether this is my end or a new beginning, I have no way of knowing. I’ve given myself over to the hands of strangers. I have no choice. It can’t be helped. And so I step up into the darkness within, or else the light.”\n\nWhat’s next: Great question, and one that Offred herself was likely asking at the end of the first season. While it’s unclear where she’ll wind up at the end of her current van ride, showrunner Miller has already revealed that June, currently pregnant, will wind up on the run in season two. Exactly how that comes to pass, whether she makes it as far as Little America, and whether she’s able to find her daughter Hannah while on the road? Those are other questions entirely, with uncertain answers at best.\n\nCommander Fred Waterford\n\nPlayed by: Joseph Fiennes\n\nLast seen: “I’ve had quite a day. How about you?” Seen with his wife, watching as Offred is taken away to parts unknown, already feeling mistrustful of the handmaid he had spent so much time obsessing over.\n\nWhat’s next: There are a few key plot points to remember about Waterford, one of the founders and leading men behind the Gilead regime. A close confidant and colleague was severely punished for overstepping his boundaries with Janice, which should understandably rattle Waterford, given his own relationship with Offred in season one. Additionally, shortly before Offred’s departure, Waterford and Serena made a vow to focus solely on their own family following the birth of “their” child. Expect both of those tensions to loom large over Joseph Fiennes‘ role in season two.\n\nSerena Joy Waterford\n\nPlayed by: Yvonne Strahovski\n\nLast seen: “Praise be His mercy. He’s answered our prayers.” Moved by Offred’s pregnancy and trying to maintain control over the handmaid by threatening her daughter, Serena was even more furious than her husband at the sight of Offred’s departure.\n\nWhat’s next: Since we know Offred will go on the run this season, it’s easy to imagine how Serena will react: furiously. She’s already taken out her aggression on Offred in the form of physical punishment. Even worse, she’s threatened Offred’s child’s life, making a public display over Hannah’s safety. “As long as my child is safe, so is yours,” she said in the finale. With Offred on the run, Serena is positioned to make good on her word — and by good, we mean the opposite.\n\nNick Blaine\n\nPlayed by: Max Minghella\n\nLast seen: “Just go with them. Trust me.” The Waterford’s driver and eye of Gilead (not to mention the father of Offred’s unborn child) was last seen whispering to Offred moments before she was taken away, urging her to go with them.\n\nWhat’s next: Nick’s final words of the season are ones that should be swimming around the collective minds of the Handmaid’s Tale audience. With his role as a spy for Gilead, Nick is as connected to the behind-the-scenes dealings as anyone. If he’s telling June to trust the process of what’s coming next, then it’s reasonable to assume she will be safe for now. But how will Nick survive June’s looming escape? After all, Serena not only saw Nick and June’s tender moment in the kitchen following the revelation of her pregnancy; she knows full well that Nick is the unborn child’s probable father. The Hulu show has yet to kill off a series regular, and one wonders if Minghella’s Nick will be the first person to break the seal.\n\nAunt Lydia\n\nPlayed by: Ann Dowd\n\nLast seen: “Watch the space between you. There’s enough for everyone.” Lydia was last seen presiding over the stoning of “Ofwarren,” which fell through thanks to Offred and others’ defiance.\n\nWhat’s next: Never one to tolerate disobedience lightly, Lydia was slighted in a very severe way in the final moments of season one. “Go home and think about what you have done,” she told her handmaids, moments after they declined to murder Janine. “There will be consequences. Believe me.” Expect those consequences to make themselves known very early on in season two, and expect them to be very severe indeed.\n\nJanine, also known as Ofwarren\n\nPlayed by: Madeline Brewer\n\nLast seen: “Not too hard, OK?” Janine, who had attempted suicide in the face of feeling jilted by her lover, was spared a brutal execution at the hands of her fellow handmaids.\n\nWhat’s next: Frankly, it’s somewhat astonishing that Janine is still alive heading into season two. Not only should she have died from her suicidal leap from the bridge, she only escaped death thanks to her fellow handmaids rising up against Lydia’s commands. How will Janine survive season two? Well, she might not, as previews for the season have shown Janine’s next destination — one she shares with the next character on the board …\n\nEmily, also known as Ofglen\n\nPlayed by: Alexis Bledel\n\nLast seen: It’s been quite a while since we last saw Emily, occasionally known as the handmaid Ofglen. Last seen in season one’s fifth episode, the Mayday operative was taken into custody and has been sent to …\n\nWhat’s next: Like Janine, Emily will spend at least the early portion of season two in the Colonies, an irradiated stretch of Gilead where people are sent to toil away their lives, without any expectation of surviving. In season one, the Colonies are described as worse than a death sentence. Given what Emily has already endured in the series, however, she stands as strong a shot as anyone to defy those lethal odds. Whatever fate awaits, we at least know this: Emily will cross paths with the new character played by Marisa Tomei in the season’s second episode.\n\nMoira\n\nPlayed by: Samira Wiley\n\nLast seen: “Praised be, bitch. Here’s your damn package.” Toward the end of the season, Moira drove as far away as humanly possible from her Jezebel life as “Ruby,” finally reaching Little America in Canada, and reuniting with the next (and last) person on this list.\n\nWhat’s next: For most of the first season, both viewers and June alike assumed Moira was dead; there were few reasons to doubt reports to the contrary. Now, Moira is not only alive, but she’s free from Gilead … at least in terms of her immediate physical safety. On a more existential level, Moira has suffered through the kind of damage that doesn’t heal overnight, if it ever fully heals at all. In her final scenes of the season, Wiley played Moira’s integration into Canada with a stunned and shell-shocked quality, indicating that it will take time and effort before her character recovers to the point that she can enjoy the health insurance and other benefits that come along with life north of the border.\n\nLuke Bankole\n\nPlayed by: O-T Fagbenle\n\nLast seen: “They called me up. You’re on my list.” June’s gentle-mannered husband was originally believed to be killed at the time she was apprehended, but toward the end of season one, it was revealed that Luke had survived; what’s more, he’s a free man living in Canada, reunited with Moira.\n\nWhat’s next: At this point in the series, Luke and June both know the other is alive. But what can and will Luke do to make sure that his wife is not only alive, but safely away from Gilead? And what about their daughter, Hannah? Both Luke and Moira stand on some of the most compelling ground heading into season two, as representatives of what resistance against a viciously dictatorial regime looks like on foreign soil.\n\nWhat are your predictions for Handmaid’s Tale season two? Sound off in the comments section and follow our coverage all season long at THR.com/HandmaidsTale.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_handmaids_tale_s01e01_still_2_embed.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_handmaids_tale_s01e01_still_1_embed.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_handmaids_tale_s01e08_still_1_embed.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_handmaids_tale_s01e05_still_1_embed.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_handmaids_tale_s02e01_still_2.jpg?w=1296&h=730&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_handmaids_tale_s01e10_still_1_embed.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_handmaids_tale_s01e10_still_2_embed.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_handmaids_tale_s01e09_still_1_embed.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_handmaids_tale_s01e05_still_2_embed.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_handmaids_tale_s01e07_still_1_embed.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_handmaids_tale_s02e01_still_2.jpg?w=1024"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_handmaids_tale_s02e01_still_2.jpg?w=1024", "keywords": [], "authors": ["Josh Wigler"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/handmaids-tale-season-2-refresher-1103615/", "title": "‘The Handmaid’s Tale’: Where Everyone Left Off and What’s Next in Season 2", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "THR forecasts the future for Offred (Elisabeth Moss) and Gilead's other denizens ahead of the season two premiere.", "news_keywords": "The Handmaid's Tale", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Josh Wigler", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1103615, "title": "'The Handmaid's Tale': Where Everyone Left Off and What's Next in Season 2", "published_at": "2018-04-18 10:22:11", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_handmaids_tale_s02e01_still_2.jpg?w=1024", "comment_count": 0, "tags": "The Handmaid's Tale", "topics": "TV News", "body": "\"They should have never given us uniforms if they didn't want us to be an army.\"\r\nOffred offers these prophetic words in \"Night,\" the tenth and final episode of The Handmaid's Tale's first season. At least, one hopes they are prophetic, given the state of the world in which the show takes place: Gilead, a grotesque reimagining of America in which religious extremists have seized control and repainted the nation in sickening shades of misogyny, fanaticism and fascism. \r\nBased on the Margaret Atwood novel of the same name, Handmaid's Tale landed on Hulu in 2017 with cosmic impact, meteoric in quality, holding a dark mirror up against the world in which we live. For its second act, which debuts April 25 on the streaming service with two new episodes, the series, from executive producer and showrunner Bruce Miller, charts a path forward that's largely untethered from Atwood's novel. As a result, the future is far from certain for Offred and the other denizens of Gilead.\r\n\r\nBefore the season premiere, which promises to launch straight back into the next phase of Offred's life, catch up on exactly how The Handmaid's Tale closed out for the show's series regulars, as well as a look ahead at what's coming next, based on minor spoilers already revealed by cast and crew.\r\n\r\nJune, also known as Offred\r\nPlayed by: Elisabeth Moss\r\nLast seen: Stepping into a van for parts unknown, delivering one last piece of narration: \"Whether this is my end or a new beginning, I have no way of knowing. I've given myself over to the hands of strangers. I have no choice. It can't be helped. And so I step up into the darkness within, or else the light.\"\r\nWhat's next: Great question, and one that Offred herself was likely asking at the end of the first season. While it's unclear where she'll wind up at the end of her current van ride, showrunner Miller has already revealed that June, currently pregnant, will wind up on the run in season two. Exactly how that comes to pass, whether she makes it as far as Little America, and whether she's able to find her daughter Hannah while on the road? Those are other questions entirely, with uncertain answers at best.\r\n\r\nCommander Fred Waterford\r\nPlayed by: Joseph Fiennes\r\nLast seen: \"I've had quite a day. How about you?\" Seen with his wife, watching as Offred is taken away to parts unknown, already feeling mistrustful of the handmaid he had spent so much time obsessing over.\r\nWhat's next: There are a few key plot points to remember about Waterford, one of the founders and leading men behind the Gilead regime. A close confidant and colleague was severely punished for overstepping his boundaries with Janice, which should understandably rattle Waterford, given his own relationship with Offred in season one. Additionally, shortly before Offred's departure, Waterford and Serena made a vow to focus solely on their own family following the birth of \"their\" child. Expect both of those tensions to loom large over Joseph Fiennes' role in season two.\r\n\r\nSerena Joy Waterford\r\nPlayed by: Yvonne Strahovski\r\nLast seen: \"Praise be His mercy. He's answered our prayers.\" Moved by Offred's pregnancy and trying to maintain control over the handmaid by threatening her daughter, Serena was even more furious than her husband at the sight of Offred's departure.\r\nWhat's next: Since we know Offred will go on the run this season, it's easy to imagine how Serena will react: furiously. She's already taken out her aggression on Offred in the form of physical punishment. Even worse, she's threatened Offred's child's life, making a public display over Hannah's safety. \"As long as my child is safe, so is yours,\" she said in the finale. With Offred on the run, Serena is positioned to make good on her word — and by good, we mean the opposite.\r\n\r\nNick Blaine\r\nPlayed by: Max Minghella\r\nLast seen: \"Just go with them. Trust me.\" The Waterford's driver and eye of Gilead (not to mention the father of Offred's unborn child) was last seen whispering to Offred moments before she was taken away, urging her to go with them.\r\nWhat's next: Nick's final words of the season are ones that should be swimming around the collective minds of the Handmaid's Tale audience. With his role as a spy for Gilead, Nick is as connected to the behind-the-scenes dealings as anyone. If he's telling June to trust the process of what's coming next, then it's reasonable to assume she will be safe for now. But how will Nick survive June's looming escape? After all, Serena not only saw Nick and June's tender moment in the kitchen following the revelation of her pregnancy; she knows full well that Nick is the unborn child's probable father. The Hulu show has yet to kill off a series regular, and one wonders if Minghella's Nick will be the first person to break the seal.\r\n\r\nAunt Lydia\r\nPlayed by: Ann Dowd\r\nLast seen: \"Watch the space between you. There's enough for everyone.\" Lydia was last seen presiding over the stoning of \"Ofwarren,\" which fell through thanks to Offred and others' defiance.\r\nWhat's next: Never one to tolerate disobedience lightly, Lydia was slighted in a very severe way in the final moments of season one. \"Go home and think about what you have done,\" she told her handmaids, moments after they declined to murder Janine. \"There will be consequences. Believe me.\" Expect those consequences to make themselves known very early on in season two, and expect them to be very severe indeed.\r\n\r\nJanine, also known as Ofwarren\r\nPlayed by: Madeline Brewer\r\nLast seen: \"Not too hard, OK?\" Janine, who had attempted suicide in the face of feeling jilted by her lover, was spared a brutal execution at the hands of her fellow handmaids.\r\nWhat's next: Frankly, it's somewhat astonishing that Janine is still alive heading into season two. Not only should she have died from her suicidal leap from the bridge, she only escaped death thanks to her fellow handmaids rising up against Lydia's commands. How will Janine survive season two? Well, she might not, as previews for the season have shown Janine's next destination — one she shares with the next character on the board ...\r\n\r\nEmily, also known as Ofglen\r\nPlayed by: Alexis Bledel\r\nLast seen: It's been quite a while since we last saw Emily, occasionally known as the handmaid Ofglen. Last seen in season one's fifth episode, the Mayday operative was taken into custody and has been sent to ...\r\nWhat's next: Like Janine, Emily will spend at least the early portion of season two in the Colonies, an irradiated stretch of Gilead where people are sent to toil away their lives, without any expectation of surviving. In season one, the Colonies are described as worse than a death sentence. Given what Emily has already endured in the series, however, she stands as strong a shot as anyone to defy those lethal odds. Whatever fate awaits, we at least know this: Emily will cross paths with the new character played by Marisa Tomei in the season's second episode.\r\n\r\nMoira\r\nPlayed by: Samira Wiley\r\nLast seen: \"Praised be, bitch. Here's your damn package.\" Toward the end of the season, Moira drove as far away as humanly possible from her Jezebel life as \"Ruby,\" finally reaching Little America in Canada, and reuniting with the next (and last) person on this list.\r\nWhat's next: For most of the first season, both viewers and June alike assumed Moira was dead; there were few reasons to doubt reports to the contrary. Now, Moira is not only alive, but she's free from Gilead ... at least in terms of her immediate physical safety. On a more existential level, Moira has suffered through the kind of damage that doesn't heal overnight, if it ever fully heals at all. In her final scenes of the season, Wiley played Moira's integration into Canada with a stunned and shell-shocked quality, indicating that it will take time and effort before her character recovers to the point that she can enjoy the health insurance and other benefits that come along with life north of the border.\r\n\r\nLuke Bankole\r\nPlayed by: O-T Fagbenle\r\nLast seen: \"They called me up. You're on my list.\" June's gentle-mannered husband was originally believed to be killed at the time she was apprehended, but toward the end of season one, it was revealed that Luke had survived; what's more, he's a free man living in Canada, reunited with Moira.\r\nWhat's next: At this point in the series, Luke and June both know the other is alive. But what can and will Luke do to make sure that his wife is not only alive, but safely away from Gilead? And what about their daughter, Hannah? Both Luke and Moira stand on some of the most compelling ground heading into season two, as representatives of what resistance against a viciously dictatorial regime looks like on foreign soil. \r\n\r\nWhat are your predictions for Handmaid's Tale season two? Sound off in the comments section and follow our coverage all season long at THR.com/HandmaidsTale.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘The Handmaid’s Tale’: Where Everyone Left Off and What’s Next in Season 2", "url": "https://www.hollywoodreporter.com/tv/tv-news/handmaids-tale-season-2-refresher-1103615/", "description": "THR forecasts the future for Offred (Elisabeth Moss) and Gilead’s other denizens ahead of the season two premiere.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_handmaids_tale_s02e01_still_2.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-04-18T10:22:11+00:00", "modified_time": "2018-04-20T08:16:31+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘The Handmaid’s Tale’: Where Everyone Left Off and What’s Next in Season 2", "description": "THR forecasts the future for Offred (Elisabeth Moss) and Gilead’s other denizens ahead of the season two premiere.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_handmaids_tale_s02e01_still_2.jpg?w=1296"}}, "movies": [], "publish_date": 1524046931.0, "source": "https://www.hollywoodreporter.com", "summary": ""}