{"url": "www.marieclaire.com/celebrity/g18655293/brad-pitt-jennifer-aniston-relationship-timeline/", "text": "Marie Claire newsletter Celebrity news, beauty, fashion advice, and fascinating features, delivered straight to your inbox! Contact me with news and offers from other Future brands Thank you for signing up to . You will receive a verification email shortly. There was a problem. Please refresh the page and try again. By submitting your information you agree to the Terms & Conditions (opens in new tab) and Privacy Policy (opens in new tab) and are aged 16 or over.\n\nJennifer Aniston and Brad Pitt have gone from film's hottest couple to husband and wife to nemeses to...great friends? It seems so: Pitt and Aniston have been seen more and more together in the years post-split. And now that Pitt and Aniston are both single once again, following Pitt's ongoing divorce from Angelina Jolie and Aniston's divorce from Justin Theroux, debating whether or not they will (or should) reunite (opens in new tab) has become a national pastime.\n\nAfter a certain SAG awards ceremony, fans went into overdrive. You know, the one where the exes were spotted together publicly for the first time in a while (opens in new tab) and appeared to be delighted to see each other? Since then, fans have been convinced it's just a matter of time until the two get together again, even though the exes insist they're just good friends. They've have been anxiously awaiting any and all updates, included a very special Zoom scene the two did together (if you don't know what we're talking about, just wait 'til you see it). In honor of The Great Debate, let's take a look back at Brad and Jen's love story, spanning over a quarter of a century, and the latest developments.\n\n1994\n\n(Image credit: Kevin Winter / Getty Images)\n\nThe two cross paths for the first time, and Hollywood is forever changed. In an interview with (opens in new tab)Rolling Stone (opens in new tab), Aniston says they first met back in 1994 since their managers were friends. \"[Pitt] was just this sweet guy from Missouri, you know? A normal guy,\" she said.\n\n1998\n\n(Image credit: Getty Images)\n\nPitt and Aniston go on their first date after being set up by their agents—a true Hollywood romance, right? They try to keep things quiet for as long as they can, but this proves difficult since Pitt is one of the biggest movie stars in the world and Aniston is America's sweetheart. (Also, big ups to their beauty lewks in this photo.)\n\nSeptember 12, 1999\n\n(Image credit: Getty Images)\n\nPitt and Aniston make their public debut as a couple on the red carpet for the Emmy Awards in 1999—forever immortalizing Brad's sunglasses.\n\nNovember 21, 1999\n\n(Image credit: Getty Images)\n\nJust a few months after that initial debut, Pitt and Aniston crash the stage of a Sting concert (ha ha ha ha) in New York City and flaunt their engagement. In their defense, there was no Instagram back then.\n\nJuly 29, 2000\n\n(Image credit: Getty Images)\n\nPitt and Aniston tie the knot in a lavish Malibu wedding, which is naturally hounded by paparazzi—thus the aerial shots. Look at all those tents! The phrase \"media circus\" couldn't be more apt.\n\nJuly 29, 2000\n\n(Image credit: Getty Images)\n\nThere are literally fireworks the night of the wedding. It was that lavish.\n\nSeptember 10, 2000\n\n(Image credit: Getty Images)\n\nPitt and Aniston make another appearance at the Emmy Awards, this time as newlyweds (and looking classy AF, we might add).\n\nSeptember 2001\n\n(Image credit: Getty Images)\n\nAniston talks about Pitt in an interview with Rolling Stone (opens in new tab). She admits that her friends worried he would be a \"conceited f*ck\" at first, but immediately came around because he's actually just the best person. She also talks marriage and being in it for the long haul.\n\nTo quote: \"You know if there's ever an argument, it's not like you can go, 'Screw you, I'm outta here!' You're there for the long haul. It's a beautiful thing to actually realize that for the first time, to have that knowing. It takes the heat and the weight out of things.\"\n\nNovember 2001\n\n(Image credit: Getty Images)\n\nBrad Pitt guest stars in Friends (specifically, \"The One with the Rumor\") where he wears a jaunty sweater and frosted tips and, oh yeah, hates Rachel Green. It's a major moment for people into his relationship with Aniston, a.k.a. everyone.\n\nJanuary 20, 2002\n\n(Image credit: Getty Images)\n\nPitt and Aniston attend the Golden Globes, where both she and Friends are nominated. Neither wins, but they matched outfits, so there's that.\n\nFebruary 2003\n\n(Image credit: Getty Images)\n\nWhen an interviewer for a W magazine (opens in new tab) profile refers to Pitt as the love of Aniston's life, her response is...interesting.\n\n\"Is he the love of my life? I think you’re always sort of wondering, 'Are you the love of my life?' I mean, I don’t know, I’ve never been someone who says, 'He’s the love of my life.' He’s certainly a big love in my life...And I know that we have something special, especially in all this chaos. In this nutty, brilliant, wonderful, hard business that we have, it’s nice to have somebody who’s anchored and knows you, really knows all of you.\"\n\nJanuary 2004\n\nAniston tells Diane Sawyer that she and Pitt both knew they were meant to be on their first date: \"It was weird...That was a really easy evening. It was really fun.\"\n\nFebruary 2004\n\n(Image credit: event, premiere, smile, fun, formal wear, suit, dress, outerwear, little black dress,)\n\nIn an interview with The Guardian (opens in new tab), Aniston talks about the end of Friends and her desire to start a family with Pitt: \"It's time. It's time. You know, I think you can work with a baby, I think you can work pregnant, I think you can do all of it. So I'm just truly looking forward to slowing down.\"\n\nJanuary 2005\n\n(Image credit: Getty Images)\n\nPitt and Aniston officially split, offering the below joint statement (opens in new tab):\n\n\"We would like to announce that after seven years together we have decided to formally separate. For those who follow these sorts of things, we would like to explain that our separation is not the result of any of the speculation reported by the tabloid media. This decision is the result of much thoughtful consideration. We happily remain committed and caring friends with great love and admiration for one another. We ask in advance for your kindness and sensitivity in the coming months.\"\n\nSeptember 2005\n\n(Image credit: Getty Images)\n\nAniston addresses the split in an interview with Vanity Fair (opens in new tab), and famously describes Pitt as \"missing a sensitivity chip\" thanks to a W magazine spread featuring him and Jolie.\n\n\"Brad is not mean-spirited; he would never intentionally try to rub something in my face,\" she says. \"In hindsight, I can see him going, 'Oh—I can see that that was inconsiderate.' But I know Brad. Brad would say, 'That’s art!' There’s a sensitivity chip that’s missing.\"\n\nSeptember 2005\n\n(Image credit: RJ Capak / Getty Images)\n\nIn that same interview with Vanity Fair (opens in new tab), she also addressed the rumors of her not wanting to have children caused the split. “That really pissed me off,” she said to the magazine. “I’ve never in my life said I didn’t want to have children. I did and I do and I will! The women that inspire me are the ones who have careers and children; why would I want to limit myself? I’ve always wanted to have children, and I would never give up that experience for a career. I want to have it all.”\n\nOctober 2005\n\n(Image credit: Getty Images)\n\nPitt and Aniston's divorce is finalized.\n\nDecember 2008\n\n(Image credit: Getty Images)\n\nAniston talks Pitt and Jolie again, this time with Vogue (opens in new tab). She explains that she was hurt by stories Brangelina shared with the press about falling for each other during their marriage.\n\n\"There was stuff printed there that was definitely from a time when I was unaware that it was happening,\" she says. \"I felt those details were a little inappropriate to discuss. That stuff about how she couldn't wait to get to work every day? That was really uncool.\"\n\nSeptember 2011\n\n(Image credit: Ian Gavan / Getty Images)\n\nPitt *finally* addressed his breakup with Aniston and how he \"spent the '90s trying to hide out.\" He told Parade (opens in new tab), \"It became very clear to me that I was intent on trying to find a movie about an interesting life, but I wasn’t living an interesting life myself. I think that my marriage [to Aniston] had something to do with it. Trying to pretend the marriage was something that it wasn’t.\"\n\nSeptember 2011\n\n(Image credit: George Pimentel / Getty Images)\n\nYeah, so uh, people thought from Pitt's comments he was calling Aniston \"uninteresting,\" which is, like, never the move. He later issued a statement (opens in new tab) saying, \"It grieves me that this was interpreted this way. Jen is an incredibly giving, loving and hilarious woman who remains my friend. It is an important relationship I value greatly. The point I was trying to make is not that Jen was dull, but that I was becoming dull to myself—and that, I am responsible for.\"\n\nSeptember 2014\n\n(Image credit: Getty Images)\n\nBrad Pitt and Angelina Jolie officially marry (opens in new tab).\n\nJan. 21, 2015\n\n(Image credit: C Flanigan / Getty Images)\n\nAniston keeps it real and lets us known that Pitt actually never did anything wrong when they were together. \"We’re not in daily communication,” she said to the Hollywood Reporter (opens in new tab). “But we wish nothing but wonderful things for each other. Nobody did anything wrong. You know what I mean? It was just, like, sometimes things [happen]. If the world only could just stop with the stupid, soap-opera bullshit. There’s no story.\"\n\nAugust 5, 2015\n\n(Image credit: Getty Images)\n\nJennifer Aniston and Justin Theroux tie the knot (opens in new tab) (or at least have a ceremony (opens in new tab)).\n\nSeptember 15, 2016\n\n(Image credit: Getty Images)\n\nAngelina Jolie files for divorce (opens in new tab) from Brad Pitt.\n\nNovember 2016\n\nA post shared by @justintheroux (opens in new tab) A photo posted by on\n\nJustin Theroux posts an Instagram (opens in new tab) that most definitely says \"f*ck brad pitt.\" Is it shade? Probably not considering he edited the post to include the hashtag: \"#andNOthispostisNOT'shading'anyonebecauseimnotelevemyearsoldimeanseriously.\"\n\nMarch 2017\n\n(Image credit: Getty Images)\n\nIt's reported (opens in new tab) that Pitt and Aniston are in contact. Sources say he tracked down his ex's number so he could wish her a happy birthday, and that they've \"been texting.\" What's more, apparently Pitt \"told her he’s having a hard time with his split and they exchanged a few texts reminiscing about the past.\" Hmmmm.\n\nDecember 2017\n\n(Image credit: Getty Images)\n\nBrad Pitt starts \"casually dating (opens in new tab)\" in the wake of his split from Angelina Jolie, with a source saying: \"He has been going out but there is nothing serious in the dating area at all, nothing to speak of at this point.\"\n\nFebruary 15, 2018\n\n(Image credit: Getty Images)\n\nJennifer Aniston and Justin Theroux announce (opens in new tab) their separation. Twitter explodes with hope that Aniston and Pitt are getting back together, mostly in the form of Rachel Green GIFs.\n\nFebruary 21, 2018\n\n(Image credit: Jeff Vespa / Getty Images)\n\nYeah, so apparently Aniston kept little love notes from Pitt from when they were married. (Sweet, IMO.) Apparently Theroux found them two years prior, when they were already married. Ouch.\n\n“He stumbled upon old Post-it notes Brad had written,” said a source to Us Weekly. (opens in new tab) “Sweet little Post-its like, ‘You looked nice tonight’ or ‘Miss you already.’”\n\nDec. 7, 2018\n\n(Image credit: Axelle/Bauer-Griffin / Getty Images)\n\nAniston keeps it real about both of her marriages in an interview with ELLE. \"I don't feel a void. I really don't. My marriages, they've been very successful, in [my] personal opinion,\" she said. (opens in new tab) \"And when they came to an end, it was a choice that was made because we chose to be happy and sometimes happiness didn't exist within that arrangement anymore.\"\n\nFebruary 9, 2019\n\n(Image credit: Jason Merritt / Getty Images)\n\nAniston celebrated her 50th birthday with a star-studded party at the Sunset Tower Hotel in Los Angeles. Pitt, who was spotted at the venue, was among the guests, according to People (opens in new tab).\n\nJune 5, 2019\n\n(Image credit: Stephane Cardinale - Corbis / Getty Images)\n\nAfter reports of Pitt being seen at Aniston's 50th birthday bash, everyone had one question: \"Are you getting back together, or no?\"\n\nPitt responded to the forever-asked-question to a hounding paparazzi cameraman by merely saying (opens in new tab), \" Oh my god,\" before stepping into his car and telling the cameraman to \"have a good one.\" So, uh, mood?\n\nAugust 6, 2019\n\n(Image credit: David Livingston / Getty Images)\n\nDon't freak out, but Aniston is definitely back in the dating game, reports ET (opens in new tab). Her Friends co-stars encouraged her to get back in the saddle, so she's been casually treading the waters. Also, she's still in contact with Pitt, a source told the outlet, and they talk occasionally.\n\nDec. 16, 2019\n\n(Image credit: ANGELA WEISS / Getty Images)\n\nSo, Aniston threw an \"intimate\" holiday bash for her close friends...and guess who came? You guessed it: Pitt. According to Entertainment Tonight: \"[Brad] was among the first to arrive and the second to last guest to leave around 11 p.m.\" Other guests at the star-studded (but intimate!) party included Gwyneth Paltrow, Tom Hanks, Kate Hudson, Lisa Kudrow, and Reese Witherspoon.\n\nDec. 25, 2019\n\n(Image credit: Kevin Winter / Getty Images)\n\nIs this a Christmas miracle? A source tells (opens in new tab)Us Weekly (opens in new tab) that Pitt and Aniston \"have a wonderful connection that might seem flirtatious at times.\" Um, what! The source went on to say, \"They dig each other’s sense of humor and have an infectious energy when they’re together, but they insist things are purely platonic and nothing more than that.\"\n\nJan. 19, 2020\n\n(Image credit: Emma McIntyre / Getty Images)\n\nNow self-professed \"good friends,\" Aniston and Pitt's support of each other was on full show at the 2020 SAG Awards. First, Pitt cracked a joke about his failed marriages, (opens in new tab)and Aniston laughed and applauded; then Aniston won an award, and Pitt watched tenderly from backstage. Then they ran into each other afterwards and were photographed together (opens in new tab)for the first time in years. Plus, is this body language a little flirty, or is it just me?\n\nJan. 22, 2020\n\n(Image credit: Vivien Killilea / Getty Images)\n\nIt's a couple of days after the storm, and my life has not known peace since. To make matters worse (but honestly better), a source tells People that the reunion was accepted happily. \"They are friends and happy for each other. They want nothing but happiness for each other,\" said the source (opens in new tab). \"She is happy to have Brad back in her life as a friend, but that's it.\"\n\nJanuary 31, 2020\n\nA post shared by @nina.clare (opens in new tab) A photo posted by on\n\nWord gets out that Pitt and Aniston share the same stylists (opens in new tab), duo Nina and Clare Hallworth, and everyone loses their sh*t. Unfortunately, they've never styled them for the same event, but a girl can dream.\n\nApril 1, 2020\n\n(Image credit: Andrew Shawaf / Getty Images)\n\nIn some kind of sick April Fools joke, a bunch of tabloids start to spread a fake story (opens in new tab) that Aniston and Pitt are dating and planning a secret Mexican beach wedding. They even went as far as to say Aniston's ex Justin Theroux was on the guest list. Riiiight. Yeah, let's just say this has yet to happen.\n\nJune 14, 2020\n\n(Image credit: Chris Graythen / Getty Images)\n\nWord gets out that Pitt matched Aniston's $1 million donation to Color of Change (opens in new tab) following the death of George Floyd (opens in new tab).\n\n\"Brad is ­really involved with the charity because of Jen and said he would match her donation,\" a source told The Mirror. (opens in new tab) \"He went to the protests this week and was at her home the day after. They are both very ­passionate and want to help as much as they can.\"\n\nSeptember 4, 2020\n\n(Image credit: Instagram/Getty)\n\nPitt is seen with his new girlfriend, Nicole Poturalski (opens in new tab), at the very same French castle where he and Jolie married in 2014. Why is this big drama, you may ask yourself? Because it was on the SAME DAY as their wedding anniversary.\n\nA source close to Pitt told Us Weekly (opens in new tab), \"He just doesn't care if Angelina is going to lash out. He expects she will.\" The most awkward part of all? They're *still* not officially divorced, even all these years later.\n\nWhat's also interesting is that Poturalski immediately starts drawing comparison to Jolie and Aniston in terms of her looks.\n\nSeptember 17, 2020\n\n(Image credit: Ron Galella, Ltd. / Getty Images)\n\nYou guys: In one of the most hilarious things to come out of 2020, several stars did a virtual live-read of Fast Times at Ridgemont High, with Pitt playing Brad and Aniston playing Linda. And they had to reenact Brad's fantasy sequence about Linda (with Morgan Freeman narrating, as a perfect chef's kiss touch). So they basically did a live-read of a very sexy scene. If you haven't seen it already, you owe it to yourself to watch the clip (opens in new tab).\n\nThroughout, Pitt gets noticeably redder and smiles sheepishly. Aniston, consummate professional that is, does her line-readings perfectly, then looks up and grins. The rest of the cast (including Julia Roberts, Matthew McConaughey, Henry Golding, and Shia LaBeouf) is visibly giggling in the background; At one point Jimmy Kimmel audibly starts laughing and makes no attempt to stop. Even though it's literally just acting, over Zoom no less, the chemistry between the two of them is palpable.\n\nLater on, a source tells Us Weekly (opens in new tab), “There’s nothing romantic going on between Brad and Jen and they actually think it’s hysterical that fans are so obsessed with them getting back together.\" So, womp womp.\n\nOctober 28, 2020\n\n(Image credit: Matthew Simmons / Getty Images)\n\nPitt and Poturalski have broken up, according to E! (opens in new tab). Apparently, \"the two split several weeks ago, and...their relationship was never serious.\" Once again, fans reignite the \"Now he has time to date Jen!\" conversation.\n\nFebruary 4, 2021\n\n(Image credit: David Livingston / Getty Images)\n\nAs spotted by Marie Claire Australia (opens in new tab), Aniston posted a picture on her Insta Stories of playing with her dog—but what got people really talking was the man in the background, lying on the floor. You can only see his chest and part of his hand, but the build and style looked really similar. You guessed it: Fans think it looks exactly like Pitt. Anonymous tips to Deuxmoi claim that Aniston is filming season 2 of The Morning Show on the same lot where Pitt's filming Bullet Train, his latest film. So it is absolutely possible it could be him in the photo, but others disputed that, saying, \"I'm 99 percent positive that's the line producers assistant.\" Clearly the only option is to go look for yourself.\n\nApril 2021\n\n(Image credit: Ron Galella, Ltd. / Getty Images)\n\nSome unverified rumors (opens in new tab) hit the interwebs (opens in new tab): First, that the two apparently still have insane chemistry (duh) and that in the relationship between Pitt and Jolie, there was always tension around his previous relationship with Aniston—like, him holding onto keepsakes and love notes kind of tension. The two are (supposedly) bonding now that he's split from Jolie and he's \"grateful\" to have been forgiven. And, according to a source, they have chatted since Jolie alleged domestic violence against Pitt, with Aniston supportive and Pitt \"devastated\" by the latest developments in his divorce. Take all of this with a grain of salt, of course.", "images": ["http://www.marieclaire.com/media/img/missing-image.svg", "https://vanilla.futurecdn.net/marieclaireus/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/tXoT5evLKeRZYeHKoNVLgB-415-80.jpg", "https://cdn.mos.cms.futurecdn.net/FDuNd4T54YhJUzWYdv75qd-1200-80.jpg", "https://www.facebook.com/tr?id=756449714459937&ev=PageView&noscript=1"], "top_img": "https://cdn.mos.cms.futurecdn.net/FDuNd4T54YhJUzWYdv75qd-1200-80.jpg", "keywords": [], "authors": ["Kayleigh Roberts", "Weekend Editor", "Julia Marzovilla", "Deena Campbell", "Charlotte Chilton", "Mehera Bonner", "The Editors", "Andrea Park", "Katherine J Igoe", "Nicole Briese"], "canonical_link": "https://www.marieclaire.com/celebrity/g18655293/brad-pitt-jennifer-aniston-relationship-timeline/", "title": "Full Brad Pitt and Jennifer Aniston Relationship Timeline", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2021-04-14T03:04:50+00:00", "description": "A complete timeline of Brad Pitt and Jennifer Aniston's relationship, from their first meeting in 1994 to marriage, infidelity, divorce, and friendship.", "robots": "max-image-preview:large", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://cdn.mos.cms.futurecdn.net/flexiimages/l0uowirhzd1627591128.svg", "og": {"site_name": "Marie Claire Magazine", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/FDuNd4T54YhJUzWYdv75qd-1200-80.jpg", "width": 1200}, "type": "article", "title": "A Brief History Lesson on Brad Pitt and Jennifer Aniston", "url": "https://www.marieclaire.com/celebrity/g18655293/brad-pitt-jennifer-aniston-relationship-timeline/", "description": "They've come a long way."}, "article": {"publisher": "https://www.facebook.com/MarieClaire", "published_time": "2021-04-14T03:04:50Z", "modified_time": "2021-04-14T03:04:50.136Z"}, "parsely-type": "post", "parsely-post-id": "7cK4RSLYjondmtzvEKKTob", "parsely-pub-date": "2021-04-14T03:04:50Z", "parsely-title": "A Complete Timeline of Brad Pitt and Jennifer Aniston's Relationship", "parsely-link": "https://www.marieclaire.com/celebrity/g18655293/brad-pitt-jennifer-aniston-relationship-timeline/", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/3t3bFTbFBygM8WSJFCZevc.jpg", "parsely-section": "Celebrity", "parsely-tags": "Category: Celebrity,Category: Feature,celebrity,entertainment,listicle,serversidehawk", "parsely-author": "Kayleigh Roberts", "twitter": {"card": "summary_large_image", "site": "@marieclaireus", "title": "A Brief History Lesson on Brad Pitt and Jennifer Aniston", "description": "They've come a long way.", "creator": "@marieclaireus", "image": "https://cdn.mos.cms.futurecdn.net/FDuNd4T54YhJUzWYdv75qd-1200-80.jpg", "account_id": 15469402}, "google-site-verification": "G8uYPAX70T_vfdmDhxnUNSykxtjRTkSvHhloGBWT6R8", "taboola": {"url": "https://www.marieclaire.com/celebrity/g18655293/brad-pitt-jennifer-aniston-relationship-timeline/"}, "botify-site-verification": "gEo2ltw4ZxjJkBcaADHlIGePpMrucY2w", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E"}, "movies": [], "publish_date": 1618369490.0, "source": "http://www.marieclaire.com", "summary": ""}