{"url": "https://www.romper.com/p/jennifer-garner-shares-why-she-wont-post-photos-of-her-kids-on-social-media-it-makes-complete-sense-8911594", "text": "Lots of people take to social media to share photos of their kids, documenting everything from birth to prom and beyond. But this week, Instagram queen Jennifer Garner explained why her kids are off limits on social media. Though she shares everything from the strange contents of her bag to photos from her own childhood, the 13 Going on 30 star has fought to keep her children away from the Hollywood spotlight, and she extends that policy to herself when she makes choices about what to post.\n\nGarner has three children from her relationship with ex-husband Ben Affleck — Violet, age 12, Seraphina, age 9, and Samuel, age 6 — and while the paparazzi manage to snap an occasional pic of the family, both Garner and Affleck have refrained from making their kids part of their public lives. While speaking with E! News about her new movie Peppermint, the actress explained that it’s a conscious decision.\n\nIn the recent interview, Garner responded to a question about how she decides what to share on her Instagram account. “Well I would never share my kids,” she told E! News. “That’s a pretty big roadblock right there because if I let myself do that it would be all [waves hands]… but I’ve fought too hard for their privacy, personally, that it feels weird.”\n\nOther members of her family are fair game though, as seen in photos like this one with her mother:\n\nGarner is far from the first celebrity to shield her children from the paparazzi. Michael Jackson famously had his children wear masks and blankets over their faces when they went out in public. In 2016, his oldest son Prince spoke to the Los Angeles Times about the experience. “My dad spoke to me like an adult. He told us the reason for the masks was he wanted us to have our own life without him,” he told the Times.\n\nMore recently, celebrities like Halle Berry and Kristen Bell have fought for the privacy of all celebrity children, according to USA Today. In 2013, Berry even helped push through legislation that makes it a crime in California for paparazzi to harass a child, according to HuffPost. Garner even testified at the hearings on the bill, saying “I chose a public life, but my three children are private citizens,” she said, as reported by HuffPost. Justin Timberlake and Jessica Biel, Ashton Kutcher and Mila Kunis, and Jennifer Lopez are all similarly protective of their children’s privacy both in traditional and social media, according to Marie Claire.\n\nIt’s no secret that people like to see their favorite celebrity's kids on social media. It gives you a feeling of getting a sneak peek into the private life of someone famous. Even Garner admits she enjoys it. “I love seeing other people’s [kids],” she told E! News in the same interview.\n\nBut even without sharing photos of her children, Garner has managed to build a successful and beloved Instagram account. Her 1.5 million followers are treated to photo of her workouts, her cute dog, things like her effort to sell Girl Scout cookies, and even at video tribute to her favorite chicken, Regina George.\n\nAll these moments are infused with the enthusiasm and joy that make Garner one of the most relatable celebrities, especially as a mom. So even without sharing her children followers get to feel like they’re truly seeing the actress as herself. Of course social media sharing isn't something limited to celebs, and how to include children is a choice every parent has to make. It's as individual and personal as every decision that come with parenting. But, for those families who do post, it sure is fun to see all those baby pics.\n\nCheck out Romper's new video series, Bearing The Motherload, where disagreeing parents from different sides of an issue sit down with a mediator and talk about how to support (and not judge) each other’s parenting perspectives. New episodes air Mondays on Facebook.", "images": ["https://cdn2.bustle.com/2022/romper/logo-3079c0c267.svg", "https://imgix.bustle.com/uploads/getty/2018/4/26/2d96a388-f5fc-4c91-9546-4bb8f23897a2-getty-875553278.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2022/10/7/5e26fef4-dfb7-48d8-b2ab-a6537a2e56f2-dfccd437-1ec5-4cf5-bf07-47c17429558e-winifred-hp.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2018/4/26/2d96a388-f5fc-4c91-9546-4bb8f23897a2-getty-875553278.jpg?w=540&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2022/10/7/df7a8be6-104c-4db1-9e55-eb84cba1b728-getty-1193190577.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/10/6/6c7441ac-6254-498b-bc14-3405863ce3d7-getty-1241120058.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2022/10/7/204b2116-72fb-4450-894a-160559b7f490-amy.PNG?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/4/26/2d96a388-f5fc-4c91-9546-4bb8f23897a2-getty-875553278.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/jennifer-garner-shares-why-she-wont-post-photos-of-her-kids-on-social-media-it-makes-complete-sense-8911594", "title": "Jennifer Garner Won't Post Photos Of Her Kids Online For This Very Understandable Reason", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image"}, "article": {"publisher": "https://www.facebook.com/romperdotcom"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/jennifer-garner-shares-why-she-wont-post-photos-of-her-kids-on-social-media-it-makes-complete-sense-8911594", "type": "article", "title": "Jennifer Garner Won't Post Photos Of Her Kids Online For This Very Understandable Reason", "description": "Lots of people take to social media to share photos of their kids, documenting everything from birth to prom and beyond. But this week, Instagram queen Jennifer Garner explained why her kids are off limits on social media. Though she shares…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/4/26/2d96a388-f5fc-4c91-9546-4bb8f23897a2-getty-875553278.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Lots of people take to social media to share photos of their kids, documenting everything from birth to prom and beyond. But this week, Instagram queen Jennifer Garner explained why her kids are off limits on social media. Though she shares…"}, "movies": [], "publish_date": null, "source": "https://www.romper.com", "summary": ""}