{"url": "https://www.theverge.com/2018/12/7/18130501/avengers-endgame-trailer-explained-ant-man-scott-lang-quantum-realm-infinity-war", "text": "By the time Avengers: Endgame comes out, there will be 22 movies in the Marvel Cinematic Universe. If you’ve skipped one or two, there may be some lingering questions after watching Endgame’s first trailer.\n\nAvengers: Endgame’s trailer sets up a surprising reveal: the surviving Avengers presumed that Scott Lang, aka Ant-Man, was killed when Thanos wiped out half of the universe’s life, only to have him turn up on their doorstep at the end of the trailer. Lang’s appearance — wildly waving his arms around and asking Captain America to let him into the makeshift Avengers headquarters — is to the great surprise of just about everyone.\n\nAnt-Man didn’t appear in Avengers: Infinity War, which could explain why heroes like Captain America, Black Widow, and Bruce Banner (the Hulk is also MIA) are shocked to learn that Lang survived. But Lang’s appearance won’t be surprising to anyone who watched Ant-Man and the Wasp, which arrived after Avengers: Infinity War.\n\n“We’re in the endgame now.”\n\nA post-credits scene from Ant-Man and the Wasp explains that while other people on Earth were shattering into dust following Thanos’ snap, Ant-Man was in the quantum realm. Ant-Man may not have been killed by Thanos’ snap — officially referred to as the Decimation, according to Marvel Comics — possibly because he wasn’t within the universe at the time.\n\nNow, and there’s still a sense of disbelief over these next few words, but Ant-Man could be key to saving the world. Doctor Strange noted in Infinity War there was only one way this could play out, and Ant-Man’s time spent in the quantum realm certainly seems like a part of that. Doctor Strange did see into the future — and he did give Thanos the Infinity Stone for a reason, saying that they were “in the endgame now.” Endgame will also likely rope in Captain Marvel and her space-traveling powers, so while everything may not rest on Ant-Man, he certainly has a bigger role than many of us may have originally thought.\n\nThere are only a few ways that Ant-Man could have escaped from the quantum realm after Hank, Janet, and Hope, who are reunited in the film, are decimated. Someone with knowledge of quantum realms, like Ava Starr / Ghost or Tony Stark (although he seems to be a bit busy being stranded in space) could potentially help with that. The Infinity Stones could reverse elements of time and space to bring Lang back, but it seems unlikely Thanos would do that.\n\nThis leaves another possibility: time vortexes. While Lang is exploring the quantum realm, he’s warned to look out for time vortexes, whose name implies that if he passes through, could reconfigure time itself. This means when Lang teams up with the Avengers — or the remaining Avengers — they could use those time vortexes to reverse time and save the population from devastation.\n\nNow, the issue with Avengers trailers — or any movie trailer — is you can’t trust them. Remember that the Hulk starred in Avengers: Infinity War’s trailers and then never appeared in the actual film. This could just be a cool gesture to throw fans from guessing what’s going to happen — like we are — but this does help to explain how the Avengers could possibly defeat Thanos going forward.\n\nIt seems that to properly understand Avengers: Endgame, people are going to have to settle in and revisit Ant-Man and the Wasp. Who could have predicted that?", "images": ["https://www.theverge.com/icons/native-ad-placeholder.png", "https://cdn.vox-cdn.com/thumbor/D217PHYdX1xjnVGyNUpEJSrVu0s=/0x0:2878x1178/1200x628/filters:focal(1439x589:1440x590)/cdn.vox-cdn.com/uploads/chorus_asset/file/13609841/Screen_Shot_2018_12_07_at_12.46.35_PM.png"], "top_img": "https://cdn.vox-cdn.com/thumbor/D217PHYdX1xjnVGyNUpEJSrVu0s=/0x0:2878x1178/1200x628/filters:focal(1439x589:1440x590)/cdn.vox-cdn.com/uploads/chorus_asset/file/13609841/Screen_Shot_2018_12_07_at_12.46.35_PM.png", "keywords": [], "authors": ["Julia Alexander"], "canonical_link": "https://www.theverge.com/2018/12/7/18130501/avengers-endgame-trailer-explained-ant-man-scott-lang-quantum-realm-infinity-war", "title": "Avengers: Endgame could turn Ant-Man into one of its most important superheroes", "meta_data": {"twitter": {"card": "summary_large_image", "site": "@verge"}, "fb": {"app_id": 549923288395304}, "og": {"site_name": "The Verge", "title": "Avengers: Endgame could turn Ant-Man into one of its most important superheroes", "description": "The one superhero to save them all", "url": "https://www.theverge.com/2018/12/7/18130501/avengers-endgame-trailer-explained-ant-man-scott-lang-quantum-realm-infinity-war", "type": "article", "image": "https://cdn.vox-cdn.com/thumbor/D217PHYdX1xjnVGyNUpEJSrVu0s=/0x0:2878x1178/1200x628/filters:focal(1439x589:1440x590)/cdn.vox-cdn.com/uploads/chorus_asset/file/13609841/Screen_Shot_2018_12_07_at_12.46.35_PM.png"}, "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Verge", "google-site-verification": "IucFf_TKtbFFH8_YeFyEteQIwYPdANM1R46_U9DpAr4", "robots": "index,follow,max-image-preview:large", "description": "The first trailer for Avengers: Endgame includes a surprising twist at the very end. It may prove to be one of the biggest moments in the film, and requires people to watch Ant-Man and the Wasp before heading out to theaters.", "article": {"published_time": "2018-12-07T18:23:12.000Z", "modified_time": "2018-12-07T18:23:12.000Z"}, "author": "Julia Alexander", "parsely-type": "post", "parsely-title": "Avengers: Endgame could turn Ant-Man into one of its most important superheroes", "parsely-link": "https://www.theverge.com/2018/12/7/18130501/avengers-endgame-trailer-explained-ant-man-scott-lang-quantum-realm-infinity-war", "parsely-image-url": "https://cdn.vox-cdn.com/thumbor/D217PHYdX1xjnVGyNUpEJSrVu0s=/0x0:2878x1178/1200x628/filters:focal(1439x589:1440x590)/cdn.vox-cdn.com/uploads/chorus_asset/file/13609841/Screen_Shot_2018_12_07_at_12.46.35_PM.png", "parsely-pub-date": "2018-12-07T18:23:12.000Z", "parsely-section": "front-page", "parsely-tags": "verge,front-page,culture,entertainment,marvel", "parsely-author": "Julia Alexander", "next-head-count": 30}, "movies": [], "publish_date": 1544140800.0, "source": "https://www.theverge.com", "summary": ""}