{"url": "https://www.etonline.com/mandy-moore-on-why-she-was-never-going-to-be-britney-spears-or-christina-aguilera-113310", "text": "Mandy Moore knows who she is, and who she isn't, meant to be.\n\nIn an interview with Bustle, the This Is Us star reflects on her time as a pop star, alongside the likes of Britney Spears and Christina Aguilera.\n\n\"They're dancers and they're entertainers and they're performers. They give their all — and costume changes! — and they can live on that level. And that was never going to be me,\" Moore says.\n\nThough her time as a pop star was short-lived, Moore also discusses her transition into acting, and the break she took from Hollywood after marrying singer Ryan Adams in 2009.\n\n\"When I think back to that particular time period that we're talking about… It was heavy,\" she shares. \"It was dark. It was confusing. It was lonely. There was no room for me. There was no room for me to have anything else in my life.”\n\nAdams and Moore split in 2015, and the Tangled star says that it was a tough decision, but the right one for her.\n\n\"It's no coincidence to me that once I did that hard work, life opened up in a way that I never could have expected,\" she notes. \"Once I did that, it was like, the sun came back out again. In every respect, I felt like, oh, now I'm living the life that I'm supposed to be living.\"\n\nThen, in 2016, Moore landed the role of Rebecca Pearson, the beloved mom on This Is Us, which has become a runaway hit, and earned Moore a Golden Globe nomination for Best Performance by an Actress in a Supporting Role.\n\nMoore says the role of Rebecca, an aspiring singer, has been slowly boosting her confidence about pursuing music again.\n\n\"Over the last year or two years since the show’s been on, those little comments being peppered into conversations give you the confidence,\" she explains. \"And to me, the wherewithal that people are like, ‘Oh, OK!’ I didn't know that people were even interested in that side of me anymore.”\n\nFans love Rebecca/Mandy's voice on the show, and the 34-year-old admitted she's still overcoming hesitations about the musical side of her life.\n\n“You have to be your biggest advocate. No one's going to do it for you. It's a stunning realization,\" Moore says. \"There's a lot of weirdness wrapped up in music for me that I still have to work through. That I don't think I'm good enough. That I don't think I'm deserving. That I allowed other people to make me feel bad about wanting to do it.”\n\nAs for her long-term plans, Moore says she looks to another Hollywood star who started young and is now an absolute powerhouse advocate for women.\n\n“I wanna find really female-focused [projects],\" she shares. \"I love what Reese Witherspoon is doing. I think she has impeccable taste and that she's a real champion for other women. And I want to do that in my own capacity. I want to maybe find something that has a musical lean to it.”\n\nThis Is Us returns Nov. 13 at 9 p.m. EST on NBC, and Moore can be heard reprising her role as Rapunzel in Ralph Breaks the Internet, along with all the other princess characters. Check out their epic reunion in the video below!\n\nRELATED CONTENT:\n\nMandy Moore Shares a Regrettable Red Carpet Flashback: 'Don't Dye Your Eyebrows'\n\nRyan Adams Apologizes For His Response to Mandy Moore's Divorce Comments\n\n'This Is Us': Who Is the Mystery Man at Rebecca's Door? Mandy Moore and Producers Tell All (Exclusive)\n\nHow 'Ralph Breaks the Internet' Brings Past Disney Princesses Back to the Screen! (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page.\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-08/GettyImages-1240426139.jpg?h=05c564aa&itok=Dkqb34Us", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-10/GettyImages-1243560296.jpg?h=27af8da9&itok=n9B1yPno", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/mandy-moore-main-gettyimages-1040553366.jpg?h=c673cd1c&itok=AhihCzlJ", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2021-09/1920fiftyshades.jpg?h=b8626526&itok=OEmzZ7ow", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-09/mandy-moore-main-gettyimages-1040553366.jpg?h=c673cd1c&itok=eCqMMLY3"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/mandy-moore-main-gettyimages-1040553366.jpg?h=c673cd1c&itok=AhihCzlJ", "keywords": [], "authors": ["Elizabeth Stanton"], "canonical_link": "https://www.etonline.com/mandy-moore-on-why-she-was-never-going-to-be-britney-spears-or-christina-aguilera-113310", "title": "Mandy Moore on Why She Was Never Going to Be Britney Spears or Christina Aguilera", "meta_data": {"article": {"opinion": "false"}, "apple-mobile-web-app-capable": "yes", "robots": "index", "description": "The actress and singer reflects on her time as a pop princess, and where she sees herself in the future.", "keywords": "News, Mandy Moore", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/mandy-moore-on-why-she-was-never-going-to-be-britney-spears-or-christina-aguilera-113310", "title": "Mandy Moore on Why She Was Never Going to Be Britney Spears", "description": "The actress and singer reflects on her time as a pop princess, and where she sees herself in the future.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/mandy-moore-main-gettyimages-1040553366.jpg?h=c673cd1c&itok=AhihCzlJ", "width": 1280, "height": 720}}, "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "twitter": {"card": "summary_large_image", "description": "The actress and singer reflects on her time as a pop princess, and where she sees herself in the future.", "site": {"identifier": "@etnow", "id": 23603092}, "title": "Mandy Moore on Why She Was Never Going to Be Britney Spears", "creator": "Elizabeth Stanton‍", "url": "https://www.etonline.com/mandy-moore-on-why-she-was-never-going-to-be-britney-spears-or-christina-aguilera-113310", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-09/mandy-moore-main-gettyimages-1040553366.jpg?h=c673cd1c&itok=AhihCzlJ"}, "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}