{"url": "https://www.townandcountrymag.com/the-scene/weddings/a18198166/paris-hilton-wedding/", "text": "In February, Paris Hilton surprised and delighted fans with the news that her then-boyfriend, venture capitalist Carter Reum, had popped the question. Hilton and Reum, both 40, had been dating for a year before Reum proposed. And after months of anticipation, the couple tied the knot on November 11 at the estate of the bride’s late grandfather Barron Hilton. While the affair boasted enough glamor to leave a lifetime of memories, the celebrations also continued throughout the weekend.\n\nHilton's wedding was well-documented on her Instagram feed, where she shared over a dozen photographs from her nuptials—plus a teaser clip from her new Peacock series, Paris in Love, where we see Reum take a knee on the beach and ask for Hilton's hand in marriage. “You’re the first man I’ve opened my heart to and shown who the “Real” Paris is. I’m so excited to share our most beautiful love story,” she wrote.\n\nBelow, find everything we know about the wedding.\n\nThe Engagement Ring\n\nWhen Reum proposed, he did so with a stunning ring designed by Jean Dousset, the great-grandson of Louis Cartier. The rock's design was inspired by classic and Art Nouveau aesthetics, as well as the vaulted glass ceiling of the Grand Palais. Want to learn more? Hilton shared a YouTube video for just that purpose.\n\nThe proposal itself, per Hilton, was equally stunning. \"As we walked to dinner along the beach, Carter led us to a cabana adorned with flowers and dropped to one knee. 💍 I said yes, yes to forever ❤️ There’s no one I’d rather spend forever with,\" she wrote on Instagram.\n\nThe Bachelorette Party\n\nHilton and Reum went the unconventional route for their bachelorette and bachelor parties, combining the two into one big bash in Las Vegas. Hilton shared a sweet video of the vacation-celebration on Instagram, writing “I can’t wait to marry you, my best friend,” in the caption. It also looks like the couple has created two hashtags for their nuptials—#ParisInLove and #HiltonReumForever—an increasingly common choice for the modern-day couple.\n\nThe Bridal Shower\n\nEveryone dreams of a fairytale-worthy love story, and Paris Hilton took that sentiment literally for her bridal shower. Less than a month before her wedding, Hilton’s loved ones came together to throw the bride-to-be an Alice in Wonderland-inspired bridal shower. Her mother Kathy, sister Nicky, and friend Tina Chen Craig put on a party for the books, where guests could walk through Wonderland to celebrate Paris—and perhaps the *magic* of love in general.\n\n\n\nThe Dress\n\nJust a few weeks before the wedding, Paris Hilton’s close friend Tina Chen Craig went live with Hilton on Instagram, where she revealed that she planned to wear 11 wedding dresses on her big day. “It’s 11/11,” the bride said of her wedding date, which is what led her to the number. While Hilton has only revealed a small glimpse into her nuptials on Instagram, a new 13-part wedding docuseries on Peacock, Paris in Love, promises an intimate look inside her wedding preparation and planning, leading up to the spectacular ceremony.\n\nParis Hilton and Carter Reum on their wedding day. A new 13-part wedding docuseries on Peacock, Paris in Love, promises an intimate look inside her wedding preparation and planning. Jose Villa/Shutterstock\n\nThe series premiered on November 11 to correspond with the wedding, and newly-released photos show off two of Hilton's extravagant dresses—both designed by Oscar de la Renta. The long sleeved gown, which Hilton wore down the aisle, features pressed flower thread work embroidery and a tulle ball skirt. The second, which she wore for the reception, is a Taffeta bustier cocktail dress with 3D floral embroidery. She accessorized the look with an array of dazzling diamonds, including a headband, necklace, earrings, and her show-stopping ring.\n\nChelsea Lauren/Shutterstock\n\nNicky Hilton, Paris’s sister and maid of honor, wore a custom alice +olivia by Stacey Bendet dress. The long-sleeved gown featured pink corded lace, a satin boned bustier, satin chiffon ruffles, and a satin bow with a train. The bridesmaids also wore dresses by alice +olivia.\n\n\n\nAhead of the wedding, Paris's mother Kathy Hilton shared one small detail about the gown. “You know how you are supposed to have something old? I am having something sewn into her wedding dress that's going to be a big surprise. I can't tell you yet, but it's going to be very special.”\n\nA sketch of the maid of honor gown, designed by alice + olivia by Stacey Bendet Courtesy of alice + olivia\n\nThe Guest List\n\nMany of Hilton's family members, close pals, and celebrity friends were in attendance, including Emma Roberts, Kim Kardashian, and Demi Lovato, who sang “I Will Always Love You” during the event.\n\nEven if you didn’t secure an invite to the wedding, there's still time to give a gift to the glamorous couple. There are a few items yet to be purchased from Hilton and Reum's registry, which includes everything from crystal glassware to Buccellati frames. The list is viewable (and shoppable!) to the public—and the items included total nearly $66,000. You can view the registry here.\n\nThe Location\n\nThe wedding reception was held at the Bel-Air estate of Barron Hilton, the bride’s late grandfather and the successor of hotelier Conrad Hilton.\n\nAccording to Kathy Hilton, two special drinks were created based on the bride’s iconic love of pink. “We're doing a special drink, Moet Rose Imperial Champagne,” Kathy said in an interview just days before the wedding. “And I wanted to have a little pink. Paris has to have a little pink in her wedding. So we're doing two special cocktails. One is going to have pink cotton candy with the champagne... I've seen it [before], I have to admit that,” she says. But guests can expect a unique twist, Hilton said, noting that they added “a couple of little secret touches to it, which gives it even a little more fizz.” The drinks were served in glasses designed by Kathy herself.\n\nThe Afterparties\n\nPrior to her wedding, Paris Hilton hinted at a multi-day extravaganza, and a multi-day extravaganza it was. Hilton and Reum kept the party going after they walked down the aisle on Thursday, hosting a carnival-themed party on Friday, followed by dinner and dancing on Saturday at the estate where they tied the knot.\n\nHilton and Reum took over the Santa Monica pier on Friday for a full night of candy-colored fun, which included carnival confections (funnel cakes, cotton candy), Paris Hilton-themed games (pinked-out ring toss), celebrity performances (DJ set by Diplo, anyone?), carnival rides (hello, Paris Wheel), and other glamorized attractions. The event was as Instagrammable as it gets, and Hilton was sure to document every moment.\n\nOn Saturday, guests reunited at Hilton’s wedding venue—Barron Hilton’s former Bel Air estate—for a formal dinner and a night dancing. Here’s to hoping Friday’s sugar rush didn’t wear off just yet.", "images": ["https://hips.hearstapps.com/hmg-prod/images/president-joe-biden-first-lady-jill-biden-grandaugher-naomi-news-photo-1658342769.jpg?crop=0.670xw:1.00xh;0.171xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/tcx090122snopener-006-1659387416.jpg?crop=0.697xw:1.00xh;0.216xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/fa3xa8guyaavkmg-1661286142.jpeg?crop=1.00xw:0.801xh;0,0.199xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/ben-affleck-jennifer-lopez-and-casey-affleck-are-seen-on-news-photo-1661180260.jpg?crop=0.734xw:1.00xh;0.181xw,0&resize=180:*", "https://www.townandcountrymag.com/_assets/design-tokens/townandcountrymag/static/images/logos/network-logo.7095410.svg", "https://hips.hearstapps.com/hmg-prod/images/paris-hilton-wedding-photo-credit-chelsea-laurenshutterstock-jpg-1636745458.jpg?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/image001-1636745181.jpg?crop=0.8898148148148147xw:1xh;center,top&resize=320:*", "https://hips.hearstapps.com/hmg-prod/images/paris-hilton-wedding-photo-credit-jose-villashutterstock-1636744956.jpg?crop=0.9998305371970853xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/vidthumb/images/parishilton-1600180903.jpg?crop=1.00xw:1.00xh;0,0&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/jlo-dress-3-1661285668.jpeg?crop=1.00xw:0.802xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/jennifer-lopez-ben-affleck-wedding-georgia-2-1662065122.jpg?crop=1.00xw:0.773xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/mr-and-mrs-pat-nugent-with-their-wedding-cake-at-the-white-news-photo-1657737774.jpg?crop=0.652xw:1.00xh;0.0946xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/paris-hilton-wedding-photo-credit-chelsea-laurenshutterstock-jpg-1636745551.jpg?crop=1.00xw:0.591xh;0.00160xw,0.0755xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/wedding-gifts-1631827912.jpg?crop=0.319xw:0.638xh;0.657xw,0.186xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/jumpsuits-1660060640.jpg?crop=0.503xw:1.00xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/tc-wedding-advent-1660324223.jpg?crop=0.501xw:1.00xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/setting5-jpg-1658507891.jpg?crop=0.668xw:1.00xh;0.179xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/sheryl-sandberg-outgoing-chief-operating-officer-of-meta-news-photo-1661182449.jpg?crop=0.670xw:1.00xh;0.131xw,0&resize=180:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/paris-hilton-wedding-photo-credit-chelsea-laurenshutterstock-jpg-1636745551.jpg?crop=1.00xw:0.591xh;0.00160xw,0.0755xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.townandcountrymag.com/the-scene/weddings/a18198166/paris-hilton-wedding/", "title": "Details on the Dress, Date & More", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Paris Hilton Wedding News - Details on the Dress, Date & More", "description": "On November 11, 2021, Paris Hilton married venture capitalist Carter Reum in Bel Air. Here's everything we know about their wedding, from the engagement to the big day.", "keywords": "Paris Hilton, Chris Zylka, Paris Hilton wedding, Paris Hilton Wedding Details, Paris Hilton Wedding news, Paris Hilton Wedding Date, Paris Hilton Wedding dress, Paris Hilton Wedding location, Paris Hilton wedding Planner, Paris Hilton Wedding Ring", "theme-color": "#000000", "og": {"site_name": "Town & Country", "title": "Paris Hilton’s Wedding Celebrations Continued Through the Weekend", "description": "The new bride followed up her big day with a carnival extravaganza on the Santa Monica pier, and a dinner party the next night.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/paris-hilton-wedding-photo-credit-chelsea-laurenshutterstock-jpg-1636745551.jpg?crop=1.00xw:0.591xh;0.00160xw,0.0755xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.townandcountrymag.com/the-scene/weddings/a18198166/paris-hilton-wedding/", "type": "article"}, "fb": {"app_id": 526594570689062, "pages": 344794953432}, "article": {"publisher": "https://www.facebook.com/TownandCountryMagazine", "section": "Weddings", "modified_time": "2021-12-16T18:28:17Z", "published_time": "2021-11-15T19:50:00Z"}, "twitter": {"site": "@TandCmag", "image": "https://hips.hearstapps.com/hmg-prod/images/paris-hilton-wedding-photo-credit-chelsea-laurenshutterstock-jpg-1636745551.jpg?crop=1.00xw:0.591xh;0.00160xw,0.0755xh&resize=640:*", "card": "summary_large_image"}, "google-site-verification": "musQPiBADe3f4WpT4JNcg9uUChC3qnOhhPLSR4n1urM", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/paris-hilton-wedding-photo-credit-chelsea-laurenshutterstock-jpg-1636745551.jpg?crop=0.851xw:1.00xh;0.0529xw,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/paris-hilton-wedding-photo-credit-chelsea-laurenshutterstock-jpg-1636745551.jpg?crop=0.851xw:1.00xh;0.0529xw,0&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/paris-hilton-wedding-photo-credit-chelsea-laurenshutterstock-jpg-1636745551.jpg?crop=0.851xw:1.00xh;0.0529xw,0", "auto-publish": "timely", "sailthru.excerpt": "In February, Paris Hilton surprised and delighted fans with the news that her then-boyfriend, venture capitalist Carter Reum, had popped the question. Hilton and Reum, both 40, had been dating for a year before Reum proposed. And after months of anticipation, the couple tied the knot on November 11 at", "sailthru.tags": "the-scene,The Scene,weddings,Weddings", "sailthru.date": "2021-11-15 19:50:00", "sailthru.socialtitle": "Paris Hilton’s Wedding Celebrations Continued Through the Weekend", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 45}, "movies": [], "publish_date": 1637005800.0, "source": "https://www.townandcountrymag.com", "summary": ""}