{"url": "https://familydoctor.org/condition/lupus/", "text": "Living with lupus\n\nWhen you are first diagnosed with lupus, you may have conflicting feelings. You may be relieved to finally know what is causing your symptoms. You may also have feelings of sadness, fear, confusion, and anger. Some people who have lupus have bouts of depression because of the challenges of living with this disease. Learning all you can about your illness can help you better cope with your symptoms, prevent flares, and deal with side effects and complications.\n\nLupus can affect and damage different parts of your body.\n\nKidneys\n\nYour kidneys get rid of waste and other toxins from the body. Lupus can affect the kidneys and cause the structures that filter the blood to swell. Without treatment, lupus can lead to permanent kidney damage. If lupus affects your kidneys, you will probably need medicine to prevent serious damage. The most common symptom of kidney problems is swelling in your feet, legs, hands, or eyelids.\n\nHeart\n\nLupus can inflame the sac around your heart and cause chest pain. Though less common, but more serious, it can harden the walls of your coronary arteries. This can lead to angina (chest pain) and an increased risk of coronary artery disease. Lupus can also cause inflammation of the heart itself, which can lead to scarring and possible heart failure.\n\nLungs\n\nInflammation can also occur in the lining of your lungs. This can cause chest pain, which is often felt with deep breathing. People who have lupus are at risk of getting pneumonia.\n\nJoints\n\nMost people who have lupus have swollen and painful joints. These symptoms can come and go and may affect several joints at once. Usually, there is no long-term damage.\n\nSkin\n\nPeople who have lupus often get a butterfly-shaped, red rash across their nose and cheeks. This is called a malar rash. Other parts of the skin may be affected. You could have raised bumps or dry patches, often on areas that are exposed to the sun. You could get sores inside your mouth or nose. Hair loss (alopecia) is common during flares. You may notice a blotchy purple color on your hands, fingers, or toes. This happens when blood does not flow well to the skin’s surface. It is called Raynaud’s Disease.\n\nCentral Nervous System\n\nLupus can affect your brain and the nerves in your spinal cord. Symptoms include headaches, dizziness, mild confusion or memory problems, vision problems, and changes in your mood. It can lead to more serious health issues, such as seizures or a stroke.\n\nBlood\n\nLupus can cause the number of red blood cells, white blood cells, and platelets to decrease. Fewer red blood cells can lead to anemia, which is common in people who have lupus. White blood cells help the body fight infection. Rarely, do white blood cells get low enough to cause infection. Platelets help your blood to clot. A low platelet count can lead to easy bruising, nosebleeds, and other bleeding. It can also cause your blood to clot too easily or in unneeded places. If the blood clot breaks away and travels through the bloodstream, it can block blood vessels and cause serious problems, such as a stroke, blood clots in the lungs (thrombosis), or repeated miscarriages.\n\nTalking to others about lupus\n\nOthers won’t be able to see most of the symptoms caused by your lupus. When symptoms like pain, fatigue, depression, or joint stiffness make your regular tasks more difficult, it’s important to know how to talk to those around you.\n\nIt may help to start by explaining what lupus is not. Let people know that is not contagious, nor is it like cancer or HIV or AIDS. Then explain what lupus is. Let them know that it is chronic, which means you will have it forever, and that it affects each person differently.\n\nYour conversations with others about lupus may change depending on who you are talking to.\n\nTell your family and friends. Tell your loved ones about your symptoms and treatment. Make sure they understand that you will be okay, but that sometimes you may say “no” to things. They can help you to manage your schedule. They can also pitch in when you need help with things, like childcare or household tasks. Tell your job. If you feel it is okay to do so, you may want to work with your employer to make your workplace more comfortable for you. This might mean getting a better desk chair or requesting a flexible work schedule. If your employer won’t work with you, you may want to find a job that’s more manageable with your lupus. Remember, health problems like lupus are protected by the Americans with Disabilities Act. Tell your school. You will want to register with your school’s accessibility office and learn about financial assistance opportunities. Talk to your professors, advisors, and maybe even your roommates about your lupus and what will you do if it causes you to miss something. Make sure not to overload your course schedule.\n\nIf you don’t feel that you have anyone you can talk to about your lupus, or if you’d like more resources, it may be helpful to seek out a therapist or an online support group.\n\nManaging your lupus\n\nIt may take time to find the right combination of treatment options for your lupus. Work with your doctor to take an active role in managing your lupus. You can do this by:\n\nTracking your symptoms. Use a journal to track what your symptoms are and when they are worst. If you are taking medications, track any side effects you may notice.\n\nUse a journal to track what your symptoms are and when they are worst. If you are taking medications, track any side effects you may notice. Take the medications your doctor prescribes. If you experience side effects from a medicine, don’t just stop taking it. Talk to your doctor first.\n\nIf you experience side effects from a medicine, don’t just stop taking it. Talk to your doctor first. Communicate regularly with your doctor. Managing your lupus will require a team approach. Keep your doctor updated on how you’re feeling. Make sure you express any questions or concerns. It can be helpful to bring your journal with you to doctor appointments so that you remember everything you want to talk about.\n\nTalking with your doctor about all of your symptoms and getting the right lab tests are important steps to arriving at an accurate diagnosis.\n\nIf you aren’t sure where to begin, the Lupus Foundation of America can help you to find the resources and support you need. These resources include:", "images": ["https://familydoctor.org/wp-content/uploads/2010/01/admin-logo.png", "https://familydoctor.org/wp-content/uploads/2000/09/5464810_l-250x170.jpg", "https://familydoctor.org/wp-content/uploads/2016/11/bottle-pills-250x170.jpg", "https://familydoctor.org/wp-content/themes/familydoctor-child/images/icon-print@2x.png", "https://familydoctor.org/wp-content/themes/familydoctor-child/images/chevron.png", "https://www.facebook.com/tr?id=297209990620305&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=568027847384514&ev=PageView&noscript=1", "https://familydoctor.org/wp-content/uploads/2016/11/FD-Logo-White.png", "https://familydoctor.org/wp-content/themes/familydoctor-child/images/icon-close.png", "https://familydoctor.org/wp-content/uploads/2016/10/man_exam-705x370.jpg", "https://familydoctor.org/wp-content/themes/familydoctor-child/images/icon-search-orange.png", "https://familydoctor.org/wp-content/uploads/2016/11/clock-250x170.jpg", "https://familydoctor.org/wp-content/themes/familydoctor-child/images/arrow-down.png", "https://familydoctor.org/wp-content/uploads/2016/11/aafp-foundation-e1520869366904.png", "https://familydoctor.org/wp-content/uploads/2016/10/man_exam.jpg", "https://familydoctor.org/wp-content/uploads/2016/11/144139945-cd6058b9-3483-4769-aa61-c10c4ea11dea-1-2-e1641936044865.png", "https://familydoctor.org/wp-content/themes/familydoctor-child/images/logo-mobile.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://familydoctor.org/wp-content/uploads/2016/11/aafp-e1520870301332.png", "https://familydoctor.org/wp-content/themes/familydoctor-child/images/arrow-up.png"], "top_img": "https://familydoctor.org/wp-content/uploads/2016/10/man_exam.jpg", "keywords": [], "authors": ["Familydoctor.Org Editorial Staff"], "canonical_link": "https://familydoctor.org/condition/lupus/", "title": "What Is Lupus? - Symptoms and Treatment", "meta_data": {"viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-title": "familydoctor.org", "type": "article", "author": "familydoctor.org editorial staff", "keywords": "azathioprine,butterfly-shaped rash,cutaneous lupus erythematosus,cyclophosphamide,Discoid lupus erythematosus,Drug-induced lupus,fatigue,fever,hair loss,headache,immune system,kidney problems,low blood count,memory problems,mouth ulcers,Neonatal lupus,pain,rash,Raynaud's disease,Systemic lupus erythematosus", "robots": "max-image-preview:large, index,follow", "description": "Lupus is a disease that causes your immune system to become overactive and attack healthy cells and tissue. Lupus can be different for different people.", "og": {"locale": {"identifier": "en_US", "alternate": "es_ES"}, "type": "article", "title": "What Is Lupus? - Symptoms and Treatment | familydoctor.org", "description": "Lupus is a disease that causes your immune system to become overactive and attack healthy cells and tissue. Lupus can be different for different people.", "url": "https://familydoctor.org/condition/lupus/", "site_name": "familydoctor.org", "image": {"identifier": "https://familydoctor.org/wp-content/uploads/2016/10/man_exam.jpg", "width": 1200, "height": 630, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/familydoc", "modified_time": "2021-03-31T19:21:19+00:00"}, "twitter": {"card": "summary_large_image", "site": "@familydoctor"}, "generator": "AMP for WP 1.0.77.51", "TagPages": "1.64", "position": 3}, "movies": [], "publish_date": null, "source": "https://familydoctor.org", "summary": ""}