{"url": "https://www.spoilertv.com/2018/04/the-arrangement-sessions-scene-23.html", "text": "\n\n\n\nAfter a fast paced start to the season, “The Sessions” and “Scene 23” of The Arrangement stopped to catch its breath. While slower paced episodes are not necessarily problematic, per se, both episodes had their faults. The standout scenes from the two would definitely be the scenes between Megan and Terence. The chemistry between Christine Evangelista and Michael Vartan was off the charts, and I was sort of sad to everything resolved in one episode. It was this weirdly intoxicating game of cat and mouse, and I was on the edge of my seat the entire time. Besides their explosive interactions, there wasn’t much else of note. Kyle continues to doubt himself as a director and shut Megan out, which is both predictable and frustrating. Would it kill him to open up to his fiancée? Elsewhere, Deann’s affair with Mason comes to a confusing end, leading to the introduction of Mason’s son. As for where that storyline’s going I have no idea. It was just one ineffective twist and turn after another. Viewers were also “treated” to the reappearance of Hope, who may or may not be coming back. So without further ado, let’s dive in.\n\n\n\n\n\ngood friend\n\nSo Megan and Terence’s sessions didn’t go exactly how I thought they would. At the beginning of “The Sessions” the pair start their work together and things get off to an ambiguous start, only to be made more precarious when Terence wants to accelerate their work. Terence can tell Megan’s bullshitting him, not buying her response about how she finds it difficult to get out of bed in the morning, just lying there and waiting to be judged. He believes there’s something else at the core of her stress. He may be a douche, but he is right, as Megan tells Shaun she can’t keep faking her way through their sessions; Terence is too sharp. In an attempt to go someplace Megan doesn’t want to, the pair watch Megan’s videoed answer to the “three imperatives” from the pilot. While Megan thinks she’s being glib, Terence believes someone’s hiding real pain, something she’s still hiding. Despite Megan supposedly working through her issues at the facility, Terence believes something is still triggering Megan. Megan may think the imperatives are bullshit – they’re just about how people act and react – but Terence says they’re only bullshit if Megan wants them to be. If Megan is open, those answers can be extremely powerful. He then asks Megan what her greatest fear is, and surprisingly, she tells him a version of the truth. While viewers could have guessed Megan’s greatest fear was Terence, I never actually expected her to tell him to his face. I had just assumed the two would play this game of cat and mouse during their sessions, but I was completely taken aback by her revelation. The reasons Megan told Terence make sense: He controls every aspect of her, and if she disappoints him – like getting back in touch with Hope – everything she has goes away. Terence has already forced Megan to go the facility; what else is he truly capable of doing to her? And if Terence were to find out about Megan’s plan to take down IHM, she could end up in a ditch somewhere, just like Kyle’s weird in-home therapist from season one. On top of everything, Megan has no idea who Terence really is, besides being the puppet master who controls her entire life. So what does Terence do upon learning this? Well, he decides to rectify the situation by letting Megan get to know him better.So if anyone was expecting some sort of weird IHM seminar, they would be sorely mistaken as Terence takes Megan to a diner to talk. Yes, a diner. Not exactly the direction I thought he’d go in, but OK. Just like viewers, Megan wants to know how this is all going to work. Terence says this is Megan’s opportunity to get to know him, so she can ask him anything she wants. When asked what his greatest fear, Terence claims it’s snakes. However, Megan sees right through that answer. When Megan pressed him, he looked terrified, as viewers saw him flashback to someone trying to kill him. While Terence claims he’s worked very hard to harness his fear, Megan doesn’t think so, as he never honestly answered her question. She keeps insisting, and he finally caves, making her promise not to tell anyone. He tells Megan someone tried to kill him last week, and, in that moment, he believed he was going to die. However, there’s nothing Terence can do about it. Neither he nor the police will probably ever find that guy. That feeling of powerlessness is how Terence’s mother made him feel. He reveals he used to eat fries with butter as a child. Despite his mother forbidding it, Terence would do it anyway. Apparently, he had issues with authority. No surprise there. After being caught though, Terence’s mom would drag him into the kitchen and force him to eat a whole stick of butter. Where was his father during this whole ordeal, you ask? Well, Terence’s father died when Terence was young. After divulging some much about his personal life, Terence wants to know why Megan is so fixated on his childhood. Megan says pretending a little boy is sitting across from her makes Terence a little less terrifying. He’s just a person, like everyone else. Well, not exactly like anyone else, but the scenes at the diner did wonders to provide some much need backstory for Terence. With the show mainly following Kyle and Megan, viewers have had little opportunity to really get to know Terence as other than a villain. He’s still a despicable human being, but for the first time, viewers got to see him a three-dimensional character. While none of his childhood trauma excuses his behavior, it does inform his actions. Megan and viewers now have a better idea of what makes Terence Terence, of why he is the way he is.Megan’s takeaway from the diner was that Terence doesn’t like to be vulnerable, and tells Shaun she’s taking him out for drinks. Since he’s exposed, Megan wants to take advantage of that. Even though Shaun has reservations, Megan doesn’t. While no one should go through something like that, Terence isn’t a good man. During drinks, Terence tells Megan there are certain things he’s done and choices he has to live with, like maybe forcing Megan to the facility for instance. Megan feels that by opening up about her regrets, something she was forced to do at the facility, it freed her, but Terence wants to know why they’re here. How is Megan collapsing at a public event freeing? Terence again wants to know why Megan is so interested in him, not believing her concern over wanting to help him. He then proposes Megan’s fear of Terence is just a projection, a stand-in for the true enigma in her life: Her father. So if anyone else was confused about where that idea came from, you’re not alone. One minute the pair are slow dancing, and then the next, Terence is like you’re not scared of me; you’re just projecting onto me about the man who abandoned you. While Megan tells Terence her father didn’t abandon her, the truth is she doesn’t know why. Terence then shares that his father abandoned him too, dropping dead of a heart attack at 40 and leaving him with his mother. Terence said that experience dictated every choice he has made since, believing Megan’s father abandoning her has had the same impact. Terence says if Megan doesn’t confront her anger, then it’ll keep eating her up from the inside. How does he know? Well she’s just like him. In an effort to have Megan confront that anger, Terence gives her a file on where her father is, telling her their work together is done, but now her real work begins. After such an intense turn of events, I wasn’t expecting their sessions to end so abruptly. The chemistry between Christine Evangelista and Michael Vartan was off the charts that I was sort of sad to everything resolved in one episode. I feel like a few episodes of the pair sparing while playing their ever changing game of cat and mouse would have been phenomenal to watch. As much as I hate Terence, I would love to see him and Megan interact more after both actors proved how explosive they are together.Besides going through the ringer with Terence, Megan also has to deal with Kyle’s overbearing nature. After the cast has their first table read, Deann and Kyle are both worried about Megan’s performance. When Kyle asks for Terence’s opinion about Megan, Terence says he thinks Megan was focused, maybe a little cold, but Kyle will get her there. However, Kyle wants to know how Terence’s session with Megan went. With shooting only being three days away, Kyle doesn’t want Terence to rattle her. And then during a lunch with Megan, Kyle, Xavier, and Xavier’s girlfriend, Kyle openly suggests Megan draw from her real life experiences with her mother’s death when they shoot the first scene. However, Megan feels like the way Kyle brought up the scene was some sort of test. Kyle just wants Megan to be ready, as she seems distracted, not that he blames her. With them planning a wedding and making a movie and Megan spending all her time with Terence, so of course, Megan would be distracted. Megan says she’s spending time with Terence to try to figure some stuff out and feels like Kyle’s projecting. Megan believes Kyle’s concern over her performance is really just him projecting his fear onto her about how he’s going to mess the film up. She’ll be ready in two days and tells Kyle to deal with his own fears. This argument was particularly illuminating, as it showed just how much pressure Kyle is under. Like he tells Xavier, he can’t afford to step on any landmines; this movie is too important. For his entire acting career, he has played a part, but this time, he can’t hide behind a character. For Kyle, it’s easier to blame Megan than actually deal with his own issues. How the movie turns out will mostly fall on his shoulders, so instead of dealing with his anxiety, he takes it out on Megan, who’s already going through a lot with Terence. It’s particularly annoying that he doesn’t share his fears with Megan after they had they great conversation about Kyle’s worries in “Surface Tension.” He really should have had more faith in Megan as she absolutely kills the hospital scene on the first take, despite a small hiccup in the beginning. He may no longer need to worry about Megan’s performance, but near the end of “The Sessions,” he finds out some bad news about’s testing numbers.“Scene 23” starts with Megan, Kyle, Terence and Deann on their way to the premiere of. Everyone wants to make sure Kyle is all right, asdidn’t test well with audiences. On the red carpet, Kyle stresses he made the movie for the fans. While Megan tries to put a positive spin on the film, Terence says this is new territory, as Kyle has never had a film lose money before. Trying to make the best of the situation, or maybe ignoring reality, Kyle decides to do the whole talk show circuit to promote, believing if the film’s promoted the right way, then maybe they can save the movie somehow. While Kyle tells Deann he’ll figure out a way to make it all work that clearly isn’t the case when he’s onset the next day, blowing off both a crew member and Xavier who need his help. He was so focused on trying to salvagethat he risked the quality of. However, it seems like the film can’t be saved as along with another batch of bad reviews, people are trashingonline. Megan wants to make sure Kyle is all right, but he brushes off her concerns once again. Megan tells Kyle he doesn’t have to pretend with her, just wanting him to be real with her. She tells him they’re getting married, which means supporting each other through the good and bad, ups and downs. Instead of comforting Kyle, Megan’s words just make him angrier. It takes him like another twenty minutes until he can admit that Megan was right: The bad reviews and trash talk online were completely humiliating. And why didn’t he just come out and say it? Well, Kyle said he has voices in his head telling him he’s a failure, and now everyone knows, but mostly he’s scared of Megan thinking he’s a failure. So while it’s great that Kyle finally opened up to Megan, he needed to have this conversation with her the morning after their fight on “The Sessions” and not after a morethansex scene on set. At the end of the episode, Kyle says Megan was right: They should be sharing what they’re going through. It’s getting repetitive to keep watching this couple take one step forward, then two steps back. Like either start communicating or see a therapist.While Megan and Shaun have hit a roadblock in how to take down IHM – Shaun mentioned in “The Sessions” she wasn’t and won’t be able to see what Megan saw at the facility – Megan has the crazy idea to reach out to Hope. As viewers will remember, Hope mentioned in season one knowing people who had been through hell at IHM. Sensibly, Shaun doesn’t think it’s a good idea; this is the same person who leaked nude pictures of Megan to the press after she wasn’t the center of attention for one night after all. However, Megan just wants Hope to put her in touch with some people, believing this is her only option and reaching out to Hope despite Shaun’s objections. When Megan and Hope finally reunite, the awkwardness between the two is palpable. Megan asks Hope if thelead can put her in contact with people who have had bad experiences with IHM. When Hope asks why, Megan doesn’t elaborate, but eventually Hope agrees to reach out to her actor friend to see if said friend’s boyfriend would be willing to talk. After getting a text from Hope confirming the meetup with Hope’s friend’s boyfriend, Megan goes to meet her former friend. While they wait, the two easily fall back into their former roles of best friends until Megan learns the guy isn’t coming. Obviously, Megan’s upset, but Hope said she just wanted a chance to patch things up with Megan. While wanting to make up with Megan is admirable, Hope shouldn’t have lied to Megan yet again. Hope may have finally made it in Hollywood, but she’s still her same old self. So after the failed meetup, I wasn’t expecting anything else to happen, but the real shocker came at the end of “Scene 23” when Zach, also known as Kyle’s assistant, revealed he was the one who was supposed to meet Megan. Apparently Zach has some serious dirt on IHM, but he tells Megan they need to be careful as IHM and Terence are always listening. Upon learning this, however, Megan tells Zach she has no idea what he’s talking about. Given everything that IHM and Terence has put Megan through, it wasn’t really that surprising that she rebuffed Zach’s efforts. For all she knows, this could be another trap set by Terence. As much as Megan and viewers learned about him in “The Sessions,” he is still a very dangerous and powerful man, who wouldn’t think twice about testing her loyalties, in the name of protecting Kyle.We all knew happily ever after couldn’t last forever for Deann and Mason. While the lovers are out at dinner, Mason announces she has to go back to Napa. One of the vineyard’s major buyers pulled out, but fixing the problem isn’t as simple as slapping on it and flying back to Deann. Mason’s says the time she’s spent with Deann has been amazing, but she’s been there for months and now her business is suffering. However, Deann doesn’t believe Mason’s reason for needing to rush back to Napa so abruptly. The pair are closer than they have been in decades, and in Deann’s mind, Mason is running away. For Deann, Mason’s is once again pushing her away, but Mason remembers things a little differently. According to Mason, Deann chose Terence and the lifestyle that came with him over Mason years ago. It’s a she said she said situation, and while viewers may never know exactly what happened, both women are probably a little bit right. Mason may in fact be running, and Deann probably did choose Terence and that extravagant lifestyle over Mason. Despite leaving things unsettled, Deann decides she can’t go back to just once a year. She leaves Mason a voicemail, telling Mason she’ll come to Napa and then they’ll figure it out together. I’d say get the private jet ready, but things take a sharp 180-degree turn when Deann learns from Wes, Mason’s son, that Mason has died. Was anyone else besides me just confused at the sudden death of Mason? Her death wasn’t so much as shocking as just weird. I wasn’t expecting the characters to ride off into the sunset together, but I didn’t expect the writers to just kill Mason off. While the actress may have only been available for three episodes, it just seems like lazy writing to me. Viewers were introduced to this mysterious woman from Deann’s past, but we hardly got to know, or care about her, before she was six feet under. Like I feel bad for Deann because she obviously cared about this woman, but Mason’s sudden death packed no emotional punch. Wouldn’t it have been more powerful if Mason died on screen, in the arms of Deann? That may seem a little, or a lot, cliché, but it would have been a more appropriate sendoff. What had started out as a promising story arc completely disintegrated in the span of ten seconds.As agrieving lover, Deann is understandably heartbroken, to the point where Megan finds her crying on the bathroom atpremiere. So naturally Deann attends Mason’s funeral and tells Wes, played by’s Jacob Artist, how sorry she is for his loss. While Deann is at a loss to express how much Mason meant to her, Wes has a pretty good idea, as there was a picture of Deann on their living room mantle. Knowing how much Mason loved Wes, a character who viewers previously learned has struggled with addiction, Deann takes it upon to look out for him. She gives him her card and tells him to reach out if he needs anything. Whether it was Deann’s kind words or Wes’s desire to meet Kyle West, he takes Deann up on her offer and spends a day on set of. While the movie set wasn’t what he expected, it felt like a family, something he’s been lacking since his mother died. So he then takes Deann’s invitation to visit anytime as a cue to kiss his late mother’s lover, which is completely inappropriate. Thankfully, Deann pushes him away, telling Wes this will never happen. I mean, how incestuous would a May-September affair with your late lover’s son be? Despite the transgression, Deann let’s Wes know it’s all right; there’s no script for how to deal with death, but kissing your late mother’s lover should probably be a given. Instead of sending Wes back to Napa like a normal person, Deann gets Wes a job on, which will most likely end up blowing up in her face. I mean, what does Deann even really know about Wes? All we know is he has struggled with addiction in the past, and while that doesn’t mean he’ll relapse again, losing his mother isn’t the best thing for someone’s sobriety. Does giving him a job in a high-stress environment really help anyone?It’s a dangerous line Deann is walking. Like I get that loosing Mason is hard for Deann, and she wants to be there for Mason’s son, but it’s not exactly the best idea to have him be a production assistant on the set of a film here you work.Some stray thoughts:- Both “The Sessions” and “Scene 23” mention Megan’s dad. Who wants to start taking bets on when her father is going to first appear. My guess is before the end of the season.- Is anyone else getting the impression that Terence and Shaun may hookup in the near future? There were several moments over the past two episodes where I got a serious vibe from them that their relationship may be more than strictly platonic. If the show decides to go there, that would certainly be an interesting development what with Shaun working with Megan to bring down IHM and Terence and Deann trying to have a baby.- Speaking of having a baby, does Terence really think having a child with Deann will magically solve all their problems? I get that he wants to leave something behind, but his and Deann’s relationship issues will still be there, even if she does get pregnant.- I really loved that Deann somewhat confided in Megan about what was going on. Viewers don’t really get a chance to see them interact, but it’s clear they care about each other. I love their relationship and would love to see more of it.- Shaun was completely right to tell Megan she needed to take a step back. By helping Megan, she is putting her job and ability to practice law on the line for Megan. While Megan feels like Shaun is choosing IHM and Terence over her, she should remember just how much Shaun has to lose. As horrible as IHM and Terence are, Shaun doesn’t need to be collateral damage in Megan’s revenge plan.So hit the comments below to let me know your thoughts. What were your thoughts on Megan and Terence’s intense sessions? Why is Kyle incapable of letting Megan in? Have we seen the last of Hope? What do you think about the incestuous Deann/Mason/Wes love triangle?", "images": ["https://pixel.quantserve.com/pixel/p-c3WjFS05sEe9U.gif", "https://2.bp.blogspot.com/-vYwJ5TS0Fxw/Wsq3G2ojb4I/AAAAAAAAAoc/N68w0iz3OHA1oenAqKRxm2LOQKy0RACIQCLcBGAs/s320/megan%252Bterence3.jpg", "https://4.bp.blogspot.com/-Rg1LCPrFQRg/Wsq3cFA1-eI/AAAAAAAAAo0/wWaNFYyoS7sMbkwXTeu1I9hu9d-NYpucwCLcBGAs/s320/deann%252Bwes.jpg", "https://4.bp.blogspot.com/-fjDeW4HBh2o/Wsq3VyCLigI/AAAAAAAAAos/99QgAO3mBmk6Rhj3iN3sSyPMh1FGkSTYgCLcBGAs/s320/hope.jpg", "https://2.bp.blogspot.com/-jsIwSIvU_H0/Wsq3KAYMMbI/AAAAAAAAAog/xCoAPq9E7YEdpU5TFMS7PXKFpIFjhrY2wCLcBGAs/s320/megan%252Bterence.jpg", "https://files.spoilertv.com/icons/stvminilogo.png", "https://3.bp.blogspot.com/-yeTqeLs8-hU/Wsq3Ou0rbJI/AAAAAAAAAok/H_gDsXV6PYUsEmjAubcyK4xX41E33_TjgCLcBGAs/s320/megan%252Bkyle.jpg", "https://lh3.googleusercontent.com/blogger_img_proxy/ANbyha3QDmNcDEu6fC3wHMR8MGNSBr8s7WTLUHZs0JYBU1-1AuW-tzxIw7W_fxd-irwFZxKxTorhh6aZimnNR7h2Clw-DZD_QwJecsJ-hRrgmrByCiFyzQMTgYRgT5ddJKj2qA=s0-d", "https://4.bp.blogspot.com/-5EQVIgJJCQI/Wsq3Ywrm56I/AAAAAAAAAow/Sut43BOEpJ8UGeICiZZxzACuJ1Ax21DrgCLcBGAs/s320/deann.jpg", "https://lh3.googleusercontent.com/blogger_img_proxy/ANbyha21WD4SnuvbzADjIQhFShIQ-UkUgunRFpSz37_Uh1sArs3sc8a5bLF69_qM7Goj__XCx-3eqNwq-36TQKf5RFj45g4dxzIXANu9KLc3Ims6WG9NIfZUuyvoA_ymdK7kq4FnJLk13vOxFV3zL5_sGNlrN-7QoLM=w1200-h630-p-k-no-nu", "https://4.bp.blogspot.com/-DmZXyoRi45A/Wsq3EP1uBxI/AAAAAAAAAoY/AgQkNdIGtCksY9YP_KZEwHbHjkeorEqEgCLcBGAs/s320/megan%252Bterence2.jpg", "https://storage.googleapis.com/cdn.spoilertv.com/images/headers/the-arrangement.jpg", "https://3.bp.blogspot.com/-Ga0kDLGYRgU/Wsq3SVcHqlI/AAAAAAAAAoo/XpXyKJl6LdIrEwj1iFpWA6oOkhuJBtCcwCLcBGAs/s320/megan%252Bkyle2.jpg"], "top_img": "https://lh3.googleusercontent.com/blogger_img_proxy/ANbyha21WD4SnuvbzADjIQhFShIQ-UkUgunRFpSz37_Uh1sArs3sc8a5bLF69_qM7Goj__XCx-3eqNwq-36TQKf5RFj45g4dxzIXANu9KLc3Ims6WG9NIfZUuyvoA_ymdK7kq4FnJLk13vOxFV3zL5_sGNlrN-7QoLM=w1200-h630-p-k-no-nu", "keywords": [], "authors": ["Posted Gmail.Com"], "canonical_link": "https://www.spoilertv.com/2018/04/the-arrangement-sessions-scene-23.html", "title": "Double Review: \"The Truth Will Set You Free\"", "meta_data": {"generator": "blogger", "p": {"domain_verify": "7c876f6b0fe866261c628b503ff39358"}, "msvalidate.01": "FB96BC456EB5B8B7F212D44EAD06C37E", "fb": {"app_id": 177209699002423, "admins": 690495378}, "twitter": {"account_id": 1510093617, "card": "summary_large_image", "site": "@SpoilerTV", "domain": "https://www.spoilertv.com", "title": "The Arrangement - The Sessions & Scene 23 - Double Review: \"The Truth Will Set You Free\"", "image": {"src": "https://storage.googleapis.com/cdn.spoilertv.com/images/headers/the-arrangement.jpg"}, "description": "The Largest Collection of TV spoilers and show information for the most popular shows on TV", "url": "https://www.spoilertv.com/2018/04/the-arrangement-sessions-scene-23.html"}, "google-site-verification": "kDe-Nz7BtG55fUKTxevLAWxgFj2SIELluleFqFTIPBQ", "verify_w": "580ed07c99332d9ee4e03b926f09315b", "verify-v1": "IXXOEgqXvgU7xF8N+UAL3FQzzMOar4JTKUhYuPIWx7w=", "theme-color": "#2D90B6", "robots": "max-image-preview:large", "description": "The Arrangement - The Sessions & Scene 23 - Double Review: \"The Truth Will Set You Free\"", "viewport": "width=device-width", "og": {"url": "https://www.spoilertv.com/2018/04/the-arrangement-sessions-scene-23.html", "title": "The Arrangement - The Sessions & Scene 23 - Double Review: \"The Truth Will Set You Free\"", "image": "https://storage.googleapis.com/cdn.spoilertv.com/images/headers/the-arrangement.jpg", "site_name": "SpoilerTV", "type": "article"}, "google-adsense-platform-account": "ca-host-pub-1556223355139109", "google-adsense-platform-domain": "blogspot.com", "article": {"published_time": "2018-04-09T01:45:00+01:00", "modified_time": "2018-04-09T01:45:00+01:00", "author": "j.lerner1295@gmail.com", "tag": "The Arrangement"}}, "movies": [], "publish_date": 1523234700.0, "source": "https://www.spoilertv.com", "summary": ""}