{"url": "https://people.com/music/justin-bieber-selena-gomez-relationship-timeline/", "text": "01 of 33 THE BEGINNING Getty Although they initially wrote off their 2010 date at a Philadelphia IHOP as a friendly hangout, Justin Bieber and Selena Gomez finally went public as a couple at the Vanity Fair Oscars Party in February 2011. That same year, Gomez opened up to Seventeen about coming forward with their relationship after months of being coy. \"I don't like hiding. I do like to keep certain things to myself, but at the end of the day, I'm 18 and I'm going to fall in love,\" she revealed. \"I'm going to hang out with people and I'm going to explore myself, and I'm okay with that.\"\n\n02 of 33 FEELING THE LOVE Noel Vasquez/Getty After bringing their relationship into the spotlight, the performers became more comfortable with packing on the PDA at high-profile events, like they did at the 2011 Billboard Music Awards, with Bieber and Gomez sharing a kiss as he accepted one of his many awards. Bieber even planted a smooch on his girlfriend's cheek while she cohosted the MTV VMAs pre-show in August. \"I don't ever want her to feel like I'm ashamed of her,\" Bieber told Oprah Winfrey in 2012 of his decision to go public with his relationship despite fan backlash.\n\n03 of 33 'ROMANCE ISN'T DEAD' Getty In September 2011, Bieber reportedly rented out the Staples Center in L.A. for the couple's date night, which included a candlelit dinner on the court, followed by a private screening of Titanic. After their over-the-top get-together, Bieber tweeted: \"Romance [isn't] dead. Treat your lady right fellas.\"\n\n04 of 33 BABY DADDY DRAMA Central Image Agency/FilmMagic Despite their picture-perfect romance, which included a PDA-heavy appearance at the 2011 American Music Awards, Bieber was embroiled in weeks-long accusations that he fathered a baby with a fan, Mariah Yeater. In November, paternity tests were completed, subsequently debunking Yeater's claims.\n\n05 of 33 TROUBLE IN PARADISE? Selena Gomez and Justin Bieber. VALERIE MACON/AFP/Getty A few months after Bieber's manager, Scooter Braun, shot down rumors that the singers were engaged, breakup rumors began to plague the couple in September 2012. \"It's really fun. I'm lucky. I'm 20. I don't take anything in my personal life too seriously,\" she told Teen Vogue. \"I have great friends and a solid group of people I love. I feel like everything else will come organically.\"\n\n06 of 33 IT'S OFFICIAL Christopher Polk/Getty After a whirlwind romance that spanned two years, the duo called it quits in November 2012. \"She broke up with him about a week ago,\" a source told PEOPLE. \"With them being apart so much it got complicated. She had some trust issues. It's not easy, but the relationship needed to end.\" A few days later, the couple was spotted grabbing dinner together — though the reunion still led to an uncoupling.\n\n07 of 33 CRY ME A RIVER Getty The new year introduced the world to a newly single Gomez, who opened up about the breakup during a March 2013 appearance on The Late Show with David Letterman, revealing her current relationship status (single!) and that she made her famous ex cry.\n\n08 of 33 STAYING SOCIAL Kevin Mazur/WireImage Bieber seemed to be toying with his fans and fellow Jelena shippers' hearts for a good chunk of 2013 whenever he'd post cuddly throwback pics of himself and his ex. An April 2013 photo in particular featured Gomez wrapping her arms around a shirtless Bieber. His caption read: \" 'You've been makin music for too long babe come cuddle' -her.\" The rampant reconciliation rumors turned out to hold some truth. In April 2013, an insider told PEOPLE Gomez traveled to Oslo, Norway, to be with Bieber during his performance. \"They were holding hands, hugging and they kissed on the lips,\" said the source. \"They looked really in love, like no fights ever happened before. It definitely looked like they were back together.\"\n\n09 of 33 IT'S ALL LOVE Kevin Winter/DCNYRE2010/Getty Images for DCP Although Bieber told radio host Big Boy that he and Gomez were in an off phase of their relationship, the singer did reveal that he would always care about the starlet. \"[The breakup] affected us, especially when we are in front of so many people,\" Bieber said in December 2013, adding that his song \"All That Matters\" is about his ex. \"It's such a public thing. It's just hard for the both of us. But you know, she's a great woman. I love her [to] this day.\"\n\n10 of 33 GIVING IT ANOTHER SHOT Kevin Mazur/TCA 2012/WireImage After Bieber's alleged August 2014 scuffle with Orlando Bloom, which went down after the actor was spotted with Gomez outside of a Chelsea Handler show, the singer confirmed the duo were back on again during his September 2014 legal deposition for assaulting a paparazzi.\n\n11 of 33 NOTHING LASTS FOREVER Getty But the reunion didn't last long, with Gomez sending out a cryptic, since-deleted tweet the following month: \"We have to learn the hard way sometimes.\" Gomez confirmed their breakup in November 2014 when she released her single, \"The Heart Wants What It Wants,\" which she revealed to Ryan Seacrest was about Bieber. \"He thought it was beautiful. I think it was really hard,\" she said.\n\n12 of 33 GOING THEIR SEPARATE WAYS JMA/Star Max/GC Images In December 2014, Bieber posted a series of Instagram snapshots while on vacation with model Hailey Baldwin. The getaway prompted speculation of a new romance, which Bieber quickly shut down, writing on his Instagram: \"People are crazy. I'm super single and this is my good friend u would know otherwise [sic].\"\n\n13 of 33 SOMEONE NEW Jeff Kravitz/FilmMagic After collaborating with Zedd on her hit single, \"I Want You to Know,\" Gomez and the deejay began dating in March 2015. \"He's this cute little German, and he's got really beautiful eyes, and he's very sweet and funny,\" she told Radio Disney. Although their romance was short-lived, Gomez harbors no bad blood for her Zedd. \"I adore Anton [Zedd] a lot and I definitely had a thing with him, which was nice,\" she said during a July 2015 interview. Meanwhile, Bieber is rumored to be romantically linked to a variety of female celebs, from Kourtney Kardashian and Kendall Jenner to model Jayde Pierce.\n\n14 of 33 A COMEBACK Kevork Djansezian/Getty It's no secret Bieber's had a troubled past filled with altercations, outbursts and run-ins with the law, but September 2015 seemed to serve as his comeback — and Gomez was all for it, as she revealed in a 2015 interview with The New York Times. \"While people were writing that I was stupid for being in [the relationship], this is what I always saw in him,\" she said. \"I'm like, duh!\"\n\n15 of 33 MY GIRL Venturelli/WireImage; Jesse Grant/Getty Images for WE Following the demise of Gomez's relationship with Zedd, the \"Baby\" crooner was seen serenading his ex with The Temptations' \"My Girl\" at a Beverly Hills hotel bar in November 2015.\n\n16 of 33 SIGNING OFF Don Arnold/WireImage At one of her May 2016 performances during her Revival tour, Gomez took a fan's sign that read \"Marry Justin Please\" and crumpled it without verbally acknowledging the message. The incident was caught on video and quickly went viral.\n\n17 of 33 SOCIAL FEUD Jun Sato/GC Images In August 2016, Bieber threatened to leave Instagram after his rumored relationship with Sofia Richie was met with criticism from fans. \"I'm gonna make my Instagram private if you guys don't stop the hate,\" Bieber captioned a black-and-white photo with the model. \"This is getting out of hand, if you guys are really fans you wouldn't be so mean to people that I like.\" Gomez quickly weighed in with her own bit of advice. \"If you can't handle the hate, then stop posting pictures of your girlfriend lol - It should be special between you two only,\" Gomez commented on his post. \"Don't be mad at your fans. They love you and supported you before any one ever did.\" Bieber responded: \"It's funny to see people that used me for attention and still try to point the finger this way.\" The back-and-forth didn't last long, however. Gomez eventually took to her Snapchat to apologize for her initial comment.\n\n18 of 33 A NEW ROMANCE Rob Latour/REX/Shutterstock Talk about a happy new year! In January 2017, Gomez and The Weeknd were spotted together for the first time, kicking off a whirlwind romance that would span 10 months. They made their red carpet debut at the Met Gala that May. \"It's really hard when I would want to spend so much time hiding things,\" Gomez told host Ryan Seacrest of going public with their relationship. The \"Bad Liar\" singer explained a little further, saying, \"It's too much pressure, and I think everyone gets over everything eventually ... I just want to be happy. If that's me just being myself, then I don't really care.\"\n\n19 of 33 A SPLIT Dimitrios Kambouris/Getty Images for Harper's BAZAAR Following their 10-month romance, Gomez — who, in September 2017, revealed she underwent a kidney transplant — and The Weeknd called it quits that October. \"She and Abel have been going back and forth for a few months about their relationship,\" an insider told PEOPLE. \"It's been hard with him being on tour and her shooting in New York. That wasn't easy on them.\"\n\n20 of 33 BACK TOGETHER? Pacific Coast News Before news of Gomez and The Weeknd's uncoupling was revealed, the \"Fetish\" singer was seen spending time with Bieber. The duo attended church together and were photographed by TMZ grabbing breakfast at a café in Westlake Village, California, in late October 2017.\n\n21 of 33 CATCHING UP Neilson Barnard/Getty Images; Jason Merritt/Getty Images The former flames continued to fuel reconciliation rumors in the wake of Gomez's split from The Weeknd. They went bike riding together, and Gomez was seen cheering Bieber on at his hockey game — even sporting the singer's New Jersey Devils hockey jersey. An insider close to the pair told PEOPLE, \"Justin is happy Selena is single. He hopes to regain her trust so they can get back together.\" Though nothing was official, Bieber was apparently determined to win back her heart. \"They have so much to catch up on,\" said the source. \"They dealt with things separately this year that made them different people. It wouldn't be surprising if they got back together.\"\n\n22 of 33 KEEPING IT LOW-KEY FameFlynet/BACKGRID Gomez and Bieber continued seeing each other — but kept their dates low-key. After being photographed multiple times together riding bikes, heading to dinner and attending church, \"they just backed off a little from being out there,\" a source told PEOPLE. Another source told PEOPLE, \"Justin is still very happy. They have had quiet date nights at home and outings to local, low-key spots. They are still catching up and just enjoy hanging out. They have learned from past mistakes and are not putting any pressure on each other. Things are much different and more mature.\"\n\n23 of 33 FAMILY MATTERS Christopher Polk/VF12/Getty In December 2017, Gomez and mom Mandy Teefey unfollowed each other on Instagram, but a source close to the family shared with PEOPLE exclusively that the mother-daughter duo's recent estrangement is not just because of the singer's reunion with Bieber. \"Selena's mom is still not happy about Justin,\" added a Bieber source of Teefey, who had voluntarily sought treatment at a hospital in L.A., with an insider dismissing a report that it was because of an argument with her daughter over the \"Sorry\" crooner. \"It's definitely causing some family conflicts. It's been hard on Selena. She really believes Justin has changed and wishes her family would trust her.\"\n\n24 of 33 LET'S TALK Matt Winkelmeyer/Getty; Jeff Spicer/Getty Bieber and Gomez, not officially boyfriend and girlfriend, received guidance from Hillsong pastor Carl Lentz about their relationship, multiple sources confirmed to PEOPLE. \"They don't want to repeat the same patterns as before,\" said the Gomez insider. \"They've clearly had issues in the past, so they're receiving some guidance from Carl.\"\n\n25 of 33 WEDDING BELLS Maciel-Max-Geva/BACKGRID (2) Bieber and Gomez touched down in Jamaica together ahead of Bieber's father Jeremy Bieber's wedding in February 2018. Sources told PEOPLE the \"Sorry\" singer flew to Texas a day before to pick up Gomez, on the way to the Caribbean. Gomez and Bieber were seen together the week before celebrating Valentine's Day together at church and, later, at the Montage in Beverly Hills. \"They celebrated a romantic Valentine's Day,\" a source told PEOPLE. \"They had been apart for a couple of days and seemed happy to be reunited.\"\n\n26 of 33 BIRTHDAY BOY Selena Gomez/Instagram Gomez chose a very special day to make her on-again romance with Bieber Instagram-official: his birthday. \"March 1, 1994 someone I know that happens to be super cool was born. Boom,\" she captioned the 'gram, which was shared with her 134 million followers.\n\n27 of 33 TAKING A BREAK? Juliano-Rol/X17online.com (2) The two were spotted at the same church service in March 2018 - but did not sit together inside. A source close to the \"Sorry\" singer told PEOPLE the reunited couple — whom another insider confirms were never \"officially\" back together — are taking a breather. \"They weren't getting along and decided to take a break,\" said the Bieber source. \"It doesn't seem like a big deal and they will probably be fine soon again.\" And despite reports that the couple split because of Gomez's mom's disapproval of the relationship, a source told PEOPLE Mandy Teefey had nothing to do with the pair's hiatus. \"They're not on a break because of her relationship with her mom. They have their own issues and are always on and off,\" said a source about the couple, who first dated in 2010. \"She wouldn't base her relationship off of what her mom thinks.\"\n\n28 of 33 JUSTIN MOVES ON Justin Bieber Instagram Though he had been spotted with Selena in March 2018, the \"Sorry\" singer started dating Hailey Baldwin in June 2018, marrying the model in September of the same year.\n\n29 of 33 MARRIED ... AGAIN Justin Bieber Instagram Though they married at a New York City courthouse in September 2018, the pair married (again!) in a religious ceremony in South Carolina in September 2019.\n\n30 of 33 SELENA RELEASES A SONG ABOUT HER EX Selena Gomez. Theo Wargo/Getty Images After taking some time off from making music, Gomez returned with a song, \"Lose You to Love Me,\" that seemed to allude to the couple's on-again/off-again relationship. Gomez said in a statement, \"This song was inspired by many things that have happened in my life since releasing my last album. I thought it was important to share the music, as I know many can relate to the fact that the road to self-discovery generally comes through the scars in one's life.\" Gomez seemed to make a direct reference to Bieber when she sings, \"Set fire to my purpose and I let it burn.\" Could she be referencing her ex's 2015 album Purpose? The song also made reference to the fact that Bieber moved on fairly quickly with his now-wife. \"In two months you replaced us like it was easy,\" she sang.\n\n31 of 33 AND THEN ANOTHER ONE Selena Gomez. Selena Gomez/Youtube She followed up \"Lose You to Love Me\" with \"Look At Her Now,\" which, though more of a breakup anthem than a subtle dig, was also assumed to be about Bieber. In the song, Gomez sang, \"Of course she was sad/But now she's glad she dodged a bullet.\" She continued, \"Took a few years/To soak up the tears/But look at her now/Watch her go.\" Need more evidence? Gomez seemed to address their relationship, which started when they were both still teenagers, when she sang, \"It was her first real lover/His too 'til he had another/Oh God when she found out/Trust levels went way down.\"\n\n32 of 33 SELENA SAYS SHE WAS A VICTIM TO EMOTIONAL 'ABUSE' Steven Ferdman/Getty; Gotham/GC Images In an interview with NPR's Lulu Garcia-Navarro, the pop star opened up about moving on from her relationship with Bieber. She said, \"I've found the strength in it. It's dangerous to stay in a victim mentality. And I'm not being disrespectful, I do feel I was a victim to certain abuse.\" The interviewer asked Gomez if she meant \"emotional abuse,\" and the Rare singer said, \"Yes.\" She also said, \"I had to find a way to understand it as an adult. And I had to understand the choices I was making. As much as I definitely don't want to spend the rest of my life talking about this, I am really proud that I can say I feel the strongest I've ever felt and I've found a way to just walk through it with as much grace as possible.\"", "images": ["https://people.com/thmb/D8WoPhmK7d4DIxKuypapG07bDrE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(464x529:466x531)/105041713_2683909708557874_699682735710188661_n-69d66b6e75a04292b1e6c92dd4ecc726.jpg", "https://people.com/thmb/hCE8a-nmvtn0PHEbKPfzAnTws5A=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(642x0:644x2)/selena-1-2000-353b09d2ada741868577acd628a7f704.jpg", "https://people.com/thmb/03KvQv5loEeNq3VhFb7rn7Gw56s=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(801x0:803x2)/justin-beiber-aa333c46d81441c7a3bdde4b63d760a1.jpg", "https://people.com/thmb/s93iauEKdRH_ZhhFmEgYcoR8vis=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(899x0:901x2)/44439902_553548838402136_1308885982676191157_n-6624194225524d6a8be5ecec955df76d.jpg", "https://people.com/thmb/Mhkc_8YQginWIobwnOwAtixdu4Q=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/selena-gomez-justin-bieber-2000-806bd9ee32c24581953397e919d1b1fc.jpg", "https://people.com/thmb/ICc5-aBpgLK3XUzNSmleg2CRk7Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/justin-bieber-selena-gomez-1-44e9660ca3bc48ce89b4d0795a4e9046.jpg", "https://people.com/thmb/R-rsTHVW9FfkuLZpy11dHJ9x5Ik=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(937x0:939x2)/justin-bieber-15-2000-5eb6211e45a34751b20eff9b65daa394.jpg", "https://people.com/thmb/N2B4r0XbDuPH4n-nODsIL_Jg_Sk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bella-hadid-selena-gomez-2000-a907c3a8dc1c495ca4ebda1bd5dbe1eb.jpg", "https://people.com/thmb/P74-2ujgKlVqWVd6SdCw0VANDNo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/justin-bieber-selena-gomez-1-44e9660ca3bc48ce89b4d0795a4e9046.jpg", "https://people.com/thmb/BDU2N0gwYPyImSV25Q8VWQNwRrI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/bella-hadid-the-weeknd-paris-54118ff2f16a423cbc1750a0f48837d0.jpg", "https://people.com/thmb/HFRFgr_t6rjg6q5dMqrnMiQw3aU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(704x0:706x2)/the-biebers-1-1200-5b0b3808b5cb4e6eb1e774ada36c1da4.jpg", "https://people.com/thmb/QzIWEeURzKRJ9b9wC7s14qiDOKM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(875x0:877x2)/hailey-justin-2000-525ae713373a4e228133c19bcf888316.jpg", "https://people.com/thmb/JJROlSKpUTIiGI9Lr9F0Ojx4hao=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(646x0:648x2)/selena-gomez-17-dccced6c73724c07a3db68922839cdcb.jpg", "https://people.com/thmb/vM-E97fU5c510ByW6Xys-J0RaDs=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x0:961x2)/justin-bieber-hailey-baldwin-2000-b5b3bfa3f47d49feab1bd3e4e6036ac8.jpg", "https://people.com/thmb/9cNrjGU2csQdihdGhFkUt5jeMkk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(639x0:641x2)/sofia-richie-aec121d212624f689ac11d536831660f.jpg", "https://people.com/thmb/IReRcyvxfNu9Mr-22tFTJH0CQFw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(888x0:890x2)/selena-gomez-11-c8b0e567245a4b40af2a62007060454e.jpg", "https://people.com/thmb/2_YHWtXR1jJeQoOH4vonfOMITtw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(672x0:674x2)/selena-gomez-15-4dd31c6797bf4873b85a96e1e2ec22b9.jpg", "https://people.com/thmb/o2ake2TwRsiW7TKgJiUt2smVgaE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/justin-bieber-selena-gomez-2-dccc1342bd604ff4a7a5c86ae28e8c9c.jpg", "https://people.com/thmb/aKOjsqvlCEMx7BdchYVNKTpCD7s=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(664x0:666x2)/selena-gomez-the-weeknd-6-1-2000-4b4df0c7c7d54e888b89ff4334a622d7.jpg", "https://people.com/thmb/OFO2c8DLYB8zb10xHiincvm9ZS4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(656x0:658x2)/selena-gomez-18-199e18df26f748d788dfed487e8be977.jpg", "https://people.com/thmb/gVZyg04ouyVP6L2GM9QuoXEO54o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x0:736x2)/selena-gomez-11-2000-db735153de244923ba0f4d78d523338b.jpg", "https://people.com/thmb/2t6k4NmapCrkBLB0zePHoDa9S1U=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/justin-bieber1-2000-6686278523f24ec3bf340466d8bc604b.jpg", "https://people.com/thmb/rPh1L4gjt_Hlq4crf5IAxRmOOnc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/selena-gomez-2-4a16c63b12d24aed894725f2fb5f63bb.jpg", "https://people.com/thmb/NZ01ZehRGbcGtttyR0nokXKMgwA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(583x0:585x2)/selena-gomez-9-f81498a5eb71447bb2daf43a6ffa9433.jpg", "https://people.com/thmb/1rTEfzYPSrkxizOymUn5ScgYlBE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(697x0:699x2)/selena-gomez-20-e420e68b847a44eeabf7dbea7c0070e8.jpg", "https://people.com/thmb/g_Y5zH04MG76f7OdZcB0wXMmXFI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(783x0:785x2)/selena-gomez-8-faf834d1e4af41cba7a23def6d3af501.jpg", "https://people.com/thmb/6UAuPpqRVhWMN8S_4YKz3jzPO-Y=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(590x0:592x2)/selena-gomez-10-07e0a3c0eb754a1ab0f25f608bef710d.jpg", "https://people.com/thmb/6ineZ6fXq6JJ8TmnLH8EgOE3MSk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(656x0:658x2)/selena-gomez-18-199e18df26f748d788dfed487e8be977.jpg", "https://people.com/thmb/8cJmVZc7Ok6w5_4Wwxc14qmMsU4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/people_generic-1885945d8bd544778fbbf4be88a63f00.jpg", "https://people.com/thmb/ODRYlDC_-1ZeyMwZpD9KXLnbYBg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/justin-bieber2-ba55c39197884d4cb8ede701c9aa0cf1.jpg", "https://people.com/thmb/Tdoe31nbBJyk66Q_NSMCgzUiZdw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/selena-gomez9-1-95cde8623d274e18b96b702577728857.jpg", "https://people.com/thmb/y6LkOJ3ctf0OyIy1fHqiDAITc-c=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/bieber-gomez-1-4e147ed1c1cf456c90a4d74e726fd830.jpg", "https://people.com/thmb/JMSYwPAMzcvbauEnyXZ-95D2prM=/2000x1333/filters:fill(auto,1)/justin-bieber1-2000-85670d5d88d04f3ab47439279e2e4f74.jpg", "https://people.com/thmb/vM66mcJ5gbxkQXJPeIq7v7VhLMg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/justin-bieber1-b5f2110bf615461fab5284e2677ed3d2.jpg", "https://people.com/thmb/19bvxYwJb21YIitoslcfdkUtlUw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Charlie-Puth-e17f9ccd7bfc446b80985008020cc455.jpg", "https://people.com/thmb/59GbLef5UdM6y3yJ0OvIr889opk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(685x0:687x2)/selena-gomez-7-cb0d99cbb0f840aea7848f7bd1070200.jpg", "https://people.com/thmb/USUgwdq4XSjwLKOT9OwfYU_2nqc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/selena-gomez-14-989478cd544d4f1899466f0290761823.jpg", "https://people.com/thmb/1XLyhWXElsYXB63kJsw7FAy51Y4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(764x439:766x441)/ariana-grande-dalton-gomez-ab49efb12a034447a4dd9a7690afc60a.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/bvQvdXBDYQHkvjJwxd8eKlGLc5M=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(664x0:666x2)/selena-gomez-6-bdbde58aa396419798bbbcf0bcc9a41f.jpg", "https://people.com/thmb/kqx6IYMF1Dwg9lvxKeQ--mH2KYg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x0:736x2)/selena-gomez-11-2000-9170a4f6fd4a4442bd99c07e055a82b8.jpg", "https://people.com/thmb/Rqhv7jVHiw7ltZ7I2OEBfSJiWv4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/kendall-jenner-2-4345f1030a1a43f39a3da9f1f217c04a.jpg", "https://people.com/thmb/xNj3u5ps2xFfcTgUTyJcOr4NPVE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/selena-gomez5-8ed9cdb9ebe648a8928b4d219fcbbd98.jpg", "https://people.com/thmb/pHVYzX3aQBKVg1OGw7gP6qNmTgE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/selena-gomez-2000-54989260c0bf4123bd14e321018aa970.jpg", "https://people.com/thmb/tE9Rh01BuM7HMg9KMSqii3J1Es4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/selena-gomez-1-2000-1-6807335e4b9c482791b52357c585ed26.jpg", "https://people.com/thmb/UGXFbLsw6mwtVNu8ZcyNUAPo4Es=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bieber-gomez-1-2000-ed540559aa2c4cc18b53e4300f8297ea.jpg", "https://people.com/thmb/jLZlfBO4c3KG3KbLajewoBIUylM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(829x0:831x2)/justin-bieber-ab9c345ddcfc40d6b48b4912f77bc26e.jpg", "https://people.com/thmb/0Q_y33h3Zp-IOV7PYOMS-_DQNAo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(685x0:687x2)/selena-gomez-zedd-2000-04cca3042d5c49e9823550d7e08586e8.jpg", "https://people.com/thmb/MDWcPUvdBhZ0agmx9DU9uWbIn1o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bieber-gomez-1-2000-ed540559aa2c4cc18b53e4300f8297ea.jpg", "https://people.com/thmb/PTzphIdTlvI_6l_Pckh-A47Vp88=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/justin-bieber-tour-6f8d959608404efbbb403949086b4a1f.jpg"], "top_img": "https://people.com/thmb/JMSYwPAMzcvbauEnyXZ-95D2prM=/2000x1333/filters:fill(auto,1)/justin-bieber1-2000-85670d5d88d04f3ab47439279e2e4f74.jpg", "keywords": [], "authors": ["Grace Gavilanes"], "canonical_link": "https://people.com/music/justin-bieber-selena-gomez-relationship-timeline/", "title": "Justin Bieber, Selena Gomez: Relationship Timeline", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Her new song is raising eyebrows, eight years after they were first spotted out together", "emailcontenttype": "LISTSC", "emailvertical": "PEOPLE", "sailthru.author": "Grace Gavilanes", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/music/justin-bieber-selena-gomez-relationship-timeline/", "title": "Justin Bieber, Selena Gomez: Relationship Timeline", "description": "Her new song is raising eyebrows, eight years after they were first spotted out together", "image": "https://people.com/thmb/JMSYwPAMzcvbauEnyXZ-95D2prM=/2000x1333/filters:fill(auto,1)/justin-bieber1-2000-85670d5d88d04f3ab47439279e2e4f74.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Justin Bieber, Selena Gomez: Relationship Timeline", "description": "Her new song is raising eyebrows, eight years after they were first spotted out together", "image": "https://people.com/thmb/JMSYwPAMzcvbauEnyXZ-95D2prM=/2000x1333/filters:fill(auto,1)/justin-bieber1-2000-85670d5d88d04f3ab47439279e2e4f74.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}