{"url": "https://www.cnn.com/2017/07/31/health/13-reasons-why-suicide-study/index.html", "text": "Story highlights Google searches about suicide rose 19% following \"13 Reasons Why,\" research shows \"Our worst fears were confirmed,\" one researcher says The show, about a teen who kills herself, has been renewed for a second season\n\nCNN —\n\nWhen it comes to the hit Netflix series “13 Reasons Why,” many viewers find themselves on either side of a controversial debate.\n\nOn one end, fans of the binge-able show applaud the series for raising awareness about the tragedy of youth suicide and shedding light on how to spot warning signs of depression or suicidal thoughts.\n\nOn the other end, mental health experts describe the show as worrisome and point to how its relatable characters and graphic depiction of suicide can pose a health risk for young people already struggling with mental health issues.\n\nNow, a new research paper aims to advance the debate, using Google search data.\n\nIt turns out that following the show’s premiere in March, online searches for terms related to suicide awareness and prevention increased, but so did search terms associated with ideation – and those had greater relative upsurge, according to the paper, which published in the journal JAMA Internal Medicine on Monday.\n\nAfter the premiere of “13 Reasons Why,” the search phrase “how to commit suicide” rose 26% above what would normally have been expected for that time; “suicide prevention” went up 23%; and “suicide hotline number” climbed 21%, based on the paper’s data.\n\n“The time for rhetorical debate is over,” said John Ayers, research professor at San Diego State University and lead author of the paper.\n\n“While ’13 Reasons Why’ has certainly caused the conversation to begin – it’s raised awareness, and we do see a variety of suicide-related searches increasing – our worst fears were confirmed,” he said. “That is, thousands of people, thousands more, are searching online about ways to kill themselves.”\n\nBased on best-selling author Jay Asher’s 2007 young adult book of the same title, the show follows the fictional story of a teenage girl named Hannah Baker, played by actress Katherine Langford. Hannah leaves behind 13 mysterious cassette tape recordings after killing herself. Each audio recording is addressed to a person who Hannah says played a role in her devastating decision to end her own life.\n\nThe show, co-produced by actress and pop star Selena Gomez, has been renewed for a second season. Filming for the upcoming season reportedly has commenced in parts of California’s Bay Area.\n\nDue to the findings in the new paper, Ayers called for the second season to be postponed and changes to be retrofitted to the already released first season.\n\nIn a statement that Netflix provided to CNN, the entertainment streaming company said, “We always believed this show would increase discussion around this tough subject matter. This is an interesting quasi experimental study that confirms this. We are looking forward to more research and taking everything we learn to heart as we prepare for season 2.”\n\nA surge of suicide searches\n\nFor the paper, researchers collected data on suicide-related Google search trends in the United States from March 31, when “13 Reasons Why” premiered, through April 18, before former NFL player Aaron Hernandez’s suicide, which would have skewed the search data.\n\nThe researchers also eliminated search terms in the data related to the popular superhero movie “Suicide Squad,” resulting in a final database of 20 suicide-related search terms.\n\nThe researchers found that searches for 17 of those 20 terms were higher than expected for 12 of the 19 days that were studied following the release of “13 Reasons Why.”\n\nFor instance, suicide-related searches were 15% higher on April 15 and then 44% higher on April 18, the researchers found. The queries that focused on suicidal ideation had the largest increases, the data showed.\n\nOverall, the increase over the 19-day period represented a total of about 900,000 to 1.5 million more searches than otherwise expected, Ayers said.\n\nNetflix gave “13 Reasons Why” a TV-MA rating, which is for mature audiences, and the first season’s episodes 9, 12 and 13 - which contain more explicit material - had specific warnings prior to the beginning of each episode.\n\nAt midnight on the day of the show’s debut, 13ReasonsWhy.info, a website built by Netflix, launched. It includes links to various suicide helplines.\n\nAdditionally, during production of the first season, “13 Reasons Why” executive producers consulted with several mental health professionals and doctors who helped guide the show’s storytelling approach to suicide, sexual assault and bullying, according to the Netflix statement.\n\nYet in the new paper, the researchers wrote that the show could have done more to reduce associations with suicidal ideation by closely following the World Health Organization’s media guidelines for preventing suicide (PDF).\n\nFor instance, the guidelines recommend avoiding detailed descriptions or portrayals of a suicide method, among other recommendations.\n\n“Psychiatrists have expressed grave concerns because the show ignores the World Health Organization’s validated media guidelines for preventing suicide. The show’s staff instead continue to prefer their gut instincts,” Ayers said. “The show’s makers must swiftly change their course of action, including removing the show and postponing a second season.”\n\nIn an op-ed published in Vanity Fair in April, a writer for the “13 Reasons Why” series defended the decision not to shy away from main character Hannah’s suicide and to include a gruesome scene of her death in the first season.\n\n“From the very beginning, I agreed that we should depict the suicide with as much detail and accuracy as possible. I even argued for it – relating the story of my own suicide attempt to the other writers,” wrote Nic Sheff, one of the show’s writers.\n\nIn the op-ed, Sheff detailed how a woman once told him about her painful suicide attempt and her account caused him to reconsider his own suicide attempt.\n\n“If that woman had not told me her story, I wouldn’t be here now. I would’ve missed out on all the amazing gifts I have in my life today,” Sheff wrote.\n\n“So when it came time to discuss the portrayal of the protagonist’s suicide in ’13 Reasons Why,’ I of course immediately flashed on my own experience. It seemed to me the perfect opportunity to show what an actual suicide really looks like – to dispel the myth of the quiet drifting off,” he wrote.\n\nThe risk of suicide ‘contagion’\n\nAll in all, the new paper suggests an association between “13 Reasons Why” and suicide-related Google searches. However, the analyses cannot definitively conclude that the show caused the searches. Also, it could not be ascertained from the data whether any of the searches actually led to a suicide attempt.\n\nMore research is needed to determine the true risk-benefit when it comes to the association between “13 Reasons Why” and heightened interest in suicide among viewers, said Madelyn Gould, a professor of epidemiology in psychiatry at Columbia University, who was not involved in the new paper.\n\n“These analyses, by Ayers and his team, seem to indicate that suicide awareness was heightened and I think that that is a relief, but unfortunately at what price was that awareness raised?” Gould said.\n\nA separate paper previously suggested that some online searches for suicide-related terms could be tied to suicide deaths. In that paper, searches such as “complete guide of suicide” correlated with actual suicide deaths between 2004 and 2009 in Taiwan. That research published in the Journal of Affective Disorders in 2011.\n\nAs for the new paper, although there were some limitations in the study design, the authors took a creative first step in examining the influence of “13 Reasons Why” by analyzing online search trends, said John Ackerman, suicide prevention coordinator at Nationwide Children’s Hospital in Columbus, Ohio.\n\nHe was not involved in the new paper, but wrote a blog post in April about “13 Reasons Why” and guidance for parents.\n\n“It addresses an important question: Are we seeing actual suicidal thinking and behavior being influenced by a television show?” Ackerman said about the paper.\n\n“I believe most people working on the show felt like by raising awareness of youth suicide and portraying it graphically, they would somehow discourage young people from engaging in suicidal behavior. Sadly, this is not how suicide contagion works,” he said.\n\nSuicide contagion refers to when exposure to suicide within a family, group of friends, military unit, or through the media may be associated with an increase in suicidal behaviors, according to the US Department of Health and Human Services.\n\nGould said that such contagion can be demonstrated in a theory termed the Werther Effect, which refers to how negative stories about engaging in suicidal behavior can be linked to an increase in deaths by suicide.\n\nThe Werther Effect’s name stems from Johann Wolfgang von Goethe’s 1774 novel, “The Sorrows of Young Werther,” which ends in suicide and was reportedly linked to a wave of young men in Europe deciding to kill themselves in the late 1700s.\n\n” ‘The Sorrows of Young Werther’ elicited a kind of epidemic of copycats, of people dressing up like this character in the book,” said Dr. Victor Schwartz, clinical associate professor of psychiatry at the New York University School of Medicine, who was not involved in the new paper.\n\nWhile most teens can read novels or watch shows, like “13 Reasons Why,” and not have suicidal thoughts or behaviors as a result, not all can, said Schwartz, who serves as chief medical officer of the JED Foundation, a nonprofit that focuses on emotional health and suicide prevention among teens and young adults.\n\n“Looking at it from a prevention standpoint, it’s concerning when a young person already has a prehistory or an existing mental health problem with anxiety, depression, and, for a smaller group, actually psychotic illnesses,” Schwartz said, adding that such illnesses are risk factors for suicidal behavior.\n\n“If a young person has a history of serious mental health or substance concerns, then obviously that adds a layer of vulnerability” when consuming media about suicide, he said.\n\nOn the other hand, positive contagion has been more recently termed the Papageno Effect, which refers to how positive stories of overcoming suicidal thoughts can be linked to a decrease in deaths.\n\nSo, fictional tales or news reports about a character finding coping strategies for suicidal thoughts can have an inverse relationship with suicidal behaviors. The Papageno Effect’s name stems from the character Papageno in Mozart’s opera “The Magic Flute.” In the opera, the character overcomes a suicidal crisis.\n\nThe new “13 Reasons Why” paper adds to a body of research conducted by Ayers and his colleagues that highlights the influence that celebrities and the media can have on public health outcomes.\n\nPreviously, Ayers and his colleagues analyzed how actor Charlie Sheen’s HIV disclosure two years ago was associated with an increase in Google searches for HIV testing kits and a boost in kit sales. Their study published in the journal Prevention Science in May.\n\nThe researchers wrote in their new paper that further examinations of “13 Reasons Why” might reveal whether the show also could be tied to actual changes in behaviors, from calls placed to national suicide hotlines or estimated suicide attempts.\n\nJoin the conversation See the latest news and share your comments with CNN Health on Facebook and Twitter.\n\nGlobally, suicide is the second leading cause of death among 15- to 29-year-olds, according to the WHO. In the US, about 4,600 young people between 10 and 24 die by suicide each year, according to the Centers for Disease Control and Prevention.\n\n“Maybe this will have some impact on the producers of ’13 Reasons Why’ as they develop their second season,” Gould said about the new paper. “None of us know what that second season is going to be about. I hope that they recognize that it’s not just suicidal behavior that can get modeled and that there are other deleterious behaviors that can get modeled as well.”", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/170505091058-hospitalized-for-suicidal-thoughts.jpg?q=x_5,y_0,h_2874,w_5108,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/170208160533-selena-gomez.jpg?q=x_0,y_0,h_1688,w_2999,c_fill/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/170330145457-13-reasons-why-2.jpg?q=x_0,y_0,h_1456,w_2588,c_fill/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/170322123422-13-reasons-why-photo.jpg?q=x_0,y_84,h_1427,w_2537,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/170330145457-13-reasons-why-2.jpg?q=x_0,y_0,h_1456,w_2588,c_fill/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/170725130119-01-military-suicide.jpg?q=x_0,y_0,h_1218,w_2164,c_fill/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/151116183619-16-charlie-sheen-through-the-years.jpg?q=x_3,y_0,h_1684,w_2993,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/130415033726-mutchler-teen-trolling-bullying-00023625.jpg?q=x_0,y_0,h_720,w_1280,c_fill/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/170407142154-13-reasons-why-devin-druid-restricted.jpg?q=x_2,y_0,h_1123,w_1995,c_crop/h_144,w_256"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/170330145457-13-reasons-why-2.jpg?q=x_0,y_0,h_1456,w_2588,c_fill/w_800", "keywords": [], "authors": ["Jacqueline Howard"], "canonical_link": "https://www.cnn.com/2017/07/31/health/13-reasons-why-suicide-study/index.html", "title": "‘13 Reasons Why’ tied to rise in suicide searches online", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "'13 Reasons Why' tied to rise in suicide searches online | CNN", "description": "Google searches about suicide climbed 19% in the days following the release of Netflix's \"13 Reasons Why,\" according to a new research paper.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170330145457-13-reasons-why-2.jpg?q=x_0,y_0,h_1456,w_2588,c_fill/w_800", "type": "article", "url": "https://www.cnn.com/2017/07/31/health/13-reasons-why-suicide-study/index.html", "site_name": "CNN"}, "twitter": {"title": "'13 Reasons Why' tied to rise in suicide searches online | CNN", "description": "Google searches about suicide climbed 19% in the days following the release of Netflix's \"13 Reasons Why,\" according to a new research paper.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170330145457-13-reasons-why-2.jpg?q=x_0,y_0,h_1456,w_2588,c_fill/w_800", "card": "summary_large_image", "site": "@CNN"}, "description": "Google searches about suicide climbed 19% in the days following the release of Netflix's \"13 Reasons Why,\" according to a new research paper.", "template_type": "article_leaf", "type": "article", "meta-section": "health", "theme": "health", "article": {"published_time": "2017-07-31T15:02:01Z", "modified_time": "2017-07-31T18:17:26Z", "tag": "society, suicide, alphabet inc, arts and entertainment, broadcasting industry, business and industry sectors, business, economy and trade, celebrity and pop culture, companies, digital and streaming video, google inc, health and medical, internet and www, internet broadcasting, media industry, movie and video industry, streaming media, technology, television programming, mental health, netflix incorporated", "publisher": "https://www.facebook.com/CNN"}, "keywords": "society, suicide, alphabet inc, arts and entertainment, broadcasting industry, business and industry sectors, business, economy and trade, celebrity and pop culture, companies, digital and streaming video, google inc, health and medical, internet and www, internet broadcasting, media industry, movie and video industry, streaming media, technology, television programming, mental health, netflix incorporated", "author": "Jacqueline Howard", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1501455600.0, "source": "https://www.cnn.com", "summary": ""}