{"url": "https://en.wikipedia.org/wiki/Jessica_Lange", "text": "American actress\n\nJessica Phyllis Lange ( ; born April 20, 1949[1]) is an American actress. She is the 13th actress to achieve the Triple Crown of Acting,[2] having won two Academy Awards, three Primetime Emmy Awards, and a Tony Award, along with a Screen Actors Guild Award and five Golden Globe Awards. Additionally, she is the second actress to win the Academy Award for Best Actress after winning the Academy Award for Best Supporting Actress,[3][4] the third actress and first performer since 1943 to receive two Oscar nominations in the same year,[5] the fifth actress and ninth performer to win Oscars in both the lead and supporting acting categories,[4] and tied for the sixth most Oscar-nominated actress.[6] Lange holds the record for most nominations for the Golden Globe Award for Best Actress – Miniseries or Television Film.[7] She is the only performer ever to win Primetime Emmy Awards in both the Outstanding Supporting Actress and Outstanding Lead Actress categories for the same miniseries. Lange has also garnered a Critics Choice Award and three Dorian Awards, making her the most honored actress by the Gay and Lesbian Entertainment Critics Association.[8] In 1998, Entertainment Weekly listed Lange among the 25 Greatest Actresses of the 1990s.[9] In 2014, she was scheduled to receive a star on the Hollywood Walk of Fame, but she has yet to claim it.[10]\n\nLange made her professional film debut in Dino De Laurentiis's 1976 remake of the 1933 action-adventure classic King Kong, for which she also won her first Golden Globe Award for New Star of the Year. In 1979, she starred in the acclaimed musical film All That Jazz. In 1983, she won her second Golden Globe Award and the Academy Award for Best Supporting Actress for her role as a soap opera star in Tootsie (1982) and was also nominated for the Academy Award for Best Actress for her portrayal of the troubled actress Frances Farmer in Frances (1982). Lange received three more nominations for Country (1984), Sweet Dreams (1985) and Music Box (1989), before winning her third Golden Globe Award and the Academy Award for Best Actress for her performance as a bipolar housewife in Blue Sky (1994).\n\nIn 2010, Lange won her first Primetime Emmy Award for her portrayal of Jacqueline Kennedy Onassis's aunt Big Edie in HBO's Grey Gardens (2009). Between 2011 and 2014, she won her first Screen Actors Guild Award, first Critics Choice Award, fifth Golden Globe Award, three Dorian Awards and her second and third Emmy Awards for her performances in the first, second and third seasons of FX's horror anthology series American Horror Story (2011–2015, 2018). In 2016, Lange won her first Tony Award for Best Performance by a Leading Actress in a Play, an Outer Critics Circle Award for Best Lead Actress in a Play and a Drama Desk Award for Outstanding Actress in a Play for her performance in the Broadway revival of Long Day's Journey into Night.[11] She also had a supporting role in Louis C.K.'s Peabody Award-winning web series Horace and Pete. In 2017, for her portrayal of actress Joan Crawford in the miniseries Feud, Lange received her eighth Emmy, 16th Golden Globe, sixth Screen Actors Guild Award and second TCA Award nominations. In 2019, she received a tenth Emmy nomination for her performance in American Horror Story: Apocalypse.\n\nLange is also a photographer with five published books of photography.[12][13][14] She has been a foster parent[15] and holds a Goodwill Ambassador position for UNICEF, specializing in HIV/AIDS in the Democratic Republic of the Congo and Russia.[16][17]\n\nEarly life and education [ edit ]\n\nLange was born in Cloquet, Minnesota, on April 20, 1949. Her father, Albert John Lange, was a teacher and traveling salesman, and her mother, Dorothy Florence (née Sahlman), was a housewife. She has two older sisters, Jane and Ann, and a younger brother, George.[citation needed] Her paternal ancestry is German and Dutch, her maternal ancestry Finnish.[18] Due to the nature of her father's professions, her family moved more than a dozen times to various towns and cities in Minnesota before settling down in her hometown, where she graduated from Cloquet High School.[19]\n\nIn 1967, she received a scholarship to study art and photography at the University of Minnesota, where she met and began dating Spanish photographer Paco Grande.[15] After the two married in 1970, Lange left college to pursue a more bohemian lifestyle, traveling in the United States and Mexico in a microbus with Grande.[15][19] The couple then moved to Paris, where they drifted apart. While in Paris, Lange studied mime theatre under the supervision of Étienne Decroux and joined the Opéra-Comique as a dancer.[15] She later studied acting at HB Studio[20] in New York City.\n\nCareer [ edit ]\n\n1970s [ edit ]\n\nWhile living in Paris, Lange was discovered by fashion illustrator Antonio Lopez[21] and became a model for the Wilhelmina modelling agency. In 1973, she returned to the U.S. and began work in New York City as a waitress at the Lion's Head Tavern in Greenwich Village.[15] While modeling, Lange was discovered by Hollywood producer Dino De Laurentiis, who was looking to cast an ingenue for his remake of King Kong. Lange made her film debut in the 1976 King Kong, beating actresses Meryl Streep and Goldie Hawn for the role of damsel-in-distress.[citation needed] Despite the film's success – it was the fifth-highest-grossing film of 1976 and received an Academy Award for Best Visual Effects – it and Lange's performance were widely panned.[22] But film critic Pauline Kael wrote, \"The movie is sparked by Jessica Lange's fast yet dreamy comic style. [She] has the high, wide forehead and clear-eyed transparency of Carole Lombard in My Man Godfrey, [and] one liners so dumb that the audience laughs and moans at the same time, yet they're in character, and when Lange says them she holds the eye and you like her, the way people liked Lombard.\"[23] Lange won the 1976 Golden Globe Award for New Star of the Year. She remained a favorite of Kael, who later wrote, \"She has a facial structure that the camera yearns for, and she has talent, too.\"[24]\n\nAt the close of the decade, Bob Fosse, whom Lange had befriended and with whom she had carried on a casual romantic affair, cast Lange as the Angel of Death, a part he had written for her in his semi-autobiographical film All That Jazz (1979). She was also considered for the role of Wendy Torrance in The Shining before it went to Shelley Duvall.\n\n1980s [ edit ]\n\nLange began the new decade in the light romp How to Beat the High Cost of Living (1980), co-starring Jane Curtin and Susan Saint James, which received mostly negative reviews and quickly disappeared from theaters. A year later, director Bob Rafelson contacted her about a project he was working on with Jack Nicholson, who had recently auditioned Lange for Goin' South (1978). Rafelson paid Lange a visit in upstate New York, where she was doing summer stock theater and has recounted how he watched her conversing on the telephone for half an hour before their meeting when he decided he had found the lead for his film. After meeting Lange, he wrote her name down on a piece of paper, placed it in an envelope, and sealed it. After several meetings and auditions with other actresses (though Rafelson had already made his decision, he feared he had done so too quickly and wanted to make sure his choice was right), the final choice was between Lange and Meryl Streep. In the end, Rafelson offered Lange the lead role opposite Nicholson in his remake of the classic film noir The Postman Always Rings Twice (1981).[25] Upon offering her the part, he gave her the sealed envelope in which he had placed the piece of paper with her name on it. The film received mixed reviews, but Lange was highly praised for her performance.\n\nWhile editing The Postman Always Rings Twice, Graeme Clifford realized he had found the leading lady for his next film, his first as a director: a biographical film of actress Frances Farmer, whose disillusionment with Hollywood and chaotic family background led her down a tragic path.[26] Filming Frances (1982), which co-starred Kim Stanley and Sam Shepard, was a grueling experience for Lange, who pored over the screenplay scene by scene, making deep and often taxing connections between her life and Farmer's to tap into the well of emotions the role required.[26] By the end of the shoot, she was physically and mentally spent,[26] and decided to take Stanley's advice to do \"something light\", which led her to accept a supporting role opposite Dustin Hoffman in Sydney Pollack's Tootsie (1982).\n\nIn 1982, Lange became the first performer in 40 years to receive two Academy Award nominations in the same year,[27] for Frances and for Tootsie, winning the Academy Award for Best Supporting Actress for her work in the latter, which not only became the second-highest-grossing film of 1982 after Steven Spielberg's E.T. the Extra-Terrestrial, it also scored an additional nine Oscar nominations, including one for Best Picture. Her performance in the film also earned her a Golden Globe, along with awards from the National Society of Film Critics, the New York Film Critics Circle, the Boston Society of Film Critics, and the Kansas City Film Critics Circle. Lange also won Best Actress at the Moscow International Film Festival for her performance in Frances.[27]\n\nLange next produced and starred, again opposite Shepard, in 1984's Country, a topical film depicting a family during the farm crisis. Her performance earned her Academy Award and Golden Globe nominations for Best Actress. That same year, she made her television debut as Maggie the Cat, starring opposite Tommy Lee Jones in a CBS Playhouse production of Tennessee Williams's Cat on a Hot Tin Roof. The following year, she testified before the United States Congress on behalf of the Democratic House Task Force on Agriculture, alongside Jane Fonda and Sissy Spacek, whom she later befriended.[28]\n\nAt the close of 1985, she portrayed legendary country singer Patsy Cline in Karel Reisz's biopic Sweet Dreams, opposite Ed Harris, Ann Wedgeworth, and John Goodman. She was nominated a fourth time for an Oscar and came in second for both the National Board of Review Award for Best Actress and the National Society of Film Critics Award for Best Actress.[29][30] In several interviews, Meryl Streep has said she \"begged\" Reisz, who directed her in 1981's The French Lieutenant's Woman, for the role of Cline, but his first choice had always been Lange. Streep has been quite vocal and adamant in her praise for Lange's performance,[31][32][33][34][35][36] calling her \"beyond wonderful\" in the film and saying, \"I couldn't imagine doing it as well or even coming close to what Jessica did because she was so amazing in it.\"[32] In 2012, on an episode of Watch What Happens Live with Andy Cohen, Streep once again praised Lange's work in the film, saying, \"Nobody could do that better than [Lange]. I mean, it was divine.\"[33] In 2018, she further commented, \"Jessica did it better than any human being could possibly have done it.\"[31] Streep has also said, \"Every job I've ever taken, about three weeks before I begin, I call up my agent and say, 'I don't think I can do this. I don't think I'm right for it. They should call up Jessica Lange.'\"[37]\n\nLange's films in the mid- to late 1980s, which included Crimes of the Heart (1986), Far North (1988), and Everybody's All-American (1989), were mostly low-profile and underperformed at the box office, though she was often singled out and praised for her work.[citation needed] In 1989, she starred in Costa-Gavras's Music Box as a Hungarian lawyer defending her father of Nazi war crimes. Her performance earned her a fifth Academy Award nomination and a sixth Golden Globe nomination for Best Actress.\n\n1990s [ edit ]\n\nLange continued making films throughout the 1990s, periodically taking time off to raise her children and do theater- and television-based projects. She began the decade in Paul Brickman's warmly received Men Don't Leave (1990), for which she earned positive reviews and came in third place for the National Society of Film Critics Award for Best Actress.[38] She was then approached by Martin Scorsese and Robert De Niro, who had both auditioned her for the role of Jake LaMotta's wife in Raging Bull (1980), to star in a remake of Cape Fear (1991). The film was the year's 12th- highest-grossing film. In 1992, Lange once again starred opposite De Niro in Irwin Winkler's Night and the City, and in a television adaptation of Willa Cather's O Pioneers!, receiving her seventh Golden Globe nomination for Best Actress. Her Broadway debut, which met mixed reviews, also occurred that year when she portrayed Blanche DuBois in a production of Tennessee Williams's A Streetcar Named Desire opposite Alec Baldwin.[citation needed]\n\nIn 1994, Lange was lauded for her performance as a manic depressive army wife in the 1960s in Tony Richardson's final film, Blue Sky. In 1995, she won the Academy Award for Best Actress for this performance, along with the Golden Globe Award for Best Actress, the Los Angeles Film Critics Association Award for Best Actress, the Utah Film Critics Association Award for Best Actress, and the Sant Jordi Award for Best Actress. She also came in second place for the National Board of Review Award for Best Actress, the National Society of Film Critics Award for Best Actress, and the Chicago Film Critics Association Award for Best Actress. She became the second actress, after Streep, to follow a Best Supporting Actress Oscar with a Best Actress Oscar, an achievement not repeated until nearly 20 years later by Cate Blanchett.\n\nIn 1995, Lange gave critically lauded performances in Losing Isaiah, opposite Halle Berry, and Rob Roy, with Liam Neeson. The same year, she reprised her role as Blanche DuBois in a CBS television adaptation of A Streetcar Named Desire, opposite Alec Baldwin, Diane Lane, and John Goodman. She received glowing reviews for her performance, which earned her fourth Golden Globe Award and her first Primetime Emmy Award nomination for Outstanding Lead Actress in a Miniseries or a Movie.\n\nIn 1996, Lange made her London stage debut in another performance as Blanche DuBois, which received rave reviews. The next year, she starred opposite Michelle Pfeiffer in a film adaptation of Jane Smiley's Pulitzer Prize-winning novel A Thousand Acres. Lange received her ninth Golden Globe Award nomination and won the Venice Film Festival's Schermi d'Amore award for her performance in the film. In 1998, she starred opposite Elisabeth Shue in a film adaptation of Balzac's Cousin Bette, for which she received strong reviews. The same year, Lange starred opposite Gwyneth Paltrow in Hush, which generally received negative reviews, though Roger Ebert praised Lange's performance, writing, \"The film's most intriguing element is the performance by Jessica Lange, who by not going over the top provides Martha with a little pathos to leaven the psychopathology.\"[39]\n\nLange received strong reviews for her performance in Titus, Julie Taymor's 1999 adaptation of William Shakespeare's Titus Andronicus, co-starring Anthony Hopkins and Alan Cumming. Entertainment Weekly critic Lisa Schwarzbaum included Lange in a \"for your consideration\" article directed at the Academy of Motion Picture Arts and Sciences, writing, \"Jessica Lange already has two Oscars and six nominations to her credit, so her appearance near the words 'Academy Awards' should never be a surprise. But everything about her daring performance in Titus as Tamora, the Queen of the Goths, is an astonishment. Donning breastplates, vowing vengeance, tearing into Shakespeare for the first time as if nothing could be more fun, Lange steals the show – and when the star of the show is Anthony Hopkins, that's grand theft.\"[40]\n\n2000s [ edit ]\n\nLange (2009)\n\nLange began the new millennium with a London stage production of Eugene O'Neill's Long Day's Journey into Night, playing the part of the morphine-addicted Mary Tyrone, for which she became the first American actress to receive an Olivier Award nomination.[41] She appeared mostly in supporting roles thereafter, most notably opposite Christina Ricci in the 2001 adaptation of Elizabeth Wurtzel's best-selling memoir on depression, Prozac Nation. In 2003, Lange starred opposite Tom Wilkinson in HBO's Normal, a film about a man who reveals to his wife his decision to have a sex change, for which she received nominations for the Emmy and Golden Globe Awards for Best Actress in a Miniseries or Movie. She followed this with performances in the Bob Dylan vehicle Masked and Anonymous (2003), Tim Burton's Big Fish (2003), Jim Jarmusch's Broken Flowers (2005) and Wim Wenders's Don't Come Knocking (2005), before starring in a Broadway revival of Tennessee Williams's The Glass Menagerie for which she received mixed reviews.[citation needed] She later starred with Tammy Blanchard in a remake of Sybil in 2007.\n\nIn 2009, Lange co-starred as Big Edie, opposite Drew Barrymore, in HBO's Grey Gardens, directed by Michael Sucsy and based on the 1975 documentary of the same name. The film was a tremendous success, garnering 17 Primetime Emmy Award nominations and winning five. Lange won her first Primetime Emmy Award for Outstanding Lead Actress in a Miniseries or a Movie after two previous nominations in the same category. She also received her 11th Golden Globe Award nomination and second Screen Actors Guild Award nomination for her performance, losing both awards to Barrymore.\n\n2010s [ edit ]\n\nIn 2011, Lange joined the cast of FX's horror anthology series American Horror Story. Series co-creators Ryan Murphy and Brad Falchuk originally wrote her part as a supporting character, but after Lange acquired the role, they expanded it. Murphy, a long-time admirer of Lange, said he chose her because he wanted to expose her work to a new generation of viewers.[42] He also singled out her performance as Blanche DuBois on Broadway in 1992, which he saw twice, as his favorite performance, citing it as another motivating factor in hiring Lange.[43] The show was a huge success not only for the network and creators but also for Lange, who experienced a resurgence in her popularity, receiving rave reviews and several awards for her controversial role. She was chosen by TV Guide, Entertainment Weekly, and MTV for giving one of the \"best performances of 2011\".[44][45][46] In addition, she won a second Primetime Emmy Award, a fifth Golden Globe Award, and her first Screen Actors Guild Award, after two previous nominations. She was also awarded a Special Achievement Satellite Award for Outstanding Performance in a Television Series by the International Press Academy and the Dorian Award for Best TV Performance of the Year by the Gay and Lesbian Entertainment Critics Association (GALECA). She was further nominated for the TCA Award for Individual Achievement in Drama, Critics' Choice Television Award, and Saturn Award.\n\nLange in 2012\n\nIn 2012, she had a supporting role in her Grey Gardens director Michael Suscy's box-office hit The Vow, opposite Channing Tatum and Rachel McAdams, but also returned to star as the lead in the second season of American Horror Story, titled American Horror Story: Asylum. Once again, she was chosen by TV Guide and Entertainment Weekly for giving one of the \"best performances of 2012\".[47][48] She won a second Dorian Award for Best TV Performance of the Year by the GALECA, and received a fifth Emmy nomination, a thirteenth Golden Globe Award nomination, a fourth Screen Actors Guild Award nomination, a second Saturn Award nomination, and a second Critics' Choice Television Award nomination.\n\nIn 2013, the third season of American Horror Story, American Horror Story: Coven, garnered the series its highest ratings to that point, and has held the record for garnering the series its highest on-average ratings.[49] Lange was joined by fellow film actors Kathy Bates and Angela Bassett. For her work on the show, Lange earned a third Primetime Emmy Award for Best Actress in a Movie or Miniseries,[50] a third Dorian Award for Best TV Performance of the Year[51] and her first Critic's Choice Television Award for Best Actress in a Movie or Miniseries.[52] She also received her fourteenth Golden Globe nomination, her fifth Screen Actors Guild Award nomination and her fifth Satellite Award nomination for her performance on the series. In addition, Lange replaced Glenn Close in a film adaptation of Émile Zola's Thérèse Raquin, directed by Charlie Stratton and titled In Secret, co-starring Elizabeth Olsen, Tom Felton, Oscar Isaac, and Matt Lucas for which she received rave reviews.[53]\n\nLange began 2014 by being honored with a nomination for a star on The Hollywood Walk of Fame, though she has yet to claim it.[10] Lange was also recognized by Elle Magazine with the L'Oreal de Paris Legend Award[54] presented to her by her friend Shirley MacLaine during The Women in Hollywood Awards, honoring women for their outstanding achievements in film, spanning all aspects of the motion picture industry, including acting, directing, and producing.[55] She was next honored with and became the first female recipient of the Kirk Douglas Award for Excellence in Film, presented to her by the Santa Barbara International Film Festival.[56]\n\nLater in the year, Marc Jacobs chose Lange to be the new face of Marc Jacobs Beauty. In addition, Lange was featured in the brand's summer and fall print ad campaign photographed by David Sims, and starred in a short campaign film directed by Jacobs.[57] Previously, Jacobs dressed and interviewed Lange for Love magazine's fifth-anniversary issue, and had her provide a spoken-word version of \"Happy Days Are Here Again\" as the soundtrack for his autumn/winter 2014 show.[57][58] She next starred opposite Mark Wahlberg in the remake of the 1970s action-thriller, The Gambler, receiving rave reviews for her work. She also led the fourth season of American Horror Story, titled American Horror Story: Freak Show. The series, once again, topped its and the network's highest ratings, breaking all ratings records for both.[59] Though self-admittedly not a singer, Lange's covers of David Bowie's \"Life on Mars\" and Lana Del Rey's \"Gods and Monsters\" for the show were both hugely popular, receiving heavy circulation on YouTube and charting in the top 50 on the iTunes music charts.[60] For her work on the show, Lange received her seventh Primetime Emmy Award nomination, her fifteenth Golden Globe nomination, and her fourth Critics' Choice Television Award nomination. In 2015, Lange announced that she would not return for the series' fifth season.[61] She followed her final season on American Horror Story with a role opposite Shirley MacLaine and Demi Moore in the road-trip comedy, Wild Oats, which wrapped production at the end of 2014. It premiered on Lifetime on August 22, 2016, before receiving a limited theatrical release on September 16, 2016.[62]\n\nIn 2016, Lange had a supporting role in Louis C.K.'s critically acclaimed and Peabody Award-winning web series Horace and Pete, which debuted on C.K.'s website on January 30, 2016.[63] She next returned to Broadway alongside Michael Shannon, Gabriel Byrne and John Gallagher Jr. in a revival of Long Day's Journey into Night at the American Airlines Theatre, produced by Ryan Murphy and the Roundabout Theatre Company. The show became the most Tony-nominated play of the season. For her performance, Lange garnered her first Tony Award for Best Performance by a Leading Actress in a Play nomination and win, an Outer Critics Circle Award for Best Lead Actress after one previous nomination, a Drama Desk Award for Outstanding Actress in a Play after-which she shared with filmmaker Michael Stever how Kim Stanley remained one of her truest inspirations,[64] and a BroadwayWorld.com Award for Best Leading Actress in a Play. She was also nominated for a Drama League Award for Distinguished Performance, a Time Out New York Award for Best Performance by an Actress in a Leading Role in a Play, and a Broadway.com Audience Choice Award for Favorite Actress in a Play.[11]\n\nOn November 12, 2016, Lange was honored at the Camerimage Film Festival, where she was awarded the Krzysztof Kieślowski Award for Acting.[65]\n\nLange next starred in FX's anthology series, Feud, also serving as producer alongside Susan Sarandon, who also co-starred, and executive producers Ryan Murphy and Brad Falchuk. The first season revolved around the infamous rivalry between Hollywood legends Bette Davis (Sarandon) and Joan Crawford (Lange), which came to a head during the making of the classic film, Whatever Happened to Baby Jane?. Alfred Molina, Stanley Tucci, Judy Davis and Catherine Zeta-Jones co-starred. Production began in the fall of 2016 and it was released on March 5, 2017.[66] The series garnered Lange her eighth Emmy Award nomination for Outstanding Lead Actress in a Limited Series or Movie, her sixteenth Golden Globe Award nomination, her sixth SAG Award nomination, her fourth Critics Choice Award nomination and her second TCA Award nomination for Individual Achievement in Drama. Lange was also honored by the Trinity Repertory Company's Pell Award for Lifetime Achievement in the Arts on May 23, 2017.\n\nIn 2018, Lange was honored with the Jason Robards Award for Excellence in Theater by the Roundabout Theater Company. In addition, she starred opposite Gwyneth Paltrow in the Netflix series The Politician and reprised her role as Constance Langdon in American Horror Story: Apocalypse, for which she earned a tenth Emmy nomination – her first in the Outstanding Guest Actress in a Drama Series category – in 2019.[67]\n\n2020s [ edit ]\n\nLange has two projects in development: A Marlene Dietrich biopic produced by Ryan Murphy for Netflix, centered on Dietrich’s late-career period in Las Vegas, and Gia Coppola’s adaptation of Jean Nathan's memoir The Search for Dare Wright: The Secret Life of the Lonely Doll, co-starring Naomi Watts, which chronicles the life of Dare Wright and her tempestuous relationship with her mother Edith Stevenson Wright.[68][69]\n\nOn August 25, 2022, Ed Harris revealed that he will star opposite Lange in a film adaptation of Long Day's Journey into Night, which is set to begin production in “Ireland soon.” [70] Lange will next star opposite Liam Neeson and Diane Kruger in Marlowe, based on the novel The Black-Eyed Blonde: A Philip Marlowe Novel by John Banville. The film is set to premiere at the San Sebastián International Film Festival on September 24, 2022 and will be released in theaters on December 2, 2022.[71][72]\n\nJessica Lange: An Adventurer’s Heart, a biography by film scholar, historian, and journalist Anthony Uzarowski, is scheduled to be released in June 2023.[73]\n\nReception and acting style [ edit ]\n\nLange is often included in the milieu of America's finest and most respected actresses.[74][75][76][77][78]\n\nIn a career spanning nearly five decades, Lange came to be associated with playing intelligent women who often have a troubled internal life.[79] She has been praised for her ability to deliver emotional intensity without resorting to excessive melodrama. Critics have frequently pointed out Lange's tendency to play women on the edge of a nervous breakdown, a notion that the actress herself has also acknowledged.[80][81][82] Nicholas Bell of Ioncinema writes that her Oscar-winning role of Carly in Blue Sky (1994 film) is reminiscent of her signature performances, as \"Lange excels [here] at the small tics hinting at the madness always lurking below the surface\".[83]\n\nWith regard to her acting style, Lange has said that she acts on \"pure emotion\" rather than relying on a specific technique.[84][85] Director Glenn Jordan, who has directed her in O Pioneers! (film) noted that \"Jessica reminds me of what someone once said of Jack Lemmon. Whatever emotion or whatever small nuance you want, she is like a supermarket. Her shelves are stocked full and it’s all accessible to her\".[86] This sentiment was echoed by actress Sarah Paulson who, after working with Lange on the 2005 stage production of The Glass Menagerie as well as five seasons of American Horror Story, described the actress as being \"like a cat on a wire\" and added that \"she is very instinctual, she doesn't come up with an entire plan on how to play a scene\".[87] As a result, Lange's performance style has positively been referred to as unpredictable, since she acts out the trajectory of her characters' emotional journey with unexpected turns.[88][79][89][90]\n\nPersonal life [ edit ]\n\nLange was married to photographer Francisco \"Paco\" Grande from 1970 to 1982.[91][92] Though they separated not long after moving to Europe during the mid-1970s, they did not divorce until the early 1980s, after which Lange paid him an undisclosed sum in alimony.[93][94] From 1976 to 1982, she was partnered with renowned Russian ballet dancer Mikhail Baryshnikov, with whom she had her first child, Aleksandra Lange \"Shura\" Baryshnikov (born 1981).[95] During that time, she was also sporadically linked with Bob Fosse, with whom she remained friends until his death.[94]\n\nIn 1982, she met and entered a relationship with playwright Sam Shepard. They had two children: daughter Hannah Jane Shepard (born 1986) and son Samuel Walker Shepard (born 1987). They lived together in Virginia, New Mexico, Minnesota, and eventually New York City, before separating in 2009.[96] Lange often returns to Duluth, Minnesota, and has said of the city, \"It's the one place that has remained constant in my life ... After living all over [the] world and traveling everywhere I've wanted to go, I keep coming back here.\"[97]\n\nThough she does not follow any set religion, she periodically practices Buddhism.[98] She once admitted, \"It's been a discipline that makes sense more than anything because it's like a science. I've never been a religious person. I've always looked for some kind of spiritual meaning. I didn't grow up going to church. My mother's family were atheists and my father's side was confused.\"[98] She is also a vegetarian.[99]\n\nLange has also revealed that she suffers from severe bouts of depression,[19][100] once admitting, \"I have never been a believer in psychoanalysis or therapy or anything like that. I've never done that.\"[100] She confessed, \"Though my dark side is dormant right now, it continues to play a big role in whatever capacity I have to be creative. That's the well I'm able to tap into, where all the anguish, rage and sadness are stored.\"[19]\n\nOther works [ edit ]\n\nPhotography [ edit ]\n\nMexico (1992–2008) by Jessica Lange by Jessica Lange\n\nIn 2008, Lange published a collection of her black-and-white photographs, 50 Photographs (powerHouse Books), with an introduction by Patti Smith.[101] In 2009, an exhibition of her work, along with a series of her films, was presented at the George Eastman House, the oldest international museum of photography and film, which honors distinguished contributions to film with the George Eastman Award. Lange received the first George Eastman Honors Award, an award given to an artist whose life work embodies the traditions and values championed by George Eastman House International Museum of Photography and Film.[102] In 2010, she published a second collection of photographs, In Mexico.[103][104][105][106] In 2013, she released a children's book of photography, It's About a Little Bird. In 2014, she exhibited at Moscow's Multimedia Art Museum.[107] In 2019, she published her fourth book of photography, Highway 61, composed of photographs of U.S. Route 61.[12]\n\nLange’s fifth book of photography Dérive will be published by powerHouse Books and distributed by Simon & Schuster on October 11, 2022.[14]\n\nHumanitarian work and political views [ edit ]\n\nLange is a Goodwill Ambassador for the United Nations Children's Fund (UNICEF), specializing in the HIV/AIDS epidemic in the Democratic Republic of the Congo and in spreading awareness of the disease in Russia.[16][17]\n\nLange fostered a Romanian child with disabilities during the early 1990s.[15]\n\nLange has joined the opposition to Minnesota's wolf hunt. \"More than anything else, the cruel methods allowed for hunting and trapping wolves are deeply disturbing,\" the Cloquet native wrote in a letter to Governor Mark Dayton.\n\nFilmography [ edit ]\n\nAwards and nominations [ edit ]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Jessica_Lange_Mexico.tif/lossy-page1-220px-Jessica_Lange_Mexico.tif.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Jessica_Lange_signature.svg/150px-Jessica_Lange_signature.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Taormina_film_festival_2009%2C_jessica_lange_02.JPG/180px-Taormina_film_festival_2009%2C_jessica_lange_02.JPG", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Jessica_Lange_on_the_red_carpet_at_the_62nd_Annual_Academy_Awards_cropped.jpg/180px-Jessica_Lange_on_the_red_carpet_at_the_62nd_Annual_Academy_Awards_cropped.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/P_culture.svg/31px-P_culture.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/32px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/9/91/Jessica_Lange_%28Cropped%29.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Jessica_Lange_2012.jpg/220px-Jessica_Lange_2012.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Jessica_Lange_%28Cropped%29.JPG/220px-Jessica_Lange_%28Cropped%29.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/28px-Video-x-generic.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/9/91/Jessica_Lange_%28Cropped%29.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jessica_Lange", "title": "Jessica Lange", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/9/91/Jessica_Lange_%28Cropped%29.JPG", "width": 640, "height": 920}, "title": "Jessica Lange - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}