{"url": "www.theatlantic.com/entertainment/archive/2016/01/work-work-work-work-work-rihanna-drake-single-review-anti/431532/", "text": "Rihanna offered her mission statement way back on T.I.’s smash “Live Your Life” in 2008, a time when her place in the pop firmament was just being cemented. “Got my mind on my money, and I’m not going awayyyyy,” she sang, giving us her entire career: In the Snoop Dogg reference, her hip-hop sensibility; in the elongated final word, her tendency to use words as putty; in the promise of longevity, a prophecy now fulfilled. Most important, though, was the confession of being obsessed with dollars, which over the years has seemed like her main neurosis, her main message, and her main virtue. If pop music today is mythology, Rihanna is unmistakably the goddess of money.\n\nThe long and confusing hype cycle for her new album, Anti, has taken this cash craze to new levels. There was “Bitch Better Have My Money,” about debt repayment. There was “American Oxygen,” about material ambition. There was “Four Five Seconds,” about the necessity for leisure to be undertaken only in the capitalistically proscribed zone between Friday afternoon and Monday morning. There was the Samsung tie-in, as unapologetic a corporate partnership as a major working musician has ever attempted. Days ago, Rihanna took a picture of herself listening to the new album in $9,000 Versailles-inspired headphones.\n\nAnd now, there’s her hugely anticipated single titled “Work.” It’s about working for a paycheck no matter what else is going on in your life. It is also, of course, designed to get her that paycheck. You might call the way it goes about attaining this goal brazen for anyone else but Rihanna: Tempting accusations of boringness, hackiness, and crimes against art, the song offers a hook that practically parodies pop’s love of repetition—and then repeats it, a lot. But there’s something fascinating about the tune, something that elevates it beyond ringtone status. It doesn’t really go anywhere. It approximates what work feels like.\n\nThe producer Boi-1da’s bright, bubbly beat creates a see-sawing sensation out of a few sounds. A keyboard ping anchors the downbeat and then climbs up, up, down, down, returning to its starting point. Electronic notes on the low end burble out a more asymmetrical pattern recalling reggae, but they too have the general shape of ascending and descending. The percussion is subtle, rendered with a skittering sound that recalls the shaking of a kettle. When Rihanna’s voice comes in, so do some signifiers of ’80s and ’90s dance and rap: digital handclaps, distorted shouting. It all adds up to the feeling of a lot of bustling in one spot—activity, but not necessarily movement.\n\nRihanna’s hook conjures a different kind of monotony. After a few quick notes in yet another up-and-back pattern, she gets stuck, like a needle in a groove, for “work work work work work.” There’s no stopping this getting in your head. “Work” becomes “dirt” becomes “love” becomes “turn,” but the modulations don’t matter—Rihanna has found her next great nonsense syllable, another “ooh na na” or “ella ella eh.” Her singing in the verses, where she dresses down some guy who isn’t meeting her expectations, is actually rather pretty. I’ve seen a lot of commenters say she’s copying the mumbling trend that’s taken hold among younger pop vocalists like Ariana Grande, but the truth is that Rihanna helped popularize the notion of liquifying words in the name of catchiness.\n\nRihanna has found her next great nonsense syllable, another “ooh na na” or “ella ella eh.”\n\nAs for Drake’s verse, it strikes me as pretty terrible—the disappointed lounge singer schtick from “Hotline Bling,” but without the silken melody or sense of surprise. “If you had a twin I would still choose you” is the only real attempt at a memorable line. Whatever. Drake being as popular as he is right now will be yet another incentive for radio playlist makers to keep this song in rotation, possibly giving it the activating energy needed to become a hit.\n\nAnd to be sure, it will need a good deal of exposure to reach the success levels of Rihanna’s previous smashes. The song’s undeniably catchy, but it also has a strangely unfinished quality. To me, though, that’s its charm. The verses, choruses, and bridge mostly bleed into each other, forgoing soft-to-loud explosions or exciting rhythmic changes. Boi-1da does create some sense of escalation—another drum beat for the second chorus, flashes of flutes, autotuned harmonies, and far-off piano. But the shifts are subtle and fleeting. Unlike a lot of radio pop, “Work” is about small modulations, a singer and a producer and a rapper plugging along as we all must do. At the end, the song makes the unfashionable move of simply fading out. Rihanna put in her three and a half minutes of work; now pay her what you owe her.", "images": ["https://cdn.theatlantic.com/thumbor/F6Rk2IPivHNtHHllgtUYmf9GsQ0=/456x0:1465x1009/90x90/media/img/mt/2015/07/32_image-1/original.jpg", "https://cdn.theatlantic.com/media/files/archive-thumbnail.png", "https://cdn.theatlantic.com/_next/static/images/nav-crossword-promo-71e9c22fbca07267d82afb8cca81ec00.png", "https://cdn.theatlantic.com/thumbor/N12PVA3Mohs4e45j2mEpvrG0NiA=/0x148:3855x2316/960x540/media/img/mt/2016/01/AP_685197046494/original.jpg", "https://www.theatlantic.com/magazine/images/current-issue.large.jpg", "https://cdn.theatlantic.com/thumbor/GyobRwdthiRYUoVUWJsM8AOQ_DI=/306x0:1712x1406/90x90/media/img/mt/2022/03/bombshelter_R_01/original.jpg", "https://cdn.theatlantic.com/media/files/YourSubscription_300x300.jpg", "https://cdn.theatlantic.com/media/img/specialreports/lead/2020/10/14/Thumbnail.jpg", "https://cdn.theatlantic.com/assets/media/files/nav-crossword.png", "https://cdn.theatlantic.com/_next/static/images/nav-archive-promo-5541b02ae92f1a9276249e1c6c2534ee.png", "https://cdn.theatlantic.com/thumbor/veBFrd5BSq6qOoGIucYsHkTbsiI=/1x215:3898x2245/1200x625/media/img/mt/2016/01/AP_685197046494/original.jpg", "https://cdn.theatlantic.com/thumbor/R74epKGRkAI4PKYToKqRV3LWOro=/503x0:2923x2420/90x90/media/img/mt/2019/06/AP_090422041393/original.jpg"], "top_img": "https://cdn.theatlantic.com/thumbor/veBFrd5BSq6qOoGIucYsHkTbsiI=/1x215:3898x2245/1200x625/media/img/mt/2016/01/AP_685197046494/original.jpg", "keywords": [], "authors": ["Spencer Kornhaber"], "canonical_link": "https://www.theatlantic.com/entertainment/archive/2016/01/work-work-work-work-work-rihanna-drake-single-review-anti/431532/", "title": "Song Review: Rihanna and Drake's 'Work,' Off of Anti-, Embraces the Joy of Repetition", "meta_data": {"viewport": "width=device-width,initial-scale=1", "application-name": "theatlantic", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://cdn.theatlantic.com/_next/static/images/apple-touch-icon-default-b504d70343a9438df64c32ce339c7ebc.png", "og": {"site_name": "The Atlantic", "locale": "en_US", "title": "Why Rihanna's 'Work' Works So Well", "description": "She's found her next great nonsense syllable.", "url": "https://www.theatlantic.com/entertainment/archive/2016/01/work-work-work-work-work-rihanna-drake-single-review-anti/431532/", "type": "article", "image": "https://cdn.theatlantic.com/thumbor/veBFrd5BSq6qOoGIucYsHkTbsiI=/1x215:3898x2245/1200x625/media/img/mt/2016/01/AP_685197046494/original.jpg"}, "fb": {"admins": "577048155,17301937", "app_id": 100770816677686, "pages": "29259828486,1468531833474495,1061579677251147,457711054591520,370457103090695,1631141167169115,148681772342453,1510507419185410,128344747344340,128377530562508,236061986423933"}, "p": {"domain_verify": "68e1a0361a557708fefc992f3309ed70"}, "twitter": {"site": "@theatlantic", "domain": "theatlantic.com", "card": "summary_large_image"}, "description": "Her hugely hyped single with Drake embraces the joy of repetition.", "krux": {"title": "Song Review: Rihanna and Drake's 'Work,' Off of Anti-, Embraces the Joy of Repetition - The Atlantic", "description": "Her hugely hyped single with Drake embraces the joy of repetition."}, "author": "Spencer Kornhaber", "article": {"publisher": "https://www.facebook.com/TheAtlantic/", "opinion": "false", "content_tier": "metered", "tag": "news", "section": "Culture", "published_time": "2016-01-27T16:50:53Z", "modified_time": "2016-01-27T18:58:58Z"}, "robots": "index, follow, max-image-preview:large", "referrer": "unsafe-url", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-status-bar-style": "black", "apple-mobile-web-app-title": "The Atlantic", "keywords": "work work work, work work work., Snoop Dogg reference, new album, confusing hype cycle, capitalistically proscribed zone, low end burble, ella ella eh., major working musician, Rihanna", "news_keywords": "work work work, work work work., Snoop Dogg reference, new album, confusing hype cycle, capitalistically proscribed zone, low end burble, ella ella eh., major working musician, Rihanna", "next-head-count": 58}, "movies": [], "publish_date": 1453913453.0, "source": "http://www.theatlantic.com", "summary": ""}