{"url": "https://www.vulture.com/2017/10/stranger-things-2-justice-for-barb.html", "text": "Photo: Netflix\n\nYes, there are spoilers below about Stranger Things and Stranger Things 2. If you haven’t watched yet and want to remain spoiler-free, please keep that in mind.\n\nStranger Things was an instant sensation when it debuted on Netflix last year. Its potent blend of frights, ’80s nostalgia, and the revival of Winona Ryder’s career made it a hit with fans and critics alike. But there was one thing that Stranger Things fans loved above all else: Barb.\n\nIn season one, Barbara Holland was Nancy Wheeler’s best friend, the nerdy high-schooler clad in Sally Jesse Raphael’s glasses and a puffy, ridiculously cerulean parka. Barb was quiet but loyal, awkward but fabulous, forgotten by Hawkins, Indiana but remembered by the entire audience. She was so great, in fact, actress Shannon Purser nabbed an Emmy nomination for the part. Sadly, Barb was also one of the demogorgon’s first victims. While everyone raced ahead to rescue Will Byers from the Upside Down, Stranger Things treated Barb’s death with the sort of shrug normally reserved for dropping a coin down a storm drain or losing a half-broken umbrella. She was last seen in the Upside Down, with a gross slug monster crawling out of her corpse, and that appeared to be that.\n\nNow, with Stranger Things 2 set to dominate TV marathons this weekend and beyond, one question looms large: Will we finally get justice for Barb?\n\nThe second season opens with Nancy (Natalia Dyer) furious that no one really knows what happened to her friend. The trench coats at the Department of Energy stashed Barb’s car at a bus station, so everyone in Hawkins thinks that she skipped town because teens kept mocking her proto-normcore fashion sense. “It’s like everyone forgot, and no one cares,” Nancy tells her boyfriend, Steve (Joe Keery). “Except her parents … and it’s destroying them.”\n\nCut to the Holland residence, where Nancy and Steve suffer through an excruciatingly sad dinner of KFC with Barb’s parents as penance for knowing what really happened but not being able to tell them. Mr. and Mrs. Holland believe their daughter is still out there, and they’re selling their house to pay a shady investigative journalist to track her down. Understandably, Nancy reacts to this news by getting wasted at a house party and slurring to Steve, “You’re pretending like everything’s okay. Like we didn’t kill Barb. Like we’re partying. We’re partying.”\n\nThe funny thing about Stranger Things 2 is that it basically mimics the format of Stranger Things original recipe. Will (Noah Schnapp) is in danger again. Both seasons feature a new girl wreaking havoc with the group dynamic of Mike (Finn Wolfhard), Dustin (Gaten Matarazzo), Lucas (Caleb McLaughlin). Will’s mother Joyce Byers (Winona Ryder) once again goes from a well-coiffed cashier to someone with the hair of a Times Square Elmo. And just like last time, Nancy has to leave Steve and join up with Will’s brother Jonathan (Charlie Heaton) in order to find Barb.\n\nSoon enough, Nancy learns that the “journalist” is a conspiracy-theory nut named Murray Bauman (Brett Gelman), who believes that Barb tried to help the “Russian girl” who was seen around town — a.k.a. Eleven. His working theory is that Barb was killed because she knew too much. So, in a pretty ingenuous move, Nancy and Jonathan get themselves captured by the feds and taken to Hawkins Lab, where they meet Dr. Owens (Paul Reisder) and record him admitting what really happened to Barb. Then they take the tape to Murray in hopes of exposing the truth to the wider public.\n\nWhen they arrive at Murray’s bunker, he has a wall dedicated to his Barb investigation and all of his “evidence” is connected with red strings. (He’s basically like Carrie Mathison when she goes off her medicine, but I looked at that wall and thought, “Same,” because that is what my apartment looked like in the middle of my Barb fever too.) Nancy tells Murray that he has everything wrong about Barb and fills him in on the truth about the Upside Down. After he hears the tape of Dr. Owens, they come up with a plan to water down the story so that the press will actually report it. Then, for several episodes, Stranger Things yet again forgets about Barb while Nancy and Jonathan hook up, Eleven goes to Chicago to turn herself into Jessica Alba from Dark Angel, Steve reveals the secret to his pompadour come mullet, and everyone fights a bunch of devil dogs (a much better name than “demodogs,” in my humble opinion).\n\nWith all of those non-Barb objectives complete, our heroine finally gets a funeral after the Department of Energy admits culpability in her death, claiming that she was poisoned and they conspired to cover it up. Presumably, Barb’s parents got a nice settlement and Murray got paid, which is kind of ridiculous because Nancy and Jonathan did all the hard work. (All he did was lie around his nasty apartment, listening to jazz and drinking watered-down Stoli. Shouldn’t the teens get a cut too?)\n\nIn the end, Barb is still dead and now everyone knows it, but they think that she was a mere victim of government malfeasance rather than the prey of an interdimensional alien that stalked her after her Nancy bailed to have sex with Steve. She gets some photos placed at the center of some nice bouquets during her funeral, but that’s about it. She’ll probably be forgotten again by the time Stranger Things 3 comes around.\n\nClearly, this is not what true justice looks like. Justice for Barb would be if someone actually appreciated her. If someone saw Barb for who she was and said, “She was great and she deserved better.” Nancy is grappling with a lot of difficult emotions in Stranger Things 2, and she does the admirable thing by helping the Hollands find closure, but she’s mostly just driven by a need to assuage her own guilt. That’s not justice as much as it is penance.\n\nGet all your Stranger Things 2 questions answered at the show’s Vulture Festival LA panel on November 18! Tickets available here.", "images": ["https://pyxis.nymag.com/v1/imgs/e33/6e7/aed044d06bd5c293490430f400dc112e41-2022Cov4x5-AsianAmericaPkg.w240.jpg", "https://pyxis.nymag.com/v1/imgs/31a/165/7b2cda49d5258316afceb071e56d8d3a8b-women-3.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/cd8/1a8/e67063dba9db70085a35376ef886565774-27-stranger-things-barb.rsquare.w700.jpg", "https://www.vulture.com/media/components/customer-alert-banner/close_x.svg", "https://pyxis.nymag.com/v1/imgs/cd8/1a8/e67063dba9db70085a35376ef886565774-27-stranger-things-barb.1x.rsocial.w1200.jpg", "https://www.vulture.com/media/components/customer-alert-banner/alert.svg", "https://pyxis.nymag.com/v1/imgs/5ea/81e/4d3b39a96107c321338c0c9a25557bd47f-zarifa-ghafari.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/c32/3bf/0a393283dc1f3f9257ff8b361ea03216c8-russia-missile.2x.rsquare-zoom.w75.jpg", "https://www.vulture.com/media/components/customer-alert-banner/double_chevron.svg"], "top_img": "https://pyxis.nymag.com/v1/imgs/cd8/1a8/e67063dba9db70085a35376ef886565774-27-stranger-things-barb.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Brian Moylan"], "canonical_link": "https://www.vulture.com/2017/10/stranger-things-2-justice-for-barb.html", "title": "Did Stranger Things Finally Get Justice for Barb?", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "parsely-tags": "stranger things, stranger things 2, stranger things season 2, barb, shannon purser, tv, featuretype:feature", "og": {"title": "Did Stranger Things Finally Get Justice for Barb?", "url": "https://www.vulture.com/2017/10/stranger-things-2-justice-for-barb.html", "description": "Barb plays a surprisingly important role in Stranger Things 2.", "image": "https://pyxis.nymag.com/v1/imgs/cd8/1a8/e67063dba9db70085a35376ef886565774-27-stranger-things-barb.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Did Stranger Things Finally Get Justice for Barb?", "description": "Barb plays a surprisingly important role in Stranger Things 2.", "image": "https://pyxis.nymag.com/v1/imgs/cd8/1a8/e67063dba9db70085a35376ef886565774-27-stranger-things-barb.2x.rsocial.w600.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2017-10-27T17:53:58.979-04:00", "tag": "stranger things, stranger things 2, stranger things season 2, barb, shannon purser, tv", "publisher": "https://www.facebook.com/Vulture"}, "description": "What happens to Barb in Stranger Things 2? Shannon Purser’s beloved character plays an important role in season two of the Netflix sci-fi show.", "robots": "max-image-preview:large", "sailthru.tags": "stranger things, stranger things 2, stranger things season 2, barb, shannon purser, tv", "author": "Brian Moylan", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://assets.nymag.com/media/sites/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1509141238.979, "source": "https://www.vulture.com", "summary": ""}