{"url": "https://deadline.com/2018/02/annihilation-whitewashing-natalie-portman-jennifer-jason-leigh-alex-garland-1202289119/", "text": "Just as Paramount/Skydance’s sci-fi adventure Annihilation was heating up in its word of mouth before its February 23 release, two advocacy groups this week — MANAA (Media Action Network for Asian Americans) and American Indians in Film and Television — took aim at the film for whitewashing its two leading characters, played by Natalie Portman and Jennifer Jason Leigh. This despite the fact Annihilation features an inclusive cast and is largely female-driven with Gina Rodriguez, Tessa Thompson, Sonya Miznuo and Tuva Novotny along with Oscar Isaac and Benedict Wong.\n\nAlex Garland, who directed and adapted the first novel in Jeff VanderMeer’s Southern Reach trilogy, weighed in with a response to the criticism today:\n\n“This is an awkward problem for me, because I think whitewashing is a serious and real issue, and I fully support the groups drawing attention to it. But the characters in the novel I read and adapted were not given names or ethnicities. I cast the film reacting only to the actors I met in the casting process, or actors I had worked with before. There was no studio pressure to cast white. The casting choices were entirely mine. As a middle-aged white man, I can believe I might at times be guilty of unconscious racism, in the way that potentially we all are. But there was nothing cynical or conspiratorial about the way I cast this movie.”\n\nAnnihilation centers on Lena (Portman), a biologist and expedition leader who ventures with a team into a secret environmental disaster area where events went sideways for her husband. In the first novel, the background of Portman’s character and that of Leigh’s government psychologist Dr. Ventress aren’t revealed. It’s not until the second book in the series, Authority, that we learn Portman’s character is of Asian descent, and that Leigh’s is half-Native American/half-Caucasian.\n\nVanderMeer hasn’t commented about the recent whitewashing criticisms, but he has said on Twitter to fans that he “never expected or wanted a faithful adaptation from Garland — just a good one.”\n\nMANAA board member Alieesa Badreshia blasted Garland in a statement this week saying: “He exploits the story but fails to take advantage of the true identities of each character. Hollywood rarely writes prominent parts for Asian American and American Indian characters, and those roles could’ve bolstered the careers of women from those communities.”\n\nEchoed Sonny Skyhawk, founder of American Indians in Film and Television: “We are not surprised by the Whack-a-Mole diversity replacement that goes on; just when you finish objecting to one white-washed casting, another one pops up.”\n\nThe orgs’ gripes come in the wake of DreamWorks/Paramount’s $110 million manga adaptation Ghost in the Shell last year, which was dinged for its casting of Scarlett Johansson in what was originally a Japanese role. Other pics faulted by critics for their whitewashing include Marvel’s Doctor Strange and Cameron Crowe’s Aloha, the latter of which cast Emma Stone as a person of one-quarter Hawaiian and one-quarter Chinese descent.\n\nPortman learned at the pic’s junket, as revealed in a Yahoo! interview, that her character was originally of Asian descent in the book.\n\n“We need more representation of Asians on film, of Hispanics on film, of Blacks on film, and women and particularly women of color, Native Americans — I mean, we just don’t have enough representation,” the Oscar-winning Black Swan actress said in response to being questioned about the controversy.\n\n“These categories like ‘white’ and ‘nonwhite’ — they’re imagined classifications but have real-life consequences. … And I hope that begins to change, because I think everyone is becoming more conscious of it, which hopefully will make change,” she added.\n\nSaid Leigh, “There should be more parts for everyone and more diversity in all films.”\n\nTracking currently has Annihilation opening to between $10M-$15M. Those figures could grow, and given the pic’s heat, Netflix has the most to gain after taking international on Annihilation, rolling it out 17 days after domestic, as reported exclusively by Deadline.", "images": ["https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://deadline.com/wp-content/uploads/2018/02/annihilation.jpg?w=960", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://deadline.com/wp-content/uploads/2018/02/annihilation.jpg?w=681&h=383&crop=1", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1"], "top_img": "https://deadline.com/wp-content/uploads/2018/02/annihilation.jpg?w=960", "keywords": [], "authors": ["Anthony D'Alessandro"], "canonical_link": "https://deadline.com/2018/02/annihilation-whitewashing-natalie-portman-jennifer-jason-leigh-alex-garland-1202289119/", "title": "‘Annihilation’ Director Alex Garland On Whitewashing Accusations: “Nothing Cynical Or Conspiratorial” In Movie’s Casting", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Annihilation director Alex Garland has weighed in with a response to the claims of whitewashing casting in the movie.", "news_keywords": "Alex Garland, Annihilation, Jennifer Jason Leigh, Natalie Portman, Paramount", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=533209613", "generator": "WordPress 6.0.2", "author": "Anthony D'Alessandro", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Deadline", "application-name": "Deadline", "content_type": "Article", "post_id": 1202289119, "title": "'Annihilation' Director Alex Garland On Whitewashing Accusations: \"Nothing Cynical Or Conspiratorial\" In Movie's Casting", "published_at": "2018-02-14 18:04:53", "image": "https://deadline.com/wp-content/uploads/2018/02/annihilation.jpg?w=296&h=166&crop=1", "comment_count": 20, "tags": "Paramount", "topics": "Film", "body": "Just as Paramount/Skydance's sci-fi adventure Annihilation was heating up in its word of mouth before its February 23 release, two advocacy groups this week -- MANAA (Media Action Network for Asian Americans) and American Indians in Film and Television -- took aim at the film for whitewashing its two leading characters, played by Natalie Portman and Jennifer Jason Leigh. This despite the fact Annihilation features an inclusive cast and is largely female-driven with Gina Rodriguez, Tessa Thompson, Sonya Miznuo and Tuva Novotny along with Oscar Isaac and Benedict Wong.\r\n\r\nAlex Garland, who directed and adapted the first novel in Jeff VanderMeer's Southern Reach trilogy, weighed in with a response to the criticism today:\r\n\r\n\"This is an awkward problem for me, because I think whitewashing is a serious and real issue, and I fully support the groups drawing attention to it.\r\n But the characters in the novel I read and adapted were not given names or ethnicities.  I cast the film reacting only to the actors I met in the casting process, or actors I had worked with before.  There was no studio pressure to cast white.  The casting choices were entirely mine.\r\n As a middle-aged white man, I can believe I might at times be guilty of unconscious racism, in the way that potentially we all are.  But there was nothing cynical or conspiratorial about the way I cast this movie.\"\r\n\r\n\r\nAnnihilation centers on Lena (Portman), a biologist and expedition leader who ventures with a team into a secret environmental disaster area where events went sideways for her husband. In the first novel, the background of Portman's character and that of Leigh's government psychologist Dr. Ventress aren't revealed. It's not until the second book in the series, Authority, that we learn Portman's character is of Asian descent, and that Leigh's is half-Native American/half-Caucasian.\r\n\r\nVanderMeer hasn't commented about the recent whitewashing criticisms, but he has said on Twitter to fans that he \"never expected or wanted a faithful adaptation from Garland -- just a good one.\"\r\n\r\nMANAA board member Alieesa Badreshia blasted Garland in a statement this week saying: “He exploits the story but fails to take advantage of the true identities of each character. Hollywood rarely writes prominent parts for Asian American and American Indian characters, and those roles could’ve bolstered the careers of women from those communities.”\r\n\r\nEchoed Sonny Skyhawk, founder of American Indians in Film and Television: “We are not surprised by the Whack-a-Mole diversity replacement that goes on; just when you finish objecting to one white-washed casting, another one pops up.\"\r\n\r\nThe orgs' gripes come in the wake of DreamWorks/Paramount's $110 million manga adaptation Ghost in the Shell last year, which was dinged for its casting of Scarlett Johansson in what was originally a Japanese role. Other pics faulted by critics for their whitewashing include Marvel's Doctor Strange and Cameron Crowe's Aloha, the latter of which cast Emma Stone as a person of one-quarter Hawaiian and one-quarter Chinese descent.\r\n\r\nPortman learned at the pic's junket, as revealed in a Yahoo! interview, that her character was originally of Asian descent in the book.\r\n\r\n“We need more representation of Asians on film, of Hispanics on film, of Blacks on film, and women and particularly women of color, Native Americans — I mean, we just don’t have enough representation,\" the Oscar-winning Black Swan actress said in response to being questioned about the controversy.\r\n\r\n“These categories like ‘white’ and ‘nonwhite’ — they’re imagined classifications but have real-life consequences. … And I hope that begins to change, because I think everyone is becoming more conscious of it, which hopefully will make change,\" she added.\r\nSaid Leigh, “There should be more parts for everyone and more diversity in all films.”\r\n\r\nTracking currently has Annihilation opening to between $10M-$15M. Those figures could grow, and given the pic's heat, Netflix has the most to gain after taking international on Annihilation, rolling it out 17 days after domestic, as reported exclusively by Deadline.", "fb": {"pages": 105558754896}, "onesignal": "wordpress-plugin", "fragment": "!", "og": {"type": "article", "title": "‘Annihilation’ Director Alex Garland On Whitewashing Accusations: “Nothing Cynical Or Conspiratorial” In Movie’s Casting", "url": "https://deadline.com/2018/02/annihilation-whitewashing-natalie-portman-jennifer-jason-leigh-alex-garland-1202289119/", "description": "Just as Paramount/Skydance’s sci-fi adventure Annihilation was heating up in its word of mouth before its February 23 release, two advocacy groups this week — MANAA (Media Action Networ…", "site_name": "Deadline", "image": {"identifier": "https://deadline.com/wp-content/uploads/2018/02/annihilation.jpg?w=960", "width": 960, "height": 640, "alt": "Annihilation"}, "locale": "en_US"}, "article": {"published_time": "2018-02-15T02:04:53+00:00", "modified_time": "2018-02-15T02:31:55+00:00"}, "twitter": {"site": "@DEADLINE", "creator": "@AwardsTony", "card": "summary_large_image", "title": "‘Annihilation’ Director Alex Garland On Whitewashing Accusations: “Nothing Cynical Or Conspiratorial” In Movie’s Casting", "description": "Annihilation director Alex Garland has weighed in with a response to the claims of whitewashing casting in the movie.", "image": "https://deadline.com/wp-content/uploads/2018/02/annihilation.jpg?w=960"}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1518660293.0, "source": "https://deadline.com", "summary": ""}