{"url": "https://www.romper.com/p/jimmy-kimmels-fake-beyonce-twin-names-make-important-point-about-celebrity-obsession-69878", "text": "With so much speculation surrounding the reported birth of Beyoncé and JAY-Z's twins, it seems like fans are ready to grasp onto any news surrounding news surrounding their existence or birth — and I don't blame them. Jimmy Kimmel decided to test this theory, taking to the streets of Los Angeles to have a little fun with innocent Beyoncé fans (and give them some fake info about her twins names). But Jimmy Kimmel's fake Beyoncé twin names make a very important point — celebrity obsession has gotten a little out of hand.\n\nKimmel is known for his \"lie witness news\" segments on his late night talk show, Jimmy Kimmel Live!, tricking innocent bystanders on the streets into believing some ridiculous headlines. His segment on Tuesday's night show was no different. Instead of headlines, Kimmel got people to believe that Beyoncé and JAY-Z had named their kids some pretty fun names, making them congratulate the couple on the birth of their twins. \"This afternoon, we went out on the street and asked people to congratulate Beyoncé and JAY-Z on their recent arrival with some baby names we made up,\" Kimmel told the audience. The results were pretty hilarious and definitely worth watching (and also a little embarrassing).\n\nThe full list of names that Kimmel's producers convinced bystanders to say aloud (and congratulate Beyoncé and JAY-Z for) are pretty great:\n\nCucumber & Uvula\n\nDenver & Omelette\n\nLandline & Retweet\n\nBedbath & Beyondcé\n\nPantene & Neosporin\n\nZumba & Zika\n\nBong & Blunt\n\nCoco Loco & Hydraulics\n\nMegatron & Gluten\n\nEmphysema & Kevin\n\nGonorrhea & Amoxicillin\n\nBebop & Rocksteady\n\nThe twins' real rumored names, Rumi and Sir, are no where near as crazy as the names that Kimmel and company came up with but still pretty unique nonetheless. And because Beyoncé and JAY-Z haven't actually confirmed the names of the twins, they very well could be named any of Kimmel's combinations (my money is on Bedbath and Beyondcé).\n\nAll jokes aside, Kimmel's segment makes an important point about celebrity obsession. The video proves that fans (and society as a whole) are so happy for celebrities they love that when they give birth, people are willing to pretend to be overjoyed over even the most ridiculous rumors. The fact of the matter is, it has been a little less than a month since it was reported that Beyoncé gave birth and she still hasn't even confirmed the fact that she went into labor herself. Maybe we should all consider this a lesson about learning to just chill.\n\nFor the past three weeks, fans have been holding on to any bit of information that sounds legitimate — that the twins were reportedly born prematurely and spent some time \"under the lights\", that they are reportedly a boy and a girl, and that their names are reportedly Rumi and Sir — and even some rumors that are much less believable, like the one about them paying millions of dollars for a pacifier, for instance.\n\nFor all we know, every one of those things could be just as made up as the names \"Zumba and Zika\" — and yet fans are still choosing to believe this information is real because it's all they can get for the moment.\n\nThere's nothing wrong with being a devoted fan of a specific musician, actor, or public figure, but maybe we should all take a few pointers from Kimmel's show and take a breather for a few minutes, before we make ourselves look silly.", "images": ["https://cdn2.bustle.com/2022/romper/logo-3079c0c267.svg", "https://imgix.bustle.com/uploads/image/2022/10/7/5e26fef4-dfb7-48d8-b2ab-a6537a2e56f2-dfccd437-1ec5-4cf5-bf07-47c17429558e-winifred-hp.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2017/7/12/c8882671-7374-4d84-8c9f-9f42cd29f53e-getty-635008688.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2022/10/7/df7a8be6-104c-4db1-9e55-eb84cba1b728-getty-1193190577.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/10/6/6c7441ac-6254-498b-bc14-3405863ce3d7-getty-1241120058.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2017/7/12/c8882671-7374-4d84-8c9f-9f42cd29f53e-getty-635008688.jpg?w=540&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2022/10/7/204b2116-72fb-4450-894a-160559b7f490-amy.PNG?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/7/12/c8882671-7374-4d84-8c9f-9f42cd29f53e-getty-635008688.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/jimmy-kimmels-fake-beyonce-twin-names-make-important-point-about-celebrity-obsession-69878", "title": "Jimmy Kimmel's Fake Beyoncé Twin Names Prove A Big Point", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image", "creator": "@casuglia"}, "article": {"publisher": "https://www.facebook.com/romperdotcom"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/jimmy-kimmels-fake-beyonce-twin-names-make-important-point-about-celebrity-obsession-69878", "type": "article", "title": "Jimmy Kimmel's Fake Beyoncé Twin Names Prove A Big Point", "description": "With so much speculation surrounding the reported birth of Beyoncé and JAY-Z's twins, it seems like fans are ready to grasp onto any news surrounding news surrounding their existence or birth — and I don't blame them. Jimmy Kimmel decided to test…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/7/12/c8882671-7374-4d84-8c9f-9f42cd29f53e-getty-635008688.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "With so much speculation surrounding the reported birth of Beyoncé and JAY-Z's twins, it seems like fans are ready to grasp onto any news surrounding news surrounding their existence or birth — and I don't blame them. Jimmy Kimmel decided to test…"}, "movies": ["https://www.youtube.com/embed/AxZBGLOa4NM"], "publish_date": null, "source": "https://www.romper.com", "summary": ""}