{"url": "https://web.archive.org/web/20220825175435/https://www.thequiz.com/plan-a-wedding-and-get-matched-with-a-celebrity-groom/", "text": "Plan A Wedding And Get Matched With A Celebrity Groom! by Stephanie Harper\n\n– on Jun 18th\n\nin Entertainment\n\nGetting married is such an exciting adventure! The weeks leading up to the wedding day are filled to the brim with planning and organizing. A lot of the planning has to do with finding the perfect flowers, music, wedding gown, diamond ring, and superstitious accessories like something borrowed and something blue. When it comes to finding the perfect wedding flowers, would you be interested in irises, carnations, or roses? What about hydrangeas, dahlias, or daffodils? When it comes to wedding music, would you want classical music or modern music? It might be difficult to decide! Wedding gowns are another major part of wedding planning because brides love to feel absolutely stunning on their big day. It can sometimes take three or four trips to multiple dress shops before a bride finds the perfect gown for herself. Wedding cakes are also a fun part of wedding planning because brides and grooms are able to go cake tasting together or with their close friends and family. Can you decide between red velvet or vanilla for your perfect wedding cake? Take this quiz to plan the perfect, most romantic and beautiful wedding and we will reveal which celebrity groom you might end up with!\n\nadvertising\n\nQuestion 1 Pick a season for the wedding. Spring Summer Autumn Winter Most people like to get married in the summertime because the weather is so nice but a winter wedding could be pretty too! Imagine all the snow surrounding you? There are only four seasons to choose from... Which season would you like to be married in?\n\nQuestion 2 What time of day should the ceremony be held? Morning, like 11 AM Afternoon, like 1:30 PM Evening, like 6 PM Nighttime, like 9:30 PM The time of day that a bride and groom choose to marry each other is a big deal! It accounts for the type of lighting you will have in your pictures if you are having an outdoor wedding. What time of day would you like to be married?\n\nQuestion 3 Pick a location for the wedding ceremony. In an exquisite cathedral or church Outdoors in a flower filled garden On a breezy, sunny beach In a fairytale-like forest Location is everything when it comes to weddings. Your wedding day is the most memorable day of your life so of course it has to take place in a place that makes you feel warm and excited. Which wedding location would you pick?\n\nQuestion 4 Which wedding theme is best? Rustic Elegant Vintage Fairytale The theme you choose for your wedding says a lot about you and your groom. What is your style? Do you like the rustic look more than an elegant look? Do you prefer vintage over a fairytale heme? Which wedding theme suits you best?\n\nQuestion 5 Pick some flowers for the bridal bouquet. Roses Lilies Peonies Dahlias The bouquet of flowers we carry with us down the aisle on our wedding day also show up in almost every picture you keep from the big day! That means your flower choice has to be spot on. Which of these flowers would you choose for your bouquet?\n\nQuestion 6 Pick a color scheme to pair with white. White and platinum silver White and pale pink White and navy blue White and chocolate brown The color scheme for a wedding is often paired with the classic color of white. Which color do you think you might like to see next to the color white at your wedding? Often times, we like the color scheme to go along with our favorite color.\n\nQuestion 7 Now, pick a general wedding color scheme. Brick red and tangerine orange Gold and black Sky blue and pale green Emerald green and magenta When it comes to wedding colors, not everything has to be paired with white. White may be the classic color that you think of when you think of weddings but it does not always have to be chosen. Which wedding color scheme would you pick, without pairing with white?\n\nQuestion 8 Which style wedding dress would you pick? Mermaid style Princess style Boho Vintage The wedding dress is one of the most important parts of the wedding. The bride must feel beautiful on her big day after all. For example, Kate Hudson had a simple, beautiful wedding dress in the movie Bride Wars. Which style wedding dress would you pick?\n\nQuestion 9 Who would you love to design your wedding dress? Vera Wang Zac Posen Melissa Sweet Oleg Cassini We might not be able to really get a famous fashion designer to design our wedding dresses one day but it is still a nice dream to have! Wedding designers like Zac Posen, Melissa Sweet, Vera Wang, and Oleg Cassini are so talented!\n\nQuestion 10 What shade of white would you like your dress to be? Pearl white with a slight shimmer A creamy off-white Classic and traditional pure white Who said it was going to be white? When it comes to the color of the wedding dress, your options are open. You can keep it traditional or branch out and do your own thing. It is up to the bride to decide what shade of white or what color her dress will be. What shade of white would you like your dress to be?\n\nQuestion 11 Which fabric would you prefer for your wedding dress? Lace Silk Cotton Chiffon When a bride goes shopping for her wedding dress, of course she is going to try on dresses that appeal to her sight! But she is also going to like a dress better if the texture of the fabric feels lovely on her skin. Which fabric would you prefer for your wedding dress?\n\nQuestion 12 Pick a diamond cut for your ring. Round cut Princess cut Pear cut Marquise cut Diamonds are a girl's best friend! Especially on the wedding day. The cut of your diamond ring definitely matters because it can change the way you look at your ring for the rest of your life. How do you want the diamond on your ring cut?\n\nQuestion 13 How many carats would you want your ring to be? 0.5 carats-- I don't care about flashy things 1 carat-- but I want it super shiny! 2 carats-- So it will stand out anywhere 3 carats-- I want my diamond huge! Size does matter--especially when it comes to diamonds. Some women prefer smaller diamonds because they are less flashy and might feel more intimate. Some women need their rock to be ginormous! nothing wrong with that either.\n\nQuestion 14 How many guests would you invite? Just a few family members and friends Around 50 people Around 100 people 200 or more! Everyone's invited! Some people like to treat their wedding day like a small and intimate gathering and others want it to feel more like a party! Then there are the folks who are sort of in between. What size crowd do you want at your wedding?\n\nQuestion 15 What will be the main course for supper? Lobster Filet Mignon Salmon Fettuccine alfredo Wedding guests are excited to chow down on dinner when they first arrive to a wedding. Dinner comes after the ceremony, during the reception and it is usually delicious. What will be the main course of the wedding dinner?\n\nQuestion 16 How do you want supper to be served? Served by waiters Buffet style Family style Plates meals The way that the food is served in a wedding is up to how the bride and groom want to do things on their special day. Buffet style dinners are popular at weddings but not everyone is a fan of that style. How do you want supper to be served?\n\nQuestion 17 What flavor cake do you want at your wedding? Vanilla Chocolate Strawberry Red Velvet Everyone loves taking a bite into a fluffy and delicious slice of wedding cake. Sometimes, the cake is the best part of the entire day. Watching the newlywed husband and wife cut the first piece together is always so romantic.\n\nQuestion 18 What will be for dessert besides the cake? Éclairs Tiramisu Chocolate dipped strawberries Lemon meringue pie Dessert from a wedding buffet always tastes the best. Aside from the delicious wedding cake, there is usually always other dessert options to choose from and dive into! What will be for dessert besides the classic wedding cake?\n\nQuestion 19 Will you have an open bar? Yes, of course Only champagne and wine There will be a bar but not an \"open\" one No way, I'm having a dry wedding An open bar at a wedding is something that sometimes invites wedding crashers onto the scene! Who would not want free liquor? This is why some people opt out of having alcohol at their weddings! Will you have an open bar at your wedding?\n\nQuestion 20 Which wedding quote do you like best? \"The best thing to hold onto in life is each other.\" —Audrey Hepburn \"In the end, the love you take is equal to the love you make.\" —The Beatles \"At the touch of love everyone becomes a poet.\" —Plato \"Love is composed of a single soul inhabiting two bodies.\" —Aristotle When it comes to loving sentiments and quotes from the heart that people like to use at wedding ceremonies, the more romantic the quote the better! Lovey dovey quotes are perfect for spreading romantic vibes. Which wedding quote do you like best?\n\nQuestion 21 Which wedding magazine inspires your wedding planning the most? Premier Bride Bridal Guide The Knot Magazine Wedding Style Women love to refer to wedding magazines for inspiration and ideas once they get engaged to the man of their dreams. Wedding magazines are filled with awesome color schemes and dress styles. Which wedding magazine inspires your wedding planning the most?\n\nQuestion 22 Which of these celebrity weddings inspires you most? Ryan Reynolds and Blake Lively John Legend and Chrissy Teigen Adam Brody and Leighton Meester Ashton Kutcher and Mila Kunis Celebrity weddings can give those of us \"regular\" folks a lot of cool ideas for how we want our weddings to look. Celebrity wedding dresses, wedding cakes, and wedding flowers are especially enticing! Which of these celebrity weddings inspires you most?\n\nQuestion 23 Will you hire a professional photographer? Of course! I want one but it depends on our budget I'll probably have a friend take photos No thanks Pictures are usually a big deal for the bride and groom on their wedding day. Pictures capture the lovely memory of the most beautiful day two people share with each other! Photographers bring a lot to the table because of that. Will you hire a professional photographer?\n\nQuestion 24 What is most important: Something old, new, borrowed, or blue? Something old Something new Something borrowed Something blue Needing something old, something new, something borrowed, and something blue on your wedding day has been a long standing tradition. It is a saying that is meant to ensure good luck and a happy marriage. What is most important: Something old, new, borrowed, or blue?\n\nQuestion 25 Which traditional “old” accessory would you want? The veil The earrings The necklace The tiara The traditional \"old\" accessory a bride wears on her wedding day usually comes from her grandmother or her mother and it is something they wore on their own wedding day way back when. Which traditional “old” accessory would you want?\n\nQuestion 26 Which traditional “new” accessory would you want? Wedding garter Wedding heels Wedding gloves Wedding lingerie The traditional \"new\" accessory a bride wears on her wedding day usually is given to the bride as a gift by her maid of honor or groom. It is also something she can purchase for herself to wear on her big day. Which traditional “new” accessory would you want?\n\nQuestion 27 Which traditional “borrowed” accessory would you want? Wedding bracelet Wedding brooch Wedding clutch Wedding sash The traditional \"borrowed\" accessory a bride wears on her wedding day usually comes from a woman in her life who means a lot to her. It could be her mom, her sister, or even her best friend! Which traditional “borrowed” accessory would you want?\n\nQuestion 28 Which traditional “blue” accessory would you want? Wedding hairpin Wedding fan Wedding corset Wedding headband The traditional \"blue\" accessory a bride wears on her wedding day could be a hairpin, a fan, a corset, a headband, or any other pretty accessory you think of. It could really be anything! Which traditional “blue” accessory would you want?\n\nQuestion 29 Who will design your groom's tuxedo? David Donahue Emporio Armani Calvin Klein Steve Madden Every bride wants her groom to look absolutely perfect on the big day. His tuxedo is a big deal and it has to be up to par! Grooms sometimes even have their own plans for what they want their tux to look like. Who will design your groom's tuxedo?\n\nQuestion 30 What color will your groom's tuxedo be? Black White Beige or Grey Whatever color my groom wants! Do you want to be traditional with the groom tuxedo or do your own thing at your wedding? Do you want to make the final call on what your groom is wearing or will you leave it up to him? What color will your groom's tuxedo be?\n\nQuestion 31 Which wedding quote do you like best? \"Great love affairs start with Champagne...\" —Honoré de Balzac \"Love must be as much a light as it is a flame.\" —Henry David Thoreau \"I wish I'd done everything on Earth with you.\" —F. Scott Fitzgerald \"The sight of lovers feedeth those in love.\" —William Shakespeare Words of love, affirmation, and romance are always spoken out loud at wedding ceremonies and at wedding receptions. Wedding days are the perfect days to discuss the intricate beauties of love and romance! Which wedding quote do you like best?\n\nQuestion 32 Which wedding TV show inspires you most for wedding planning? Bridezillas Say Yes to the Dress Platinum Weddings I haven't seen any of these shows Do you ever settle into bed with Netflix on and choose a wedding based TV show to watch? Most of us have done so at least once or twice. Wedding TV shows are inspiring and fun. Which wedding TV show inspires you most for wedding planning?\n\nQuestion 33 Are you willing to see your future spouse on the morning of your wedding day? Sure, why not? Only in case of emergency No, I want him to be surprised No way! There is a famous superstition that has circulated around basically forever when it comes to the wedding day. The bride and groom are not supposed to see each other until the moment when the bride is walking down the aisle towards her groom.\n\nQuestion 34 How many bridesmaids do you want? 2 or 3 4 or 5 6 or 7 8+ The number of bridesmaids a bride has at her wedding is truly dependent on how many friends she has! Not just any friends-- close friends. Brides love to be surrounded by other women who love and support them on their big day.\n\nQuestion 35 What kind of music do you want at your wedding? A jazz band A classical orchestra An acoustic soloist A DJ The music at a wedding is extremely important for the vibe of the evening. The music that is playing during the ceremony or reception can be modern or classical-- it can be whatever you and your groom want it to be! What kind of music do you want at your wedding?\n\nQuestion 36 Which song would you be happy to walk down the aisle to? The classic wedding march “Here Comes the Sun,” by The Beatles “Me and You,” by Kenny Chesney “What a Wonderful World,” by Louis Armstrong Walking down the aisle is a pivotal moment on a wedding day. The bride is the center of attention for the whole crowd to see-- and for her groom to see! The song playing during this moment is important! Which song would you be happy to walk down the aisle to?\n\nQuestion 37 What kind of flower petals will the flower girl toss? Classic rose petals Orchids They'll be tossing silk rose petals They won't be tossing flower petals The flower girl is the little girl who tosses flower petals down the aisle before the bride walks down to aisle. The flower girl is usually a younger relative of the bride or groom. What kind of flower petals will the flower girl toss?\n\nQuestion 38 Will there be security at your wedding? Of course! Only if we can afford it Maybe, depending on the area No thanks Sometimes it is important to have a security guard or two around for big events like a wedding. Security would help prevent wedding crashers from showing up unexpectedly and they would keep everything safe and orderly. Will there be security at your wedding entrance?\n\nQuestion 39 What budget for a wedding sounds the most reasonable? $1,000 $5,000 $25,000 $100,000 Do you want your wedding day to be simple and quaint or do you want is to be super extravagant? The more extravagant your wedding is, the more expensive it probably is! Money is a big factor in wedding planning. What budget for a wedding sounds reasonable to you?\n\nQuestion 40 Which movie wedding is your favorite? Father of the Bride The Graduate Runaway Bride I haven't seen any of these movies Wedding movies bring a lot of inspiration to future brides who plan to walk down the aisle soon! Most wedding movies showcase flower arrangements, dress styles, and wedding songs that are popular. Which movie wedding scene is your favorite to watch?\n\nQuestion 41 Pick a shape for your nails. Square tipped Coffin tipped Oval tipped Almond tipped Wedding day nails are meant to be special and delightful! Those nails will be there in your wedding day pictures and you will have them on your honeymoon too! If you get your nails done for your wedding, it might make you feel prettier. What shape for your nails?\n\nQuestion 42 Which wedding quote do you like best? \"When someone else's happiness is your happiness, that is love.\" —Lana Del Ray \"Have a short memory and a lot of forgiveness.\" —Gabrielle Reece \"Two hearts in love need no words.\" —Marceline Desbordes \"To be brave is to love unconditionally without expecting anything in return.\" —Madonna Have you ever heard a perfect wedding toast at a wedding? One that you wish someone might say at your own wedding? Quotes about love are the perfect addition to the best wedding toasts! Which wedding quote do you like best?\n\nQuestion 43 Where would you celebrate your bachelorette party? Miami Hollywood Portland New York Celebrating your bachelorette party is something you would do in the weeks leading up to your wedding day. It is one of those unforgettable parties that a woman must enjoy during her last few days or weeks of being unmarried. Where would you celebrate your bachelorette party?\n\nQuestion 44 Who will be your wedding officiant? The pastor A close friend on the bride's side A close friend on the groom's side A family member The wedding officiant is the person in charge of \"marrying\" a couple in love. The officiant does not have to be a pastor or a priest, but traditionally the leader of a church is usually the person to do this job. Who will be your wedding officiant?\n\nQuestion 45 Who will be doing your hair? A friend who's a hairstylist I'll be doing my hair myself A professional hairstylist I'll ask a friend A bride's hair on her wedding day is just as important as any other aspect of the event. Some brides prefer to go the simple route, while others will wear their hair in a super extravagant style. The question is, who will be doing your hair on your big day?\n\nQuestion 46 Pick a hairstyle. High ponytail Princess bun Long and straight Long and curled The way a bride feels about herself and her appearance on her wedding day is super important. She has to feel confident and beautiful. Her hairstyle will have a lot to do with how she feels about herself on her big day. How will you wear your hair on your wedding day?\n\nQuestion 47 What would you do with your wedding photos? Post them everywhere, immediately Post them everywhere, after a few days Distribute them to friends and family Keep them private for myself and my husband When it comes to wedding photos, everyone wants a copy! With social media taking over nowadays, it is easy to spread information as well as pictures across platforms to different friends and family. What would you do with your wedding photos?\n\nQuestion 48 How would you like to leave the wedding? Limo Horse and carriage In our own vehicle On foot Do you want to leave the location of your wedding in style? I bet you do! Would you love to drive off in a limo, ride away in a horse and carriage, leave out in you and your groom's personal car, or run away on foot? How would you like to leave the wedding?\n\nQuestion 49 Will you hashtag your wedding on social media? Yes, of course! No way! I'm indifferent about that I don't even know what that means Hashtagging your wedding is a cool and fun way to spread the word about your big day across social media platforms. You can use a hashtag that relates to you and your groom on pretty much any of the popular platforms. Will you hashtag your wedding on social media?\n\nQuestion 50 Where will the honeymoon be? France Hawaii Jamaica Italy The honeymoon is the most romantic vacation a couple goes on! They get to spend time together in a beautiful location with great scenery right after the wedding day. There are so many options for awesome honeymoon trips. Where will the honeymoon be?", "images": ["https://web.archive.org/web/20220825175435im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20220825175435im_/https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://web.archive.org/web/20220825175435im_/https://static3.thequizimages.com/wordpress/wp-content/uploads/2018/06/wedding-plan-celeb-groom-sq11.jpg"], "top_img": "https://web.archive.org/web/20220825175435im_/https://static3.thequizimages.com/wordpress/wp-content/uploads/2018/06/wedding-plan-celeb-groom-sq11.jpg", "keywords": [], "authors": ["Stephanie Harper"], "canonical_link": "https://web.archive.org/web/20220825175435/https://www.thequiz.com/plan-a-wedding-and-get-matched-with-a-celebrity-groom/", "title": "Plan A Wedding And Get Matched With A Celebrity Groom!", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "twitter": {"card": "summary_large_image", "site": "@thequiz_com"}, "og": {"title": "Plan A Wedding And Get Matched With A Celebrity Groom!", "type": "article", "image": {"identifier": "https://web.archive.org/web/20220825175435im_/https://static3.thequizimages.com/wordpress/wp-content/uploads/2018/06/wedding-plan-celeb-groom-sq11.jpg", "width": 1200, "height": 628}, "url": "https://web.archive.org/web/20220825175435/https://www.thequiz.com/plan-a-wedding-and-get-matched-with-a-celebrity-groom/", "locale": "en_US", "description": "Make some wedding planning picks, and by the end of this quiz, we'll reveal the perfect celebrity groom!", "site_name": "TheQuiz"}, "article": {"published_time": "2018-06-18T15:00:10Z", "section": "Entertainment"}, "fb": {"app_id": 1888896051351709}}, "movies": [], "publish_date": 1529334010.0, "source": "https://web.archive.org", "summary": ""}