{"url": "https://www.hollywoodreporter.com/live-feed/law-order-svu-season-19-sam-waterston-returning-as-jack-mccoy-1041638", "text": "Jack is back.\n\nSam Waterston, who starred on Law & Order for 16 seasons, will reprise his role as prosecutor Jack McCoy on Law & Order: SVU, The Hollywood Reporter has learned.\n\nThe actor will guest-star on an upcoming episode of the NBC spinoff’s 19th season, which kicks off Sept. 27. The role reunites him with new SVU showrunner Michael Chernuchin, who worked on Waterston’s first two seasons of the mothership and helped create the character of Jack McCoy. Fellow SVU exec producer Julie Martin also worked on the final season of the original series.\n\nWaterston joined the NBC legal drama in its fifth season and stayed through the drama’s 20th and final season. NBC then abruptly canceled the series in 2010 — one season before Law & Order could break Gunsmoke‘s record for longest-running primetime drama.\n\nLaw & Order‘s abrupt cancellation means the writers were unable to wrap up storylines for Jack and the other characters. (Fellow longtime cast member S. Epatha Merkerson had already planned to exit at the end of season 20 and was given an emotional final season arc in which her character battled breast cancer.)\n\nThis will actually be Jack McCoy’s fourth appearance on SVU following several crossovers in the early aughts. In recent years, SVU has welcomed back other characters from the mothership including prosecutors Connie Rubirosa (Alana De La Garza) and Michael Cutter (Linus Roache).\n\nDuring his 16-season stint on Law & Order, Waterston won a Screen Actors Guild award for best actor in a drama series and earned three Emmy nominations in the same category. Since Law & Order, he was gone on to roles in Aaron Sorkin’s HBO drama The Newsroom as well as movies including Miss Sloane and Please Be Normal.\n\nIn addition to his starring role on the Netflix comedy Grace & Frankie, Waterston will next appear in the Netflix Western miniseries Godless. He is repped by Gersh and Industry Entertainment.\n\nDespite his busy schedule, Waterston expressed interest in reviving Jack McCoy as recently as 2015, when NBC and Dick Wolf were in talks for a potential Law & Order revival. “Sure, I’d love it,” Waterston told THR in May 2015. “Got to break the record.”\n\nChernuchin also talked to THR about bringing back Jack McCoy earlier this year when he was the showrunner on Chicago Justice. Justice saw the return of several flagship favorites including Richard Brooks, Lorraine Toussaint and Tovah Feldshuh. “We actually talked for a brief second about having Sam come in, but we thought it was too early,” Chernuchin told THR in January. “But maybe in the future.”\n\nHowever, Chicago Justice was canceled in May after one season and Chernuchin subsequently took over the top job at SVU. In his move to SVU, Chernuchin is bringing an important member of the Law & Order universe with him: prosecutor Peter Stone, the son of Law & Order character Ben Stone, played by Waterston’s predecessor Michael Moriarty. Philip Winchester played the role of Peter on Chicago Justice and will join SVU full-time later this season.\n\n“We’ve connected all the Dick Wolf shows,” Chernuchin told THR recently about adding Winchester to the cast. “The original New York franchise, the Chicago franchise, it’s like the small Dickensian universe in London where different characters show up in different novels. That was one of the intriguing things to me by bringing Philip over, is to connect all the franchises.”\n\nLike SVU, which pulls solid numbers in syndication on USA Network, Law & Order continues to live on in repeats on TNT, SundanceTV and WeTV, among other channels.\n\nLaw & Order: SVU returns Wednesday, Sept. 27 at 9 p.m.", "images": ["http://www.hollywoodreporter.com/sites/default/files/custom/Inline%20Graphics%20(Product%20Only)/2015/TV%20Show/Law%20and%20Order%20SVU/THR_tvShowPromo-LaworderSVULogo.png", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2015/05/sam_waterston.jpg?w=2000&h=1126&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2015/05/sam_waterston.jpg?w=1024"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2015/05/sam_waterston.jpg?w=1024", "keywords": [], "authors": ["Kate Stanhope"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/law-order-svu-season-19-sam-waterston-returning-as-jack-mccoy-1041638/", "title": "Sam Waterston to Reprise ‘Law & Order’ Role on ‘SVU’", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The 'Grace and Frankie' star will appear as prosecutor Jack McCoy later this season.", "news_keywords": "Law & Order: SVU, Sam Waterston", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Kate Stanhope", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1041638, "title": "Sam Waterston to Reprise 'Law & Order' Role on 'SVU'", "published_at": "2017-09-20 14:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2015/05/sam_waterston.jpg?w=1024", "comment_count": 0, "tags": "Sam Waterston", "topics": "TV News", "body": "Jack is back.\r\nSam Waterston, who starred on Law & Order for 16 seasons, will reprise his role as prosecutor Jack McCoy on Law & Order: SVU, The Hollywood Reporter has learned.\r\nThe actor will guest-star on an upcoming episode of the NBC spinoff's 19th season, which kicks off Sept. 27. The role reunites him with new SVU showrunner Michael Chernuchin, who worked on Waterston's first two seasons of the mothership and helped create the character of Jack McCoy. Fellow SVU exec producer Julie Martin also worked on the final season of the original series.\r\nWaterston joined the NBC legal drama in its fifth season and stayed through the drama's 20th and final season. NBC then abruptly canceled the series in 2010 — one season before Law & Order could break Gunsmoke's record for longest-running primetime drama.\r\n\r\nLaw & Order's abrupt cancellation means the writers were unable to wrap up storylines for Jack and the other characters. (Fellow longtime cast member S. Epatha Merkerson had already planned to exit at the end of season 20 and was given an emotional final season arc in which her character battled breast cancer.)\r\nThis will actually be Jack McCoy's fourth appearance on SVU following several crossovers in the early aughts. In recent years, SVU has welcomed back other characters from the mothership including prosecutors Connie Rubirosa (Alana De La Garza) and Michael Cutter (Linus Roache).\r\nDuring his 16-season stint on Law & Order, Waterston won a Screen Actors Guild award for best actor in a drama series and earned three Emmy nominations in the same category. Since Law & Order, he was gone on to roles in Aaron Sorkin's HBO drama The Newsroom as well as movies including Miss Sloane and Please Be Normal.\r\n\r\nIn addition to his starring role on the Netflix comedy Grace & Frankie, Waterston will next appear in the Netflix Western miniseries Godless. He is repped by Gersh and Industry Entertainment.\r\nDespite his busy schedule, Waterston expressed interest in reviving Jack McCoy as recently as 2015, when NBC and Dick Wolf were in talks for a potential Law & Order revival. \"Sure, I'd love it,\" Waterston told THR in May 2015. \"Got to break the record.\"\r\nChernuchin also talked to THR about bringing back Jack McCoy earlier this year when he was the showrunner on Chicago Justice. Justice saw the return of several flagship favorites including Richard Brooks, Lorraine Toussaint and Tovah Feldshuh. \"We actually talked for a brief second about having Sam come in, but we thought it was too early,\" Chernuchin told THR in January. \"But maybe in the future.\"\r\n\r\nHowever, Chicago Justice was canceled in May after one season and Chernuchin subsequently took over the top job at SVU. In his move to SVU, Chernuchin is bringing an important member of the Law & Order universe with him: prosecutor Peter Stone, the son of Law & Order character Ben Stone, played by Waterston's predecessor Michael Moriarty. Philip Winchester played the role of Peter on Chicago Justice and will join SVU full-time later this season.\r\n\"We've connected all the Dick Wolf shows,\" Chernuchin told THR recently about adding Winchester to the cast. \"The original New York franchise, the Chicago franchise, it's like the small Dickensian universe in London where different characters show up in different novels. That was one of the intriguing things to me by bringing Philip over, is to connect all the franchises.\"\r\nLike SVU, which pulls solid numbers in syndication on USA Network, Law & Order continues to live on in repeats on TNT, SundanceTV and WeTV, among other channels.\r\nLaw & Order: SVU returns Wednesday, Sept. 27 at 9 p.m.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Sam Waterston to Reprise ‘Law & Order’ Role on ‘SVU’", "url": "https://www.hollywoodreporter.com/tv/tv-news/law-order-svu-season-19-sam-waterston-returning-as-jack-mccoy-1041638/", "description": "The ‘Grace and Frankie’ star will appear as prosecutor Jack McCoy later this season.", "site_name": "The Hollywood Reporter", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2015/05/sam_waterston.jpg?w=1024", "locale": "en_US"}, "article": {"published_time": "2017-09-20T14:00:00+00:00", "modified_time": "2017-09-20T14:56:10+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Sam Waterston to Reprise ‘Law & Order’ Role on ‘SVU’", "description": "The ‘Grace and Frankie’ star will appear as prosecutor Jack McCoy later this season.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2015/05/sam_waterston.jpg?w=3000"}}, "movies": [], "publish_date": 1505916000.0, "source": "https://www.hollywoodreporter.com", "summary": ""}