{"url": "https://nypost.com/2010/01/26/kerrigans-family-tragedy/", "text": "Olympic ice princess Nancy Kerrigan’s father died yesterday after a bizarre scuffle with his hotheaded jailbird son, who thought his dad was faking it when he collapsed in their Massachusetts home, officials said.\n\nDaniel Kerrigan, 70, became known to the world when he carried his injured, sobbing daughter after a vicious attack at a skating competition nearly derailed her Olympic dreams in 1994.\n\nNancy’s brother Mark, 45, was charged with assault after he admitted locking his hands around his father’s throat in an early-morning melee over use of the telephone in the house they share in Stoneham, Mass., authorities said.\n\nCops said he thought his dad was only pretending to be hurt when he fell to the floor.\n\nCharges against the son could be upgraded after the release of autopsy results that will determine the cause of death.\n\nThe skater’s legally blind mother, Brenda, said that he had suffered a massive heart attack, but officials have not confirmed that. Other family members — who were not present for the attack — insisted his death was not related to the fight.\n\n“The present charges are based on the facts as we presently know them,” said local district attorney Gerard Leone.\n\n“Any further charging developments will be based in large measure upon a reliance on the final opinion issued by the Chief Medical Examiner regarding the cause and manner of death of the decedent.”\n\nThe fight happened in Nancy Kerrigan’s childhood home, where she first dreamed of Olympic stardom.\n\nShe was a self-described tomboy with two hockey-playing big brothers until her parents began to nurture her love of figure skating\n\nDaniel Kerrigan, a welder, drove a Zamboni ice-cleaning machine at the local rink in exchange for her practice time on the ice, and the parents took out a second mortgage on their home to help pay for her skating lessons.\n\nNancy, who still skates at exhibitions, was spotted yesterday enter- ing the bright yellow house on Cedar Avenue, hours after an emergency crew carried her father out.\n\nHer pained expression contrasted with the electric smile that warmed fans all over the world after she pirouetted her way to Olympic eminence, winning a bronze medal at the 1992 Winter Games.\n\nShe got a silver medal at the Olympics two years later in Lillehammer, Norway.\n\nBut before her second appearance, rival skater Tonya Harding hired a goon to attack her during an Olympic qualifying session.\n\nHe whacked her with a collapsible baton just above her right knee. The attacker was jailed, Harding paid a $150,000 fine and Kerrigan recovered completely.\n\n“I hate the fact that the Kerrigan’s laundry is aired out in newspapers all around the world and everybody has to know all about us,” her other brother, Michael, said at the time.\n\nNancy married her manager, Jerry Solomon, in 1995. They live in Lynnfield, Mass., and have three children.\n\nNeighbors in the suburban Boston town remembered Daniel Kerrigan as a man who doted on his daughter and was completely devoted to all his children.\n\n“It is a terrible, terrible thing,” said neighbor Betty Svendsen. “He is the loveliest man. He sacrificed all of his life for his children.\n\n“It’s hard to fathom. I’m in shock.”\n\nStoneham resident Jim Sarno said, “I’ll always remember how he helped young skaters at the Stoneham rink. I can still visualize him on the Zamboni making ice.”\n\nNeighbors recalled a close-knit family, but court papers filed in 2008 revealed severe problems brewing under the surface.\n\nAccording to records, Nancy’s parents sued Mark in 2006, claiming he owed them $105,000 for taking care of his dogs, paying his mortgage and for hiring a lawyer to represent him on assault charges in 2006.\n\nMark’s address at the time was listed as the Middlesex County House of Correction, where he was serving a sentence for the assault.\n\nMark was held on $10,000 bail yesterday after an arraignment during which he hung his head and wept.\n\nProsecutors said he had a long criminal record that included arrests for assault and battery, assault with a dangerous weapon, malicious destruction and violation of a restraining order.\n\nHe was released in November and has been living in his parents’ basement ever since.\n\nFamily and friends came to the house in the steady rain yesterday, delivering food and heartfelt prayers.\n\nSome recalled how the media flocked to the neighborhood when Nancy’s career peaked. Now the spotlight was back, and no one was happy.\n\n“We were all so thrilled for Nancy then,” Svendsen said. “She’s devoted to her mother and will be her strength.”\n\nleonard.greene@nypost.com\n\n", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6390601&cj=1&cv=3.6", "https://nypost.com/wp-content/uploads/sites/2/2013/08/daniel_kerrigan-300x300.jpg?quality=75&strip=all&w=300", "https://nypost.com/wp-content/uploads/sites/2/2022/10/gone-wrong1.jpg?quality=75&strip=all&w=260", "https://nypost.com/wp-content/mu-plugins/vip-helpers/images/vip-powered-dark-small.png?ver=20220317", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0", "https://nypost.com/wp-content/uploads/sites/2/2022/10/EP.-6-wp-thumb_NEW-1.jpg?quality=75&strip=all&w=260", "https://nypost.com/wp-content/uploads/sites/2/2022/09/chloe-grace-moretz-comp.jpg?quality=75&strip=all&w=260", "https://nypost.com/wp-content/uploads/sites/2/2022/10/pitbull-mauling-317.jpg?quality=75&strip=all&w=260", "https://nypost.com/wp-content/uploads/sites/2/2022/10/monopoly.png?w=260", "https://decider.com/wp-content/uploads/2022/10/Ron-DeSantis-Ana-Navarro.jpg?quality=90&strip=all&w=322&h=215&crop=1", "https://pagesix.com/wp-content/uploads/sites/3/2022/10/jen-shah-417.jpg?quality=90&strip=all&w=322&h=213&crop=1"], "top_img": "https://nypost.com/wp-content/uploads/sites/2/2013/08/daniel_kerrigan-300x300.jpg?quality=75&strip=all&w=300", "keywords": [], "authors": [], "canonical_link": "https://nypost.com/2010/01/26/kerrigans-family-tragedy/", "title": "Kerrigan’s family tragedy", "meta_data": {"copyright": "Copyright 2022 NYP Holdings. All rights reserved.", "viewport": "width=device-width, initial-scale=1", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "robots": "max-image-preview:large", "description": "Olympic ice princess Nancy Kerrigan’s father died yesterday after a bizarre scuffle with his hotheaded jailbird son, who thought his dad was faking it...", "generator": "WordPress 5.9.4", "fb": {"pages": 225343690812937}, "nypost-section": "News", "parsely-metadata": "{\"post_id\":\"nypost-861444\"}", "keywords": "News", "article": {"opinion": "false", "content_tier": "free", "published_time": "2010-01-26T05:00:00+00:00", "modified_time": "2010-01-26T05:00:00+00:00", "publisher": "https://www.facebook.com/nypost"}, "sailthru.date": "2010-01-26 05:00:00", "sailthru.title": "Kerrigan’s family tragedy", "sailthru.tags": ",News", "sailthru.description": "Olympic ice princess Nancy Kerrigan’s father died yesterday after a bizarre scuffle with his hotheaded jailbird son, who thought his dad was faking it when he collapsed in their Massachusetts...", "sailthru.image.full": "https://nypost.com/wp-content/uploads/sites/2/2013/08/daniel_kerrigan-300x300.jpg?quality=75&strip=all", "sailthru.image.thumb": "https://nypost.com/wp-content/uploads/sites/2/2013/08/daniel_kerrigan-300x300.jpg?quality=75&strip=all&w=50", "google-site-verification": "eyT36MjcFGn_qzUdS9VyWVb89Lq2f8-ItpI8WRksiyw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "og": {"type": "article", "title": "Kerrigan’s family tragedy", "url": "https://nypost.com/2010/01/26/kerrigans-family-tragedy/", "description": "Olympic ice princess Nancy Kerrigan’s father died yesterday after a bizarre scuffle with his hotheaded jailbird son, who thought his dad was faking it when he collapsed in their Massachusetts…", "site_name": "New York Post", "image": {"identifier": "https://nypost.com/wp-content/uploads/sites/2/2013/08/daniel_kerrigan-300x300.jpg?quality=75&strip=all&w=300", "secure_url": "https://nypost.com/wp-content/uploads/sites/2/2013/08/daniel_kerrigan-300x300.jpg?quality=75&strip=all&w=300"}, "locale": "en_US"}, "twitter": {"creator": "@nypost", "site": "@nypost", "text": {"title": "Kerrigan's family tragedy"}, "image": {"identifier": "https://nypost.com/wp-content/uploads/sites/2/2013/08/daniel_kerrigan-300x300.jpg?quality=75&strip=all&w=300", "src": "https://nypost.com/wp-content/uploads/sites/2/2013/08/daniel_kerrigan-300x300.jpg?quality=75&strip=all&w=300"}, "card": "summary_large_image", "title": "Kerrigan's family tragedy", "description": "Olympic ice princess Nancy Kerrigan’s father died yesterday after a bizarre scuffle with his hotheaded jailbird son, who thought his dad was faking it when he collapsed in their Massachusetts..."}}, "movies": [], "publish_date": 1264464000.0, "source": "https://nypost.com", "summary": ""}