{"url": "https://web.archive.org/web/20180202231357/http://econewsmedia.org/2018/02/01/nfl-lawyer-claimed-super-bowl-rigged-found-dead/", "text": "An NFL entertainment lawyer, who has worked for the corporation for more than 15 years, has been found dead in New York City hours after telling reporters that Super Bowl LII is “rigged.”\n\nDan Goodes was found dead in his hometown of New York City in what early reports described as an “gangland-style execution”, hours after blowing the whistle on the “rigged Super Bowl” backstage at a promotional event in Minneapolis.\n\nEarly reports claim the 49-year-old was found shot dead in a 2017 BMW 2 Series, along with one other man, believed to be a close friend.\n\nGoodes, an entertainment lawyer who worked at the National Football League’s Park Avenue headquarters, had been representing the NFL in Minneapolis, working alongside Eagles and Patriots franchise staff on promoting Sunday’s Super Bowl featuring the two teams.\n\nHowever Goodes went “off-script” in Minneapolis and was “physically removed” from the premises by security staff, but not before publicly condemning the NFL as “totally corrupt” and claiming the Super Bowl is “fixed.”\n\n\n\n\n\nTelling reporters that he is a “football fan first and foremost, and a lawyer second”, Goodes said “Football in America in 2018 doesn’t need another rigged Super Bowl. We need a great match. Not another rigged result that doesn’t pass the sniff test.\n\n“I like money as much as the next guy. But I like football more. I can’t stand by and allow rampant greed and cynicism to destroy the game I love. The little boy in me won’t allow it.\n\n“Football in America won’t recover from this.”\n\nEarly reports stating Goodes had been shot dead in an “gangland-style execution” in New York City have also been scrubbed from the internet, but not before alert readers captured screenshots of the story.\n\nAccording to Goodes, the NFL have organized a “rigged game” that will earn “maximum revenue” for the league, and hundreds of millions for broadcasters and advertisers, but will leave increasingly jaded Americans with a bad taste in their mouth.\n\n“This is the biggest scam in sports history,” Goodes said in Minneapolis, according to reports. “The Super Bowl is already completely scripted out.”\n\n“How do I know it’s scripted? I’ve read the damn thing.“\n\n“You need to understand the NFL is a $35 billion shared revenue corporation. Outcomes can’t be left to chance. Total league revenues are shared equally by all franchises, so they don’t care who wins or loses. Let me be perfectly clear here. It doesn’t matter to the franchise owners. It doesn’t matter to the players. But it matters to the league. Outcomes have been fixed to maximize profits ever since my early days here.”\n\n“The sad thing is that it’s legal. Can you believe that? It’s legal thanks to guys [entertainment laywers] like me.”\n\nExplaining that the NFL is officially registered as “entertainment,” Goodes said “The NFL has more in common with WWE than you could possibly imagine.”\n\nThe NFL possesses an Anti-Trust Exemption to the law granted to it by President John F. Kennedy, which ultimately allows the NFL to classify itself as “entertainment” rather than sport, as well as incorporate itself as a single entity, instead of the 32 separate “franchises” they would want you to believe.\n\nIn a 2004 lawsuit, the NFL argued they are not a collection of 32 teams in competition with each other. They argued they are a single entity, providing “entertainment” in the marketplace, and as such they are not subject to Anti-Trust laws.\n\nThe only other “sport” that occupies this legal position is the WWE.\n\nHow are games rigged?\n\nAccording to Goodes, the fat cat franchise owners and their pampered players do not care who wins, as long as they continue reaping the lucrative financial benefits provided by the system.\n\n“Have you ever stopped to wonder how Vegas makes the point spread line and over under so close every week? There is not one game where the result totally blows away the point spread or the over under. It doesn’t happen. Are they that good? Hell, no they’re not. Even the best of the best cannot get it so close every single game. So how is it fixed?\n\n“Refs manipulate who wins for the overall benefit of the NFL. The NFL splits its revenue between teams, so do the players care? I’m telling you now, they don’t care. What player would care if they get an extra $5 million when the salary cap goes up thanks to more revenues built on scripted outcomes?”\n\n“The players have an awareness about it and the refs also make penalty calls in key situations to manipulate the score and outcomes.”\n\n“How come zero players call out the refs? How come zero coaches call out the refs, despite the outrageous calls that change the results of games?”\n\n“Everyone is on the same side, that’s why.”\n\n“These NFL refs are part-time employees of the NFL. They sign the tightest contracts you will ever see in your life. They work for the league, period. They are bound by NFL mandated gag orders. They can’t open their mouth and say a single word to the media or their ass is toast.”\n\nWhy doesn’t anyone speak out?\n\nAccording to Goodes, people do speak out. But nobody wants to hear.\n\n“Remember the Harbaugh Bowl? Arthur Blank, the Atlanta Falcons owner, admitted the results were fixed.\n\n“It is predetermined that these two teams would be here, I was my team was selected to be in the Super Bowl.”\n\n“And the NFL admitted it themselves in court. “We are entertainment and we can manage outcomes as we see fit. We’re exempt.”\n\nSuper Bowl LII will be the 52nd Super Bowl and the 48th modern-era NFL championship game, contested between New England Patriots and Philadelphia Eagles at the US Bank Stadium in Minneapolis on Sunday.", "images": ["https://web.archive.org/web/20180202231357im_/http://econewsmedia.org/wp-content/uploads/2017/07/econewsmedia-6.gif", "https://web.archive.org/web/20180202231357im_/http://econewsmedia.org/wp-content/plugins/custom-share-buttons-with-floating-sidebar/images/hide-l.png", "https://web.archive.org/web/20180202231357im_/http://econewsmedia.org/wp-content/uploads/2018/02/NFL-execution-678x381.jpg", "https://web.archive.org/web/20180202231357im_/http://econewsmedia.org/wp-content/plugins/custom-share-buttons-with-floating-sidebar/images/hide.png", "https://web.archive.org/web/20180202231357im_/http://www.beaware.one/wp-content/uploads/2018/01/27479952_10156463941410715_460628881_o.jpg", "https://web.archive.org/web/20180202231357im_/https://pbs.twimg.com/ext_tw_video_thumb/955215557543976960/pu/img/jPlLzqAbqId52RfH?format=jpg&name=small", "https://web.archive.org/web/20180202231357im_/https://pbs.twimg.com/profile_images/910984334202589186/LrIt_0SD_normal.jpg", "https://web.archive.org/web/20180202231357im_/http://www.beaware.one/wp-content/uploads/2018/01/shopsbusinesses-nfl-headquarters.png"], "top_img": "https://web.archive.org/web/20180202231357im_/http://econewsmedia.org/wp-content/uploads/2018/02/NFL-execution-678x381.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180202231357/http://econewsmedia.org/2018/02/01/nfl-lawyer-claimed-super-bowl-rigged-found-dead/", "title": "NFL Lawyer, Who Claimed Super Bowl Is ‘Rigged’, Found Dead", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"locale": "en_US", "type": "article", "title": "NFL Lawyer, Who Claimed Super Bowl Is ‘Rigged’, Found Dead", "description": "An NFL entertainment lawyer, who has worked for the corporation for more than 15 years, has been found dead in", "url": "https://web.archive.org/web/20180202231357/http://econewsmedia.org/2018/02/01/nfl-lawyer-claimed-super-bowl-rigged-found-dead/", "site_name": "Eco News Media", "image": {"identifier": "https://web.archive.org/web/20180202231357im_/http://econewsmedia.org/wp-content/uploads/2018/02/NFL-execution-678x381.jpg", "width": 778, "height": 437}}, "article": {"section": "Eco-Defense", "published_time": "2018-02-01T20:23:31+00:00"}, "twitter": {"card": "summary", "description": "An NFL entertainment lawyer, who has worked for the corporation for more than 15 years, has been found dead in", "title": "NFL Lawyer, Who Claimed Super Bowl Is ‘Rigged’, Found Dead", "image": "https://web.archive.org/web/20180202231357im_/http://econewsmedia.org/wp-content/uploads/2018/02/NFL-execution-678x381.jpg"}, "generator": "WordPress 4.9.2", "msapplication-TileImage": "http://econewsmedia.org/wp-content/uploads/2017/07/econewsmedia-2.gif"}, "movies": [], "publish_date": 1517443200.0, "source": "https://web.archive.org", "summary": ""}