{"url": "https://en.wikipedia.org/wiki/List_of_highest-grossing_films_in_the_United_States_and_Canada#Adjusted_for_ticket-price_inflation", "text": "The following is a list of the highest-grossing films in the United States and Canada, a market known in the film industry as the \"North American box office\",[1][2] and where \"gross\" is defined in US dollars.\n\nNot adjusted for inflation [ edit ]\n\nThis is a list of the highest-grossing films in the U.S. and Canada,[3] a market known in the film industry as the North American box office, or as the domestic box office within the U.S. itself.[1][2] The chart is ranked by lifetime gross, and for comparison, the figures adjusted for the effects of inflation are also listed, using the U.S. consumer price index;[4] a film's earnings from its initial release are also included to provide a basis for comparison between films released around the same time.\n\nBackground shading indicates films playing in the week commencing 7 October 2022 in theaters around the world.\n\n* These films fall outside the top 100 when considering only initial gross, and would be replaced by Inception ($292.58m) and The Twilight Saga: Breaking Dawn – Part 2 ($292.34m).\n\nAdjusted for ticket-price inflation [ edit ]\n\nThis chart ranks films by gross adjusted for ticket price inflation to 2019 levels, based on data from Box Office Mojo. It was compiled by multiplying the average ticket price in the current year by an estimate of the total number of admissions. Where the number of admissions is unknown, they are estimated by dividing the nominal gross by the average ticket price in the year of release to provide an estimate (taking re-releases into account).[5] Admissions better reflect the popularity of older films, since they are less susceptible to the effects of inflation.\n\nMany of the films on this list were released prior to the availability of home video and have had multiple releases.\n\nBackground shading indicates films playing in the week commencing 7 October 2022 in theaters around the world.\n\nFactors in determining \"adjusted gross\" [ edit ]\n\nNo one yet has calculated a truly precise and definite referential adjusted gross for a film,[original research?] since doing so would have to take into account most (or all) of the following:\n\nBox office gross on initial release\n\nrelease Ticket price at time of release, or its relative price to other commodities in a given year, [8] in relation to general inflation and gross domestic product. [9]\n\nin relation to general inflation and gross domestic product. economic conditions that may help or hurt the entertainment industry as a whole (theaters in 2008 lowered ticket prices to attract more viewers though the average ticket cost $7.00) [8]\n\nPopulation at time of release—to be used to calculate:\n\nAvailability of films (number of theaters and screens, number of prints)\n\nCompetition of other media (television, internet, home video, film piracy) [8]\n\nTotal number of films in the marketplace at a given time [8]\n\nScreen quotas (no influence on U.S. box office)\n\nPrice differences: matinee and evening tickets, [10] roadshow tickets, [10] or difference between rural and urban cinemas [9]\n\nroadshow tickets, or difference between rural and urban cinemas Length of release (number of weeks)[10]\n\nFurther explanation of issues with calculating an adjusted gross can be found in the article for List of highest-grossing films.\n\nFranchises and film series not adjusted for inflation [ edit ]\n\nThis is a list of highest-grossing franchises and film series in the U.S. and Canada.[11]\n\nBackground shading indicates that at least one film in the series is playing in the week commencing 7 October 2022 in theaters around the world.\n\nFranchises and film series adjusted for inflation [ edit ]\n\nThis chart was compiled based on data from Box Office Mojo, by dividing the gross by the average ticket price to calculate an estimate of the total number of admissions.\n\nBackground shading indicates that at least one film in the series is playing in the week commencing 7 October 2022 in theaters around the world.\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ Avatar, ticket sales are a combination of the three formats of standard projection, Avatar sold 75 million tickets by April 21, 2010, by which time it had grossed $745 million of its $760 million total.[7] An extra $15 million of sales would be equivalent to about 2 million more ticket sales, at the average 2D ticket price of $7.50 in 2009; using this revision, Avatar probably sold closer to 77,000,000 tickets.[8] The figure of 97,309,600 is an average value based on Box Office Mojo estimating the number of admissions by dividing gross revenue by the cost of an average ticket. However in the case of, ticket sales are a combination of the three formats of standard projection, 3D and IMAX used during its theatrical run. Since box office admissions are not tracked, the total number of admissions cannot therefore be accurately determined simply by dividing the gross receipts by the average ticket price. Box Office Mojo revised estimate - by taking account of the ticket prices for all three different formats - is thatsold 75 million tickets by April 21, 2010, by which time it had grossed $745 million of its $760 million total.An extra $15 million of sales would be equivalent to about 2 million more ticket sales, at the average 2D ticket price of $7.50 in 2009; using this revision,probably sold closer to 77,000,000 tickets.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_highest-grossing_films_in_the_United_States_and_Canada", "title": "List of highest-grossing films in the United States and Canada", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "List of highest-grossing films in the United States and Canada - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}