{"url": "https://www.moviequotesandmore.com/fifty-shades-of-grey-quotes/", "text": "Our list of the best quotes from the Fifty Shades movie trilogy, based on the erotic romance novels by E. L. James. The story centers on literature student Anastasia Steele (Dakota Johnson) who after accepting to do a favor for her sick friend ends up interviewing enigmatic billionaire Christian Grey (Jamie Dornan), after which they soon end up in a strange relationship where Christian introduces Ana to a world of submission.\n\n1. Fifty Shades of Grey (2015) 'Most of your fear is in your head.' - Christian Grey (Fifty Shades of Grey) Click To Tweet\n\nChristian Grey: Business is about people, and I’ve always been good at people. What motivates them, what incentivizes them, what inspires them.\n\nAnastasia Steele: Maybe you’re just lucky.\n\nChristian Grey: I’ve always found that the harder I work, the more luck I seem to have. The key to my success has been in identifying talented individuals and harnessing their efforts.\n\nAnastasia Steele: So you’re a control freak?\n\nChristian Grey: Oh, I exercise control in all things, Miss Steele.\n\nAnastasia Steele: Is that something that you feel passionate about? Feeding the world’s poor?\n\nChristian Grey: It’s smart business. You don’t agree?\n\nAnastasia Steele: I don’t know enough about it. I just wonder if perhaps your heart might be a bit bigger than you want to let on.\n\nChristian Grey: There’s some people that say I don’t have a heart, at all.\n\nAnastasia Steele: Why would they say that?\n\nChristian Grey: Because they know me well.\n\nAnastasia Steele: Are you gay? It’s written here, I’m just…\n\nChristian Grey: No, Anastasia. I’m not gay.\n\nAnastasia Steele: I apologize, Mr. Grey, Kate can be a little…\n\nChristian Grey: Intrusive?\n\nAnastasia Steele: Curious\n\nChristian Grey: Why don’t you ask me something that you want to know?\n\nAnastasia Steele: Earlier you said that there are some people who know you well. Why do I get the feeling that that is not true?\n\nChristian Grey: [moviequotesandmore.com] I would like to know more about you.\n\nAnastasia Steele: There’s really not much to know about me.\n\nChristian Grey: You said you’re an English major? Tell me, was it Charlotte Brontë, Jane Austen, or Thomas Hardy, who first made you fall in love with literature?\n\nAnastasia Steele: Hardy.\n\nChristian Grey: I would’ve guessed Jane Austen.\n\nChristian Grey: We offer an excellent internship program.\n\nAnastasia Steele: I don’t think I’d fit in here. Look at me.\n\nChristian Grey: I am.\n\nKate: So? What was he like?\n\nAnastasia Steele: He was fine.\n\nKate: Fine? Just fine?\n\nAnastasia Steele: He was really polite, and he was courteous, and very formal, and clean.\n\nKate: Clean?\n\nAnastasia Steele: I mean, he was very, you know, smart, and intense. It was kind of intimidating. I can understand the fascination.\n\nKate: You have to admit, he’s ridiculously hot.\n\nAnastasia Steele: I’m sure if you are attracted to that sort of human, then…\n\nKate: The hot type of human?\n\nAnastasia Steele: I asked him if he was gay. That was in your questions. Why would you do that to me?\n\nKate: Because whenever he’s in the society pages, he’s never been photographed with a woman. So, naturally…\n\nAnastasia Steele: Well, maybe he just wants to keep his private life private, Kate.\n\nKate: And now you’re defending him.\n\nAnastasia Steele: I’m terminating this conversation.\n\nKate: Too bad we don’t have some original stills of your hot, clean, twenty-seven year-old billionaire. The camera loves him almost as much as you do.\n\nChristian Grey: [moviequotesandmore.com] I thought it was you.\n\nAnastasia Steele: What the…?\n\nChristian Grey: What a pleasant surprise, Miss Steele.\n\nAnastasia Steele: Just Ana. Just Ana. You’re in here.\n\nChristian Grey: I was in the area on business, needed to pick up a few things. Are you free?\n\nAnastasia Steele: Yeah. What can I help you with?\n\nChristian Grey: Do you stock cable ties?\n\nAnastasia Steele: Cable ties, yes, we do. I can show you, if you want.\n\nChristian Grey: Please, lead the way, Miss Steele.\n\nAnastasia Steele: Just Ana.\n\nAnastasia Steele: Are you redecorating?\n\nChristian Grey: No.\n\nAnastasia Steele: We have two inch, and one inch. But the truly self-respecting handyman will have both in his tool box.\n\nChristian Grey: Of course he will.\n\nAnastasia Steele: It’s rare to find a connoisseur these days. Do you want anything else?\n\nChristian Grey: Yes, rope.\n\nAnastasia Steele: Okay. Rope, tape, cable ties. You’re the complete serial killer.\n\nChristian Grey: Not today.\n\nAnastasia Steele: Anything else?\n\nChristian Grey: What would you recommend?\n\nAnastasia Steele: For a do-it-yourselfer? Maybe coveralls, so you protect your clothes?\n\nChristian Grey: I could just take all my clothes off.\n\nAnastasia Steele: Okay. No clothes. I mean, no coveralls.\n\nKate: [referring to Christian] You do realize that he hasn’t stopped looking at you?\n\nAnastasia Steele: He asked me to go for coffee afterwards.\n\nKate: What?\n\nAnastasia Steele: Kate, shh.\n\nChristian Grey: [moviequotesandmore.com] So is he your boyfriend?\n\nAnastasia Steele: Who?\n\nChristian Grey: The photographer.\n\nAnastasia Steele: [chuckles] Jose? No.\n\nChristian Grey: I saw the way he was smiling at you.\n\nAnastasia Steele: No, Jose is more like family. He’s not my boyfriend.\n\nChristian Grey: And the guy at the store?\n\nAnastasia Steele: [shocked] Paul? No!\n\nChristian Grey: [at the coffee shop] You seem nervous.\n\nAnastasia Steele: I find you intimidating.\n\nChristian Grey: You should. Eat.\n\nAnastasia Steele: Not to mention high-handed.\n\nChristian Grey: I’m used to getting my own way.\n\nAnastasia Steele: That must get very boring.\n\nAnastasia Steele: My mother is on husband number four. She’s an incurable romantic.\n\nChristian Grey: Are you?\n\nAnastasia Steele: Am I a romantic? Well, I study English Lit. So I kind of have to be.\n\nChristian Grey: I’m sorry, I can’t.\n\nAnastasia Steele: What?\n\nChristian Grey: I’ll walk you out.\n\nAnastasia Steele: Do you have a girlfriend, is that it?\n\nChristian Grey: I don’t do the girlfriend thing.\n\nAnastasia Steele: What does that even mean?\n\nChristian Grey: [moviequotesandmore.com] I’m not the man for you. You should steer clear of me. I have to let you go.\n\nAnastasia Steele: [feeling hurt] Goodbye, Mr. Grey.\n\nChristian Grey: [answers phone] Anastasia?\n\nAnastasia Steele: Yeah, this is me. I’m sending back your expensive books, because I already have copies of those. Thanks though, for the kind gesture.\n\nChristian Grey: You’re welcome. Where are you?\n\nAnastasia Steele: Oh, I’m in line, because I have to pee really bad.\n\nChristian Grey: Anastasia, have you been drinking?\n\nAnastasia Steele: [chuckles] Yeah, I have, Mr. Fancy Pants. You hit the hail on the nead. I mean the head right on the nail.\n\nChristian Grey: Listen to me. I want you to go home right now.\n\nAnastasia Steele: You’re so bossy! “Ana, let’s go for coffee. Ana, let’s go for coffee. No, stay away from me, Ana. I don’t want you. Get away. Come here. Come here. Go away.”\n\nChristian Grey: That’s it. Tell me where you are.\n\nAnastasia Steele: A long way from Seattle. Long way from you.\n\nChristian Grey: Which bar? What’s it called?\n\nAnastasia Steele: I don’t know. I got to go though.\n\nChristian Grey: Which bar, Ana?\n\nAnastasia Steele: [ends the call, to the girl in line] I told him. Right?\n\nJose: Look, please, one kiss.\n\nAnastasia Steele: No. No, no, no. Jose, I don’t, I’m sorry, no.\n\nChristian Grey: [pushes Jose] Dude, she said no!\n\nAnastasia Steele: Christian?\n\n[Ana suddenly vomits and Christian holds back her hair]\n\nChristian Grey: Good morning, Anastasia. How are you feeling?\n\nAnastasia Steele: Better than I deserve. Did you put me to bed?\n\nChristian Grey: Mm-hmm.\n\nAnastasia Steele: You undressed me?\n\nChristian Grey: I didn’t have much choice.\n\nAnastasia Steele: Where did you sleep?\n\nAnastasia Steele: [Christian points to the space next] Oh, my God. Did we…? We didn’t…?\n\nChristian Grey: Necrophilia is not my thing.\n\nAnastasia Steele: So we just slept then?\n\nChristian Grey: It was a novelty for me too.\n\nAnastasia Steele: [moviequotesandmore.com] Why am I here, Christian?\n\nChristian Grey: You’re here because I’m incapable of leaving you alone.\n\nAnastasia Steele: Then don’t.\n\nChristian Grey: Listen to me. I don’t do romance. My tastes are very singular. You wouldn’t understand.\n\nAnastasia Steele: Enlighten me then.\n\nChristian Grey: [Ana bites her lip] I’d like to bite that lip.\n\nAnastasia Steele: I think I’d like that too.\n\nChristian Grey: I’m not going to touch you. Not until I have your written consent.\n\nAnastasia Steele: What?\n\nChristian Grey: I’ll explain later.\n\nChristian Grey: [he sees Ana bite her lip again] F*** the paperwork.\n\n[he kisses her]\n\nChristian Grey: [after he’s kissed Ana] What is it about elevators?\n\n2. Fifty Shades Darker (2017)\n\nCarla: [referring to Christian] Sweetheart, are you ever going to tell me what happened between you?\n\nAnastasia Steele: Fundamental differences, I guess. It wasn’t going to last.\n\nAnastasia Steele: [referring to Jose’s photos of her] It was you, wasn’t it? You just went and bought all of these?\n\nChristian Grey: I don’t like strangers gawking at you.\n\nAnastasia Steele: Why are you here?\n\nChristian Grey: For you.\n\nChristian Grey: Can we talk somewhere private?\n\nAnastasia Steele: No.\n\nChristian Grey: Look, I’m not very good at this. I’ve never had… I’ve never wanted to try again.\n\nAnastasia Steele: Christian, I don’t. It’s not a good idea.\n\nChristian Grey: Let’s talk. Okay? Just talk, please. Have dinner with me.\n\nAnastasia Steele: Okay, fine. I will have dinner with you. Because I’m hungry. But we are only talking, and that is it.\n\nChristian Grey: [moviequotesandmore.com] I want you back. I’d like to renegotiate terms.\n\nAnastasia Steele: But I don’t see how. The things you want, you said that’s the way you are.\n\nChristian Grey: But what happened last time, that’s not going to happen again.\n\nAnastasia Steele: How can you say that?\n\nAnastasia Steele: I know that I asked you to show me how far it can go, but you were getting off on the pain you inflicted. That’s still in you.\n\nChristian Grey: I’m working on it.\n\nAnastasia Steele: Working on what? I can’t do this if you won’t talk to me.\n\nChristian Grey: What do you want to know?\n\nAnastasia Steele: Everything.\n\nAnastasia Steele: [referring to his birth mother] Why didn’t you tell me that?\n\nChristian Grey: I did. But you were asleep at the time.\n\nAnastasia Steele: Okay. Well, generally, a key part of good communication is that both parties be conscious.\n\nChristian Grey: [moviequotesandmore.com] Now, I brought you here to negotiate.\n\nAnastasia Steele: You’re open to new terms?\n\nChristian Grey: No rules. No punishments.\n\nAnastasia Steele: No rules. No punishments. And no more secrets.\n\nChristian Grey: I can do that.\n\nAnastasia Steele: You want a, what do you call it? A vanilla relationship?\n\nChristian Grey: I mean, we only do what you’re comfortable with.\n\nAnastasia Steele: But you need all those things.\n\nChristian Grey: I need you more.\n\n3. Fifty Shades Freed (2018)\n\nChristian Grey: Anastasia, I vow to love you faithfully, forsaking all others. I promise to love, to trust, and to respect you. To comfort you in times of need and keep you safe. All that I have is now yours. I give you my hand and my heart for as long as we both shall live.\n\nAnastasia Steele: Christian, I vow to be your faithful partner in sickness and in health. I promise to love you unconditionally, to honor and respect you, to bring you solace in times of need. I promise to cherish you, as long as we both shall live.\n\nChristian Grey: [moviequotesandmore.com] Mrs. Grey?\n\nAnastasia Steele: That’s me.\n\nChristian Grey: Yeah. You. Let’s get out of here. I’m sick of sharing you with the riffraff.\n\nAnastasia Steele: [referring to the private jet] You own this?\n\nChristian Grey: We own this.\n\nAnastasia Steele: [referring to going topless at the beach] Christian, look around. There’s nothing but boobs for as far as the eye can see. It’s boobs in Boobland. Nobody cares about mine.\n\nChristian Grey: They will when they’re on the cover of some sleazy tabloid.\n\nChristian Grey: [moviequotesandmore.com] You insist on defying me, Mrs. Grey. What should I do about that?\n\nAnastasia Steele: Learn to live with it.\n\nChristian Grey: It’s not my style.\n\nChristian Grey: Do you love me?\n\nAnastasia Steele: You know I love you.\n\nChristian Grey: Then why do you defy me?\n\nAnastasia Steele: Because I can.\n\nAnastasia Steele: I should misbehave more often.\n\nChristian Grey: Yeah, maybe you should.\n\nAnastasia Steele: [referring to causing Christian’s helicopter crash] You think Jack did that too? Why would he be going to these lengths?\n\nChristian Grey: I don’t know. But don’t worry. I swore I’d keep you safe, and I will.\n\n\n\n\n\n", "images": ["https://www.moviequotesandmore.com/wp-content/uploads/fifty-shades-darker.jpg", "https://www.moviequotesandmore.com/wp-content/uploads/MQM-Logo-2.png", "https://www.moviequotesandmore.com/wp-content/uploads/fifty-shades-freed.jpg", "https://www.moviequotesandmore.com/wp-content/uploads/movie-remakes-300x200.jpg", "https://www.moviequotesandmore.com/wp-content/uploads/fifty-shades-of-grey-2.jpg", "https://www.moviequotesandmore.com/wp-content/uploads/fifty-shades-movies.jpg"], "top_img": "https://www.moviequotesandmore.com/wp-content/uploads/fifty-shades-movies.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.moviequotesandmore.com/fifty-shades-movies-quotes/", "title": "Best Quotes from Fifty Shades Movies", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-image-preview:large", "norton-safeweb-site-verification": "g8v1e9s-s0onzwsrmg5ce1qxoxq66hd-8pz0gji0xypequbl908ypqh593ihlqhn4dof8odwuzx5d6jhw68xmpj5fyp8dbz96q5iztbgur03qn5r73lxag-u6y8i2bjk", "msapplication-TileImage": "https://www.moviequotesandmore.com/wp-content/uploads/cropped-favicon-2-270x270.png", "og": {"locale": "en_US", "site_name": "MovieQuotesandMore", "title": "Best Quotes from Fifty Shades Movies", "url": "https://www.moviequotesandmore.com/fifty-shades-movies-quotes/", "type": "article", "description": "Our list of the best quotes from the Fifty Shades movie trilogy, based on the erotic romance novels...", "image": {"identifier": "https://www.moviequotesandmore.com/wp-content/uploads/fifty-shades-movies.jpg", "url": "https://www.moviequotesandmore.com/wp-content/uploads/fifty-shades-movies.jpg", "secure_url": "https://www.moviequotesandmore.com/wp-content/uploads/fifty-shades-movies.jpg"}}, "article": {"publisher": "https://www.facebook.com/moviequotesandmore"}, "twitter": {"title": "Best Quotes from Fifty Shades Movies", "url": "https://www.moviequotesandmore.com/fifty-shades-movies-quotes/", "description": "Our list of the best quotes from the Fifty Shades movie trilogy, based on the erotic romance novels...", "image": "https://www.moviequotesandmore.com/wp-content/uploads/fifty-shades-movies.jpg", "card": "summary_large_image", "site": "@MovieQuotesMore"}}, "movies": [], "publish_date": null, "source": "https://www.moviequotesandmore.com", "summary": ""}