{"url": "https://hollywoodlife.com/2018/03/25/the-arrangement-megan-terence-past-season-2-episode-3-recap/", "text": "Megan is staying busy with her sessions with Terence this week on The Arrangement. He really wants to dig deep into her feelings and accelerate their work. He knows that Megan is bullish*tting him. “There’s something else at the core of your stress,” Terence says. That’s an understatement. The first table read for Technicolor Highway has arrived, and Kyle is so excited. While reading, Xavier gets really into it, but Megan holds back. Afterwards, Shaun notices an angry Terence on the phone. She confronts him about it, but he acts like everything is all good.\n\nKyle tells Terence to not rattle Megan during their sessions. She needs to be on point. At their next session, Terence and Megan look at her audition tape. He thinks she’s not being completely honest about what she’s afraid of. “Something is still triggering you,” Terence says. This fear is manifesting in the form of stomach pain. Finally, Megan breaks. When he asks again, Megan confesses, “YOU.” Terence controls every aspect of her life. “I live in this constant fear of disappointing you,” she admits. She’s afraid of losing everything at the hands of a man that she doesn’t know at all.\n\nTerence takes her out to a diner so they can get to know each other. Terence reveals the strangest thing about his childhood — that he used to eat butter with his french fries. When his mom found him eating that, she punished him by making him eat WHOLE STICKS OF BUTTER. Child abuse comes in many different forms.\n\nMegan doesn’t shy away from the tough questions. She asks him point-blank if it bothers him from being in the shadows his whole life. Terence says he embraces that and loves helping people reach their true potential. He admits that watching Kyle’s rise to fame has been the greatest joy of his life. “He’s like a son to me,” Terence says. Megan asks Terence about kids, and Terence says it wasn’t a good fit for him and DeAnn. When Megan questions him about his dad, Terence starts to get suspicious. Megan plays Terence at his own game. She asks him to tell her his greatest fear. He confesses his brush with death. Powerlessness is his greatest fear, and that’s been his greatest fear since childhood. Megan has managed to expose Terence and wants to take advantage of the situation, but Shaun thinks she should hold back for a bit.\n\nDuring dinner, Mason breaks it to DeAnn that she has to go back to Napa. DeAnn doesn’t want her to leave yet. She’s openly pissed that Mason is running again. This is just the same dance they’ve been doing for decades. After seeing an intimate moment with Shaun and Terence, DeAnn calls Mason and says she wants more.\n\nMeanwhile, Kyle is working hard with Xavier, who is getting frustrated with not knowing his lines. Kyle gets Xavier to open up about being bullied as a kid. Xavier gets his rage all bottled up, but Kyle wants him to tap into that rage.\n\nAt lunch with Xavier and Naseem, Kyle brings up Megan’s mom, and she’s not happy about it. Her dead mom is off limits. She believes Kyle was testing her. Kyle confronts her about being distracted, which Megan doesn’t take well. “You’re afraid I’m going to suck,” Megan tells Kyle. He brings up that she barely performed at the table read and she’s never carried a film before. There’s a lot on the line with this movie. Not just with Megan, but with Kyle. Megan and Kyle continue to fight, and she blasts him for projecting his fear of failure onto her. Thankfully, they makeup the next day. Kyle stresses that he does trust her. But does she trust him? That’s the real question.\n\nKyle admits to Xavier that he has rage issues, too. The boys run into a group of guys who start taunting Kyle. Xavier throws a punch, and Kyle finds himself in the middle of the action.\n\nMegan continues trying to break Terence down, but Terence tries to turn the tables and regain control. Terence tells Megan that her fear of him is just a projection for her fear of her father, who abandoned her when she was a baby. Everyone in her life abandoned her. She’s so angry and has been holding it in her entire life. Terence notes that it’s going to keep eating her up from the inside until she does something about it. Terence and Megan are a lot alike. They come from similar backgrounds, and both of them are going to take advantage of their vulnerabilities.\n\nOn the first day of production, Megan doesn’t get off to the best start. But when she’s on, she’s really on. After wrapping the first day, Terence gives Megan information about her father. Their work together is done, but her work with her father is just beginning.\n\nThe episode ends with Terence telling DeAnn that he wants to reopen the conversation about becoming parents. DeAnn doesn’t seem exactly thrilled about the idea. But she’s distracted. She keeps calling Mason, and when she finally gets a hold of Mason’s son, she gets devastating news.", "images": ["https://hollywoodlife.com/wp-content/uploads/2022/09/heather-locklear-overalls-mega-ftr.jpg?w=620", "https://hollywoodlife.com/wp-content/uploads/2022/09/britney-spears-bikini-beach-ss-ftr1.jpg?w=620", "https://www.blogher.com/wp-content/uploads/2022/10/Creative-Corner-Article-Graphic-2.png?w=230&crop=1", "https://hollywoodlife.com/wp-content/uploads/2018/03/the-royals-the-arrangement-recap-2-ftr.jpg", "https://stylecaster.com/wp-content/uploads/2022/09/tom-brady-gisele-bundchen-3.jpg?w=230&crop=1", "https://www.sheknows.com/wp-content/uploads/2022/10/maybelline-sky-high-2.jpg?w=230&crop=1", "https://hollywoodlife.com/wp-content/uploads/2022/09/Shania-Twain-Oprah-Disagreed-Sour-SS-ftr-1.jpg?w=620", "https://soaps.sheknows.com/wp-content/uploads/2022/01/Carly-bobbie-memorial-abc.jpeg?fit=1230%2C714&w=230&crop=1"], "top_img": "https://hollywoodlife.com/wp-content/uploads/2018/03/the-royals-the-arrangement-recap-2-ftr.jpg", "keywords": [], "authors": ["Avery Thompson", "Delilah Gray", "Lea Veloso", "Kelly-Jo Potts", "Amy Mistretta", "Richard Simms"], "canonical_link": "https://hollywoodlife.com/2018/03/25/the-arrangement-megan-terence-past-season-2-episode-3-recap/", "title": "‘The Arrangement’ Recap: Megan & Terence Go Head-To-Head In A Battle To Expose The Other", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Megan and Terence talk about their pasts during the March 25 episode of 'The Arrangement' Read our recap now!", "news_keywords": "The Arrangement", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=1400650284", "generator": "WordPress 6.0.2", "fb": {"pages": 94724837471}, "author": "Avery Thompson", "og": {"type": "article", "title": "‘The Arrangement’ Recap: Megan & Terence Go Head-To-Head In A Battle To Expose The Other", "url": "https://hollywoodlife.com/2018/03/25/the-arrangement-megan-terence-past-season-2-episode-3-recap/", "description": "Megan and Terence go toe-to-toe during their sessions, and Megan learns A LOT about Terence’s past on the March 25 of ‘The Arrangement.’ Here’s a recap of what went down!", "site_name": "Hollywood Life", "image": {"identifier": "https://hollywoodlife.com/wp-content/uploads/2018/03/the-royals-the-arrangement-recap-2-ftr.jpg", "width": 620, "height": 350, "alt": "Christine Evangelista"}, "locale": "en_US"}, "article": {"published_time": "2018-03-26T02:00:43+00:00", "modified_time": "2018-03-26T02:00:44+00:00"}, "twitter": {"site": "@HollywoodLife", "creator": "@https://twitter.com/avery__thompson", "card": "summary_large_image", "title": "‘The Arrangement’ Recap: Megan & Terence Go Head-To-Head In A Battle To Expose The Other", "description": "Megan and Terence talk about their pasts during the March 25 episode of 'The Arrangement' Read our recap now!", "image": "https://hollywoodlife.com/wp-content/uploads/2018/03/the-royals-the-arrangement-recap-2-ftr.jpg?w=620"}, "msapplication-TileImage": "https://hollywoodlife.com/wp-content/uploads/2018/06/hl_logo.png?w=128"}, "movies": [], "publish_date": 1521936000.0, "source": "https://hollywoodlife.com", "summary": ""}