{"url": "https://www.hollywoodreporter.com/live-feed/fox-tv-heads-losing-american-idol-abc-s-a-tough-one-1003652", "text": "Mere hours before the media buying community floods into the Beacon Theatre for Fox’s annual upfront presentation, Fox TV Group chairmen Dana Walden and Gary Newman addressed what’s coming — and just as poignantly, what isn’t — from the network during a morning call with reporters.\n\nAlthough the pair kicked off the half-hour with a nod to the network’s prior season standouts (Lethal Weapon, The Mick) and the forthcoming projects that seem to have them most excited (Marvel’s The Gifted, buddy paranormal comedy Ghosted), the project that got the most airtime was one that will not be airing on Fox next year. That series, of course, is American Idol, which will move from Fox to ABC for the 2017-18 season.\n\nRather than suggest that she was comfortable with the network switch, however, Walden was refreshingly candid about how challenging it is to see a show that was so meaningful to Fox for 15 years move to a rival. “It’s obviously a tough one for us,” she began. “It feels bad knowing it’s coming back on another network.”\n\nWalden was similarly open about her frustration with Idol producers Fremantle, with whom Fox had been having conversations since the music competition wrapped in spring 2016. At issue: Fox had invested a tremendous amount of equity and resources promoting and celebrating the show’s final season. “We spent $25 million sending the message that it was the farewell season and fans responded,” she said. And though it did see a ratings uptick, Walden and her team felt it would be deceitful, even, as she put it, “extremely fraudulent,” to turn around and immediately go back into production with the show. Fremantle felt differently.\n\nIn Walden’s mind, waiting until 2020 would be a more respectful amount of time to have Idol sit on the bench. “We did not see the fan excitement and enthusiasm for the show to come back [sooner],” she added, suggesting Fremantle had a different set of facts. The latter, for whom Idol is a significant revenue generator, was driven from the day it wrapped to see it return as soon as possible.\n\nBut timing was not the only point of contention between Fox and the show’s producers. Among the others: the series’ price tag, which had ballooned in later seasons thanks to judge and host salaries in the eight-figure range. Those coupled with declining ratings — the show was down nearly 70 percent in its last half-decade on the air — prompted Fox to ask Fremantle to make cuts before the series had wrapped on Fox.\n\n“The network was losing an enormous amount of money and we asked them to make trims,” explained Walden, adding that Fremantle had little interest in such trims, which would entail tweaking the show or the panel of star wattage that took years to get just right. “Fremantle doesn’t want to change that show and perhaps they shouldn’t,” she added, lingering frustration apparent in her voice. Despite it all, Fox continued to make offers for the show, if for no other reason than Walden and her team didn’t want to see a show so closely connected with their brand land elsewhere.\n\nEarlier on in what she called a “challenging process,” Walden believed it was NBC that Fox would be competing against, and she acknowledged that at least that made sense to her. NBC has both Simon Cowell, whom she believed the franchise missed in its later iterations, and Jennifer Lopez based at its network, which would be helpful in a reboot. Alas, conversations with NBC broke down and Fremantle had little interest in Fox’s offer, so the show that famously catapulted Walden’s network to No. 1 will now air on ABC.\n\nOn what was left of the call, Walden and Newman fielded a handful of other questions, including those about the fate of Scream Queens, 24: Legacy and Prison Break. The only one for which they’d put a nail in the coffin: Scream Queens, acknowledging that this past season was the Ryan Murphy’s anthology’s last . They suggested they’d reassess the future of 24 when they returned to Los Angeles post-upfront, saying that the delay on any decision was largely due to star Corey Hawkins’ time on Broadway and producer Howard Gordon’s quasi-sabbatical in Spain. As for the future of Prison Break, they have no intention of having that property return every year, but the producers are considering future ideas and, yes, their network would surely be open to more.\n\nHannah meets history teacher Fran when she starts substitute teaching at St. Justine’s School. After chatting with her about what he’s teaching, he asks her out and she goes on a date that turns awkward when she drags him to Mimi-Rose Howard’s art show, it seems, to parade him around in front of Adam.\n\n“]", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2016/03/gettyimages-514707602.jpg?w=2000&h=1126&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2016/03/gettyimages-514707602.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2016/03/gettyimages-514707602.jpg?w=1024", "keywords": [], "authors": ["Lacey Rose"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/fox-tv-heads-losing-american-idol-abc-s-a-tough-one-1003652/", "title": "Fox TV Heads on Losing ‘American Idol’ to ABC: “It’s Obviously a Tough One”", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Dana Walden and Gary Newman also addressed the fates of \"Scream Queens,\" \"24\" and \"Prison Break\".", "news_keywords": "American Idol, Dana Walden, Gary Newman, Upfronts", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lacey Rose", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1003652, "title": "Fox TV Heads on Losing 'American Idol' to ABC: \"It’s Obviously a Tough One\"", "published_at": "2017-05-15 06:50:45", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/03/gettyimages-514707602.jpg?w=1024", "comment_count": 0, "tags": "Upfronts", "topics": "TV News", "body": "Mere hours before the media buying community floods into the Beacon Theatre for Fox's annual upfront presentation, Fox TV Group chairmen Dana Walden and Gary Newman addressed what's coming — and just as poignantly, what isn’t — from the network during a morning call with reporters.\r\n\r\nAlthough the pair kicked off the half-hour with a nod to the network’s prior season standouts (Lethal Weapon, The Mick) and the forthcoming projects that seem to have them most excited (Marvel’s The Gifted, buddy paranormal comedy Ghosted), the project that got the most airtime was one that will not be airing on Fox next year. That series, of course, is American Idol, which will move from Fox to ABC for the 2017-18 season.\r\nRather than suggest that she was comfortable with the network switch, however, Walden was refreshingly candid about how challenging it is to see a show that was so meaningful to Fox for 15 years move to a rival. “It’s obviously a tough one for us,” she began. “It feels bad knowing it’s coming back on another network.”\r\nWalden was similarly open about her frustration with Idol producers Fremantle, with whom Fox had been having conversations since the music competition wrapped in spring 2016. At issue: Fox had invested a tremendous amount of equity and resources promoting and celebrating the show’s final season. \"We spent $25 million sending the message that it was the farewell season and fans responded,\" she said. And though it did see a ratings uptick, Walden and her team felt it would be deceitful, even, as she put it, “extremely fraudulent,” to turn around and immediately go back into production with the show. Fremantle felt differently.\r\n\r\nIn Walden’s mind, waiting until 2020 would be a more respectful amount of time to have Idol sit on the bench. “We did not see the fan excitement and enthusiasm for the show to come back [sooner],” she added, suggesting Fremantle had a different set of facts. The latter, for whom Idol is a significant revenue generator, was driven from the day it wrapped to see it return as soon as possible.\r\nBut timing was not the only point of contention between Fox and the show’s producers. Among the others: the series’ price tag, which had ballooned in later seasons thanks to judge and host salaries in the eight-figure range. Those coupled with declining ratings — the show was down nearly 70 percent in its last half-decade on the air — prompted Fox to ask Fremantle to make cuts before the series had wrapped on Fox.\r\n“The network was losing an enormous amount of money and we asked them to make trims,” explained Walden, adding that Fremantle had little interest in such trims, which would entail tweaking the show or the panel of star wattage that took years to get just right. “Fremantle doesn’t want to change that show and perhaps they shouldn’t,” she added, lingering frustration apparent in her voice. Despite it all, Fox continued to make offers for the show, if for no other reason than Walden and her team didn’t want to see a show so closely connected with their brand land elsewhere.\r\n\r\nEarlier on in what she called a “challenging process,” Walden believed it was NBC that Fox would be competing against, and she acknowledged that at least that made sense to her. NBC has both Simon Cowell, whom she believed the franchise missed in its later iterations, and Jennifer Lopez based at its network, which would be helpful in a reboot. Alas, conversations with NBC broke down and Fremantle had little interest in Fox’s offer, so the show that famously catapulted Walden's network to No. 1 will now air on ABC. \r\n\r\n\tOn what was left of the call, Walden and Newman fielded a handful of other questions, including those about the fate of Scream Queens, 24: Legacy and Prison Break. The only one for which they'd put a nail in the coffin: Scream Queens, acknowledging that this past season was the Ryan Murphy's anthology's last. They suggested they'd reassess the future of 24 when they returned to Los Angeles post-upfront, saying that the delay on any decision was largely due to star Corey Hawkins' time on Broadway and producer Howard Gordon's quasi-sabbatical in Spain. As for the future of Prison Break, they have no intention of having that property return every year, but the producers are considering future ideas and, yes, their network would surely be open to more.\r\n Hannah meets history teacher Fran when she starts substitute teaching at St. Justine's School. After chatting with her about what he's teaching, he asks her out and she goes on a date that turns awkward when she drags him to Mimi-Rose Howard's art show, it seems, to parade him around in front of Adam.\r\n\"]", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Fox TV Heads on Losing ‘American Idol’ to ABC: “It’s Obviously a Tough One”", "url": "https://www.hollywoodreporter.com/tv/tv-news/fox-tv-heads-losing-american-idol-abc-s-a-tough-one-1003652/", "description": "Dana Walden and Gary Newman also addressed the fates of “Scream Queens,” “24” and “Prison Break”.", "site_name": "The Hollywood Reporter", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/03/gettyimages-514707602.jpg?w=1024", "locale": "en_US"}, "article": {"published_time": "2017-05-15T06:50:45+00:00", "modified_time": "2017-05-15T08:26:45+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Fox TV Heads on Losing ‘American Idol’ to ABC: “It’s Obviously a Tough One”", "description": "Dana Walden and Gary Newman also addressed the fates of “Scream Queens,” “24” and “Prison Break”.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/03/gettyimages-514707602.jpg?w=3000"}}, "movies": [], "publish_date": 1494831045.0, "source": "https://www.hollywoodreporter.com", "summary": ""}