{"url": "www.hollywoodreporter.com/news/alexis-bledel-blake-lively-talk-sisterhood-traveling-pants-3-1106417", "text": "Jimmy Fallon has made it clear in the past that he’s a big fan of Gilmore Girls. But on Thursday’s Tonight Show, he revealed to Alexis Bledel that he is also a fan of one of her other projects.\n\n“[The Sisterhood of the Traveling Pants] is my jam,” Fallon said. “I love you. I love that movie. I love everyone in it.”\n\nBledel agreed that she loves it, too. When asked if there will be a third film in the franchise — one believed to have long been in the works — she said, “I really hope so. I would love it. It would be the best thing.”\n\nThe actress, who is currently starring on Hulu’s second season of The Handmaid’s Tale, then surprised Fallon. “We just pitched a third movie and I hope it comes together,” she revealed. After the audience enthusiastically cheered, Fallon told Bledel that she has to get the movie made. She responded, “I would love it.”\n\nAt nearly the same time, her co-star Blake Lively was also answering questions about a potential third film. “I think that people who love the movie want to see it. Fans have gotten bigger movies made. Deadpool is all thanks to the fans. So I’m saying we’ll do it,” she told Entertainment Tonight while at CinemaCon, referencing husband Ryan Reynolds’ movie franchise.\n\nThe Sisterhood of the Traveling Pants was released in 2005 and was followed by a sequel in 2008. Along with Bledel and Lively, the films also co-star America Ferrera and Amber Tamblyn. The four play childhood best friends that spend the summers apart, but who keep in touch by exchanging a pair of jeans that magically fit all four of them.\n\nThe actresses are also known to be longtime friends off-camera. “We don’t get to see each other a lot because everybody’s work and family and everything, but when everybody’s in town, we do,” Bledel told Fallon when asked about their relationships.\n\nEarlier this year, Tamblyn shared a photo on Instagram of the foursome reuniting that came with a nod to the Time’s Up movement.\n\nDidn’t think anything could beat kicking off the new year with the #TIMESUP initiative, but then… pic.twitter.com/WLbtL6f8qV — Amber Tamblyn (@ambertamblyn) January 2, 2018\n\nWatch the Tonight Show clip above.", "images": ["https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/app/icons/icon-512x512.png", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/app/icons/icon-512x512.png", "keywords": [], "authors": ["Katherine Schaffstall"], "canonical_link": "https://www.hollywoodreporter.com/movies/movie-news/alexis-bledel-blake-lively-talk-sisterhood-traveling-pants-3-1106417/", "title": "Alexis Bledel Lends Hope to Third ‘Sisterhood of the Traveling Pants’ Movie", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "“We just pitched a third movie and I hope it comes together,” Alexis Bledel shared of 'Sisterhood of the Traveling Pants 3' on 'The Tonight Show.'", "news_keywords": "Alexis Bledel, Blake Lively", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Katherine Schaffstall", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1106417, "title": "Alexis Bledel Lends Hope to Third 'Sisterhood of the Traveling Pants' Movie", "published_at": "2018-04-27 10:57:11", "comment_count": 0, "tags": "Blake Lively", "topics": "Movies", "body": "Jimmy Fallon has made it clear in the past that he’s a big fan of Gilmore Girls. But on Thursday’s Tonight Show, he revealed to Alexis Bledel that he is also a fan of one of her other projects.\r\n\"[The Sisterhood of the Traveling Pants] is my jam,” Fallon said. “I love you. I love that movie. I love everyone in it.”\r\nBledel agreed that she loves it, too. When asked if there will be a third film in the franchise — one believed to have long been in the works — she said, “I really hope so. I would love it. It would be the best thing.”\r\nThe actress, who is currently starring on Hulu's second season of The Handmaid’s Tale, then surprised Fallon. “We just pitched a third movie and I hope it comes together,” she revealed. After the audience enthusiastically cheered, Fallon told Bledel that she has to get the movie made. She responded, “I would love it.”\r\nAt nearly the same time, her co-star Blake Lively was also answering questions about a potential third film. \"I think that people who love the movie want to see it. Fans have gotten bigger movies made. Deadpool is all thanks to the fans. So I'm saying we'll do it,\" she told Entertainment Tonight while at CinemaCon, referencing husband Ryan Reynolds' movie franchise.\r\nThe Sisterhood of the Traveling Pants was released in 2005 and was followed by a sequel in 2008. Along with Bledel and Lively, the films also co-star America Ferrera and Amber Tamblyn. The four play childhood best friends that spend the summers apart, but who keep in touch by exchanging a pair of jeans that magically fit all four of them.\r\nThe actresses are also known to be longtime friends off-camera. “We don’t get to see each other a lot because everybody’s work and family and everything, but when everybody’s in town, we do,” Bledel told Fallon when asked about their relationships.\r\nEarlier this year, Tamblyn shared a photo on Instagram of the foursome reuniting that came with a nod to the Time's Up movement.\r\n\r\n\tDidn’t think anything could beat kicking off the new year with the #TIMESUP initiative, but then... pic.twitter.com/WLbtL6f8qV\r\n\t— Amber Tamblyn (@ambertamblyn) January 2, 2018\r\nWatch the Tonight Show clip above.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Alexis Bledel Lends Hope to Third ‘Sisterhood of the Traveling Pants’ Movie", "url": "https://www.hollywoodreporter.com/movies/movie-news/alexis-bledel-blake-lively-talk-sisterhood-traveling-pants-3-1106417/", "description": "“We just pitched a third movie and I hope it comes together,” Alexis Bledel shared of ‘Sisterhood of the Traveling Pants 3’ on ‘The Tonight Show.’", "site_name": "The Hollywood Reporter", "image": "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/app/icons/icon-512x512.png", "locale": "en_US"}, "article": {"published_time": "2018-04-27T10:57:11+00:00", "modified_time": "2018-04-27T11:31:12+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Alexis Bledel Lends Hope to Third ‘Sisterhood of the Traveling Pants’ Movie", "description": "“We just pitched a third movie and I hope it comes together,” Alexis Bledel shared of ‘Sisterhood of the Traveling Pants 3’ on ‘The Tonight Show.’"}}, "movies": [], "publish_date": 1524826631.0, "source": "http://www.hollywoodreporter.com", "summary": ""}