{"url": "https://www.hollywoodreporter.com/live-feed/switched-at-birth-series-finale-explained-992983", "text": "[Warning: This story contains spoilers for Tuesday’s series finale of Switched at Birth, “Long Live Love.”]\n\nSwitched at Birth ended its five-season run on Tuesday with an eventful 90-minute farewell.\n\nThe final episode of the Peabody-winning family drama ended things by looking back at how the series started. It contained several flashbacks to when everyone in the Kennish and Vasquez families — well, almost everyone — found out that Bay (Vanessa Marano) and Daphne (Katie Leclerc) had been switched at birth. At first, the flashbacks happened because Kathryn (Lea Thompson) was feeling nostalgic about Regina (Constance Marie) deciding to move out of the guesthouse. Then, it was because Kathryn learned John (D.W. Moffett) had known about the switch before she did — a fight that escalated and de-escalated quickly.\n\nMeanwhile, Daphne stood up to a discriminatory sports surgeon who said she couldn’t be a surgeon and be deaf. (And she reunited with Mingo.) And despite Travis (Ryan Lane) moving to Japan to pursue a career in baseball, he and Bay decided to continue their relationship long-distance — permanently squashing any chance of her getting back together with Emmett (Sean Berdy).\n\nRegina also figured out her romantic future. In exchange for making Will turn himself in, she offered to raise his son and wait until he got out of prison so they could start their life together in Kansas City, Kan. And finally, Toby (Lucas Grabeel) decided to ditch his unfulfilling DJ gigs for some sort of job helping those with disabilities.\n\nAfter an extended break between seasons four and five —during which time ABC Family became Freeform — and a shortened final season, the final episode was largely one of resolutions, rather than cliff-hangers.\n\nThe Hollywood Reporter spoke with Lizzy Weiss about those finale twists and turns, the scrapped ending viewers didn’t see and the possibility of a revival down the road.\n\nYou mentioned there was a tag you shot at the end of season four that could have served as a series finale. Can you talk a little bit about what it was and why you decided not to use it?\n\nIt would have felt like a double ending. I feel like the emotion of the ending with the big wide aerial shot pulling back on the family and that song … the emotions sort of carried you, and then once we tried putting the tag on it, it stopped the emotions. And plus, it was a flashback to the hospital with the girls as newborns, and we cast 22-year-old actresses to play young Kathryn and young Regina, and it felt like a disappointment to not end on the people that the fans have spent five years with. I hope the network does release it for the fans just in a tweet or a YouTube link because it was cool, but it was something that we didn’t end up using.\n\nAnother big revelation was that John found out about the switch before Kathryn. Had that always been a part of the story for you? How did this twist come about?\n\nTo be totally honest, no. When I pitched the show, I was very clear that I planned out that Regina knew and all of the reasons why, and when she found out when Daphne was 3 and that she kept it secret, so that was kind of baked into the first season. In preparing for the series finale, we watched the pilot again, and we zoned in on that scene in the geneticist’s office, where Bay and Kathryn looked crushed and stunned and as if their worlds have just fallen apart. It was honestly just a choice that D.W. made for John to be the stoic father, but we just zoomed in and thought, ‘Gosh, it almost looks like he’s not surprised.’ So just in the fun of the room, we spun off that: We can’t mess with the mythology of Regina. We can’t undo the whole show in one last episode, but what if he knew a week before or two weeks before?\n\nThe real intention of the John-Kathryn story — no matter what story we told, I knew that the end result would be, we are revalidating them as the heart and the center of the show in terms of the family, the strength that is the Kennish home. So we needed to shake them a little and then remind everyone they will keep getting through whatever is thrown at them. It just seemed fun to have.\n\nAnother big moment in the finale was Daphne having to deal with the blatant discrimination of Dr. Bannon and her subsequent decision to stand up to him. Why, in the final episode, did you want to give her this obstacle?\n\nWe definitely had had a couple run-ins with the face of authority who had questioned her. I felt like we really need to raise the stakes if we’re going to bring this up again. We’re going to have to do it with someone who’s a lot more blunt about it, and she hasn’t encountered that kind of resistance that much. These kind of doctors are out there and this kind of arrogance. I always like to raise good questions, and these are fair, realistic questions: How exactly would you be a surgeon? How would it work? Though he does it in a very gruff, ignorant way, he’s asking questions that she’s got to answer. Well, with technology, well, with an interpreter, well, with a little bit of help — and we researched, there are all of these tools. That’s part of the message of this show, is that sometimes you do have to make accommodations, you may have to slow down, you may have to use your phone to text, you may have to learn a few signs, you may have to do things a little differently, and that’s OK in this world. We don’t have to make the mainstream world the only way to communicate or live or have jobs. I just liked raising that one last time in a really big, potent, loud way.\n\nI have a friend of a friend who was a doctor and got into a bike accident and became paraplegic, and he’s still a doctor. You figure it out; it doesn’t mean it’s easy. That’s always been the message of the show: The world needs to bend a little bit and get with the program, but not everyone’s the same, and that’s OK.\n\nThat also kind of relates to Toby’s decision to change careers at the end. How did you decide on that ending for him?\n\nThat was always the plan, and we were going to take it a little slower if we had had more episodes. We were going to kind of move him along, but I think it worked really nicely to have it be an epiphany in that moment. I just loved the idea of this kid changing his life so profoundly, not just as a father, but as a person.\n\nOne of the biggest surprises in the finale was that Bay and Emmett ended up not getting back together. How did you come to that decision?\n\nBay and Emmett had true love, but it was first love, and they went through a lot together, as you do when you’re young. Maybe it’s just timing, maybe things would be different if she had met Emmett at 21 instead of Travis, but they couldn’t shake all of the things that they’d been through. And secondly, the intention of the second-to-last episode, where Bay pushes Travis to tell his mother the truth about what happened, was purely intended to really show that this couple is the real thing. They can weather these kinds of storms as adults; that’s an adult relationship right there. Emmett was this lovely romantic, who would do these big romantic things for her, but Travis and she are going through hard stuff and getting through it.\n\nThe intention of the montage was really to honor Bay and Emmett for everyone, for me, not just for the fans. I love Bay and Emmett; they were a huge part of the series, and it was a nod to anyone who’s ever had a very intense first love that they thought they would end up with forever, but they don’t. When you see that person, it’s incredibly powerful, and this is someone who helped define who you are as a human being for the rest of your life, but you go your separate ways. I teared up working on that montage; to me, it really takes you back to all of those moments with Bay and Emmett. I’m quite sure that there are die-hard “Bemmett” fans who will never forgive me and will always feel like it was a mistake, but this is how Bay and Emmett and Travis evolved over the course of all the things that happened.\n\nCan you pinpoint a specific moment in the show where you shifted from having Bay end up with Emmett to believing she should end up with Travis?\n\nJust following the truth of the characters and the baggage and just some realities of doing the show with Emmett being in L.A., and we had to throw Emmett into a bit of a tailspin, and it would have been hard to get them back together. I do think there is a jerking around of the fans and the triangle that, at some point, has to stop. As a fan of my own shows, I don’t like that either. You have to know when to let go of the triangle and to make a choice. I think fans get tired of that.\n\nSomeone else asked me, “If you had gotten 10 more episodes, do you think you would have gotten Bay and Emmett back together?” and I don’t think so. This felt right for where the characters ended up. The truth of the story is, the past five seasons ended with Bay not being able to go back; she wanted to go forward. Which isn’t to say that Emmett isn’t a huge part of who she is. That will be a controversy, I’m sure, but there’s also a lot of die-hard Bay and Travis fans. You’re never going to win with everyone, and we were quite aware of that.\n\nRegina also makes a big move when she moves out of the guesthouse and gets back together with Eric, even though he has to go to prison first. Why was this the right way to end her story?\n\nI was so pleased with that twist. Luca was lovely, but they weren’t really soul mates, and Eric always felt like her second soul mate after Angelo. He came with this backstory, we couldn’t unbake that from who Eric was and why he appeared in her life the way he did, so we had to send him off last season, but everyone really wanted Eric to come back in some way, and then we really felt like, “Oh, God, we backed them into a corner.” He has this past, he’s committed this felony, he has to leave the country. I can’t believe Regina would leave her two daughters and go to another country. That didn’t feel right, even though that was on the table. Then when we came up with this moment of this flashback where her mom says, “Sometimes you have to do the hard thing to get to the right place.” … It felt like a great parallel and a great metaphor to have her come up on her own with this solution. Tell Eric, “Do what you got to do, face the music, and I will wait for you.” And then, of course, the beauty of her becoming a mom again, to a boy for the first time, just felt so sweet, and it felt like we were spinning her off into a new family.\n\nIn the end, Daphne calls Kathryn and John mom and dad, respectively. Why did you want to include that?\n\nThat was in my back pocket. That’s one of the few things that I always wanted to save for the series finale. I just felt like it would be a really big moment, and I didn’t want to slide it in casually. It’s a big deal for Kathryn. Kathryn’s a very traditional mom; her identity was a full-time mom for many years before she went back to work, and I feel like she’s always been secretly waiting for this moment and wanting it, but never asking for it because she thought it would hurt Regina’s feelings. It was just so powerful for her to hear it. I don’t think Bay will ever call Regina mom. Their relationship always felt a little more aunt-niece, big sister-little sister; they just had a more complicated relationship. Regina’s a little less traditional. … I just like the distinction between the girls that way.\n\nYou had been tweeting a little while ago about wanting to possibly write characters from Switched at Birth into your next show, but you weren’t sure about the legality of it. What is the possibility that we’ll see Daphne or Bay or someone else from the SaB universe in the future?\n\nWhat I learned was, it’s a little more complicated. You can’t really do that. Of course I can use the actors again, and I fully intend to, but I thought it would be fun to have Daphne or Travis or Emmett pop up as a cousin to this other character I created and link the shows, but I don’t think that’s legal.\n\nWell, would you be open to revisiting these characters in some sort of revival down the line? Revivals have become such a big trend in recent years.\n\nIf in 10 years, it is a trend, and the network or some network or all of us are interested, of course. We even joke about it now. It would be fun to revisit who everyone’s going to be in 10 years; Bay and Daphne as 35-year-olds or even 30-year-olds is just fun to think about.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/switched_at_birth_s05e10_still.jpg?w=1296&h=730&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/switched_at_birth_s05e10_still.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/switched_at_birth_s05e10_still.jpg?w=1024", "keywords": [], "authors": ["Kate Stanhope"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/switched-at-birth-series-finale-explained-992983/", "title": "‘Switched at Birth’ Creator on Series-Finale “Controversy,” Scrapped Ending", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Lizzy Weiss talks to THR about all those surprise twists, that last scene and a potential revival.", "news_keywords": "Switched at Birth", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Kate Stanhope", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 992983, "title": "'Switched at Birth' Creator on Series-Finale \"Controversy,\" Scrapped Ending", "published_at": "2017-04-11 19:32:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/switched_at_birth_s05e10_still.jpg?w=1024", "comment_count": 0, "tags": "Switched at Birth", "topics": "TV News", "body": "[Warning: This story contains spoilers for Tuesday's series finale of Switched at Birth, \"Long Live Love.\"]\r\nSwitched at Birth ended its five-season run on Tuesday with an eventful 90-minute farewell.\r\nThe final episode of the Peabody-winning family drama ended things by looking back at how the series started. It contained several flashbacks to when everyone in the Kennish and Vasquez families — well, almost everyone — found out that Bay (Vanessa Marano) and Daphne (Katie Leclerc) had been switched at birth. At first, the flashbacks happened because Kathryn (Lea Thompson) was feeling nostalgic about Regina (Constance Marie) deciding to move out of the guesthouse. Then, it was because Kathryn learned John (D.W. Moffett) had known about the switch before she did — a fight that escalated and de-escalated quickly.\r\nMeanwhile, Daphne stood up to a discriminatory sports surgeon who said she couldn't be a surgeon and be deaf. (And she reunited with Mingo.) And despite Travis (Ryan Lane) moving to Japan to pursue a career in baseball, he and Bay decided to continue their relationship long-distance — permanently squashing any chance of her getting back together with Emmett (Sean Berdy).\r\nRegina also figured out her romantic future. In exchange for making Will turn himself in, she offered to raise his son and wait until he got out of prison so they could start their life together in Kansas City, Kan. And finally, Toby (Lucas Grabeel) decided to ditch his unfulfilling DJ gigs for some sort of job helping those with disabilities.\r\nAfter an extended break between seasons four and five —during which time ABC Family became Freeform — and a shortened final season, the final episode was largely one of resolutions, rather than cliff-hangers.\r\nThe Hollywood Reporter spoke with Lizzy Weiss about those finale twists and turns, the scrapped ending viewers didn't see and the possibility of a revival down the road.\r\n\r\nYou mentioned there was a tag you shot at the end of season four that could have served as a series finale. Can you talk a little bit about what it was and why you decided not to use it?\r\nIt would have felt like a double ending. I feel like the emotion of the ending with the big wide aerial shot pulling back on the family and that song … the emotions sort of carried you, and then once we tried putting the tag on it, it stopped the emotions. And plus, it was a flashback to the hospital with the girls as newborns, and we cast 22-year-old actresses to play young Kathryn and young Regina, and it felt like a disappointment to not end on the people that the fans have spent five years with. I hope the network does release it for the fans just in a tweet or a YouTube link because it was cool, but it was something that we didn’t end up using.\r\nAnother big revelation was that John found out about the switch before Kathryn. Had that always been a part of the story for you? How did this twist come about?\r\nTo be totally honest, no. When I pitched the show, I was very clear that I planned out that Regina knew and all of the reasons why, and when she found out when Daphne was 3 and that she kept it secret, so that was kind of baked into the first season. In preparing for the series finale, we watched the pilot again, and we zoned in on that scene in the geneticist's office, where Bay and Kathryn looked crushed and stunned and as if their worlds have just fallen apart. It was honestly just a choice that D.W. made for John to be the stoic father, but we just zoomed in and thought, 'Gosh, it almost looks like he's not surprised.' So just in the fun of the room, we spun off that: We can't mess with the mythology of Regina. We can't undo the whole show in one last episode, but what if he knew a week before or two weeks before?\r\nThe real intention of the John-Kathryn story — no matter what story we told, I knew that the end result would be, we are revalidating them as the heart and the center of the show in terms of the family, the strength that is the Kennish home. So we needed to shake them a little and then remind everyone they will keep getting through whatever is thrown at them. It just seemed fun to have.\r\nAnother big moment in the finale was Daphne having to deal with the blatant discrimination of Dr. Bannon and her subsequent decision to stand up to him. Why, in the final episode, did you want to give her this obstacle?\r\nWe definitely had had a couple run-ins with the face of authority who had questioned her. I felt like we really need to raise the stakes if we're going to bring this up again. We’re going to have to do it with someone who's a lot more blunt about it, and she hasn’t encountered that kind of resistance that much. These kind of doctors are out there and this kind of arrogance. I always like to raise good questions, and these are fair, realistic questions: How exactly would you be a surgeon? How would it work? Though he does it in a very gruff, ignorant way, he's asking questions that she's got to answer. Well, with technology, well, with an interpreter, well, with a little bit of help — and we researched, there are all of these tools. That's part of the message of this show, is that sometimes you do have to make accommodations, you may have to slow down, you may have to use your phone to text, you may have to learn a few signs, you may have to do things a little differently, and that's OK in this world. We don't have to make the mainstream world the only way to communicate or live or have jobs. I just liked raising that one last time in a really big, potent, loud way.\r\nI have a friend of a friend who was a doctor and got into a bike accident and became paraplegic, and he's still a doctor. You figure it out; it doesn't mean it's easy. That's always been the message of the show: The world needs to bend a little bit and get with the program, but not everyone's the same, and that's OK.\r\n\r\nThat also kind of relates to Toby's decision to change careers at the end. How did you decide on that ending for him?\r\nThat was always the plan, and we were going to take it a little slower if we had had more episodes. We were going to kind of move him along, but I think it worked really nicely to have it be an epiphany in that moment. I just loved the idea of this kid changing his life so profoundly, not just as a father, but as a person.\r\nOne of the biggest surprises in the finale was that Bay and Emmett ended up not getting back together. How did you come to that decision?\r\nBay and Emmett had true love, but it was first love, and they went through a lot together, as you do when you're young. Maybe it's just timing, maybe things would be different if she had met Emmett at 21 instead of Travis, but they couldn't shake all of the things that they'd been through. And secondly, the intention of the second-to-last episode, where Bay pushes Travis to tell his mother the truth about what happened, was purely intended to really show that this couple is the real thing. They can weather these kinds of storms as adults; that's an adult relationship right there. Emmett was this lovely romantic, who would do these big romantic things for her, but Travis and she are going through hard stuff and getting through it.\r\nThe intention of the montage was really to honor Bay and Emmett for everyone, for me, not just for the fans. I love Bay and Emmett; they were a huge part of the series, and it was a nod to anyone who's ever had a very intense first love that they thought they would end up with forever, but they don't. When you see that person, it's incredibly powerful, and this is someone who helped define who you are as a human being for the rest of your life, but you go your separate ways. I teared up working on that montage; to me, it really takes you back to all of those moments with Bay and Emmett. I'm quite sure that there are die-hard \"Bemmett\" fans who will never forgive me and will always feel like it was a mistake, but this is how Bay and Emmett and Travis evolved over the course of all the things that happened.\r\nCan you pinpoint a specific moment in the show where you shifted from having Bay end up with Emmett to believing she should end up with Travis?\r\nJust following the truth of the characters and the baggage and just some realities of doing the show with Emmett being in L.A., and we had to throw Emmett into a bit of a tailspin, and it would have been hard to get them back together. I do think there is a jerking around of the fans and the triangle that, at some point, has to stop. As a fan of my own shows, I don't like that either. You have to know when to let go of the triangle and to make a choice. I think fans get tired of that.\r\nSomeone else asked me, \"If you had gotten 10 more episodes, do you think you would have gotten Bay and Emmett back together?\" and I don't think so. This felt right for where the characters ended up. The truth of the story is, the past five seasons ended with Bay not being able to go back; she wanted to go forward. Which isn't to say that Emmett isn't a huge part of who she is. That will be a controversy, I'm sure, but there's also a lot of die-hard Bay and Travis fans. You're never going to win with everyone, and we were quite aware of that.\r\n\r\nRegina also makes a big move when she moves out of the guesthouse and gets back together with Eric, even though he has to go to prison first. Why was this the right way to end her story?\r\nI was so pleased with that twist. Luca was lovely, but they weren't really soul mates, and Eric always felt like her second soul mate after Angelo. He came with this backstory, we couldn't unbake that from who Eric was and why he appeared in her life the way he did, so we had to send him off last season, but everyone really wanted Eric to come back in some way, and then we really felt like, \"Oh, God, we backed them into a corner.\" He has this past, he's committed this felony, he has to leave the country. I can't believe Regina would leave her two daughters and go to another country. That didn't feel right, even though that was on the table. Then when we came up with this moment of this flashback where her mom says, \"Sometimes you have to do the hard thing to get to the right place.\" … It felt like a great parallel and a great metaphor to have her come up on her own with this solution. Tell Eric, \"Do what you got to do, face the music, and I will wait for you.\" And then, of course, the beauty of her becoming a mom again, to a boy for the first time, just felt so sweet, and it felt like we were spinning her off into a new family.\r\nIn the end, Daphne calls Kathryn and John mom and dad, respectively. Why did you want to include that?\r\nThat was in my back pocket. That's one of the few things that I always wanted to save for the series finale. I just felt like it would be a really big moment, and I didn't want to slide it in casually. It's a big deal for Kathryn. Kathryn's a very traditional mom; her identity was a full-time mom for many years before she went back to work, and I feel like she's always been secretly waiting for this moment and wanting it, but never asking for it because she thought it would hurt Regina's feelings. It was just so powerful for her to hear it. I don't think Bay will ever call Regina mom. Their relationship always felt a little more aunt-niece, big sister-little sister; they just had a more complicated relationship. Regina's a little less traditional. … I just like the distinction between the girls that way.\r\nYou had been tweeting a little while ago about wanting to possibly write characters from Switched at Birth into your next show, but you weren’t sure about the legality of it. What is the possibility that we'll see Daphne or Bay or someone else from the SaB universe in the future?\r\nWhat I learned was, it's a little more complicated. You can't really do that. Of course I can use the actors again, and I fully intend to, but I thought it would be fun to have Daphne or Travis or Emmett pop up as a cousin to this other character I created and link the shows, but I don't think that's legal.\r\nWell, would you be open to revisiting these characters in some sort of revival down the line? Revivals have become such a big trend in recent years.\r\nIf in 10 years, it is a trend, and the network or some network or all of us are interested, of course. We even joke about it now. It would be fun to revisit who everyone's going to be in 10 years; Bay and Daphne as 35-year-olds or even 30-year-olds is just fun to think about.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Switched at Birth’ Creator on Series-Finale “Controversy,” Scrapped Ending", "url": "https://www.hollywoodreporter.com/tv/tv-news/switched-at-birth-series-finale-explained-992983/", "description": "Lizzy Weiss talks to THR about all those surprise twists, that last scene and a potential revival.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/switched_at_birth_s05e10_still.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-04-11T19:32:00+00:00", "modified_time": "2017-04-12T02:29:20+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Switched at Birth’ Creator on Series-Finale “Controversy,” Scrapped Ending", "description": "Lizzy Weiss talks to THR about all those surprise twists, that last scene and a potential revival.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/switched_at_birth_s05e10_still.jpg?w=1296"}}, "movies": [], "publish_date": 1491939120.0, "source": "https://www.hollywoodreporter.com", "summary": ""}