{"url": "https://www.celebritynetworth.com/richest-celebrities/singers/robin-thicke-net-worth/", "text": "What is Robin Thicke's Net Worth?\n\nRobin Thicke is an American singer, producer, songwriter, and actor who has a net worth of $10 million. He is known for his hit singles \"Magic\", \"Blurred Lines\", and \"Lost Without U\".\n\nEarly Life and Career Beginnings\n\nRobin Alan Thicke was born in Los Angeles, California, on March 10, 1977, to famous parents in the entertainment business. His mother is the actress-singer Gloria Loring, who is best known for her role on the NBC daytime drama \"Days of Our Lives\". His father Alan Thicke was also an actor, best known for his role on the sitcom \"Growing Pains\". His parents separated when he was 7 years old, and he has an older brother and a younger half-brother.\n\nGrowing up, Thicke's parents supported his love for music. However, according to Thicke, his father refused to pay for Thicke and his music group, As One, to record a professional demo tape, wishing for Thicke to focus on his studies instead. Eventually, jazz vocalist Al Jarreau, the uncle of one of the group members, paid $1,000 for the demo.\n\nThe demo made its way to R&B artist Brian McKnight, who was impressed by Thicke and signed him to his production company. Thicke helped write songs for McKnight; he co-wrote the song \"Anyway\" on McKnight's second album. McKnight is the one who helped introduce Thicke to Jimmy Iovine, which is how Thicke was signed to Interscope Records on a recording contract when he was just 16 years old.\n\nMusic Career\n\nAt the age of 17, Thicke moved out on his own and was able to support himself through his work as a professional record producer and songwriter. During this early period of his career, he wrote songs for artists like Brandy, Jordan Knight, Christina Aguilera, and Mya. During this period, he recorded his own material and performed under just his surname, \"Thicke\", and continued with this until 2005.\n\nFollowing the end of his first deal with Interscope, Thicke was briefly involved with Epic Records before signing with Interscope again, this time under Kenneth \"Babyface\" Edwards's Nu America imprint. Thicke's debut single \"When I Get You Alone\" (2002) was a chart success in Australia, hitting the Top 20 there. It also performed well in New Zealand, the Netherlands, and Italy. This moderate success allowed for the release of his debut album, \"A Beautiful World\" (2003). The album failed to meet performance expectations—it peaked at No. 152 on the Billboard 200 chart—but many artists such as Usher and Mary J. Blige reached out to him about collaborating together.\n\nInterscope Records was hesitant and unsure about Thicke's ability to sell albums, so work on his second album was delayed due to financial and creative disagreements between him and the label. However, Pharrell Williams was impressed by Thicke. Williams had established a distribution deal with Interscope for his record label, Star Trak, and eventually Thicke was signed to Star Trak in 2005. Thicke's second album \"The Evolution of Robin Thicke\" was released in October, 2006, and the single \"Lost Without U\" eventually peaked at No. 14 on the Billboard Hot 100. The album has since been certified Platinum by the RIAA, with domestic sales of over 1.5 million copies.\n\nIn 2007, Thicke was the featured opening act for the North American section of Beyoncé's tour, \"The Beyoncé Experience\". He released his third album \"Something Else\" in September 2008, and it debuted at No. 3 on the Billboard 200 chart. His fourth album, \"Sex Therapy\", was released in December 2009; it featured artists such as Estelle, Snoop Dogg, and Nicki Minaj.\n\nThicke release his fifth studio album \"Love After war\" in December 2011, and it debuted at No. 22 on the Billboard 200. He followed this with his sixth studio album, \"Blurred Lines\", released in July 2013. The lead single off the album, also titled \"Blurred Lines\", was released in March 2013, and features T.I. and Pharrell.\n\nHis seventh album \"Paula\" (2014) was dedicated to his estranged wife Paula Patton.\n\nBlurred Lines Lawsuit\n\nSoon after the release of \"Blurred Lines\", the estate of Marvin Gaye sued Robin and his co-writer/producer Pharrell Williams for copyright infringement alleging similarities to the 1977 song \"Got to Give It Up\". According court filings, \"Blurred Lines\" generated a total of $16,675,690 in profits. That's more than any other song of 2013.\n\nOf that $16.67 million, $5,658,214 was paid to Robin Thicke, $5,153,457 was paid to Pharrell Williams and $704,774 went to rapper T.I.. The remaining $5,159,245 was split between three different record companies. In 2015 a judge ordered Thicke and Williams for $7 million. The final amount was eventually reduced to $5 million.\n\nOther Projects and Appearances\n\nIn addition to music, Thicke has ventured into the realm of acting and television. His feature film debut came in the film \"Making the Rules\" (2014), which was filmed in 2012 under the title \"Abby in the Summer\". He has made numerous appearances on music-related television programs. In May 2012, he was a judge on the ABC show \"Duets\", alongside John Legend, Jennifer Nettles, and Kelly Clarkson; it lasted for one season, with a total of 9 episodes. As of June 2020, Thicke is a panelist on the American reality singing competition \"The Masked Singer\".\n\nPersonal Life\n\nThicke first met actress Paula Patton when he was 14 and she was 16, in the year 1991. They began dating in 1993, and married in 2005. Together, they have a son, Julian Fuego Thicke, who was born in 2010. After 21 years together and nearly nine years of marriage, Thicke and Patton separated in 2014 and finalized their divorce in 2015. In early 2017, Patton filed a restraining order against Thicke, accusing him of domestic violence, substance abuse, and infidelity. Eventually, they reached a custody agreement regarding their son in August 2017.\n\nThicke met April Love Geary at a party in 2014. She gave birth to their first child in February 2018, and their second child in February 2019. The couple became engaged on Christmas Eve 2018. In November 2018, Thicke and Geary lost their home in Malibu, California, to the Woolsey wildfire that had been raging in the area. Thicke is a good friend of fellow artist Usher, and sang for the couple when Usher proposed to Tameka Foster. Thicke also performed at Michael Jordan and Yvette Prieto's wedding.\n\nReal Estate\n\nIn 1990, Robin's father Alan paid $910,000 for a home in the \"Bird Streets\" area in the Hollywood Hills of Los Angeles. In 2005, soon after Robin and Paula married, Alan deeded the property to his son. In 2014 Robin and Paula listed the home for sale for just under $3 million. Impressively the home ended up selling for $4.9 million, $1.9 million OVER asking.\n\nIn March 2015 Robin paid $2.4 million for a 1.7-acre home in Malibu, California.", "images": ["https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2009/12/Robin-Thicke-1.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/wp-content/uploads/2009/12/rt.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2009/12/rt.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/singers/robin-thicke-net-worth/", "title": "Robin Thicke Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Robin Thicke Net Worth: Robin Thicke is an American singer, producer, songwriter, and actor who has a net worth of $10 million. He is known for his hit singles", "cnw_share_fb_count": 146, "cnw_share_tw_count": 26, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Robin Thicke Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/singers/robin-thicke-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/12/rt.jpg", "site_name": "Celebrity Net Worth", "description": "Robin Thicke Net Worth: Robin Thicke is an American singer, producer, songwriter, and actor who has a net worth of $10 million. He is known for his hit singles"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-05-31T18:57:29+00:00", "published_time": "2020-05-24T20:52:59+00:00", "section": "Singers", "tag": "robin thicke salary"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/12/rt.jpg", "title": "Robin Thicke Net Worth", "description": "Robin Thicke Net Worth: Robin Thicke is an American singer, producer, songwriter, and actor who has a net worth of $10 million. He is known for his hit singles"}}, "movies": [], "publish_date": 1590353579.0, "source": "https://www.celebritynetworth.com", "summary": ""}