{"url": "https://www.flare.com/tv-movies/kristen-cavallari-jay-cutler-very-cavallari/", "text": "When I was a young lass, I—like many of my peers—was a hardcore fan of The Hills. I loved the show so much that I would excuse myself from many a boy-girl hangout to settle in at home for one glorious hour of classic Los Angeles dramz, while updating my BBM status (“*~Watching The Hills! Do not disturb!~*”).\n\nIf this Monday night setup sounds familiar (hi, everyone born in the ’90s), I have some great news: Kristin Cavallari has a spinoff reality show called Very Cavallari and it. is. AMAZING. And by that, I mean: It’s terrible, but I can’t look away.\n\nIt’s been eight years since The Hills went off the air. Kristin Cavallari is now 31 and married to former pro football player Jay Cutler. They live with their three kids (Camden, Jaxon and Saylor) in a mansion in Nashville. In the first Very Cavallari episode, which is available in its entirety on YouTube, we learn that Kristen and Jay don’t want their kids to be on TV against their will. Instead, the show focuses on Kristin trying to jumpstart her jewellery/home goods store Uncommon James, interspersed with some weirdly mean “banter” between her and the always-bored looking Jay.\n\nIf it sounds extremely mediocre, that’s because it is. The storylines are slow moving, the characters are largely one-dimensional and by the end of episode 1, everyone has looked directly into the camera at least once. And yet, I am glued to my screen for each hour-long episode—and I think it’s because I’m so damn nostalgic for The Hills.\n\nHerewith, all the ways Kristin Cavallari’s new show—which airs Sundays on E!—is scratching my itch for Lauren Conrad and co.\n\nThe gang’s all here\n\nThe ladies of Nashville are relentlessly dramatic and the dudes are either total cheeseballs or totally mean. Sound familiar?\n\nJust like Lauren Conrad on The Hills, Kristin Cavallari is the show’s fearless leader. She is determined to make it big in the jewellery/home goods biz and she has very little time for anything else. Cavallari hired Shannon, Reagan and Brittainy to work at the shop, effectively forcing three very loud personalities into a teeny-tiny office space—aka exactly how Lauren and Whitney got into so many workplace squabbles as Teen Vogue interns and later at the PR firm, People’s Revolution.\n\nIn place of Audrina, we have Shannon, who is a total flirt and ultimately the show’s shit disturber. Although she’s the social media manager for Uncommon James, Shannon makes it very clear that she has zero interest in actually working. Reagan—who is more of a Stephanie Pratt, IMO—is a huge space cadet (she calls herself “the blonde with the big tits”) and I have no idea what she does for the company. Thus far, I’ve seen her try to buy snacks for a photo shoot and opt for, among other selections, an uncut watermelon with no knife. And then there’s Brittainy, the no-nonsense store manager and the Whitney of the bunch. In short, each are a special kind of exhausting, and they make great TV.\n\nJay Cutler is—as Kristin’s old faux, Lauren, would say—a “very sucky person.” As far as I can tell, all he’s been doing since stepping back from the NFL is driving his children to and from school and complaining about it in between. Oh, and he spends a lot of time watching live feeds of deer in the wild. I’m serious.\n\nMeanwhile, Shannon is dating a corny singer-songwriter who just wants to make it big. His name is John Gurney and he spends most of his time crooning about how Shannon’s beauty makes him insecure and storming out of bars when he gets mad at her. In a fun twist, Gurney (as he is lovingly called) is BFFs with Brittainy’s boo, Jon Stone, described in the show as a “Nashville music legend.”\n\nAnd that is the entire cast of characters, simple and beautiful, just like the drama they create. Just what the OG Hills success recipe calls for!\n\nThey are constantly gossiping in a dimly lit club\n\nFrom Audrina and Justin Bobby discussing their tumultuous relationship over double rum and Cokes, to LC screaming at Heidi with a gin and tonic splashing around in her hand (“you know what you did!”), the bar was where all the magic of The Hills happened. Eight years later and Kristin Cavallari might be a mom, but she still hits up the club when she wants to dish.\n\nMost often heading out on the town with her BFF/makeup artist-hairstylist-wardrobe director-lifestyle blogger-podcast host Kelly Henderson, Kristin rarely has anything of interest to talk about. But throw in some loud music and a couple snazzy ’fits, and I’ll watch them gossip about nada for hours. On the flip, Shannon and Reagan love to drink. It’s one of the things they most often talk about—Reagan even claims to be the best version of herself when she’s hungover—and it’s one of their favourite past times. In episode 2, they invite their friends to “Sunday Funday” and you follow them on their journey to a very emotional Sunday evening via a montage of bottomless mimosas and tequila shots. It’s on this night that Gurney gets mad at Shannon for flirting with this other guy, Wirth, who also works at the store.\n\nAny good reality show knows that where there’s alcohol, there’s drama. Very Cavallari is no different, and it’s peak entertainment.\n\nThey all have wildly unprofitable “jobs” which act as a front for their real careers (read: making all the dramz for TV)\n\nBy episode 2, it becomes clear that Uncommon James exists solely online (although there’s now a bricks and mortar location IRL). They only have one model (Taylor, who is also on the show) and they rely heavily on making sales through Instagram ads, as evidenced by how many times Shannon has been yelled at for slacking.\n\nThis can all only mean one thing: Uncommon James isn’t bringing in the big bucks, Very Cavallari is. If you recall, The Hills producers were masters at this masquerade, getting Lauren, Audrina and Heidi high-profile jobs with the flick of a producer’s wand. While the show and its cast maintained that these jobs were real, a few plot holes revealed otherwise.\n\nThe great thing about this is that the core four (Kristen, Shannon, Reagan and Brittainy) are consistently jamming their loud personalities into high pressure situations, making for excellent television with The Hills‘s villain at the helm.\n\nWhile my fave reality show had its moments, I think we all need to accept that The Hills was grade A, early 2000s garbage. From manufactured melees over ex-boyfriends to the façade of financial struggle, literally nothing about the MTV hit was real (despite show-leader Lauren Conrad’s insistence that it was)—but that’s what made it so damn interesting to watch. It was a weird trial run in fantasy being portrayed as actuality, the storylines veering as dramatically as they would in a soap, with all the authority of a documentary.\n\nSince The Hills went off the air, I’ve moved past my obsession with straightened side bangs and Taylor Swift, but my taste in television has remained virtually the same. All I ask out of “reality” TV is that it makes me gasp, and on that front, Very Cavallari is killing it.\n\nIf you loved The Hills as much as I did, Very Cavallari will feel like the next best thing.\n\nRelated:\n\nEverything We Know About Bachelor in Paradise Season 5\n\nKim Kardashian Glorified Anorexia & More of the Kardashian Fam’s Problematic Ways\n\nThis Scene from Orange is the New Black Season 6 Proves Why The Show is Still Relevant", "images": ["https://www.flare.com/wp-content/uploads/2018/08/Kristin-Cavallari-and-the-cast-of-Very-Cavallari-social.jpg", "https://www.flare.com/wp-content/uploads/2018/08/giphy-1-1.gif", "https://www.flare.com/wp-content/uploads/2018/08/giphy.gif", "https://www.flare.com/wp-content/uploads/2018/07/Meghan-Collie_avatar_1532014467.png", "https://www.flare.com/wp-content/uploads/2018/08/Kristin-Cavallari-and-the-cast-of-Very-Cavallari-inline.jpg", "https://www.flare.com/wp-content/uploads/2018/08/giphy-1.gif", "https://www.flare.com/wp-content/plugins/rdm-daac-notice/public/images/info.png", "https://www.flare.com/wp-content/themes/flare.com/assets/images/logo.png", "https://www.flare.com/wp-content/plugins/rdm-daac-notice/public/images/close.png"], "top_img": "https://www.flare.com/wp-content/uploads/2018/08/Kristin-Cavallari-and-the-cast-of-Very-Cavallari-social.jpg", "keywords": [], "authors": ["Meghan Collie"], "canonical_link": "https://www.flare.com/tv-movies/kristen-cavallari-jay-cutler-very-cavallari/", "title": "Kristen Cavallari's New Reality Show Is So Bad, It's Good", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "apple-mobile-web-app-capable": "yes", "contextly-page": "{\"title\":\"&quot;Kristin Cavallari&#039;s New Show Is Terrible, But I Can&#039;t Look Away&quot;\",\"url\":\"https:\\/\\/www.flare.com\\/tv-movies\\/kristen-cavallari-jay-cutler-very-cavallari\\/\",\"pub_date\":\"2018-08-10 09:30:19\",\"mod_date\":\"2018-08-10 10:15:29\",\"type\":\"post\",\"post_id\":\"707121\",\"author_id\":\"135230\",\"author_name\":\"Meghan Collie\",\"author_display_name\":\"Meghan Collie\",\"tags\":[\"Lauren Conrad\",\"The Hills\"],\"categories\":[\"TV &amp; Movies\"],\"image\":\"https:\\/\\/www.flare.com\\/wp-content\\/uploads\\/2018\\/08\\/Kristin-Cavallari-and-the-cast-of-Very-Cavallari.jpg\",\"image_alt\":\"The cats of Very Cavallari posed on a couch with Kristin Cavallari in the middle\"}", "description": "Complete with corny boyfriends and a company that isn't very successful, 'Very Cavallari' is almost as good as 'The Hills'", "og": {"locale": "en_US", "type": "article", "title": "Kristen Cavallari's New Show Is So Bad, It's Good", "description": "The bitch is back!", "url": "https://www.flare.com/tv-movies/kristen-cavallari-jay-cutler-very-cavallari/", "site_name": "FLARE", "updated_time": "2018-08-10T14:15:29+00:00", "image": {"identifier": "https://www.flare.com/wp-content/uploads/2018/08/Kristin-Cavallari-and-the-cast-of-Very-Cavallari-social.jpg", "secure_url": "https://www.flare.com/wp-content/uploads/2018/08/Kristin-Cavallari-and-the-cast-of-Very-Cavallari-social.jpg", "width": 840, "height": 440, "alt": "The cats of Very Cavallari posed on a couch with Kristin Cavallari in the middle"}}, "article": {"publisher": "https://www.facebook.com/FLAREFashion", "tag": "premium", "section": "TV & Movies", "published_time": "2018-08-10T13:30:19+00:00", "modified_time": "2018-08-10T14:15:29+00:00"}, "twitter": {"card": "summary_large_image", "description": "The bitch is back!", "title": "Kristen Cavallari's New Show Is So Bad, It's Good", "site": "@FLAREfashion", "image": "https://www.flare.com/wp-content/uploads/2018/08/Kristin-Cavallari-and-the-cast-of-Very-Cavallari-social.jpg", "creator": "@FLAREfashion"}, "generator": "WordPress 4.9.14", "msapplication-TileImage": "https://www.flare.com/wp-content/uploads/2020/02/favicon.png"}, "movies": [], "publish_date": 1533907819.0, "source": "https://www.flare.com", "summary": ""}