{"url": "https://www.digitalspy.com/tv/ustv/a842022/stranger-things-season-3-netflix-date-cast-trailer-theories-plot/", "text": "Stranger Things spoilers follow.\n\nThere's a lot that's happened in Stranger Things. Here's what you missed in the busy third season of the Netflix hit.\n\nStranger Things season 3 recap\n\nThe season opens with a team of Russian scientists using the power of CGI (okay, electromagnetic energy) to try to re-open a gateway crack into the Upside Down. When it doesn’t work, a lackey gets choked out, which is a pretty extreme punishment for not being able to open a door. The lackey’s assistant is given one year to succeed where his boss failed, or he’ll face the same fate.\n\nCut to the people we actually streamed to see, or two of them at least – as Mike (Finn Wolfhard) and Eleven (Millie Bobby Brown) have a make-out sesh, which makes Eleven’s new roommate Chief of Police Jim Hopper (David Harbour) feel pretty awkward. Eleven is living in his cabin now, and he’s finding dad duties difficult.\n\nNetflix\n\nDustin (Gaten Matarazzo) also has a love interest, a long distance GF he met at camp, and is using a radio tower to communicate with her. When he interrupts a Russian broadcast, he brings it to his friend Steve (Joe Keery) and new character Robin (Maya Hawke), who works with Steve at the Starcourt Mall food court, at an ice cream parlor called Scoops Ahoy.\n\nNetflix\n\nMike is also at the Mall, with Will Byers (Noah Schnapp), Lucas Sinclair (Caleb McLaughlin) and Max (Sadie Sink) – and Steve sneaks them into a movie, which promptly shuts down because of a power cut.\n\nBut that’s not the only weird event. Joyce (Winona Ryder) is freaked out by unusual magnetic fluctuations on her fridge. Nancy (Natalia Dyer) and Jonathan (Charlie Heaton), are working at the Hawkins Post as interns, investigating the glamorous world of rats, and Will (Noah Schnapp) is fairly convinced that the Mind Flayer is still alive.\n\nAll of these things come together when an army of rats combine in a steel mill to create a new version of the Mind Flayer. Billy (Dacre Montgomery) is captured, dragged into the mill by vines, and is mind controlled to capture another teen, Heather (Francesca Reale) – and the pair become bodysnatched servants of the Flayer.\n\nNetflix Netflix\n\nRelated: Stranger Things cast - here's where you've seen them before\n\nEleven is suspicious of Billy, and it becomes clear that the ‘Flayed’ are dangerous enemies. Eleven is the monster’s target – it’s apparently on a revenge mission for their destruction of the Hawkins gate, and threatens to kill her and her friends.\n\nAfter decoding the Russian message (thanks Robin!), the kids find a secret Russian lab, hidden in the maze-like depths of the mall. The call was coming from inside the house (mall)!\n\nSteve and Robin are caught peeping on the Russians, but Dustin and his friend Erica (Priah Ferguson), Lucas’s (Caleb McLaughlin) sister, save them.\n\n\n\nThe Flayer attacks the gang at Hopper’s cabin and Eleven uses her powers to protect them, but is injured, with a Mind Flayer fragment invading her leg, eventually crawling around (gross), and needing to be cut out (even more gross).\n\nJoyce and Hopper, searching for the kids at a fourth of July celebration, are chased by Russians. Hopper fights them, stealing a walkie-talkie in the process, overhearing that they’re in pursuit of the kids at the mall.\n\nThe scene is set for a final confrontation with the Flayer, in the legendary ‘Battle of Starcourt.’\n\nNetflix\n\nRelated: Stranger Things season 5 potential release date, cast, plot and everything you need to know\n\nUnfortunately, because of her flayed leg, Eleven is weakened at the start of the battle. The piece is removed, but it hurts Eleven, and even the sight of Hopper returning to crunch the fragment under his boot doesn’t give her the recharge she needs. Hopper and Joyce rush to destroy the Russian machine that’s opening the gate. If they close the gate, it will kill the Mind Flayer, yay!\n\nBilly knocks out Eleven, carrying her to the Mind Flayer. The gang is able to distract the creature with fireworks, and Eleven uses the power of nostalgia to bring back Billy, describing memories of his mom on the beach until he returns to his former self. Billy turns out to be majorly heroic (well, he was a lifeguard) and sacrifices himself to save the children.\n\nSpeaking of heroic, Hopper also sacrifices himself (or does he?), following a confrontation with a tough Russian (who looks and sounds like Arnie’s Terminator) – a punch-up which takes him too close to the machine to escape when it explodes. He nods to Joyce to blow the thing up, and is apparently killed in the process.\n\nThe season wraps up with helicopters parking next to the mall, and Dr Owens (Paul Reiser) examining the damage/closed gate.\n\nA crushed Eleven realises what happened to Hopper. We flash forward to three months later, discovering that the events that took place during the Battle of Starcourt have been covered up. We also get an emotional reunion of sorts, as Eleven (who’s now living with Joyce, and has lost her powers) reads a letter from Hopper.\n\n\n\nBut, wait! A post-credit scene heavily hints that Hopper is still alive, and in a Russian gulag where prisoners are being fed to a Demogorgon (‘No, not the American’).\n\nIs Hopper still alive? Find out in Stranger Things season 4!\n\nStranger Things seasons 1-4 are now streaming worldwide on Netflix.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stranger-things-1560340426.jpg?crop=1.00xw:0.506xh;0,0.201xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://www.digitalspy.com/sites/digitalspy/assets/images/logos/ipso_regulated_hires.png"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stranger-things-1560340426.jpg?crop=1.00xw:0.506xh;0,0.201xh&resize=1200:*", "keywords": [], "authors": ["Sam Ashurst"], "canonical_link": "https://www.digitalspy.com/tv/ustv/a842022/stranger-things-season-3-netflix-date-cast-trailer-theories-plot/", "title": "Stranger Things season 3 recap", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#e94114", "og": {"type": "article", "site_name": "Digital Spy", "title": "Stranger Things season 3 recap", "description": "Let's go back to the mall...", "url": "http://www.digitalspy.com/tv/ustv/a842022/stranger-things-season-3-netflix-date-cast-trailer-theories-plot/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stranger-things-1560340426.jpg?crop=1.00xw:0.506xh;0,0.201xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 131928163488848}, "article": {"publisher": "https://www.facebook.com/digitalspyuk/", "modified_time": "2022-09-28T19:10:28Z", "published_time": "2022-09-28T08:43:00Z", "section": "US TV", "opinion": "false"}, "twitter": {"site": "@digitalspy", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stranger-things-1560340426.jpg?crop=1.00xw:0.506xh;0,0.201xh&resize=640:*"}, "google-site-verification": "yOsKGKJADzRcnlk-FrptJIoYYaNs5pgoJx2J0ie4bWE", "title": "Stranger Things season 3 recap - plot summary", "description": "Stranger Things season 3's events, new characters and ending summarised.", "keywords": "Stranger Things, Stranger Things season 3, Stranger Things 3, Stranger Things season 3 release date, Stranger Things release date, stranger things season 3 cast, stranger things season 3 theories, stranger things season 3 trailer, Millie Bobby Brown, Finn Wolfhard, Noah Schnapp, stranger things season 3 auditions, stranger things season 3 date, stranger things season 3 script", "auto-publish": "never", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stranger-things-1560340426.jpg?crop=0.486xw:0.486xh;0.390xw,0.191xh&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "TV,tv,ustv,Noah Schnapp,Finn Wolfhard,Millie Bobby Brown", "sailthru.date": "2022-09-28T08:43:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stranger-things-1560340426.jpg?crop=1.00xw:0.506xh;0,0.201xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stranger-things-1560340426.jpg?crop=0.486xw:0.486xh;0.390xw,0.191xh", "sailthru.socialtitle": "Stranger Things season 3 recap", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1664354580.0, "source": "https://www.digitalspy.com", "summary": ""}