{"url": "https://www.hollywoodreporter.com/news/samantha-bee-apologizes-ivanka-trump-insult-i-crossed-a-line-1116157", "text": "Samantha Bee, the host of TBS’ Full Frontal With Samantha Bee, on Thursday afternoon issued an apology for using a vulgarity to refer to first daughter and White House adviser Ivanka Trump on her Wednesday night show.\n\n“I would like to sincerely apologize to Ivanka Trump and to my viewers for using an expletive on my show to describe her last night,” Bee said. “It was inappropriate and inexcusable. I crossed a line, and I deeply regret it.”\n\nBee’s comment came at the end of a segment about the Trump administration’s harsh treatment of illegal immigrants. She told Trump to “do something about your dad’s immigration practices” and called her a “feckless c—.”\n\nThe remark quickly became a political football, with White House press secretary Sarah Huckabee Sanders taking the unusual step of formally blasting Bee in a statement. Sanders called the comment “vile and vicious.”\n\nTBS supported the host’s apology on Thursday with a statement of its own: “Samantha Bee has taken the right action in apologizing for the vile and inappropriate language she used about Ivanka Trump last night. Those words should not have been aired. It was our mistake too, and we regret it.”\n\nAutotrader.com announced plans to suspend sponsorship of Bee’s show. “The comments expressed by Samantha Bee were offensive and unacceptable and do not reflect the views of our company,” the brand said on Twitter. “As a result, we have suspended our sponsorship of Full Frontal With Samantha Bee.”\n\nLater on Thursday, insurance company State Farm followed suit. “As part of our overall advertising with TBS, our ad did appear last night,” the company said in a statement. “We have asked TBS to suspend our advertising in the program and are reviewing any future placements. We constantly review programs to ensure alignment to our programming guidelines and brand values.”\n\nFollowing ABC’s decision to cancel the hit show Roseanne on Tuesday, the Trump White House has blasted the network and the media at large for several instances of what the administration believes is inappropriate criticism.\n\nConservative media almost immediately pounced on Bee’s comment, and one former Fox News personality, NBC host Megyn Kelly, used Twitter to take the backlash mainstream, calling the remark “disgusting.”", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/sam_bee_0.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/sam_bee_0.jpg?w=1024", "keywords": [], "authors": ["Jeremy Barr"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/samantha-bee-apologizes-ivanka-trump-insult-i-crossed-a-line-1116157/", "title": "Samantha Bee Apologizes for Ivanka Trump Slur: “I Crossed a Line”", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "At least two advertisers, Autotrader and State Farm, announced plans to suspend sponsorship of Bee's show following the backlash.", "news_keywords": "Samantha Bee", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jeremy Barr", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1116157, "title": "Samantha Bee Apologizes for Ivanka Trump Slur: \"I Crossed a Line\"", "published_at": "2018-05-31 11:22:06", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/sam_bee_0.jpg?w=1024", "comment_count": 0, "tags": "Samantha Bee", "topics": "News", "body": "Samantha Bee, the host of TBS' Full Frontal With Samantha Bee, on Thursday afternoon issued an apology for using a vulgarity to refer to first daughter and White House adviser Ivanka Trump on her Wednesday night show.\r\n\"I would like to sincerely apologize to Ivanka Trump and to my viewers for using an expletive on my show to describe her last night,\" Bee said. \"It was inappropriate and inexcusable. I crossed a line, and I deeply regret it.\"\r\nBee's comment came at the end of a segment about the Trump administration's harsh treatment of illegal immigrants. She told Trump to \"do something about your dad's immigration practices\" and called her a \"feckless c—.\"\r\nThe remark quickly became a political football, with White House press secretary Sarah Huckabee Sanders taking the unusual step of formally blasting Bee in a statement. Sanders called the comment \"vile and vicious.\"\r\nTBS supported the host's apology on Thursday with a statement of its own: \"Samantha Bee has taken the right action in apologizing for the vile and inappropriate language she used about Ivanka Trump last night. Those words should not have been aired. It was our mistake too, and we regret it.\"\r\nAutotrader.com announced plans to suspend sponsorship of Bee's show. \"The comments expressed by Samantha Bee were offensive and unacceptable and do not reflect the views of our company,\" the brand said on Twitter. \"As a result, we have suspended our sponsorship of Full Frontal With Samantha Bee.\"\r\nLater on Thursday, insurance company State Farm followed suit. \"As part of our overall advertising with TBS, our ad did appear last night,\" the company said in a statement. \"We have asked TBS to suspend our advertising in the program and are reviewing any future placements. We constantly review programs to ensure alignment to our programming guidelines and brand values.”\r\nFollowing ABC's decision to cancel the hit show Roseanne on Tuesday, the Trump White House has blasted the network and the media at large for several instances of what the administration believes is inappropriate criticism.\r\nConservative media almost immediately pounced on Bee's comment, and one former Fox News personality, NBC host Megyn Kelly, used Twitter to take the backlash mainstream, calling the remark \"disgusting.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Samantha Bee Apologizes for Ivanka Trump Slur: “I Crossed a Line”", "url": "https://www.hollywoodreporter.com/news/general-news/samantha-bee-apologizes-ivanka-trump-insult-i-crossed-a-line-1116157/", "description": "At least two advertisers, Autotrader and State Farm, announced plans to suspend sponsorship of Bee’s show following the backlash.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/sam_bee_0.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-05-31T11:22:06+00:00", "modified_time": "2018-05-31T17:21:32+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Samantha Bee Apologizes for Ivanka Trump Slur: “I Crossed a Line”", "description": "At least two advertisers, Autotrader and State Farm, announced plans to suspend sponsorship of Bee’s show following the backlash.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/sam_bee_0.jpg?w=1280"}}, "movies": [], "publish_date": 1527765726.0, "source": "https://www.hollywoodreporter.com", "summary": ""}