{"url": "https://en.wikipedia.org/wiki/Jimmy_Kimmel", "text": "American talk show host and comedian\n\nJames Christian Kimmel (born November 13, 1967) is an American television host, comedian, writer, and producer. He is the host and executive producer of Jimmy Kimmel Live!, a late-night talk show that premiered on ABC on January 26, 2003, at Hollywood Masonic Temple in Hollywood, California; and on April 1, 2019, at a secondary home, the Zappos Theater on the Las Vegas Strip. Kimmel hosted the Primetime Emmy Awards in 2012, 2016 and 2020, and the Academy Awards in 2017 and 2018.\n\nBefore hosting Jimmy Kimmel Live!, Kimmel was the co-host of Comedy Central's The Man Show and Win Ben Stein's Money. Kimmel has also produced such shows as Crank Yankers, Sports Show with Norm Macdonald, and The Andy Milonakis Show. In 2018, Time named him as one of \"The World's 100 Most Influential People\".[4] Kimmel is the longest-working of all current late-night talk show hosts in the United States, following Conan O’Brien’s retirement from hosting a late-night program.\n\nEarly life and family\n\nKimmel was born in Brooklyn, New York, and grew up in the neighborhood of Mill Basin[3] as the eldest of three children of Joan (Iacono) and James John Kimmel, who worked at American Express and was an IBM executive.[5][6][7]\n\nHe was raised Catholic and, as a child, was an altar server.[8][9] Kimmel's mother is of Italian ancestry from Ischia, Naples, and her family migrated to the United States after the 1883 earthquake.[10][11] Two of his paternal great-great-grandparents were German immigrants. His family's surname was \"Kümmel\" (\"caraway\" in German) several generations back.[12][13][14][15] According to a DNA test, Kimmel is also of partial Albanian descent.[16]\n\nThe family moved to Las Vegas, Nevada, when he was nine years old.[5] He graduated from Ed W. Clark High School,[17] and then attended University of Nevada, Las Vegas for one year before transferring to Arizona State University. He received an honorary degree from UNLV in 2013.[18]\n\nKimmel's uncle, Frank Potenza (\"Uncle Frank\"), appeared on Jimmy Kimmel Live! as a regular from 2003 until his death in 2011.[19] His cousin Sal Iacono performed Kimmel's former co-hosting duties during the last season of Win Ben Stein's Money and then became a writer and sketch performer on Jimmy Kimmel Live![20] His Aunt Chippy (Concetta Potenza) is also a featured part of the show. His brother Jonathan works on the show as a director. His sister, Jill, is a comedian.\n\nCareer\n\nRadio career\n\nInspired by David Letterman's start in radio, Kimmel began working in radio while in high school. He was the host of a Sunday night interview show on UNLV's college station, KUNV.[21] While attending Arizona State University, he became a popular caller to the KZZP-FM afternoon show hosted by radio personalities Mike Elliott and Kent Voss in Phoenix, Arizona. In 1989, Kimmel landed his first paying job alongside Voss as morning drive co-host of The Me and Him Show at KZOK-FM in Seattle, Washington. Over the next 10 months, the hosts performed several stunts on air, including one that led to an $8,000 loss in advertising.[22][23]\n\nIn 1990, Kimmel and Voss were fired by KZOK and were fired again a year later at WRBQ-FM in Tampa, Florida. Kimmel went on to host his own show at KCMJ in Palm Springs, California, where he recruited Carson Daly, who had been a family friend since his childhood, as his intern.[24] After a morning stint at KRQQ in Tucson, Arizona, Kimmel landed at KROQ-FM in Los Angeles. He spent five years as \"Jimmy The Sports Guy\" for the Kevin and Bean morning show. During this time he met and befriended the comedian Adam Carolla.[25]\n\nComedy Central\n\nKimmel, who initially did not want to do television, began writing for Fox announcers and promotions and was quickly recruited to do the on-air promotions himself. He declined several offers for television shows from producer Michael Davies, being uninterested in the projects, until he was offered a place as the comedic counterpart to Ben Stein on the game show Win Ben Stein's Money, which began airing on Comedy Central in 1997. His quick wit and \"everyman\" personality were counterpoints to Stein's monotonous vocal style and faux-patrician demeanor. The combination earned the pair an Emmy award for Best Game Show Host.[21]\n\nIn 1999, during his time on Win Ben Stein's Money, Kimmel co-hosted (with Adam Carolla) and co-produced (with Daniel Kellison), Comedy Central's The Man Show. Kimmel left Win Ben Stein's Money in 2001 and was replaced by comedian Nancy Pimental, who was eventually replaced by Kimmel's cousin Sal Iacono. The Man Show's success allowed Kimmel, Carolla, and Kellison to create and produce, under the banner Jackhole Productions, Crank Yankers for Comedy Central (on which Kimmel plays the characters \"Elmer Higgins\", \"Terrence Catheter\", \"The Nudge\", \"Karl Malone\" and himself) and later The Andy Milonakis Show for MTV2. Kimmel also produced and co-wrote the feature film Windy City Heat, Festival Prize winner of the Comedia Award for Best Film at the 2004 Montreal Comedy Festival.\n\nJimmy Kimmel Live!\n\nIn January 2003, Kimmel permanently left The Man Show to host his own late-night talk show, Jimmy Kimmel Live!, on ABC. In the April 2007 issue of Stuffmagazine.com, Kimmel was named the \"biggest badass on TV\". Kimmel said it was an honor but clearly a mistake.\n\nDespite its name, the show has not actually aired live since 2004, when censors were unable to properly bleep censor a barrage of swearing from actor Thomas Jane.[26]\n\nDuring the 2004 NBA Finals in Detroit, Kimmel appeared on ABC's halftime show to make an on-air plug for his show. He suggested that if the Detroit Pistons defeated the Los Angeles Lakers, \"they're gonna burn the city of Detroit down ... and it's not worth it.\" Officials with Detroit's ABC affiliate, WXYZ-TV, immediately announced that that night's show would not air on the station. Hours later, ABC officials pulled that night's show from the entire network. Kimmel later apologized.[27]\n\nKimmel usually ends his show with \"My apologies to Matt Damon, we ran out of time.\" When Matt Damon did actually appear on the show to be interviewed, he walked in and sat down only to be told just a few seconds later by Kimmel, \"Unfortunately, we are totally out of time,\" followed by \"my apologies to Matt Damon.\" Damon appeared angry but both performers have since indicated that their faux-feud is a joke.[28]\n\nIn February 2008, Kimmel showed a mock music video with a panoply of stars called \"I'm Fucking Ben Affleck\",[29] as \"revenge\" after his then-girlfriend Sarah Silverman and Damon recorded a similar video titled \"I'm Fucking Matt Damon\". Silverman's video originally aired on Jimmy Kimmel Live! and became an \"instant YouTube sensation.\"[30] Kimmel's \"revenge\" video featured himself, Ben Affleck, and a large lineup of stars, particularly in scenes spoofing the 1985 \"We Are the World\" video: Brad Pitt, Don Cheadle, Cameron Diaz, Robin Williams, Harrison Ford, Dominic Monaghan, Benji Madden and Joel Madden from Good Charlotte, Lance Bass, Macy Gray, Josh Groban, Huey Lewis, Perry Farrell, Christopher Mintz-Plasse, Pete Wentz, Meat Loaf, Rebecca Romijn, Christina Applegate, Dom Joly, Mike Shinoda, Lauren Conrad, and Joan Jett, among others.\n\nAfter this, Kimmel's sidekick, Guillermo, appeared in a spoof of The Bourne Ultimatum, which starred Damon. He was then chased down by Damon, who was cursing about Kimmel being behind all this. Guillermo also stopped Damon on the red carpet one time and, before he could finish the interview, said, \"Sorry, we are out of time.\" The most recent encounter was titled \"The Handsome Men's Club\" which featured Kimmel, along with the \"Handsome Men\", who were: Matthew McConaughey, Rob Lowe, Lenny Kravitz, Patrick Dempsey, Sting, Keith Urban, John Krasinski, Ethan Hawke, Josh Hartnett, Tony Romo, Ted Danson, Taye Diggs, Gilles Marini, and Ben Affleck, speaking about being handsome and all the jobs that come with it. At the end of the skit, Kimmel has a door slammed in his face by Damon, who says they have run out of time and laughs sinisterly. Jennifer Garner also makes a surprise appearance. As a tradition, celebrities voted off Dancing with the Stars appear on Jimmy Kimmel Live!, causing Kimmel to describe himself as \"the three-headed dog the stars must pass on their way to No-Dancing Hell.\"\n\nControversy\n\nIn October 2013, a new segment of the show, \"Kids Table\", showcased five- and six-year-olds discussing the U.S. government shutdown and U.S. debts. When one of the children suggested \"killing all the people in China\" as a way of resolving the U.S. debt, Kimmel responded that that was \"an interesting idea\" and soon jokingly asked a followup: \"Should we allow the Chinese to live?\"[31] The incident triggered discussions and protests on Internet, even from Mainland China. In an October 25 letter to a group called the 80-20 Initiative, which identifies itself as a pan-Asian-American political organization, ABC apologized for the segment, saying \"We would never purposefully broadcast anything to upset the Chinese community, Asian community, anyone of Chinese descent or any community at large.\"[31][32]\n\nMore than a hundred people took to the streets in San Francisco on October 28 to protest the show and demand \"a more elaborate apology\" and that Kimmel be fired.[32] On that day's broadcast, Kimmel addressed the controversy personally, saying: \"I thought it was obvious that I didn't agree with that statement, but apparently it wasn't ... So I just wanted to say, I'm sorry, I apologize.\"[33] Despite the apologies from ABC and Kimmel, protests continued. A White House petition was created to investigate the incident and reached the 100,000 signatures needed to require a response from the White House.[34] The Congressional Asian Pacific American Caucus denounced the incident and demanded a formal apology from ABC.[35]\n\nOther television work\n\nIn spring 1996, Kimmel appeared as \"Jimmy the Fox Guy\" in promos on the Fox Network. His other television work included being the on-air football prognosticator for Fox NFL Sunday for four years. He has had numerous appearances on other talk shows, including Live with Regis and Kelly, The Howard Stern Show, The Ellen DeGeneres Show, and the Late Show with David Letterman.\n\nHe has appeared on The Late Show five times, most recently in 2010. Kimmel served as roastmaster for the New York Friars' Club Roast of Hugh Hefner and the Comedy Central Roast of Pamela Anderson. He has appeared on ABC's Dancing with the Stars.\n\nIn August 2006, ABC announced that Kimmel would be host of their new game show Set for Life.[36] The show debuted on July 20, 2007. On April 6, 2007, Kimmel filled in for Larry King on Larry King Live. That particular broadcast dealt with paparazzi. Kimmel reproached Emily Gould, an editor at Gawker.com, for the site's alleged stalking of celebrities. On July 8, 2007, Kimmel managed the National League in the 2007 Taco Bell All-Star Legends and Celebrity Softball Game in San Francisco. He played in the game in 2004 and 2006 (in Houston and Pittsburgh, respectively). On July 11, 2007, Kimmel, along with basketball player LeBron James, hosted the 2007 ESPY Awards. The show aired on ESPN on July 15, 2007. Kimmel hosted the American Music Awards on ABC five times, in 2003, 2004, 2006, 2007, and 2008.\n\nKimmel guest-hosted Live with Regis and Kelly during the week of October 22–26, 2007, commuting every day between New York and Los Angeles. In the process, he broke the Guinness World Record for the longest distance (22,406 miles (36,059 km)) traveled in one work week.[37] Kimmel himself has questioned the record, suggesting that a world leader or the Pope must actually hold the record.[38]\n\nKimmel has performed in several animated films, often voicing dogs. His voice appeared in Garfield: The Movie and Road Trip, and he portrayed Death's Dog in the Family Guy episode \"Mr. Saturday Knight\"; Family Guy creator Seth MacFarlane later presented Kimmel with a figurine of his character on Jimmy Kimmel Live! Kimmel also did voice work for Robot Chicken. Kimmel's cousin Sal Iacono has accepted and won a wrestling match with Santino Marella.\n\nOn January 14, 2010, amid the 2010 Tonight Show host and time slot conflict, Kimmel was the special guest of Jay Leno on The Jay Leno Show's \"10 at 10\" segment. Kimmel derided Leno in front of a live studio audience for taking back the 11:35 pm time slot from Conan O'Brien, and repeatedly insulted Leno. He ended the segment with a plea that Leno \"leave our shows alone\", as Kimmel and O'Brien had \"kids\" while Leno only had \"cars\".[39]\n\nKimmel hosted the 64th Primetime Emmy Awards on September 23, 2012, and the 68th Primetime Emmy Awards on September 18, 2016.[40][41] With the presidential election only weeks away, Kimmel pointed out the role Mark Burnett played in the rise of Trump.[42]\n\nKimmel hosted the 89th edition of the Academy Awards ceremony on February 26, 2017.[43] He returned as host for the 90th edition on March 4, 2018.[44]\n\nIn June 2018, Kimmel was challenged by U.S. Senator Ted Cruz to a one-on-one basketball game after Kimmel compared Cruz's appearance to that of a blobfish. Kimmel accepted and the game (known as the Blobfish Basketball Classic) was scheduled to take place at Texas Southern University on June 16, with the loser donating $5,000 to the non-political charity of the winner's choice.[45] Cruz defeated Kimmel 11–9, and over $80,000 was raised from the game and donated to the charities.[46]\n\nIn November 2018, Kimmel launched his second production company, Kimmelot [1].[47]\n\nKimmel is currently the host and co-executive producer of a celebrity edition of Who Wants to Be a Millionaire, which premiered for the show's 20th anniversary in 2020 and continued into 2021. It premiered on April 8, 2020, on ABC.[48]\n\nControversy\n\nIn June 2020, it was announced that Kimmel would return to host the 72nd Primetime Emmy Awards on September 20, 2020.[49] It was also announced that he was taking the summer off amid a brewing blackface controversy. Later, videos surfaced of Kimmel using racial slurs in a music video. Also, during an interview in 2009 with Megan Fox, Kimmel made a joke in response to Fox speaking out about being sexualized at age 15 by Michael Bay.[50][51]\n\nKimmel later issued an apology for his actions and for taking a long time to address the criticism. He said, \"There is nothing more important to me than your respect, and I apologize to those who were genuinely hurt or offended by the makeup I wore or the words I spoke.\" Kimmel explained the blackface was part of a recurring impression of basketball player Karl Malone that continued on The Man Show: \"We hired makeup artists to make me look as much like Karl Malone as possible. I never considered that this might be seen as anything other than an imitation of a fellow human being, one that had no more to do with Karl's skin color than it did his bulging muscles and bald head.\" He also denied that his going on vacation was due to the blackface controversy, saying the vacation had been planned for over a year; he has since made it a tradition to have guest hosts for the talk show each year in July and August and take the summer off. He did not address the interview with Megan Fox.[52]\n\nBooks\n\nIn July 2019, Kimmel released his first book, The Serious Goose, an interactive children's picture book featuring his own illustrations that tasks readers with helping to make the serious goose smile.[53]\n\nInfluences\n\nKimmel's biggest influences in comedy are David Letterman and Howard Stern.[54][55] Kimmel has said of Letterman, \"His show was just so weird and different. I'd never seen anything like it. I didn't know anyone who had a sense of humor like that.\"[56] Kimmel has often joked that the only reason he got into show business was to be friends with Letterman; he has also questioned why anybody would watch his show instead of Letterman's.[57]\n\nKimmel wrote a piece for Time about his love for Letterman, saying:\n\nAs I write this, there are only ten shows left before the funniest, most inventive and smartest man who ever wore an Alka Seltzer suit goes fishing for good. None of us who discovered Dave on our own and claimed him as our own will ever be able to satisfactorily explain to the younger people who didn't what he did, what he meant and what he means. I guess it doesn't matter. It's only an exhibition, not a competition. Thanks Dave. For whatever it's worth, you're my favorite.[58]\n\nPersonal life\n\nKimmel is a practicing Catholic.[59] He has spoken publicly of being a narcoleptic.[60]\n\nKimmel married Gina Maddy in 1988; they divorced in 2002.[61] Their daughter Katherine was born in 1991 and their son Kevin was born in 1993.[62][1] He had a relationship with comedian Sarah Silverman from 2002 to March 2009.[63]\n\nKimmel started dating Molly McNearney, a co-head writer for Jimmy Kimmel Live, in October 2009.[64] They were engaged in August 2012[61][65] and married in July 2013.[66] Their daughter Jane was born in July 2014.[67]\n\nTheir second child, William \"Billy\" John, was born on April 21, 2017.[68] He was born with a rare congenital heart defect,[69] tetralogy of Fallot (TOF) with pulmonary atresia,[70][71] which was first detected when he had a purplish appearance at three hours after birth. He underwent successful surgery at three days of age.[72][73] The first guests Kimmel had when his show returned following his son's birth were cardiac surgeon Mehmet Oz, who explained the condition,[74] and snowboarder Shaun White, who was born with TOF.[75] Kimmel later cited his son's condition in a monologue criticizing a previous guest, Senator Bill Cassidy, who had co-authored a congressional healthcare bill, for not living up to the \"Jimmy Kimmel test\" regarding access for patients with preexisting conditions. The monologue was widely discussed as part of the wider debate about the American healthcare system.[76][77][78]\n\nIn 2020, Kimmel learned that he and Martha Stewart are cousins through a genealogy report on the TV show Finding Your Roots.[79]\n\nInterests\n\nKimmel plays the bass clarinet, and was a guest performer at a concert in Costa Mesa, California, on July 20, 2008, featuring The Mighty Mighty Bosstones, performing with the group on the song \"The Impression That I Get\".[80]\n\nKimmel co-founded the annual Los Angeles Feast of San Gennaro, a New York City annual tradition, and co-hosted the eighth annual Los Angeles version in 2009.[81]\n\nIn 2018, he fundraised for U.S. Senate candidate Jacky Rosen.[82]\n\nHe has served as the Honorary Mayor of Dildo, Newfoundland, since August 2019.[83]\n\nIn 2021, Kimmel became the title sponsor of the LA Bowl, a college football bowl game to be played annually in Los Angeles. The game became officially known as the Jimmy Kimmel LA Bowl.[84][85]\n\nFilmography\n\nFilm\n\nTelevision\n\nAs executive producer\n\nVideo games\n\nYear Title Voice role Notes 2012 Call of Duty: Black Ops II Himself Appeared on his own talk show\n\nDiscography\n\nAwards and nominations", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Audio_a.svg/21px-Audio_a.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/21px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/JimmyKimmelHWOFJan2013.jpg/220px-JimmyKimmelHWOFJan2013.jpg", "https://upload.wikimedia.org/wikipedia/commons/0/01/Jimmy_Kimmel_in_2015.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Jimmy_Kimmel_and_Cousin_Sal.jpg/220px-Jimmy_Kimmel_and_Cousin_Sal.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/19px-Video-x-generic.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/19px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/JimmyKimmelHWOFSept2012.jpg/220px-JimmyKimmelHWOFSept2012.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Flag_of_Los_Angeles_County%2C_California.svg/21px-Flag_of_Los_Angeles_County%2C_California.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Jimmy_Kimmel_in_2015.jpg/220px-Jimmy_Kimmel_in_2015.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/21px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/SMirC-laugh.svg/19px-SMirC-laugh.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Radio_icon.png/21px-Radio_icon.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/01/Jimmy_Kimmel_in_2015.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jimmy_Kimmel", "title": "Jimmy Kimmel", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/0/01/Jimmy_Kimmel_in_2015.jpg", "width": 640, "height": 871}, "title": "Jimmy Kimmel - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}