{"url": "https://en.wikipedia.org/wiki/Kourtney_Kardashian", "text": "\"Kourtney\" redirects here. For other people with the same name, see Courtney . For other uses, see Courtney (disambiguation)\n\nAmerican media personality (born 1979)\n\nKourtney Mary Kardashian (born April 18, 1979) is an American media personality and socialite. In 2007, she and her family began starring in the reality television series Keeping Up with the Kardashians. Its success led to the creation of spin-offs including Kourtney and Khloé Take Miami[3] and Kourtney and Kim Take New York.[4]\n\nWith sisters Kim and Khloé, Kardashian is involved in the retail and fashion industries. They have launched several clothing collections and fragrances, and additionally released the book Kardashian Konfidential in 2010. Kourtney launched her own website called Poosh in early 2019.\n\nKardashian and her siblings are popular on social media and endorse products such as waist slimming pants, beauty products, Coca-Cola, and prescription drugs, for which they are paid (as of 2016) between $75,000 and $300,000 per post on Instagram, Facebook, and Twitter.[5][6][7]\n\nEarly life [ edit ]\n\nKourtney Mary Kardashian was born in Los Angeles, California, on April 18, 1979, to Robert Kardashian and Kris (née Houghton).[8] She has two younger sisters, Kim and Khloé, and a younger brother, Rob.[9] In 1991, her parents divorced and her mother married Bruce Jenner, the 1976 Summer Olympics decathlon winner (in 2015, Jenner changed her name to Caitlyn[c]), later that year.[11] Through their marriage, Kardashian gained stepbrothers Burton \"Burt\", Brandon, and Brody; stepsister Casey; and later half-sisters Kendall and Kylie.[12]\n\nKardashian attended Marymount High School, a Roman Catholic all-girls school in Los Angeles. Following graduation, she moved to Dallas, Texas, to attend Southern Methodist University for two years. Kardashian then lived in Tucson, Arizona, where she graduated from the University of Arizona with a bachelor's degree in Theatre Arts and a minor in Spanish. Her classmates included Nicole Richie and Luke Walton.[13] In 1994, her father garnered public attention as an additional defense lawyer for football player O. J. Simpson during his murder trial.\n\nCareer [ edit ]\n\nKardashian first became known to reality-television audiences on the 2005 series, Filthy Rich: Cattle Drive, on which she earned money for charity. In February 2007, a sex tape made by her sister Kim and former boyfriend Ray J in 2003, Kim Kardashian, Superstar, was leaked, which largely contributed to her rise to prominence.[14][15] Later that year, Kardashian, in addition to her mother Kris; her stepfather Bruce (now known as Caitlyn);[16] her siblings Kim, Khloé, and Rob; and half-sisters Kendall and Kylie were commissioned to star in the reality television series Keeping Up with the Kardashians.[17] The series proved successful for E!, the network on which it is broadcast, and led to several spin-offs, including Kourtney and Khloé Take Miami, Khloé & Lamar, and Kourtney and Kim Take New York .[18]\n\nKardashian and her mother opened children's clothing boutiques called Smooch in the Los Angeles area and New York City; the boutiques carry the brand Crib Rock Couture. With sisters Kim and Khloe, Kardashian co-owns and operates D-A-S-H, a clothing boutique in Los Angeles, Miami, New York City, and a pop-up store in the Hamptons.[13]\n\nIn the spring of 2010, Kardashian and her sisters released a clothing line for Bebe.[19][20][21] In August 2010, Kardashian announced that she and her sisters were working on another clothing line called K-Dash, sold on QVC.[22] Kardashian and her sisters created a sunless tanner called Kardashian Glamour Tan in 2010.[23] Kardashian wrote the book Kardashian Konfidential with her sisters Khloe and Kim; it was released in November 2010.[24]\n\nKardashian made her acting debut with a guest appearance on the ABC soap One Life to Live on March 28, 2011, appearing as attorney Kassandra Kavanaugh.[25] Kardashian, who had grown up watching the soap opera and described her appearance as the realization of a \"lifelong dream,\" had reservations about her acting debut, stating: \"I'd thought I'd only have two lines. But my script is so long... I'm not an actress.\"[26][27] Her performance was met with negative reviews from critics.[28] In November 2011 she released a novel Dollhouse along with sisters Khloe and Kim.[29]\n\nIn September 2012, she and younger sister Kim created another spinoff reality television series, Kourtney and Kim Take Miami, which began airing in January 2013. It features their mother Kris Jenner, Kardashian's boyfriend at the time, Scott Disick, and sister Khloé Kardashian.[30][31]\n\nThe Kardashian sisters were spokeswomen for the diet supplement Quick Trim, for weight loss. In March 2012 the three sisters were named in a $5 million class-action lawsuit against QuickTrim.[32] The complaint, filed in the United States District Court for the Southern District of New York, accused the Kardashians, along with QuickTrim's manufacturer Windmill Health Products; the retailer GNC; and others in the sales and marketing chain, of false and deceptive marketing. The plaintiffs, from several states, brought claims under their respective states' consumer protection laws.[33]\n\nKardashian also represents the skincare line PerfectSkin with her sisters, which was developed by Dr. Ron DiSalvo for Perfect Science Labs.[34] The three sisters also released a 20-piece collection of jewelry line for the company Virgins, Saints, and Angels, in March 2010. The jewelry is reflective of their partial Armenian background.[35] In 2017, Kardashian launched her first solo fashion line as part of a collaboration with the site PrettyLittleThing. According to the website, the 32-piece line was inspired by Studio 54, classical Hollywood cinema, and the 1970s.[36] She endorsed Calvin Klein along with her sisters in 2018. In the same year, she partnered with her younger half-sister Kylie to launch a collection of lipsticks and palettes with Kylie Cosmetics.\n\nOn March 5, 2019, Kardashian released her lifestyle website named Poosh.[37] In November 2019, Kardashian partnered with her sisters Kim and Khloé to create three new perfumes (one for each sister) for Kim's brand KKW Fragrance. The collection introduces Yellow Diamond (Kourtney's fragrance), Pink Diamond (Khloé's fragrance) and pure Diamond (Kim's fragrance). Each scent is individually inspired by and unique to her, Kim, and Khloé.\n\nPersonal life [ edit ]\n\nIn October 2019, Kardashian and her children were baptized in an Armenian Apostolic ceremony at the Etchmiadzin Cathedral in Vagharshapat, Armenia. During the ceremony, she was christened with the Armenian name Gayane.[38]\n\nIn October 2020, Kardashian posted messages and retweets in support of Armenia and Artsakh in regards to the Nagorno-Karabakh war.[39]\n\nRelationships and children [ edit ]\n\nKardashian was in an on-again, off-again relationship with Scott Disick from 2006 to 2015.[40] The two met at mutual friend Joe Francis's house party in Mexico.[41] Kardashian has three children with Disick: son Mason Dash Disick (born December 14, 2009), daughter Penelope Scotland Disick (born July 8, 2012),[42][43] and son Reign Aston Disick (born December 14, 2014).[44]\n\nKardashian and Disick's relationship has been shown on Keeping Up With the Kardashians and its numerous spin offs. Kardashian's pregnancies and the births of all three of her children have also been featured on the show.[45][46]\n\nIn 2007, during the first season of Keeping Up with the Kardashians while on a trip to Las Vegas, Disick and Kardashian were going to get married, but her mother Kris convinced her to wait.[47]\n\nIn early 2010, the couple temporarily moved to Miami with their son and Kardashian's sister Kim. During this time, Kardashian believed Disick had an alcohol problem. After regularly attending therapy and temporarily giving up alcohol, Disick and Kardashian reconciled and they continued their relationship in mid-2010.[48]\n\nIn 2011, during the final episode in the first season of Kourtney and Kim Take New York, Disick purchased an engagement ring and planned to propose to Kardashian during an evening meal in New York City. However, when Disick asked Kardashian's opinion on marriage, she responded with, \"If things are so good now...why would we want to change that?\", so he did not propose.[49]\n\nKardashian was in another on-again, off-again relationship with model Younes Bendjima from 2016 to 2020.[50]\n\nIn January 2021, it was confirmed that Kardashian was in a relationship with musician Travis Barker.[51][52] In October 2021, Kardashian and Barker got engaged after he proposed to her at a beachside hotel in Montecito, California.[53] They had an unofficial wedding on April 3, 2022 in Las Vegas, after the 64th Annual Grammy Awards.[54] The couple officially married on May 15, 2022 in Santa Barbara, California,[55] with a religious wedding ceremony in Portofino, Italy on May 22, 2022.[56]\n\nFilmography [ edit ]\n\nAs actress [ edit ]\n\nYear Title Role Notes 2011 One Life to Live Kassandra Kavanaugh Episode: \"March 28, 2011\" 2021 He's All That Jessica Miles Torres Movie\n\nAs herself [ edit ]\n\nWritten works [ edit ]\n\nNotes [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Scott_Disick_%26_Kourtney_Kardashian_2010.jpg/220px-Scott_Disick_%26_Kourtney_Kardashian_2010.jpg", "https://upload.wikimedia.org/wikipedia/commons/3/34/Kourtney_Kardashian_in_2019_3.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Kourtney_Kardashian_in_2019_3.jpg/220px-Kourtney_Kardashian_in_2019_3.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/34/Kourtney_Kardashian_in_2019_3.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Kourtney_Kardashian", "title": "Kourtney Kardashian", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/3/34/Kourtney_Kardashian_in_2019_3.jpg", "width": 640, "height": 906}, "title": "Kourtney Kardashian - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}