{"url": "https://www.elitedaily.com/p/3-signs-that-justin-bieber-selena-gomez-were-never-meant-to-last-that-no-one-noticed-9723535", "text": "You know by now that Justin Bieber and Hailey Baldwin are engaged to be married. What you probably don’t know is that this was a long time coming. And that may seem surprising given how intense Bieber’s love for Selena Gomez has been all these years. Bieber and Gomez dated on and off from 2011 to 2015, and they reunited briefly in the spring of 2018. So, Bieber’s engagement news is a shock to the system for many Jelena fans around the world. Despite their obvious draw to each other, there were plenty of signs that Justin Bieber and Selena Gomez weren't meant to last.\n\nAll the tell-tale signs have been there all along. It’s just that fans (and probably even Bieber and Gomez themselves) were totally blind to them. Naturally, fans want to root for young love, which Bieber and Gomez shared. And it’s very likely that the two pop stars were so struck by their puppy love that they couldn’t quite see the end coming.\n\nBut the end did come. And now Bieber is engaged and Gomez is out here living her best life.\n\nSince all this has been moving so fast and there’s so much to keep up with, I’ve dug around a little to understand why Bieber and Gomez didn’t last.\n\nJason Merritt/Getty Images Entertainment/Getty Images\n\nHere are all the signs that were staring Jelena fans in the face for years:\n\n1. Bieber and Gomez’s Love Was Young & Impatient\n\nEven Bieber said so himself. In a 2015 interview with Complex magazine, Bieber explained that his relationship with Gomez was “too much” to handle at such a young age:\n\nI moved in with my girlfriend when I was 18. Started my own life with her. It was a marriage kind of thing. Living with a girl, it was just too much at that age. But we were so in love. Nothing else mattered. We were all about each other. But when it’s like that and you get your value from that, people will always disappoint you. Your girl or your dude, they’re always going to disappoint you.\n\nHe also told the magazine that he felt his identity was wrapped up in Gomez and that the relationship wasn’t as ideal as everyone might have thought it was:\n\nYour full identity can't be in that person. My identity was in her. Her identity was in me. When stuff would happen, I would lose my freakin' mind, and she would lose her mind, and we would fight so hard because we were so invested in each other.\n\nAnd on top of all that, he explained that for him, love was a conscious choice he had to make time and time again:\n\nLove is a choice. Love is not a feeling. People have made it seem in movies that it's this fairy tale. That's not what love is. You're not gonna want to love your girl sometimes but you're gonna choose to love her. That's something in life that I had to figure out.\n\nSo, the Bieber-Gomez relationship was definitely not all it was cracked up to be, even back in 2012 when they were living together.\n\nChristopher Polk/Getty Images Entertainment/Getty Images\n\n2. They Resorted To Dramatics During Their Breakups\n\nIt’s definitely no secret that Bieber and Gomez would break up only to make up. It happened countless times, and that’s definitely a sign that they weren’t sure about where the relationship was going. They just couldn’t make up their minds about whether they wanted to be together or not.\n\nTo add to that, they often resorted to dramatics during their breakups, which says it all, really.\n\nFor example, when Bieber was spotted out in Paris with Kendall Jenner back in 2014, Gomez took to Twitter to vent, as some fans took it.\n\nOn another occasion, in August 2016, Gomez decided to weigh in on Bieber’s then relationship with Sofia Richie.\n\nHere’s how it went down: Bieber was posting photos of Richie on Instagram only to receive backlash from fans for moving on from his relationship with Gomez.\n\nThen, Gomez reportedly commented on an Instagram photo with the following: “If you can't handle the hate then stop posting pictures of your girlfriend lol – it should be special between you two only. Don't be mad at your fans. They love you.”\n\nSo, there seems to have been some drama surrounding their breakups, which isn’t a good look at all. Nevermind the fact that this kind of behavior is unhealthy for everyone involved.\n\n3. Baldwin Was Always In Justin's Life\n\nEven though Bieber’s relationship with Baldwin seemed to come out of nowhere, it makes total sense that they would end up together. The two have known each other for years.\n\nBack in 2014, Baldwin told E! News that she and Bieber have always been close.\n\n“I've known him since I was so young — since I was 13 — and we've just been good friends over the years,\" she said.\n\nThat good friendship turned more romantic in 2016, but their fling died down pretty quickly. According to Bieber, it was because he didn’t want to ruin a good thing.\n\nIn February 2016, Bieber told GQ magazine that Baldwin was important enough for him to wait for the right time to be with her:\n\nI know that in the past I've hurt people and said things that I didn't mean to make them happy in the moment. So now I'm just more so looking at the future, making sure I'm not damaging them. What if Hailey ends up being the girl I'm gonna marry, right? If I rush into anything, if I damage her, then it's always gonna be damaged. It's really hard to fix wounds like that. It's so hard … I just don't want to hurt her.\n\nSo, Bieber had ideas of marriage even back then, which puts his subsequent reconciliation with Gomez into a completely different perspective. Maybe it was never about trying to make his relationship with Gomez work. Maybe it was about figuring out his feelings and deciding whether Gomez was the one over Baldwin.\n\nIn any case, Bieber and Gomez didn't last, and now there's the Bieber-Baldwin wedding to look forward to. Exciting times!", "images": ["https://imgix.bustle.com/uploads/getty/2018/7/13/20246962-4f96-4c7f-8229-204aae2458c4-getty-133628146.jpg?w=414&h=277&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/9/27/b3aec6a9-4af0-438d-9ea1-82440195ec72-getty-1241334467.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.4853&fp-y=0.1609", "https://imgix.bustle.com/uploads/getty/2018/7/13/8364e457-fbae-4691-88db-2915cc1d199f-getty-122720090.jpg?w=414&h=349&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2018/7/11/40ce5f59-871a-432c-9d05-267ea63cc4fc-getty-120069904.jpg?w=374&h=353&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2022/10/8/4e8798bb-b99d-4ec4-af4a-8b62d04a4927-getty-1395076942.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5&fp-y=0.3412", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2022/9/30/73e46c8b-f844-441a-b50a-f1b9417b399d-getty-1385062792.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.512&fp-y=0.36", "https://imgix.bustle.com/uploads/getty/2018/7/11/40ce5f59-871a-432c-9d05-267ea63cc4fc-getty-120069904.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/7/11/40ce5f59-871a-432c-9d05-267ea63cc4fc-getty-120069904.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/3-signs-that-justin-bieber-selena-gomez-were-never-meant-to-last-that-no-one-noticed-9723535", "title": "3 Signs That Justin Bieber & Selena Gomez Were Never Meant To Last That No One Noticed", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "article": {"publisher": "https://www.facebook.com/EliteDaily"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/3-signs-that-justin-bieber-selena-gomez-were-never-meant-to-last-that-no-one-noticed-9723535", "type": "article", "title": "3 Signs That Justin Bieber & Selena Gomez Were Never Meant To Last That No One Noticed", "description": "You know by now that Justin Bieber and Hailey Baldwin are engaged to be married. What you probably don’t know is that this was a long time coming. And that may seem surprising given how intense Bieber’s love for Selena Gomez has been all these…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/7/11/40ce5f59-871a-432c-9d05-267ea63cc4fc-getty-120069904.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "You know by now that Justin Bieber and Hailey Baldwin are engaged to be married. What you probably don’t know is that this was a long time coming. And that may seem surprising given how intense Bieber’s love for Selena Gomez has been all these…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}