{"url": "http://fortune.com/2018/12/13/taylor-swift-reputation-stadium-tour-netflix/", "text": "Taylor Swift is coming to Netflix in one very big way.\n\nNetflix and Swift announced on Thursday that a film centering on her wildly popular Reputation Stadium Tour will be coming to Netflix on New Year’s Eve. The film features Swift’s full concert, including 19 songs and clips from her tour across the world. It’ll be available at 12:01 a.m. PT on December 31.\n\nThe Reputation Stadium Tour was the highest-grossing tour of all time with $266.1 million in sales. It broke attendance records around the world and further solidified Swift’s position as the preeminent musical performer in the world.\n\nFor Netflix (NFLX), nabbing the exclusive rights to the tour is major. For one, having exclusive streaming rights to the world’s most popular artist will only bolster Netflix’s appeal and could attract the legion of Swift fans who might not currently subscribe to Netflix.\n\nFrom a competitive standpoint, Netflix’s Swift deal is a clear blow to Apple, which has been building out its video content and investing heavily in music. Just last year, in fact, Apple (AAPL) acquired the rights to the concert film that centered on Swift’s 1989 Tour. It proved to be wildly successful on Apple Music.\n\nAre you ready for it? @taylorswift13's reputation Stadium Tour is coming to Netflix on New Year's Eve! #NetflixNewsWeek pic.twitter.com/ifuM31Mzh0 — See What's Next (@seewhatsnext) December 13, 2018\n\nGiven that, and considering Swift’s success, the concert film deal couldn’t have come cheap to Netflix. However, neither Swift nor Netflix have said how much Swift will make to provide the streaming rights to Netflix. Earlier this year, Netflix raised $1.9 billion in debt financing to acquire more content as it prepares to face off with an increasing number of streaming competitors, including Disney (DIS) and WarnerMedia. The company plans to raise billions more in a bond offering.", "images": ["https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1242585998-e1665028070836.jpg?w=256&q=75", "https://content.fortune.com/wp-content/uploads/2018/12/GettyImages-1064050490-e1544712420961.jpg?resize=1200,600", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243767517-e1665076497696.jpg?w=256&q=75", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243581035-e1665068106964.jpg?w=256&q=75"], "top_img": "https://content.fortune.com/wp-content/uploads/2018/12/GettyImages-1064050490-e1544712420961.jpg?resize=1200,600", "keywords": [], "authors": [], "canonical_link": "https://fortune.com/2018/12/13/taylor-swift-reputation-stadium-tour-netflix/", "title": "Taylor Swift’s Reputation Stadium Tour Movie Will Air New Year’s Eve on Netflix", "meta_data": {"viewport": "width=device-width", "msapplication-TileColor": "#ffc40d", "theme-color": "#ffffff", "description": "Taylor Swift's Reputation Stadium Tour took the world by storm. And now it's coming to Netflix on New Year's Eve.", "keywords": "Taylor Swift, Netflix, Taylor Swift tour on Netflix, Taylor Swift Reputation Stadium Tour, Reputation Stadium Tour, Taylor Swift Reputation Stadium Tour on Netflix", "og": {"url": "https://fortune.com/2018/12/13/taylor-swift-reputation-stadium-tour-netflix/", "type": "article", "title": "Taylor Swift's Reputation Stadium Tour Movie Will Air New Year's Eve on Netflix", "description": "Another way to ring in the new year.", "site_name": "Fortune", "image": "https://content.fortune.com/wp-content/uploads/2018/12/GettyImages-1064050490-e1544712420961.jpg?resize=1200,600", "width": 1024, "height": 683}, "twitter": {"card": "summary_large_image", "title": "Taylor Swift's Reputation Stadium Tour Movie Will Air New Year's Eve on Netflix", "description": "Another way to ring in the new year.", "image": "https://content.fortune.com/wp-content/uploads/2018/12/GettyImages-1064050490-e1544712420961.jpg?resize=1200,600", "url": "https://fortune.com/2018/12/13/taylor-swift-reputation-stadium-tour-netflix/"}, "next-head-count": 32}, "movies": [], "publish_date": 1544659200.0, "source": "http://fortune.com", "summary": ""}