{"url": "https://www.usatoday.com/story/life/entertainthis/2016/06/18/celebrity-book-club-summer-reads/85889140/", "text": "Celebrity book club: Summer reads\n\nSummertime and the reading is, well, mostly easy. Turns out, some of our favorite celebrities have some pretty impressive reading goals. But don't worry, there is also plenty of fun fiction too. Our intrepid band of bookworms is nothing if not eclectic in their literary habits. So if you are in the need for some suggestions on what to read next, here is a round up of what the CBC has been (and plans on) reading this summer.\n\nReese Witherspoon\n\nAs usual, Reese is all business, forget an actual reading list, she already has the books. And judging from what we see, she has a pretty interesting summer of reading ahead of her.\n\nMy kind of #SundayFunday ☺️📚 #ForTheLoveOfReading #RWBookClub A photo posted by Reese Witherspoon (@reesewitherspoon) on May 15, 2016 at 3:30pm PDT\n\nA quick rundown of the titles, The Clasp by Sloane Crosley, Wildflower by Drew Barrymore, The Story of a New Name by Elena Ferrante, we believe the next one is The Psychopath Test: A Journey Through the Madness Industry by Jon Ronson, The Testament of Mary by Colm Tobin, So You've been Perfectly Shamed by Jon Ronson and Why Not Me by Mindy Kaling. A pretty eclectic bunch of titles, from fiction to non-fiction to memoirs.\n\nEarlier in the summer, Reese also read and recommended fellow club member Kimberly Williams Paisley's Where the Light Gets In.\n\nLena Dunham\n\nThe actress and newfound publisher spent the Memorial Day weekend with the novel The Innocents and Others by Dana Spiotta and Hilary Mantel's memoir Giving Up the Ghost. But no word on other books she plans to read this summer. You would have to check out her current Lit Thursday suggestions at her Lenny Letter.\n\nMemorial Day hang with my girl gang A photo posted by Lena Dunham (@lenadunham) on May 30, 2016 at 10:34am PDT\n\nWhile we don't have her future reads, we did find out that Dunham is a big fan of Nora Ephron, who was no stranger to our best-selling books list. We have a feeling she would heartily recommend each and every title.\n\nThat Christmas when @jennikonner got me every Nora book, first edition, thus creating the most sacred corner of my home A photo posted by Lena Dunham (@lenadunham) on Jun 11, 2016 at 12:15pm PDT\n\nSarah Michelle Gellar\n\nWe have a newbie in the club this week, and we hope she will continue to share her favorite reads. Sarah Michelle Gellar - yes can't not say all three names - posted about a little something called #Readathon2016 a few weeks ago. How did we miss this? Well, thanks to SMG, we will know to look for next year's #Readathon.\n\nSMG' is currently reading, Eligible by Curtis Sittenfeld, Orphan Train by Christian Baker Kline and one she is reading with her daughter Charlotte, Harry Potter and the Prisoner of Azkaban by J.K. Rowling.\n\nEmma Roberts\n\nHerculean is the word that comes to mind when perusing this list. And as always, Emma impressive reading goals. For your reading pleasure - as well as eyesight - we include the titles and authors from her hand written list below.\n\nWho's with us? @camasutra A photo posted by Emma Roberts (@emmaroberts) on May 13, 2016 at 11:23pm PDT\n\nThe Social Contract by Jean Jacques Rousseau, A Little Life by Hanya Yanagirhara, Colorless Tsukuru Tazaki and His Years of Pilgrimage by Haruki Maurakami, Of Time and an Island by John Keats, Play It As It Lays by Joan Didion, The Myth of Sisyphus by Albert Camus, Franny and Zooey by J. D. Salinger, The Goldfinch by Donna Tartt, In Search of Lost Time by Marcel Proust, The Sport of Kings by C.E. Morgan, The Atomic Weight of Love by Elizabeth J. Church and What I Talk About When I Talk About Running by Haruki Murakami. Yep, that is a mighty impressive list.\n\nBut don't be intimidated, Emma's recommendations run the gamut. If you prefer something on the lighter side of lit we agree with Emma and recommend Sweetbitter by Stephanie Danler,\n\nIf you don't already have a copy of #Sweetbitter you must get it 👓 New favorite book 📕 New favorite author @smdanler 💗 A photo posted by Emma Roberts (@emmaroberts) on Jun 13, 2016 at 7:10pm PDT\n\nKimberly Paisley Williams\n\nAs usual, KPW (sorry, but three names means you get to go by your initials, just ask SMG) does not disappoint and has adult and children's book recommendations.\n\nFirst there is Time and Again by Jack Finney and My Brilliant Friendby Elena Ferrante for adults...\n\nThank you @sstangland for one of my favorite #summerreads Love this book! A photo posted by Kimberly Williams-Paisley (@kimberlywilliamspaisley) on Jun 10, 2016 at 7:54am PDT\n\nMy brilliant friend @parnassusbooks recommended this book and I'm loving it #Readathon #friendship #almostsummer A photo posted by Kimberly Williams-Paisley (@kimberlywilliamspaisley) on May 21, 2016 at 7:33am PDT\n\n... and for children, A Long Way from Chicago by Richard Peck.\n\nWe really enjoyed the first book we chose for #summer reading! A Long Way From Chicago by Richard Peck #newberry #childrenslit A photo posted by Kimberly Williams-Paisley (@kimberlywilliamspaisley) on Jun 4, 2016 at 6:26am PDT\n\nEmma Watson\n\nLast, but certainly not least, we have Emma's Our Shared Shelf's book club. Emma has begun recommending the club's picks on Instagram.\n\nThe most recent book is Persepolis by Marjane Satrapi. But it has been a while since we have gotten the gang together and her book group also read The Argonauts by Maggie Nelson and, one of our personal favorites, How To Be a Woman by Caitlin Moran.\n\n#Repost @oursharedshelf ・・・ June book! #persepolis #marjanesatrapi #OurSharedShelf A photo posted by Emma Watson (@emmawatson) on Jun 1, 2016 at 2:54pm PDT\n\n#Repost @oursharedshelf ・・・ May book :) #oursharedshelf #MaggieNelson #TheArgonauts A photo posted by Emma Watson (@emmawatson) on May 17, 2016 at 4:41am PDT\n\nA photo posted by Emma Watson (@emmawatson) on Apr 26, 2016 at 11:43am PDT\n\nHappy Reading!", "images": ["http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/cd7f673d2e6ea2447587eed805d63d95d9585683/c=385-12-1018-645/local/-/media/2016/03/11/USATODAY/USATODAY/635933220963441219-cbc.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9197a560b995455d82dc4983e614ed202e523c43/c=311-0-1077-766/local/-/media/2016/01/28/USATODAY/USATODAY/635895848501142407-celebbookclub2016.jpg", "https://www.gannett-cdn.com/-mm-/123a9632d20f8337c599f6e9f28314a1e275e3e3/c=3-0-1362-768/local/-/media/2016/06/16/USATODAY/USATODAY/636016931513628479-CelebBookClubSummerReadingGetty.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/-mm-/d571219a6030d36627af35c3c317d1b74374bcf7/c=172-0-1193-768/local/-/media/2016/06/16/USATODAY/USATODAY/636016955925756966-celebsummer.jpg?width=320&height=240", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/123a9632d20f8337c599f6e9f28314a1e275e3e3/c=3-0-1362-768/local/-/media/2016/06/16/USATODAY/USATODAY/636016931513628479-CelebBookClubSummerReadingGetty.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Mary Cadden"], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2016/06/18/celebrity-book-club-summer-reads/85889140/", "title": "Celebrity book club: Summer reads", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/entertainthis/2016/06/18/celebrity-book-club-summer-reads/85889140/life/entertainthis", "theme-color": "#ffffff", "og": {"type": "article", "title": "Celebrity book club: Summer reads", "description": "What our favorite celebrity bookworms are reading and recommending this summer.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/123a9632d20f8337c599f6e9f28314a1e275e3e3/c=3-0-1362-768/local/-/media/2016/06/16/USATODAY/USATODAY/636016931513628479-CelebBookClubSummerReadingGetty.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "news_keywords": "Memorial Day,Kimberly Williams,Reese Witherspoon,Emma Roberts,Sarah Michelle Gellar,Lena Dunham,Emma Watson,Christmas,Drew Barrymore,Mindy Kaling", "description": "What our favorite celebrity bookworms are reading and recommending this summer.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1466204400.0, "source": "https://www.usatoday.com", "summary": ""}