{"url": "https://www.azcentral.com/story/entertainment/television/2018/06/17/what-its-like-audition-abc-bachelor-casting-call/662166002/", "text": "I went to a casting call for 'The Bachelor.' Here's what happened\n\nFor a show that feeds on exposing private affairs and personal heartbreak, the application process for ABC's \"The Bachelor\" doesn't begin to scratch the surface.\n\nPhoenix, along with 15 other cities, was chosen as a casting call site for season 23 of the hit reality-TV dating show. I volunteered to brave the high heels and nervous laughs to see what deep, personal secrets the show would be fishing for.\n\nAs a full disclaimer: I’m a fan of the show. I closely watched the last season, which featured Scottsdale \"Bachelor\" Arie Luyendyk Jr.\n\nNot only is he probably the most-hated man in franchise history, but he gave a dismal showing of his hometown on America’s TV screens every Monday night. Scottsdale turned into a place to go bowling and reminisce on the old days.\n\nNevermind that Luyendyk actually grew up in Paradise Valley.\n\nWhile that season was a bit of a letdown, I didn’t let it shift my belief in the process. The show, now with more spinoffs to keep track of, has captivated audiences season after season, following young hopefuls searching for love.\n\nWas I looking for love? Absolutely not. Not quite like this, at least. But I had to believe there were some women auditioning in the hopes of finding their forever life partner on a reality show.\n\nWhat's in an application\n\nI quickly befriended a young woman in the parking lot of The Scottsdale Resort at McCormick Ranch. We both had recently graduated from Arizona State University and decided to stick together through this journey.\n\nFollowing the trail of nicely dressed women, we wandered into a large ballroom to find what seemed like organized chaos. We were handed an application, a clipboard and a number.\n\nI was No. 72.\n\nA woman at the applications table said she expected about 200 people to filter through the resort by the end of the day. Phoenix has been a frequent destination for the show's casting calls, though few women from the Valley have been in recent seasons.\n\nEverything felt like a test. Candy placed on the application table? Avoid that.\n\nThe ballroom, equipped with a DJ and an open bar, was decorated with women of all ages. Many were dressed to the nines, wearing beautiful dresses, tight fabrics and high heels. My parking-lot friend fit that description, dressed in a tube top and matching skirt with heels much taller than I could ever walk in.\n\nI was wearing a matching top-and-bottom set with bright boots and some accent jewelry. I wore an outfit that I felt matched my personality without trying too hard.\n\nOthers arrived more simply in jeans and T-shirts. A young woman was dressed in a cow costume, clad with sparkly silver shoes, a bold move the producers would either applaud or completely dismiss.\n\nI was half expecting someone to start handing out champagne and offer lines of encouragement, something like, \"Are you ready for your journey to begin?\"\n\nWe took our seats and began filling out a six-page-long application that delved into my dating history, employment and why I was looking for love on a reality TV show.\n\nThe application offered some interesting questions, such as:\n\nWhat accomplishments are you most proud of?\n\nAre you genuinely looking to get married and why?\n\nWhat have you not found yet but would like in a relationship?\n\nThere were also several questions on prior relationships and marriages. The application explicitly asked if we drank alcohol, only to follow up with the next logical question: What's your favorite drink?\n\nMy newfound friend had issues with some of the questions, like what our salary was and what was on our bucket list. We both skipped the question asking if we had any interesting talents.\n\nThe application was coupled with an intense release to agree to everything the producers may do if you get picked for the show. It felt like we were signing our life away, a thought that resonated with many of the applicants sitting around us.\n\nAll in the name of love, though.\n\nInterestingly enough, most people I spoke with who were auditioning had not watched the show before. It seemed strange to me to audition for a process they had never seen on TV before. This would be like someone trying out for \"Survivor\" not knowing you will be trapped on a deserted island.\n\nTo make it on the show, you must be 21 or older, be single and can't have been convicted of a felony. You also can't be running for any type of political office.\n\nA quiet room, a video recording\n\nAfter quite a bit of sitting and waiting, we stood in another line, had a few photos snapped and then were shuffled from the grand ballroom into smaller conference rooms, greeted by a small camcorder and an interviewer.\n\nWe sat as a small group outside, waiting for our names to be called. I made a new friend, who told me she reluctantly agreed to audition after a friend worried about her love life drove her to the resort. She said her friend even tweeted photos to the producers of the show to get their attention.\n\nThe empty room was daunting, but the woman behind the camera was kind. She'd been through her fair share of casting calls before and seemed to know all the right questions to ask to make me feel comfortable about divulging my personal life to a lens.\n\n\"You were great!\" she said. Click.\n\nI wondered if she said that to everyone or if she really meant it.\n\nThe questions were as basic as the rest of the process: talk about your family, where you grew up and your dating history. The video was the most personal part of the process, though it only lasted for about five minutes. The tapes get whisked off to Los Angeles to be viewed by show producers for the next month and a half.\n\nI'm not holding my breath.\n\nWhile I truly had no intentions of getting picked for the show, I did complete the application process honestly.\n\nMost interestingly, almost none of the crew worked for ABC or \"The Bachelor\" directly. A few producers were roaming around, someone told me, but most were kept hidden behind closed doors. There was some secrecy to the whole process, as some girls were taken aside for private interviews and on special photo shoots.\n\nWill any of them make it on the next season?\n\nStay tuned.\n\nPHOTOS: 'THE BACHELOR': ARIE LUYENDYK JR.\n\nMore on 'The Bachelor':", "images": ["https://www.gannett-cdn.com/-mm-/7563691c5020960568970402a6147d870768634e/c=0-0-1200-678/local/-/media/2018/06/16/Phoenix/Phoenix/636647725324333863-Becca-Smouse-auditions-for-The-Bachelor-6.jpg?auto=webp&format=pjpg&width=1200", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/d8734a3ad1ad767d942faa5fdfc209813e0d5887/c=81-0-551-470/local/-/media/2016/03/02/Phoenix/Phoenix/635925465699620668-app.png", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/7563691c5020960568970402a6147d870768634e/c=0-0-1200-678/local/-/media/2018/06/16/Phoenix/Phoenix/636647725324333863-Becca-Smouse-auditions-for-The-Bachelor-6.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Becca Smouse"], "canonical_link": "https://www.azcentral.com/story/entertainment/television/2018/06/17/what-its-like-audition-abc-bachelor-casting-call/662166002/", "title": "I went to a casting call for 'The Bachelor.' Here's what happened", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=815248536, app-argument=https://www.azcentral.com/story/entertainment/television/2018/06/17/what-its-like-audition-abc-bachelor-casting-call/662166002/entertainment/television", "theme-color": "#ffffff", "og": {"title": "I went to a casting call for 'The Bachelor.' Here's what happened", "description": "A reporter went to a casting call in Scottsdale for 'The Bachelor' to give us the scoop on what's like to audition for the ABC reality-TV show.", "site_name": "The Republic | azcentral.com", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/7563691c5020960568970402a6147d870768634e/c=0-0-1200-678/local/-/media/2018/06/16/Phoenix/Phoenix/636647725324333863-Becca-Smouse-auditions-for-The-Bachelor-6.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "description": "A reporter went to a casting call in Scottsdale for 'The Bachelor' to give us the scoop on what's like to audition for the ABC reality-TV show.", "twitter": {"site": "@azcentral", "creator": "@azcentral", "card": "summary_large_image"}}, "movies": [], "publish_date": 1529190000.0, "source": "https://www.azcentral.com", "summary": ""}