{"url": "https://www.hollywoodreporter.com/news/anthony-bourdain-travel-channel-sets-no-reservations-marathon-1118567", "text": "Hours after news broke Friday morning that Anthony Bourdain had died at age 61, Travel Channel announced plans to pay tribute to the celebrity chef’s legacy. The network on Sunday will air a 12-hour marathon of Anthony Bourdain: No Reservations.\n\nThe show, which ran for nine seasons from 2005-2012, won the Emmy for outstanding cinematography for nonfiction programming in 2009 and 2011. In all, Bourdain filmed 142 episodes. According to a Friday press release, Travel Channel will air “celebrated episodes,” including Bourdain’s memorable journey to Spain’s Costa Brava and his exploration of Laos. On Monday afternoon, the network announced that it will continue to play beloved episodes of No Reservations every Tuesday night at 10 p.m. and 11 p.m. until July 3.\n\nTravel Channel shared its sorrow over Bourdain’s death in a Twitter statement: “We are stunned and deeply saddened to hear that the world is now without its global ambassador, Anthony Bourdain. He was an incredible talent who showed us beautiful, gritty, complicated and delicious places in every corner of the world. His wit and perspective will be missed. Our thoughts are with his family at this difficult time.”\n\nCNN, the network behind Bourdain’s other critically acclaimed series, Parts Unknown, also revealed plans to honor the late food enthusiast and TV personality in programming over the weekend. The network on Friday night will air a special tribute, Remembering Anthony Bourdain, and a night of Bourdain’s favorite episodes of Parts Unknown will run on Saturday.\n\nOn Sunday, CNN will air a previously scheduled episode of Parts Unknown, in which Bourdain ventures into Berlin, with a special introduction from Anderson Cooper. An encore of Remembering Anthony Bourdain will play immediately after.\n\nBourdain was found dead in his hotel room in France after an apparent suicide, CNN confirmed early Friday. Though Bourdain appeared to have hanged himself, his exact cause of death is still under investigation. “We have indeed learned of the death by hanging of the American chef this morning in a luxury hotel in Kaysersberg, Le Chambard,” said Colmar’s public prosecutor Christian de Rocquigny du Fayel in a statement. “At this stage, nothing suggests the intervention of a third party.”\n\nJune 11, 1:56 p.m. Updated with the Travel Channel’s plans to air No Reservations every Tuesday night until July 3.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/06/39e82c1c-e265-40f6-8381-f3df2dbdf0fc.png?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/39e82c1c-e265-40f6-8381-f3df2dbdf0fc.png?w=1024", "keywords": [], "authors": ["Evan Real"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/anthony-bourdain-travel-channel-sets-no-reservations-marathon-1118567/", "title": "Travel Channel Sets Marathon of ‘No Reservations’ in Tribute to Anthony Bourdain", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Travel Channel on Sunday will pay tribute to the late Anthony Bourdain with a 12-hour marathon of his 'Anthony Bourdain: No Reservations.'", "news_keywords": "Anthony Bourdain, nsfs, THRX", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Evan Real", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1118567, "title": "Travel Channel Sets Marathon of 'No Reservations' in Tribute to Anthony Bourdain", "published_at": "2018-06-08 14:43:05", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/39e82c1c-e265-40f6-8381-f3df2dbdf0fc.png?w=1024", "comment_count": 0, "tags": "THRX", "topics": "TV News", "body": "Hours after news broke Friday morning that Anthony Bourdain had died at age 61, Travel Channel announced plans to pay tribute to the celebrity chef's legacy. The network on Sunday will air a 12-hour marathon of Anthony Bourdain: No Reservations.\r\nThe show, which ran for nine seasons from 2005-2012, won the Emmy for outstanding cinematography for nonfiction programming in 2009 and 2011. In all, Bourdain filmed 142 episodes. According to a Friday press release, Travel Channel will air \"celebrated episodes,\" including Bourdain's memorable journey to Spain's Costa Brava and his exploration of Laos. On Monday afternoon, the network announced that it will continue to play beloved episodes of No Reservations every Tuesday night at 10 p.m. and 11 p.m. until July 3.\r\nTravel Channel shared its sorrow over Bourdain's death in a Twitter statement: \"We are stunned and deeply saddened to hear that the world is now without its global ambassador, Anthony Bourdain. He was an incredible talent who showed us beautiful, gritty, complicated and delicious places in every corner of the world. His wit and perspective will be missed. Our thoughts are with his family at this difficult time.\"\r\n\r\n\tpic.twitter.com/5OVneIssUP\r\n\t— Travel Channel (@travelchannel) June 8, 2018\r\nCNN, the network behind Bourdain's other critically acclaimed series, Parts Unknown, also revealed plans to honor the late food enthusiast and TV personality in programming over the weekend. The network on Friday night will air a special tribute, Remembering Anthony Bourdain, and a night of Bourdain's favorite episodes of Parts Unknown will run on Saturday.\r\n\r\nOn Sunday, CNN will air a previously scheduled episode of Parts Unknown, in which Bourdain ventures into Berlin, with a special introduction from Anderson Cooper. An encore of Remembering Anthony Bourdain will play immediately after.\r\nBourdain was found dead in his hotel room in France after an apparent suicide, CNN confirmed early Friday. Though Bourdain appeared to have hanged himself, his exact cause of death is still under investigation. \"We have indeed learned of the death by hanging of the American chef this morning in a luxury hotel in Kaysersberg, Le Chambard,\" said Colmar's public prosecutor Christian de Rocquigny du Fayel in a statement. \"At this stage, nothing suggests the intervention of a third party.\"\r\n\r\nJune 11, 1:56 p.m. Updated with the Travel Channel's plans to air No Reservations every Tuesday night until July 3.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Travel Channel Sets Marathon of ‘No Reservations’ in Tribute to Anthony Bourdain", "url": "https://www.hollywoodreporter.com/tv/tv-news/anthony-bourdain-travel-channel-sets-no-reservations-marathon-1118567/", "description": "Travel Channel on Sunday will pay tribute to the late Anthony Bourdain with a 12-hour marathon of his ‘Anthony Bourdain: No Reservations.’", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/39e82c1c-e265-40f6-8381-f3df2dbdf0fc.png?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-06-08T14:43:05+00:00", "modified_time": "2018-06-11T13:57:31+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Travel Channel Sets Marathon of ‘No Reservations’ in Tribute to Anthony Bourdain", "description": "Travel Channel on Sunday will pay tribute to the late Anthony Bourdain with a 12-hour marathon of his ‘Anthony Bourdain: No Reservations.’", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/39e82c1c-e265-40f6-8381-f3df2dbdf0fc.png?w=1280"}}, "movies": [], "publish_date": 1528468985.0, "source": "https://www.hollywoodreporter.com", "summary": ""}