{"url": "https://www.celebritynetworth.com/richest-businessmen/richest-designers/lilly-ghalichi-net-worth/", "text": "Lilly Ghalichi net worth: Lilly Ghalichi is a Persian American fashion designer, attorney, blogger and reality star who has a net worth of $50 million. Lilly Ghalichi rose to fame as a cast member of Bravo's reality television show The Shahs of Sunset.\n\nShe was born in Houston, Texas in April 1983. Her real name is Neelufar Seyed Ghalichi. While Lilly Ghalichi may look like a \"Persian Barbie\" with her long skinny legs and skimpy outfits, she is much more than meets the eye. In addition to being a knock out, Ghalichi is also an attorney, fashion designer, and blogger. Ghalichi is originally from Houston but moved to Los Angeles after passing the bar exam. Instead of pursuing a legal career, Ghalichi knew that her passions were in the fashion world.\n\nLilly was introduced to the world of Shahs of Sunset as one of cast member Reza Farahan's real estate clients. Outside of the world of reality television, Lilly Ghalichi has launched a line of racy bikinis that is inspired by lingerie called \"Have Faith Swimgerie\". Lilly Ghalihchi has also appeared in episodes of the TV series Good Day L.A., Big Morning Buzz Live, Bethenny, The Shahs Come Clean with Nadine, and Dr. Mona Vand: The Modern Pharmacist.\n\nLilly earned her Bachelor's degree from Red McCombs School of Business at The University of Texas at Austin then went to Loyola Law School in Los Angeles where she graduated Cum Laude with honors.\n\nLilly Lashes: In addition to her line of swimgerie, Lilly is the creator of a highly successful line of eyelashes called \"Lilly Lashes\". Today the brand reportedly generates $15 million per year in revenue.\n\nPersonal Life and Real Estate: Lilly married Dara Mir in May 2017 at the Beverly Hills Hotel. They split up in the summer of 2019 but ultimately reconciled. Dara Mir is a successful entrepreneur in his own right. He is the President of ergonomic furniture company 9 to 5 seating.\n\nIn April 2020 Lilly and Dara paid $19.5 million for an 11,000 square-foot home down the street from the Bel-Air Country Club and the Hotel Bel-Air. They bought the home from the estate of automotive icon Lee Iococca. Lee paid $4.25 million for the home back in 1993, the same as $7.6 million in today's dollars. Lee arranged to have access to the exclusive hotel from his property through a side gate, allowing him to walk to and from as he pleased, a convenience Lilly and Dara will now have. Iococca's heirs originally listed the home for $26 million. In November 2020 Lilly deeded the rights to this home over to Dara, potentially a sign that the couple was again planning to separate.\n\nIn 2012 Dara paid $6.1 million for a hillside home in Bel Air, not far from the previously-mentioned new home. He demolished the home that was on the property and built a large multi-structure compound in its place. His next door neighbor at this property is Elon Musk. Though Musk owns several homes on this block.\n\nIn December 2020 it was revealed that Lilly paid $14 million for Kathy Griffin's Bel Air mansion. Kathy had been seeking $16 million. Here's a video tour:", "images": ["https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2012/12/Lilly-Ghalichi-2.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/wp-content/uploads/2012/12/Lilly-Ghalichi-1-e1587069962565.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2012/12/Lilly-Ghalichi-1-e1587069962565.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-businessmen/richest-designers/lilly-ghalichi-net-worth/", "title": "Lilly Ghalichi Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Lilly Ghalichi net worth: Lilly Ghalichi is a Persian American fashion designer, attorney, blogger and reality star who has a net worth of", "cnw_share_fb_count": 132, "cnw_share_tw_count": 22, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Lilly Ghalichi Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-businessmen/richest-designers/lilly-ghalichi-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2012/12/Lilly-Ghalichi-1-e1587069962565.jpg", "site_name": "Celebrity Net Worth", "description": "Lilly Ghalichi net worth: Lilly Ghalichi is a Persian American fashion designer, attorney, blogger and reality star who has a net worth of"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2020-12-06T23:21:19+00:00", "published_time": "2020-03-02T23:56:45+00:00", "section": "Designers", "tag": "shahs of sunset"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2012/12/Lilly-Ghalichi-1-e1587069962565.jpg", "title": "Lilly Ghalichi Net Worth", "description": "Lilly Ghalichi net worth: Lilly Ghalichi is a Persian American fashion designer, attorney, blogger and reality star who has a net worth of"}}, "movies": ["https://www.youtube.com/embed/OLCyagbxCC0"], "publish_date": 1583193405.0, "source": "https://www.celebritynetworth.com", "summary": ""}