{"url": "https://www.hollywoodreporter.com/live-feed/psych-end-eight-seasons-677428", "text": "It’s time to retire the pineapple.\n\nUSA Network is officially ending its long-running scripted comedy series Psych after the current eighth season, The Hollywood Reporter has learned.\n\nThe series finale has been set for March 26 at 9 p.m. A special one-hour live show, Psych After Show, will follow at 10 p.m., featuring a Q&A discussion with series creator Steve Franks and the entire cast taped in front of a studio audience in Los Angeles. James Roday and Dule Hill also released a video announcing the final episodes. (Watch the video below.)\n\nSTORY: ‘Psych’ Creator Fulfills Musical Dream: I’ve Checked It Off My Bucket List\n\nSince Psych’s summer debut in 2006, the hour-long comedy has become a reliable bet for USA — though it has been showing its age. The eighth season, which debuted Jan. 8, opened with 2.3 million viewers and a 0.8 rating among adults 18-49. The most recent episode dipped to 1.7 million viewers, very near a series low. Psych was last a considerable force in its fifth season when it regularly approached 4 million viewers.\n\n“We’ve shot out season eight and if season eight is it, that’s what it was meant to be. If it can live on in any other capacity, let’s talk Broadway,” Franks told THR in December, calling the finale “one of my favorite episodes of the show.” He said of the closer: “It certainly has a degree of closure that will be satisfying.”\n\nA fan favorite at Comic-Con, Psych reached its 100th-episode milestone last March, and last December broadcast a two-hour movie musical, a long-in-the-works passion project from Franks. Psych has been known for its bevy of pop culture references and homages to classics like Clue, The Shining and Twin Peaks — and has a considerable online presence (the Emmy-nominated #HashTag Killer campaign). When the show ends, it will have aired more than 120 episodes, just a few shy of USA’s former dramedy Monk.\n\nPHOTOS: 2014’s New Broadcast and Cable TV Shows\n\nDuring Psych’s later years, castmembers have dabbled in work outside of Psych, most notably Maggie Lawson, who at one point was also juggling ABC comedy Back in the Game.\n\n“Psych has made an indelible imprint on the television landscape, with a unique brand of comedy,” said Chris McCumber, president of USA Network. “The final season celebrates the iconic characters that have made this show so beloved, and will be an exclamation point on the series’ incredible run. And while the series will wrap in March, somehow I don’t believe we’ve heard the last of Shawn and Gus.”\n\nJeff Wachtel, president and chief content officer of NBCUniversal Cable Entertainment, said, “Psych is one of those rare projects that broke into the cultural mainstream. Its wild energy, fearless fun and engaging characters delivered an unrivaled series that will continue to be loved by fans for as long as there are ways to watch TV.”\n\nThe news comes at an interesting time for USA as it sets its sights on comedy with the upcoming launch of Denis Leary‘s Sirens in early March, continues its reality push with Chrisley Knows Best and eyes the next new scripted effort. With Psych wrapping up and Burn Notice and Necessary Roughness ending last year, USA has a handful of scripted shows on its slate: White Collar, which recently ended its fifth season and has yet to be renewed; Royal Pains; Covert Affairs; Suits; Graceland; the six-part miniseries Dig from Tim Kring; the aforementioned Sirens; Benched; and Playing House. USA also has five dramas in development.\n\nPsych, co-starring Corbin Bernsen, Timothy Omundson and Kirsten Nelson, hails from Universal Cable Productions and Tagline Productions. Franks, Kelly Kulchak and Chris Henze are executive producers, with EP Mel Damski also director. Saladin K. Patterson, Andy Berman and Todd Harthan are co-executive producers, with Kell Cahoon consulting producer.\n\nMichael O’Connell contributed to this report.\n\nEmail: Philiana.Ng@THR.com\n\nTwitter: @insidethetube", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2014/02/psych_cog_blocked.jpg?w=2000&h=1126&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2014/02/psych_cog_blocked.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2014/02/psych_cog_blocked.jpg?w=1024", "keywords": [], "authors": ["Philiana Ng"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/psych-end-eight-seasons-677428/", "title": "USA’s ‘Psych’ to End After Eight Seasons", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The long-running comedy starring James Roday and Dule Hill will wrap March 26 with a one-hour aftershow following the finale.", "news_keywords": "Canceled, Dule Hill, Psych, USA Network", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Philiana Ng", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 677428, "title": "USA's 'Psych' to End After Eight Seasons", "published_at": "2014-02-05 12:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2014/02/psych_cog_blocked.jpg?w=1024", "comment_count": 0, "tags": "USA Network", "topics": "TV News", "body": "It’s time to retire the pineapple.\r\nUSA Network is officially ending its long-running scripted comedy series Psych after the current eighth season, The Hollywood Reporter has learned.\r\n\r\nThe series finale has been set for March 26 at 9 p.m. A special one-hour live show, Psych After Show, will follow at 10 p.m., featuring a Q&A discussion with series creator Steve Franks and the entire cast taped in front of a studio audience in Los Angeles. James Roday and Dule Hill also released a video announcing the final episodes. (Watch the video below.)\r\nSTORY: 'Psych' Creator Fulfills Musical Dream: I've Checked It Off My Bucket List\r\nSince Psych’s summer debut in 2006, the hour-long comedy has become a reliable bet for USA -- though it has been showing its age. The eighth season, which debuted Jan. 8, opened with 2.3 million viewers and a 0.8 rating among adults 18-49. The most recent episode dipped to 1.7 million viewers, very near a series low. Psych was last a considerable force in its fifth season when it regularly approached 4 million viewers.\r\n\"We've shot out season eight and if season eight is it, that's what it was meant to be. If it can live on in any other capacity, let's talk Broadway,\" Franks told THR in December, calling the finale \"one of my favorite episodes of the show.\" He said of the closer: \"It certainly has a degree of closure that will be satisfying.\"\r\nA fan favorite at Comic-Con, Psych reached its 100th-episode milestone last March, and last December broadcast a two-hour movie musical, a long-in-the-works passion project from Franks. Psych has been known for its bevy of pop culture references and homages to classics like Clue, The Shining and Twin Peaks -- and has a considerable online presence (the Emmy-nominated #HashTag Killer campaign). When the show ends, it will have aired more than 120 episodes, just a few shy of USA's former dramedy Monk.\r\nPHOTOS: 2014's New Broadcast and Cable TV Shows\r\nDuring Psych’s later years, castmembers have dabbled in work outside of Psych, most notably Maggie Lawson, who at one point was also juggling ABC comedy Back in the Game.\r\n\"Psych has made an indelible imprint on the television landscape, with a unique brand of comedy,\" said Chris McCumber, president of USA Network. \"The final season celebrates the iconic characters that have made this show so beloved, and will be an exclamation point on the series' incredible run. And while the series will wrap in March, somehow I don't believe we’ve heard the last of Shawn and Gus.\"\r\nJeff Wachtel, president and chief content officer of NBCUniversal Cable Entertainment, said, \"Psych is one of those rare projects that broke into the cultural mainstream. Its wild energy, fearless fun and engaging characters delivered an unrivaled series that will continue to be loved by fans for as long as there are ways to watch TV.\"\r\nThe news comes at an interesting time for USA as it sets its sights on comedy with the upcoming launch of Denis Leary's Sirens in early March, continues its reality push with Chrisley Knows Best and eyes the next new scripted effort. With Psych wrapping up and Burn Notice and Necessary Roughness ending last year, USA has a handful of scripted shows on its slate: White Collar, which recently ended its fifth season and has yet to be renewed; Royal Pains; Covert Affairs; Suits; Graceland; the six-part miniseries Dig from Tim Kring; the aforementioned Sirens; Benched; and Playing House. USA also has five dramas in development.\r\nPsych, co-starring Corbin Bernsen, Timothy Omundson and Kirsten Nelson, hails from Universal Cable Productions and Tagline Productions. Franks, Kelly Kulchak and Chris Henze are executive producers, with EP Mel Damski also director. Saladin K. Patterson, Andy Berman and Todd Harthan are co-executive producers, with Kell Cahoon consulting producer.\r\nMichael O'Connell contributed to this report.\r\nEmail: Philiana.Ng@THR.com\r\n\tTwitter: @insidethetube", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "USA’s ‘Psych’ to End After Eight Seasons", "url": "https://www.hollywoodreporter.com/tv/tv-news/psych-end-eight-seasons-677428/", "description": "The long-running comedy starring James Roday and Dule Hill will wrap March 26 with a one-hour aftershow following the finale.", "site_name": "The Hollywood Reporter", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2014/02/psych_cog_blocked.jpg?w=1024", "locale": "en_US"}, "article": {"published_time": "2014-02-05T12:00:00+00:00", "modified_time": "2017-07-21T10:36:04+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "USA’s ‘Psych’ to End After Eight Seasons", "description": "The long-running comedy starring James Roday and Dule Hill will wrap March 26 with a one-hour aftershow following the finale.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2014/02/psych_cog_blocked.jpg?w=3000"}}, "movies": [], "publish_date": 1391601600.0, "source": "https://www.hollywoodreporter.com", "summary": ""}