{"url": "https://www.tvguide.com/news/american-horror-story-cult-opening-credits-clues/", "text": "One of the great joys of watching American Horror Story is the way the fandom comes together to share increasingly bonkers theories about this increasingly bonkers show. Sometimes, these theories prove to be correct and we all feel vindicated in our crackpotitude. Other times, they are so off-base it would be hilarious if we weren't so convinced the fan theory would have been better than how the real plot turned out.\n\nBut generally, it doesn't even matter whether the theory turns out to be correct or not because it's just so darn fun speculating about a show in which truly anything is possible. That's exactly why we love this latest theory, originally posted by Reddit user kyroko, that suggests the Cult opening titles reveal clues as to the specific fates of all the show's main characters.\n\nSo what might the Cult opening credits reveal? Let's break it down point-by-point.\n\nThis American Horror Story: Cult Theory Suggests Winter Is the Real Big Bad\n\nThe first credit to appear onscreen, Sarah Paulson's name is splashed with blood. Seeing as this a horror series, this doesn't really give too much away. Maybe Ally dies, maybe she kills people and gets all bloody in the process. This one really is pretty vague, to be honest. The next ones, however, that's where all the fun begins...\n\nWhen Evan Peters' name appears, a gas canister is thrown onscreen. Soon thereafter, Cheyenne Jackson's name appears over footage of the same canister releasing a noxious green gas that partially obscures Jackson's name.\n\nAs one user pointed out, this might symbolize two different things: the gas being released over Jackson's name could represent his character, Dr. Vincent, gaslighting his patient Ally. Since the canister originated during Peters' name, that could show that it's really Kai who is controlling Dr. Vincent's actions, including exploiting what he learns about Ally's phobias during their therapy sessions.\n\nDuring Billie Lourd's credit, part of her name is cut off by the knives being juggled. This could be referring to Winter's history of self-harm that was referenced during the premiere or it could tease that she might be losing a limb later this season. Based on the way she's been behaving, we wouldn't be too shocked if Ally turned on her nanny with a knife one day.\n\nAmerican Horror Story: Cult: Why Ally's Shocking Move Probably Wasn't an Accident\n\nFinally, when it's Alison Pill's turn, her name partially disintegrates and seemingly blows away in the wind. Could Ivy also be losing a limb or does the way her name crumbles suggest turning to ash? Or, as pointed out by another Reddit user, the fact that the \"I\" in both Alison and Pill are some of the letters to be affected could specifically suggest that Ivy might be losing an eye (as is wont to happen in American Horror Story).\n\nAnd before you write all of this off as the insane conspiracy theory it sounds like, Ryan Murphy has been known to include clues in title sequences before. During the credits of Coven, Lily Rabe's name turns to ash, just like her character Misty Day eventually did in the series.\n\nThe Coven credits also seemingly revealed the answer to the season-long mystery over who would be the next Supreme if you looked close enough Ultimately, it was Sarah Paulson's character Cordelia Foxx who became the leader of the coven, mastering all seven wonders. Behind Paulson's name in the credits is an image of Santa Muerte, who also went by the name \"Lady of the Seven Powers.\"\n\nSo does this definitively prove that the Cult credits reveal plot points about each of the main characters? Hell no. But it does give us a few different clues to keep in mind as we see how the story progresses. Maybe the upcoming episodes will confirm a few of these theories, maybe they won't. But either way, isn't the fun of theorizing what really matters?\n\nAmerican Horror Story: Cult airs Tuesdays at 10/9c on FX.", "images": ["https://www.tvguide.com/a/img/resize/b0ce45712f15c31560cb27e9193d1ab9dc8e6448/hub/2017/09/14/f74a242d-96eb-4b19-8cc6-79c7b01dbdee/ahs-peters-jackson.gif?fit=crop&format=mp4&height=1080&width=1920", "https://www.tvguide.com/a/img/resize/cc75ad7a44e99ba7d53c81cf4346c21a60a0336f/hub/2017/09/14/3930f9bb-40d3-443c-a59f-ca1874009c49/ahs-alison-real.gif?fit=crop&format=mp4&height=1080&width=1920", "https://www.tvguide.com/a/img/resize/02f3e4f3ab81d06f661a1ac8a932bff8c79aee36/hub/2017/09/14/5aa65e03-e0ca-49b2-b50a-f4946de245e8/ahs-billie.gif?fit=crop&format=mp4&height=1080&width=1920", "https://www.tvguide.com/a/img/resize/2be947a4fabb20898cf2b9766d42aa9bd2a0a23e/hub/2017/09/14/ab604d99-5861-4dca-bfc9-071d6aaf4a36/ahs-paulson.gif?fit=crop&format=mp4&height=1080&width=1920", "https://www.tvguide.com/a/img/resize/f4d25b11f3a26a1a379c7b1593513927e664fe49/hub/2017/09/14/db2627e2-8602-4fa7-a1ba-ef0d662406b9/ahs-paulson-asylum.gif?fit=crop&format=mp4&height=1080&width=1920", "https://www.tvguide.com/a/img/resize/0964b5b34fd7cefef523c5057df940d4e177c8bc/hub/2017/09/14/ac2bae40-f5ef-4511-acc6-f27465005556/ahs-rabe-coven.gif?fit=crop&format=mp4&height=1080&width=1920", "https://www.tvguide.com/a/img/hub/2017/08/22/baff103a-f84d-4b5b-bdf6-a8fb56c07422/ahs-news.png", "https://www.tvguide.com/a/img/resize/dac11cd2640f3874cb11cc475031222f3e6e111e/hub/2017/10/09/2e307b7c-e939-4e19-8acd-859a42614342/unnamed.jpg?auto=webp&height=84&width=84"], "top_img": "https://www.tvguide.com/a/img/hub/2017/08/22/baff103a-f84d-4b5b-bdf6-a8fb56c07422/ahs-news.png", "keywords": [], "authors": ["Sadie Gennis", "Sept.", "A.M. Pt"], "canonical_link": "https://www.tvguide.com/news/american-horror-story-cult-opening-credits-clues/", "title": "American Horror Story: Cult Opening Credits Clues", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 63084645929}, "google-site-verification": "Od29UEFliEmsUY2XH0kfXxkTNucL0cv_rc0J_RPWXU4", "og": {"site_name": "TVGuide.com", "image": {"identifier": "https://www.tvguide.com/a/img/hub/2017/08/22/baff103a-f84d-4b5b-bdf6-a8fb56c07422/ahs-news.png", "height": 850, "width": 850}, "type": "article", "description": "We break them down point-by-point.", "title": "American Horror Story: Cult Opening Credits Clues", "url": "https://www.tvguide.com/news/american-horror-story-cult-opening-credits-clues/"}, "twitter": {"card": "summary_large_image", "site": "@TVGuide", "image": "https://www.tvguide.com/a/img/hub/2017/08/22/baff103a-f84d-4b5b-bdf6-a8fb56c07422/ahs-news.png", "description": "The title sequences may provide crucial insight into the fates of all the main characters", "title": "American Horror Story: Cult Opening Credits Clues", "url": "https://www.tvguide.com/news/american-horror-story-cult-opening-credits-clues/"}, "nuxtstatus": "loaded", "description": "The title sequences may provide crucial insight into the fates of all the main characters"}, "movies": ["https://www.youtube.com/embed/B0csnVQ0ZKA"], "publish_date": null, "source": "https://www.tvguide.com", "summary": ""}