{"url": "https://www.theguardian.com/sport/2018/aug/16/madison-kocian-kyla-ross-abuse-larry-nassar", "text": "Madison Kocian and Kyla Ross watched the women they won Olympic gold with step forward one by one over the last 18 months to detail their abuse at the hands of disgraced former USA Gymnastics national team doctor Larry Nassar.\n\nThe more their Olympic teammates talked, the more Kocian and Ross began to examine their own interactions with Nassar. Over time they realized their experience mirrored those of hundreds of other women who were abused by Nassar under the guise of treatment. They realized they hadn’t been spared but instead were victims, too.\n\nIt took months for them to process and even longer to go public. Yet they’re doing it now months after Nassar was sentenced to an effective life sentence after being convicted of federal child pornography and state sexual abuse charges to both help themselves heal and to send a message to victims of sexual abuse everywhere that there is no timetable on coming to grips with the trauma and it’s never too late to speak up and say “hey, me too”.\n\n“Everyone copes in their own way,” said Ross, a member of the Fierce Five that stormed to gold at the 2012 Olympics.\n\n“It doesn’t matter how old you are and what happens to you. I’ve come to the point in my life this is something I want to share my story and move on,” Ross told the Associated Press.\n\nRoss and Kocian, a member of the Final Five that won team gold at the 2016 Olympics, have retired from elite gymnastics and now compete collegiately as teammates at UCLA. They both say they were in denial about their abuse. The turning point came in January as they watched nearly 200 women come forward to read victim impact statements to Nassar.\n\nThe group included Jordyn Wieber, who competed alongside Ross at the 2012 London games and now serves as an assistant coach with the Bruins. Until she stood in front of Nassar, Wieber had never spoken publicly about her abuse. Ross and Kocian both leaned on her before deciding to join the army of survivors.\n\n“Just seeing the process through her view had helped me find my voice and be confident in myself and realize I was a victim,” Ross said. “But we don’t want to be viewed as victims. This is something we have to grow through. Now we’re just trying to find our voice and help.”\n\nAll five members of the 2012 Olympic team Ross, Wieber, Aly Raisman, Gabby Douglas and McKayla Maroney have revealed they were abused by Nassar. Kocian is the fourth member of the 2016 Olympic team to come forward, joining Raisman, Douglas and Simone Biles. Ross and Kocian have both filed civil lawsuits against Michigan State where Nassar worked for decades and plan to do the same against the United States Olympic Committee and USA Gymnastics.\n\nThey place part of the blame for their abuse on what they described as a toxic culture around the USA Gymnastics elite program that allowed Nassar’s treatment to run unchecked.\n\nRoss described getting a “pit” in her stomach every time she visited the Karolyi Ranch near Houston that served as the longtime training home for the senior national team. Kocian felt she and her teammates were “voiceless” thanks in part to the tone set by former national team coordinator Martha Karolyi. Karolyi retired in 2016.\n\n“You live under a fear of not being able to speak up because this was our only avenue to accomplish our dreams and make the Olympic team,” Kocian told the AP.\n\nBoth women, now 21, stepped away from elite competition following the 2016 Olympics. While there has been significant change within USA Gymnastics over the last two years, including a new president and board of directors, they’d like to see more.\n\n“There are still people at the top that I feel have overseen this issue for a long time and I think that needs to be changed as well as the whole culture around everything,” Kocian said. “I don’t think enough has been changed from the coaching standpoint. There are still coaches under that abusive style of coaching whether it’s verbal abuse, that’s what enables all of this.”\n\nUSA Gymnastics said in a statement it is “heartbroken” that Ross and Kocian are among Nassar’s victims, adding “their powerful voices and stories will continue to be a basis for our future decisions.”\n\nKocian or Ross, who helped UCLA to an NCAA title last spring, have no plans to return to elite competition. Kocian described a lack of empathy from USA Gymnastics throughout her career as part of the problem.\n\n“Possibly if maybe more people had reached out to my parents to see if I was OK when so many people knew about this and they went through whole Olympic Games knowing and not doing anything,” Kocian said. “Even to this day have heard nothing support wise from them. I think my decision might have been different (otherwise).”", "images": ["https://i.guim.co.uk/img/media/b56e55db1be3108939002c50ce36fc7d3a042afd/0_0_3000_1800/master/3000.jpg?width=465&quality=85&dpr=1&s=none", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Gymnastics%2CSport%2CUS+sports", "https://i.guim.co.uk/img/media/b56e55db1be3108939002c50ce36fc7d3a042afd/0_0_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9b475cf618c3e2701f9d40ba54ffe720"], "top_img": "https://i.guim.co.uk/img/media/b56e55db1be3108939002c50ce36fc7d3a042afd/0_0_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9b475cf618c3e2701f9d40ba54ffe720", "keywords": [], "authors": [], "canonical_link": "https://www.theguardian.com/sport/2018/aug/16/madison-kocian-kyla-ross-abuse-larry-nassar", "title": "Olympic gymnasts Madison Kocian and Kyla Ross reveal abuse by Larry Nassar", "meta_data": {"description": "Two more Olympic champion gymnasts from the United States have come forward about their abuse at the hands of disgraced physician Larry Nassar", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#052962", "og": {"url": "http://www.theguardian.com/sport/2018/aug/16/madison-kocian-kyla-ross-abuse-larry-nassar", "image": {"identifier": "https://i.guim.co.uk/img/media/b56e55db1be3108939002c50ce36fc7d3a042afd/0_0_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9b475cf618c3e2701f9d40ba54ffe720", "height": 720}, "title": "Olympic gymnasts Madison Kocian and Kyla Ross reveal abuse by Larry Nassar", "description": "Two more Olympic champion gymnasts from the United States have come forward about their abuse at the hands of disgraced physician Larry Nassar", "type": "article", "site_name": "the Guardian"}, "article": {"author": "Associated Press", "publisher": "https://www.facebook.com/theguardian", "modified_time": "2018-08-16T13:36:45.000Z", "section": "Sport", "published_time": "2018-08-16T13:34:41.000Z", "tag": "Gymnastics,Sport,US sports"}, "al": {"ios": {"url": "gnmguardian://sport/2018/aug/16/madison-kocian-kyla-ross-abuse-larry-nassar?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287}, "twitter": {"dnt": "on", "app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"googleplay": "guardian://www.theguardian.com/sport/2018/aug/16/madison-kocian-kyla-ross-abuse-larry-nassar", "iphone": "gnmguardian://sport/2018/aug/16/madison-kocian-kyla-ross-abuse-larry-nassar?contenttype=Article&source=twitter", "ipad": "gnmguardian://sport/2018/aug/16/madison-kocian-kyla-ross-abuse-larry-nassar?contenttype=Article&source=twitter"}}, "card": "summary_large_image", "image": "https://i.guim.co.uk/img/media/b56e55db1be3108939002c50ce36fc7d3a042afd/0_0_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=47b32e79713b9090fdae3b881205c83c", "site": "@guardian"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1534374000.0, "source": "https://www.theguardian.com", "summary": ""}