{"url": "https://www.denofgeek.com/us/movies/star-wars/269704/star-wars-the-last-jedi-easter-eggs", "text": "– C-3PO has a slightly bigger role in this movie – mostly to annoy Leia and Poe – and he’s got his golden arm back! He appeared with a rusty red arm in The Force Awakens.\n\n– The tune you hear as the Millennium Falcon zooms through the Crait mines during the TIE fighter chase scene is definitely a callback to the “Tie Fighter Attack” theme from A New Hope. In fact, the way the scene is choreographed, the Falcon zig zagging past obstacles like that, it’s almost meant to look like the Falcon’s run through the Death Star II in Return of the Jedi.\n\n– Maz Kanata makes a very brief appearance in The Last Jedi in a hologram. We get to see her in action for the first time in this short scene, shooting at her enemies with a blaster. It’s peculiar that she chooses to use a blaster considering that she can use the Force (as revealed in The Force Awakens’ deleted scenes). I hope we can see more of her in Episode IX.\n\n– Although I thought Temmin “Snap” Wexley died in a fiery X-wing crash during the opening battle, the diligent commenters have corrected me: that’s a dude named Tubbs, played by Jamie Christopher. That’s almost certainly a reference to Porkins from A New Hope.\n\n– Billie Lourd, Carrie Fisher’s daughter, returns once again as Lieutenant Kaydel Ko Connix. She gets a bit more to do this time around, such as help Poe Dameron commit mutiny and take over the Raddus.\n\n– Nien Nunb, the Sullustan who piloted the Millennium Falcon with Lando Calrissian during the Battle of Endor, makes a brief appearance as part of Poe Dameron’s X-wing squadron. He also appeared in The Force Awakens.\n\n– In one of the more overt cameos in the movie, Rogue One director Gareth Edwards appears during the Battle of Crait. He can be seen next to the Resistance fighter who tastes the salt on the ground.\n\nPlanets, Other Cameos, & Miscellaneous\n\n– This isn’t the first Star Wars story to bear the name “The Last Jedi.” In the Legends timeline, there’s a novel called The Last Jedi by Michael Reaves and Maya Kaathryn. It’s a continuation of the Coruscant Nights trilogy, which stars a Jedi Knight named Jax Pavan in the days after Order 66.\n\n– Even though you never actually hear the famous Star Wars line, “I’ve got a bad feeling about this,” it is in the movie, according to director Rian Johnson. He revealed to Huffington Post that it’s actually BB-8 who says it to Poe during their crazy attack on the Dreadnought.\n\n“It seemed like a fun character to deliver that line,” Johnson told HuffPo. “I think originally I had Poe respond, ‘Oh, I got a good feeling about it. Keep your chin up.’ And then I made it a little less explicit just to make it more fun.”\n\n– The little ornament Luke finds on the Falcon and later gifts to Leia is Han’s lucky dice. The smuggler believes they bring him good luck, so he hangs the ornament in the ship’s cockpit. He even used the dice to beat Lando Calrissian in a game of “Corellian Spike,” an offshoot of the card game sabacc, and win the Millennium Falcon!\n\nIn reality, Han’s dice only appear ONCE in the entire Original Trilogy. Inexplicably, they disappear after one shot in the movie. They finally return in The Force Awakensand are given a bit more attention in The Last Jedi.\n\n– From what I can tell, the charred Darth Vader helmet doesn’t make an appearance in this movie. It seems kind of odd that we never see Kylo Ren talking to it considering it was such a big part of his faith in the dark side in The Force Awakens. Perhaps that’s part of his whole “Kill the past” slogan in The Last Jedi. As far as I can tell, the last we saw of the helmet, it was on the Finalizer and not Starkiller Base, so it wouldn’t have blown up, right?\n\n– There is a lot to learn about Canto Bight in the recently released novel collection. It’s a corrupt place where the rich control the police department. You can read way more fun facts about the planet here.\n\n– The Force-sensitive boy who works in the fathier stables in Canto Bight is named Temiri Blagg, played by Temirlan Blaev.\n\n– Temiri’s friends are named Arashell Sar (Sarah Heller) and Oniho Zaya (Josiah Oniha).\n\n– Canto Bight is located on the desert planet called Cantonica. Yes, it’s a desert planet! How does Canto Bight have that body of water surrounding it and that huge waterfall? That’s an artificial body of water constructed to make Canto Bight look even more lavish.\n\n– Warwick Davis, who played Wicket the Ewok in Return of the Jedi, has a brief cameo as an alien in Canto Bight named Wodibin. Davis has cameod in quite a few other Star Wars projects, too.\n\n– The “space horses” located on Canto Bight are called fathiers. They were actually first mentioned in the novel Aftermath: Empire’s End by Chuck Wendig, misspelled as “faithiers.”\n\n– The Master Codebreaker Maz Kanata recommends for Finn and Rose’s secret mission to deactivate the First Order’s hyperspace tracker is played by Justin Theroux in a cameo role. He seems to be really good as “space craps.” Hit me up if you know what game the Master Codebreaker is actually playing on Canto Bight.\n\n– Frequent Rian Johnson collaborator Joseph Gordon-Levitt has a brief cameo. He voices a character named Slowen Lo. According to Steve Wheeler in the comments, “The character Slowen Lo voiced by Joseph Gordon-Levitt is a reference to the Beastie Boys song ‘Slow and Low.’ There was a character called Ello Asty in The Force Awakens in reference to the Beastie Boys album Hello Nasty and J.J. Abrams used ‘Sabotage’ in Star Trek (2009) and it was later repeated in Star Trek Beyond (2016).” Thanks for the Beastie Boys knowledge, Steve!\n\n– The space yacht DJ and BB-8 steal in order to escape Canto Bight is called the Libertine.\n\n– When DJ is going through the different ships the Canto Bight arms dealer sold to the First Order, we see holograms of the TIE bomber and TIE Interceptor.\n\n– The extreme close-up of the iron landing on the First Order officer uniform is a reference to the short film Hardware Wars, which itself is a parody of A New Hope.\n\n– The “crystal foxes” on Crait are actually called vulptices. (The singular is “vulptex.”)\n\n– Apparently, filmmakers Edgar Wright and Joe Cornish also have cameo roles in the movie, but I’ve not spotted them. Let me know if you do!\n\n– There were rumors that Tom Hardy (Mad Max: Fury Road) would also have a cameo, but that’s not been confirmed. He apparently played a stormtrooper.\n\n– Prince Harry and Prince William of the British royal family reportedly filmed cameos. No sight of them just yet, though.\n\n– British singer Ellie Goulding revealed on Twitter that she filmed a cameo in The Last Jedi. I’ve not spotted her, though.\n\nJohn Saavedra is an associate editor at Den of Geek US. Find more of his work on his website. Or just follow him on Twitter.", "images": ["https://www.denofgeek.com/wp-content/uploads/2015/09/star-wars-the-last-jedi_3-scaled.jpg?resize=768%2C432", "https://www.denofgeek.com/wp-content/uploads/2017/07/the-church-of-star-wars-leia-1.jpg?resize=400%2C400", "https://www.denofgeek.com/wp-content/uploads/2017/12/star-wars-the-last-jedi_2-scaled.jpg?resize=400%2C400", "https://www.denofgeek.com/wp-content/uploads/2018/01/star-wars-the-last-jedi.jpg?resize=400%2C400", "https://www.denofgeek.com/wp-content/uploads/2017/12/star-wars-the-last-jedi-first-order-dreadnought.jpg?resize=400%2C400", "https://www.denofgeek.com/wp-content/uploads/2020/02/c3c6e3f0-5934-4511-9d63-b3197b04338e-2.jpg?resize=200%2C200&filter=grayscale", "https://www.denofgeek.com/wp-content/uploads/2015/12/star-wars-the-last-jedi.png?resize=400%2C400", "https://www.denofgeek.com/wp-content/uploads/2019/05/ArtImg.jpg?resize=400%2C400", "https://www.denofgeek.com/wp-content/uploads/2018/03/star-wars-the-last-jedi-luke-skywalker.jpg?resize=400%2C400", "https://www.denofgeek.com/wp-content/uploads/2015/09/star-wars-the-last-jedi_3-scaled.jpg?fit=2560%2C1440", "https://www.denofgeek.com/wp-content/uploads/2018/05/poe-dameron-the-last-jedi.jpeg?resize=400%2C400"], "top_img": "https://www.denofgeek.com/wp-content/uploads/2015/09/star-wars-the-last-jedi_3-scaled.jpg?fit=2560%2C1440", "keywords": [], "authors": ["John Saavedra", "Kayti Burt", "Don Kaye", "Bernard Boo", "David Crow", "Megan Crouse", "Ryan Lambie", "Rosie Fletcher", "Lee Parham"], "canonical_link": "https://www.denofgeek.com/movies/star-wars-the-last-jedi-easter-eggs/", "title": "Star Wars: The Last Jedi Easter Eggs and Reference Guide", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#d23226", "robots": "index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1", "p": {"domain_verify": "1893a020468964417f83c6a42b6791cf"}, "description": "A complete list of easter eggs, references, and callbacks we found in Star Wars: The Last Jedi!", "og": {"locale": "en_US", "type": "article", "title": "Star Wars: The Last Jedi Easter Eggs and Reference Guide", "description": "A complete list of easter eggs, references, and callbacks we found in Star Wars: The Last Jedi!", "url": "https://www.denofgeek.com/movies/star-wars-the-last-jedi-easter-eggs/", "site_name": "Den of Geek", "image": {"identifier": "https://www.denofgeek.com/wp-content/uploads/2015/09/star-wars-the-last-jedi_3-scaled.jpg?fit=2560%2C1440", "width": 2560, "height": 1440, "type": "image/jpeg"}}, "article": {"published_time": "2018-12-14T23:00:00+00:00", "modified_time": "2020-07-24T19:54:45+00:00"}, "author": "jbindeck2015", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "John Saavedra", "label2": "Est. reading time", "data2": "25 minutes"}, "parsely-title": "Star Wars: The Last Jedi Easter Eggs and Reference Guide", "parsely-link": "http://www.denofgeek.com/movies/star-wars-the-last-jedi-easter-eggs/", "parsely-type": "post", "parsely-image-url": "https://www.denofgeek.com/wp-content/uploads/2015/09/star-wars-the-last-jedi_3-scaled.jpg?resize=150%2C150", "parsely-pub-date": "2018-12-14T23:00:00Z", "parsely-section": "Movies", "parsely-author": "John Saavedra", "msapplication-TileImage": "https://www.denofgeek.com/wp-content/uploads/2020/02/favicon.geek_.purple.swirl_-1.png?fit=270%2C270"}, "movies": [], "publish_date": 1544828400.0, "source": "https://www.denofgeek.com", "summary": ""}