{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/02/05/this-is-us-finally-reveals-how-jack-pearson-died/", "text": "Gift Article Share\n\nWipe away those tears, pour in those eye drops and consider calling in sick to work Monday. After two seasons of clues and flashbacks, “This Is Us” fans finally learned how beloved patriarch-perfect-specimen-of-a-husband-and-dad Jack Pearson died. Wp Get the full experience. Choose your plan ArrowRight The NBC drama revealed the exact circumstances surrounding the death of Jack (Milo Ventimiglia) in its post-Super Bowl episode. Ads during the big game teased a “historic episode” and instructed viewers to “set your DVR for extra time.”\n\nWhile “This Is Us” is primarily a cathartic cry-fest about a family’s complex relationships, it’s sort of become a whodunit as writers kept weaving in bits and pieces about what happened to Jack. All along we know the event was so traumatic for the Pearson family that they hardly ever talk about it. (Spoilers ahead)\n\nThe last time we saw the Pearsons, a faulty slow-cooker caught fire and set their house ablaze. Sunday’s episode jumps right into the action: Jack wakes up, notices smoke, opens the door and sees a giant fire roaring. And while everyone in the house gets out, Jack ends up suffering greatly for it.\n\nIf you watched Season 1 of NBC's breakout hit \"This Is Us,\" chances are you were also crying a lot. (Video: Nicki DeMarco/The Washington Post)\n\nJacks wakes up Rebecca (Mandy Moore) and the pair goes straight away into action to get everyone to escape the house from the couple’s bedroom window. Jack manages to get Randall first. Then he goes for Kate, who is freaking out. By this point, the fire has grown in intensity, but her bedroom window is too high. The only way across the hall to the other room is for Jack to shield them with a mattress, and he burns his hands like crazy in the process. (Kevin, as you recall, is out hanging with his girlfriend, Sophie.)\n\nAdvertisement\n\nJack gets his family to safety on the lawn, but before he joins them, Kate goes into hysterics over her dog trapped in the house. As probably everyone watching at home yells, “NO!”, Jack gives that Jack look and heads back into the house. Why? “I love the girl that loves the dog,” he offers later as an explanation.\n\nFor a nerve-racking moment, the blaze intensifies, and we think that’s it. But not yet. The man made it all the way downstairs, got the dog, collected a pillowcase full of sentimental items and ran out of the front door.\n\nOf course, we know we’re not in the clear. Medics and doctors keep reminding Jack he seems fine but he inhaled a lot of smoke. Rebecca seems to take the prognosis on face-value, but something about her husband’s demeanor lets on that maybe he knows something she doesn’t. They joke in the hospital, talk about how they both forgot to get those smoke detector batteries and then Jack tells Rebecca how much he loves her: “I still got the only thing I ever needed.”\n\nSince this is 1998, Rebecca books a hotel by pay phone in the hospital, and calls Miguel to check on her kids. Meanwhile, she is entirely oblivious to what’s going on in the background. Nurses and doctors run around as Rebecca gets a candy bar from a vending machine. She’s utterly stunned after the doctor approaches her.\n\nAdvertisement\n\nJack, the doctor explains, inhaled a lot of smoke, which put a terrible stress on the lungs and his heart. He went into cardiac arrest. “It was catastrophic,” the doctor says. “I’m afraid we’ve lost him.”\n\nRebecca can’t process the news, and thinks the doctor has gone mad. She runs into Jack’s room to tell him about it but finds him on the hospital bed and we watch Mandy Moore take her character through several stages of grief in a matter of moments. The rest of the episode shows how Rebecca had to break the news to her children, and her trying to stay strong for them.\n\nSo, okay, who’s to blame here? The slow-cooker? The lack of smoke-detector batteries? That dog? Those sentimental keepsakes? (Everyone, please check your smoke detector batteries right now, thanks).\n\nThe episode also shows how each member of the Pearson family today spends their Super Bowl Sunday, the anniversary of Jack’s death (although *pushes up glasses*, it’s not the literal anniversary since the date of the Super Bowl changes each year. Moving along).\n\nAdvertisement\n\nThey’re all grappling with his passing. Kevin pours out his heart to his dad, asks for his forgiveness and tells Jack he wants to make him proud. Kate watches the tape Jack filmed of her singing. “He died because of me,” she tells Toby. “Because in the scariest moment of our lives, he couldn’t bear to disappoint me.” And Randall, in Randall fashion, wants to make Super Bowl Sunday a joyous occasion because it was his dad’s favorite day.\n\n“This Is Us” creator Dan Fogelman tweeted, “My mom died 10 years ago, unexpectedly. It’s the hinge upon which my life swings. Jack’s death is the Pearson hinge.”\n\nHe continued: “We look back. We move forward. That’s our collective journey. Sad? Yes. But when you look through a wide enough lens — it’s also outrageously beautiful.”\n\nWe also got another surprise at the end, with Deja returning to Randall and Beth. And the little boy looking for a foster home? It turns out his social worker is adult Tess (yes, Randall’s daughter), who apparently was very inspired by her parents’ example with fostering. We even got to see old Randall, who shows up to her office.\n\n“This Is Us” returns Tuesday night.\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2018/02/NUP_181159_0167.jpg&w=1440"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2018/02/NUP_181159_0167.jpg&w=1440", "keywords": [], "authors": ["Elahe Izadi"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/02/05/this-is-us-finally-reveals-how-jack-pearson-died/", "title": "‘This Is Us’ finally reveals how Jack Pearson died", "meta_data": {"description": "The post-Super Bowl episode digs into the fate of Milo Ventimiglia’s character.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/02/05/this-is-us-finally-reveals-how-jack-pearson-died/", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2018/02/NUP_181159_0167.jpg&w=1440", "title": "‘This Is Us’ finally reveals how Jack Pearson died", "description": "The post-Super Bowl episode digs into the fate of Milo Ventimiglia’s character."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "‘This Is Us’ finally reveals how Jack Pearson died", "description": "The post-Super Bowl episode digs into the fate of Milo Ventimiglia’s character."}, "last_updated_date": "2021-12-03T05:11:52.079Z", "article": {"published_time": "2018-02-05T06:05:16.000Z", "modified_time": "2021-12-03T05:11:52.079Z", "section": "Arts & Entertainment", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 70, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/02/05/this-is-us-finally-reveals-how-jack-pearson-died/"}, "movies": [], "publish_date": 1517788800.0, "source": "https://www.washingtonpost.com", "summary": ""}