{"url": "https://en.wikipedia.org/wiki/Inside_Amy_Schumer", "text": "American sketch comedy television series\n\nInside Amy Schumer is an American sketch comedy television series created and hosted by Amy Schumer. The series aired on Comedy Central from April 30, 2013 to June 16, 2016.[1] Schumer and Daniel Powell served as the show's executive producers. The show received a Peabody Award and has been nominated for eight Primetime Emmy Awards, winning two.\n\nInside Amy Schumer completed its second season on June 3, 2014, and was renewed for a third season a week later.[2] The third season premiered on April 21, 2015, with a fourth season ordered the same day,[3] which premiered one year later on April 21, 2016.[4] On January 6, 2016, the show was renewed for a fifth season.[5] In August 2016, there was speculation though that the show had been cancelled despite the earlier announcement of renewal. Schumer denied the reports via social media, stating that production of the show was going on hiatus while she focused on touring. However, she also stated that she was \"not making the show anymore\".[6] According to a March 2019 interview by The New York Times, Schumer is under contract to produce another season of the show.[7]\n\nOn February 24, 2021, it was announced that the show would be revived with five specials by Paramount+.[8] On September 20, 2022, it was reported that the five installments were no longer called specials, but instead would be the five episodes of the fifth season: two episodes debuting on October 20, with the rest releasing weekly.[9] The episodes will air on Comedy Central in the future.[10]\n\nStructure [ edit ]\n\nEach episode is divided into several segments of varying length – sketches, short excerpts of stand-up comedy and street interviews with members of the public. The vast majority of episodes finish with an interview of an unusual person, often regarding sexuality or gender roles. Amy Schumer is the only person featured in every episode and each segment.\n\nGuest stars [ edit ]\n\nEpisodes [ edit ]\n\nSeason Episodes Originally aired First aired Last aired 1 10 April 30, 2013 ( ) July 2, 2013 ( 2013-07-02 ) 2 10 April 1, 2014 ( ) June 3, 2014 ( 2014-06-03 ) 3 10 April 21, 2015 ( ) July 7, 2015 ( 2015-07-07 ) 4 9 April 21, 2016 ( ) June 16, 2016 ( 2016-06-16 ) 5 5 October 20, 2022 ( ) November 10, 2022 ( 2022-11-10 )\n\nSeason 1 (2013) [ edit ]\n\nSeason 2 (2014) [ edit ]\n\nSeason 3 (2015) [ edit ]\n\nSeason 4 (2016) [ edit ]\n\nSeason 5 (2022) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title [12] Original release date [12]\n\nReception [ edit ]\n\nAmy Schumer with the crew of Inside Amy Schumer at the 74th Annual Peabody Awards\n\nThe show has been met with generally positive reviews.[56][57][58] The first season received a weighted average score of 66 out of 100 on Metacritic based on eight critics, indicating \"generally favorable reviews\".[59] Critics were even more positive towards the second and third seasons, which received Metascores of 74 and 71 respectively.[60][61] The third season also received a 100% approval rating on Rotten Tomatoes based on reviews from 10 critics, with an average rating of 10 out of 10. The site's critical consensus states, \"Edgy and thought-provoking, Inside Amy Schumer's third season delivers more of the social relevance and self-deprecating wit that fans of the series have come to expect.\"[62] The series was honored with a Peabody Award in 2015.[63] The fourth season of the series received a score of 62 on Metacritic.[64]\n\nInternational broadcast [ edit ]\n\nIn 2014, Inside Amy Schumer began to be broadcast in Australia by the ABC until 2020; later, it moved to 10 Shake. In the United Kingdom and Ireland, it is broadcast on Viacom networks, primarily Comedy Central, Comedy Central Extra and VH1.[citation needed]\n\nAccolades [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/a/a0/Inside_Amy_Schumer.png/250px-Inside_Amy_Schumer.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Amy_Schumer_with_the_crew_of_Inside_Amy_Schumer_at_the_74th_Annual_Peabody_Awards.jpg/220px-Amy_Schumer_with_the_crew_of_Inside_Amy_Schumer_at_the_74th_Annual_Peabody_Awards.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/a/a0/Inside_Amy_Schumer.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/a/a0/Inside_Amy_Schumer.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Inside_Amy_Schumer", "title": "Inside Amy Schumer", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/a/a0/Inside_Amy_Schumer.png", "width": 640, "height": 359}, "title": "Inside Amy Schumer - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}