{"url": "https://variety.com/2018/scene/news/comedy-central-roast-bruce-willis-demi-moore-1202873581/", "text": "As the focus of this year’s Comedy Central Roast, Bruce Willis was hit with repeated jabs about his age, his marriage, his Planet Hollywood business venture, his side music career and his recent string of less-than-spectacular films — and most of them came from the surprise appearance of ex-wife Demi Moore.\n\nSaying that she was “married to Bruce for the first three ‘Die Hard’ movies, which makes sense because the last two sucked,” Moore served as an impromptu roaster as she recounted memories of raising their three daughters, who were also in attendance, together.\n\n“People wonder why our marriage came to an end, and in all honesty I think it was because some jealousy started to creep in. I think Bruce never really got over the fact that I rocked the bald look better than he did,” Moore joked. “After our divorce, he said he considered the end of our marriage his biggest failure, but Bruce, don’t be so hard on yourself, you’ve had much bigger failures. I mean Planet Hollywood, ‘Hudson Hawk,’ ‘Striking Distance,’ campaigning for Michael Dukakis, turning down Clooney’s role in ‘Ocean’s Eleven’ to focus on playing the harmonica?”\n\nOn a more sentimental note, the actress, who was married to Willis for 12 years, said their marriage included “some of the best times of my life,” praising him as “easily one of my top three husbands.” After the roast, Willis told reporters her performance was “terrific…very surprising and very cool,” and he was just as shocked as the audience about her appearance.\n\nThe roast, recorded Saturday at the Hollywood Palladium, was led by Roast Master Joseph Gordon-Levitt, along with an assorted group of roasters, including Edward Norton, Cybill Shepherd, Jeff Ross, Martha Stewart, Lil Rel Howery, Dennis Rodman, Kevin Pollak, Nikki Glaser and Dom Irrera. Although still packed with burns on Willis and jokes against Donald Trump and Harvey Weinstein, the roast was more gentle and loving than most, with essentially all of the participants speaking on what the actor has meant to them.\n\nGordon-Levitt, who played a younger version of Willis in their film “Looper,” told Variety that Willis asked him personally to host, and when prepping the material he “worked with the writers and said yes sometimes, said no a lot more.”\n\n“I was like ‘That’s not funny, that’s not funny, that’s not funny, that’s pretty funny.’ We’re just trying to make each other laugh, I actually think that there’s something cool about being able to laugh at yourself, not take things too seriously and I think it can be sort of cathartic,” Gordon-Levitt said.\n\nNorton and Shepherd walked away as the big winners of the night, with Norton’s bit focusing on how his and Willis’ careers have differed, questioning, “You get away with everything. Can I cock my eye and say some cryptic s— that literally not one person in the room understands and have everyone laugh their asses off? I cannot.”\n\nAfter continually trying to understand Willis’ success (joking it was somehow in spite of poor scripts and repeatedly doing the same type of film), Norton reflected on working with him on a recent movie, saying, “I love you, or maybe I’m a very good actor and I’m just acting when I say that. You wouldn’t know the difference, and that’s the reason I love you.”\n\nShepherd, who starred alongside “Moonlighting” with Willis and infamously fought with the actor on the project, said she hadn’t spoken to him in three decades but still agreed to be a roaster.\n\n“Our characters on ‘Moonlighting’ weren’t much of a stretch,” she said. “I played a former model, which I was, and he played an a–hole, which he is… I know we haven’t had a conversation in 30 years but we’ll always have something more important: residuals.”\n\nRodman, who attempted a pro-North Korea joke, was booed on stage, and Ross, who is also a co-executive producer on the show, arrived at the event dressed as Kim Jong-Un.\n\nAfter the taping, Ross said he “felt like this was a classier roast than we normally do. I thought it was pretty classy, he’s a movie star we classed it up with tuxedos and Martha Stewart.”\n\nWhen it came for his time to speak on stage, Willis said, “If you’re a fan of Bruce Willis movies and I know you are, then you know how this works. I get the s— beat out of me for about an hour and a half, and then at the end I come back and whip everybody’s a–,” proceeding to roast his roasters.\n\nHe ended by clarifying why he subjected himself to be the subject of a roast, which he said was to settle something once and for all: “‘Die Hard’ is not a Christmas movie. It’s a god damn Bruce Willis movie!”\n\nFollowing the event, Willis teased that he “thought I dislocated my jaw because I was laughing so hard.”\n\nBruce Willis closes out #BruceWillisRoast with a harmonica solo pic.twitter.com/BrzPQM0dhk — Kirsten Chuba (@KirstenChuba) July 15, 2018\n\nThe “Comedy Central Roast of Bruce Willis” airs on the network July 29 at 10 p.m.", "images": ["https://variety.com/wp-content/themes/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://variety.com/wp-content/uploads/2018/07/rexfeatures_9762044be_edited.jpg?w=681&h=383&crop=1", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://variety.com/wp-content/uploads/2018/07/rexfeatures_9762044be_edited.jpg?w=1000", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif"], "top_img": "https://variety.com/wp-content/uploads/2018/07/rexfeatures_9762044be_edited.jpg?w=1000", "keywords": [], "authors": ["Kirsten Chuba"], "canonical_link": "https://variety.com/2018/scene/news/comedy-central-roast-bruce-willis-demi-moore-1202873581/", "title": "Demi Moore Appears as Surprise Guest at Bruce Willis’ Comedy Central Roast", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://variety.com/wp-content/themes/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "As the focus of the Comedy Central Roast, Bruce Willis was hit with repeated jabs, including the surprise appearance of ex-wife Demi Moore.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199, "pages": 12616252196}, "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202873581, "author": "Kirsten Chuba", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-07-15T08:11:23"}, "pmc-tag": "bruce willis,Comedy Central Roast of Bruce Willis,Demi Moore", "title": "Demi Moore Appears as Surprise Guest at Bruce Willis’ Comedy Central Roast", "pageclass": "article", "pmc-vertical": "scene", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-primary-category": "News", "pmc-primary-vertical": "scene", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress 6.0.2", "author": "Kirsten Chuba", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Variety", "application-name": "Variety", "ia": {"markup_url_dev": "https://variety.com/2018/scene/news/comedy-central-roast-bruce-willis-demi-moore-1202873581/?ia_markup=1"}, "content_type": "Article", "post_id": 1202873581, "title": "Demi Moore Appears as Surprise Guest at Bruce Willis' Comedy Central Roast", "published_at": "2018-07-15 08:11:23", "image": "https://variety.com/wp-content/uploads/2018/07/rexfeatures_9762044be_edited.jpg?w=1000", "comment_count": 9, "tags": "Demi Moore", "topics": "News", "appeared_in_print": "No", "body": "As the focus of this year's Comedy Central Roast, Bruce Willis was hit with repeated jabs about his age, his marriage, his Planet Hollywood business venture, his side music career and his recent string of less-than-spectacular films -- and most of them came from the surprise appearance of ex-wife Demi Moore.\r\n\r\nSaying that she was \"married to Bruce for the first three 'Die Hard' movies, which makes sense because the last two sucked,\" Moore served as an impromptu roaster as she recounted memories of raising their three daughters, who were also in attendance, together.\r\n\r\n\"People wonder why our marriage came to an end, and in all honesty I think it was because some jealousy started to creep in. I think Bruce never really got over the fact that I rocked the bald look better than he did,\" Moore joked. \"After our divorce, he said he considered the end of our marriage his biggest failure, but Bruce, don't be so hard on yourself, you've had much bigger failures. I mean Planet Hollywood, 'Hudson Hawk,' 'Striking Distance,' campaigning for Michael Dukakis, turning down Clooney's role in 'Ocean's Eleven' to focus on playing the harmonica?\"\r\n\r\nOn a more sentimental note, the actress, who was married to Willis for 12 years, said their marriage included \"some of the best times of my life,\" praising him as \"easily one of my top three husbands.\" After the roast, Willis told reporters her performance was \"terrific...very surprising and very cool,\" and he was just as shocked as the audience about her appearance.\r\n\r\nThe roast, recorded Saturday at the Hollywood Palladium, was led by Roast Master Joseph Gordon-Levitt, along with an assorted group of roasters, including Edward Norton, Cybill Shepherd, Jeff Ross, Martha Stewart, Lil Rel Howery, Dennis Rodman, Kevin Pollak, Nikki Glaser and Dom Irrera. Although still packed with burns on Willis and jokes against Donald Trump and Harvey Weinstein, the roast was more gentle and loving than most, with essentially all of the participants speaking on what the actor has meant to them.\r\n\r\nGordon-Levitt, who played a younger version of Willis in their film \"Looper,\" told Variety that Willis asked him personally to host, and when prepping the material he \"worked with the writers and said yes sometimes, said no a lot more.\"\r\n\r\n\"I was like 'That's not funny, that's not funny, that's not funny, that's pretty funny.' We're just trying to make each other laugh, I actually think that there's something cool about being able to laugh at yourself, not take things too seriously and I think it can be sort of cathartic,\" Gordon-Levitt said.\r\n\r\nNorton and Shepherd walked away as the big winners of the night, with Norton's bit focusing on how his and Willis' careers have differed, questioning, \"You get away with everything. Can I cock my eye and say some cryptic s— that literally not one person in the room understands and have everyone laugh their asses off? I cannot.\"\r\n\r\nAfter continually trying to understand Willis' success (joking it was somehow in spite of poor scripts and repeatedly doing the same type of film), Norton reflected on working with him on a recent movie, saying, \"I love you, or maybe I'm a very good actor and I'm just acting when I say that. You wouldn't know the difference, and that's the reason I love you.\"\r\n\r\nShepherd, who starred alongside \"Moonlighting\" with Willis and infamously fought with the actor on the project, said she hadn't spoken to him in three decades but still agreed to be a roaster.\r\n\r\n\"Our characters on 'Moonlighting' weren't much of a stretch,\" she said. \"I played a former model, which I was, and he played an a--hole, which he is... I know we haven't had a conversation in 30 years but we'll always have something more important: residuals.\"\r\n\r\nRodman, who attempted a pro-North Korea joke, was booed on stage, and Ross, who is also a co-executive producer on the show, arrived at the event dressed as Kim Jong-Un.\r\n\r\nhttps://twitter.com/KirstenChuba/status/1018308346728759297\r\n\r\nAfter the taping, Ross said he \"felt like this was a classier roast than we normally do. I thought it was pretty classy, he's a movie star we classed it up with tuxedos and Martha Stewart.\"\r\n\r\nWhen it came for his time to speak on stage, Willis said, \"If you're a fan of Bruce Willis movies and I know you are, then you know how this works. I get the s— beat out of me for about an hour and a half, and then at the end I come back and whip everybody's a--,\" proceeding to roast his roasters.\r\n\r\nHe ended by clarifying why he subjected himself to be the subject of a roast, which he said was to settle something once and for all: \"'Die Hard' is not a Christmas movie. It's a god damn Bruce Willis movie!\"\r\n\r\nFollowing the event, Willis teased that he \"thought I dislocated my jaw because I was laughing so hard.\"\r\n\r\nhttps://twitter.com/KirstenChuba/status/1018367517981462529\r\n\r\nThe \"Comedy Central Roast of Bruce Willis\" airs on the network July 29 at 10 p.m.", "fragment": "!", "og": {"type": "article", "title": "Demi Moore Appears as Surprise Guest at Bruce Willis’ Comedy Central Roast", "url": "https://variety.com/2018/scene/news/comedy-central-roast-bruce-willis-demi-moore-1202873581/", "description": "As the focus of this year’s Comedy Central Roast, Bruce Willis was hit with repeated jabs about his age, his marriage, his Planet Hollywood business venture, his side music career and his rec…", "site_name": "Variety", "image": {"identifier": "https://variety.com/wp-content/uploads/2018/07/rexfeatures_9762044be_edited.jpg?w=1000", "width": 1000, "height": 562, "alt": "Demi MooreComedy Central's Roast of Bruce Willis, Show, Los Angeles, USA - 14 Jul 2018"}, "locale": "en_US"}, "article": {"published_time": "2018-07-15T15:11:23+00:00", "modified_time": "2018-07-15T15:11:23+00:00"}, "twitter": {"site": "@variety", "card": "summary_large_image", "title": "Demi Moore Appears as Surprise Guest at Bruce Willis’ Comedy Central Roast", "description": "As the focus of the Comedy Central Roast, Bruce Willis was hit with repeated jabs, including the surprise appearance of ex-wife Demi Moore.", "image": "https://variety.com/wp-content/uploads/2018/07/rexfeatures_9762044be_edited.jpg?w=1000"}}, "movies": [], "publish_date": 1531667483.0, "source": "https://variety.com", "summary": ""}