{"url": "https://web.archive.org/web/20181230190827/https://news.disneylandparis.com/en/2018/10/09/legends-of-the-force-a-celebration-of-star-wars-at-disneyland-paris-from-12-january-to-17-march-2019/", "text": "Legends of the Force – A Celebration of Star Wars at Disneyland Paris From 12 January to 17 March 2019\n\nEveryone has their own special connection to Star Wars, and that’s what makes it a truly legendary saga – whether it’s the intergalactic battles, the lightsabers or the iconic music. From 12 January to 17 March 2019, guests can celebrate their heroes and epic Star Wars moments with the new season, Legends of the Force – A Celebration of Star Wars at Disneyland Paris.\n\nRelive the greatest moments of the Star Wars saga\n\nLegends of the Force – A Celebration of Star Wars is the perfect opportunity for guests to immerse themselves in the heart of the Star Wars galaxy, following in the footsteps of iconic characters such as Chewbacca, R2-D2 and C-3PO… whilst having to confront the dark side of the force with Darth Vader and Kylo Ren.\n\nStar Wars: A Galactic Celebration\n\nAt dusk, Walt Disney Studios Park will pay spectacular homage to the Star Wars galaxy with an amazing sound and light show. Image projections, special effects and, of course, the Star Wars Characters. Sequences inspired by the film Star Wars: The Last Jedi are also on the programme, including new characters, such as faithful Resistance droid BB-8, who will be making a first appearance. But be careful, the dark side is never far away, with special scenes featuring the Empire and the First Order. It’s a totally unmissable experience.\n\nStar Wars: A Galaxy Far, Far Away\n\nThis show, which will be taking place several times a day in Production Courtyard, gives guests a chance to relive the greatest moments of the Star Wars saga, as they listen to its epic musical themes. Look out for Kylo Ren, Rey and Darth Maul during the show, and for the first time, that fearsome bounty hunter, Boba Fett.\n\nThe First Order March\n\nEach day will also feature a marching procession of First Order stormtroopers led by the menacing Captain Phasma.\n\nHave fun meeting your favourite Star Wars Characters\n\nFor the first time, guests will be able to meet Star Wars favourite, Chewbacca, a true Legend of the Resistance, at Walt Disney Studios Park. A rare encounter with the Wookiee that’s sure to be an epic experience.\n\nMeanwhile, squads of stormtroopers will patrol Production Courtyard in search of allies of the Resistance.\n\nThe Star Wars legend will also take place at Disneyland Park, where the more adventurous will be able to confront Darth Vader and brave the power of the dark side at Starport, just near the attraction Star Tours: The Adventures Continue.\n\nHead straight to the heart of the intergalactic Star Wars battles!\n\nStar Tours: The Adventures Continue\n\nFearless voyagers will be able to experience an intergalactic adventure aboard StarSpeeder 1000, as they head for some of the most iconic planets featured in the Star Wars saga. One thing is certain – this 3D experience will delight the galaxy’s most passionate fans.\n\nStar Wars Hyperspace Mountain\n\nFor guests who love thrills, they can jump on board an X-wing and join the Resistance on an epic expedition packed with excitement, as they find themselves at the very heart of the famous battle of Jakku, fighting the Galactic Empire. An unforgettable experience to the sound of the epic saga’s legendary music.", "images": ["https://web.archive.org/web/20181230190827im_/https://news.disneylandparis.com/en/wp-content/uploads/sites/2/2018/12/DLP_MARVEL-ENTRY_FINAL-4-100x70.jpg", "https://web.archive.org/web/20181230190827im_/https://news.disneylandparis.com/en/wp-content/themes/dlp21/img/dlpPressNews-en_US.png", "https://web.archive.org/web/20181230190827im_/https://news.disneylandparis.com/en/wp-content/uploads/sites/2/2015/04/MARATHON-logos_final_bleu_JPG-Copie-100x70.jpg", "https://web.archive.org/web/20181230190827im_/https://news.disneylandparis.com/en/wp-content/uploads/sites/2/2018/10/Legends-of-the-Force-1200x839.jpg", "https://web.archive.org/web/20181230190827im_/https://news.disneylandparis.com/en/wp-content/uploads/sites/2/2018/11/disney_xmas_day21868-100x70.jpg", "https://web.archive.org/web/20181230190827im_/https://news.disneylandparis.com/en/wp-content/uploads/sites/2/2018/11/DSC_3722-100x70.jpg"], "top_img": "https://web.archive.org/web/20181230190827im_/https://news.disneylandparis.com/en/wp-content/uploads/sites/2/2018/10/Legends-of-the-Force-1200x839.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20181230190827/https://news.disneylandparis.com/en/2018/10/09/legends-of-the-force-a-celebration-of-star-wars-at-disneyland-paris-from-12-january-to-17-march-2019/", "title": "Legends of the Force – A Celebration of Star Wars at Disneyland Paris From 12 January to 17 March 2019", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=yes", "og": {"locale": "en_US", "type": "article", "title": "Legends of the Force – A Celebration of Star Wars at Disneyland Paris From 12 January to 17 March 2019 | Disneyland Paris PressNews", "description": "Everyone has their own special connection to Star Wars, and that’s what makes it a truly legendary saga – whether it’s the intergalactic battles, the lightsabers or the iconic music. From 12 January to 17 March 2019, guests can celebrate their heroes and epic Star Wars moments with the new season, Legends of the Force …", "url": "https://web.archive.org/web/20181230190827/https://news.disneylandparis.com/en/2018/10/09/legends-of-the-force-a-celebration-of-star-wars-at-disneyland-paris-from-12-january-to-17-march-2019/", "site_name": "Disneyland Paris PressNews", "updated_time": "2018-10-18T11:47:45+00:00", "image": {"identifier": "https://web.archive.org/web/20181230190827im_/https://news.disneylandparis.com/en/wp-content/uploads/sites/2/2018/10/Legends-of-the-Force-1200x839.jpg", "secure_url": "https://news.disneylandparis.com/en/wp-content/uploads/sites/2/2018/10/Legends-of-the-Force-1200x839.jpg", "width": 1200, "height": 839}}, "article": {"section": "News", "published_time": "2018-10-09T13:47:42+00:00", "modified_time": "2018-10-18T11:47:45+00:00"}}, "movies": [], "publish_date": 1539039600.0, "source": "https://web.archive.org", "summary": ""}