{"url": "https://www.nbcwashington.com/news/sports/Golfer-Phil-Mickelson-Takes-Epic-Selfie-With-Obama-Bush-Clinton-448641353.html", "text": "The start of the Presidents Cup gave golf a new Big Three — former Presidents Barack Obama, George W. Bush and Bill Clinton posing with players and wives on each team in an opening ceremony unlike any other.\n\nIt was the first time the Presidents Cup — named after the highest office in the land — has had three U.S. presidents attending the matches together since the event began in 1994.\n\nThe U-shaped grandstands around the first tee at Liberty National were at capacity more than an hour before the first tee time Thursday. Most of the players were warming up on the range.\n\nPhil Mickelson, in the fifth and final match, came over early to clasp hands with all three. Then, the five-time major champion took out his phone for a selfie he might not get again.\n\nWhen you can take a selfie with three US Presidents, you do it!! pic.twitter.com/E3pNlZ07gs — Tim Mickelson (@goodwalkspoiled) September 28, 2017\n\nHe's better at golf. Mickelson only got part of his face and said later, \"I'm so bad at selfies.\"\n\nBut he knows a big moment.\n\n\"How can you not do that when you have three of our presidents?\" Mickelson said. \"And their presence really means a lot to this event. That's what it's about. It's the Presidents Cup. And for those three to come here and be a part of it was very special, and I just took advantage of the opportunity.\"\n\nAll presidents are invited to be the honorary chairman of the Presidents Cup when it is held in the United States, and all have accepted. Clinton has been the only sitting president to attend the matches, on Saturday at the Robert Trent Jones Golf Club in Virginia in 2000.\n\nThat might change. The PGA Tour was preparing for a visit by President Donald Trump on Sunday, though it has not been confirmed.\n\n\"I get excited about the fact that three individuals ascended to the highest office in the land and golf was an important part of their life and continues to be an important part of their life,\" PGA Tour Commissioner Jay Monahan said Wednesday. \"I think it's a great statement for our game.\"\n\nThere was plenty of buzz on the first tee, especially when a platform behind the tee began to fill.\n\n[NATL] Top Sports Photos: Washington Nationals Win World Series, and More\n\nAll three PGA Tour commissioners dating to 1974 were there — Monahan, Tim Finchem and Deane Beman. The loudest cheers were for Jack Nicklaus and Gary Player, who along with Arnold Palmer were the Big Three during one of the early growth periods in golf. Palmer died a year ago Monday.\n\nAnd then the U.S. presidents filled the box.\n\nMickelson got his selfie, and before long other players and assistant captains filed over to see the presidents. They stepped out of the box to stand to the back of the tee as Charl Schwartzel of South Africa and Rickie Fowler hit the respective opening tee shots.\n\n\"It was one of the most exciting moments of my life, standing there,\" Schwartzel said. \"I was looking forward to this Presidents Cup for a very long time, and I didn't expect all the presidents to be there. Just to get to meet them was a dream come true for me. Then to hit that first tee shot with the wind pumping off the right was quite intimidating.\"\n\nFowler felt the nerves, too. He also had the opening tee shot after Schwartzel hit.\n\n\"Luckily, I hit a good one, so it was a weight off my shoulders,\" he said.\n\nThe presidents then went over to greet the wives of the International and U.S. teams and stayed behind for the rest of the matches to begin.\n\nClinton and Bush met with both teams on the eve of the matches atop the Freedom Tower. U.S. captain Steve Stricker and International captain Nick Price said they struck the perfect tone for the matches with inspirational messages on countries and people coming together.\n\nPrice has been to the White House when Clinton and Obama were in office. He was no less awed by the occasion Thursday.\n\n\"Those were three of the most powerful men of their time,\" he said. \"Icons, honestly. And they all said the same thing: 'Guys, we can't pull for you, but we want you to have a good match.' They were great. Of course, you're not going to pull for us. You guys are Americans. But they're golfers, and they're great sportsmen, too. And our boys really appreciate that.\"\n\nThe comfort level was different for some players. Jordan Spieth has often said that playing with Bush allowed him not to get too intimidated by anything he faced in golf.\n\n\"It's very rare that you get three presidents in one place — very rare,\" he said. \"Should feel lucky for that. They are all avid golfers and have done a lot for the game of golf, too. It's pretty awesome to have them there.\"", "images": ["https://media.nbcwashington.com/2022/10/18928699656-1080pnbcstations.jpg?quality=85&strip=all&resize=100%2C56", "https://media.nbcwashington.com/2022/10/AP22281349654135.jpg?quality=85&strip=all", "https://media.nbcwashington.com/2021/09/William-Bradford-Bishop-and-Kathy-Gillchrist.jpg?quality=85&strip=all&resize=100%2C56", "https://media.nbcwashington.com/2019/09/OTT-Washington-DC.png?fit=1920%2C1080&quality=85&strip=all&w=400&h=44&crop=1", "https://media.nbcwashington.com/2022/10/oct-6-the-weekend-scene-lead-photo-Yellow-1.png?resize=100%2C56&quality=85&strip=all", "https://media.nbcwashington.com/2019/09/NBC@3x-7.png?fit=5761%2C3240&quality=85&strip=all", "https://media.nbcwashington.com/2019/09/DC_On_Light@3x.png?fit=558%2C120&quality=85&strip=all", "https://media.nbcwashington.com/2022/10/AP22281414206795.jpg?quality=85&strip=all", "https://sb.scorecardresearch.com/p?c1=2&c2=6035083&cv=2.0&cj=1", "https://media.nbcwashington.com/2022/10/StoneColburn-Blur.png?resize=100%2C56&quality=85&strip=all", "https://media.nbcwashington.com/2019/09/DC_On_Dark@3x-1.png?fit=558%2C120&quality=85&strip=all&w=186&h=40", "https://media.nbcwashington.com/2022/10/GettyImages-1243822858-e1665251677151.jpg?quality=85&strip=all&resize=100%2C56"], "top_img": "https://media.nbcwashington.com/2019/09/NBC@3x-7.png?fit=5761%2C3240&quality=85&strip=all", "keywords": [], "authors": ["Doug Ferguson"], "canonical_link": "https://www.necn.com/news/national-international/golfer-phil-mickelson-takes-epic-selfie-with-obama-bush-clinton/2003402/", "title": "Golfer Phil Mickelson Takes Epic Selfie With Obama, Bush and Clinton", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-image-preview:large", "generator": "WordPress 5.8.5", "og": {"site_name": "NBC4 Washington", "type": "article", "description": "The start of the Presidents Cup gave golf a new Big Three — former Presidents Barack Obama, George W. Bush and Bill Clinton posing with players and wives on each team in an opening ceremony unlike any other. It was the first time the Presidents Cup — named after the highest office in the land — has had three U.S. presidents attending the matches together since the event began in 1994. Phil Mickelson, in the fifth and final match, came over early to clasp hands with all three. Then, the five-time major champion took out his phone for a selfie he might not get again.", "title": "Golfer Phil Mickelson Takes Epic Selfie With Obama, Bush and Clinton", "url": "https://www.nbcwashington.com/news/national-international/golfer-phil-mickelson-takes-epic-selfie-with-obama-bush-clinton/2021303/", "image": "https://media.nbcwashington.com/2019/09/NBC@3x-7.png?fit=5761%2C3240&quality=85&strip=all"}, "google-site-verification": "V-1N4cprg5uHAuJD5dPgh6lkKjRpqioG6aoxsXIEZfc", "fb": {"app_id": 168641655540}, "twitter": {"card": "summary_large_image", "site": "@nbcwashington", "creator": "@nbcwashington", "description": "The start of the Presidents Cup gave golf a new Big Three — former Presidents Barack Obama, George W. Bush and Bill Clinton posing with players and wives on each team in an opening ceremony unlike any other. It was the first time the Presidents Cup — named after the highest office in the land — has had three U.S. presidents attending the matches together since the event began in 1994. Phil Mickelson, in the fifth and final match, came over early to clasp hands with all three. Then, the five-time major champion took out his phone for a selfie he might not get again.", "title": "Golfer Phil Mickelson Takes Epic Selfie With Obama, Bush and Clinton", "url": "https://www.nbcwashington.com/news/national-international/golfer-phil-mickelson-takes-epic-selfie-with-obama-bush-clinton/2021303/", "image": "https://media.nbcwashington.com/2019/09/NBC@3x-7.png?fit=5761%2C3240&quality=85&strip=all"}, "article": {"opinion": "false", "content_tier": "free", "publisher": "http://www.facebook.com/nbcwashington"}, "description": "The start of the Presidents Cup gave golf a new Big Three — former Presidents Barack Obama, George W. Bush and Bill Clinton posing with players and wives on...", "keywords": "Captain, Commissioner, Danielle Abreu, Donald Trump, Doug Ferguson, George W. Bush, golf, Jack Nicklaus, Jordan Spieth, PGA Tour", "sailthru.title": "Golfer Phil Mickelson Takes Epic Selfie With Obama, Bush and Clinton", "sailthru.description": "The start of the Presidents Cup gave golf a new Big Three — former Presidents Barack Obama, George W. Bush and Bill Clinton posing with players and wives on...", "sailthru.tags": "Captain, Commissioner, Danielle Abreu, Donald Trump, Doug Ferguson, George W. Bush, golf, Jack Nicklaus, Jordan Spieth, PGA Tour", "sailthru.type": "article", "sailthru.date": "2017-09-29T08:56:38+00:00", "msapplication-TileImage": "https://media.nbcwashington.com/2019/09/cropped-NBC_Washington.png?fit=270%2C270&quality=85&strip=all"}, "movies": [], "publish_date": 1506675398.0, "source": "https://www.nbcwashington.com", "summary": ""}