{"url": "https://en.wikipedia.org/wiki/Johnny_McDaid", "text": "Musician, songwriter and music producer from Northern Ireland\n\nMusical artist\n\nJohn McDaid (born 24 July 1976)[1] is a singer, songwriter, musician, and record producer from Northern Ireland.[2] He is a member of the band Snow Patrol and has written songs with other artists including Ed Sheeran, P!nk, and Robbie Williams.\n\nEarly life [ edit ]\n\nOne of six children of John and Pauline McDaid,[1] McDaid attended St Brigid's Primary School,[3] Carnhill,[1] and St Columb's College.[1]\n\nCareer [ edit ]\n\nMcDaid was the singer and songwriter of the band Vega4, whose second album You and Others was produced by Jacknife Lee. Its first single, \"Life Is Beautiful\", was featured on the US Contemporary Radio Charts Top 40 for 12 weeks in 2007,[citation needed] and was the song used for the theatrical trailer of My Sister's Keeper.[citation needed] In 2009, McDaid was the first person to sign to Snow Patrol's publishing company, Polar Patrol Publishing.[4]\n\nMcDaid went on to play guitar and piano and sing backing vocals in the alternative rock band Snow Patrol. While on the road with Snow Patrol, McDaid was developing his unique style of writing and working with artists in a variety of genres, scoring a hit with Example's \"Say Nothing\" which went to number 2 in the UK singles chart in 2012.[5]\n\nIn January 2013, McDaid and Gary Lightbody performed at the \"Sons & Daughters\" concert in Derry, McDaid's hometown, to mark the opening of the city's UK City of Culture year.[6] In early 2013, McDaid moved to Nashville, Tennessee with singer-songwriter Ed Sheeran to work with him on his second album. Sheeran and McDaid are close friends and later moved to Los Angeles together to continue working on Sheeran's second record.[7] In November 2013, Sheeran posted a picture of himself and McDaid on Instagram stating that they had been making the record together for two years and that it was now complete.[8] Sheeran's X album was released in June 2014 with McDaid having co-written seven of the songs, including \"Photograph\", which went on to go platinum and win a BMI Pop Award, and hit song \"Bloodstream\", which was nominated for Best Song Musically and Lyrically at the 2016 Ivor Novello Awards. The album was nominated for Album of the Year at the 57th Grammy Awards, McDaid's first Grammy nomination. While the album did not go on to win the Grammy, it did go on to with the 2015 BRIT Award for Album of the Year.\n\nWhile spending much of 2016 working with Ed Sheeran on his third studio album, Johnny also co-wrote \"Love My Life\" with Robbie Williams & Gary Go from Robbie Williams \"The Heavy Entertainment Show\" album.[9] The first two singles from Ed Sheeran's ÷ album came out in January 2017 and included, Johnny's co-written \"Shape of You\" which has since become the most streamed song of all time with over 3 billion streams.[10] Johnny produced 3 tracks and co-wrote 8 on the album.[11] \"Shape of You\" went on to win BMI Pop Song of the Year as well as the Ivor Novello award for Most Performed Work.[12][13]\n\nIn 2017 Johnny co-wrote Faith Hill & Tim McGraw's single \"The Rest Of Our Life\",[14] Anderson East's single \"All On My Mind\",[15] and Jamie Lawson's \"Can't See Straight\".[16] Additionally, he co-wrote P!nk's single \"What About Us\" from her album Beautiful Trauma.[17] The single, co-written with P!nk and Steve Mac, was received with rave views and debuted at No1 in 26 Markets globally. DJ Snake released his single \"A Different Way\" featuring Lauv, which was the third Ed Sheeran, Steve Mac, Johnny McDaid collaboration to be released.[18] In November 2017, Johnny became an Honorary Fellow of The Institute of Irish Studies at the University of Liverpool.[19]\n\nReleased in 2018, Johnny co-wrote and produced Keith Urban's single \"Parallel Line\" [20] and co-wrote Shawn Mendes \"Fallin' All In You\" from his self-titled and third studio album.[21] In 2018, Snow Patrol released their 7th studio album titled Wildness.[22] The album debuted as #2 on the UK album charts.[23] He also won the IMRO Outstanding Achievement Award with which he was presented in February 2018.[24]\n\nIn 2019, Johnny McDaid co-wrote \"Broken & Beautiful\" by Kelly Clarkson, which was featured in the movie UglyDolls.[25] Johnny also co-wrote and produced Alicia Keys \"Underdog\" and \"Authors Of Forever\" from her seventh studio album 'ALICIA'.[26]\n\nJohnny spent the majority of 2020 and 2021 working with Ed Sheeran on his = album on which he ended up as a producer on 9 songs, a co-writer on 10, including the UK #1 singles \"Bad Habits\" (nominated for Song of the Year at the 2022 Grammys) and \"Shivers\". The album was executive produced by Ed Sheeran, FRED, and Johnny.[27]\n\nPersonal life [ edit ]\n\nMcDaid began dating actress Courteney Cox in late 2013.[28] The couple announced their engagement on 26 June 2014.[29] In 2019, Cox announced that the couple broke off their engagement but are still in a relationship.\n\nMcDaid lives in London and divides his time between the UK and the US, where Cox lives.[30]\n\nMcDaid has a tattoo on his left arm reading Nuair is gá dom filleadh abhaile, is tú mo réalt eolais (\"When I need to get home you're my guiding light\"), an Irish translation of the song \"Guiding Light\" by fellow Northern Irish musician Foy Vance. Ed Sheeran and Vance both have the same tattoo, as does McDaid's younger sister Maev. The song was written for McDaid's late father, John McDaid, Sr., who died in July 2011. \"Guiding Light\" was recorded with Sheeran featured on vocals, and Vance on vocals and piano.[31][32]\n\nSongwriting and production credits [ edit ]\n\n\n\n\n\nReferences [ edit ]\n\nSources [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Snow_Patrol_-_2018153204415_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0578_-_B70I1885_%28cropped%29.jpg/220px-Snow_Patrol_-_2018153204415_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0578_-_B70I1885_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Snow_Patrol_-_2018153204415_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0578_-_B70I1885_%28cropped%29.jpg/1200px-Snow_Patrol_-_2018153204415_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0578_-_B70I1885_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Snow_Patrol_-_2018153204415_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0578_-_B70I1885_%28cropped%29.jpg/1200px-Snow_Patrol_-_2018153204415_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0578_-_B70I1885_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Johnny_McDaid", "title": "Johnny McDaid", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Snow_Patrol_-_2018153204415_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0578_-_B70I1885_%28cropped%29.jpg/640px-Snow_Patrol_-_2018153204415_2018-06-02_Rock_am_Ring_-_1D_X_MK_II_-_0578_-_B70I1885_%28cropped%29.jpg", "width": 640, "height": 916}, "title": "Johnny McDaid - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}