{"url": "http://abcnewsradioonline.com/music-news/2014/10/27/sam-hunt-reveals-the-meaning-behind-his-album-title-monteval.html", "text": "Image Courtesy Universal Music GroupSam Hunt's debut album, Montevallo, is now in stores featuring his breakthrough hit \"Leave the Night On.\"\n\nThe album title comes from the name of a city in Alabama about 25 minutes south of Birmingham. Sam played football at the University of Alabama at Birmingham before moving to Nashville. Once he got to Music City, Sam ended up dating a girl who lived down in Montevallo. Though that relationship is now over, that girl is the main inspiration for the songs Sam wrote and recorded for his debut project.\n\nHe tells ABC News Radio, \"I spent a lot of time talking to her about songs. I probably should have included her as a co-writer on a lot of these songs because I spent a lot of time chatting with her.\"\n\nSpending so much time with that girl made Sam tap into a vulnerable side of himself he hadn't been able to display on the football field.\n\n\"I got a lot of insight into females in general from being in a close relationship with her,\" Sam says. \"I used a lot of that when writing on the songs, because a lot of the songs are relationship-based. I didn't want it to be just extra-macho.\"\n\nWhile Sam shows his sensitive side on songs like \"Break Up in a Small Town\" and \"Take Your Time,\" he also comes off as a very confident guy on other tracks such as \"House Party,\" \"Speakers\" and \"Leave the Night On.\"\n\nSam explains, \"You know, I think there is a side of me personally that can be vulnerable, and there's also a side that can be the opposite of that.\"\n\nHe adds, \"I think it takes a strength to be vulnerable, so it is a weird paradox there that I think sort of happens on the album.\"\n\nLook for Sam to perform a song from Montevallo on ABC's Good Morning America on Tuesday and Live with Kelly & Michael on Thursday.\n\nFollow @ABCNewsRadio\n\nCopyright 2014 ABC News Radio", "images": ["http://c.statcounter.com/4890009/0/dcd35c0c/1/", "http://pixel.quantserve.com/pixel/p-53469zSReurz-.gif", "http://abcnewsradioonline.com/universal/images/transparent.png", "http://abcnewsradioonline.com/storage/layout/new-banner0102.png", "http://abcnewsradioonline.com/storage/music-news-images/M_SamHuntMontevalloCoverBoxed.jpg?__SQUARESPACE_CACHEVERSION=1414186093042"], "top_img": "http://abcnewsradioonline.com/storage/music-news-images/M_SamHuntMontevalloCoverBoxed.jpg?__SQUARESPACE_CACHEVERSION=1414186093042", "keywords": [], "authors": [], "canonical_link": "http://abcnewsradioonline.com/", "title": "ABC News Radio", "meta_data": {"Robots": "index,follow", "description": "Music News From ABC News Radio", "og": {"title": "ABC News Radio", "description": "ABC News Radio. Trusted. Credible. Complete. Online. America's largest commercial radio news network.", "image": "http://abcnewsradioonline.com/storage/abcnewsradio.png", "type": "News", "url": "http://abcnewsradioonline.com/", "site_name": "ABC News Radio"}, "fb": {"app_id": 111042768157, "admins": "USER_ID"}}, "movies": [], "publish_date": 1414368000.0, "source": "http://abcnewsradioonline.com", "summary": ""}