{"url": "https://en.wikipedia.org/wiki/Married_at_First_Sight_(Australian_TV_series)", "text": "Australian reality television series\n\nMarried at First Sight Title card Genre Reality television Directed by Ryan Potter Starring John Aiken\n\nMel Schilling (2016–)\n\nAlessandra Rampolla (2021-)\n\nSabina Read (2015)\n\nTrisha Stratford (2015-20) Narrated by Georgie Gardner Country of origin Australia Original language English No. of seasons 9 No. of episodes 197 Production Executive producers Tara McWilliams\n\nJohn Walsh Production locations Sydney, New South Wales Running time 60–90 minutes Production company Endemol Australia Release Original network Nine Network Picture format 576i (SDTV)\n\n1080i (HDTV) (2016- ) Audio format Stereo Original release 18 May 2015 ( ) –\n\npresent\n\nMarried At First Sight is an Australian reality television adaptation of the Danish series of the same name. The show features a group of strangers who participate in a social experiment and are paired together by experts.[1] Legal restrictions in Australia mean that the couples do not partake in a legally-binding marriage as prohibited by the Marriage Act 1961. Rather, contestants engage in an unofficial commitment ceremony.[2] The series first premiered on the 18 May 2015 on the Nine Network.[3] The show has had nine seasons between 2015 and 2022,[4] plus a two-part reunion special which was broadcast before the 2021 season.[5]\n\nPremise [ edit ]\n\nCouples meet for the first time at the altar, before spending their wedding night in a hotel and then embarking on a honeymoon. Upon return, they live together for a period of time and each week decide whether they will continue their relationship at a commitment ceremony where they can choose to either stay or leave. The experts encourage contestants to fully immerse themselves within all stages of the experiment which focuses on relationship building and companionship.\n\nSeason 1 (2015) [ edit ]\n\nIn the first episode, two couples (Michael & Roni, Clare & Lachlan) met and wed in Melbourne and Sydney respectively. In the second episode, another two couples (Zoe & Alex, Michelle & James) met and wed in Melbourne and Sydney.\n\nThe Nine Network announced on 26 June 2015 that Lachlan would participate in the network's upcoming revival of The Farmer Wants a Wife.[6]\n\nCouple profiles [ edit ]\n\nNo. Couple Age Home Occupation Honeymoon Final Decision Status 1 Clare Tamas 37 Sydney, New South Wales Marketing manager Gold Coast, Queensland Yes Separated[7] Lachlan McAleer 36 Sydney, New South Wales Farmer 2 Roni Azzopardi 32 Melbourne, Victoria Payroll manager Wanaka, New Zealand Broke up before final decision Separated Michael O'Dea 31 Melbourne, Victoria Event manager 3 Zoe Hendrix 25 Melbourne, Victoria Digital marketing executive Whitsunday Islands Yes Separated with child[8][9] Alex Garner 29 Melbourne, Victoria Plumber 4 Michelle Worsley 34 Sydney, New South Wales Communications manager Darwin, Northern Territory Yes Separated[10] James Webster 36 Sydney, New South Wales Sign writer\n\nSeason 2 (2016) [ edit ]\n\nIn the first episode, two couples (Erin & Bryce, Christie & Mark) meet and wed in Melbourne and Sydney. In the second episode, another two couples (Clare & Jono, Simone & Xavier) met and wed in Melbourne and Sydney respectively.\n\nCouple profiles [ edit ]\n\nNo. Couple Age Home Occupation Honeymoon Final Decision Status 1 Erin Bateman 26 Melbourne, Victoria Retail Manager Palm Cove, Queensland Yes Together[11] Bryce Mohr 31 Melbourne, Victoria Business analyst 2 Christie Jordee 39 Sydney, New South Wales Business Owner New Caledonia Yes Separated[12] Mark Hughes 36 Gippsland, Victoria Farmer 3 Clare Verrall 32 Melbourne, Victoria Recruitment Consultant Northern Territory Broke up before final decision Separated Jono Pitman 28 Melbourne, Victoria Tradie 4 Simone Lee Brennan 29 Sydney, New South Wales Make-up artist Fiji No Separated Xavier Forsberg 26 Sydney, New South Wales Sales manager\n\nSeason 3 (2016) [ edit ]\n\nSeason 3 was the first to feature five couples, including the series' first same-sex couple.[13] In the first episode, two couples (Nicole & Keller, Monica & Mark) met and wed in Brisbane and Sydney. In the second episode, another two couples (Jess & Dave, Bella & Michael) met and wed in Sydney and Brisbane. In the third episode, one more couple (Craig & Andy) met and wed in New Zealand.\n\nCouple profiles [ edit ]\n\nNo. Couple Age Home Occupation Honeymoon Final Decision Status 1 Nicole Heir 28 Gold Coast, Queensland Teacher Cook Islands Yes Separated[14] Craig Keller 26 Brisbane, Queensland Mechanical fitter 2 Monica Vanderkley 28 Sydney, New South Wales Project manager Lord Howe Island Yes Separated[14] Mark Ellam 30 Sydney, New South Wales Firefighter 3 Jess Wardrop 31 Sydney, New South Wales Bank officer Byron Bay, New South Wales Broke up before final decision Separated Dave Crisp 28 Melbourne, Victoria Account manager 4 Bella Frizza 30 Gold Coast, Queensland Radio announcer Port Douglas, Queensland Yes Separated[14] Michael Hughes 32 Brisbane, Queensland Fashion accessories designer 5 Craig Roach 41 Gold Coast, Queensland Hairdresser Queenstown, New Zealand Broke up before final decision Separated Andy Ankers 41 Sydney, New South Wales Global account director\n\nSeason 4 (2017) [ edit ]\n\nIn the first episode, two couples (Cheryl & Jonathan, Susan & Sean) met and wed in Sydney and Melbourne. In the second episode, another two couples (Scarlett & Michael, Nadia & Anthony) met and wed in Sydney. In the third episode, two more couples (Alene & Simon, Vanessa & Andy) met and wed in Sydney and Melbourne respectively. In the fourth episode, another two couples (Lauren & Andrew, Deborah & John) met and wed in Sydney. In the fifth episode, two of the women were twins and they were all married in the same ceremony in Perth, (Michelle & Jesse, Sharon & Nick). In the ninth episode two previous contestants were matched up (Andrew & Cheryl).\n\nSeason 5 (2018) [ edit ]\n\nIn the first episode, the first two couples (Tracey & Dean, Sarah & Telv) met and wed in Sydney and Melbourne.[15] In the second episode, another two couples (Jo & Sean, Alycia & Mat) met and wed in Sydney and Melbourne.[16] In the third episode, two more couples (Davina & Ryan, Charlene & Patrick) met and wed in Warrawong and Melbourne.[17] In the fifth episode, two more couples (Ashley & Troy, Melissa & John (a returning groom from season 4)) met and wed in Gold Coast and Melbourne.[18] In the sixth episode, another two couples (Gabrielle & Nasser, Carly & Justin) met and wed in Sydney.[19] In the seventh episode, the final couple (Blair & Sean) met and wed in Sydney.[20]\n\nSeason 6 (2019) [ edit ]\n\nIn the first episode, two couples (Jules & Cameron, Cyrell & Nic) met and wed in Sydney.[21] In the second episode, two more couples (Jessika & Mick, Melissa & Dino) met and wed in Byron Bay and Hawkesbury River, both in New South Wales.[22] In the third episode, another two couples (Heidi & Mike, Ning & Mark) met and wed in Byron Bay and Melbourne.[23] In the fifth episode, two more couples (Lauren & Matthew, Elizabeth & Sam) met and wed in Byron Bay and Hawkesbury River.[24] In the sixth episode, the last two couples (Ines & Bronson, Martha & Michael) met and wed in Byron Bay and Melbourne.[25] In the eighteenth episode, two new couples (Susie & Billy, Tamara & Dan) met and wed in Sydney.[26]\n\nThe experts had to decide on a controversial request by Dan and Jess who wanted to leave their respective \"spouses\" but remain in the experiment as a couple. The experts allowed the couple to leave their previous matches and stay in the experiment as a new couple.[27]\n\nSeason 7 (2020) [ edit ]\n\nIn the first episode, the first two couples (Poppy & Luke, Cathy & Josh) met and wed in Bilpin and Wyong Creek, both in New South Wales.[28] In the second episode, another two couples (Natasha & Mikey, Amanda & Tash) met and wed in Stanwell Tops and Melbourne.[29] In the third episode, another two couples (Hayley & David, Vanessa & Chris) met and wed in Melbourne and Sydney.[30] In the fifth episode, two more couples (Connie & Jonethen, Aleks & Ivan) met and wed in Melbourne and Sydney.[31] In the sixth episode, the last two couples (Mishel & Steve, Stacey & Michael) met and wed in Melbourne.[32] In the eighteenth episode, two new couples (Elizabeth & Seb, KC & Drew) met and wed in Sydney and Central Coast.[33]\n\nReunion specials (2021) [ edit ]\n\nAfter Season 8 was delayed by three weeks due to a delayed Australian Open, the Nine Network commissioned a two part reunion special to fill the programming gap.[34][35] Part 1 centered around a dinner party, whereas Part 2 focused on experts John Aiken and Mel Schilling catching up with each participant, where they reflected on their lives following their time in the experiment.\n\nPart 1 aired on 31 January 2021. Part 2 was scheduled to air on 7 February 2021, however was brought forward to 1 February 2021, as counter-programming to the Seven Network's premiere of Holey Moley.[37]\n\nParticipants [ edit ]\n\nParticipant Season Dean Wells Season 5 Tracey Jewel Season 5 Cyrell Paule Season 6 Ines Bašić Season 6 Jessika Power Season 6 Martha Kalifatidis Season 6 Michael Brunelli Season 6 Sarah Roza Season 5 Nasser Sultan Season 5 Troy Delmege Season 5 Ashley Irvin Season 5 Mike Gunner Season 6 Charlene Perera Season 5 Jo McPharlin Season 5 Ryan Gallagher Season 5 Elizabeth Sobinoff Season 6 & 7 Sebastian Guilhaus Season 7\n\nSeason 8 (2021) [ edit ]\n\nIn the first episode, two couples (Melissa & Bryce, Rebecca & Jake) met and wed in Richmond and Hunter Valley, both in New South Wales.[38] In the second episode, three more couples (Samantha & Cameron, Booka & Brett, Coco & Sam) met and wed in Sydney and Hunter Valley.[39] In the third episode, another two couples (Alana & Jason, Joanne & James) met and wed in Sydney and Vaucluse.[40] In the fifth episode, two more couples (Belinda & Patrick, Beth & Russell) met and wed in the Hunter Valley and Sydney.[41] In the fourteenth episode, an additional two couples (Kerry & Johnny, Georgia & Liam) met and wed in Richmond and Helensburgh, both in New South Wales.[42] In the fifteenth episode, the final couple Jaimie & Chris met and wed in Sydney.[43][44]\n\nSeason 9 (2022) [ edit ]\n\nIn the first episode, two couples (Selin & Anthony, Tamara & Brent) met and wed in Richmond and Sydney.[45] In the second episode, two more couples (Domenica & Jack, Ella & Mitch) met and wed in Helensburgh and Sydney.[46] In the third episode, another two couples (Holly & Andrew, Selina & Cody) met and wed in Sydney and Cattai, New South Wales.[47] In the fifth episode two more couples (Olivia & Jackson, Samantha & Al) met and wed in Sydney.[48] In the fourteenth episode, an additional two couples (Kate & Matt, Carolina & Dion) met and wed in Sydney and Oatlands, New South Wales.[49] In the fifteenth episode, the final couple Jessica & Daniel met and wed in Richmond, New South Wales.[50]\n\nViewership [ edit ]\n\nSeason ratings [ edit ]\n\nSeason Episodes Originally aired Preliminary Consolidated Season premiere Season finale Average viewers Average rank Average viewers Average rank 1 6 18 May 2015 22 June 2015 1.115 #4 1.195 #3 2 7 4 April 2016 27 April 2016 0.915 #7 0.999 #6 3 8 29 August 2016 13 September 2016 0.880 #7 0.970 #5 4 29 30 January 2017 3 April 2017 1.081 #3 1.186 #2 5 32 29 January 2018 21 March 2018 1.223 #1 1.328 #1 6 41 28 January 2019 8 April 2019 1.323 #1 1.432 #1 7 36 3 February 2020 5 April 2020 1.102 #2 1.215 #1 RS 2 31 January 2021 1 February 2021 0.824 #6 0.980 #4 8 32 22 February 2021 18 April 2021 1.021 #2 1.121 #1 9 37 31 January 2022 4 April 2022 0.946 #3 1.045 #1\n\nSeason 1 (2015) [ edit ]\n\nNo. Title Air date Overnight ratings Consolidated ratings Total\n\nviewers Ref(s) Viewers Rank Viewers Rank 1 Episode 1 18 May 2015 1,134,000 5 65,000 2 1,199,000 [51][52] 2 Episode 2 25 May 2015 1,103,000 4 77,000 2 1,180,000 [53][54] 3 Episode 3 1 June 2015 1,116,000 3 84,000 3 1,200,000 [55][56] 4 Episode 4 8 June 2015 971,000 7 99,000 6 1,070,000 [57][58] 5 Episode 5 15 June 2015 1,079,000 3 85,000 2 1,164,000 [59][60] 6 Episode 6 22 June 2015 1,290,000 1 71,000 1 1,361,000 [61][62]\n\nSeason 2 (2016) [ edit ]\n\nNo. Title Air date Overnight ratings Consolidated ratings Total\n\nviewers Ref(s) Viewers Rank Viewers Rank 1 Episode 1 4 April 2016 771,000 13 86,000 9 857,000 [63][64] 2 Episode 2 5 April 2016 905,000 6 91,000 5 996,000 [65][66] 3 Episode 3 11 April 2016 874,000 8 62,000 7 936,000 [67][68] 4 Episode 4 12 April 2016 880,000 8 85,000 6 965,000 [69][70] 5 Episode 5 18 April 2016 899,000 6 122,000 7 1,021,000 [71][72] 6 Episode 6 19 April 2016 831,000 9 93,000 8 924,000 [73][74] 7 Finale Follow Up 27 April 2016 1,048,000 1,110,000 4 1 66,000 66,000 2 1 1,114,000 1,176,000 [75][76]\n\nSeason 3 (2016) [ edit ]\n\nNo. Title Air date Overnight ratings Consolidated ratings Total\n\nviewers Ref(s) Viewers Rank Viewers Rank 1 Episode 1 29 August 2016 805,000 11 74,000 7 879,000 [77][78] 2 Episode 2 30 August 2016 810,000 7 60,000 7 870,000 [79][80] 3 Episode 3 31 August 2016 788,000 9 79,000 7 867,000 [81][82] 4 Episode 4 5 September 2016 843,000 8 97,000 6 940,000 [83][84] 5 Episode 5 6 September 2016 919,000 5 93,000 4 1,012,000 [85][86] 6 Episode 6 7 September 2016 974,000 2 117,000 1 1,091,000 [87][88] 7 Episode 7 12 September 2016 814,000 9 100,000 8 914,000 [89][90] 8 Episode 8 13 September 2016 1,083,000 3 101,000 1 1,184,000 [91][92]\n\nReunion Specials (2021) [ edit ]\n\nNo. Title Air date Overnight ratings Consolidated ratings Total\n\nviewers Ref(s) Viewers Rank Viewers Rank 1 Part 1 31 January 2021 866,000 4 165,000 1 1,031,000 [93][94] 2 Part 2 1 February 2021 781,000 7 148,000 6 929,000 [95][96]\n\nControversy and legality [ edit ]\n\nBefore the first season went to air, an online petition calling for the series to be axed attracted over 15,000 signatures.[97]\n\nContestants have also criticised the show, such as second season participant Simone Lee Brennan described the program as \"never [being] portrayed to its full authenticity,\" suggesting the man she had been paired with, Xavier Forsberg, had been recruited by producers and was seeking a sports-presenting role rather than a relationship.[98]\n\nAt the show's commitment ceremonies, each person writes \"leave\" or \"stay\", and participants can only leave the \"marriage\" if both they and their \"spouse\" write \"leave\". This has been criticised as sending \"the worst possible message\" to people who may be in a toxic relationship.[99]\n\nSome of the contestants of the show have also spoken out against the program claiming it to be fake, including Dean Wells from Season 5[100] Other former contestants have been abused in the street, received death threats online, attempted suicide, or been taken to a psychiatric hospital.[101]\n\nInternational [ edit ]\n\nBroadcasters [ edit ]\n\nIn The Netherlands the show is called \"Married at First Sight\" and is broadcast at primetime on RTL 4.\n\nIn Belgium the show is broadcast as Blind getrouwd - Australië and runs every weekday on the Flemish channel VTM2.\n\nIn Spain, the show is broadcast as Casados a ciegas and runs every weekday from 6:15 pm for three hours each day on TEN.[102]\n\nIn the United Kingdom, in 2020, E4 aired the fourth series (2017), following this the fifth series (2018) was aired and then in early 2021, the sixth series (2019) was broadcast on the channel. By 2021 the series had become a hit with British audiences, earning a number of celebrity fans that included Sam Smith,[103] Michael Ball, and Duncan James.\n\nIn New Zealand, the show is broadcast on Three and screens four nights per week.\n\nIn the United States, the show is broadcast on cable network Lifetime on Wednesdays and Thursdays at 9pm ET/PT.[104]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/5/5e/Married_at_First_Sight.png/250px-Married_at_First_Sight.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/5/5e/Married_at_First_Sight.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/5/5e/Married_at_First_Sight.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Married_at_First_Sight_(Australian_TV_series)", "title": "Married at First Sight (Australian TV series)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/5/5e/Married_at_First_Sight.png", "width": 640, "height": 352}, "title": "Married at First Sight (Australian TV series) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}