{"url": "https://www.newyorker.com/magazine/2018/08/06/les-moonves-and-cbs-face-allegations-of-sexual-misconduct", "text": "Content This content can also be viewed on the site it originates from.\n\nFor more than twenty years, Leslie Moonves has been one of the most powerful media executives in America. As the chairman and C.E.O. of CBS Corporation, he oversees shows ranging from “60 Minutes” to “The Big Bang Theory.” His portfolio includes the premium cable channel Showtime, the publishing house Simon & Schuster, and a streaming service, CBS All Access. Moonves, who is sixty-eight, has a reputation for canny hiring and project selection. The Wall Street Journal recently called him a “TV programming wizard”; the Hollywood Reporter dubbed him a “Wall Street Hero.” In the tumultuous field of network television, he has enjoyed rare longevity as a leader. Last year, according to filings with the Securities and Exchange Commission, he earned nearly seventy million dollars, making him one of the highest-paid corporate executives in the world.\n\nIn recent months, Moonves has become a prominent voice in Hollywood’s #MeToo movement. In December, he helped found the Commission on Eliminating Sexual Harassment and Advancing Equality in the Workplace, which is chaired by Anita Hill. “It’s a watershed moment,” Moonves said at a conference in November. “I think it’s important that a company’s culture will not allow for this. And that’s the thing that’s far-reaching. There’s a lot we’re learning. There’s a lot we didn’t know.”\n\nBut Moonves’s private actions belie his public statements. Six women who had professional dealings with him told me that, between the nineteen-eighties and the late aughts, Moonves sexually harassed them. Four described forcible touching or kissing during business meetings, in what they said appeared to be a practiced routine. Two told me that Moonves physically intimidated them or threatened to derail their careers. All said that he became cold or hostile after they rejected his advances, and that they believed their careers suffered as a result. “What happened to me was a sexual assault, and then I was fired for not participating,” the actress and writer Illeana Douglas told me. All the women said they still feared that speaking out would lead to retaliation from Moonves, who is known in the industry for his ability to make or break careers. “He has gotten away with it for decades,” the writer Janet Jones, who alleges that she had to shove Moonves off her after he forcibly kissed her at a work meeting, told me. “And it’s just not O.K.”\n\nThirty current and former employees of CBS told me that such behavior extended from Moonves to important parts of the corporation, including CBS News and “60 Minutes,” one of the network’s most esteemed programs. During Moonves’s tenure, men at CBS News who were accused of sexual misconduct were promoted, even as the company paid settlements to women with complaints. It isn’t clear whether Moonves himself knew of the allegations, but he has a reputation for being closely involved in management decisions across the network. Some of the allegations, such as those against the former anchor Charlie Rose, as reported by the Washington Post, have already become public. Other claims are being reported here for the first time. Nineteen current and former employees told me that Jeff Fager, the former chairman of CBS News and the current executive producer of “60 Minutes,” allowed harassment in the division. “It’s top down, this culture of older men who have all this power and you are nothing,” one veteran producer told me. “The company is shielding lots of bad behavior.”\n\nIn a statement, Moonves said, “Throughout my time at CBS, we have promoted a culture of respect and opportunity for all employees, and have consistently found success elevating women to top executive positions across our company. I recognize that there were times decades ago when I may have made some women uncomfortable by making advances. Those were mistakes, and I regret them immensely. But I always understood and respected—and abided by the principle—that ‘no’ means ‘no,’ and I have never misused my position to harm or hinder anyone’s career. This is a time when we all are appropriately focused on how we help improve our society, and we at CBS are committed to being part of the solution.” According to CBS, there have been no misconduct claims and no settlements against Moonves during his twenty-four years at the network. A statement from the company said, “CBS is very mindful of all workplace issues and takes each report of misconduct very seriously. We do not believe, however, that the picture of our company created in The New Yorker represents a larger organization that does its best to treat its tens of thousands of employees with dignity and respect. We are seeing vigorous discourse in our country about equality, inclusion, and safety in the workplace, and CBS is committed to being part of the solution to those important issues.”\n\nThe allegations are surfacing at a time when CBS is engaged in an increasingly acrimonious fight with its former parent company, Viacom, which acquired CBS in 1999 and spun it off as a separate entity seven years later. A holding company founded by the mogul Sumner Redstone still owns a majority stake in both Viacom and CBS, and Redstone’s daughter and heir, Shari Redstone, has sought to reunite the businesses. Moonves has resisted the move, and in May Redstone’s holding company and CBS filed lawsuits against each other. All of the women making allegations against Moonves began speaking to me before the current lawsuits, in independent interviews carried out during the past eight months. All said that they were not motivated by any allegiance in the corporate battle. But several felt that this was an opportunity to examine a workplace culture that many of the women in this story described as toxic.\n\nIlleana Douglas, who later received an Emmy nomination for her role in HBO’s “Six Feet Under,” was introduced to Moonves in 1996. At the time, she was meeting with networks, looking for a deal to write and perform for television. Moonves, who was then the president of CBS Entertainment, seemed to take a personal interest in her. He told Douglas that he was a fan of her performances in the Martin Scorsese films “Cape Fear” and “Goodfellas,” and urged her to work with CBS. “There was the big sell—he was telling me, ‘You’re gonna get a house with a pool, you’re gonna love it, it’s a great life,’ ” Douglas recalled. She agreed to sign a holding deal with CBS, which promised to pay her three hundred thousand dollars to appear exclusively in the network’s programs.\n\nCBS ultimately didn’t proceed with a pilot that Douglas wrote, but the network cast her in a comedy called “Queens,” as an eccentric native of the New York borough. In March, 1997, shortly before production of the pilot episode began, Moonves called Douglas’s manager, Melissa Prophet, and told her that he was concerned about Douglas’s attitude during a reading with her co-star, Penelope Ann Miller. Prophet relayed the concern to Douglas, who was surprised and confused: the reading, in front of a group of CBS executives, had elicited uproarious laughter. Moonves, she said, had taken her by the shoulders and congratulated her. Moonves had told Prophet that he wanted to meet with Douglas, alone, to insure that they were creatively aligned. (Prophet told me that she did not recall the conversation or setting up the meeting.) By then, Douglas had worked closely with Moonves for months. “He seemed more than just my boss,” she told me. “He was very much like a father figure.”\n\nWhen Douglas met with Moonves at his office, she began to raise concerns about the “Queens” script, but Moonves, she recalled, cut her off. “He interrupts me to ask me am I single,” she said. Douglas, whose nearly decade-long relationship with Scorsese was coming to an end, was caught off guard. “I didn’t know what to say at that point,” she told me. “I was, like, ‘I’m single, yes, no, maybe.’ ” She began talking about the script, but Moonves interjected, asking to kiss her. According to Douglas, he said that they didn’t have to tell her manager: “It’ll just be between you and me. Come on, you’re not some nubile virgin.”\n\nAs Douglas attempted to turn the focus back to work, Moonves, she said, grabbed her. “In a millisecond, he’s got one arm over me, pinning me,” she said. Moonves was “violently kissing” her, holding her down on the couch with her arms above her head. “What it feels like to have someone hold you down—you can’t breathe, you can’t move,” she said. “The physicality of it was horrendous.” She recalled lying limp and unresponsive beneath him. “You sort of black out,” she told me. “You think, How long is this going to go on? I was just looking at this nice picture of his family and his kids. I couldn’t get him off me.” She said it was only when Moonves, aroused, pulled up her skirt and began to thrust against her that her fear overcame her paralysis. She told herself that she had to do something to stop him. “At that point, you’re a trapped animal,” she told me. “Your life is flashing before your eyes.” Moonves, in what Douglas assumed was an effort to be seductive, paused and asked, “So, what do you think?” Douglas told me, “My decision was to get out of it by joking my way out, so he feels flattered.” Thinking that reminding Moonves that he was her boss might discourage him, she told him, “Yes, for the head of a network you’re some good kisser.” Moonves frowned and got up. She scrambled to find her briefcase. “Well, this has been great. Thanks,” she recalled saying, moving toward the door. “I’ve got to go now.”\n\nMoonves, she said, followed her to the door and blocked her path. He backed her up to the wall, pressing against her, with his face close to hers. “It was physically scary,” Douglas told me. “He says, ‘We’re going to keep this between you and me, right?’ ” Attempting to put him off with a joke, she replied, “No, sir, we won’t tell anyone that you’re a good kisser.” Moonves released her and, without looking at her, walked away. “It was so invasive,” she said of the threatening encounter. “It has stayed with me the rest of my life, that terror.”", "images": ["https://www.newyorker.com/verso/static/the-new-yorker/assets/logo-inverted.d6d734ff8f8bfb8aabb99b8ff088aca25375f9b7.svg", "https://media.newyorker.com/photos/59096f46019dfc3494ea1e9b/4:3/w_480%2Cc_limit/undefined", "https://media.newyorker.com/cartoons/5b5b7c3492497e4fd0017bb4/master/w_1600%2Cc_limit/180806_a21101_rd.jpg", "https://media.newyorker.com/photos/5a202dae8989ed395dbb8178/4:3/w_480%2Cc_limit/DSF-Matt-Lauers-Firing-and-NBCs-Theater-of-Accountability.jpg", "https://media.newyorker.com/cartoons/5b5b7c343e47e60bb379a34d/master/w_1600%2Cc_limit/180806_a22032.jpg", "https://media.newyorker.com/photos/590979628b51cf59fc423803/4:3/w_480%2Cc_limit/%25E2%2580%258BTalbot-FoxNewsAndTheRepercussionsOfSexualHarassment.jpg", "https://dwgyu36up6iuz.cloudfront.net/heru80fdn/image/upload/c_fill%2Cd_placeholder_image.jpg%2Cfl_progressive%2Cg_center%2Ch_360%2Cq_80%2Cw_480/v1532962438/thenewyorker_how-a-notorious-d-e-a-informant-busted-criminals.jpg", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo-reverse.f915b516b6ca9c0c2a9bdf9b749519365b2b2e4a.svg", "https://media.newyorker.com/cartoons/5b5b7c3487b14c693836677a/master/w_1600%2Cc_limit/180806_a21846.jpg", "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1280,c_limit/180806_r32520_rd.jpg", "https://media.newyorker.com/cartoons/5b5b7c3487b14c6938366779/master/w_1600%2Cc_limit/180806_a20641.jpg", "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/master/w_2560%2Cc_limit/180806_r32520_rd.jpg", "https://media.newyorker.com/photos/5ad6062051fedf7258aa438c/1:1/w_270%2Cc_limit/ronan_farrow-RD-2.png", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo-header-reverse.a63f1dbd399c4862508510ca28192280db6e8a46.svg"], "top_img": "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1280,c_limit/180806_r32520_rd.jpg", "keywords": [], "authors": ["Condé Nast", "Ronan Farrow"], "canonical_link": "https://www.newyorker.com/magazine/2018/08/06/les-moonves-and-cbs-face-allegations-of-sexual-misconduct", "title": "Les Moonves and CBS Face Allegations of Sexual Misconduct", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "Six women accuse the C.E.O. of harassment and intimidation, and dozens more describe abuse at his company.", "id": "5b58962892497e4fd001741c", "keywords": "cbs,sexual harassment,television,#metoo,women,illeana douglas,actresses", "news_keywords": "cbs,sexual harassment,television,#metoo,women,illeana douglas,actresses", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "5b58962892497e4fd001741c", "parsely-metadata": "{\"description\":\"Six women accuse the C.E.O. of harassment and intimidation, and dozens more describe abuse at his company.\",\"image-16-9\":\"https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1000,c_limit/180806_r32520_rd.jpg\",\"image-1-1\":\"https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/1:1/w_1000,c_limit/180806_r32520_rd.jpg\"}", "og": {"description": "Six women accuse the C.E.O. of harassment and intimidation, and dozens more describe abuse at his company.", "image": "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1280,c_limit/180806_r32520_rd.jpg", "site_name": "The New Yorker", "title": "Les Moonves and CBS Face Allegations of Sexual Misconduct", "type": "article", "url": "https://www.newyorker.com/magazine/2018/08/06/les-moonves-and-cbs-face-allegations-of-sexual-misconduct"}, "article": {"content_tier": "metered", "opinion": "false", "section": "tags", "published_time": "2018-07-27T21:37:00.000Z", "modified_time": "2018-07-27T21:37:00.000Z", "author": "Ronan Farrow"}, "twitter": {"card": "summary_large_image", "creator": "@NewYorker", "description": "Six women accuse the C.E.O. of harassment and intimidation, and dozens more describe abuse at his company.", "domain": "https://www.newyorker.com", "image": "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1280,c_limit/180806_r32520_rd.jpg?mbid=social_retweet", "site": "@NewYorker", "title": "Les Moonves and CBS Face Allegations of Sexual Misconduct"}, "fb": {"app_id": 1147169538698836, "pages": 9258148868}, "google-signin-client_id": "275906274807-b4eqbdqr511u9msdpj8mh0pf77fcciv7.apps.googleusercontent.com"}, "movies": [], "publish_date": 1533510000.0, "source": "https://www.newyorker.com", "summary": ""}