{"url": "https://www.cnn.com/2018/07/25/entertainment/demi-lovato-sobriety-mental-health/index.html", "text": "Story highlights The singer has been open about her struggles She tweeted an emotional performance of \"Sober\" last month\n\nCNN —\n\nDemi Lovato has long been open about her struggles with substance abuse and mental health issues.\n\nHer words are now taking on new meaning given her hospitalization Tuesday for an apparent drug overdose.\n\nDemi Lovato hospitalized for apparent drug overdose\n\nThe news was met with shock and sadness from friends and fans.\n\nAriana Grande, other artists respond to Demi Lovato’s hospitalization\n\nHere’s some of what Lovato has said in the past:\n\nOn hitting rock bottom\n\nThe 25-year-old star told Access Hollywood in 2013 that she had a moment of reckoning when she was 19.\n\n“I was going to the airport and I had a Sprite bottle just filled with vodka and it was just 9 in the morning and I was throwing up in the car and this was just to get on a plane to go back to L.A. to the sober living house that I was staying at,” Lovato said. “I had all the help in the world, but I didn’t want it.”\n\nThe family intervention\n\nLovato told British talk-show host Jonathan Ross last year that her parents got tough with her a few years back.\n\n“I knew that I had a lot of life ahead of me, but one of the main reasons of getting sober was so that I could be around my little sister because my mom and dad (said I couldn’t be around her) if I was doing stuff,” she said.\n\nHer entire tribe has rallied around her during the tough times, Lovato said.\n\n“I had family and really close friends and my manager; they all were by my side through everything,” she said. “I wouldn’t be here without them. My fans too, I feel they gave me a reason to live and I’m forever grateful.”\n\nHer daily struggle to stay sober\n\nLast year the “Sorry Not Sorry” singer was honored with the Spirit of Sobriety Award during the annual Brent Shapiro Foundation for Drug Prevention Summer Spectacular.\n\n“Every day is a battle,” she said.\n\n“You just have to take it one day at a time; some days are easier than others and some days you forget about drinking and using, but for me, I work on my physical health, which is important, but my mental health as well,” Lovato said, adding that she was seeing her therapist twice a week. “I make sure I stay on my medications. I go to AA meetings. I do what I can physically in the gym. I make it a priority.”\n\nOpening up about being bipolar\n\nIn 2015 Lovato was spokeswoman for the “Be Vocal: Speak Up for Mental Health” campaign and talked to Women’s Health about why she went public with her mental health issues.\n\n“I remember sitting with my manager and my family and talking to them about whether or not to speak out about the issues that I was dealing with,” she said. “I knew that there were two options: I could either not talk about my stint in rehab and hope that it went away, or I could talk about it and inspire people to get help for their issues, as well, so that’s exactly what I did.”\n\nHer sobriety relapse after six years\n\nLast month Lovato released the song “Sober” in which she revealed she had relapsed.\n\n“I’m so sorry I’m not sober anymore/And I’m sorry for the fans I lost who watched me fall again/I wanna be a role model, but I’m only human,” Lovato sang.\n\nSoon after she tweeted a video of her emotional performance of the song in Lisbon, Portugal.\n\nTonight I took the stage, a new person with a new life. Thank you to everyone who has supported me throughout this journey. It will never be forgotten ❤️ @rockinriolisboa pic.twitter.com/cv51ssaqu4 — Demi Lovato (@ddlovato) June 24, 2018\n\n“Tonight I took the stage, a new person with a new life,” she tweeted. “Thank you to everyone who has supported me throughout this journey. It will never be forgotten.”", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/140929104601-lisa-france-profile-image.jpg?q=x_2,y_0,h_898,w_1596,c_crop/h_270,w_480/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/180724194049-demi-lovato-11192017.jpg?q=x_3,y_104,h_1332,w_2367,c_crop/w_800"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/180724194049-demi-lovato-11192017.jpg?q=x_3,y_104,h_1332,w_2367,c_crop/w_800", "keywords": [], "authors": ["Lisa Respers France"], "canonical_link": "https://www.cnn.com/2018/07/25/entertainment/demi-lovato-sobriety-mental-health/index.html", "title": "What Demi Lovato has said about sobriety and mental health", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "What Demi Lovato has said about sobriety and mental health | CNN", "description": "The singer has long been open about her struggles with substance abuse and mental health issues.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180724194049-demi-lovato-11192017.jpg?q=x_3,y_104,h_1332,w_2367,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2018/07/25/entertainment/demi-lovato-sobriety-mental-health/index.html", "site_name": "CNN"}, "twitter": {"title": "What Demi Lovato has said about sobriety and mental health | CNN", "description": "The singer has long been open about her struggles with substance abuse and mental health issues.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180724194049-demi-lovato-11192017.jpg?q=x_3,y_104,h_1332,w_2367,c_crop/w_800", "card": "summary_large_image", "site": "@CNNent"}, "description": "The singer has long been open about her struggles with substance abuse and mental health issues.", "template_type": "article_leaf", "type": "article", "meta-section": "entertainment", "theme": "entertainment", "article": {"published_time": "2018-07-25T12:14:09Z", "modified_time": "2018-07-26T11:34:55Z", "tag": "celebrities, demi lovato, health and medical, mental health", "publisher": "https://www.facebook.com/CNN"}, "keywords": "celebrities, demi lovato, health and medical, mental health", "author": "Lisa Respers France", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1532473200.0, "source": "https://www.cnn.com", "summary": ""}