{"url": "https://en.wikipedia.org/wiki/The_Handmaid%27s_Tale_(TV_series)", "text": "21st-century American dystopian TV series\n\nThe Handmaid's Tale is an American dystopian television series created by Bruce Miller, based on the 1985 novel of the same name by Canadian author Margaret Atwood. The series was ordered by the streaming service Hulu as a straight-to-series order of 10 episodes, for which production began in late 2016. The plot features a dystopia following a Second American Civil War wherein a theonomic, totalitarian society subjects fertile women, called \"Handmaids\", to child-bearing slavery.[5][6]\n\nThe first three episodes of the series premiered on April 26, 2017; the subsequent seven episodes were released every Wednesday. In July 2019, the series was renewed for a fourth season,[7] which premiered on April 27, 2021.[8] In September 2019, it was announced that Hulu and MGM were developing a sequel series, to be based on Atwood's 2019 novel The Testaments.[9] In December 2020, ahead of the fourth season premiere, the series was renewed for a fifth season,[10] which premiered on September 14, 2022.[11] In September 2022, ahead of the fifth season premiere, the series was renewed for a sixth and final season.[12]\n\nThe Handmaid's Tale's first season won eight Primetime Emmy Awards from 13 nominations, including Outstanding Drama Series. It is the first show produced by Hulu to win a major award as well as the first series on a streaming service to win an Emmy for Outstanding Series.[13] It also won the Golden Globe Award for Best Television Series – Drama. Elisabeth Moss was also awarded the Primetime Emmy Award for Outstanding Lead Actress in a Drama Series and the Golden Globe for Best Actress in a Television Drama Series.\n\nPlot [ edit ]\n\nIn a world where fertility rates have collapsed as a result of sexually transmitted diseases and environmental pollution,[14] the totalitarian, theonomic government of Gilead establishes rule in the former United States in the aftermath of a civil war.[15][16][17][5] Society is organized by power-hungry leaders along with a new, militarized, hierarchical regime of religious fanaticism and newly created social classes, in which women are brutally subjugated. By law, women in Gilead are forced to work in very limited roles, including some as natal slaves, and they are not allowed to own property, have careers, handle money, or read.[17]\n\nWorldwide infertility has led to the enslavement of fertile women in Gilead determined by the new regime to be fallen women, citing an extremist interpretation of the Biblical account of Bilhah. These women often include those who have entered marriages following divorce (termed \"adulteresses\", as divorce is not recognized under Gileadian law), single or unmarried mothers, lesbians (homosexuals being termed \"gender traitors\"), non-Christians, adherents of Christian denominations other than the \"Sons of Jacob\", political dissidents, and academics.[17]\n\nThese women, called Handmaids, are assigned to the homes of the ruling elite, where they must submit to ritualized rape (referred to as \"the ceremony\") by their male masters (\"Commanders\") in the presence of their wives, to be impregnated and bear children for them.[17] Handmaids are given names created by the addition of the prefix Of- to the first name of the man who has them. When they are transferred, their names are changed.\n\nAlong with the Handmaids, much of society is now grouped into classes that dictate their freedoms and duties. Women are divided into a small range of social categories, each one signified by a plain dress in a specific color. Handmaids wear long red dresses, heavy brown boots and white coifs, with a larger white coif (known as \"wings\") to be worn outside, concealing them from public view and restricting their vision.\n\nJune Osborne, renamed Offred, is the Handmaid assigned to the home of the Gileadan Commander Fred Waterford and his wife Serena Joy. The Waterfords, key players in the formation and rise of Gilead, struggle with the realities of the society they helped create. During \"the time before\", June was married to Luke and had a daughter, Hannah.\n\nAt the beginning of the story, while attempting to flee Gilead with her husband and daughter, June was captured and forced to become a Handmaid because of the adultery she and her husband committed. June's daughter was taken and given to an upper-class family to raise, and her husband escaped into Canada. Much of the plot revolves around June's desire to be reunited with her husband and daughter and the internal evolution of her strength to its somewhat darker version.\n\nCast and characters [ edit ]\n\nMain [ edit ]\n\nElisabeth Moss as June Osborne / Offred / Ofjoseph, a woman who was captured while attempting to escape to Canada with her husband, Luke, and daughter, Hannah. Because Luke is divorced, their union is considered adulterous in this new society. June is considered an adulteress and their daughter, Hannah, is deemed illegitimate. Due to June's fertility, she is made a Handmaid to Commander Fred Waterford and his wife Serena Joy, and is called \"Offred\"; later she becomes handmaid to Commander Joseph Lawrence and is called \"Ofjoseph\".\n\nJoseph Fiennes as Commander Fred Waterford (seasons 1–4), a high-ranking government official, and June's first master. Both he and his wife were instrumental in Gilead's founding.\n\nYvonne Strahovski as Serena Joy Waterford, Fred's wife, and a former conservative cultural activist. She appears to have accepted her new role in a society that she helped create. She is poised and deeply religious, but capable of great cruelty and is often callous to June. She is desperate to become a mother.\n\nAlexis Bledel as Dr. Emily Malek / Ofglen #1 / Ofsteven / Ofroy / Ofjoseph #1 (seasons 1–4), a former university professor in cellular biology and initially June's shopping partner. Although June is initially wary of her, it is revealed she is not as pious as she seems, and the two become friends. Emily is involved with and first informs June of Mayday, an underground resistance movement. She has a wife and son living in Canada.\n\nMadeline Brewer as Janine Lindo / Ofwarren / Ofdaniel / Ofhoward, a Handmaid who entered the Red Center for training at the same time as June, and considers June a friend due to her kind treatment. Initially non-compliant, Janine has her right eye removed as a punishment. She becomes mentally unstable due to her treatment and often behaves in temperamental or childlike ways. Before Gilead, Janine was a waitress and had a son, Caleb, who unbeknownst to her was killed after the takeover.\n\nAnn Dowd as Aunt Lydia Clements, a woman in charge of overseeing the Handmaids in their sexual re-education and duties. She is brutal and subjects insubordinate Handmaids to harsh physical punishment, but she also cares for her charges and believes deeply in the Gileadean mission and doctrine. She appears to have a soft spot for Janine and even goes so far as to address her by her given name on occasion. Before Gilead, she was a family court judge, and afterwards, an elementary school teacher.\n\nO-T Fagbenle as Luke Bankole, June's husband from before Gilead. Initially, June believes he was killed, but it is later revealed that Luke managed to escape to Canada.\n\nMax Minghella as Commander Nick Blaine, Commander Waterford's driver and a former drifter from Michigan who has feelings for June. June and Nick develop an intimate relationship and she eventually discovers that he is an Eye, a spy for Gilead and that he played a huge role in the Gileadean takeover. In season 3, he is promoted to Commander.\n\nSamira Wiley as Moira Strand, June's best friend since college. She is already at the Red Center when June enters Handmaid training but escapes before being assigned to a home. She is recaptured and becomes \"Ruby\", a Jezebel. She seems to have given up hope of ever being free, but on meeting June again regains the conviction to escape to Canada.\n\nAmanda Brugel as Rita Blue (main season 2–present, recurring season 1), a housekeeper at the Waterford house, who becomes one of June's closest allies. She had a son named Matthew, who died fighting in the civil war when he was 19 years old. [18]\n\nBradley Whitford as Commander Joseph Lawrence (main season 3–present, guest season 2), the founder of the Colonies and architect of Gilead's economy. He is on and off with Mayday. [19] [20]\n\nSam Jaeger as Mark Tuello (main season 4–present, recurring season 3, guest season 2), an operative of the U.S. Government whom Serena encounters in Canada.[21]\n\nRecurring [ edit ]\n\nGuest [ edit ]\n\nJim Cummings as Burke (season 1), an Eye who interrogates June.\n\nZabryna Guevara as Mrs. Castillo (season 1), an ambassador from Mexico who visits Gilead to see the effectiveness of the regime.\n\nChristian Barillas as Mr. Flores (season 1), Mrs. Castillo's assistant.\n\nRosa Gilmore as Zoe (season 1), the daughter of a US army soldier and the leader of the group of survivors whom Luke encounters after being separated from June and Hannah.\n\nTim Ransom as Mr. Whitford (season 1), a friend of June's mother who helps June, Luke, and Hannah attempt to cross the border.\n\nMarisa Tomei as Mrs. O'Conner (season 2), a Commander's wife who is exiled to the Colonies as punishment for committing a sin of the flesh. [31]\n\nYahya Abdul-Mateen II as Omar (season 2), a man who helps June attempt to escape Gilead.\n\nJohn Carroll Lynch as Dan (season 2), Emily's boss at the university where she worked.\n\nKelly Jenrette as Annie (season 2), Luke's ex-wife.\n\nRebecca Rittenhouse as Odette (season 2), a doctor, and Moira's deceased fiancée.\n\nAmy Landecker as Mrs. Mackenzie (season 3, 5), Hannah's placement mother in Gilead.\n\nLaila Robins as Pamela Joy (season 3), Serena's mother.\n\nDeidrie Henry as Lori (seasons 3–4), a Martha who Nick uses for intel in Gilead.\n\nSarah McVie as Lena (season 3), a Swiss diplomat negotiating the hostile conflict between Gilead and Canada over Nichole.\n\nEmily Althaus as Noelle (season 3), a young single mother whose son Aunt Lydia taught before the rise of Gilead.\n\nLaura Vandervoort as Daisy (season 4), a Jezebels worker who aids June.\n\nAlex Castillo as Dawn Mathis (season 4), the Waterfords' defense attorney.\n\nReed Birney as Lieutenant Stans (season 4) a Gilead officer who interrogates June. [28]\n\nOmar Maskati as Steven (season 4), the leader of a resistance group in Chicago.\n\nCarly Street as Iris Baker/Aunt Irene (season 4), a former Aunt who attempts to make amends with Emily.\n\nJason Butler Harner as Commander Mackenzie (season 5), a High Commander and Hannah’s placement father.\n\nIn the second season, Oprah Winfrey has an uncredited appearance as a newsreader on a car radio.[32]\n\nEpisodes [ edit ]\n\nSeason Episodes Originally released First released Last released 1 10 April 26, 2017 ( ) June 14, 2017 ( 2017-06-14 ) 2 13 April 25, 2018 ( ) July 11, 2018 ( 2018-07-11 ) 3 13 June 5, 2019 ( ) August 14, 2019 ( 2019-08-14 ) 4 10 April 27, 2021 ( ) June 16, 2021 ( 2021-06-16 ) 5 10 September 14, 2022 ( ) November 9, 2022 ( 2022-11-09 )\n\nProduction [ edit ]\n\nHulu's straight-to-series order of The Handmaid's Tale was announced in April 2016, with Elisabeth Moss set to star.[33] Based on the 1985 novel of the same name by Margaret Atwood, the series was created by Bruce Miller, who is also an executive producer with Daniel Wilson, Fran Sears, and Warren Littlefield.[33] Atwood serves as consulting producer, giving feedback on some of the areas where the series expands upon or modernizes the book.[33][34] She also played a small cameo role in the first episode.[35] Moss is also a producer.[36]\n\nIn June 2016, Reed Morano was announced as director of the series.[37] Samira Wiley, Max Minghella, and Ann Dowd joined the cast in July 2016.[38][39][40] Joseph Fiennes, Madeline Brewer, and Yvonne Strahovski were cast in August 2016,[41][42][43] followed by O-T Fagbenle and Amanda Brugel in September 2016.[44][45] In October 2016, Ever Carradine joined the cast,[46] and Alexis Bledel was added in January 2017.[47]\n\nFilming on the series took place in Toronto, Mississauga, Brantford, Hamilton, Burlington, Oakville, and Cambridge, Ontario, from September 2016 to February 2017.[48][49] Hulu released the first full trailer of the TV series on YouTube, on March 23, 2017.[50] The series premiered on April 26, 2017.[51]\n\nOn May 3, 2017, The Handmaid's Tale was renewed for a second season which premiered on April 25, 2018.[52][53] Moss told the news media that the subsequent episodes would cover further developments in the story, filling in some of the unanswered questions and continuing the narrative already \"finished\" in the book.[54] The second season consists of 13 episodes and began filming in fall 2017. Alexis Bledel returned as a series regular.[55]\n\nShowrunner Bruce Miller stated that he envisioned 10 seasons of the show, stating, \"Well, you know, honestly, when I started, I tried to game out in my head what would ten seasons be like? If you hit a home run, you want energy to go around the bases, you want enough story to keep going, if you can hook the audience to care about these people enough that they're actually crying at the finale.\"[56] Season 2 was filmed in Ontario, primarily in Toronto, but some scenes were shot in Hamilton and Cambridge.[57]\n\nOn May 2, 2018, Hulu renewed the series for a third season,[58] which premiered on June 5, 2019.[59] Season 3 started production in Toronto in October 2018.[60][61] Scenes for season 3 were also filmed in Cambridge and Hamilton, Ontario as well as in Washington, D.C.[62][63][64] Season 3 saw the show's long-serving Director of Photography, Colin Watkinson, make his directorial debut with the episode \"Unknown Caller\". Cambridge, Ontario was nominated by the Location Managers Guild International for \"Outstanding Film Office\" for their work on this season. This was the first time that a Canadian Film Office was nominated for this honor.[65]\n\nOn July 26, 2019, the series was renewed for a fourth season.[7] Season 4, consisting of 10 episodes, began production in March 2020, with Elisabeth Moss filming her directorial debut, but work had to be halted after only a few weeks, due to the COVID-19 pandemic.[66][67] In June 2020, Hulu announced that the fourth season would premiere in 2021.[68] Production on season 4 resumed in September 2020[21] and wrapped on February 25, 2021, with Moss having directed three episodes.[69]\n\nOn December 10, 2020, ahead of the fourth season premiere, Hulu renewed the series for a fifth season.[10] Season 5 started production in Toronto in February 2022 and is scheduled to continue through July 2022.[70] In May 2022, Alexis Bledel departed the series ahead of the fifth season, and stated, \"After much thought, I felt I had to step away from The Handmaid's Tale\".[71] On September 8, 2022, ahead of the fifth season premiere, Hulu renewed the series for a sixth and final season.[12]\n\nBroadcast and release [ edit ]\n\nThe first three episodes of the series premiered on April 26, 2017; the subsequent seven episodes were released on a weekly basis.[51][72] In Canada, the series is broadcast weekly by CTV Drama Channel and the streaming service Crave; the first two episodes premiered on April 30, 2017.[73] In Scandinavia, the series is available on HBO Nordic.[74] In the United Kingdom, the series premiered on May 28, 2017, on Channel 4.[75]\n\nIn New Zealand, the series was released on the subscription video on demand service Lightbox on June 8, 2017.[76] After satellite service provider Sky acquired Lightbox and merged it into its streaming service Neon on July 7, 2020, Neon acquired the distribution rights to the series in New Zealand.[77]\n\nIn Australia, the series premiered on the TV channel SBS's video streaming service SBS on Demand, on July 6, 2017.[78] The series also released on the subscription video on demand service Stan on December 12, 2018.[79]\n\nIn Ireland, the series premiered on February 5, 2018, on RTÉ2, with a showing of the first two episodes.[80] RTÉ also became the first broadcaster in Europe to debut Season 2, Season 3 and Season 4 following its broadcast in the US and Canada.[81] In Brazil and Latin America, the series premiered on March 7, 2018, on Paramount Channel.[82]\n\nIn India, the series premiered on February 5, 2018, on AXN and ran for the first two seasons before moving to Amazon Prime Video for Season 3, which made all three seasons available for viewing on January 31, 2020.[83][84]\n\nThe first season was released on Blu-ray and DVD on March 13, 2018, the second season on December 4, 2018, and the third season on November 19, 2019, by 20th Century Fox Home Entertainment.[85][86][87]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nThe Handmaid's Tale was ranked as the 25th and 38th best TV series of the 21st century by The Guardian and BBC, respectively.[88][89] On the review aggregator website Rotten Tomatoes, the overall series has an approval rating of 83%.[90] While on Metacritic, another aggregator website, it has an average score of 81 out of 100.[91]\n\nSeason 1 [ edit ]\n\nOn Rotten Tomatoes, 94% of 259 reviews are positive for the first season, with an average rating of 8.65/10. The site's critical consensus reads, \"Haunting and vivid, The Handmaid's Tale is an endlessly engrossing adaptation of Margaret Atwood's dystopian novel that's anchored by a terrific central performance from Elisabeth Moss.\"[92] On Metacritic, the season has a weighted average score of 92 out of 100 based on 41 critics, indicating \"universal acclaim\".[93]\n\nDaniel Fienberg of The Hollywood Reporter called it \"probably the spring's best new show\".[102] Jen Chaney of Vulture gave it a highly positive review, and wrote that it is \"A faithful adaptation of the book that also brings new layers to Atwood's totalitarian, sexist world of forced surrogate motherhood\" and that \"this series is meticulously paced, brutal, visually stunning, and so suspenseful from moment to moment that only at the end of each hour will you feel fully at liberty to exhale\".[103]\n\nThere was much debate on whether parallels could be drawn between the series (and by extension, the book it is based on) and American society during the Presidency of Donald Trump.[104][105] Comparisons have also been made to the Salafi/Wahabbi extremism of ISIS, under which enslaved women of religious minorities are passed around and utilized as sex objects and vessels to bear new jihadis.[106][107][108]\n\nSeason 2 [ edit ]\n\nOn Rotten Tomatoes, 89% of 340 critics have given the season a positive review, and an average rating of 8.35/10. The site's critical consensus reads, \"Beautifully shot but dishearteningly relevant, The Handmaid's Tale centers its sophomore season tightly around its compelling cast of characters, making room for broader social commentary through more intimate lenses.\"[94] Metacritic assigned the season a weighted average score of 86 out of 100 based on 28 critics, indicating \"universal acclaim\".[95]\n\nSome critics perceived the second season's depictions of violence as excessive. The Atlantic's Sophie Gilbert wrote: \"There came a point during the first episode where, for me, it became too much.\"[109] Lisa Miller of The Cut wrote: \"I have pressed mute and fast forward so often this season, I am forced to wonder: 'Why am I watching this'? It all feels so gratuitous, like a beating that never ends.\"[110] The Daily Telegraph's Rebecca Reid admitted she had an anxiety attack watching an episode of the show.[111]\n\nSeason 3 [ edit ]\n\nFor the third season, Rotten Tomatoes reports that 82% of 301 reviews are positive, and the average rating is 6.9/10. The site's critical consensus reads, \"The Handmaid's Tale's third season reins in its horrors and inspires hope that revolution really is possible – if only the story would stop spinning its wheels and get to it already.\"[96] Metacritic compiled 14 critic reviews and an average score of 68 out of 100, signifying \"generally favorable reviews\".[97]\n\nKelly Lawler of USA Today gave it a positive review, scoring it three out of four stars. She claimed it is an improvement over the second season, \"that rights many – though definitely not all – of Season 2's wrongs.\" Overall, she wrote, \"The new season is more propulsive and watchable, although it doesn't quite reach the heights of that first moving season. But Handmaid's regains its footing by setting off on a new path\".[112]\n\nDaniel Fienberg of The Hollywood Reporter wrote a generally positive review, praising Elisabeth Moss's performance and the cinematography, but criticized the plot \"that has become frustratingly repetitive\". Overall, he wrote, \"Still occasionally powerful, but rarely as provocative\".[113]\n\nSeason 4 [ edit ]\n\nOn Rotten Tomatoes, the fourth season earned positive reviews from 70% of 46 critics, with an average rating of 7/10. The site's critical consensus reads, \"Elisabeth Moss is better than ever, but scattershot plotting and an overbearing sense of doom may prove too grim for some viewers to really enjoy The Handmaid's Tale's fourth season.\"[98] According to Metacritic, which collected 18 reviews and calculated an average score of 62, the season received \"generally positive reviews\".[99]\n\nKristen Baldwin of Entertainment Weekly gave it a \"C+\" grade and wrote that the series \"delivers on some long-delayed promises, but ultimately it's too little, too late.\"[114] Matthew Gilbert of The Boston Globe wrote, \"the dystopian drama has exceeded the natural lifespan of its story, as it plows forward with nothing new to say, tinkling cymbals and sounding brass.\"[115] In a more positive review from Jen Chaney of Vulture, she wrote, \"Thankfully, season four finally regains some momentum and forward motion. Based on the eight out of ten total episodes made available to critics, this is the best The Handmaid's Tale has been since its first season.\"[116]\n\nSeason 5 [ edit ]\n\nOn Rotten Tomatoes, the fifth season has earned positive reviews from 81% of 21 critics, with an average rating of 7.1/10. The site's critical consensus reads, \"The Handmaid's Tale has lost its urgency after spreading its once-arresting premise thin in a season focused on vengeance's consequences, but the women of Gilead are still played with compelling exactitude.\"[100] On Metacritic, it has received an average score of 63 out of 100, based on 7 reviews, indicating \"generally positive reviews\".[101]\n\nCritics were given the first eight episodes of the season to review. Writing for IGN, Tara Bennett gave it a \"good\" score of 7 out of 10 and wrote in her verdict: \"The Handmaid's Tale remains the canary in the coalmine of TV shows [...]. Elisabeth Moss continues to give a livewire performance as former handmaid/now Canadian refugee June Osborne. [...] But overall, the series continues to suffer with very measured storylines that can't seem to recapture the kinetic energy of the first two seasons.\"[117] Abby Cavenaugh of Collider graded it with a \"B-\" and said, \"Season 5 is full of scarce highs and really low lows, lots of heavy-hitting drama, and emotional scenes. Some of the biggest events of this season lead to some pretty uncomfortable viewing, but viewers who stick with it will be rewarded with some huge moments that will have repercussions for the final season.\"[118]\n\nAwards [ edit ]\n\nSee also [ edit ]", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/The_Handmaid%27s_Tale_intertitle.png/1200px-The_Handmaid%27s_Tale_intertitle.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/The_Handmaid%27s_Tale_intertitle.png/250px-The_Handmaid%27s_Tale_intertitle.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/The_Handmaid%27s_Tale_intertitle.png/1200px-The_Handmaid%27s_Tale_intertitle.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Handmaid%27s_Tale_(TV_series)", "title": "The Handmaid's Tale (TV series)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/The_Handmaid%27s_Tale_intertitle.png/640px-The_Handmaid%27s_Tale_intertitle.png", "width": 640, "height": 360}, "title": "The Handmaid's Tale (TV series) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}