{"url": "https://deadline.com/2018/06/chris-hardwick-off-nerdist-site-abuse-allegations-chloe-dyskstra-1202411456/", "text": "Updated with Nerdist statement: Chris Hardwick, the Nerdist founder and host of NBC’s game show The Wall, AMC’s Talking Dead aftershow and a regular emcee in Hall H at Comic-Con, has been scrubbed from the Nerdist website he founded after being accused of sexual abuse and “long-term abuse” by his former girlfriend Chloe Dykstra.\n\nLegendary Entertainment, which owns Nerdist Industries where Hardwick launched his career as a comic and podcaster, just released a statement.\n\n“Chris Hardwick had no operational involvement with Nerdist for the two years preceding the expiration of his contract in December 2017,” it reads. “He no longer has any affiliation with Legendary Digital Networks. The company has removed all reference to Mr. Hardwick even as the original Founder of Nerdist pending further investigation.”\n\nRepeating the Legendary statement, Nerdist itself also address the matter online:\n\nThe moves come after Dykstra, a TV personality and host, penned a first-person account of their three-year relationship that posted on Medium. Dykstra never mentioned Hardwick by name, but details about the “mildly successful podcaster” who grew into “a powerhouse CEO of his own company” suggest she was referring to him.\n\nDykstra, in an essay she said was part closure and part warning, detailed a relationship in which she was restricted from going out at night, having male friends or speaking in public places and was the victim of sexual assault. “I was expected to be ready for him when he came home from work,” she writes.\n\n“I lost myself, both mentally and physically. I lost 15 lbs within weeks, started pulling out my hair (and had to get extensions regularly to hide it),” she wrote. “I generally stopped speaking unless spoken to while with him, drifting through life like a ghost. I would try to sleep in as late as possible so my days were shorter. I stopped listening to music entirely. I ceased to be. I was an ex-person.”\n\nDykstra said she left Hardwick after three years, and that after the breakup he made calls to companies “to get me fired by threatening to never work with them,” and that he and a female colleague “steamrolled my career.”\n\nDeadline has not independently confirmed Dykstra’s accusations.\n\nIn March, NBC renewed its Hardwick-hosted game show The Wall for a 20-episode third season, though no premiere date was announced. AMC also just announced his summer bridge talk show Talking With Chris Hardwick returns this Sunday.\n\nOn Thursday, BBC America announced that Hardwick would moderate the network’s Doctor Who panel at Comic-Con in San Diego next month. Hardwick, a Comic-Con panel host staple, is also penciled in to host AMC’s The Walking Dead panel in Hall H as in years past.\n\nNBC and AMC have not responded to requests for comment on Dykstra’s post, and reps for Hardwick also declined comment.", "images": ["https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://deadline.com/wp-content/uploads/2018/06/chris-hardwick.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://deadline.com/wp-content/uploads/2018/06/chris-hardwick.jpg?w=681&h=383&crop=1", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1"], "top_img": "https://deadline.com/wp-content/uploads/2018/06/chris-hardwick.jpg?w=1024", "keywords": [], "authors": ["Patrick Hipes Dominic Patten", "Patrick Hipes", "Dominic Patten"], "canonical_link": "https://deadline.com/2018/06/chris-hardwick-off-nerdist-site-abuse-allegations-chloe-dyskstra-1202411456/", "title": "Chris Hardwick Wiped From Nerdist Website He Founded Amid Allegations By Ex-Girlfriend", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Chris Hardwick has been scrubbed from the Nerdist website he founded after being accused of \"long-term abuse\" by his former girlfriend.", "news_keywords": "Chris Hardwick, Nerdist", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=533209613", "generator": "WordPress 6.0.2", "author": "Dominic Patten", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Deadline", "application-name": "Deadline", "content_type": "Article", "post_id": 1202411456, "title": "Chris Hardwick Wiped From Nerdist Website He Founded Amid Allegations By Ex-Girlfriend", "published_at": "2018-06-15 11:00:20", "image": "https://deadline.com/wp-content/uploads/2018/06/chris-hardwick.jpg?w=296&h=166&crop=1", "comment_count": 268, "tags": "Nerdist", "topics": "TV", "body": "Updated with Nerdist statement: Chris Hardwick, the Nerdist founder and host of NBC's game show The Wall, AMC's Talking Dead aftershow and a regular emcee in Hall H at Comic-Con, has been scrubbed from the Nerdist website he founded after being accused of sexual abuse and \"long-term abuse\" by his former girlfriend Chloe Dykstra.\r\n\r\nLegendary Entertainment, which owns Nerdist Industries where Hardwick launched his career as a comic and podcaster, just released a statement.\r\n\r\n“Chris Hardwick had no operational involvement with Nerdist for the two years preceding the expiration of his contract in December 2017,\" it reads. \"He no longer has any affiliation with Legendary Digital Networks. The company has removed all reference to Mr. Hardwick even as the original Founder of Nerdist pending further investigation.”\r\n\r\nRepeating the Legendary statement, Nerdist itself also address the matter online:\r\n\r\npic.twitter.com/E6ORD0TBw9\r\n— Nerdist (@nerdist) June 15, 2018\r\nThe moves come after Dykstra, a TV personality and host, penned a first-person account of their three-year relationship that posted on Medium. Dykstra never mentioned Hardwick by name, but details about the \"mildly successful podcaster\" who grew into \"a powerhouse CEO of his own company\" suggest she was referring to him.\r\n\r\nDykstra, in an essay she said was part closure and part warning, detailed a relationship in which she was restricted from going out at night, having male friends or speaking in public places and was the victim of sexual assault. \"I was expected to be ready for him when he came home from work,\" she writes.\r\n\r\n\"I lost myself, both mentally and physically. I lost 15 lbs within weeks, started pulling out my hair (and had to get extensions regularly to hide it),\" she wrote. \"I generally stopped speaking unless spoken to while with him, drifting through life like a ghost. I would try to sleep in as late as possible so my days were shorter. I stopped listening to music entirely. I ceased to be. I was an ex-person.\"\r\n\r\nDykstra said she left Hardwick after three years, and that after the breakup he made calls to companies \"to get me fired by threatening to never work with them,\" and that he and a female colleague \"steamrolled my career.\"\r\n\r\nDeadline has not independently confirmed Dykstra's accusations.\r\n\r\nIn March, NBC renewed its Hardwick-hosted game show The Wall for a 20-episode third season, though no premiere date was announced. AMC also just announced his summer bridge talk show Talking With Chris Hardwick returns this Sunday.\r\n\r\nOn Thursday, BBC America announced that Hardwick would moderate the network's Doctor Who panel at Comic-Con in San Diego next month. Hardwick, a Comic-Con panel host staple, is also penciled in to host AMC's The Walking Dead panel in Hall H as in years past.\r\n\r\nNBC and AMC have not responded to requests for comment on Dykstra's post, and reps for Hardwick also declined comment.\r\n\r\nhttps://twitter.com/skydart/status/1007570043637501953", "fb": {"pages": 105558754896}, "onesignal": "wordpress-plugin", "fragment": "!", "og": {"type": "article", "title": "Chris Hardwick Wiped From Nerdist Website He Founded Amid Allegations By Ex-Girlfriend", "url": "https://deadline.com/2018/06/chris-hardwick-off-nerdist-site-abuse-allegations-chloe-dyskstra-1202411456/", "description": "Updated with Nerdist statement: Chris Hardwick, the Nerdist founder and host of NBC’s game show The Wall, AMC’s Talking Dead aftershow and a regular emcee in Hall H at Comic-Con, has be…", "site_name": "Deadline", "image": {"identifier": "https://deadline.com/wp-content/uploads/2018/06/chris-hardwick.jpg?w=1024", "width": 1024, "height": 665, "alt": "Chris Hardwick"}, "locale": "en_US"}, "article": {"published_time": "2018-06-15T18:00:20+00:00", "modified_time": "2018-06-15T23:24:13+00:00"}, "twitter": {"site": "@DEADLINE", "card": "summary_large_image", "title": "Chris Hardwick Wiped From Nerdist Website He Founded Amid Allegations By Ex-Girlfriend", "description": "Chris Hardwick has been scrubbed from the Nerdist website he founded after being accused of \"long-term abuse\" by his former girlfriend.", "image": "https://deadline.com/wp-content/uploads/2018/06/chris-hardwick.jpg?w=1024"}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1529085620.0, "source": "https://deadline.com", "summary": ""}