{"url": "https://en.wikipedia.org/wiki/Cara_Mund", "text": "American beauty pageant winner (born 1993)\n\nCara Mund ( KAR-ə; born December 8, 1993) is an attorney, American beauty pageant titleholder and political candidate from Bismarck, North Dakota. In June 2017, she was crowned Miss North Dakota 2017. On September 10, 2017, she was crowned Miss America 2018 in Atlantic City and became the first contestant from North Dakota to win the competition.\n\nEarly life and education [ edit ]\n\nMund was born in Bismarck, North Dakota to DeLora Kautzmann-Mund and Doug Mund. She is a distant relative of Victoria Woodhull, the first woman to run for President of the United States.[1]\n\nMund is a national award-winning choreographer and dancer.[2] In high school, she trained four summers with the Radio City Rockettes[3] and was named one of their \"Successful Rockette Women\" in 2019.[4] Since the age of 14, Mund has organized an annual fundraising fashion show benefiting the Make-a-Wish Foundation.[5] In high school, Mund served as her school's National Honor Society president, graduated as one of her class' valedictorians, and was voted \"most likely to become Miss America.\"[6]\n\nMund in Atlantic City after being crowned Miss America 2018\n\nShe graduated with honors from Brown University in 2016 with a degree in business, entrepreneurship, and organizations. Her thesis was on the Miss America Organization.[7] Mund served as the president of the sorority Kappa Delta.[8] She has said that the school helped her \"think on [her] feet.\"[7]\n\nFrom August to December 2016, she interned for Republican Senator John Hoeven in Washington D.C. In 2018, she was his guest at the State of the Union. Mund has expressed interest in representing North Dakota in the state and U.S. Senate as well as being the first woman to be elected Governor of North Dakota.[9]\n\nIn 2019, the North Dakota House of Representatives passed Resolution No. 3035 to honor Mund.[10] She was also inducted into the North Dakota Bluebook's \"Notable North Dakotans\" and recognized as one of \"Five Women Who Changed North Dakota's History.\"[8] On March 11, 2021, the North Dakota State Museum debuted an exhibit featuring Mund.[11]\n\nPrior to being crowned Miss America, she expressed her plan to attend law school.[5] In May 2022, Mund graduated from Harvard Law School Cum Laude where she was a teaching fellow, the Executive Editor of Operations for the Harvard Journal of Sports and Entertainment Law, a member of the Harvard Law School Mock Trial Association, and a member of the Women's Law Association.[12][13][14] On September 23, 2022, Mund was sworn in and admitted to practice law in North Dakota. [15][16]\n\nPageantry [ edit ]\n\nEarly pageantry [ edit ]\n\nShe began pageantry as a child, capturing the titles of Little Miss North Dakota, Miss Pre-Teen North Dakota, and Miss Junior Teen North Dakota.[17] Mund later competed in Miss North Dakota's Outstanding Teen 2010 as Miss Red River Valley's Outstanding Teen. She went on to win the competition, and competed in Miss America's Outstanding Teen 2011.[5] She later was the 4th runner-up at the Miss North Dakota Teen USA 2012 pageant.[18]\n\nMiss North Dakota [ edit ]\n\nMund's USO visits\n\nMund competed in Miss North Dakota 2016 as Miss Oil Country, and was the first runner-up. She returned to the competition the following year as Miss Northern Lights 2017, and was crowned Miss North Dakota 2017, with her platform being \"A Make-A-Wish Passion with Fashion.\"[1]\n\nMiss America 2018 [ edit ]\n\nMund represented North Dakota in the Miss America 2018 competition held at Boardwalk Hall in Atlantic City, New Jersey, in September 2017. Her platform was \"A Make-A-Wish Passion with Fashion.\" In the preliminary competitions, Mund was named the first runner-up for the Quality of Life Award.[19]\n\nOn September 10, 2017, Mund was crowned Miss America 2018 by Miss America 2017 Savvy Shields.[20][21][22][23] Along with the title of Miss America, she received a $50,000 scholarship. Mund is the first contestant from North Dakota to win the Miss America title. She is also the last Miss America to compete in the swimsuit portion of competition.[24]\n\nDuring her reign, Mund served as the 2018 National Goodwill Ambassador for the Children's Miracle Network Hospitals and worked closely with the USO.[25][26] In solidarity with the #MeToo movement, she wore black to the 2018 State of the Union, and in the March/April 2018 issue of the alumni magazine of her Ivy League school, she represented the Miss America organization, saying that it was the largest scholarship provider to women and that \"it's more relevant than ever\". She expressed an interest in its change from the inside positive towards its current trajectory, \"the organization really did exactly what it was meant to do, and that was to empower women and give them the skills to be able to stand up for themselves.\"[7]\n\nIn August 2018, Mund criticized the Miss America Organization in a five-page letter, stating \"My voice is not heard nor wanted by our current leadership, nor do they have any interest in knowing who I am and how my experiences relate to positioning the organization for the future.\"[27] She further stated, \"The rhetoric about empowering women, and openness and transparency, is great; however, the reality is quite different. I am living that difference. To stay silent is to give away my power and the power of the women who will follow me. I am not comfortable with any of us being controlled, manipulated, silenced, or bullied.\"[28] In January 2020, the leadership was removed.[29]\n\nOn December 8, 2019, Mund became the first and so far only Miss America to judge the Miss Universe competition.[30]\n\nPolitics [ edit ]\n\nOn August 6, 2022, Cara Mund announced her candidacy as an independent to serve North Dakota in the U.S. House of Representatives.[31][32]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Cara_Mund_2018.jpg/220px-Cara_Mund_2018.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Cara_Mund.jpg/180px-Cara_Mund.jpg", "https://upload.wikimedia.org/wikipedia/commons/7/72/Cara_Mund_2018.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/PHFL%2Bmi-so-11-0201-MissAmerica_%2840007396021%29.jpg/180px-PHFL%2Bmi-so-11-0201-MissAmerica_%2840007396021%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/7/72/Cara_Mund_2018.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Cara_Mund", "title": "Cara Mund", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Cara_Mund_2018.jpg/640px-Cara_Mund_2018.jpg", "width": 640, "height": 889}, "title": "Cara Mund - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}