{"url": "https://www.hollywoodreporter.com/news/oscars-jimmy-kimmel-return-as-host-2018-honors-1004217", "text": "Jimmy Kimmel will be back as host of the Oscars when the 90th edition of the annual Academy Awards ceremony is held March 4.\n\nThe Academy and ABC announced Tuesday that the late night host will reunite with producers Michael De Luca and Jennifer Todd for the 2018 show.\n\nThe trio teamed up for the first time for the most recent Oscar show Feb. 26, and while all three generally got good reviews, their contributions were overshadowed by the last-minute envelope gaffe that resulted in La La Land, and not the actual winner Moonlight, being announced as the best picture victor. As part of the official announcement, Kimmel joked, “If you think we screwed up the ending this year, wait until you see what we have planned for the 90th anniversary show.”\n\nAs for ratings, their maiden effort resulted in a 4 percent drop in viewership from the prior year as the show attracted 32.9 million viewers.\n\nStill, ABC, which was granted a larger advisory capacity about key elements of the show when the Academy renewed its contract with the network through 2028 last summer, was eager to see the host of its Jimmy Kimmel Live! invited back.\n\n“Jimmy, Mike and Jennifer are truly an Oscar Dream Team,” Academy president Cheryl Boone Isaacs said in announcing their selection. “Mike and Jennifer produced a beautiful show that was visually stunning. And Jimmy proved, from his opening monologue all the way through a finale we could never have imagined, that he is one our finest hosts in Oscar history.”\n\nAdded Kimmel, “Hosting the Oscars was a highlight of my career and I am grateful to Cheryl, [Academy CEO] Dawn [Hudson] and the Academy for asking me to return to work with two of my favorite people, Mike De Luca and Jennifer Todd.”\n\n“It’s not often you get two chances to have a once-in-a-lifetime experience and even more rare to be handed the keys to a party 90 years in the making,” De Luca and Todd offered in a joint statement. “We always thought the idea that anything can happen on the Oscars was a cliche until we lived it.”\n\n“Our Oscars team this year delivered a show that hit every high note,” Hudson said. “Jimmy brought back the essence and light touch of the greatest hosts of Oscars past. Mike and Jennifer’s love of movies is infectious and touched every aspect of the show. This is the perfect team to lead us into the ninth decade.”\n\nABC Entertainment president Channing Dungey observed, “After just one year, we can’t imagine anyone else hosting The Oscars. Jimmy’s skillful command of the stage is invaluable on a night when anything can happen — and does. With Mike and Jennifer at the helm, we’re ready for another unforgettable show that will dazzle, delight and, most importantly, honor 90 years of Hollywood’s most prestigious award.”\n\nThe early announcement represents something of a break with Academy tradition, which in the past has first seen the Academy president select the show’s producers and the producers then pick a host — a process that has sometimes resulted in a protracted search. Boone Isaacs, having completed four successive, one-year terms as president, will be stepping down in July, as the Academy’s board of governors elects a new president. But rather than wait for a new president to take over, the Academy is moving forward with plans for next year’s show.\n\nThe early announcement is not unprecedented, though. In both 2013 and 2014, the Academy announced in mid-April that producers Craig Zadan and Neil Meron, who first produced the 2013 show, would be returning to produce both the 2014 and 2015 shows. Both the Academy and ABC prefer to have producers who’ve already cut their teeth on one broadcast returning to handle the next year’s show, because it eliminates the learning curve facing new producers and provides for continuity of staffing.\n\nExtending an early callback to Kimmel, De Luca and Todd, ensures that all three will have plenty of time to prepare for next year’s show, which doesn’t take place until the first Sunday in March so as not to conflict with the closing ceremonies of the winter Olympics, which will be taking place the last weekend of February. Last year, Todd and De Luca were not named to produce the 89th Oscars until early November, and Kimmel wasn’t given the hosting assignment until early December. “I had to be at least eighth [choice],” Kimmel joked to THR. “It took so long for them to ask.”", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/5dd68a1a-78b7-45a1-995c-576810547569.png?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/5dd68a1a-78b7-45a1-995c-576810547569.png?w=1024", "keywords": [], "authors": ["Gregg Kilday"], "canonical_link": "https://www.hollywoodreporter.com/movies/movie-news/oscars-jimmy-kimmel-return-as-host-2018-honors-1004217/", "title": "Oscars: Jimmy Kimmel to Return as Host for 2018 Honors", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Producers Michael De Luca and Jennifer Todd, who also oversaw the last show, will be reteaming with him for the 90th Academy Awards.", "news_keywords": "ABC, Academy of Motion Picture Arts and Sciences, Jimmy Kimmel, Oscars", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Gregg Kilday", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1004217, "title": "Oscars: Jimmy Kimmel to Return as Host for 2018 Honors", "published_at": "2017-05-16 08:34:43", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/5dd68a1a-78b7-45a1-995c-576810547569.png?w=1024", "comment_count": 0, "tags": "Oscars", "topics": "Movies", "body": "Jimmy Kimmel will be back as host of the Oscars when the 90th edition of the annual Academy Awards ceremony is held March 4.\r\nThe Academy and ABC announced Tuesday that the late night host will reunite with producers Michael De Luca and Jennifer Todd for the 2018 show.\r\nThe trio teamed up for the first time for the most recent Oscar show Feb. 26, and while all three generally got good reviews, their contributions were overshadowed by the last-minute envelope gaffe that resulted in La La Land, and not the actual winner Moonlight, being announced as the best picture victor. As part of the official announcement, Kimmel joked, \"If you think we screwed up the ending this year, wait until you see what we have planned for the 90th anniversary show.\"\r\nAs for ratings, their maiden effort resulted in a 4 percent drop in viewership from the prior year as the show attracted 32.9 million viewers.\r\nStill, ABC, which was granted a larger advisory capacity about key elements of the show when the Academy renewed its contract with the network through 2028 last summer, was eager to see the host of its Jimmy Kimmel Live! invited back.\r\n“Jimmy, Mike and Jennifer are truly an Oscar Dream Team,” Academy president Cheryl Boone Isaacs said in announcing their selection. “Mike and Jennifer produced a beautiful show that was visually stunning. And Jimmy proved, from his opening monologue all the way through a finale we could never have imagined, that he is one our finest hosts in Oscar history.”\r\nAdded Kimmel, “Hosting the Oscars was a highlight of my career and I am grateful to Cheryl, [Academy CEO] Dawn [Hudson] and the Academy for asking me to return to work with two of my favorite people, Mike De Luca and Jennifer Todd.\"\r\n“It’s not often you get two chances to have a once-in-a-lifetime experience and even more rare to be handed the keys to a party 90 years in the making,” De Luca and Todd offered in a joint statement. “We always thought the idea that anything can happen on the Oscars was a cliche until we lived it.”\r\n\"Our Oscars team this year delivered a show that hit every high note,\" Hudson said. \"Jimmy brought back the essence and light touch of the greatest hosts of Oscars past. Mike and Jennifer's love of movies is infectious and touched every aspect of the show. This is the perfect team to lead us into the ninth decade.\"\r\nABC Entertainment president Channing Dungey observed, “After just one year, we can’t imagine anyone else hosting The Oscars. Jimmy’s skillful command of the stage is invaluable on a night when anything can happen — and does. With Mike and Jennifer at the helm, we’re ready for another unforgettable show that will dazzle, delight and, most importantly, honor 90 years of Hollywood’s most prestigious award.”\r\nThe early announcement represents something of a break with Academy tradition, which in the past has first seen the Academy president select the show's producers and the producers then pick a host — a process that has sometimes resulted in a protracted search. Boone Isaacs, having completed four successive, one-year terms as president, will be stepping down in July, as the Academy's board of governors elects a new president. But rather than wait for a new president to take over, the Academy is moving forward with plans for next year's show.\r\nThe early announcement is not unprecedented, though. In both 2013 and 2014, the Academy announced in mid-April that producers Craig Zadan and Neil Meron, who first produced the 2013 show, would be returning to produce both the 2014 and 2015 shows. Both the Academy and ABC prefer to have producers who've already cut their teeth on one broadcast returning to handle the next year's show, because it eliminates the learning curve facing new producers and provides for continuity of staffing.\r\nExtending an early callback to Kimmel, De Luca and Todd, ensures that all three will have plenty of time to prepare for next year's show, which doesn't take place until the first Sunday in March so as not to conflict with the closing ceremonies of the winter Olympics, which will be taking place the last weekend of February. Last year, Todd and De Luca were not named to produce the 89th Oscars until early November, and Kimmel wasn't given the hosting assignment until early December. \"I had to be at least eighth [choice],\" Kimmel joked to THR. \"It took so long for them to ask.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Oscars: Jimmy Kimmel to Return as Host for 2018 Honors", "url": "https://www.hollywoodreporter.com/movies/movie-news/oscars-jimmy-kimmel-return-as-host-2018-honors-1004217/", "description": "Producers Michael De Luca and Jennifer Todd, who also oversaw the last show, will be reteaming with him for the 90th Academy Awards.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/5dd68a1a-78b7-45a1-995c-576810547569.png?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2017-05-16T08:34:43+00:00", "modified_time": "2017-05-16T14:15:52+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Oscars: Jimmy Kimmel to Return as Host for 2018 Honors", "description": "Producers Michael De Luca and Jennifer Todd, who also oversaw the last show, will be reteaming with him for the 90th Academy Awards.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/5dd68a1a-78b7-45a1-995c-576810547569.png?w=1280"}}, "movies": [], "publish_date": 1494923683.0, "source": "https://www.hollywoodreporter.com", "summary": ""}