{"url": "https://www.vulture.com/2018/04/jersey-shore-mtv-oral-history.html", "text": "When the MTV reality series Jersey Shore debuted on December 3, 2009, it quickly became a cultural phenomenon that was both beloved and despised. It followed self-described young guidos and guidettes — depending on who you ask, terms of Italian pride or ethnic slurs — through a raucous, boozy summer in Seaside Heights, New Jersey. They tanned, they smushed, they conquered. And more importantly, they became a family.\n\nHere is the inside story of the original Jersey Shore, as told by its creators, stars, and other mere mortals who were drawn into their warm, orange orbit. [Editor’s note: This story was first published in 2018. We’re republishing it today for the show’s 10th anniversary.]\n\nNumber One Guido\n\nJersey Shore began as a VH1 project, where it was originally conceived as an all-male competition show. Casting scouts sought out the juiciest gym rats and tannest fist-pumpers the tri-state area (and beyond) had to offer, soon expanding their search to include their female counterparts. The now coed series moved to MTV, where it debuted.\n\nL to R: Vinny, Angelina, DJ Pauly D, JWoww, Ronnie, Snookie, The Situation, and Sammi Photo: MTV\n\nDoron Ofir (casting director): I was casting My Antonio, the Antonio Sabato Jr. dating show on VH1. While I was on set in Hawaii, Shelly Tatro — who was, at the time, the executive in charge over there — said to me, “I have something really interesting.” She shows me a stock-footage tape called “America’s Biggest Guido,” the origins of which I can’t remember. It was hilarious.\n\nSallyAnn Salsano (executive producer and founder, 495 Productions): Shelly Tatro at VH1 called me and was like, “S.A., you’re the biggest guido I know. You are doing this.”\n\nDeena Cortese: Back in the day, a “guido” was an Italian guy that usually has spiky hair, tan, muscles. You could spot a “guidette” from miles away — loud Italian girls, with tanned skin, [hair] poufs, animal prints, big sunglasses, and tight, skimpy dresses.\n\nDoron Ofir: My job was to go and find them. Whoever was throwing fists in the dance circles at nightclubs were the people we were approaching. Mike the Situation was the first cast. He was also featured in the original tape, so we already had an iconic archetype to build from.\n\nMike Sorrentino (a.k.a. the Situation): In 2008, I was trying to do fitness and underwear modeling and it wasn’t really working out. Someone told me that VH1 was trying to do a show about guidos from the East Coast. It was supposed to be a Challenge-type show at first. I did the pilot.\n\nSallyAnn Salsano: At the interview, Situation walked in and was like, “Okay, let me just take my shirt off first.” I was like, “What?” I have never in my life met someone that felt more comfortable upon not knowing you. He’s like, “Enough said, right?” Having casted a million of these, we had never really seen anyone do that before.\n\nDoron Ofir: Girls entered the mix, because I kept saying, “Look, the boys preen” — you know, they’re peacocks — “but the girls fight.”\n\nNicole Polizzi (a.k.a. Snooki): I saw an audition posting on Facebook for a show called Guidos and Guidettes. I went there drunk, because it was at a bar, and the rest is history.\n\nDoron Ofir: Nicole showed up in a miniskirt and she literally did cartwheels and flips. She was extraordinary. Her application was smudged with fingerprints from her bronzer to the point that I was like, “What happened to her application? What spilled on it?”\n\nPauly DelVecchio (a.k.a. DJ Pauly D): I was in Rhode Island, DJing away, and I got a message on MySpace. They said they liked my look for a potential show. Then a casting director called my phone and said, “We’d like to film a day in your life.” I didn’t take it too seriously, until they showed up at my house with cameras. I’m like, “Well, what do you want me to do?” They said, “Just do what you normally do.” So I went to the gym, I took them tanning, and then I took them to the club.\n\nDoron Ofir: What put Pauly D at the instant top of the list was that he owned his own tanning booth at his own house. A tanning booth is like $10,000. Who’s saving up coins and then buying a tanning booth?\n\nAngelina Pivarnick: I was going through a breakup. My girlfriends were like, “You’re coming out tonight.” We’re in this club, and I feel some girl tapping me on the shoulder. She goes, “Listen, I’ve been watching you for half an hour, and I think you’re amazing. I want to interview you for something.” [Angelina appeared in seasons one and two, but chose to leave the house early in both Seaside and Miami.]\n\nJenni Farley (a.k.a. JWoww): I worked at a nightclub in Long Island. We held casting calls all the time. They were casting for a VH1 show called Paris Hilton’s My New BFF and my best friend wanted to be on it so bad. He kept trying out, and I was like, “Listen, try out at my club one night. I’ll try out with you.” They called me a couple weeks later — “We really think we would love you for this Number One Guido show.”\n\nRonnie Ortiz-Magro: I had a shore house with my friends already in Belmar. I was out one night, doing whatever I do — I guess being a creep, if you wanna say — and a lady approached me. She was like, “Listen, you fit the criteria of somebody that we’re casting for a show. Would you like to try out?” Then I did a video audition. Of course, I acted like a complete crazy person. Took my shirt off, fist pumped. You know, what we do best — acting like maniacs.\n\nAngelina Pivarnick: One of the [interviewers] was like, “What would you do if you were living in a house with four hot, tan guidos?”And I’m like, “I’d put whipped cream all over their bodies and lick it off.” The camera guy was dying.\n\nDoron Ofir: At one point, there was a guy named “Joey Fist Pumps” in the mix. He was literally called Joey Fist Pumps. He was a union contractor, which is one of the reasons he wasn’t able to do the show. He had arms that were tremendous. He was one of those people that would fist pump on a dance floor and throw down in a dance circle of six dudes. He was a Jersey Shore regular. Girls wore Joey Fist Pumps T-shirts when they walked around him.\n\nNicole Polizzi: Before the show, no one really called me “Snooki.” They were looking for nicknames on the application. One of my girlfriends used to call me that, just to be funny, so I wrote that down. Then I was like, “Oh, shit.” Now that it’s stuck, I wish I’d put something else.\n\nJenni Farley: “JWoww” was my nickname in the club scene. One of my friends who was an emcee would always say “wow” on the mic when I walked by, to embarrass me. When we were at work together, he was like, “You need a stage name to go by.” And I was like, “Well, you always call me ‘Wow.’ You can say ‘Jenni Wow.’” And then it shortened over time to JWoww. Sounds a little stripper-ish, now that I look back at it.\n\nSallyAnn Salsano: Brian Graden was overseeing both MTV and VH1. He was like, “The good news is we’re going ahead, but the bad news is the people at VH1 that worked with you on the show, they’re losing it. It’s going to MTV.” When it moved from VH1 to MTV, we wanted to make it a little bit younger, so we swapped one or two cast members out.\n\nJacqueline French (executive producer): I believe we filled those last two slots with Vinny and Ronnie.\n\nVinny Guadagnino: I actually had a friend, as a joke, send me the application form. They were looking for big, muscular guidos with spiky hair. I wasn’t like that. I filled it out, like, “Listen, I like to go to the Jersey Shore, but I don’t look like your typical guido.” Then I got a call back a year later. They were like, “Hey, remember you filled out that thing?” I’m like, “What thing?” Next thing you know, I was in the house with those crazy people.\n\nDoron Ofir: As the concept started to build out, 495 [Productions] and SallyAnn were the ones that said, “Look, it was like zebras in the Serengeti. We wanted to see this in action.” Where does that happen? The Jersey Shore.\n\nI’m Going to the Jersey Shore, Bitch!\n\nThe production set their sights on Seaside Heights, a youthful resort town in Ocean County, New Jersey, where the year-round population of roughly 3,000 expands to more than 60,000 in the summer. When cast members weren’t working at the Shore Store T-shirt shop on the boardwalk, they divided their days between the gym, the tanning salon, and the laundromat — to the initial frustration of the producers, who wondered how they were going to make “GTL” into compelling television.\n\nMike Sorrentino: Seaside was a place you went to for your senior prom or junior prom. Once you turned 21, you would go to a Headliner or Karma or Bamboo on a Friday night. Everyone would flock from Long Island to come down here.\n\nMichael Loundy (owner, Seaside Realty): I got a call from a production company. They didn’t say who they were, they didn’t say what the show was. They called looking for a six-bedroom home.\n\nDanny Merk (owner, the Shore Store and the Jersey Shore house): They interviewed me for about two months. Every week they’d have someone come in and check the house. At the very end, SallyAnn came in, cursing and saying all this crazy stuff. She was nothing like the other people I met. She was like, “How long will it take you to get all of your stuff out of here?” And I was like, “Well, I don’t know, a couple of days.” “Can you do it in 24 hours?” She handed me an envelope, and I was like, “All right, no problem.”\n\nSallyAnn Salsano: Our art director went out and goes, “I saw this duck phone. It’s so ridiculous.” I said, “We cannot leave that in the house. It doesn’t make sense.” Then the show started and I’m like, “Oh my God, we left that duck phone in there.” Now the duck phone is the national symbol of Jersey Shore.\n\nJenni Farley: I didn’t know I was gonna end up on the shore and have roommates. It was very secretive. I walked into a hotel in Jersey, gave them my cell phone, my credit card, my ID, my wallet, keys to my car. And they’re like, “Well, if you’re picked, you’ll be back home in five weeks, or if you’re not picked you can go home in a few days.” Two days later, they’re like, “Here’s the directions to the house, so we’ll see you there.”\n\nVinny Guadagnino: I honestly didn’t know what the hell it was. I personally thought that it was going to be a half-hour special. True Life: I Go to the Jersey Shore, something like that. Just a one-shot thing.\n\nNicole Polizzi: I was training to be a veterinary technician. We would help deliver cows. I loved it. I had one more semester until I could graduate and then try to get my license. This was a huge thing for me because I was missing all my classes. I felt very guilty.\n\nAngelina Pivarnick: They didn’t really give me too much notice that I was going, so I was like, “Oh, crap. What am I gonna put my stuff in?” I literally just took my stuff and threw all of it in garbage bags. I drove down to Seaside and I walked in the house with garbage bags. I’ll never live that one down, but hey.\n\nNicole Polizzi: When I walked into the house, I was like, “Oh, these aren’t guys I would hang out with down the shore.” Pauly is the only one that looked legit. Vinny’s pale and doesn’t tan. That’s weird. I felt like I was in the wrong house.\n\nRonnie Ortiz-Magro: Nicole was the ultimate guidette, with the pouf and the spray tan and the glittery shirts. I’m like, “Where are you from?” She’s like, “Poughkeepsie.” I was like, “They make guidos in Poughkeepsie? Wow. I guess this is an epidemic or something.”\n\nVinny Guadagnino: I felt like an alien landing in guidoland. I’m from Staten Island. I grew up around those people. But at the same time, I was like, “Wait, do they still exist?” That whole fad was a couple years before that. Lo and behold, I walk in and I see Pauly D with his giant blowout and I’m like, “They found the last guido that remains in this century. This is going to be a long summer.” He ended up being my best friend, ironically.\n\nSallyAnn Salsano: The sheer amount of footage we shot on this show is unprecedented. There were 42 cameras inside the house, inside the Shore Store, and on the boardwalk. In Seaside, we had them up and down the boardwalk, down to the Ferris wheel. We literally wired the entire town. Later, in both Miami and Italy, I was able to live in the house. We would treat the cameras like baby monitors. If it was quiet, you ran upstairs and went to sleep. The minute you heard them chirping, you ran back downstairs.\n\nPauly DelVecchio: The only time you’re off camera is when you’re in the bathroom. Even if you’re in the bathroom with somebody else, they say two is a party, so they film it. We took long showers to get away from cameras. But it does become second nature.\n\nSallyAnn Salsano: At first, I remember panicking in the control room. I’m like, “For fuck’s sake, all I have is four guys getting their goddamned laundry done, going to the gym, and tanning. That’s not a TV show.” We were writing on a dry-erase board — because we always were like, “Okay, so-and-so went here, so-and-so went here” — and every day we’d write “gym, tanning, laundry.” Then we got lazy and just started writing “GTL.”\n\nPauly D hits the tanning salon in Miami, while filming season two. Photo: Ralph Notaro / Splash News/Ralph Notaro / Splash News\n\nRonnie Ortiz-Magro: It’s everything we did. We gotta look good, we gotta be in shape, we gotta be tan, and our clothes have to be fresh.\n\nJohn Messina (general manager, KS Fitness): They came and worked out almost every day for an hour, using free weights. Great guys.\n\nLori Vogel (owner, Simply Sun Tanning): We would have somebody in, I would say, almost every day. Typically they’d tan like 10, 12 minutes. Luckily, when they were filming, it was summer, and summer is always a bit slower for a tanning salon.\n\nJenni Farley: We all did the same things. We all ran in the same groups. And at the end of the day, we could all appreciate family, Sunday dinners, and genuinely enjoying each other’s company.\n\nMike Sorrentino: Sunday family dinner was very important because it brought us together. Someone would set the table and someone would make the salad and we would all eat together and say grace. Everyone loved sausage and peppers. They loved chicken parmesan. They loved the fresh tomato sauce. We would make sautéed vegetables. We would grill steaks and chicken. We came together on Sunday dinner and put our differences aside, and we always had differences.\n\nVinny Guadagnino: We did the first season for nothing, zero dollars, except whatever we made at the Shore Store. Me and Ronnie, the first week, we told production, “Listen, I think we have to leave. We don’t have any money.” I’d just graduated college, I didn’t have a job. Ronnie was doing real estate at the time, so he was making real-estate calls on the duck phone. He would say, “Hey, do you consent to being recorded? I’m on a TV show,” and then would go into a spiel about some deal he’s doing. One night, they paid us to promote at Club Karma. I think they gave us like 500 bucks. At the time, if you handed me 500 bucks, that was like handing me a million dollars. I was good for the rest of the summer.\n\nSallyAnn Salsano: It was exactly the real experience if you went there and worked in the T-shirt shop — [Danny Merk] would pay people to work in the T-shirt shop on top of free rent.\n\nDanny Merk: They started off at $10 an hour, then it went to $15, and then I think I gave them 20 bucks an hour at the very end. You live in a beach house for free and get 20 bucks an hour? It was great money!\n\nMike Sorrentino: For some reason, they rode me on every job. I don’t know if producers told them to. Maybe it was because I was a bit of a slacker.\n\nDanny Merk: Mike sucked. Mike worked hard at not working. And Nicole sucked. Her best year was when she was pregnant because she was sober and she didn’t have a hangover. The very first day, man, Pauly took it seriously. Vinny was always trying to pick up an extra shift. Jenni and Sammi, I would always put them on the register because they were great. Jenni was a fantastic upseller. She’d bully people into buying things.\n\nJenni Farley: I’m a daughter of a used-car salesman. I honestly would not let customers check out unless they bought a shot glass for $5. I gave no options.\n\nCabs Are Here\n\nNights on Jersey Shore were all about partying. The roommates donned their Friday-night best (and aggressively applied bronzer) to frequent local clubs like Karma and Bamboo, where they fist-pumped, took shots, and dodged the undesirable women they deemed “grenades.”\n\nNicole Polizzi: We would start pregaming at 9:30, 10, so’d we all have a good buzz on for the club.\n\nPauly DelVecchio: T-shirt time was probably around 10:30. That means, everybody put your T-shirts on, ‘cause we’re about to go out.\n\nMike Sorrentino: It’s the whole outfit: Hopefully brand-new jeans — or pressed jeans — brand-new shoes, brand-new socks, brand-new underwear, a matching belt. And the shirt has to be a cool-looking shirt, whether it’s a cool color or a cool phrase. Everything has to work together.\n\nJenni Farley: I’m pretty sure we destroyed the ozone layer with the amount of hairspray and aerosol cans we used on a daily basis. Actually, I’m surprised I didn’t get bronchitis because we never opened a window. We all had to have spray tans, layers of hairspray, thin eyebrows. It was at least two or three hours because of the rotation of the bathroom. It was insane.\n\nDeena Cortese: We always had false eyelashes, hair extensions, and lots of bronzer. We basically had bronzer prints everywhere because we’d get it on our hands. It would get on our door. It would get on our dresser. The poor boys would have bronzer everywhere in the house.\n\nPauly DelVecchio: The blowout process is kind of wild. It has to be straight from the shower. Your hair has to be clean. I blow-dry it and I use a pick and I pick it up, almost like an Afro — my hair’s really thick. And then I put in the product. The product’s so strong, it’s like Elmer’s Glue. I put it all through my hair, spray it, blow-dry it again, and then I use the pick to get those spikes perfect. Perfecting it takes forever. It’s like 25 minutes.\n\nNicole Polizzi: The pouf basically took me five seconds. My hair is so thick that I can literally just clip it and it’s done.\n\nBryan Huntenburg (manager, the Bamboo Bar): They would give us maybe 20 minutes’ notice: “We’re coming in tonight.” In the beginning of the first summer, it was so low-key because nobody really knew what was going on. You would see a group of kids and a big crew, but everybody ignored them. By the end, it was a totally different situation. It was like people watching a movie being filmed, waiting for the next shoe to drop.\n\nJenni Farley: Back in the day, I would drink, like, four Long Island Iced Teas and be cross-eyed, and then five or six shots on top, lemon drops. I’d just be completely nauseous and hugging the toilet for eight hours.\n\nWe basically had bronzer prints everywhere because we’d get it on our hands. It would get on our door. It would get on our dresser… everywhere in the house.\n\nNicole Polizzi: We drank a ton. I don’t even know how we’re alive.\n\nRedfoo (formerly of LMFAO): “Get Crazy” made a good theme song because it fit the spirit of the show to a T: “Get crazy, get wild, let’s party, get loud” … Is it wild or loud? [Laughs.] When you listen to the song, it makes you feel high. It takes over your body and it alters your state. I don’t think a lot of people even knew it was LMFAO.\n\nDeena Cortese: The “Jersey Turnpike” is, basically, you put your hands on the floor and you shake your booty. Now they like to call it twerking. But I made it up, and it’s the Jersey Turnpike.\n\nPauly DelVecchio: When you’re meeting girls, there’s always one friend that’s great and there’s always that other, unattractive friend, so we call her the “grenade.” The reason we call her a grenade is because she always blows up at the end of the night. They’re always like, “I don’t have anybody to meet, so I wanna go home.” I don’t know how much it could fly anymore — you better be careful nowadays on television, ‘cause people are more sensitive.\n\nVinny Guadagnino: I will say this: A “grenade” evolved to mean a fat girl, which was never the case. The original definition of it was when you’re hanging out with a girl, she has a friend, and you need your friend to entertain the other friend who he might not be attracted to, but he’s just being a good wingman. It could be any-looking person — it’s just someone your friend has to sacrifice himself for.\n\nCome at Me, Bro\n\nJersey Shore was infamous from the very beginning. Some New Jersey residents were offended by the hard-partying portrayal of their state; Italian-American advocacy groups took exception to the use of the word “guido” and the show’s reinforcement of negative stereotypes. Multiple advertisers pulled their commercials from the show. Footage of Snooki getting punched proved to be particularly controversial.\n\nPauly DelVecchio: We had so much controversy in the beginning. A lot of people wanted to see what all this was about, so that gave us a lot of viewership. I can’t really even hate on the haters. I gotta thank them.\n\nAndre DiMino (communications director, Italian American One Voice Coalition): I was absolutely flabbergasted at the use of the word “guido.” They showed the cast being intoxicated, acting very dumb. I saw violence against women. And they were specifically saying, “These are Italian-Americans.” I mean, how disgraceful that they had the Italian flag as a bedspread and they were having relations on top of the Italian flag. Not all the people that were on Jersey Shore were even Italian-Americans. To me, that was even worse. That was like a minstrel show.\n\nDeena Cortese: I thought it was silly. We were young kids and that’s what we called ourselves, so I don’t know why they’re getting offended. We weren’t representing for Italians. We were representing for ourselves, just going down the shore and having a good time.\n\nVinny Guadagnino: I was getting a little irritated because I was pretty much the only one who was first-generation Italian in the house. My family is straight off the boat from Sicily. They’re not offended. If we went to Italy right now, real Italian people wouldn’t be like, “Oh, they’re giving Italians a bad name.” They’d be like, “Look at these stupid Americans.”\n\nAndre DiMino: I had meetings with Viacom and MTV executives and we did get 11 national advertisers to pull their advertising. The first was Domino’s Pizza.\n\nTim McIntyre (executive vice president of communication, investor relations and legislative affairs, Domino’s Pizza): The morning after MTV aired the first episode of Jersey Shore, our third-party media buyer told MTV the content wasn’t right for the Domino’s brand. We requested that our spots not air on future episodes. We had not been given a chance to review the content ahead of time — had we had the chance, we would have said no before the show ever hit the air.\n\nOne of our objections was a scene in which a man at a bar was shown punching a woman, Snooki. We did not and do not condone that kind of violent behavior against anyone, and we could not support the programming with our advertising dollars. We do not consider men hitting women to be “entertainment.”\n\nDoron Ofir: Snooki had never been away from home. The other roommates didn’t like her. She didn’t fit in. She wanted to quit the show. What brought the house together, unfortunately, was the attack on Snooki at that bar — because suddenly, they protected her. At that moment, they became a family.\n\nNicole Polizzi: I remember ordering shots for the roomies. The guy was so drunk, he kept taking the drinks we were ordering. I just yelled at him, and right when I did, he punched me. I was like, “Oh, that’s cool. I think I just died.”\n\nSallyAnn Salsano: Everyone was shocked. That united all of us in a way — the people in front of the camera, the people behind the camera. In that moment, everyone became so much more human.\n\nPauly DelVecchio: We wanted to kill this guy. It’s like we saw our sister get punched in the face.\n\nJacquelyn French: The punch did air once. It aired in the super-tease at the end of episode two. There was some backlash out in the world, and we talked about it internally to decide whether or not we wanted to show a woman getting punched in the face. We don’t want to pretend it didn’t happen. We ended up showing everything that led up to it, and then showing the aftermath. We dipped to black at the point that he actually made contact with Snooki’s face.\n\nNicole Polizzi: That was actually my parents’ doing. They demanded MTV not show it. It was nice that they listened, because my dad was really, really upset about it.\n\nJenni Farley: It’s cut really quick, but if you slow it down, you can see me hit him. The anger is still there, nine years later. I always say I would never do anything different, except I would have hit him harder if I could’ve.\n\nVinny Guadagnino: I think that’s what made the show so big — I’ve never seen that on TV. Nicole can take a punch too, man. She has a strong chin.\n\nMichael Carbone (owner, Beachcomber Bar & Grill): For years I had a Snooki chair, where she was sitting that night. Everybody would come in and sit in the Snooki chair.\n\nNever Fall in Love at the Jersey Shore\n\nThe pursuit of hookups became a central theme of Jersey Shore. Within the house, Sammi and Ronnie embarked on an on-again, off-again roller coaster of a relationship that was rarely short on toxicity or drama — particularly in season two, when Jenni and Nicole wrote an anonymous note to tell Sammi that her boyfriend had kissed (among other things) other women.\n\nVinny Guadagnino: The first season, I didn’t get laid at all. I kissed one or two girls, that was the extent of it. Then, obviously, it went anywhere from 20 to 30, 20 to 40.\n\nJenni Farley: I mean, six seasons, you divide it by three single guys. I would say at least 100 [overnight guests], 15 to 20 a season. There was a lot that you guys didn’t even get to see.\n\nPauly DelVecchio: The “smush” room was absolutely disgusting. I’m a neat freak, so I’m not trying to use a community bed that people smush on. I’d rather use my own bed.\n\nSallyAnn Salsano: People are literally given a field sobriety test to get into the house. We have the same carding system they have at that club — that electronic thing where they run your ID — because we don’t let anybody in the house that’s not 21. Also, if someone is that inebriated, we’d ask people to leave.\n\nDoron Ofir: My thoughts were, initially, that JWoww and Mike would have coupled off. I did hope that Sammi and Ronnie would couple off. Episode one, it was really Sammi and Mike — but literally, day three, Sammi and Ronnie were inseparable. They became the the most organic, volatile duo, I think, in the history of reality television.\n\nMike Sorrentino: It was hard ‘cause we all started to get close. And when you start seeing [Sammi and Ronnie] fight, it’s like, “Oh, let me try to mediate.” Then out of nowhere it gets turned on you: “Stop meddling in my relationship.” It was a very fine line. You start to be nice to one person and they think you’re picking sides, so it was a lose-lose situation.\n\nRonnie Ortiz-Magro: I was always the one that said, “Don’t fall in love on the Jersey Shore.” I guess it was just something that clicked between us, you know? Being around somebody 30 days straight with no television, no cell phone, and you can’t really leave the house too much — obviously, that has a lot to do with it as well. It’s no regrets. She’s a great girl and I hope she’s happy in life. I learned what you shouldn’t do in a relationship, obviously.\n\nRonnie Ortiz-Magro and Sammi “Sweetheart” Giancola during the last day of filming in Miami. Photo: Troy Rizzo/Getty Images\n\nNicole Polizzi: Ron and Sam drama was so crazy. Now, I would stay out of it, honestly, and be like, “Girl, it’s not my business to tell.” Me and Jenni, we just felt like, as girlfriends, you want to tell [Sammi that Ronnie was cheating in season two]. We got the idea to print a letter, so Jenni told me what to type and I typed the whole thing out. We figured Sam would never know it was us because we didn’t have access to phones or computers or printers. We were hoping if she found it, she would think a producer was giving her a heads up. But the producers made sure to tell her, “No, it wasn’t us. It was one of your roommates.”\n\nJenni Farley: It completely backfired. She really was more mad that someone wrote the note than about what was written in the note. It was so hard for us in Miami. Picture two months with no cell phone, internet, TV, no pens or paper, and living with someone that hates your guts.\n\nThey made a decision to show us the episodes that season while it was airing out in the real world, so we’re all on the couch watching season two, off camera, seeing the episodes of Ron cheating. Me and Nicole were like, “Wow.” We were finally getting what we felt like we deserved.\n\nSammi Giancola (a.k.a. Sammi Sweetheart): [Declined to be interviewed.]\n\nThe Dawn of Jerzday\n\nNot long after the first episode premiered, the cast of Jersey Shore became full-on celebrities. Barbara Walters included them on her 2010 list of “Most Fascinating People.” They were eventually the subjects of both a South Park episode and an academic conference at the University of Chicago. Season two took the roommates to Miami; in season three, they returned to Seaside and found that their newfound fame had profoundly changed the place where they spent the previous summer.\n\nDanny Merk: When they moved out after season one, I thought the show was over. There’s a million reality shows out there, let’s be honest. After the show airs, the next day, there’s people knocking on my front door and walking on my back deck. It’s not my house anymore — it’s like a museum.\n\nVinny Guadagnino: Back then, Facebook was everything. I remember, the night of the premiere, I had like 80 requests. I was like, “Oh my God, 80 Facebook requests! This is crazy!”\n\nNicole Polizzi: We went to L.A. for press during season one. None of us went to the West Coast before. Kimmel was our first big show. We were only supposed to be there for that, then come back. We ended up staying a couple extra days because they were booking us for all these other shows. And then, going out that night, we were hanging out with Leonardo DiCaprio and Lindsay Lohan. All the celebrities were coming up to us, “I love your show,” saying “GTL,” having shots with us. That’s when we knew our show is a big deal, because even celebrities know who we are.\n\nMike Sorrentino: They said, “We’re gonna do season two,” and we got a very large raise. It was a really big deal at that time.\n\nWe were hanging out with Leonardo DiCaprio and Lindsay Lohan. That’s when we knew our show is a big deal, because even celebrities know who we are.\n\nDoron Ofir: Jersey Shore was the No. 1 show in Asia and it was called Macaroni Rascals. That’s insane.\n\nJenni Farley: I remember one of the highlights of that time was paparazzi saying that Obama mentioned us in a speech. And I was just like, “What?!” Bad or indifferent, I could have cared less. I was just like, “He knows who I am?”\n\nSallyAnn Salsano: When we went back for season three, it was packed. There was from 1,000 to 3,000 people following us around everywhere — people on a family vacation from Nebraska, people from Australia.\n\nJenni Farley: When there were thousands of people outside the Shore Store, they made them wait in line to come in. They would tell them, “These guys are still working. Can’t talk about the show. Be normal.” That made us feel comfortable. We never felt like we were celebrities. We were just being us.\n\nDanny Merk: Out of the sayings from the TV show, “Yeah Buddy” was on fire. I sold so much “Yeah Buddy” merchandise, especially when Pauly was inside the store. “Come at Me, Bro” was on fire, and “T-Shirt Time.” Those three, plus “I’m the Sweetest Bitch You’ll Ever Meet” and “Don’t Fall in Love at the Jersey Shore.” That’s a classic saying no matter what.\n\nMichael Loundy: It was a tremendous shot in the arm, fiscally, for our area. Across the board, everybody was up 20 percent. We’re still renting the Jersey Shore house very aggressively at $1,200 a night. We get multiple calls per day, people asking availability. We’ve got pictures of grandmothers fist-pumping in front of the front door.\n\nRonnie Ortiz-Magro: We weren’t allowed to go on the balcony in the front of the house during the day because that’s where the fans would sit. Every time we went outside, the whole block would scream. It was like being at a Yankee game when they chant everybody’s name.\n\nNicole Polizzi: Obviously, we’re grateful. But it got to be too much. It was just a huge production. We’d have security guards all around us, paparazzi getting us, then the fans everywhere. It was a lot to take in, especially if you’re not used to it.\n\nVinny Guadagnino: When drunk people saw the cameras, it was a very hostile experience. We almost got into fights every single night we went out. It’s amazing to think about — wouldn’t you not want to fight with a person in front of a camera?\n\nI remember all love from the police and from the local government. Obviously, Nicole still got arrested in season three, but they weren’t trying to be hostile towards us.\n\nNicole Polizzi: I was a hot mess — I knew I was gonna eventually get arrested for being drunk and disorderly. I wasn’t surprised. I blacked out, but I remember thinking, “How do I get on the beach?” I was so drunk, to the point I couldn’t even say, “How do you get on the beach?” So I just said, “Where’s the beach?”\n\nCiao, Firenze\n\nSeason four explored the difference between “Italian” and “Italian-American” by relocating the fish-out-of-water cast to Florence, Italy, where ancient cobblestone streets replaced the boardwalk and they earned their keep making pizza instead of selling T-shirts.\n\nPauly DelVecchio: I loved Italy, but it was a bit of a culture shock for me. Here I am, this big Italian from the East Coast. I go to Italy and I’m like, “Whoa, this is real. These are real Italians. I’m Italian-American.” I was like, “Where’s breakfast?” They didn’t have breakfast. It was like cappuccinos and all this other stuff. I’m like, “What is going on with these four-hour lunches?”\n\nJenni Farley: I told my roommates, “Dude, you can stick us in Alaska and we’re gonna have freaking drama. At least let’s appreciate the art while we’re punching each other in the face.”\n\nRonnie Ortiz-Magro: I went back to Florence two years ago and I actually was able to be a tourist, which we didn’t really do in Italy. It’s crazy, because so many things we walked by every day — whether we were walking to the store, to the house, to the club — were thousands and thousands of years of history.\n\nMike Sorrentino: Italy wasn’t my best season, only because I was not very healthy that year. I was arguing and fighting with everyone. I banged my head on a concrete wall. To be honest with you, I actually thought the wall was sheetrock. It was a very big miscalculation. I was in that neck brace for, I don’t know, two to four weeks, probably. Sprained neck and concussion.\n\nVinny Guadagnino: We went to Sicily to visit my family. That was probably my favorite moment from all of the show. I have a lot of aunts and uncles and second cousins that I’d never met, that I’d heard about my whole life. Their town in Sicily is really small, almost a horse-and-buggy type of town. They did not flinch at the cameras for a second. They’d probably never seen cameras that big in their life. We were having dinner around the table. They didn’t pay attention — they cared about their food.\n\nOnce More Unto the Beach\n\nJersey Shore ended where it all began, with two final seasons back in Seaside Heights. By the beginning of season six, Nicole was pregnant and engaged to now-husband Jionni LaValle.\n\nNicole Polizzi: It was nice to be able to say I was a part of the last season, but I didn’t actually want to do the show. I was like, “Listen, I’m pregnant. I don’t want to be in that house, it’s filthy. Everyone’s gonna be drinking.” I’ve always wanted to be a mom, and I wanted to go about it the safest, healthiest way. Obviously, MTV and the roomies wanted me to do it, so they got me a separate house right next door, which was nice. I didn’t really do much. I just sat in my room the entire time. I was in mom mode, ready to change my entire life, and I didn’t want to be around the party scene at that time.\n\nA pregnant Snooki prepares to move out of the shore house. Photo: Brian Prahl / Splash News/Brian Prahl / Splash News\n\nMike Sorrentino: I stayed sober season six. It was very challenging at that time. Having a lot of education and knowing myself now, I was almost setting myself up for failure. I didn’t have a sponsor. I was just doing it by willpower. I did a good job, but I relapsed when I got home. After years of trial and error, I realized, “Wow, my way is the wrong way and I need others to help me.”\n\nJenni Farley: We were all settling down. Family, engagements, and weddings.\n\nDeena Cortese: It was definitely bittersweet, because we all love each other, but I felt like it was the right time to end it. We were all getting older.\n\nAngelina Pivarnick: Watching from the outside, I had a mix of emotions. I thought, “Wow, maybe I don’t have to hear about it anymore. I could put this behind me now.” Even though the cast didn’t like me, I still wanted to see them happy. I’m not a jealous hater like that.\n\nMike Sorrentino: I remember all of us — production, everyone — being very teary-eyed and upset at the time. They said, “Listen, we want to revisit this and refilm in a different way in the future.” And I guess we’re here now. It came back.\n\nThe Endless Summer\n\nJersey Shore cast members later starred in the eponymous MTV spinoffs The Pauly D Project, Snooki & JWoww, and The Show With Vinny, all three of which were executive-produced by Salsano and French. A revival, Jersey Shore: Family Vacation, premiered in 2018. The original series itself remains a cultural touchstone around the world: It’s been remade internationally seven times, including in the form of the U.K.’s Geordie Shore.\n\nDoron Ofir: MTV had an enormous amount of success leading up to Jersey Shore with The Hills, Laguna Beach, and The City. They were incredibly cinematic. They were about the very aspirationally motivated lives of young adults. And Jersey Shore bulldozed through that.\n\nNicole Polizzi: I’m grateful that the show helped me meet my husband. Watching me and Jionni meet, I wish it was something romantic. It was a drunken hookup and it was not the way I want to remember us meeting — I cringe when I watch it, because I’m like, “Oh my God, ew.” But I love the fact that I met him while I was down the shore.\n\nSallyAnn Salsano: I think it’s the first time you had a cast live their life unapologetically. Even when I was doing The Bachelor, a girl would get too drunk at the rose ceremony, then they’d cry about it for the whole next week. These guys would be like, “Well, that was a disaster. All right, today is a new day.”\n\nPauly DelVecchio: I have a theory it’s like music. The music that works is the music that’s relatable. Like Taylor Swift songs — when you’re having a breakup, you put those on, ‘cause they’re relatable. You wanna party, you put on a Lil Jon track. With eight of us in the house, somebody out there is gonna have something that’s relatable with us. A lot of people are like, “Me and my friends used to get a shore house and do that every single summer.” Or you used to have a girlfriend, like Ronnie and Sam, where you always fight but still love each other. And then there’s always a party guy.\n\nMike Sorrentino: I have over two years clean and sober now. I quit cigarettes. I don’t drink. I don’t do drugs. I don’t steal. I’ve become older and wiser, but at that time period, I was just a very wild man in his 20s. You saw it. It was like a train wreck. I wouldn’t change a thing, because I wouldn’t be here today, in an awesome place. When you lived a very full life in your 20s, you don’t necessarily have to go back to that type of behavior in your 30s.\n\nDeena Cortese: We’re like a bad car crash, you know? You have to look at it.\n\nAngelina Pivarnick: What has everybody else done when they were 21 years old? I bet if there was a camera on most people, you would be shocked.\n\nVinny Guadagnino: I don’t think it’s a bad thing for people to see us like that, going through our 20s, being real. This is the way young kids back then would talk and make mistakes. We would call girls names where we might be like, “Aw, man, I shouldn’t have said that.” It’s not this sugar-coated thing where everyone is monitoring everything they’re saying just so they can appease everybody.\n\nNicole Polizzi: I think we were the realest reality show. I can watch every other reality show and tell you, “That’s not real, someone told them to say that.”\n\nRonnie Ortiz-Magro: We were young, so people watched us grow up. And we weren’t produced. We didn’t have people to say, “Do this, act this way, this is where you’re going.” We were put into the water and we swam.", "images": ["https://pyxis.nymag.com/v1/imgs/f97/1be/c724430d7bbbe65535395c7ceea9f97d6c-05-jersey-shore-season-1.rhorizontal.w710.jpg", "https://pyxis.nymag.com/v1/imgs/0d3/6ee/b1434b570e3c02e78bc39589af5b7740e6-05-jeresy-shore-oral-history.1x.rsocial.w1200.jpg", "https://pyxis.nymag.com/v1/imgs/e33/6e7/aed044d06bd5c293490430f400dc112e41-2022Cov4x5-AsianAmericaPkg.w240.jpg", "https://pyxis.nymag.com/v1/imgs/0d3/6ee/b1434b570e3c02e78bc39589af5b7740e6-05-jeresy-shore-oral-history.w1600.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/0d3/6ee/b1434b570e3c02e78bc39589af5b7740e6-05-jeresy-shore-oral-history.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Molly Fitzpatrick"], "canonical_link": "https://www.vulture.com/article/jersey-shore-mtv-oral-history.html", "title": "Jersey Shore: The Oral History of MTV’s Wildest Reality Show", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "parsely-tags": "jersey shore, oral history, television, reality tv, jersey shore family vacation, tv, the best of vulture, oral histories, vulture homepage lede, vulture section lede, featuretype:feature", "og": {"title": "Jersey Shore: An Oral History", "url": "https://www.vulture.com/article/jersey-shore-mtv-oral-history.html", "description": "“It was like zebras in the Serengeti. We wanted to see this in action. Where does that happen? The Jersey Shore.”", "image": "https://pyxis.nymag.com/v1/imgs/0d3/6ee/b1434b570e3c02e78bc39589af5b7740e6-05-jeresy-shore-oral-history.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Jersey Shore: An Oral History", "description": "“It was like zebras in the Serengeti. We wanted to see this in action. Where does that happen? The Jersey Shore.”", "image": "https://pyxis.nymag.com/v1/imgs/0d3/6ee/b1434b570e3c02e78bc39589af5b7740e6-05-jeresy-shore-oral-history.2x.rsocial.w600.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2019-12-04T14:50:00.000-05:00", "tag": "jersey shore, oral history, television, reality tv, jersey shore family vacation, tv, the best of vulture, oral histories, vulture homepage lede, vulture section lede", "publisher": "https://www.facebook.com/Vulture"}, "description": "The complete story behind MTV’s Jersey Shore, the reality show that became a pop-culture phenomenon, in the words of DJ Paulie D, Snooki, The Situation, Ronnie, Vinny, Angelina, and Deena.", "robots": "max-image-preview:large", "sailthru.tags": "jersey shore, oral history, television, reality tv, jersey shore family vacation, tv, the best of vulture, oral histories, vulture homepage lede, vulture section lede", "author": "Molly Fitzpatrick", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://assets.nymag.com/media/sites/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1575489000.0, "source": "https://www.vulture.com", "summary": ""}