{"url": "https://www.bustle.com/p/bachelorette-contestant-michael-nance-dies-at-age-31-61120", "text": "Here is some sad news for Bachelor nation. According to E! News, former Bachelorette contestant Michael Nance died at the age of 31 Monday in Texas. An Austin Police Department Homicide Unit spokesperson told E!, \"At this point it is not a suspicious death and the manner will be determined by the medical examiner.\" E! reports that police officers found an unresponsive male on May 29, who was soon later identified as Nance. He was reportedly pronounced dead at 2:54 a.m.\n\nPeople reported Tuesday Nance was rushed to the hospital after his body was found and that is where he was declared dead. A cause of death has yet to be determined, but according to People, an autopsy will be performed Tuesday and toxicology results will reportedly take weeks.\n\nNance was known for appearing on Season 8 of The Bachelorette, where he vied for Emily Maynard's heart. Nance was eventually eliminated from the competition and came in 12th place. He also made it known on the reality series that he battled with an addiction to prescription painkillers. \"I was addicted to prescription pain medicine,\" he said in his introduction package. \"It all starts out fun and then somewhere along the road, it just turned into something else. It’s a vicious cycle and it ate away at me for a long time.\" At the time of The Bachelorette he also said, \"I’m almost two years sober, now, and it’s not that easy — you have to completely change your way of living.\"\n\nMaynard took to Twitter Tuesday expressing her sadness over Nance's death and sending condolences to his loved ones. \"So sad waking up to the news about Michael Nance,\" she tweeted. \"Such a kind heart with so much talent. Sending prayers and love to his family and friends.\"\n\nNance's fellow Bachelorette contestants have also taken to social media to react to the news of his sad death. Chris Bukowski tweeted Monday, \"Extremely difficult learning the news of Michael Nance's passing. He was a gentle man with a huge heart. He'll be missed but not forgotten.\"\n\nSeason 8 runner-up Arie Luyendyk Jr. posted, \"I will always remember my friend Micheal Nance for his kind and fragile soul. Addiction is a terrible disease, may he finally find peace.\" Sean Lowe, who did not win Maynard's heart, but eventually found love with Catherine Giudici during his season of The Bachelor, tweeted, \"My heart breaks to hear about the passing of my friend Michael Nance. He was a sweet man with a kind soul. We all loved him on Bachelorette.\"\n\nIt sure seems like Nance left an impact on many and will truly be missed.", "images": ["https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2022/9/27/7e34941b-c255-4620-81ee-30c19b9bf908-getty-1192589969.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/3/3de56b0e-adf0-4513-8559-4775d762203c-sierra-michael-header001.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/2017/5/30/7a9aa338-eb9e-4384-b7fb-ad1f5bce42b8.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2022/10/4/1212d7a1-1506-4709-80a5-0059d5a9cc8c-peter-kelley-display001.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2022/9/23/459754bf-8bdf-4413-9944-b7495802b04d-163674_15471.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/2017/5/30/7a9aa338-eb9e-4384-b7fb-ad1f5bce42b8.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/2017/5/30/7a9aa338-eb9e-4384-b7fb-ad1f5bce42b8.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/bachelorette-contestant-michael-nance-dies-at-age-31-61120", "title": "'Bachelorette' Contestant Michael Nance Dies At Age 31", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@AllysonKoerner"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/bachelorette-contestant-michael-nance-dies-at-age-31-61120", "type": "article", "title": "'Bachelorette' Contestant Michael Nance Dies At Age 31", "description": "Here is some sad news for Bachelor nation. According to E! News, former Bachelorette contestant Michael Nance died at the age of 31 Monday in Texas. An Austin Police Department Homicide Unit spokesperson told E!, \"At this point it is not a…", "image": {"identifier": "https://imgix.bustle.com/2017/5/30/7a9aa338-eb9e-4384-b7fb-ad1f5bce42b8.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Here is some sad news for Bachelor nation. According to E! News, former Bachelorette contestant Michael Nance died at the age of 31 Monday in Texas. An Austin Police Department Homicide Unit spokesperson told E!, \"At this point it is not a…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}