{"url": "https://www.cinemablend.com/pop/2454934/how-jenna-dewan-is-feeling-about-her-split-from-channing-tatum", "text": "Jenna Dewan revealed herself in more ways than one this past week. Appearing completely in the buff on the cover of the newest edition of Women's Health, which will be on magazine racks everywhere in the next week, Dewan also opened up emotionally about her recent break-up with her husband, Channing Tatum. As the actress/dancer admits in the conversation, it has been a \"journey,\" but she is learning to heal. She believes it's an important time for her to reconnect with her needs as a woman, and she hopes this time will provide a fruitful transformation. Here's what she said.\n\nIt's been a journey, and it's been a transformation of myself -- my needs and wants as a woman. I think everyone wants to hold on to what's in front of them, but when you open your mind saying, 'I want what's best for myself and my daughter,' you have to be OK with however that looks. I feel like I've been on a wave of growth. It does look different; it's a new normal, and I really think we'll get used to that.\n\nAs Jenna Dewan admits in this interview, it's never easy to get a divorce, especially when your relationship was among the most famous in the world. The couple still holds fond affections for one another, according to Dewan, but they're still adjusting to their new lives together away from one another. They were married back in 2009, and they first met when they made the first Step Up movie in 2006. Having been married for nearly a whole decade, it's going to be a little hard to readjust to the single life again. But Jenna Dewan is currently taking things one step at a time.\n\nIt's always challenging to go through a big change and have the whole world have an opinion about it. It's OK for a relationship to change into a new form that is actually better for both people involved, and I think maybe that's what shocked everyone so much -- that it can be a positive thing. That was ultimately what happened with us. I did a lot of work healing from the inside out, becoming more in touch with my womanly power. It was always, 'I'm a dancer,' or 'I'm married,' or 'I'm an actress.' Over the last couple of years, it became about learning about myself.\n\nChanning Tatum and Jenna Dewan announced their break-up earlier this year by releasing a statement to their fans, assuring them that \"absolutely nothing has changed\" about how much they love each other, but they were simply planning to travel down separate paths on this journey we know as life. They admit that, above all else, they're concentrating their attention on their 5-year-old daughter, Everly, who is their primary concern. They want this difficult transition is as smooth as possible for the young child. It can be difficult for any child to process their parents' separation, particularly when their parents are as famous as Channing Tatum and Jenna Dewan. Thankfully, it seems that they've been able to adjust to their separation pretty well.\n\nAway from soul-searching, Jenna Dewan appears on the dance competition series, World of Dance. The NBC series recently aired its second season, and it was recently renewed for another season.", "images": ["https://www.cinemablend.com/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/EUfXUJkaNnGU4iSo5foFf3-320-80.jpg", "https://cdn.mos.cms.futurecdn.net/EUfXUJkaNnGU4iSo5foFf3-1200-80.jpg"], "top_img": "https://cdn.mos.cms.futurecdn.net/EUfXUJkaNnGU4iSo5foFf3-1200-80.jpg", "keywords": [], "authors": ["Will Ashton", "Window.Slicecomponents", "Window.Reliabledomcontentloaded.Then", "Var Componentcontainer", "Document.Queryselector", "Slice-Container-Authorbio", "If Componentcontainer", "Var Data", "Layout", "Default"], "canonical_link": "https://www.cinemablend.com/pop/2454934/how-jenna-dewan-is-feeling-about-her-split-from-channing-tatum", "title": "How Jenna Dewan Is Feeling About Her Split From Channing Tatum", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2018-08-01T19:20:50+00:00", "description": "Jenna Dewan opens up about her break-up with Channing Tatum and how she is moving forward.", "robots": "max-image-preview:large", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://cdn.mos.cms.futurecdn.net/flexiimages/tbhqzd9bso1619422461.png", "og": {"site_name": "CINEMABLEND", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/EUfXUJkaNnGU4iSo5foFf3-1200-80.jpg", "width": 1200}, "type": "article", "title": "How Jenna Dewan Is Feeling About Her Split From Channing Tatum", "url": "https://www.cinemablend.com/pop/2454934/how-jenna-dewan-is-feeling-about-her-split-from-channing-tatum"}, "article": {"publisher": "https://www.facebook.com/cinemablendnews/", "published_time": "2018-08-01T19:20:50Z", "modified_time": "2018-08-01T19:20:50Z"}, "parsely-type": "post", "parsely-post-id": "6weV25AnyidvxvGcrUrshh", "parsely-pub-date": "2018-08-01T19:20:50Z", "parsely-title": "How Jenna Dewan Is Feeling About Her Split From Channing Tatum", "parsely-link": "https://www.cinemablend.com/pop/2454934/how-jenna-dewan-is-feeling-about-her-split-from-channing-tatum", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/EUfXUJkaNnGU4iSo5foFf3.jpg", "parsely-section": "Pop", "parsely-tags": "Category: Pop,Category: News,channing tatum,jenna dewan,Celebrity Couples,Celebrity Breakups,serversidehawk", "parsely-author": "Will Ashton", "twitter": {"card": "summary_large_image", "site": "@cinemablend", "title": "How Jenna Dewan Is Feeling About Her Split From Channing Tatum", "creator": "@cinemablend", "image": "https://cdn.mos.cms.futurecdn.net/EUfXUJkaNnGU4iSo5foFf3-1200-80.jpg", "account_id": 9696142}, "google-site-verification": "Oo3uNFWgI6psN58Pjx7Zjo3yYih1rOwQViWbItBCpyo", "taboola": {"url": "https://www.cinemablend.com/pop/2454934/how-jenna-dewan-is-feeling-about-her-split-from-channing-tatum"}, "botify-site-verification": "2pzcQZFibLjk9GJgSZgweA8MU9al6utA", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E"}, "movies": [], "publish_date": 1533151250.0, "source": "https://www.cinemablend.com", "summary": ""}