{"url": "https://www.celebritynetworth.com/richest-businessmen/ceos/tommy-mottola-net-worth/", "text": "What is Tommy Mottola's net worth and salary?\n\nTommy Mottola is an American music executive who has a net worth of $540 million. He is currently the Chairman of Mottola Media Group. He was previously the co-owner of Casablanca Records, a joint division of the Universal Music Group.\n\nEarly Life\n\nTommy Mottola was born in the Bronx, New York on July 14, 1949. He graduated from Iona Grammar School in 1962 and Iona Prep in 1966. Afterwards, he went to military school and then graduated from high school. Mottola dropped out of Hofstra University on Long Island to pursue a music career as a guitarist and singer for an R&B cover band called The Exotics. (Mottola is the cousin of famed jazz guitarist Tony Mottola.)\n\nEarly Career\n\nMottola began his career in the music industry in the mid-60s as a recording artist under the name of T.D. Valentine at CBS. After his attempt to become a recording star himself failed, he began working for publishing powerhouse Chappell Publishing and began his own management company called Champion Entertainment Organization. His role at Chappell put him in touch with many artists and soon he signed his first successful clients, Daryl Hall and John Oates. Mottola helped Hall & Oates land a record deal along with many high-profile endorsements. Around this time, he was recognized for managing the rock group Xavion successfully use media for promotion, specifically through the use of music videos and corporate sponsorship for music tours.\n\nSony\n\nAt the age of 37 Mottola was running CBS when he struck a deal for the company to be purchased by the Sony Corporation. In 1988 Mottola was then named the Chairman and CEO of Sony Music Entertainment, replacing Walter Yetnikoff who had been at the company from 1975-1990.\n\nDuring his 15-year tenure at Sony, Mottola transformed the reputation of Sony Music, expanding the business into 60 countries and signing and developing the careers of some of the biggest artists in the world. He turned Sony into one of the most successful global music companies and created one of the strongest management teams in the industry He helped to revitalize Sony's publishing division by acquiring rights to the Beatles' catalog and enabled sony to become the first major music company to make commercial digital downloads available.\n\nJust a few of the mega stars Mottola has launched include Mariah Carey, Celine Dion, Destiny's Child/Beyonce, Jennifer Lopez, Shakira, Gloria Estefan, the Dixie Chicks, Marc Anthony, Barbra Streisand, Bruce Springsteen, Jessica Simpson, Ricky Martin, and Billy Joel. Mottola also worked with Michael Jackson on his albums \"Dangerous\" and \"Invincible.\" After 15 years at the helm of Sony, Mottola had increased the company's annual revenue from $800 million per year to over $6 billion in 2000.\n\nAfter Sony\n\nMottola left Sony Music Entertainment in 2003 to build a new entertainment company, Mottola Media Group, which included recorded music, television production, theater, and fashion. He would go on to helped re-launch the career of Usher with his album \"Confessions\" that sold over 20 million copies worldwide. He also revamped the careers of March Anthony and Lindsay Lohan. Mottola then bought the rights to Casablanca Records and resurrected it with singer/actress Lohan. He later signed Cassie Ventura in 2006, and Mika in 2007, who had a successful No. 1 single in the UK.\n\nIn January 2013, Mottola published a book titled \"Hitmaker,\" co-written with Cal Fussman. The book detailed his success and the drive behind it that helped to propel him to the top of the business, but it also discusses at length the downtimes in his recording industry days. In early 2016, Mottola produced the musical adaptation of Chazz Palminteri's \"A Bronx Tale.\" The show opened on February 14, 2016 and closed on March 6, 2016. The show officially opened on Broadway in December 2016. After 700 performances, the show closed on August 5, 2018. A national tour began in October, beginning with Los Angeles at the Pantages Theatre. Mottola has served as the executive producer for many shows for cable and network television including \"The Latin Explosion: A New America,\" \"A Model Life,\" \"Born to Diva,\" and plenty of others. In 2018, Mottola Media signed a multi-year deal with eOne to develop scripted and unscripted television.\n\nPersonal Life\n\nTommy Mottola converted to Judaism to marry his first wife, Lisa Clark, in 1971. She was the daughter of ABC Records head Sam Clark. They divorced in 1990, after having two children, Michael and Sarah.\n\nIn June of 1993, Tommy Mottola married Mariah Carey in a lavish multi-million dollar ceremony. The marriage was short-lived, with the couple divorcing in early 1998. In 2000, Carey left Columbia and signed an $80 million contract with rival Virgin Records. That same year, Tommy Mottola began dating Latin singer Thalia, whom he married that December at New York City's St. Patrick's Cathedral. The two have two children: Sabrina Sakae, born in October 2007, and Matthew Alejandro Mottola, born in June 2011.\n\nReal Estate\n\nIn 2010, Tommy Mottola and his wife Thalia spent $2.85 million to buy an undeveloped 6-acre parcel of land in Greenwich, Connecticut. They spent three years designing and building their 9-bedroom, 12,300 square foot dream home which features a footbridge to a small private island on the property's lake. They listed the property for sale in April 2017 and finally found a buyer in April 2019 for $14.875 million.", "images": ["https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2020/01/Tommy-Mottola.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/wp-content/uploads/2009/11/tommy-mottola-1.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/wp-content/uploads/2020/01/tommy-mottola-1.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2020/01/tommy-mottola-1.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-businessmen/ceos/tommy-mottola-net-worth/", "title": "Tommy Mottola Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Tommy Mottola net worth and salary: Tommy Mottola is a powerful American music executive who has a net worth of $540 million. Tommy Mottola", "cnw_share_fb_count": 41, "cnw_share_tw_count": 49, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Tommy Mottola Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-businessmen/ceos/tommy-mottola-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/01/tommy-mottola-1.jpg", "site_name": "Celebrity Net Worth", "description": "Tommy Mottola net worth and salary: Tommy Mottola is a powerful American music executive who has a net worth of $540 million. Tommy Mottola"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-05-18T20:37:42+00:00", "published_time": "2020-01-02T19:27:44+00:00", "section": "CEOs", "tag": "tommy mottola sony net worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/01/tommy-mottola-1.jpg", "title": "Tommy Mottola Net Worth", "description": "Tommy Mottola net worth and salary: Tommy Mottola is a powerful American music executive who has a net worth of $540 million. Tommy Mottola"}}, "movies": [], "publish_date": 1577993264.0, "source": "https://www.celebritynetworth.com", "summary": ""}