{"url": "https://en.wikipedia.org/wiki/Estelle_Parsons", "text": "American actress\n\nEstelle Margaret Parsons (born November 20, 1927) is an American actress, singer and stage director.[1]\n\nAfter studying law, Parsons became a singer before deciding to pursue a career in acting. She worked for the television program Today and made her stage debut in 1961. During the 1960s, Parsons established her career on Broadway before progressing to film. She won the Academy Award for Best Supporting Actress for her role as Blanche Barrow in Bonnie and Clyde (1967), and was also nominated for her work in Rachel, Rachel (1968).\n\nShe worked extensively in film and theatre during the 1970s and later directed several Broadway productions. Later work included perhaps her best known role, as Beverly Harris, mother of the title character, on the sitcom Roseanne, and, later, on its spinoff The Conners. She has been nominated five times for the Tony Award (four times for Lead Actress of a Play and once for Featured Actress). In 2004, Parsons was inducted into the American Theatre Hall of Fame.\n\nEarly life [ edit ]\n\nParsons was born in Lynn Hospital, Lynn, Massachusetts. Her mother, Elinor Ingeborg (née Mattsson), was a native of Sweden, and her father, Eben Parsons, was of English descent.[2][3][4]\n\nShe attended Oak Grove School for Girls in Maine. After graduating from Connecticut College in 1949, Parsons initially studied law at Boston University, and then worked as a singer with a band before settling on an acting career in the early 1950s.[5] In 1983, when co-starring with fellow Academy Award-winning actor Jack Lemmon in a new Ernest Thompson stage play in Los Angeles, Parsons appeared on the November 1 episode of The Tonight Show, telling Johnny Carson that Lemmon had been her first boyfriend, when they were both teenagers in the 1940s.[6]\n\nCareer [ edit ]\n\nParsons moved to New York City, and worked as a writer, producer and commentator for The Today Show. She made her Broadway debut in 1956 in the ensemble of the Ethel Merman musical Happy Hunting. Her Off-Broadway debut was in 1961, and she received a Theatre World Award in 1963 for her performance in Whisper into My Good Ear/Mrs. Dally Has a Lover (1962).\n\nIn 1964, Parsons won an Obie Award for Best Actress for her performance in two Off-Broadway plays, Next Time I'll Sing to You and In the Summer House. In 1967, she starred with Stacy Keach in the premiere of Joseph Heller's play We Bombed in New Haven at the Yale Repertory Theater.[7]\n\nParsons has received Tony Award nominations for her work in The Seven Descents of Myrtle (1968), And Miss Reardon Drinks a Little (1971), Miss Margarida's Way (1978), Morning's at Seven (2002), and The Velocity of Autumn (2014). She played Leokadia Begbick in the American premiere of the Weill–Brecht opera, Rise and Fall of the City of Mahagonny (1970), and performed as Mrs. Peachum to Lotte Lenya's Jenny in Threepenny Opera on tour and in New York City. In 1978 she played Lady Macbeth in the Kauai Community Players production. She also played Ruth in Gilbert & Sullivan's The Pirates of Penzance on Broadway in 1981. From June 17, 2008, through May 17, 2009, she played the role of Violet Weston in August: Osage County. She continued playing the role during the show's national tour beginning July 24, 2009, in Denver.[citation needed]\n\nAs a director, Parsons has a number of Broadway credits, including a production of Romeo and Juliet, Macbeth and As You Like It in 1986. Off-Broadway, she directed Dario Fo's Orgasmo Adulto Escapes from the Zoo (1983). She served as the Artistic Director of the Actors Studio for five years, ending in 2003.[citation needed]\n\nIn 2016, she starred in Israel Horovitz's new play Out Of The Mouths Of Babes along with Judith Ivey directed by Barnet Kellman at The Cherry Lane Theater in New York City.[8]\n\nIn 2004, Parsons was inducted into the American Theatre Hall of Fame.[9]\n\nHer film career includes an Oscar for Best Supporting Actress for her portrayal of Blanche Barrow in Bonnie and Clyde (1967), and a nomination for Rachel, Rachel (1968). She received a BAFTA Award nomination for her role in Watermelon Man (1970), and appeared in I Never Sang for My Father (1970), Two People (1973), A Memory of Two Mondays (1974), For Pete's Sake (1974), Dick Tracy (1990) and Boys on the Side (1995).\n\nOn television, Parsons played the recurring role of Beverly Harris, the mother of the title character on Roseanne; her Beverly character is the daughter of character Nana Mary, played by fellow Academy Award winner Shelley Winters. Other television credits include appearances in The Patty Duke Show, Love, American Style, All In The Family, Archie Bunker's Place, Open Admissions, Frasier, Law & Order: Special Victims Unit, and The Good Wife, as well as The UFO Incident: The Story of Betty and Barney Hill and the PBS production of June Moon. She played the part of Babe in three episodes of the second and fifth seasons of Grace and Frankie.\n\nShe was honored with a Woman of Achievement Award from the Women's Project Theater in 2009.[10] In 2010, she appeared in London, playing psychic Helga ten Dorp in Deathtrap at the Noël Coward Theatre in the West End.[11]\n\nParsons' most recent Broadway appearances include Good People (2011) and Nice Work If You Can Get It (2012).[12]\n\nIn April 2018, Parsons returned to television reprising her role as Beverly Harris, mother of Roseanne Barr's title character, in season 10, episode 5 of Roseanne.[13]\n\nPersonal life [ edit ]\n\nParsons married author Richard Gehman in 1953. They had twin daughters, reporter Abbie and actress Martha Gehman, before divorcing in 1958.[6] Her grandson, Abbie's son, is former Chicago Bears and Jacksonville Jaguars guard/tackle, Eben Britton, named for his great-grandfather, Estelle's father.[14] In January 1983 she married her partner of 10 years, Peter Zimroth, who has served as Assistant U.S. Attorney, Assistant District Attorney and court-appointed monitor of the NYPD's policies and practices regarding stop-and-frisk.[15] They adopted a son, Abraham, born in February 1983.[6] Zimroth died on November 8, 2021.\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Estelle_Parsons_Love_American_Style_1973.JPG/200px-Estelle_Parsons_Love_American_Style_1973.JPG", "https://upload.wikimedia.org/wikipedia/commons/5/57/Estelle_Parsons_Love_American_Style_1973.JPG", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/5/57/Estelle_Parsons_Love_American_Style_1973.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Estelle_Parsons", "title": "Estelle Parsons", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Estelle_Parsons_Love_American_Style_1973.JPG/640px-Estelle_Parsons_Love_American_Style_1973.JPG", "width": 640, "height": 909}, "title": "Estelle Parsons - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}