{"url": "http://www.godvine.com/read/fixer-upper-star-joanna-gaines-warned-fans-1636.html", "text": "\n\n\n\nIn a recent blog post, Fixer Upper star Joanna Gaines warned fans not to believe everything they read online. . . and not to buy the product scammers are selling in her name.\n\nThat’s because the rumor mill has been a-churning with all kinds of hearsay about everyone’s favorite home improvement duo. But JoJo reminds everyone to just keep calm and check the facts!\n\nFalse Reports Of Skipping Town\n\nAs one of America’s beloved celebrity sweethearts, any news about Chip and Joanna Gaines is big news. Which makes it easy for rumors to spiral out of control.\n\nRELATED: Fixer Upper’s Chip Gaines speaks out about church controversy\n\nThe couple’s show on HGTV — Fixer Upper — has been a huge success. So, it’s hard to imagine the network wouldn’t renew the home improvement hit for its fifth season. However, because there’s been no official announcement yet, rumors have begun circulating about the couple’s future plans.\n\n“At this point in our career we can honestly say, we've heard it all-from reports of us moving our family to Vegas to us having more or less children than we actually have,” Joanna writes on her blog.\n\nThese claims Joanna mentions likely stem from a press conference where she and Chip discussed where they’d go if they were ever to leave Waco, Texas. Chip joked that he’d like to move to Las Vegas. Joanna said she thought New York City would be fun, but joked that with so many kids, they’d probably lose at least one each time they walked to the store and back.\n\nTaken Out Of Context\n\nThough the couple’s actual words are clearly hypothetical, it didn’t take long before they got twisted to suggest the family was leaving Waco and Fixer Upper behind.\n\n“So remember, you can't believe everything you read,” Fixer Upper star Joanna Gaines warned.\n\nJoanna said in her blog that she and Chip try their best to keep fans updated with any new developments related to their show, their business and their family. They do so through their official social media accounts. But as celebrities, there will always be those out there trying to exploit the couple’s name.\n\n“At the end of the day, we've learned it's impossible to control all the information that's out there.” Joanna writes.\n\nRELATED: Joanna Gaines explains why she refused to upgrade her engagement ring\n\nSometimes it’s in the form of relatively harmless chatter — such as the speculation over whether the couple is planning to move. But other times it can take shape in the dangerous form of a scam.\n\nFacial Cream Scam\n\nAmong the rumors that Chip and Joanna will be leaving Fixer Upper, one source suggests it’s so that Joanna can pursue a career selling cosmetics.\n\nThe “article”, designed to look as though it comes from Cosmopolitan magazine, is really just a facial cream scam. The phony article tries to dupe the reader into believing Fixer Upper star Joanna Gaines is selling a skincare line called Derma Folia Renewal. Supposedly the product has been so successful she is leaving HGTV. Joanna confirms on her blog this is completely false.\n\n“In summary, don't buy the facial cream, friends,” she writes.\n\nBut WCPO News in Cincinnati has seen this same scam before. They interviewed a woman named Lisa Zillich who’d seen a similar ad online. Only this ad was for an anti-wrinkle skin cream called Satin Youth, supposedly marketed by Ivanka Trump.\n\nRELATED: Fake church scams people with a dangerous ‘miracle cure’\n\nLisa payed $3.95 in shipping for a “free trial” of the product, which arrived a few days later. However, after a few weeks, Lisa noticed an additional $99.95 charge to her credit card from the company. When she called to dispute the charge, she was informed that the fine print included in the “free trial” offer stipulated that customers have just 14 days from their order to request a refund. So for Lisa, it was too late.\n\nThe representative insisted Ivanka Trump owned the company. However, a Google search done by WCPO News uncovered online ads for various products boasting Ivanka’s name, just like the newest one featuring Joanna Gaines. Each ad was made to look like an article written by a popular magazine, and all linked to the same $4 trial offer.\n\nSetting The Record Straight\n\nSo, with the scam circulating and so many rumors swirling around, Fixer Upper star Joanna Gaines warned her fans not to be duped. She urged folks to rely on her official social media outlets for any news related to her and her family. Then, she set the record straight once and for all:\n\n“And just in case you were wondering, YES! We are currently filming season 5 of the show. No! I am not getting into the business of facial creams. And No! We are not expecting baby #5. And no worries, believing some of these stories happens to the best of us.”\n\nBe sure to read Joanna’s full post on the Magnolia Market Blog HERE.\n\nAnd always consider the source before accepting “news” as fact!\n\nh/t: Magnolia Market\n\nFeatured Image Credit: Facebook/Joanna Gaines\n\nYOU MAY LIKE: 4 things we can learn from Chip and Joanna Gaines about marriage", "images": ["https://www.godupdates.com/wp-content/uploads/2020/09/GT-little-boy-cooking-with-nana-cade-600x315.jpg", "https://www.godupdates.com/wp-content/uploads/2022/09/GT-82-Year-Old-Goes-Viral-With-Epic-Wedding-Dance-Moves-600x315.jpg", "https://www.godupdates.com/wp-content/uploads/2017/04/godupdates-fixer-upper-star-joanna-gaines-warned-fans-fbrev.jpg", "https://www.godupdates.com/wp-content/uploads/2022/10/GT-Starved-Dog-Makes-Miraculous-Transformation-After-Rescue-600x315.jpg", "https://www.godupdates.com/wp-content/uploads/2020/09/GT-The-Heartbreaking-Story-Behind-Tears-In-Heaven-By-Eric-Clapton-600x315.jpg", "https://www.godupdates.com/wp-content/uploads/2022/10/GT-Chick-Fil-A-Employee-Tackles-Attempted-Carjacker-600x315.jpg", "https://secure.gravatar.com/avatar/95f5f76b7f6b360f21e4ef703afd771f?s=38&d=mm&r=g", "https://ci4.googleusercontent.com/proxy/D9-IadtNvXfc0nVRNV9JcPdr7Ms_hXioisvpe1nWpa68ZduZZMPHAg6LimG1AiccE60dINjGTj5TrUMZQoYhN6L8r96ldUDAHNHCdcIAtk2NK5dehVkPzelW5PkSWi_WVV5XV_2lIl653HNbzVB-sCoZhUJ9uDccWMhFDMOsrloPjvQt9iNRyCfzlGXVxMU=s0-d-e1-ft#https://d2h2b7qc7sti9e.cloudfront.net/cms/images/default-source/devotions/embeddedimages/matthew_2022.jpeg?sfvrsn=a6c73501_2", "https://www.godupdates.com/wp-content/uploads/2022/10/elvis-stepbrother-600x315.jpg", "https://www.godupdates.com/wp-content/uploads/2022/10/godupdates-mom-without-arms-Sarah-Talbi-fb-600x315.jpg", "https://www.godupdates.com/wp-content/uploads/2017/04/godupdates-parents-of-9-year-old-with-fatal-brain-tumor-make-most-little-girls-final-days-fb.jpg"], "top_img": "https://www.godupdates.com/wp-content/uploads/2017/04/godupdates-fixer-upper-star-joanna-gaines-warned-fans-fbrev.jpg", "keywords": [], "authors": ["Mel Johnson"], "canonical_link": "https://www.godupdates.com/fixer-upper-star-joanna-gaines-warned-fans/", "title": "Fixer Upper Star Joanna Gaines Sets The Record Straight About Rumors", "meta_data": {"viewport": "width=device-width", "msapplication-TileColor": "#00b3cc", "theme-color": "#ffffff", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "In a recent blog post, Fixer Upper star Joanna Gaines warned fans not to believe everything they hear, after rumors and scams swirl out of control.", "og": {"locale": "en_US", "type": "article", "title": "Fixer Upper Star Joanna Gaines Sets The Record Straight About Rumors", "description": "In a recent blog post, Fixer Upper star Joanna Gaines warned fans not to believe everything they hear, after rumors and scams swirl out of control.", "url": "https://www.godupdates.com/fixer-upper-star-joanna-gaines-warned-fans/", "site_name": "GodUpdates", "image": {"identifier": "https://www.godupdates.com/wp-content/uploads/2017/04/godupdates-fixer-upper-star-joanna-gaines-warned-fans-fbrev.jpg", "width": 1200, "height": 630, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/GodOfficialPage", "published_time": "2017-04-25T16:58:21+00:00", "modified_time": "2018-08-24T14:29:30+00:00"}, "author": "Mel Johnson", "twitter": {"label1": "Written by", "data1": "Mel Johnson", "label2": "Est. reading time", "data2": "4 minutes"}, "generator": "WordPress 6.0.2", "fb": {"pages": 337567659670741, "app_id": 1437688803163475, "admins": 716881713}, "ia": {"markup_url": "https://www.godupdates.com/fixer-upper-star-joanna-gaines-warned-fans/?ia_markup=1"}}, "movies": [], "publish_date": 1493139501.0, "source": "http://www.godvine.com", "summary": ""}