{"url": "https://www.theatlantic.com/entertainment/archive/2017/12/the-50-best-podcasts-of-2017/548165/", "text": "This year, podcasts got funnier, sharper, and even more niche. Our recommendations here pass a vigorous audio smell test. First, the arrival of a new podcast episode must send you into an ethical quandary: How do I get out of at least some of my obligations today to listen to this? Second, you must be able to recommend this to a colleague with the knowledge that your reputation is at stake. A podcast that teaches you how to prepare your taxes by hand might blow your hair back, but it’s doubtful you’ll recommend it to anyone aside from your accountant. Third, we recused ourselves from ranking any podcasts produced by The Atlantic, including Radio Atlantic and The Atlantic Interview. Finally, the podcast world, like any other sphere, is about what have you done for me lately. The best shows don’t paint themselves into a corner. They evolve and progress or risk their listeners hitting “unsubscribe.” Podcasts, like cowboys, shouldn’t get fenced in. These shows generated maximum buzz, kept us refreshing our apps, broke boundaries, and made our future selves romanticize the golden years of podcasting.\n\nWith decades of producing under her belt, the Alone host Michelle Parise knows how to shape and deliver a story that will keep you coming back for more—all with the indulgent, delightful tone of a Lifetime movie. In 10 chapters, she takes listeners through the rise and fall of her marriage, and the bizarro choices she and her ex-husband made in its aftermath—like intentionally buying houses across the street from each other—will have you double-checking whether or not this actually is a memoir. (It is.) Her decision-making leads her to the edge of cliché but is also immensely relatable. You won’t leave Alone with new insights on what it means to be reentering the dating pool at almost 40 or having witnessed a brilliant epiphany, but you will feel like someone delivered you chicken soup on a cold day—and if you’re single, that can go a long way.\n\nGateway Episode: “Chapter 1: Not If, How”\n\nMore than a decade ago, Bill Simmons cross-pollinated sports and pop culture and launched The B.S. Report at ESPN, the predecessor of The Bill Simmons Podcast. Early on—The B.S. Report predates Marc Maron’s WTF by two years—Simmons grasped that an uninterrupted, long-form interview scarcely existed in the media wasteland. He took note of the diminishing returns of what celebrities and athletes were willing to say and the disgust fans had for sound bites and puff pieces. Now, he routinely books guests who won’t, or don’t always, open up elsewhere: Kevin Durant, an NBA champion and typically a man of few words, for instance, showed up this year for a series of fascinating, raw interviews. Simmons’s talk with The Atlantic’s Ta-Nehisi Coates is also a must-listen. The host steers the conversation toward sports to get them chatting, and then everything you want to hear from America’s writer-in-residence comes out in unexpected, new ways.\n\nGateway Episode: “Ta-Nehisi Coates on Storytelling, Challenging Obama, and the Kaepernick Situation”\n\nThe Every Little Thing host Flora Lichtman will make her obsessions your obsessions. The show follows her train of thought, taking listeners through unexpected twists and turns where they find out flamingos can drink boiling-hot water, robust mite communities live on our faces, and why no one ever sees a living armadillo (it has to do with a phenomenon known as eye shine). Lichtman has a fantastic sense of humor and a charming curiosity that seduces listeners into the topic du jour. The show is perfect politically neutral entertainment for conversations with the in-laws or for work parties. While no one—maybe not even Lichtman—can predict what the next subject will be, after a few episodes, listeners get a sense for the quirky world she’s created and how she moves through it. Every Little Thing embodies the old maxim that the best ideas are the ones we can’t forget.\n\nGateway Episode: “Rapture Chasers”\n\nThe experience of This Is Actually Happening is different from most of what you’ll hear elsewhere. Every other week, people who have experienced a massive disturbance in their life tell their stories uninterrupted, no questions, no music. A male model becomes the target of the Japanese mafia in one show, and in the next, a victim of incest talks about how advocacy changed her life. They are all of the most articulate ilk, people who have done the hard work of thoughtful introspection and, without asking anything of the listener, they share themselves and what they’ve learned. This creates an intimate connection with the speaker, perhaps the closest thing listeners have to trying on another person’s consciousness. Each show title starts with “What if … ” (with titles like “What if you were a white supremacist?”) to tell the listener exactly what to expect, but others are more rhetorical (“What if you went to the dark side?”). Others still are so specific (like “What if you spent 15 hours on the edge of sanity?”) that you’ll want to know how exactly that question was posed in the first place.\n\nGateway Episode: “What If You Spent 15 Hours on the Edge of Sanity”\n\nIVFML features a couple enduring the in vitro fertilization process with shameless humor and a lot of compassion in five serialized episodes. Each installment takes listeners through personal failures and emotional responses to the total dedication it takes to attempt IVF and the isolation it often creates—the doctor’s appointments and hyperfocus on one’s body, the thoughtless things loved ones say without knowing better, and all the secrets you keep. There’s an awkwardness to the show, especially when the couple rehashes their arguments in chipper voices; we’re not sure if they’re the most in sync couple in America or the most passive aggressive. But it works. IVFML is one of only a few shows telling the story of people going through IVF; to its credit, it also gracefully manages to engage those who aren’t.\n\nGateway Episode: “Episode 1: We’re Trying”\n\nThis sponsored-by-Tinder podcast made by Gimlet Creative puts the show host in the driver seat to swipe on behalf of random DTR listeners. The concept is simple: Tinder users are introduced, we hear a bit about their situation and interests, and then we listen to the host Jane Marie scroll through with guest comedians like Jason Mantzoukas or Aparna Nancherla. People who’ve been out of the game for awhile might be shocked by the way Tinder users present themselves and by the sheer range of choices these apps supply (trans, cis, ethical nonmonogamy, open relationships, unicorns, Spotify and Instagram link-outs, location services). Sometimes the process is a disaster. Sometimes it’s uncomfortable. But on the rare occasion that it sounds like love’s beginnings, DTR listeners may be encouraged to head back to the daily swipe in hopes of finding a connection of their own.\n\nGateway Episode: “Right Swipes, Big City (Part 1)”\n\nDirty John most certainly had a moment this year. It’s a six-part true-crime story guided by the expert skill of the Pulitzer-nominated investigative journalist Christopher Goffard of the Los Angeles Times. It centers around a well-off family’s relationship to the show’s namesake, a narcissist named John, who bounces from wealthy wife to wealthy wife, with a woman named Debra Newell as his latest target. A fair amount of dramatic irony underlines the plot, especially the rapid-fire romance that started on a dating website and raised clearcut red flags that Newell ignored or missed somehow. She married John on a whim without a prenup and in secret because of the expressed objection of her daughters. The series gets darker with each episode: There are lies, threats, restraining orders. Dirty John is an object in a curio cabinet that you take out, examine, and put back. It’s not an allegory, and it won’t teach you a lesson. It has no higher purpose. But as the audio equivalent of a page turner, it will keep you engaged, if a bit perplexed, from beginning to end.\n\nGateway Episode: “Part 1: The Real Thing”\n\nStartUp launched as a meta-narrative about the creation of its parent company, the podcast network Gimlet. Many a listener fell in love with the producer-turned-entrepreneur Alex Blumberg, riding the roller coaster with him while he found a partner to launch his venture. StartUp was a wonderful idea that threatened to become obsolete the moment Gimlet found its footing. Since entrepreneurs evolve or perish, so did the show, and under its new host, Lisa Chow, it roared back to life with a fresh voice. In Seasons 5 and 6, which aired this year, StartUp turned out self-contained episodes around distinct inventors and product ideas. One two-parter tracks the rise and fall of the now lost-to-time Friendster, a website once perfectly positioned to be what Facebook became. Another episode explores why Stuart Anders, the inventor of the slap bracelet, was doomed before he ever went to market, even though his idea sold millions of units. It’s easy to see why Gimlet never scrapped StartUp. The behind-the-scenes pressure and rise-to-stardom drama of bootstrapping a company are too hard to put down.\n\nGateway Episode: “You Have to Invent Something”\n\nIn rebranding Keepin’ It 1600 as Pod Save America, the Obama loyalists Jon Favreau, Dan Pfeiffer, Jon Lovett, and Tommy Vietor seemed to be changing into fresh clothes after the 2016 election. Their brand of discourse was such a massive hit in its debut last year that it begat a new kind of political watercooler talk. While many of the changes this year are cosmetic, such as a new logo and an obsession with finding spectacular episode titles, the show did lean more heavily toward the topic of activism. It replaced some punditry with guidance on how to protect legislation, such as the Deferred Action for Childhood Arrivals (DACA), contact congresspeople, vote, and donate to causes. The hosts’ overnight ascension to podcast darlings may have led to full-time gigs behind the mic and a steady touring schedule. But, at its core, Pod Save America is still a conversation among talented friends, a highbrow-lowbrow, inside-and-outside-the-Beltway essential political companion.\n\nGateway Episode: “Indictments!”\n\nMissing Richard Simmons crosses an ethical boundary in a way unheard of in chart-topping podcasts (it was number one on iTunes for weeks after its debut). It lives on this list because of the series’s preeminent entertainment value and its touching biography of the fitness icon Richard Simmons. The filmmaker-turned-podcast-host Dan Taberski, who is wonderfully at home in audio, seeks out his former weight-loss mentor, Simmons, who disappeared from the public eye years ago for reasons unknown (listeners do know he is safe and alive even as the series launches). Here’s where the trouble starts—Taberski calls up everyone in Simmons’s inner circle looking for answers that are never forthcoming. But nothing stops the host from positing theories that risk outing Simmons: his possible declining health, his potential transition, his maybe falling under the spell of his housekeeper, and his likely—but unproven—decision to stop talking to the public. Yet for listeners nonetheless intrigued by the mystery, the host is an apt guide to chronicle Simmon’s rise to fitness superstardom and plunge into reclusion.\n\nGateway Episode: “Where’s Richard?”\n\nScience Vs almost always frames its episodes around topics that have failed to reach a cultural consensus: the existence of ghosts, the dangers of nuclear power, the usefulness of chiropractic care. This show is brilliant and dead serious about getting to the bottom of its hypotheses. You might call it the progeny of MythBusters: It grapples with the scientific method while not being afraid to get its hands dirty. And while the show’s host Wendy Zukerman loves some hardcore fact-finding, she’s also funny as hell: In an episode about birth control, she’s not afraid to give a shout-out to the scientific efficacy of the pull-out method. It’s an irreverent streak that’ll have you laughing while learning.\n\nGateway Episode: “True Love”\n\nIn the opening monologue before one of his shows, the host Michael Ian Black describes the quality he looks for in How to Be Amazing guests: “people who have somehow figured out a way to turn their essential selves into a career.” His guests skew older—Black is a bookish soul and it does, after all, take some time to grow into yourself—but they’ve aged without losing any of their enthusiasm for their work: the poker player Annie Duke, the talk-show host and pop-culture guru Andy Cohen, the astrophysicist Neil deGrasse Tyson. There are younger passionate voices too, including the civil-rights activist DeRay Mckesson and the singer Katy Perry. An uncommonly high number of first-rate interview-style podcasts exist; How to Be Amazing stands out for how Black works alongside the guests—it’s almost as if he’s taking up their cause with them. Many talk-show hosts talk too much, say too little when they should be challenging a point, or don’t know how to speak the language of their guests. None of this is a problem for Black. He’s a critic, a fan, an artist, a comedian, and a neurotic Renaissance man.\n\nGateway Episode: “Judd Apatow”\n\nPodcasts, to their detriment, have largely ignored long-form sports narratives in favor of talking heads. The captivating, what’s-happening-off-the-field series 30 for 30 breaks the cold streak, and finally, listeners have a series devoted to documentary. The ESPN property, the brainchild of Bill Simmons and Connor Schell, launched less than 10 years ago as a TV series. The port to audio with the host Jody Avirgan makes only too much sense when you mull what’s missing from your podcast diet. Some of the episodes support what ESPN airs on cable—and are definitely worth your time—but the best ones stand alone: stories about John Madden Football, the bloody origins of the UFC, and the touching relationship between two decathletes from the 1992 Olympics. In a year where NFL players’ refusal to stand for the national anthem to protest police brutality provoked a Twitter tantrum from the president of the United States, the argument that sports narratives live inside a vacuum can die a happy death.\n\nGateway Episode: “The Trials of Dan & Dave”\n\nThe best stories from Outside magazine—think of Jon Krakauer’s harrowing piece “Into Thin Air,” about an Everest climb turned fatal—find the nexus between the breakdown of the human body and the point at which the mind goes haywire. As it so happens, that physical-meets-mental moment usually occurs on the perch of some remote slab of ice or while plunging to the earth with a parachute strapped to one’s back. So it should come as no surprise that the magazine’s excellent audio component, Outside Podcast, spent this year exploring broken spines, comas, frostbite, dehydration, starvation, and hypothermia. Some of these tales will leave you cowering beneath your headphones, because the things these adventurers do for kicks may seem reckless. Consider the episode featuring Sarah McNair-Landry, the youngest person to reach both North and South poles. These feats, like the others in this podcast, require a comfort with close calls, and they’re brought to you by people who are, in many ways, more superhero than human.\n\nGateway Episode: “After the Crash, Part 1” and “After the Crash, Part 2”\n\nThe host Malcolm Gladwell hyper-focuses on ideas that have been left in a time capsule no one bothered to crack open. Take the iconic 1963 photograph of a young man being attacked by police dogs in Birmingham—civil rights is a recurring theme in Season 2—and now imagine the victim sees it much differently than you do. Revisionist History comes at its subjects from multiple angles, circling them until it has trumped yesterday’s objective truth. For Gladwell, some of the material is personal. In two inspired episodes, he unleashes his wrath on McDonald’s for changing the way it makes its fries, and on the country-club set who turned his jogging trails into golf courses.\n\nGateway Episode: “The Foot Soldier of Birmingham”\n\nConsidering the age of the medium, the true-crime series Criminal is old guard. It broke out nearly four years ago, with gold-standard production and tight, well-written scripts. The creators Phoebe Judge and Lauren Spohrer don’t want to waste one minute of your time. They blend whodunits, horror, and conspiracy theory as they delve into the harrowing and occasionally spooky drama of wrongful imprisonment, mysterious noises coming from inside your apartment, the alleged assassination of Senator Huey Long, and ancient burial grounds. Judge and Spohrer confront their material fully aware of how gruesome and occasionally titillating it can be. So they stick to facts, remove judgment, mix in whimsy, and occasionally throw in the meta episode—as they do in “The Gatekeeper” when Judge interviews the crime-novel critic Marilyn Stasio about her singular obsession with the crime genre.\n\nGateway Episode: “The Kingfish”\n\nIn Benjamen Walker’s semi-truthful, semi-paranoid, semi-hilarious world, the military-industrial complex blankets our cities, and shadowy agents infest our neighborhoods like government suits from Stranger Things. The podcast isn’t all drones, surveillance, and propaganda, although there is plenty of that. Theory of Everything also celebrates and captures wonderful, creative people coping with the pickle of modern life: how creature comforts are increasingly served with collateral damage, from gentrification and fake news to data collection and Russian infiltration. This podcast isn’t for those uninterested in digging beneath the surface, but Walker’s manic New Journalism was just the satire many listeners needed in 2017.\n\nGateway Episode: “The Twentieth of January”\n\nAccording to The Zoo, you have two choices when you’re looking for love: Head into the wild (IRL) or go to the zoo (online dating). The host Sophie Nikitas starts out this series by reading some of the messages in her dating-app inbox and then walking us through what typically happens when you match with someone you’re really into—the internet stalking, the realization that you’ve got a friend in common on Facebook, the good intentions, the first impressions, the meaningless things you do that your date takes as assurance, and the fallout. The Zoo’s first episode gives listeners a split-screen style breakdown of a few dates Nikitas has with one man, then moves to other people’s problems for the rest of the season. Having a stutter, dating after sexual assault, swiping for the first time at age 70, dating as a person of color, and confronting a ghoster all serve as fodder for this charming, earnest, generous exploration of love in the digital age.\n\nGateway Episode: “Shoot the S**t”\n\nMegan Tan started by recording from her closet in 2015, inviting listeners to join her on her journey from waiting tables after college to getting her first real job. Throughout the seasons, we meet her long-time boyfriend, we follow her as she applies for a competitive fellowship, and we cheer her on when she lands in, you guessed it, radio. Even curmudgeons who can’t be bothered to understand how millennials convert unboxing videos and social influencing into major paydays will care about what Tan gets up to—she is insightful, vulnerable, and present. Radiotopia picked up her show, and after just one season there, Millennial is no more. Fans may want to revisit the four-part series Tan did from Cuba earlier this year, though new listeners should start bingeing Millennial from the very beginning.\n\nGateway Episode: “Welcome to Millennial”\n\nD.S. Moss has been remembering that he has to die (memento mori) since 2015. He investigates the practical concerns surrounding death (what happens to your laptop and digital presence after you’re gone) as well as bigger-picture inquiries (what people are really contemplating when they know they’ve got just a handful of days left). Moss has traditionally kept himself out of the story, but this year, when he came out from behind the mic and played both the subject and the host, the show became extra special. In the two-part finale, Moss travels to Peru to partake in seven ayahuasca ceremonies in hopes of experiencing a psychedelic ego death. On paper, it could all sound a little hollow—the en vogue nature of ayahuasca journeys, that he talks through his intentions with a life coach, that he wants to kill his ego in the first place—but Moss is both curious and a tiny bit skeptical, an appealing mix. The Adventures of Memento Mori provides a venue for end-of-life discussions that don’t require a box of tissues.\n\nGateway Episode: “Episode 13: Psychedelic Ego Death (Part 1)”\n\nThe stories in 99% Invisible sneak up on you. The podcast considers the enormous amount of design and architecture that hides in plain sight, brilliantly deconstructing an object to reveal the intent of the creator, why certain design choices were made, and how they might affect you. Some of what 99% Invisible looks at are everyday things: post offices, shipping containers, and emojis. Others, like Gaudí’s Sagrada Família, the yet-unfinished cathedral in Barcelona that began construction in 1882, are majestic wonders. The host Roman Mars knows that the harmony that connects designers, physical structures, function, and human ambition is as rich and complicated as that created by any orchestra.\n\nGateway Episode: “The Architect of Hollywood”\n\nThe New Yorker Radio Hour is a weekly news and arts compendium. It looks at the space between an artist’s finished product—prose, cartoons, film, music, dance—and the creators themselves. Timely, hard-news stories on the Supreme Court, the White House, Harvey Weinstein, and the other of-the-moment pieces being covered by the magazine show up in this iteration, too. But the show has a looser structure, and its host David Remnick, the editor of The New Yorker, allows the lighter-hearted narratives to meander into quiet, contemplative places, giving it variety-is-the-spice-of-life, coffeehouse vibes. And bigger is not necessarily better with the The New Yorker Radio Hour. Take, for example, a brilliant six-minute segment where the cartoonist Emily Flake takes listeners to Rudy’s, her favorite dive bar; it’s a nerdy, arty, boozy, sweet snapshot of what it’s like to be an artist in the city.\n\nGateway Episode: “Love, War, and Sandwiches”\n\nThe interviewer and writer Krista Tippett is a modern-day mystic who brings listeners to cerebral conversations about the world’s spiritual state. She would probably make the perfect dinner-party host. She’d assemble the perfect guest list, too—maybe Ta-Nehisi Coates, Junot Díaz, Maria Popova, and Greg Boyle, guests she had on her show this year. She’s even on President Obama’s radar; he awarded her the National Humanities Medal in 2013, for her actual job, one she created for herself: exploring the mysteries of human existence. She probably also knows the best icebreaker for a Bumble message and the coolest empty bar to hit in Manhattan on a Friday night. If you can’t be bothered to meditate or read literature, make yourself more attuned to the emotional energy of the people around you by giving On Being an hour of your time each week.\n\nGateway Episode: “Eula Biss”\n\nLet You Must Remember This baptize you into the world of show business. This is the host Karina Longworth’s chronicle of the stars—and would-be stars—who ushered in Old Hollywood. Many of the origin stories she tells predate the talkies, flashing back to vaudeville and New York theaters. This year’s exceptional (and luridly themed) miniseries “Dead Blondes” is a required binge. While the big names like Marilyn Monroe and Veronica Lake may draw you in, it’s the ephemeral careers of actresses such as Peg Entwistle, who famously committed suicide by throwing herself off the “H” of the Hollywoodland sign, that are more likely to leave the lasting mark. What sets Longworth alongside other historians is the marvelous affect she uses to get inside the heads of her subjects: She channels the gossip columns, the parties, the broader cultural impact, the addiction, the parasites, the rise to fame—it’s all there in her performance.\n\nGateway Episode: “Peg Entwistle (Dead Blondes Episode 1)”\n\nThe host Hrishikesh Hirway constructed Song Exploder so that musicians take center stage, albeit in a cozy fashion, as if they’re at a coffee shop where artists chat with fans between songs. There are visits from the stadium-thrashing rockers Metallica and Hamilton’s Lin-Manuel Miranda and younger artists like Lorde and ones as dreamy as Solange. Hirway even deconstructs the Stranger Things theme song. Listening to musicians thoughtfully discuss their process offers a rare view of the inner workings of an artist’s mind. Song Exploder also works as a primer for the musicians you don’t know yet: The addictive deconstruction of one song per episode and musical nerdcraft serve as an entry point to new acts. Since the songwriter is the one doing the talking—Hirway smartly stays out of the way while presiding—you’re listening to the best liner notes you never read.\n\nGateway Episode: “Stranger Things”\n\nIn some perfect confluence of events, the Sidedoor host Tony Cohn ended up with a microphone in his hand and at the Smithsonian. He’s so good at his job making listeners interested in the museum, it doesn’t matter that it’s essentially a 30-minute ad. Cohn gives us the behind-the-scenes look at the Smithsonian’s archives with topics ranging from historical (“If These Bones Could Talk” recounts a prolific researcher who mysteriously died at 30) to those tied into current events (“The Hungry Hungry Hippo Baby” about Fiona, the adorable hippo born prematurely at the Cincinnati Zoo). Cohn’s charm and realness fueled by the resources of the vast Smithsonian, including access to all of its experts, created some of the best narratives this year. (Sidenote: Sidedoor has an incredible website.)\n\nGateway Episode: “If These Bones Could Talk”\n\nIt’s unclear how Love + Radio’s Nick van der Kolk finds his subjects or what any of the stories he tells have in common, but one thing is certain: He knows how to disorient you through a narrative. The fifth season includes a three-part series about a woman forced into hiding in the Witness Security Program after unwittingly—and later wittingly—becoming involved in the Colombian mafia and drug trafficking. An episode from the show’s sixth season recounts a tear-jerking story of a woman giving her son up for adoption, and her struggle to let him go; the episode then abruptly cuts to clips from 1980s TV talk shows on which she appeared after reuniting with him as an adult and the confusing feelings it brought up in her. The twist will make you dizzy, like most Love + Radio episodes do.\n\nGateway Episode: “La Retirada, Part One”\n\nLabeling Radiolab a science podcast misses the mark. The association bears out in one regard, because the longtime hosts Jad Abumrad and Robert Krulwich frame stories around a battle between wonderment and skepticism. But any topic is fair game. This long-running series continues to set the pace for producing the most awe-inspired goosebumps. “Oliver Sacks: A Journey From Where to Where” speaks to everything in Radiolab’s DNA, exploring the yearning for a life long enough to discover all its secrets. “Breaking News” comes face to face with Adobe’s Voco, a software platform that can mimic the speech of someone after less than an hour of listening. The thread that runs through all episodes is the idea of capturing a once-in-a-lifetime moment, whether it’s a discovery or an ethical crossroads. The thrills Abumrad and Krulwich draw from frozen lakes, driverless cars, and political intrigue make you feel like you’re on a treasure hunt. Radiolab is really about chasing a narrative inside something so fascinating you can’t quite get over it, ever.\n\nGateway Episode: “Driverless Dilemma”\n\nLea Thau just announced that she will break from Radiotopia, but in her final season of Strangers with the podcast network, she did some excellent and unexpected work. She equates an episode of Strangers with taking a shot of empathy, and the analogy shakes out. For instance, at one point this year, she was traveling around the country debating Trump supporters, even staying in their homes. Thau first endeared herself to the audiosphere through her work with The Moth, and her series Love Hurts, in which she interviews her ex-boyfriends. But nothing could be more empathy-eliciting than her two-parter on Strangers this season, “Jack Be Nimble,” about a little girl who grew up to be a great man despite going through the worst forms of abuse. The show’s raw approach immediately gets listeners to let their guard down and invites them to think differently about the anonymous nature of human existence.\n\nGateway Episode: “Love Hurts”\n\nA discussion on culture from The New York Times co-hosted by the writers Jenna Wortham and Wesley Morris, Still Processing brings delightful substance to a world of hot takes. Wortham and Morris spend each week soaking in news, technology, film, TV, and music and crushing on celebrities. Race and sex are essential components of the conversation—the back and forth that connects the dots between S-Town, Get Out, and Kendall Jenner’s maligned Pepsi commercial is inspired. The hosts aren’t afraid to get in a time machine either. They devote an entire show to Whitney Houston, because that’s what tickled their fancy that week. When you dig into these dialogues, you understand just how much research and preparation go into its creation. Wortham and Morris structure an episode well in advance and it shows. Still Processing synthesizes a pop-culture diet into an insightful and stylish 45 minutes.\n\nGateway Episode: “We Go to S-Town”\n\nTwo inmates from San Quentin State Prison—the co-host Earlonne Woods and the 29-year-old sound designer Antwan Williams—work with the Bay Area artist and co-host Nigel Poor to bring listeners stories from inside the U.S. prison system. It kicks off with a remarkable tale about “cellies” (or cell mates)—how to get one, how to get excused from having one, what makes someone ideal—and listeners learn that living with a stranger might be more appealing than living with your own brother. A later episode gives an in-depth look at solitary confinement from four men who spent years isolated in a small space for all but one hour a day. Several inmates and even the warden make appearances on the show, which is produced without internet access and with limited media-lab hours in a loud environment. Yet the trio manages to pull off an excellent first season. Though the show stops short of straightforward advocacy, a side effect of these stories is making listeners wonder about prison reform.\n\nGateway Episode: “Episode One: Cellies”\n\nOn its homepage, On the Media displays an image of the hosts Brooke Gladstone and Bob Garfield arm wrestling. It’s been exactly that kind of year for WNYC’s media critics. For the uninitiated, this weekly series examines how the press reports on events ranging from mass shootings to the #MeToo movement to the removal of Confederate statues. In one installment, the Peabody Award–winning show tackles coverage of the Robert Mueller indictments—depending on whom you read, the special prosecutor is either Atticus Finch or Benedict Arnold. On the Media has been poking at truth, doubt, and propaganda for more than a decade; these past two years, coverage of Trump left them with a crisis of conscience. Gladstone worries On the Media, and the press more broadly, diminished voices from the populist right that should have been on the air, while Garfield sees the administration and its supporters as a toxin to democracy. This is a news organization that seeks the truth right in front of your eyes.\n\nGateway Episode: “12 Months Later: Brooke and Bob on Covering Trump”\n\nLove Me—hosted by Lu Olkowski—swirls together fiction and nonfiction, performance and interview, her own narrative and strangers’ in each installment. It’s quirky, unpredictable, and aims, according to the show’s site, to “celebrate that weird little voice inside each of us that cries out: ‘Love me.’” Weird is a key word here—the good kind of weird. It’s the weird that expounds upon a bizarre fungus that found its way inside a woman’s knee, how it hurts and controls her; her boyfriend names it “Loretta.” It’s the weird that walks you through the experience of a man asked to build his father-in-law’s casket. It’s the weird that sometimes makes you cry. We learn in its second season that Olkowski has a fraught relationship with her parents who, according to her, loved her conditionally, a revelation that makes the searching quality that underscores each episode suddenly quite clear.\n\nGateway Episode: “Howl”\n\nLet’s face it, data collection, hacks, and the world’s obsession with GIFs can make life seem incomprehensible. Reply All, still the best podcast out there about the internet, wants to explain it to you in a calm voice. Repeat listens make clear this is a show driven by mysteries and exploration. The hosts Alex Goldman and PJ Vogt meet, frequently in person, the people that exist in your internet blindspots. Instead of feeding the trolls, they chat with them. In one episode, Goldman flies to India to confront a scammer he felt a connection with, the grift notwithstanding. During an interview this year, Vogt mentioned how their producers and his co-host frequently hide entire details of stories from each other, just so they can record an earnest piece of tape, a genuine response, back in the studio. This kind of authenticity is hard to come by. Reply All may be the most reliable listen you’ll find on any podcatcher.\n\nGateway Episode: “Long Distance” and “Long Distance, Part II”\n\nInvisibilia is interested in filling in the gaps about how our minds work: It peers inside the brain to understand all its gray areas, feelings, and frustrating contradictions. In the third season, the hosts Alix Spiegel and Hanna Rosin try to answer tough questions about human behavior: In one episode, after a brain surgery, a woman’s hand begins to act without her control, and it seems to do so with a moral imperative—putting out her cigarettes, for instance. In this year’s standout, “Emotions,” we learn that a man has discovered a new feeling called “liget,” and two other people tussle with the notion of whether or not you can control your demons after a terrible, traumatic car crash. Invisibilia is heady stuff, and Spiegel and Rosin are excellent guides for the journey to decode our tangled minds.\n\nGateway Episode: “Emotions”\n\n“This is Terrible, Thanks for Asking,” says the host Nora McInerny in a delightful Midwestern cadence at the beginning of every episode. The author, podcaster, and widow (McInerny lost her husband and father within weeks of each other) deftly deploys a light touch for this show about trauma and loss, which is necessary considering the intensity of the stories its tells: a man loses damned near every single one of his family members, a woman is in her 30s and has never had a serious relationship, the comedian and writer Harris Wittels is remembered. The second-season premiere showed McInerny’s talent at blending her own story with someone else’s—here, it’s that her husband and a friend’s wife died on the same day from similar causes. McInerny’s fluency in the language of death and grief offers her audience a chance to become better shoulders to cry on and more in touch with their own losses, all without slipping into high-pitched hyperbole. TTFA and McInerny teach listeners that sadness can be the red pill and the blue pill, the rain and the umbrella.\n\nGateway Episode: “Episode 11: The Ending Matters”\n\nThe Heart exists on the edge of whatever the most progressive line of feminist thinking happens to be on the subjects of love and sex. It tends to address culture in a way that complicates the current conversation, while also creating entry points for people just beginning to see why someone might want to dismantle the patriarchy. It’s part art-house project, part soundscape, and part superior storytelling. This year, it produced three miniseries: “Pansy” (an exploration of masculinity and femininity), “No” (the host Kaitlin Prest analyzes her sexual boundaries and talks through murky-at-best consent with an estranged friend and ex-lover), and “Bodies” (a modern take on bodies that sometimes verges on TMI, but produced the brilliant episode, “Meat”). Alas, Prest has announced the show is not returning in 2018, but fans can get updates about the magic that is promised in its place via this link.\n\nGateway Episode: “Pansy: Twirl”\n\nThe United States of Anxiety’s second season zeroed in on what many listeners might feel they need right now: the reminder that there’s a historical context to current events, even if Americans aren’t necessarily coming together, agreeing on the facts, or seeing the world through the same lens anytime soon. But the show has a, perhaps unintentional, resonant message—that a shared reality might not be the key to prevailing. Consensus isn’t how wars are won, after all. Pro tip: Listen to this show outside of the news cycle for a 50,000-foot view.\n\nGateway Episode: “Episode 1: Whose Kansas Is It Anyway?”\n\nLearning a foreign language has the added benefit of giving fresh context to your native tongue. You can’t really appreciate that in English, adjectives go before the noun they modify until you compare it to something like Spanish, for instance, in which adjectives go after. Then you can contemplate the benefits of doing it differently. Rough Translation is the cultural equivalent. By traveling from country to country to tackle topics hugely important to life in America—race, fake news, dating—listeners get a broader context for their own hangups, prejudices, and social mores. How Americans flirt, consume media, and understand even basic tenets of affirmative action fall on the chopping block in this show’s first season.\n\nGateway Episode: “Brazil in Black and White”\n\nThis American Life seeded the idea of what an hour of narrative radio can be at its sublimest, and yet no one has ever replicated or surpassed its prodigious charms. Much is made of its thematic multiple-act structure around a topic, but the brilliance of the show is best seen across a span of episodes. Take, for example, back-to-back releases in April about political cataclysms: Putin’s rise to power in Russia and the Republican Party’s split on immigration. The very next show opens with the quixotic adventures of the pirate Stede Bonnet. Unlike other shows that find a creative lane and cling to it, TAL never ceases to experiment. It’s the decades-long push and pull between long-form nonfiction, memoir (“The Magic Show” finds inspiration from host Ira Glass’s apprenticeship as a young magician), comedy, and politics that makes TAL the touchstone of American podcasting.\n\nGateway Episode: “Essay B”\n\nLucky for us, just last year the creators of Radiolab, known for their gorgeous production, served up More Perfect, a show that examines benchmark Supreme Court cases with lasting impact on today’s headlines. For example, “Sex Appeal,” co-starring Ruth Bader Ginsburg as a young ACLU lawyer, details how the Supreme Court handles gender-inequality cases. As you listen to the second season, a pattern emerges from the other topics it covers: race, police brutality, gerrymandering, guns, unlimited campaign contributions, and more. The show is not just a crash course in jurisprudence; it also blueprints how every new case is measured against the last landmark decision (e.g., how the courts judge “reasonable” police behavior when cops use deadly force). After the 2016 election, much was said about how U.S. voters live in bubbles. The Supreme Court may be the tiniest bubble of them all, but its decisions affect every last American.\n\nGateway Episode: “Mr. Graham and the Reasonable Man”\n\nRadio fans who haven’t explored the audio stylings of Terry Gross haven’t lived. She was a part of the canon for years before iPods were even a twinkle in Apple’s eye, not counting the time she logged honing her craft before the word podcast entered the lexicon. She’s been steadfast and true; Gross meticulously plans for each interview, while having the skill to craft one on the fly when need be. But this year, listeners started to hear a different side of her. She gave interviews, both in print and on air, which has never much been her inclination. And though her conversations are always civil, her approach seemed invigorated post-election. And finally, though her taste is as exacting as ever, if it’s possible, she’s managed to cast a wider net on both pop culture and niche subjects in 2017.\n\nGateway Episode: “Feminist Writer Lindy West”\n\nSome people will tell you that Los Angeles is the “It” city and that it’s surpassed New York as the cultural capital of the United States. If rocketing rents and real-estate speculation are any indication of cachet, LA certainly has a lot of it. There Goes the Neighborhood, in its second excellent season, shacks up on the West Coast only to find the same rogues’ gallery of unscrupulous investors, greedy landlords, and overpriced apartments it found in Brooklyn last year. But even though they make great villains—the smarmy building owner from the second episode, “I Didn’t Want to Evict You,” will insist that gentrification is a real community service—the beating hearts of this series are the tenants who love their neighborhood. People, such as the tenant’s right activist Uver Santa Cruz, band together with their neighbors to fight evictions in court. This podcast isn’t all black and white; rather, it spends a lot of time in the gray area between the entrepreneurs who want to flip a house or open a coffee shop and the people who just want to call LA home.\n\nGateway Episode: “All These People Moving In, New Buildings, New Apartments”\n\nAny way you slice it, Reveal’s self-given premise—“investigative journalism and groundbreaking storytelling to spark action, improve lives, and protect our democracy”—while accurate and noble, sounds at least a little bit like homework. But the experience of each episode is more akin to a spoonful of sugar, even when it’s telling a story about Richard Spencer’s cotton farms or a man’s final days as a heroin addict. Reveal is housed at the Center for Investigative Reporting, which has earned Emmys, a Peabody, a MacArthur, and nominations for the Pulitzer Prize. The best way to come to it is by subscribing, diving in wherever you see fit, and then never missing an episode.\n\nGateway Episode: “All Work. No Pay. Life at a Rehab Work Camp.”\n\nThe psychotherapist and author Esther Perel’s Where Should We Begin? premiered with a married couple talking through decades of cheating; many listeners became immediately enraptured as Perel channeled priceless therapy into their ears, free of charge. The show focuses on couples working through sex and fidelity issues, but it’s rarely titillating and not at all about eavesdropping. Instead, Perel identifies the walls we build out of self-defense—obstacles to breaking a dry spell or past traumas making a woman recoil—and with laser precision, directs her patients to recognizing why. Perel deploys methodologies especially good for audio: role playing, fantasy, direct conversation. But it’s the way she gently nudges people toward one another that leaves listeners feeling less alone. Where Should We Begin? is the Rosetta Stone of feelings. Through it, it seems possible that we can all become fluent in the language of relationships.\n\nGateway Episode: “Episode 1: I’ve Had Better”\n\nChris Lighty was a big-shot executive in hip-hop. He was there from the beginning. He managed 50 Cent when no one would, he represented Missy Elliott, LL Cool J, and Mobb Deep, and at age 44, he died by suicide at his Bronx residence. The circumstances surrounding his death confounded people, including the show’s host Reggie Ossé (who himself died December 20 of complications from colon cancer at the age of 53). Mogul is an exploration of hip-hop and Lighty’s life, as well as Ossé’s personal journey into the subjects of mental illness and domestic violence. Ossé’s connection to the setting—he was an industry lawyer to artists such as Jay-Z, Sean Combs, and DMX, and knew Lighty—offers an insider’s look into a beloved world at a golden time. Top it off with sterling sound engineering, interviews with Lighty’s children and friends, and even archival tape of Lighty, and the result is a show that offers an education for the uninitiated, a yearbook for the hip-hop heads, and an intensive account of a life that ended much too soon.\n\nGateway Episode: “Part One: That Beat, That Beat Right There”\n\nThis year’s season of Embedded, a show dedicated to long-form documentaries that aim for deep, insider coverage, launched with a series about police shootings in the spring and then pivoted to five installments about President Trump in the fall. The stories about law enforcement are unflinching, drawing you right into the fog of war between cops and civilians, and race is never far from the conversation. Later, swinging in a different direction, Embedded dives into the earlier lives of the president and then-members of his administration. The explorations of Steve Bannon’s ideology and Jared Kushner’s backstory—his father was prosecuted by then–U.S. attorney Chris Christie—make for excellent case studies of powerful men that, up until the 2016 election, were phantoms.\n\nGateway Episode: “Trump Stories: The Golf Course”\n\nHeavyweight is a podcast all about emotional time travel, and the attempt to pull something stuck in the past into the present. It possesses unquantifiable magic created by the host Jonathan Goldstein. He manages to bring charm and humor to unexpected moments: while helping a woman find out why she was kicked out of her sorority years ago, or locating the person who wrote the letters that fill a suitcase someone has inexplicably been carrying around for years, or assisting a man in finding the driver who hit him so that he can say thank you. Heavyweight isn’t required listening like some of the shows on this list. It doesn’t make you better informed—but it might make you better. The second season crystallizes Goldstein’s tendency toward the intersection of nostalgia and discord. The jury’s still out on whether hoarding one’s feelings like Goldstein and his guests do is a disease, a cure, or an excellent escape.\n\nGateway Episode: “#9: Milt”\n\n“Shittown,” or “S-Town,” is John B. McLemore’s name for the slice of Alabama he calls home. He reached out to This American Life producer Brian Reed about a murder that nobody was doing time for and that residents openly discussed. It disgusted McLemore—along with almost everything else about his town—and he wanted Reed to get to the bottom of it. Eventually Reed takes the bait and embarks on years of reporting that quickly solves the mystery of this one-horse-town murder but mostly discovers McLemore the man, who sports a rich Southern accent, who has hobbies that include horology and hedge-maze design, and who walks the line between genius and unhinged. In this stunning work, Reed manages to grow podcasting as a form, too. Years ago, Serial broke the mold by incorporating TV-show elements into its structure, and now Reed shapes his work with techniques from the novel, rendering fascinating plot, characters, and setting, as well as tight literary prose through beautiful exposition. The first words will leave you breathless and, perhaps, sad that in S-Town, there will come an end.\n\nGateway Episode: “Chapter I”\n\nWhat listeners have come to expect from The Daily is, perhaps, unreasonable. But the New York Times reporter and host Michael Barbaro did this to himself. Launched in February, it took about two months for the show to find its rhythm: about 20 minutes a day, five days a week, one major story, and a round-up of headlines at the finish. The story might include recordings from ongoing Times investigations (Bill O’Reilly firing back at Times reporters on tape, Trump disavowing Jeff Sessions), interviews with journalists about their work (Jodi Kantor and Megan Twohey on Harvey Weinstein, Rukmini Callimachi on ISIS, Matt Apuzzo and Maggie Haberman on James Comey), and episodic narratives from long-form articles (most recently, how American airstrikes targeting ISIS have killed civilians). At a time when suspicions about the media are flying and credibility is key, Barbaro lets the audience hear how the Times’s stories are put together. And he also gets to be himself: As he talks to his colleagues, he deploys encouraging hmms and ahhhs, admits when he needs clarification, cracks jokes, shows emotion, and even references his personal life. Barbaro is America’s podcasting sweetheart and The Daily, the most impressive work of the year.\n\nGateway Episode: Today’s", "images": ["https://cdn.theatlantic.com/thumbor/K2z02PrHcYNLvuMSz33G1nFty00=/0x43:2000x1085/1200x625/media/img/mt/2017/12/EOY2017_Podcast/original.jpg", "https://cdn.theatlantic.com/media/files/archive-thumbnail.png", "https://cdn.theatlantic.com/_next/static/images/nav-crossword-promo-71e9c22fbca07267d82afb8cca81ec00.png", "https://cdn.theatlantic.com/thumbor/_KaR3NIQ5vcuZR3WeTcXyS4Ofo0=/420x0:1500x1080/80x80/media/img/mt/2017/12/EOY2017_bookread/original.png", "https://cdn.theatlantic.com/thumbor/aDLEKVvuwIhwqVtmWJc7oCE3cFs=/353x0:1478x1125/80x80/media/img/mt/2017/12/EOY2017_Books_Missed-1/original.jpg", "https://www.theatlantic.com/magazine/images/current-issue.large.jpg", "https://cdn.theatlantic.com/thumbor/NRQyEFAdQFL18Jac3JoSWzAi15E=/440x0:1565x1125/80x80/media/img/mt/2017/12/EOY2017_Movie/original.jpg", "https://cdn.theatlantic.com/media/files/YourSubscription_300x300.jpg", "https://cdn.theatlantic.com/thumbor/VzvBUKBHlOM3rdtBvuT0v6nmSZw=/420x0:1500x1080/80x80/media/img/mt/2017/12/EOY2017_song/original.png", "https://cdn.theatlantic.com/media/img/specialreports/lead/2020/10/14/Thumbnail.jpg", "https://cdn.theatlantic.com/assets/media/files/nav-crossword.png", "https://cdn.theatlantic.com/thumbor/nKBIRwKoSwSNLu6XbhxlOJtpC-k=/0x15:1947x1110/960x540/media/img/mt/2017/12/EOY2017_Podcast/original.jpg", "https://cdn.theatlantic.com/_next/static/images/nav-archive-promo-5541b02ae92f1a9276249e1c6c2534ee.png"], "top_img": "https://cdn.theatlantic.com/thumbor/K2z02PrHcYNLvuMSz33G1nFty00=/0x43:2000x1085/1200x625/media/img/mt/2017/12/EOY2017_Podcast/original.jpg", "keywords": [], "authors": ["Laura Jane Standley", "Eric Mcquade", "Ann Hulbert", "Sophie Gilbert", "Jane Yong Kim", "The Editors", "Spencer Kornhaber", "Christopher Orr"], "canonical_link": "https://www.theatlantic.com/entertainment/archive/2017/12/the-50-best-podcasts-of-2017/548165/", "title": "The 50 Best Podcasts of 2017", "meta_data": {"viewport": "width=device-width,initial-scale=1", "application-name": "theatlantic", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://cdn.theatlantic.com/_next/static/images/apple-touch-icon-default-b504d70343a9438df64c32ce339c7ebc.png", "og": {"site_name": "The Atlantic", "locale": "en_US", "title": "The 50 Best Podcasts of 2017", "description": "The shows that kept listeners refreshing their apps this year", "url": "https://www.theatlantic.com/entertainment/archive/2017/12/the-50-best-podcasts-of-2017/548165/", "type": "article", "image": "https://cdn.theatlantic.com/thumbor/K2z02PrHcYNLvuMSz33G1nFty00=/0x43:2000x1085/1200x625/media/img/mt/2017/12/EOY2017_Podcast/original.jpg"}, "fb": {"admins": "577048155,17301937", "app_id": 100770816677686, "pages": "29259828486,1468531833474495,1061579677251147,457711054591520,370457103090695,1631141167169115,148681772342453,1510507419185410,128344747344340,128377530562508,236061986423933"}, "p": {"domain_verify": "68e1a0361a557708fefc992f3309ed70"}, "twitter": {"site": "@theatlantic", "domain": "theatlantic.com", "card": "summary_large_image"}, "description": "The shows that kept listeners refreshing their apps this year", "krux": {"title": "The 50 Best Podcasts of 2017 - The Atlantic", "description": "The shows that kept listeners refreshing their apps this year"}, "author": "Laura Jane Standley, Eric McQuade", "article": {"publisher": "https://www.facebook.com/TheAtlantic/", "opinion": "false", "content_tier": "metered", "tag": "culture", "section": "Culture", "published_time": "2017-12-21T19:18:00Z", "modified_time": "2017-12-23T17:19:02Z"}, "robots": "index, follow, max-image-preview:large", "referrer": "unsafe-url", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-status-bar-style": "black", "apple-mobile-web-app-title": "The Atlantic", "keywords": "Gateway Episode, new podcast episode, listeners", "news_keywords": "Gateway Episode, new podcast episode, listeners", "next-head-count": 58}, "movies": [], "publish_date": 1513883880.0, "source": "https://www.theatlantic.com", "summary": ""}