{"url": "www.vanityfair.com/style/2014/04/sergey-brin-amanda-rosenberg-affair", "text": "I.T. Couple\n\nBrin’s and Wojcicki’s orbits collided in 1998, when Brin, a graduate student in Stanford’s computer-science department, moved off campus with classmate Larry Page to set up a search-engine company in Wojcicki’s sister Susan’s garage. Susan, who met Brin when he dated a friend of hers, charged them $1,700 a month rent to offset her mortgage (she is now the most senior female employee at Google, and the new head of YouTube). Brin and Page filled the garage with desks made of old pine doors set on sawhorses, a turquoise shag carpet, and a Ping-Pong table. Their search engine, initially called “BackRub,” evaluated the incoming links on a page instead of keywords, as their competitors did, as well as the importance of the entity doing the linking. (In search, as in life, it’s about who you know.)\n\nBrin’s parents, a pair of Russian-Jewish scientists from Moscow, had experienced prejudice in their home country, and migrated when he was six years old with help from the Hebrew Immigrant Aid Society (a charity to which Brin gave $1 million in 2009, and where his mother, Eugenia, serves on the board). The scientific community outside of Washington, D.C., embraced his parents, though money was still an issue, instilling a sense of frugality in their son.\n\nThe Wojcickis were similarly tight-knit and academic—and, like the Brins, also thrifty and non-materialistic. Wojcicki’s father was the chairman of Stanford’s physics department, and her mother is a journalism teacher. A lightly tanned brunette who was high-energy, athletic, and popular in school—a sort of Jennifer Aniston in Birkenstocks—Wojcicki figure-skated as a child and played ice hockey at Yale, where she majored in biology. After graduation she worked as a health-care investment analyst on Wall Street for 10 years. Her parents weren’t entirely pleased. “It was always embarrassing to come home,” she has said. “People were like, ‘Oh, Anne, you Wall Street girl.’ ” (Neither Brin nor Wojcicki responded to questions from Vanity Fair.)\n\nIn Brin, Wojcicki found another child of baby-boomer academics who could see beyond academia’s cautious, elitist approach to discovering new knowledge, a slow process in which researchers propose a hypothesis, organize an experiment to collect data, submit findings to peer review, and finally, many months later, gain publication in an esoteric journal. Brin and Wojcicki are pioneers of a different model, with enormous potential in both its reach and its speed: they look to advanced, Web-based tools and large data sets as the key to solving problems, from how to target advertising to discovering the drugs to treat cancer. Hypotheses can be limiting and scientists can be led astray; using massive computing power to find patterns is quick, and data sets don’t lie.\n\nAs Wojcicki and Brin started seeing each other, Google had not only weathered the dot-com crash but begun to dominate the search-engine business and was minting money via AdWords, the most effective advertising platform in history. Eventually, Google would employ 55,000 people on its 65-building campus in Mountain View, California, creating the country’s best e-mail platform (Gmail), their own browser (Chrome), a G.P.S. mapping system (Google Maps), a news aggregator (Google News), the world’s largest collection of data-storage servers, and the world’s most popular mobile operating system (Android). Google became a supremely powerful corporation, but in its DNA it remained anti-corporate. While it acted aggressively to innovate, Brin and Page tried as hard as possible to hew to their unofficial motto of “Don’t be evil,” keeping their search engine pure despite attempts by major advertisers to game results. When Google, in a rare misstep, censored its results in China, Brin, whose parents’ experience attuned him to the abuses of totalitarian regimes, took the leading role in pulling the company out of the country.\n\nThe corporate culture that you’ve likely heard about at Google—the lack of a dress code, the free sushi, the pets at work, the free Pilates sessions—was all part of the founders’ mission to create a benevolent workplace. When investors leaned on Page and Brin to hire an established C.E.O.—what’s called “adult supervision” in the Valley—they selected Eric Schmidt, a computer scientist and manager who was known to attend Burning Man, the annual, costumed bacchanal and creativity free-for-all in the Nevada desert that’s a tradition among Google executives. “Larry and Sergey genuinely care about innovation, and part of that means genuinely caring about employees so they do the best and most creative work they can do,” says a former Googler.\n\nCreativity meant thinking about things differently from the way other corporations did, and it’s part of how Google stays on top. It also meant that when Brin got married it wouldn’t be in the traditional way. In 2007 he and Wojcicki invited guests to a secret location in the Bahamas. Wojcicki hadn’t always wanted to get hitched—during her years on the Street she saw bankers cheating on their wives, according to the friend of the couple’s—but Brin was her man. For the wedding, she wore a white bathing suit, and the groom a black one. They swam out to a sandbar to take their vows surrounded by the ocean.\n\n__FAST COMPANY__Wojcicki and Brin at the 2014 Breakthrough Prizes in Fundamental Physics and Life Sciences ceremony, co-hosted by V.F. in Mountain View, California., By Steve Jennings/Getty Images.\n\nA year later, Wojcicki gave birth to their first child just as Google executives started enjoying life as some of the richest people in the world. Schmidt was a pilot, and, according to the friend, he encouraged other Google executives to indulge their desires for yachts and planes. Brin, Page, and Schmidt purchased at least a half-dozen planes, including a 767 and a 757; they basically “own an airline,” says the friend. Brin also purchased a home in New York City’s West Village. Schmidt bought Ellen DeGeneres’s $20 million Montecito mansion, a $15 million New York apartment, which made an appearance as Shia LaBeouf’s pad in the film Wall Street: Money Never Sleeps, and, recently, a $22 million home near the Playboy Mansion, in Holmby Hills.\n\nSchmidt’s wife, Wendy, however, retreated to their compound on Nantucket and didn’t often make the Google social scene. Schmidt, now 58, was sometimes accompanied by younger women, one of whom briefly worked at Google.\n\nSeveral former Google employees say that the company is casual in its approach to dating at work. One says that Google is “intentionally agnostic about dating,” and that there are hundreds of “Google couples” among its global offices. In fact, Google’s code of conduct does not ban dating between employees, saying, “Romantic relationships between co-workers can, depending on the work roles and respective positions of the co-workers involved, create an actual or apparent conflict of interest. If a romantic relationship does create an actual or apparent conflict, it may require changes to work arrangements or even the termination of employment of either or both individuals involved.”\n\nConcerning the culture of office romances at Google, one Atherton socialite with close connections to the company says, “When you have executives dating employees, it’s like a doctor-nurse relationship—it’s not illegal, but it seems like it shouldn’t be happening. Tech is a man’s world. Most of these guys are married, and then there are these young fresh [female] sharks, and they’re smart too.” But the men have hundreds of millions of dollars. The socialite trots out an old saw: “It’s almost like you get a Stanford degree so you can work at Google, so you can find a husband.”\n\nOver the years, there have been several notable workplace romances at the top levels of Google, including one between Page and Marissa Mayer, now the C.E.O. of Yahoo. There were hallway discussions about the two of them dating, and some believed being close to Mayer was helpful when trying to quickly secure Page’s approval for a project.\n\nWojcicki, unlike many wives of rich men, wasn’t enthusiastic about collecting art or jewelry, and she argued against buying planes and boats, says the friend of the couple’s. Some say she can be headstrong and withholding of praise, hot to her own ideas and dismissive of others’. Wojcicki is adamant about wanting a “normalized” life, says a source close to her, using the Silicon Valley billionaires’ phrase for “normal.” But there’s nothing normal about the astronomical wealth, or the power that comes from being the ones changing the world.\n\nIn 2006, Wojcicki co-founded 23andMe and soon raised several rounds of financing, including $6.5 million from Google. She hoped to attract over a million customers to her company, coaxing them to spit into a tube and send the saliva to her DNA-genotyping lab for today’s low price of $99. Her mission was to pass along as much information as possible about each person’s health and ancestry, on the principle that this knowledge, by rights, is ours. But not everyone receives good news; many have learned about elevated levels of risk for breast cancer, Alzheimer’s, or Parkinson’s. Some health-care professionals believe it is unwise to give individuals such daunting news without the support of personal counseling.\n\nWojcicki, it turns out, had a more personal stake in her business than one might imagine. Brin’s great-aunt suffered from Parkinson’s, the neuro-degenerative disorder, and his mother was diagnosed with it in 1999. It was long thought that Parkinson’s was not hereditary. But beginning in 2004, researchers suggested that people with a certain gene mutation (more common among Ashkenazi Jews) have a risk of between 30 and 75 percent of succumbing to the disease. (The general population’s risk is about 1 percent.) When Wojcicki tested Brin, his results were positive for the mutation. Brin read the risk as possibly having only about 10 good years left, says the friend of the couple’s.\n\nAfter getting such news, some of us would curl up into a ball, but Brin didn’t. Unlike Steve Jobs, who fiercely guarded news about his health, Brin started a blog and announced his results publicly, at Google’s Zeitgeist conference in 2008 in Mountain View. Brin began exercising even more relentlessly than usual, and drinking coffee, which some doctors recommend for those at risk for the disease, even though he abhorred the taste. (He eventually switched to green tea.) He told Wired magazine that he hoped those steps might reduce his risk by half, and if research on the brain progresses, as he believes it will, his risk could be cut in half again.\n\nIn addition, Wojcicki and Brin have the means to aid such research, and they have given more than $150 million to the Michael J. Fox Foundation and $7 million to the Parkinson’s Institute. They have also donated to the Breakthrough Prizes, one of which was awarded to a Parkinson’s researcher at a ceremony at the NASA Ames Research Center, in Mountain View, last fall co-hosted by Vanity Fair. Research on the 10,000 Parkinson’s sufferers that Wojcicki has recruited at 23andMe, the largest cohort of these genotypes in the world, might cut Brin’s risk even more. “Somewhere under 10 percent” is his own assessment.\n\nA New Life\n\nIn the years following his genetic test, Brin shifted his focus at Google. Like many leaders in Silicon Valley, he had grown bored with quotidian problems and started to dream more about things that were literally out of this world, like space travel and robots who will become our friends. As Microsoft co-founder Paul Allen invested $200 million on a superplane that can launch a rocket, and Tesla’s Elon Musk talked about the Hyperloop, Brin, working at a company with the country’s top engineers, threw his energy into Google X, the company’s “secret lab,” in two nondescript buildings near the Mountain View campus.\n\nIn 2012, to debut Google Glass, Brin coordinated a skydiving stunt, with a team of jumpers leaping out of a zeppelin over downtown San Francisco. The media was enthralled: Brin, they said, was the real-life Tony Stark, the comic-book genius innovator played by Robert Downey Jr. in the Iron Man films. (Actually, director Jon Favreau says Musk was his inspiration.) Glass was Brin’s first big project at X; now he’s ready to turn his attention to driverless cars, beta versions of which are crisscrossing San Francisco today, like so many ghosts.\n\nThe first incarnation of Glass, a 10-pound, head-mounted display attached to cables that looped to a box on the user’s belt, was not sexy, but Brin had it redesigned as sleek, lensless frames in shades of “cotton,” “tangerine,” and “sky.” Still, they screamed “nerd.” At an Allen & Co. conference in Sun Valley, Idaho, Brin and Wojcicki approached designer Diane von Furstenberg with an idea: perhaps she would like to collaborate. The designer was tickled by the notion of her models wearing Glass at a fashion show. It would lend a bit of tech gloss to her company, and fashion glamour for Glass.\n\nFor the event the Glass team, including Amanda Rosenberg, descended on New York to collaborate with von Furstenberg’s studio. Brin and Wojcicki threw a party at their home in the West Village and Glass’s palette was matched to von Furstenberg’s clothes. On the day of the show, during New York’s Fashion Week, Rosenberg posed with von Furstenberg and Brin for celebratory photos. She posted a picture of herself sitting in the front row, using Glass to record the show. “You can see that everyone looks pretty cool, whereas I can barely contain my excitement,” Rosenberg wrote, with her usual sense of self-deprecating humor.\n\nWhile Glass was blowing up in the press, a friend admits, Wojcicki may have been a bit hard on Brin. “Anne is great, but she can be difficult,” says the friend. “She’s hard on Sergey, and she doesn’t let him get away with things.” She was focused on saving him: when research discovered that a gene variant might protect those with Brin’s rare Parkinson’s-related mutation, Wojcicki patented it. (Like many of her business decisions, patenting genes—a move often seen as an attempt to corner a drug market—is controversial in the medical establishment.)\n\nWojcicki still wanted a normal life, or as normal as she could have: to be a dedicated mom and for the family to have dinner together. But “instead of just being a Google founder, Sergey was suddenly awesome, a cool person, a performer—a celebrity!” says the friend of the couple’s. “And he was like, ‘Wait a second—I’m doing all this cool stuff, and then I have to come home and change diapers?’ ”\n\nWojcicki began to help Brin informally on Google Glass, says the friend. Rosenberg wanted to get the product into the hands of moms, so she came over to Wojcicki’s home to discuss reaching out to the many kid-oriented services in Los Altos. At the time, Rosenberg’s boyfriend was Hugo Barra, a high-ranking executive on Google’s Android team. A Brazilian educated at M.I.T., he was essentially the face of their new mini-tablet, the Nexus 7, and a well-regarded, creative product manager. Rosenberg posted internal videos of the two of them together and was “so proud when she started dating him,” says a co-worker. Over the holiday season in 2012–13, says the couple’s friend, Wojcicki and Rosenberg became close enough that Wojcicki bought Rosenberg a Christmas present. The two of them went to a birthday dinner for Russian investor Yuri Milner, with Barra, Brin, and both Wojcicki’s and Brin’s parents. Rosenberg was smoking cigarettes, and Barra wanted her to stop. Wojcicki lectured her about the health risks.", "images": ["http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-header.ea437ae89b8c3c7aabbb46bb45a04f1a514e5803.svg", "https://media.vanityfair.com/photos/631f2e626009e759e6638f7c/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/54cac00851062027081ff7a4/master/w_2560%2Cc_limit/image.jpg", "https://media.vanityfair.com/photos/54cac008494254fc09974003/16:9/w_1280,c_limit/image.jpg", "https://media.vanityfair.com/photos/54cac008b8f23e3a03159023/master/w_1600%2Cc_limit/image.jpg", "https://media.vanityfair.com/photos/63370d0bb02ed9e1f657fa60/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/633dbec146d7fce1e25ce37f/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/631d72a9c1df471d836f1b56/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/54cac008b624d691057695ee/master/w_1600%2Cc_limit/image.jpg", "https://media.vanityfair.com/photos/6320d298b63c9570a030ca22/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/633dac5a42c2d8adf3fa7d9c/1:1/w_350%2Ch_350%2Cc_limit/undefined", "http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/633e045546d7fce1e25ce391/1:1/w_350%2Ch_350%2Cc_limit/undefined"], "top_img": "https://media.vanityfair.com/photos/54cac008494254fc09974003/16:9/w_1280,c_limit/image.jpg", "keywords": [], "authors": ["Condé Nast", "Vanessa Grigoriadis"], "canonical_link": "https://www.vanityfair.com/style/2014/04/sergey-brin-amanda-rosenberg-affair", "title": "Sergey Brin and Amanda Rosenberg: Inside the Google Co-Founder’s Romance with the Google Glass Marketing Manager", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "The high-profile love triangle involving Sergey Brin, Anne Wojcicki, and Amanda Rosenberg has Silicon Valley facing emotional issues, from office romance to fear of mortality.", "id": "54cb02145106202708207238", "keywords": "google,technology,society,magazine,april 2014 issue", "news_keywords": "google,technology,society,magazine,april 2014 issue", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "54cb02145106202708207238", "parsely-metadata": "{\"description\":\"The high-profile love triangle involving Sergey Brin, Anne Wojcicki, and Amanda Rosenberg has Silicon Valley facing emotional issues, from office romance to fear of mortality.\",\"image-16-9\":\"https://media.vanityfair.com/photos/54cac008494254fc09974003/16:9/w_1000,c_limit/image.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/54cac008494254fc09974003/1:1/w_1000,c_limit/image.jpg\"}", "og": {"description": "The high-profile love triangle involving Sergey Brin, Anne Wojcicki, and Amanda Rosenberg has Silicon Valley facing emotional issues, from office romance to fear of mortality.", "image": "https://media.vanityfair.com/photos/54cac008494254fc09974003/16:9/w_1280,c_limit/image.jpg", "site_name": "Vanity Fair", "title": "Sergey Brin and Amanda Rosenberg: Inside the Google Co-Founder’s Romance with the Google Glass Marketing Manager", "type": "article", "url": "https://www.vanityfair.com/style/2014/04/sergey-brin-amanda-rosenberg-affair"}, "article": {"content_tier": "metered", "opinion": "false", "section": "tags", "published_time": "2014-03-12T04:00:11.892Z", "modified_time": "2014-03-12T04:00:11.892Z", "author": "Vanessa Grigoriadis"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "The high-profile love triangle involving Sergey Brin, Anne Wojcicki, and Amanda Rosenberg has Silicon Valley facing emotional issues, from office romance to fear of mortality.", "domain": "https://www.vanityfair.com", "image": "https://media.vanityfair.com/photos/54cac008494254fc09974003/16:9/w_1280,c_limit/image.jpg?mbid=social_retweet", "site": "@VanityFair", "title": "Sergey Brin and Amanda Rosenberg: Inside the Google Co-Founder’s Romance with the Google Glass Marketing Manager"}, "fb": {"app_id": 256281040558, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": 1394596811.892, "source": "http://www.vanityfair.com", "summary": ""}