{"url": "https://en.wikipedia.org/wiki/Kris_Humphries", "text": "American basketball player\n\nFor other people with similar names, see Chris Humphries (disambiguation)\n\nKristopher Nathan Humphries[1] (born February 6, 1985) is an American former professional basketball player who played in the National Basketball Association (NBA). He played in the NBA for the Utah Jazz, Toronto Raptors, Dallas Mavericks, New Jersey / Brooklyn Nets, Boston Celtics, Washington Wizards, Phoenix Suns, and the Atlanta Hawks. Humphries played college basketball for the Minnesota Golden Gophers of the University of Minnesota, and for the United States men's national basketball team.\n\nEarly years [ edit ]\n\nHumphries was born in Minnesota to Debra and William Humphries. His father was a football player at the University of Minnesota.[2] Humphries is half African-American from his father.[3] He has two older sisters, Krystal and Kaela. His first success in sports came in competitive swimming, where he was the top 10-year-old in the nation in six events, first, beating young Michael Phelps in the remaining events. Kris Humphries held the US national record for the 50-meter freestyle for 10 and under boys for 18 years until it was recently broken.[4] At age 12, he gave up swimming to pursue a career in basketball.\n\nHumphries attended Hopkins High School, where he led the team to a 25–2 record in 2002 and its first Minnesota state championship in 49 years.[2] He was named a 2003 McDonald's All-American and named Second Team All-USA by USA Today.[5] He was also named to the Super 25 Basketball Team by USA Today, named Minnesota Mr. Basketball, and state player of the year by the Minneapolis Star Tribune and College Basketball News.[5] He was one of 10 finalists for the 2003 Naismith Prep Player of the Year Award, averaging a double-double in his final three seasons, averaging 25.7 points, 11.4 rebounds, and 5.0 assists a game as a senior.[5]\n\nConsidered a five-star recruit by Rivals.com, Humphries was listed as the No. 2 power forward and the No. 15 player in the nation in 2003.[6]\n\nHumphries accepted a scholarship offer to Duke University, but later reconsidered and chose the University of Minnesota.[7]\n\nCollege career [ edit ]\n\nAt Minnesota, Humphries was named 2004 Big Ten Freshman of the Year and named to the All-Big Ten First Team by the media and coaches. He was named Honorable Mention All-America by the Associated Press and by Rivals.com. He was the first freshman to lead the Big Ten in scoring and rebounding in the same season. He scored in double figures in all the 29 games, with 16 point/rebound double-doubles on the season for Minnesota. He averaged 21.7 points and 10.1 rebounds (both tops in the Big Ten), while shooting .444 percent from the field and .742 from the line. On February 18, 2004 he set a school record with 36 points in a game against Indiana. He also set a school record for most points by a freshman for a season with 629 and was the first Big Ten freshman to be named conference Player of the Week in two of the first three weeks of the season. Humphries only played one season for Minnesota before declaring for the NBA Draft.\n\nAlthough Humphries was personally successful at Minnesota, the team struggled. The Gophers finished 12–18, with a 3–13 record in the Big Ten during Humphries' lone season, tying Penn State for the worst record in the conference.[8] Critics accused Humphries of playing selfishly, preferring to inflate his statistics and NBA draft stock rather than help the team win games.[9] The team had a .500 record before his arrival and finished with a 10–6 conference record in the season after he left.\n\nProfessional career [ edit ]\n\nUtah Jazz (2004–2006) [ edit ]\n\nHumphries was drafted by the Utah Jazz with the 14th overall selection in the 2004 NBA draft.[10][11] He spent two seasons with the Jazz, averaging 3.7 ppg and 2.8 rpg in 4.8 minutes per game.[12]\n\nToronto Raptors (2006–2009) [ edit ]\n\nOn June 8, 2006, Humphries was traded along with Robert Whaley to the Toronto Raptors in exchange for Rafael Araújo.[13] In the 2006–07 season, after a slow start in which he did not receive many minutes from Raptors coach Sam Mitchell, Humphries proved to be a valuable rebounder and energy player and contributed to the Raptors capturing their first ever division title.[14] On March 28, 2007, he grabbed seven offensive rebounds in 27 minutes against the Miami Heat, both a game-high[15] and a career-high.[16] He followed up this performance with nine offensive and 18 total rebounds in a win against the Detroit Pistons on April 13, 2007, again both game and career-highs.[17][18] Humphries concluded his inaugural season with the Raptors with a career-high 3.1 rpg and .470 field goal percentage, as well as 3.8 ppg.[12]\n\nDallas Mavericks (2009–2010) [ edit ]\n\nOn July 9, 2009, Humphries, Shawn Marion and Nathan Jawai were traded to the Dallas Mavericks as a part of the four-team deal among Raptors, Mavericks, Orlando Magic and Memphis Grizzlies.[19]\n\nNew Jersey / Brooklyn Nets (2010–2013) [ edit ]\n\nOn January 11, 2010 the Mavericks traded Humphries along with G/F Shawne Williams to the New Jersey Nets in order to re-acquire Eduardo Nájera.[20] On January 27, 2010, Humphries scored a career-high 25 points against the Los Angeles Clippers. He previously recorded career highs of 15 and 21 points respectively as a New Jersey Net.[citation needed] The 2011 season was a breakout season for Humphries as he averaged a double-double in points and rebounds. On December 21, 2011, Humphries signed a one-year, $8 million contract with the New Jersey Nets.[21]\n\nThe 2011-12 season was his best as a professional, as he started all 62 games that he played in, averaging 13.8 points, 11.0 rebounds, and 1.2 blocked shots per game - all career highs. His rebounding average was good enough to rank fifth in the league for the second consecutive season.\n\nOn July 17, 2012, Humphries signed a two-year, $24 million contract with the Nets, who by that point had moved to Brooklyn.[22]\n\nBoston Celtics (2013–2014) [ edit ]\n\nOn June 27, 2013, ESPN.com reported that the Nets and Boston Celtics had worked out a trade that would send Humphries and four other players (Keith Bogans, MarShon Brooks, Kris Joseph, and Gerald Wallace) as well as three future first-round draft picks to Boston in exchange for Kevin Garnett, Paul Pierce, and Jason Terry as well as D. J. White.[23] The deal was finally completed on July 12, 2013.[24]\n\nWashington Wizards (2014–2016) [ edit ]\n\nHumphries warming-up with Wizards in November 2014.\n\nOn July 19, 2014, Humphries was acquired by the Washington Wizards in a sign-and-trade deal that sent a protected 2015 second round pick and a trade exception to the Boston Celtics.[25] On October 9, 2014, he underwent successful surgery to repair nerve damage in his right small finger, and was subsequently sidelined for three to four weeks.[26]\n\nOn November 14, 2015, Humphries made 5-of-8 three-pointers on his way to a game-high 23 points, helping the Wizards defeat the Orlando Magic 108–99. Prior to the 2015–16 season, Humphries had gone more than a decade since making a three-pointer. He hit two in his 2004–05 rookie season, and none after that, until this game.[27]\n\nPhoenix Suns (2016) [ edit ]\n\nOn February 18, 2016, Humphries was traded, along with DeJuan Blair and a 2016 protected first round draft pick, to the Phoenix Suns in exchange for Markieff Morris.[28] He made his debut for the Suns the following day in a 116–100 loss to the Houston Rockets, recording 18 points and 12 rebounds in 27 minutes off the bench, becoming the 13th Suns player to have a double-double in his debut.[29] On February 28, after three starts in four games, he was waived by the Suns in a buyout agreement.[30]\n\nAtlanta Hawks (2016–2017) [ edit ]\n\nOn March 1, 2016, Humphries signed with the Atlanta Hawks.[31] Three days later, he made his debut for the Hawks in a 106–77 win over the Los Angeles Lakers, recording 14 points, eight rebounds, one steal and one block in 22 minutes off the bench.[32]\n\nOn July 15, 2016, Humphries re-signed with the Hawks.[33]\n\nRetirement [ edit ]\n\nOn September 25, 2017, Humphries signed with the Philadelphia 76ers[34] but was waived on October 14, 2017, as one of the final roster cuts.[35] Humphries announced his retirement on March 26, 2019.[36]\n\nNational team career [ edit ]\n\nHumphries was on the 2002 U.S. Junior World Championship Qualifying Tournament Team, alongside future Raptors teammate Chris Bosh.[5] The team finished with a 4–1 record and the bronze medal and qualified for a berth in the 2003 FIBA Junior World Championship.[2] Humphries averaged 9.0 points and 5.0 rebounds in five games.[2]\n\nPersonal life [ edit ]\n\nHumphries began dating reality TV personality Kim Kardashian in October 2010. They became engaged in May 2011,[37] and married on August 20, 2011.[38] A two-part TV special showing the preparations and the wedding itself aired on E! in early October 2011, amidst what The Washington Post called a \"media blitz\" related to the wedding.[39]\n\nOn October 31, 2011, it was announced that Kardashian had filed for divorce from Humphries after 72 days of marriage.[40][41]\n\nOn December 1, 2011, Humphries filed his response to Kardashian's petition, requesting an annulment on the grounds of fraud or a decree of legal separation rather than Kardashian requested divorce.[42]\n\nSeveral media outlets at that time reported that Kardashian's marriage to Humphries was a publicity stunt orchestrated by E! Entertainment, Kris Jenner, and Kim Kardashian to promote the Kardashian family's brand and their subsequent television ventures; however, there was never any substantial evidence to support that claim.[43]\n\nIn April 2013, after a lengthy legal battle, Humphries and Kardashian reached a divorce settlement.[44] Their divorce was finalized on June 3, 2013.[45]\n\nNBA career statistics [ edit ]\n\nLegend GP Games played GS Games started MPG Minutes per game FG% Field goal percentage 3P% 3-point field goal percentage FT% Free throw percentage RPG Rebounds per game APG Assists per game SPG Steals per game BPG Blocks per game PPG Points per game Bold Career high\n\nRegular season [ edit ]\n\nPlayoffs [ edit ]\n\nYear Team GP GS MPG FG% 3P% FT% RPG APG SPG BPG PPG 2007 Toronto 6 0 11.5 .333 .000 .375 2.8 .2 .2 .3 1.5 2008 Toronto 3 0 0.7 .000 .000 .000 .0 .0 .0 .0 .0 2013 Brooklyn 7 0 11.9 .452 .000 .429 3.3 .1 .1 .4 4.4 2015 Washington 1 0 5.0 1.000 .000 .000 3.0 .0 .0 .0 2.0 2016 Atlanta 4 0 14.0 .464 .500 1.000 6.0 1.0 .5 1.3 9.3 2017 Atlanta 1 0 3.0 .000 .000 .000 0.0 .0 .0 1.0 0.0 Career 22 0 9.9 .449 .500 .571 3.0 .3 .2 .5 3.6\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Kris_Humphries_%2815698676076%29.jpg/220px-Kris_Humphries_%2815698676076%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Bronze_medal_icon_%28B_initial%29.svg/16px-Bronze_medal_icon_%28B_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Kris_Humphries.jpg/130px-Kris_Humphries.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Kris_Humphries_%2815698676076%29.jpg/1200px-Kris_Humphries_%2815698676076%29.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Basketball_Clipart.svg/28px-Basketball_Clipart.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Kris_Humphries_%2815698676076%29.jpg/1200px-Kris_Humphries_%2815698676076%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Kris_Humphries", "title": "Kris Humphries", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Kris_Humphries_%2815698676076%29.jpg/640px-Kris_Humphries_%2815698676076%29.jpg", "width": 640, "height": 513}, "title": "Kris Humphries - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}