{"url": "https://www.washingtonpost.com/lifestyle/style/the-case-against-bill-cosby-explained/2017/05/22/ab36e518-397b-11e7-9e48-c4f199710b69_story.html", "text": "\n\nBill Cosby faces charges of drugging and sexually assaulting a former Temple women’s basketball team official. He’s shown here leaving a pretrial hearing in July 2016. (Matt Rourke/AP)\n\nThe Bill Cosby jury trial starts Monday in Norristown, Pa. Here’s everything you need to know about the case against the 79-year-old entertainer, whose career imploded 2½ years ago as dozens of women came forward alleging he drugged and sexually assaulted them.\n\nWhat are the criminal charges against Cosby?\n\nHe faces three felony counts of “aggravated indecent assault” for allegedly drugging and sexually assaulting Andrea Constand, a former Temple University women’s basketball staffer, at his suburban Philadelphia home in early 2004. Each count carries a maximum prison sentence of 10 years.\n\n[Day One coverage: Bill Cosby’s long-awaited trial begins in a tense Pennsylvania court]\n\nWho are the possible key witnesses?\n\nAndrea Constand: No one is more important than Constand, who was 30 at the time of the alleged assault and now works as a massage therapist for private clients, including people who have cancer. The case lacks physical evidence, so much of the prosecution’s presentation to jurors will rest on her testimony. The defense cross-examination of Constand is likely to be the most significant moment in the trial.\n\n“The whole case is going to stand or fall on Miss Constand and her credibility,” says Lynne Abraham, a former Philadelphia district attorney.\n\n(Nicki DeMarco,Danielle Kunitz,Manuel Roig-Franzia/The Washington Post)\n\nGianna Constand: Andrea Constand’s mother, who recorded a telephone conversation with Cosby in 2005. During the call, the elder Constand confronted Cosby about allegedly drugging her daughter. Cosby admitted giving her pills, but declined to say what they were, instead offering to write down the information and send it to her.\n\nCosby also discussed the possibility of paying for Andrea Constand’s education. That portion of the call could be used by the defense to suggest that the Constands were making the sexual assault allegations in order to get money from the wealthy entertainer.\n\nJohn-Conrad Ste. Marthe: Cosby’s private chef, he prepared meals for Andrea Constand at the Cosby estate in suburban Philadelphia.\n\nElizabeth Loftus: A self-styled memory expert who could be an important Cosby defense witness, Loftus is a University of California-Irvine professor whose TED Talk, titled “How reliable is your memory?”, has been viewed more than 3 million times. Loftus is known for suggesting that police or psychologists can plant ideas with leading questions, and has worked on the high-profile cases of Ted Bundy, O.J. Simpson and the McMartin pre-school molestation case. Some academics, though, have criticized what they see as a lack of scientific rigor in her work. A witness for the defense in the perjury and obstruction of justice trial of the former vice presidential aide Scooter Libby, she fared poorly during a withering cross-examination by prosecutor Patrick Fitzgerald.\n\n[In the Libby case, a grilling to remember]\n\nWhy did the trial start in Pittsburgh?\n\nCosby is being prosecuted in Montgomery County, Pa., outside of Philadelphia. But his defense team by arguing that potential jurors in Montgomery County were tainted by intense pretrial publicity — particularly, Montgomery County District Attorney Kevin Steele’s frequent promises, during his 2015 campaign, to reopen the investigation into the comedian.\n\nThe defense successfully convinced the judge to select a jury from Pittsburgh, some 300 miles west in Allegheny County,\n\nHowever, Cosby’s team failed to get the trial moved out of Montgomery County. So jurors selected in Pittsburgh were bused across the state Sunday to the suburban city of Norristown, Pa., where they will be sequestered after testimony begins in the trial at the Court of Common Pleas. The case is expected to last two to three weeks.\n\n[Nearly three years and 60 accusers later, Bill Cosby goes on trial]\n\n\n\nAndrea Constand, a former Temple University women’s basketball official, says Bill Cosby offered to help her with her career, then drugged and sexually assaulted her. (Mark Blinch/Reuters)\n\nWhat about Camille?\n\nThe comedian’s wife, Camille Cosby, has not appeared at pre-trial hearings in the criminal case, but has given deposition testimony in a civil deposition lawsuit filed against her husband by some of his accusers. Sources familiar with the criminal case say she’s been actively involved in shaping strategy behind the scenes.\n\nDefendants in criminal cases often have family members appear in court as a way of humanizing themselves before the jury. Court observers will be watching closely to see if Cosby’s wife or daughters attend the trial. Cosby’s daughter, Ensa, has said that “racism” is at the root of the scandal and has said that her father is the victim of a “public lynching.”\n\n[Camille Cosby a life spent juggling the role of public figure and a desire for privacy]\n\nWhat’s the makeup of the jury?\n\nSeven men and five women have been seated on the jury, while five men and one woman will serve as alternates. Two of the jurors and two of the alternates are African American.\n\nRace was a major point of contention during jury selection. Defense attorneys accused prosecutors of systematically excluding African Americans, but the judge rejected that argument. The final percentage of African-American jurors ended up slightly exceeding the percentage of African Americans in Allegheny County.\n\nLittle information was disclosed about the jurors, but some revealed details about their lives during public questioning. Most appear to be in their 20s or 30s or middle-aged. One one juror looked to be in his 80s and entered the courtroom leaning on a cane. Another said he is a teacher and listens to NPR. Almost all the jurors who were selected said they had consumed very little news about Cosby.\n\nBut dozens of prospective jurors were dismissed because of the saturation news coverage of the case. One-third of the first pool of 100 jurors and half of the second pool of 93 jurors said they had already formed an opinion about Cosby’s guilt or innocence.\n\nThe defense was guided through three days of jury selection by JuryScope, a Minnesota-based firm founded by David Weinberg, that is best known for its work on corporate cases. One of Weinberg’s associates on the Cosby case — Carrie Mason — worked as a jury consultant on the high-profile case of Scott Peterson, a California man convicted of killing his pregnant wife, Laci.\n\nWhat’s the strongest evidence against Cosby?\n\nCosby gave extraordinary testimony in 2005 and 2006 during a civil lawsuit filed against him by Constand. (The case was eventually settled for an undisclosed amount.) The Associated Press filed a lawsuit in late 2014 to unseal the testimony and details from the full deposition were later reported by media outlets, including The New York Times and The Washington Post. Over the course of four days of questioning, Cosby admitted to acquiring Qualuudes, a powerful sedative, to give to women with whom he wanted to have sex.\n\n[Cosby’s own words provide scandalous details of his hidden life]\n\nHe also testified in sometimes cringe-inducing detail about his sexual contact with Constand, but characterized it as consensual. In the deposition, Cosby acknowledged giving pills to Constand, but said they were the over-the-counter allergy medication Benadryl.\n\nProsecutors are expected to argue that Constand would not have consented to sexual contact with Cosby because she is gay.\n\n[Bill Cosby’s legacy, recast]\n\nWhat are the biggest weaknesses of the prosecution case?\n\nThere appears to be no physical evidence to support Constand’s allegations. She was not examined by a doctor after the alleged incident. She did not contact police until a year later, and there are several inconsistencies in her statements to investigators that could be used to undercut her credibility.\n\nAnd, though the criminal case was filed just before the expiration of Pennsylvania’s statute of limitations, it will be going to trial more than 13 years after the alleged incident.\n\nWhy are the charges related to only one woman?\n\nAt least 60 women have publicly accused Cosby of rape, sexual assault or sexual harassment between the 1960s and 2000s. The statutes of limitation have expired for most of their cases, preventing the accusers from seeking criminal charges.\n\nProsecutors wanted to call 13 Cosby accusers to testify during the trial in hopes of establishing a pattern of similar behavior that would support Constand’s allegations. But, in an emphatic defeat for the prosecution, Judge Steven T. O’Neill ruled that only one other accuser would be allowed to testify.\n\nThat woman appeared on camera for a news conference in January 2015 using the pseudonym “Kacey.” She said she worked as an assistant for Cosby’s personal appearances agent at the William Morris Agency in Los Angeles. Prosecutors say Cosby drugged and sexually assaulted the woman in 1996 at the Hotel Bel-Air when she was about 35.\n\nSeveral women who have accused Cosby of drugging and sexual assault — they prefer to be called ‘survivors,” rather than “accusers” — are planning to attend the trial in support of Constand and Kacey.\n\nWill Cosby testify?\n\nDefendants are not required to testify, and Cosby said in a recent interview on SiriusXM radio that he is unlikely to testify, nor does he want to on advice from his attorneys. The one slim caveat is that Cosby is extremely adept at charming audiences, and the defense could decide that the risks of testifying would be outweighed by the benefits of having the lifelong entertainer — once known as “America’s Dad” — speak directly to the jury. Cosby also could earn sympathy points because he claims to be legally blind.\n\n\n\nBill Cosby, shown here with his attorney Brian McMonagle and his former attorney Monique Pressley, says he’s legally blind. (Matt Rourke/AP)\n\nWho are the main courtroom players?\n\nCosby has a high-powered defense team. It’s led by Brian McMonagle, a prominent Philadelphia attorney whose clients have included NBA star Allen Iverson, a Catholic archbishop and a city deputy mayor cleared of corruption charges; and Angela Agrusa, a seasoned and ultra-aggressive Los Angeles attorney who formerly headed the California litigation department for BakerHostetler, one of the nation’s largest law firms.\n\nThe prosecution is headed by Steele, a veteran prosecutor who was elected as district attorney in 2015. Steele, a Democrat, defeated Bruce Castor, a previous district attorney who made the decision not to prosecute Cosby in the Constand case in 2005.\n\nJudge O’Neill is a former Montgomery County prosecutor who has been on the bench since 2002 and was elected to a second 10-year term on the court in 2014. O’Neill has a folksy style and took pains to make prospective jurors feel comfortable during jury selection. But he can sometimes be terse, impatient and scolding with attorneys. At one point during jury selection, he snapped at Steele, the prosecutor, saying, “I was not looking for your ‘okay.’”\n\nOnce a verdict is reached, will that be the end of Cosby’s legal troubles?\n\nFar from it. Cosby has racked up a series of victories in civil cases filed against him by accusers. But many civil cases remain. He’s facing defamation lawsuits or appeals of defamation suits in Massachusetts and California, all filed by accusers who say their reputations were damaged when Cosby or his representatives said they weren’t telling the truth. He also faces a sexual battery lawsuit in California.", "images": ["https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2016/08/07/Style/Images/Bill_Cosby-9740f-2701.jpg?t=20170517", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://www.washingtonpost.com/pb/resources/img/spacer-gray.png&w=1&h=1", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2016/05/20/Style/Graphics/promocosby3b.jpg?uuid=d-3mFB6UEeaCwqfcsxMofQ", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2017/05/15/Style/Images/2015-12-30T184024Z_01_MDB03_RTRIDSP_3_PEOPLE-COSBY-RHUG-3578.jpg?uuid=ZF8UPDmcEeegWN27I8ddgg", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2017/05/15/Style/Images/Cosby_Deposition_Guide-0cee3-FHZB.jpg?uuid=zEk8NjmbEeegWN27I8ddgg", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2016/08/07/Style/Images/Bill_Cosby-9740f-2701.jpg?uuid=caLFpFznEeadL7GjVkGBoQ"], "top_img": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2016/08/07/Style/Images/Bill_Cosby-9740f-2701.jpg?t=20170517", "keywords": [], "authors": ["Manuel Roig-Franzia", "Feature Reporter", "June", "Manuel Roig-Franzia Is A Feature Writer In The Washington Post S Style Section", "Where He Profiles National Figures In The Worlds Of Politics", "The Law", "The Arts. He Previously Served As Bureau Chief In Miami For The Post'S National Staff", "In Mexico City For The Post'S Foreign Staff. He Is The Author Of A Biography Of Sen. Marco Rubio."], "canonical_link": "https://www.washingtonpost.com/lifestyle/style/the-case-against-bill-cosby-explained/2017/05/22/ab36e518-397b-11e7-9e48-c4f199710b69_story.html", "title": "The Bill Cosby trial, explained", "meta_data": {"eomportal-uuid": "ab36e518-397b-11e7-9e48-c4f199710b69", "object-hash": 1665197487, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "Cosby, Bill Cosby, Andrea Constand, Cosby trial, Bill Cosby trial, Kacey: Who are Cosby's accusers: What are the charges against Bill Cosby?, Where is the Bill Cosby trial?: When is the BillCosby trial?, Brian mcMonagle: Angela Agrusa, Who is the Bill Cosby judge?, Steven O'Neill, Who is the Bill Cosby prosecutor?, Who is Bill Cosby's defense attorney?", "news_keywords": "Cosby, Bill Cosby, Andrea Constand, Cosby trial, Bill Cosby trial, Kacey: Who are Cosby's accusers: What are the charges against Bill Cosby?, Where is the Bill Cosby trial?: When is the BillCosby trial?, Brian mcMonagle: Angela Agrusa, Who is the Bill Cosby judge?, Steven O'Neill, Who is the Bill Cosby prosecutor?, Who is Bill Cosby's defense attorney?", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@RoigFranzia"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/lifestyle/style/the-case-against-bill-cosby-explained/2017/05/22/ab36e518-397b-11e7-9e48-c4f199710b69_story.html", "image": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2016/08/07/Style/Images/Bill_Cosby-9740f-2701.jpg?t=20170517", "title": "The Bill Cosby trial, explained", "description": "Breaking down the charges before testimony begins June 5 in the trial of “America’s Dad”"}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered", "opinion": "false", "author": "https://www.facebook.com/manuel.roigfranzia"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "description": "Breaking down the charges before testimony begins June 5 in the trial of “America’s Dad”", "robots": "index,follow", "theme": "normal", "author": "https://www.facebook.com/manuel.roigfranzia"}, "movies": [], "publish_date": 1495407600.0, "source": "https://www.washingtonpost.com", "summary": ""}