{"url": "https://en.wikipedia.org/wiki/Lin-Manuel_Miranda", "text": "American composer, lyricist, and actor\n\nLin-Manuel Miranda ( ; born January 16, 1980)[1] is an American composer, lyricist, actor, and filmmaker. He is known for creating the Broadway musicals Hamilton (2015) and In the Heights (2005), and the soundtrack of Disney's Encanto (2021). His accolades include three Tony Awards, three Grammy Awards, two Laurence Olivier Awards, two Primetime Emmy Awards, an Annie Award, a MacArthur Fellowship Award, a Kennedy Center Honor, and a Pulitzer Prize.\n\nA graduate of Wesleyan University in Connecticut, Miranda made his Broadway debut in the 2008 musical In the Heights, in which he starred and wrote the music and lyrics. The production was a critical and commercial success, winning the Tony Awards for Best Musical and Best Original Score,[2] and the Grammy Award for Best Musical Theater Album.[3] The stage musical was adapted into a film released in June 2021.[4] Miranda gained wider recognition for writing the script, music, and lyrics for Hamilton, which has been acclaimed as a pop culture phenomenon since its 2015 Broadway premiere.[5] It earned the Pulitzer Prize for Drama and was nominated for a record 16 Tony Awards and won 11, including Miranda's first win for the Best Book of a Musical. The Hamilton cast recording spent ten weeks atop Billboard's Top Rap Albums chart and became the eleventh-biggest album of the 2010s.[6] The Hamilton Mixtape, a cover album by Miranda, further reached number one on the Billboard 200.\n\nA frequent collaborator of the Walt Disney Company, Miranda has written original songs for the studio, which has garnered him two nominations for the Academy Award for Best Original Song (\"How Far I'll Go\" and \"Dos Oruguitas\"). He worked on the 2016 animated musical Moana, and wrote the story and music for Encanto—a widespread critical and commercial success; its song \"We Don't Talk About Bruno\" broke various records, marked Miranda's first-ever number-one song on the US Billboard Hot 100 and the UK Singles charts, and cemented his mainstream fame.[7][8] He starred as Jack in the musical fantasy Mary Poppins Returns (2018), for which he was nominated for a Golden Globe Award for Best Actor – Motion Picture Musical or Comedy. For his performance in the Disney+ live stage recording of Hamilton released in 2020, he received Golden Globe and Primetime Emmy Award nominations.\n\nMiranda debuted as a film director with Tick, Tick...Boom! (2021), a biographical musical drama focusing on Jonathan Larson, starring Andrew Garfield as Larson. He also had a voice role in the animated film Vivo, released in 2021.[9] His television work includes recurring roles on The Electric Company (2009–2010) and His Dark Materials (2019). Miranda hosted Saturday Night Live in 2016 and had a guest role on Curb Your Enthusiasm in 2018, for which he was nominated twice for the Primetime Emmy Award for Outstanding Guest Actor in a Comedy Series. He has been politically active on behalf of Puerto Rico.[10] Miranda met with politicians in 2016 to speak out in favor of debt relief for Puerto Rico[10] and raised funds for rescue efforts and disaster relief after Hurricane Maria in 2017.[11]\n\nEarly life and education [ edit ]\n\nLin-Manuel Miranda was born on January 16, 1980, in New York City to Dr. Luz Towns-Miranda, a clinical psychologist, and Luis Miranda Jr., a Democratic Party consultant.[1][note 1] The name \"Lin-Manuel\" was inspired by a poem about the Vietnam War, Nana roja para mi hijo Lin Manuel, by the Puerto Rican writer José Manuel Torres Santiago.[13][14] He was raised in the neighborhood of Inwood.[1][15][16][17] He is of Puerto Rican descent.[18][19] During childhood and his teens, he spent at least one month each year with his grandparents in Vega Alta, Puerto Rico.[20][21] Miranda has one older sister, Luz, who is the Chief Financial Officer of the MirRam Group, a strategic consulting firm in Government and Communications.[22]\n\nMiranda attended Hunter College Elementary School and Hunter College High School.[23] Among his classmates was journalist Chris Hayes, who was Miranda's first director when Miranda starred in a school play described by Hayes as \"a 20-minute musical that featured a maniacal fetal pig in a nightmare that [Miranda] had cut up in biology class\".[24] His classmates also included rapper Immortal Technique, who bullied Miranda, although the two later became friends.[25][26] Miranda began writing musicals at school.[27]\n\nAs a student, Miranda wrote the earliest draft of what would become his first Broadway musical, In the Heights, in 1999, his sophomore year of college at Wesleyan University.[27] After the show was accepted by Wesleyan's student theater company, Second Stage, Miranda added freestyle rap and salsa numbers, and the show was premiered there in 1999.[21] Miranda wrote and directed several other musicals at Wesleyan and acted in many other productions, ranging from musicals to William Shakespeare. He graduated from Wesleyan in 2002.[21][28]\n\nCareer [ edit ]\n\nTheatre [ edit ]\n\n2002–2010: In the Heights [ edit ]\n\nIn 2002, Miranda and John Buffalo Mailer worked with director Thomas Kail to revise In the Heights.[21][12][27] Playwright Quiara Alegría Hudes joined the team in 2004.[29][27] After premiering in Connecticut in 2005 and opening at the 37 Arts Theater off-Broadway in 2007, the musical went to Broadway, opening in March 2008.[21] It was nominated for 13 Tony Awards, winning four, including Best Musical and Best Original Score.[2][27] It also won the Grammy Award for Best Musical Theater Album.[3] Miranda's performance in the leading role of Usnavi earned him a nomination for the Tony Award for Best Actor in a Musical. Miranda left the cast of the Broadway production on February 15, 2009.[30]\n\nMiranda reprised the role when the national tour of In the Heights played in Los Angeles from June 23 to July 25, 2010.[31][32] He again joined the tour in San Juan, Puerto Rico.[33] Miranda rejoined the Broadway cast as Usnavi from December 25, 2010, until the production closed on January 9, 2011, after 29 previews and 1,185 regular performances.[34]\n\nMiranda created other work for the stage during this period. He wrote Spanish language dialogue and worked with Stephen Sondheim to translate into Spanish song lyrics for the 2009 Broadway revival of West Side Story.[35][36][27] During this time, he also performed at bar and bat mitzvahs.[27] In 2008, he was invited by composer-lyricist Stephen Schwartz to contribute two new songs to a revised version of Schwartz and Nina Faso's 1978 musical Working, which opened in May 2008 at the Asolo Repertory Theatre in Sarasota, Florida.[37]\n\nDuring these years, Miranda worked as an English teacher at his former high school, wrote for the Manhattan Times as a columnist and restaurant critic, and composed music for commercials.[38]\n\nIn 2003, Miranda co-founded Freestyle Love Supreme,[39] a hip hop improv group that has toured the Edinburgh Festival Fringe, as well as the Aspen, Melbourne and Montreal Comedy Festivals. The group created a limited television series for Pivot in 2014[40] and made its Broadway debut[41] on October 2, 2019, at the Booth Theatre in a self-titled show to positive reviews.[42]\n\n2011–2014: Bring It On and other theatrical work [ edit ]\n\nMiranda co-wrote the music and lyrics for Bring It On: The Musical with Tom Kitt and Amanda Green. Bring It On premiered at the Alliance Theatre in Atlanta, Georgia in January 2011.[43] The musical began a US national tour on October 30, 2011, in Los Angeles, California.[44][45] It played a limited engagement on Broadway at the St. James Theatre, beginning previews on July 12, and officially opening on August 1, 2012. It closed on December 30, 2012. It was nominated for Tony Awards in the categories of Best Musical and Best Choreography.[46]\n\nIn February 2012, Miranda appeared in Merrily We Roll Along, in the role of Charley, in an Encores! staged concert at New York City Center.\n\nHis theatrical achievements in 2014 included an Emmy Award for the song \"Bigger!\", which he and Kitt co-wrote for the opening number at the 67th Tony Awards.[47]\n\nMiranda wrote music and lyrics for the one-act musical 21 Chump Street, and performed as narrator for the show's single performance at the Brooklyn Academy of Music on June 7, 2014, which was broadcast on National Public Radio's This American Life on June 20, 2014.[48] Later that month, he starred in the June 2014 Encores! revival of Jonathan Larson's Tick, Tick... Boom!, under the artistic direction of Jeanine Tesori. The show was directed by Oliver Butler.[49]\n\nEarlier in 2014, he guest starred in a show by comedy duo The Skivvies.[50]\n\n2015–2016: Hamilton [ edit ]\n\nHamilton, 2016 Miranda in, 2016\n\nWhile on a vacation in 2008, Lin Manuel Miranda read Ron Chernow's biography of Alexander Hamilton and, inspired by the book, wrote a rap about Hamilton that he performed for the White House Evening of Poetry, Music, and the Spoken Word on May 12, 2009, accompanied by Alex Lacamoire. Miranda later said he spent a year writing the Hamilton song \"My Shot\", revising it countless times for every verse to reflect Alexander Hamilton's intellect.[51][13] By 2012, Miranda was performing an extended set of pieces based on the life of Hamilton, which he then referred to as the Hamilton Mixtape. The New York Times called it \"an obvious game changer\".[52]\n\nHamilton: An American Musical premiered off-Broadway at The Public Theater in January 2015, directed by Thomas Kail. Miranda wrote the book and score and starred as the title character.[53][54] The show received highly positive reviews,[55] and its engagement was sold out.[56] Chernow and Miranda received the 2015 History Makers Award from the New York Historical Society for their work in creating the musical.[57] The show began previews on Broadway in July 2015 at the Richard Rodgers Theatre and officially opened on August 6, 2015,[58] earning positive reviews.[59] On the first night of Hamilton previews, over 700 people lined up for lottery tickets.[60] The Hamilton ticket lottery evolved into Ham4Ham, a series of outdoor mini-performances for lottery participants that was hosted daily by Miranda and cast members for over a year, until August 31, 2016.[61] Miranda earned a 3% royalty on each performance of Hamilton, earning him $12.7 million by July 2017.[62][63] Hamilton won the Tony Award for Best Musical; Miranda won the Tony Awards for Best Original Score and Best Book of a Musical and received a nomination for Best Actor in a Musical. Miranda won the Pulitzer Prize for Drama for the musical, and the Hamilton cast album won the Grammy Award for Best Musical Theater Album. In May 2016, for his work in the role of Alexander Hamilton, Miranda received the Drama League Distinguished Performance Award.[64]\n\nOn March 15, 2016, members of the cast of Hamilton performed at the White House and hosted workshops; Miranda performed freestyle rap from prompts held up by President Obama.[65] In April 2016, Miranda and Jeremy McCarter published Hamilton: The Revolution, a book describing Hamilton's journey from conception to Broadway success and discussing the cultural revolution that permeates the show.[66]\n\nMiranda gave his last performance in Hamilton on July 9, 2016,[67] but vowed to return to the show.[68] Miranda reprised the role of Alexander Hamilton for a three-week run in Puerto Rico January 11–27, 2019, for which the engagement was sold out in three hours in November 2018.[69] In a review, Chris Jones praised \"deeper on-stage emotions\" in Miranda's reprisal, as well as improved vocal and dance technique than on Broadway.[70]\n\nA documentary about the creation of the show, Hamilton's America, featuring Miranda, premiered at the New York Film Festival on October 1, 2016, and first aired on PBS' Great Performances series on October 21, 2016.[71][72] A taping of the OBT version of Hamilton was released on Disney+ on July 3, 2020.\n\nOn January 24, 2016, Miranda performed the offstage cameo role of Loud Hailer in the Broadway production of Les Misérables,[73] fulfilling his childhood dream of being in the show, as it was the first production he ever saw on Broadway.[74]\n\nFilm [ edit ]\n\nEarly acting roles [ edit ]\n\nMiranda appeared in a small role in the Walt Disney Pictures live-action film The Odd Life of Timothy Green (2012).[75][76]\n\n2015–present: Disney projects [ edit ]\n\nMiranda interviewed with Disney in the winter of 2013, and submitted a six-song demo package to Walt Disney Animation Studios.[77] This began a series of collaborations with the company:\n\nIn the Heights (2021) [ edit ]\n\nOn November 7, 2008, Universal Pictures announced that they planned to adapt In the Heights as a feature film for release in 2011.[101] However, the project was canceled in March 2011,[102] reportedly due to the fact Universal was looking for a \"bankable Latino star\" like Shakira or Jennifer Lopez instead of unknown actors.[103] In January 2012, Miranda stated that the film adaptation was back under discussion;[104] in May 2016, it was announced that Miranda would co-produce the film with Harvey Weinstein and backing from The Weinstein Company.[105] On June 10, 2016, Jon M. Chu came on board to direct the film adaptation of the musical.[106] In the aftermath of numerous sexual misconduct allegations made against Weinstein, his producer credit on the film was removed, with the rights to the film eventually auctioned off to Warner Bros. for $50 million.[107] While Miranda originated the role of Usnavi, he felt he was too old to star as Usnavi in the film adaptation. Ultimately, Miranda played the smaller role of Piraguero, the \"Piragua Guy,\" in the film. He was quoted as saying the Broadway production was \"...a miraculous experience. I went from substitute teacher to Broadway composer. I will never make a leap that big again in my life. I was very content to let Anthony Ramos and this incredible cast have their own experience.\"[108] Miranda also served as producer and acted alongside Anthony Ramos,[109] Corey Hawkins,[110] Leslie Grace,[111] and Jimmy Smits.[112] The film was set for release on June 26, 2020,[113] but was pulled from the schedule due to the COVID-19 pandemic's impact on the film industry.[114] It was released in theaters and temporarily on HBO Max on June 10, 2021.[115]\n\nVivo (2021) [ edit ]\n\nMiranda stars as the titular character and provided eleven songs for Vivo, a Sony Pictures Animation film directed by Kirk DeMicco which was released on Netflix in August 2021.[116][117][118]\n\nImagine Entertainment announced in July 2018 that Miranda would make his debut as a film director with an adaptation of Jonathan Larson's semi-autobiographical musical Tick, Tick... Boom!, to be scripted by Dear Evan Hansen librettist Steven Levenson.[119][120] Miranda produced the film alongside Ron Howard and Brian Grazer:[120] it was released on Netflix in 2021.[121][122]\n\nUpcoming projects [ edit ]\n\nMiranda agreed in 2016 to serve as executive producer and composer of Lionsgate's film adaptation of The Kingkiller Chronicle by Patrick Rothfuss, as well as a tie-in television series.[123][124] In 2022 it was revealed that he was no longer attached to the project.\n\nTelevision [ edit ]\n\n2007–2013: Early roles [ edit ]\n\nMiranda also worked in film and television. In 2007, he made a small appearance on the television series The Sopranos in the episode \"Remember When\",[125] and in 2009, he played Juan \"Alvie\" Alvarez, Gregory House's roommate in a psychiatric hospital, in the two-hour season six premiere episode of House; he returned to the role in May 2010. For Sesame Street, he occasionally played roles and sang the theme song to the recurring segment Murray Has a Little Lamb.[126] He was a composer and actor on the 2009 revival of The Electric Company[127][128] and appeared in the CollegeHumor sketch \"Hardly Working: Rap Battle\", playing himself working as an intern and rapper.[129]\n\nHe played several television roles during this period. He appeared on the TV series Modern Family in the 2011 episode \"Good Cop Bad Dog\".[130] In 2013, he played the recurring role of Ruben Marcado in the NBC drama Do No Harm.[131] He later appeared in the CBS sitcom How I Met Your Mother, in an all-verse episode titled \"Bedtime Stories\" that aired in November 2013.[132]\n\n2016–2021: Comedy roles and other projects [ edit ]\n\nOn April 24, 2016, on the TV show Last Week Tonight with John Oliver, at the end of a segment about the debt crisis in Puerto Rico, Miranda performed an emotional rap about allowing the island to restructure its debt.[133] Miranda hosted Saturday Night Live on October 8, 2016, and played himself in two episodes of Curb Your Enthusiasm in 2017, receiving Emmy Award nominations for both appearances.[134]\n\nMiranda performed the theme song for the Netflix original series The Magic School Bus Rides Again, the revival and sequel series of the 1994 series The Magic School Bus. He played the part of Amy's brother (David Santiago) in the episode \"The Golden Child\" in Brooklyn Nine-Nine. On July 29, 2019, it was announced that Miranda had teamed with TV producer Norman Lear to make an American Masters documentary about the life of Puerto Rican actress Rita Moreno, titled Rita Moreno: Just a Girl Who Decided to Go for It.[135] It premiered at the 2021 Sundance Film Festival. Miranda, in collaboration with Brittany Howard, Daveed Diggs, Kristen Anderson-Lopez, and Robert Lopez wrote the lyrics for the song \"Checks and Balances\", which was sung by Benjy Brooke for the 2021 Netflix animated series We the People.[136]\n\nIn 2019, Miranda served as an executive producer on the FX limited series Fosse/Verdon based on the relationship of Broadway dancer, choreographer, and director Bob Fosse and his wife dancer Gwen Verdon. Miranda also made a brief appearance playing Roy Scheider from All That Jazz. The series won critical acclaim, and Miranda was nominated for the Primetime Emmy Award for Outstanding Limited or Anthology Series as an executive producer.\n\nHis Dark Materials (2019) [ edit ]\n\nMiranda was cast as Lee Scoresby in the BBC series television adaptation of His Dark Materials (2019).[137] Daniel Fienberg of The Hollywood Reporter praised Miranda in his review writing, \"[While] I appreciate that Miranda feels initially miscast as Pullman’s paragon of cowboy American masculinity...[he] forces you to reconstruct an image of American manliness around him, making him exactly what the series needs\".[138]\n\nPersonal life [ edit ]\n\nFamily [ edit ]\n\nMiranda (right) with his family upon receiving a star on the Hollywood Walk of Fame in 2018. Nadal is in the center.\n\nMiranda married Vanessa Nadal, a high school friend, in 2010.[139] At the wedding reception, Miranda, along with the wedding party, performed the Fiddler on the Roof song \"To Life\".[140] Nadal was a lawyer at the law firm Jones Day.[141] Miranda and Nadal's first son, Sebastian, was born in November 2014.[142] Their second son, Francisco, was born in February 2018.[143] His son Sebastian was named after the Jamaican crab from The Little Mermaid, one of his favorite films, the reason for which he took the job of composing the music for live-action version.[144] Sebastian was the first name listed in the Production babies credits of Moana, for which Miranda wrote the songs.[145]\n\nMiranda discovered that he is related to artists Residente and iLe of Calle 13 during a 2009 concert by the group in San Juan, Puerto Rico, where Miranda was invited to perform. Backstage, the mother of Residente and ILE revealed their connection to Gilberto Concepción de Gracia, founder of the Puerto Rican Independence Party.[146][147][148] Miranda and Residente have since confirmed the relationship.[149][150][151][152] In 2017, Miranda performed on the opening track of Residente's self-titled debut album.[153]\n\nMiranda is cousins with professional baseball player José Miranda.[154]\n\nActivism [ edit ]\n\nAfter a meeting with President Barack Obama in March 2016,[155] Miranda joined U.S. Senators Kirsten Gillibrand, Chuck Schumer, Elizabeth Warren, and other Democratic lawmakers to call for congressional action to back a Senate bill in Washington that would allow Puerto Rico to declare bankruptcy and significantly ease its $70 billion government-debt burden.[156] Miranda was particularly active in the wake of Hurricane Maria's devastation in Puerto Rico,[10][11] and by December 2017, proceeds from his song \"Almost Like Praying\" helped the Hispanic Federation raise $22 million for rescue efforts and disaster relief.[157][158]\n\nMiranda uses proceeds from Hamilton to support Graham Windham, a nonprofit adoption agency founded by Eliza Schuyler Hamilton.[159] Miranda performs at their fundraising gala benefits in New York City and helps to fundraise for children in foster care.[160]\n\nHe performed \"Found/Tonight\" with Ben Platt at the March for Our Lives anti-gun violence rally in Washington, D.C., on March 24, 2018.[161][162]\n\nIn order to raise money for Puerto Rico's reconstruction after being struck by hurricanes Irma and María, including at least $15 million to be channeled through the Flamboyán Foundation, Lin-Manuel decided to take, and once again play the protagonist role in Hamilton to his father's native Puerto Rico. The Miranda family donated approximately $1 million to bring the University of Puerto Rico theater up to par in order to use it as the venue for the musical's performance in January 2018. After tickets sold out in two hours for the three-week run, producers decided to move out of the university venue due to warnings of potential disruptions by a university workers' labor organization, and move the already-installed set to the Luis A. Ferré Performing Arts Center in Santurce, where the performances ran from January 11 to January 27. The production donated additional hundreds of thousands of dollars in improvements to the Ferré Performing Arts Center.[163]\n\nIn 2016, Miranda advocated for the passing of the Puerto Rico Oversight, Management, and Economic Stability Act (PROMESA), a law setting out to restructure the debt of Puerto Rico following Hurricane Maria.[164] The law led to budget cuts resulting in the closure of over 200 public schools, cuts to government labor benefits, and budget cuts at the University of Puerto Rico (UPR). It was met with protests, with UPR shutting down due to student strikes over the measures in 2017. Miranda became a target of criticism, especially when he performed Hamilton in Puerto Rico, given his lobbying on the bill as well as the musical's subject matter of the United States which many Puerto Ricans see as an oppressor of the island.[165] During the post show, Miranda met with protestors explaining that he had seen PROMESA as the only bipartisan option for the debt crisis previously, he does not support the austerity measures introduced and that he believes full debt-relief should now be pursued.[166] Subsequently, he has argued for full debt-relief for the island[167] and noted that the 2016 act has not led to the promised relief.[168]\n\nAwards and honors [ edit ]\n\nAmong his numerous accolades, Miranda has won a Pulitzer Prize, three Tony Awards, three Grammys, two Emmys, and two Olivier Awards and has been nominated for two Academy Awards. In 2015, he was the recipient of a Genius Grant from the MacArthur Fellows Program. In 2016, Time magazine included Miranda in its annual Time 100 as one of the \"Most Influential People in the World\" and he received a star on the Puerto Rico Walk of Fame.[170][171] Miranda received a star on the Hollywood Walk of Fame on November 30, 2018.[172] In December 2018, he received the Kennedy Center Honors for creating Hamilton.[173]\n\nIn 2015, Miranda was the recipient of Smithsonian Magazine's American Ingenuity Award in the History category.[174] In 2019, Smithsonian National Portrait Gallery awarded Miranda the Portrait of a Nation prize.[175]\n\nHonorary degrees\n\nMiranda received an honorary degree in 2009 from Yeshiva University in Washington Heights, Manhattan, becoming the youngest person to receive an honorary degree from that university.[176] Ed Koch, former mayor of New York City, presented Miranda with the degree.[177]\n\nHe received the honorary degree of Doctor of Humane Letters in 2015 from his alma mater, Wesleyan University,[178] and gave their commencement address.[179] In May 2016, he received an honorary Doctorate of the Arts from the University of Pennsylvania and gave the commencement speech.[180] In July 2016, The University of Puerto Rico approved to grant him the degree of doctor honoris causa.[181] In July 2022, he received an honorary doctorate from the Royal Academy of Music in London, England[182]\n\nWork [ edit ]\n\nTheater [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nWeb series [ edit ]\n\nYear Title Role Notes 2020 Some Good News Self Episode 2[192] 2020 LUNCH DOODLES with Mo Willems! Self Episode 10\n\nBibliography [ edit ]\n\nBooks [ edit ]\n\nHamilton: The Revolution (2016) with Jeremy McCarter\n\n(2016) with Jeremy McCarter Gmorning, Gnight!: Little Pep Talks for Me & You (2018) with Jonny Sun\n\n(2018) with Jonny Sun In the Heights: Finding Home (2021) with Quiara Alegría Hudes and Jeremy McCarter\n\nArticles [ edit ]\n\n\"Stop the Bots from Killing Broadway\", The New York Times (2016) [193]\n\n(2016) \"Give Puerto Rico Its Chance to Thrive\", The New York Times (2016)[194]\n\nDiscography [ edit ]\n\nCast recordings [ edit ]\n\nSoundtracks [ edit ]\n\nOther albums [ edit ]\n\nThe Hamilton Mixtape (2016) (Composer, lyricist, producer, vocals) (Atlantic)\n\n(2016) (Composer, lyricist, producer, vocals) (Atlantic) The Hamilton Instrumentals (2017) (Composer, producer) (Atlantic)\n\nSingles [ edit ]\n\nAudiobook narration [ edit ]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ [12] Luis Miranda advised New York City mayor Ed Koch", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/P_culture.svg/21px-P_culture.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Audio_a.svg/21px-Audio_a.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/19px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Flag_of_New_York_City.svg/21px-Flag_of_New_York_City.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Lin-Manuel_Miranda_during_an_interview%2C_March_2022_%283%29_%28croppped%29.jpg/220px-Lin-Manuel_Miranda_during_an_interview%2C_March_2022_%283%29_%28croppped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Lin-Manuel_Miranda_Walk_of_Fame_star_ceremony_%2846074095722%29.jpg/220px-Lin-Manuel_Miranda_Walk_of_Fame_star_ceremony_%2846074095722%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Flag_of_Puerto_Rico.svg/21px-Flag_of_Puerto_Rico.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Lin-Manuel_Miranda_in_Hamilton.jpg/220px-Lin-Manuel_Miranda_in_Hamilton.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/8/87/Lin-Manuel_Miranda_during_an_interview%2C_March_2022_%283%29_%28croppped%29.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Nuvola_apps_kaboodle.svg/16px-Nuvola_apps_kaboodle.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/8/87/Lin-Manuel_Miranda_during_an_interview%2C_March_2022_%283%29_%28croppped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lin-Manuel_Miranda", "title": "Lin-Manuel Miranda", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Lin-Manuel_Miranda_during_an_interview%2C_March_2022_%283%29_%28croppped%29.jpg/640px-Lin-Manuel_Miranda_during_an_interview%2C_March_2022_%283%29_%28croppped%29.jpg", "width": 640, "height": 729}, "title": "Lin-Manuel Miranda - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}