{"url": "http://fortune.com/2017/04/05/shia-labeouf-movie-uk-tickets/", "text": "To say Shia LaBeouf’s latest film has had an uneventful theatrical run would be an understatement.\n\nThe actor’s Man Down, a drama about a U.S. Marine returning home from war, had a limited release in U.S. theaters in December that ultimately made less than half a million dollars domestically after opening to mostly poor reviews. But that domestic total practically qualifies as blockbuster status compared to how the film was received on the other side of the pond.\n\nThe movie, which also stars Kate Mara and Jai Courtney, opened an extremely limited run in just one U.K. theater by selling just a single ticket in its debut, according to several reports. The Hollywood Reporter added on Wednesday that the film eventually improved on that total by selling another pair of tickets at that same theater in the U.K. town of Burnley, bringing Man Down‘s total box office grosses in the country to-date to just three ticket sales. Considering that the local theater’s owner told The Hollywood Reporter that she doesn’t expect to sell any more tickets for the film, Man Down could end its theatrical run in the country this week with only about $26 in sales.\n\nThe movie was distributed by an arm of Lionsgate.\n\nTo be fair to LaBeouf, the actor has appeared in a number of high-grossing movies during a Hollywood career that already spans more than two decades. Topping that list would be LaBeouf’s lead roles in three films from Paramount’s Transformers franchise—three movies that grossed a total of nearly $2.7 billion worldwide between 2007-2011.\n\nIt’s fair to say that LaBeouf is at a stage in his career where he tends to opt for roles in more small-budget, independent movies—though he also had a supporting role in the 2014 World War II drama Fury, opposite Brad Pitt. Fury grossed $211 million at the global box office.\n\nLast year, LaBeouf starred in the coming-of-age drama American Honey, released by independent studio A24. The movie was very well-received by critics but went on to earn just $1.8 million at the box office, including roughly $570,000 in the U.K., according to Box Office Mojo.\n\nGet Data Sheet, Fortune‘s technology newsletter.\n\nMeanwhile, Man Down is far from the only recent film with high-profile stars to see its U.K. box office sales barely register as a blip. Box Office Mojo’s tracking data for movie ticket sales across the U.K., Ireland, and Malta shows that a drama starring Richard Gere and Dakota Fanning called The Benefactor grossed only $35 in those regions last year. Cell, a horror movie starring John Cusack and Samuel L. Jackson, took in only $51 in the same countries.", "images": ["https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1242585998-e1665028070836.jpg?w=256&q=75", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243767517-e1665076497696.jpg?w=256&q=75", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://content.fortune.com/wp-content/uploads/2017/04/488302688.jpg?resize=1200,600", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243581035-e1665068106964.jpg?w=256&q=75"], "top_img": "https://content.fortune.com/wp-content/uploads/2017/04/488302688.jpg?resize=1200,600", "keywords": [], "authors": [], "canonical_link": "https://fortune.com/2017/04/05/shia-labeouf-movie-uk-tickets/", "title": "Shia LaBeouf’s New Movie Only Sold 3 Tickets in the U.K.", "meta_data": {"viewport": "width=device-width", "msapplication-TileColor": "#ffc40d", "theme-color": "#ffffff", "description": "The new Afghanistan War drama starring Shia LaBeouf was released in only one U.K. theater after earning less than $500,000 in the U.S.", "keywords": "shia labeouf, kate mara, jai courtney, john cusack, samuel l jackson, richard gere, dakota fanning, man down, movies, hollywood, hollywood box office, man down box office, man down ticket sales, UK, U.K., england, united kingdom, shia labeouf ticket sales, shia labeouf box office, transformers, american honey, fury, lionsgate", "og": {"url": "https://fortune.com/2017/04/05/shia-labeouf-movie-uk-tickets/", "type": "article", "title": "Shia LaBeouf's New Movie Only Sold 3 Tickets in the U.K.", "description": "'Man Down' was only released in one theater in England.", "site_name": "Fortune", "image": "https://content.fortune.com/wp-content/uploads/2017/04/488302688.jpg?resize=1200,600", "width": 1024, "height": 683}, "twitter": {"card": "summary_large_image", "title": "Shia LaBeouf's New Movie Only Sold 3 Tickets in the U.K.", "description": "'Man Down' was only released in one theater in England.", "image": "https://content.fortune.com/wp-content/uploads/2017/04/488302688.jpg?resize=1200,600", "url": "https://fortune.com/2017/04/05/shia-labeouf-movie-uk-tickets/"}, "next-head-count": 32}, "movies": [], "publish_date": 1491346800.0, "source": "http://fortune.com", "summary": ""}