{"url": "http://www.wionews.com/world/entertainment-demi-lovato-no-longer-cares-what-the-haters-say-about-her-swimsuit-instagrams-29729?amp", "text": "Singer Demi Lovato does not take trolls to heart and this she revealed in the latest Ellen DeGeneres show.\n\nCOMMERCIAL BREAK\n\nSCROLL TO CONTINUE READING\n\nTalking to the TV host Ellen, Demi said, \"I've been working on myself for the past year, more so than I've ever worked on myself. I've really surrendered to the process of just learning to love yourself, and I feel like it shows through my pictures.\"\n\nDemi spoke about posting more number of photos of self in a bikini on Instagram and said, \"I post more bathing suit pictures online. I want to show my fans that it's possible that they can get to that self-love too.\"\n\nHowever, what used to pull her down earlier doesn't affect her anymore.\n\nCommenting on the haters, she said, \"I've taken away the power from the negative comments and the haters by not listening to them and if I do see it, I just feel sorry for them, because who leaves a negative comment on somebody's profile on the internet? You have to be kind of sad to do that. I've taken away the power, and it just feels great.\"\n\nWhile Demi admits she's made lots of progress, she's still a bit self-conscious about one swimsuit photo she posted on January 4.\n\nThis is the photo she is talking about:\n\nShe went on to add: \"I actually was very hesitant about posting that because I didn't love my legs in it. You know every time you look at a picture of yourself you critique it. I'm a perfectionist. I decided to post it anyway because I thought, ‘You know what, it's me, it's who I am and I love my body, so I'm just going to post it.\"\n\n\"I posted it because I look so happy,\" Demi summed up her feeling before adding \"That's what I love about that picture.\"", "images": ["https://cdn.wionews.com/sites/default/files/favicon.ico"], "top_img": "https://cdn.wionews.com/sites/default/files/favicon.ico", "keywords": [], "authors": [], "canonical_link": "https://www.wionews.com/world/entertainment-demi-lovato-no-longer-cares-what-the-haters-say-about-her-swimsuit-instagrams-29729", "title": "Demi Lovato no longer cares what the haters say about her swimsuit Instagrams", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "keywords": "demi lovato,singer,body shaming,Instagram,swimsuit,bikini photos,", "news_keywords": "demi lovato,singer,body shaming,Instagram,swimsuit,bikini photos,", "robots": "max-image-preview:large"}, "movies": [], "publish_date": null, "source": "http://www.wionews.com", "summary": ""}