{"url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DisposingOfABody", "text": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DisposingOfABody\n\nRobert Boyd, Very Bad Things \"Take away the horror of the situation. Take away the tragedy of her death. Take away all the moral and ethical considerations you've had drummed into you since childhood, and what are you left with? A 105 lb. problem.\"\n\nAdvertisement:\n\nFollowing a death, either accidental or deliberate, no matter how skilfully the responsible party covers it up, there remains the problem of disposing of the most obvious and most damning piece of evidence for the crime: the body itself. (There have been jurisdictions where no corpse means no murder, and, even where this isn't the case, the lack of a body makes the investigation and prosecution much harder.)\n\nA well-designed Death Trap may include its own way to eliminate the victim's corpse, thus combining the two tropes.\n\nThere are numerous popular methods for doing this:\n\nA common way to indicate that a bad guy is not to be messed with is if they have an original and well-thought-through method in place to entirely obliterate a human body if needed. This indicates either that they're Crazy-Prepared, or that it's something they frequently find themselves having to do.\n\nPretty much any action movie with a significant body count won't even bother with this trope; the exception is if it's supposed to be taking place under The Masquerade, in which case The Men in Black may send in a Cleanup Crew to do the job.\n\nSee Bury Me Not on the Lone Prairie, in which any post-mortem hijinks are the direct request of the deceased, and Of Corpse He's Alive, when someone tries to pretend a dead body... isn't.\n\nContrast Dead Guy on Display, when the body is deliberately put somewhere it will be seen, often to send a message to the person who finds it.\n\nThis is a Death Trope; spoilers ahoy.\n\nExamples:\n\nopen/close all folders\n\nAdvertising\n\nA Doritos ad has a man see his dog burying something, which he quickly recognizes as the family cat's collar. Then the dog is up in his face, growling, and pushes a bag of Doritos with a note reading \"You didn't see nuthin\" towards him. At the end of the ad, we hear the man's wife asking \"Have you seen the cat?\"; the man looks up and sees the dog, outside the door, another bag of Doritos in his mouth.\n\nAnime & Manga\n\nComic Books\n\nFan Fiction\n\nFilms — Animated\n\nInjustice (2021). After finding the US President is behind the kidnapping of Superman's father, Batman goes to warn him not to piss the Man of Steel off as he's dropped his Thou Shalt Not Kill rule. The President says Superman wouldn't dare kill him as it would turn the country against Superman. Batman retorts that he'd just disappear as \"it would be difficult to find your body on Saturn.\"\n\nThe Simpsons Movie has a gag where dumping in Lake Springfield was prohibited just as Fat Tony and his goons were about to dump a bag with a dead body inside into it. Fat Tony: Very well, I shall put my yard trimmings in a car compactor. Lou: Chief, I think there was a dead body in there. Chief Wiggum: I thought so too until he said \"yard trimmings\". You gotta learn to listen, Lou.\n\nFilms — Live-Action\n\nLiterature\n\nLive-Action TV\n\nMusic\n\nThe Dixie Chicks \"Goodbye Earl\" uses a tarp and a remote, rural lake to get rid of Wanda's abusive ex-husband.\n\nThe music video for \"Lay It Down (Saturday Night)\" by Samantha Fish features Fish in the woods, digging a grave for the body of a man who tried to cheat her in a poker game.\n\n\"Dead Body Disposal\" by Necro gives various advice on how to dispose of a body and make it harder to find.\n\nGrupa Operacyjna: \"Pomocy\" has Mieszko considering getting rid of his ex-patient by throwing her out a window, but decides against it as she wouldn't fit in it.\n\n\"Arthur, où t'as mis le corps ?\" (\"Arthur, where didja put the body ?\"), written by Boris Vian and sung by Serge Reggiani, starts off like this: a band of thug murder an antiquarian to steal his stock. One of them, Arthur, is tasked with disposing of the body. Problem is, he can't manage to remember what he's done of it.\n\nWarrant's \"Uncle Tom's Cabin\" has the protagonist and his eponymous uncle witnessing two Dirty Cops disposing of two people they murdered by throwing them in the Wishing Well.\n\nRussian singer Elvira T showcases a humorously realistic take on this in the music video for her song \"Goodbye\" . When Elvira kills her boyfriend for cheating on her, she makes her first mistake by leaving her webcam on. Then, after borrowing a curtain from her kindly old neighbor to wrap the body in, she struggles to drag it to her car and is spotted by several witnesses, one of whom asks another to call the police. After finally getting the body into the trunk, her license plate is photographed by an overhead camera for a traffic violation. Shortly after, her car gets stuck and she narrowly avoids being caught while asking for help from some police officers. Later, a local news reporter interviews her while she desperately tries to hide the body's protruding legs from the camera. When she finally reaches her destination, a cliffside, she briefly imagines throwing a match onto her car and blowing it up along with the body, but decides against it. Instead, after hesitating for a moment when her should-be-dead boyfriend seemingly opens his eyes , she kicks the body down the cliff. After returning home, her relief at her assumed success is cut short after she turns on the TV and finds that her face is all over the news. Meanwhile, a police van has pulled up at the cliffside.\n\nPinball\n\nIn Stern Pinball's The Sopranos, shooting the ball up the Meadowlands lane is required to get rid of dead bodies.\n\nRadio\n\nOur Miss Brooks: In the penultimate radio episode, \"New Girl in Town,\" Harriet Conklin tricks the eponymous \"new girl's\" mother into believing Mr. Boynton and Miss Brooks are burying Mr. Boynton's old girlfriends in the athletic field. In reality, Mr. Boynton and Miss Brooks are only burying the bodies of Mr. Boynton's dead lab mice.\n\nIn the Suspense episode \"The Pasteboard Box,\" a man murders his twin brother and dismembers the body to dispose of it more easily, but just can't get rid of the pasteboard box containing the head.\n\nTabletop Games\n\nDelta Green operations will usually leave bodies behind, and often it's better getting rid of them than explaining to the authorities. The \"Tradecraft\" chapter on the Agent's Handbook rulebook has a quick guide on the rules for different methods of getting rid out of of bodies, from dissolving in a polypropylene barrel to dumping the body into the water.\n\nVideo Games\n\nVisual Novels\n\nIn Dayshift at Freddy's, this is one of your tasks in the first game's Purple Guy route.\n\nAn unorthodox example in Double Homework. Dennis is still officially unaccounted for after the second avalanche on Barbarossa.\n\nis still officially unaccounted for after the avalanche on Barbarossa. In the case of the Urashima Woman from Spirit Hunter: NG, her swollen stomach was filled with rocks to weigh her down, then she was stuffed into a suitcase and thrown into the Urashima Lake. The killer disposed of dead fetuses in the same lake, which went on to haunt the place just like the Urashima Woman herself.\n\nWebcomics\n\nWeb Original\n\nIn I Like Monkeys, a man tries to get rid of 200 dead monkeys; unusually for this trope, he doesn't care about hiding them and just wants them gone. He tries to get rid of the monkeys' bodies by flushing them down the toilet, putting them in a freezer, and burning them. When all of these methods fail, he then tries to throw them out with his trash, only for the garbage man to refuse to take them. In the end, he gives them to his friends as gifts, to said friends' dismay.\n\nThe \"Modern Rogue\" guys did a whole episode on disolving a body using lye. Staggeringly effective, but they did make the mistake of adding lye to aluminium and nearly blowing themselves up. Watch it here: https://www.youtube.com/watch?v=2-eMOCMDQj8\n\nThe Twins (2022): It's a small detail, but in the reflection of Lucas's broken glasses on the street you can see (and hear) Lake dragging his brother's body off the street. Seeing as he replaces Lucas, it's heavily implied Lake was disposing or hiding the body.\n\nWestern Animation\n\nThis has happened enough times on Archer that \"I shall fetch a rug\" has become a Running Gag. \"Training Day\" had Archer and Cyril planning to bury a dead hooker ( who was just paralyzed ) after smuggling her body out in a rug. \"Killing Utne\" had Malory taking care of a dead UN official and his high-class call girl companion by breaking into her hated neighbor's apartment, staging the scene to look like a murder-suicide, then burning the bodies. Probably reached its peak with \"Lo Scandalo\", in which Mallory ropes in Archer, Lana, and Dr. Krieger to help her dispose of the body of the Italian Prime Minister, who's been assassinated in her apartment. Krieger's solution is to hack the body up in a bathtub and use the rest of the agents to dispose of the pieces in separate trashcans spread out across the city. In the end, we're left wondering whether it was actually Mallory who killed him.\n\nIn DC Super Hero Girls (2019), unsure how to deal with the soul-removed form of one of their supervillains, Batgirl recognizes having to \"hide a body\" and breezily says not to worry, she grew up in Gotham; she's got this.\n\nOne episode of Family Guy had Lois attempting to dump a body in the river in order to protect her son Chris (who she thought killed the man, but in reality, he didn't). Things got complicated when a policeman came by, but Stewie handled the situation by sliding himself into the collar of the man's shirt and acting like it was his body.\n\nRocko's Modern Life episode \"Ed is Dead: A Thriller\", in which Rocko thought he saw Bev Bighead murdering Ed Bighead (she was actually working on a sculpture of him and it fell over and broke), gave many Red Herrings on how she supposedly did this: first Rocko saw her throw a bag (actually containing her failed art project) into a hole shaped like Mr. Bighead (Ed gave her a shovel with a head molded in his likeness for their anniversary), then he saw her take a suitcase out of the house ala Rear Window (but was actually going to the dry cleaners with it), and finally Rock found what he at first thought was Mr. Bighead's preserved body in the basement (like in Psycho), but was actually the neighborhood mad dog that who proceeded to rip him apart.\n\nIn the South Park episode \"Sexual Harassment Panda\", Principal Victoria breaks down on a witness stand (About whether or not any sexual harassment occurs at her school and what got said in a particular case) and launches into a non sequitur description of having killed somebody, and cutting the corpse into pieces, and panicking over having tried to burn the body, \"but it wouldn't burn! Oh, the smell of it!\" before putting the legs into garbage bags and hiding the torso under a bridge; she had to do it! — before the lawyer convinces her to return to the original topic.\n\nIn 1978 short Special Delivery, a mailman slips and dies on an icy porch. The panicked homeowner has to figure out how to get rid of the body.\n\nSpongeBob SquarePants, \"The Nasty Patty\": Spongebob and Mr. Krabs think they killed the health inspector (he's just unconscious) and try to dispose of the \"body\". Burying doesn't work because of the rain (underwater, I know, just go with it), and two cops arrive on the scene to give them a ride back to the Krusty Krab, so they hide it in the trunk of the squad car and then hide it in the freezer (but not before Spongebob has to bring him through the front door, hidden under his hat, because the back door was locked). And then the cops ask for ice...\n\nReal Life", "images": ["https://tvtropes.org/images/logo-white-big.png", "https://static.tvtropes.org/pmwiki/pub/external_link.gif", "https://tvtropes.org/images/play-button-logo.png", "https://static.tvtropes.org/pmwiki/pub/images/bodybagging.jpg", "https://pixel.quantserve.com/pixel/p-mEzuYq24VEJ-3.gif"], "top_img": "https://static.tvtropes.org/pmwiki/pub/images/bodybagging.jpg", "keywords": [], "authors": [], "canonical_link": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DisposingOfABody", "title": "Disposing of a Body", "meta_data": {"description": "The Disposing of a Body trope as used in popular culture. Following a death, either accidental or deliberate, no matter how skilfully the responsible party …", "twitter": {"card": "summary_large_image", "site": "@tvtropes", "owner": "@tvtropes", "title": "Disposing of a Body - TV Tropes", "description": "The Disposing of a Body trope as used in popular culture. Following a death, either accidental or deliberate, no matter how skilfully the responsible party …", "image": {"src": "https://static.tvtropes.org/pmwiki/pub/images/bodybagging.jpg"}}, "og": {"site_name": "TV Tropes", "locale": "en_US", "title": "Disposing of a Body - TV Tropes", "type": "website", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DisposingOfABody", "image": "https://static.tvtropes.org/pmwiki/pub/images/bodybagging.jpg", "description": "Following a death, either accidental or deliberate, no matter how skilfully the responsible party covers it up, there remains the problem of disposing of the most obvious and most damning piece of evidence for the crime: the body itself. (There …"}, "article": {"publisher": "https://www.facebook.com/tvtropes"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "https://tvtropes.org", "summary": ""}