{"url": "www.closerweekly.com/posts/julia-robert-danny-moder-divorce-156686", "text": "It seems Julia Roberts and Danny Moder may be headed for divorce. When the actress took the part of a worker at a secret government facility on Homecoming, an upcoming political thriller on Amazon, she knew just who she wanted as her co-star: her old pal Dermot Mulroney.\n\nShe lobbied for him to join the show, and on March 8, it was officially announced that Dermot, 54 — who starred with Julia in My Best Friend’s Wedding and August: Osage County — would play her character’s boyfriend.\n\nJulia and Dermot.\n\nShe was thrilled. Her husband? Furious. “Julia’s reunion with Dermot hasn’t gone down well with Danny,” an insider tells Life & Style. “Even though Julia’s reminded him that Dermot is happily married with children, Danny’s jealous.”\n\nIt’s just one of many issues causing problems in Julia and Danny’s marriage. The cameraman and cinematographer “is at the end of his rope,” the insider tells Life & Style. “Julia and Danny are constantly quarreling. Their 15-year marriage is on the rocks, and they could even split.”\n\nJulia and Danny have been drifting apart for years. “Her controlling ways, their different approaches to parenting, and his desire to have his own career, and be the man of the house have all contributed to arguments,” says the insider. But recently, things have gotten worse. “They have been living separate lives,” the insider notes\n\nJulia, Danny, and their three kids in August 2015.\n\nInstead of focusing on repairing his marriage to Julia, 50, Danny, 49, “has been devoting his time to the kids [twins Hazel and Finn, 13, and son Henry, 10], friends, and jobs away from his wife.” When he’s home, the insider says, he often stays across the street from their beachfront compound, in a house they bought in 2016 that was originally meant for guests or nannies. The rift is only continuing to grow. “Julia is a super-protective parent, which has caused friction with Danny, who believes in being more relaxed,” explains the insider.\n\nBut when it comes to other men, he’s anything but. When Julia called hunky survivalist Bear Grylls “a man’s man” after they completed a charity trek across Africa together in 2017, “that really got under Danny’s skin,” says the insider. Danny was also seething after his wife turned into what he called a fawning “sports groupie,” the insider says, when they spent time with British and Spanish soccer stars at meet-and-greets in 2016 and 2017.\n\nDanny’s insecurity extends to his career, too: He hates being seen as Mr. Julia Roberts. “For a long time, Danny viewed Julia’s success as his own failure. It triggered a fear that he was not good enough, and the fact that Julia controls everything at home made it worse,” explains the insider. “Feeling insecure and competitive with your partner is no way to live.”\n\nThough they love each other, friends fear they can’t go on like this much longer. “Julia and Danny’s marriage is hanging by a thread,” says the insider. “Unless they can come to terms with their issues, they’re headed for divorce.”", "images": ["https://www.closerweekly.com/wp-content/uploads/2018/03/julia-dermot-mulroney.jpg?fit=400%2C273&quality=86&strip=all&resize=400%2C273", "https://www.closerweekly.com/wp-content/uploads/2018/03/julia-roberts-danny-moderjpg.jpg?resize=940%2C529&quality=86&strip=all", "https://www.closerweekly.com/wp-content/themes/ami-bauer/assets/build/images/placeholders/placeholder-16x9.svg", "https://www.closerweekly.com/wp-content/uploads/2018/03/julia-roberts-danny-moderjpg.jpg?resize=1200%2C630&quality=86&strip=all", "https://www.closerweekly.com/wp-content/uploads/2022/08/TITANIC_300x490_7_11r.gif?fit=300%2C490&quality=86&strip=all", "https://www.closerweekly.com/wp-content/themes/ami-bauer/assets/build/images/placeholders/placeholder-1x1.svg"], "top_img": "https://www.closerweekly.com/wp-content/uploads/2018/03/julia-roberts-danny-moderjpg.jpg?resize=1200%2C630&quality=86&strip=all", "keywords": [], "authors": ["Closer Staff"], "canonical_link": "https://www.closerweekly.com/posts/julia-robert-danny-moder-divorce-156686/", "title": "Will Julia Roberts and Danny Moder Divorce? Inside Their Troubled Marriage", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "theme-color": "#ffffff", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "It seems Julia Roberts and Danny Moder may be headed for divorce. When the actress took the part of a worker at a secret government facility on", "og": {"locale": "en_US", "type": "article", "title": "Will Julia Roberts and Danny Moder Divorce? Inside Their Troubled Marriage", "description": "It seems Julia Roberts and Danny Moder may be headed for divorce. When the actress took the part of a worker at a secret government facility on Homecoming, an upcoming political thriller on...", "url": "https://www.closerweekly.com/posts/julia-robert-danny-moder-divorce-156686/", "site_name": "Closer Weekly", "updated_time": "2018-03-23T17:09:16+00:00", "image": {"identifier": "https://www.closerweekly.com/wp-content/uploads/2018/03/julia-roberts-danny-moderjpg.jpg?resize=1200%2C630&quality=86&strip=all", "secure_url": "https://www.closerweekly.com/wp-content/uploads/2018/03/julia-roberts-danny-moderjpg.jpg?resize=1200%2C630&quality=86&strip=all", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/closerweekly", "published_time": "2018-03-23T17:09:16+00:00"}, "author": "Closer Staff", "twitter": {"card": "summary_large_image", "title": "Will Julia Roberts and Danny Moder Divorce? Inside Their Troubled Marriage", "description": "It seems Julia Roberts and Danny Moder may be headed for divorce. When the actress took the part of a worker at a secret government facility on Homecoming, an upcoming political thriller on...", "image": "https://www.closerweekly.com/wp-content/uploads/2018/03/julia-roberts-danny-moderjpg.jpg?resize=1200%2C630&quality=86&strip=all", "creator": "@closerweekly", "site": "@closerweekly"}, "fb": {"admins": 593583017, "pages": 487501061346187}, "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://www.closerweekly.com/wp-content/uploads/2020/11/android-chrome-192x192-1.png?fit=192%2C192&quality=86&strip=all"}, "movies": [], "publish_date": 1521824956.0, "source": "http://www.closerweekly.com", "summary": ""}