{"url": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-may-it-s-a-daily-show-reunion-as-jon-1494430858-htmlstory.html", "text": "A Star Is Born: Morgan Freeman turns 80 today By Los Angeles Times Staff (Carolyn Cole / Los Angeles Times) I like to play characters who are the absolute opposite of me. I think the farther you get from yourself, the more fun you have because the real you is hidden away. Those are the kind of parts where you can become totally empty and let the character fill you up. That’s what I look for -- a role that gives me a chance to be someone completely different. — Morgan Freeman, 1993 FROM THE ARCHIVES: No Sweat: Morgan Freeman Slides Into the Director’s Chair Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nChloë Grace Moretz addresses body-shaming controversy over Snow White movie By Josh Rottenberg (Jay L. Clendenin / Los Angeles Times) Actress Chloë Grace Moretz has long been known as a strong voice when it comes to issues of feminism, whether it’s over-sexualization of female characters or equal pay for women. Now she’s speaking out against the marketing campaign behind one of her own projects. Moretz went on social media Wednesday to address criticism that marketing for the animated film “Red Shoes and the 7 Dwarfs” — an updated tweak on the Snow White story, with Moretz as the voice of the classic fairy-tale character — engages in body-shaming. “I have now fully reviewed the [marketing] for Red Shoes, I am just as appalled and angry as everyone else, this wasn’t approved by me or my team,” the actress wrote. According to the website of the South Korean animation studio behind the film, its story centers on “a Princess who doesn’t fit into the celebrity world of Princesses — or their dress size.” When she puts on a pair of magical red shoes, she instantly becomes skinnier. The film’s synopsis promises an empowering message in which Snow White “learns not only to accept herself, but to celebrate who she is, inside and out.” But the film’s trailer and other marketing materials have been blasted as fat-shaming. Plus-size model Tess Holliday took to Twitter to criticize a billboard for the film that appeared at the Cannes Film Festival, where “Red Shoes” was seeking distribution, that suggested that the less svelte Snow White was “no longer beautiful.” How did this get approved by an entire marketing team? Why is it okay to tell young kids being fat = ugly? 🤔😏@ChloeGMoretz pic.twitter.com/PVhgwluGTM — Tess Holliday 🥀 (@Tess_Holliday) May 30, 2017 Hearing the complaints about the film’s tone-deaf marketing, Moretz agreed – and told her more than 3 million followers so in a pair of tweets. I have now fully reviewed the mkting for Red Shoes, I am just as appalled and angry as everyone else, this wasn't approved by me or my team — Chloë Grace Moretz (@ChloeGMoretz) May 31, 2017 Pls know I have let the producers of the film know. I lent my voice to a beautiful script that I hope you will all see in its entirety https://t.co/IOIXYZTc3g — Chloë Grace Moretz (@ChloeGMoretz) May 31, 2017 Even as she apologized, she promised that the marketing doesn’t represent the complete picture and the film’s ultimate message is a far more positive one than initial impressions may suggest. The actual story is powerful for young women and resonated with me. I am sorry for the offense that was beyond my creative control https://t.co/HZP2ydPCAX — Chloë Grace Moretz (@ChloeGMoretz) May 31, 2017 Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nSinging tween ventriloquist from ‘America’s Got Talent’ is the cure for what ails you By Christie D’Zurilla Had enough outrage? Here’s the cure for what ails you, courtesy of “America’s Got Talent.” Take a deep breath, exhale slowly and witness one Darci Lynne Farmer, a 12-year-old singing ventriloquist from Oklahoma City, who on Tuesday night got the Golden Buzzer from “AGT” judge Mel B for a performance that exuded unadulterated joy. Armed with bunny-puppet pal Petunia on lead vocals, Darci Lynne delivered a surprising version of “Summertime” for her audition. She ended up earning a ticket straight to the competition’s live shows. “You made my heart melt,” said Mel B, who Darci Lynne later dubbed “the best Spice Girl.” “I believe that that rabbit is a real separate person,” judge Howie Mandel said. “I love you. I believe you’re gonna go far. You just changed your life tonight, young lady.” https://t.co/VZmgRXv4PZ — Darci Lynne (@ItsDarciLynne) May 31, 2017 Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nJohn Legend makes case to take canceled drama ‘Underground’ elsewhere By Nardine Saad (Katie Falkenberg / Los Angeles Times) John Legend is making a case for the recently canceled TV drama “Underground” to be picked up by other content providers. The Oscar-winning musician, who is an executive producer and played abolitionist Frederick Douglass on the Underground Railroad-centered show, rallied fans to give it a second life when cable broadcaster WGN America announced Tuesday it would be canceling the series after two seasons. The network has been scaling down its investment in original programming as part of a deal that its parent company, Tribune Media, made with conservative-leaning Sinclair Broadcast Group Inc. Sinclair’s purchase of Tribune gives it control of more than 200 local TV stations and WGN America. The shift was not lost on Legend, who fired off a series of tweets to promote the content brought forth by “Underground” and its creators, Misha Green and Joe Pokaski. “WGN America has been bought and is going a different direction strategically. We will find a new home for Underground!” he tweeted, adding, “Content wins. We’re not reliant on a particular network to make great content. We’re so proud of our show and the audience that supported!” Legend, who has made no secret about his liberal politics, cautioned fans to “be wary of Sinclair” and claimed that “they’re trying to make local stations mini Fox Newses” that lean even further to the right. He completed his plea by asking followers to “feel free to drop some hints to the network/streaming services you want to pick up #Underground. Show them who will be watching!” View Instagram post “Despite ‘Underground’ being a terrific and important series, it no longer fits with our new direction and we have reached the difficult decision not to renew it for a third season,” Peter Kern, president and CEO of Tribune Media, said in a statement. “It is our hope that this remarkable show finds another home and continues its stories of courage, determination and freedom.” Sony Pictures Television, the studio that produces “Underground,” is said to be trying to find it a new home. See The Times’ roster of new, returning and canceled series here. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nLiam Gallagher plays new music at Manchester benefit show By August Brown In the wake of the terrorist attack outside an Ariana Grande concert in Manchester, scores of artists joined forces to raise money for the victims. Among them was Liam Gallagher, the former singer and frontman for the city’s most beloved rock band, Oasis. Gallagher played a benefit show for the bombing victims on Tuesday at the O2 Ritz Manchester. At the show, his first as a solo artist, he played several new songs, including the single “Wall of Glass,” which you can watch above. It was a preview of his forthcoming solo LP, “As You Were.” (Previously, Gallagher fronted the post-Oasis rock band Beady Eye.) For Oasis fans, he played several classic tracks, including “Be Here Now” with Oasis guitarist Paul “Bonehead” Arthurs and an a cappella take on “Live Forever.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nCNN fires Kathy Griffin from New Year’s Eve show over controversial Trump picture By Christie D’Zurilla (Lawrence K. Ho / Los Angeles Times) Kathy Griffin is out of a job at CNN. The cable network on Wednesday terminated its agreement with the comic, who for years has co-hosted its New Year’s Eve program with Anderson Cooper, after a photo of Griffin holding a bloody, severed head in the likeness of President Trump went viral on social media. The image, taken by photographer Tyler Shields, elicited strong criticism from liberals and conservatives alike. Griffin apologized for the gory image in a 30-second video posted online Tuesday night. “I beg for your forgiveness,” Griffin said in the video. “I went too far.” Trump denounced the image Wednesday, calling it “Sick!” and saying Griffin should be ashamed. CNN has terminated our agreement with Kathy Griffin to appear on our New Year's Eve program. — CNN Communications (@CNNPR) May 31, 2017 Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nLebanon officially bans ‘Wonder Woman’ from theaters By Josh Rottenberg If you live in Lebanon, “Wonder Woman” won’t be coming to a theater near you anytime soon. On Wednesday, the country officially banned the superhero film just hours before it was set to arrive in theaters. The ban followed an effort by a group called Campaign to Boycott Supporters of Israel, which urged the Lebanese government’s Ministry of Economy and Trade to block the film because its star, Gal Gadot, is Israeli. News of the ban, which had been the subject of speculation since Monday, was announced on social media by Lebanon’s Grand Cinemas and Campaign to Boycott Supporters of Israel. Lebanon has had a contentious relationship with the state of Israel for decades and has an official law on the books that encourages boycotts of products from its neighbor to the south. Israeli citizens and anyone whose passport shows they’ve traveled to Israel are prohibited from entering Lebanon. Earlier films featuring Gadot, including “Batman v Superman: Dawn of Justice” and “Furious 7,” have successfully screened in theaters in Lebanon, however. “Batman v Superman,” which introduced Gadot’s Wonder Woman, was the third biggest hit at the box office in Lebanon last year. And, as has been pointed out, “Wonder Woman” was, in fact, made by three companies based in America and two based in China, so calling it an Israeli product is debatable. But, on its Facebook page, the Campaign to Boycott Supporters of Israel complained that Gadot had served two years in the Israeli Defense Forces (national military service is mandatory for Israeli citizens over 18) and “boasted about the army training her for Hollywood.” “Wonder Woman” lands in American theaters on Friday and, fueled by overwhelmingly positive reviews, is expected to perform strongly. Read our recent profile of director Patty Jenkins, in which she explains why the world needs Wonder Woman, right here. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nIf President Trump’s got the whole world in his hands, Trevor Noah says we’re in trouble By Robert Lloyd Having caught fire too late Tuesday for late-night TV, and with several hosts extending their Memorial Day weekend, the #covfefe hashtag would have to wait at least until Wednesday for its monologue moment. There were, however, some late-night-related tweets reacting to Twitter addict @realdonaldtrump’s since-deleted mistyping of what is assumed to be the word “covering” or “coverage.” “What makes me saddest,” wrote Jimmy Kimmel, “is that I know I’ll never write anything funnier than #covfefe.” The account for CBS’ “Late Late Show” poked some fun at Trump’s gaffe, too. who do you want to see on the next covfefe karaoke — The Late Late Show with James Corden (@latelateshow) May 31, 2017 Meanwhile, Trevor Noah and Comedy Central’s “The Daily Show” were back after a week off, above, catching up with President Trump’s whole first trip abroad. “International Hand Stuff” was the name of the segment, which framed the excursion in terms of the president’s mitts. There were references to Trump touching the “glowing white orb” and Jerusalem’s Western Wall (“they build one wall 2,000 years ago,” Noah said in his Trump voice, “zero Mexicans in their whole country”); the question of whether First Lady Melania Trump swatted away her husband’s hand on the tarmac in Tel Aviv (“leave it to Fox News not to recognize what rejection from a woman looks like”); and Trump’s power handshake from new French President Emmanuel Macron (“the first time that President Trump was on the receiving end of an unwelcome hand grab”). The last manual metaphor was given to the German chancellor, who, after her visit with the American president, said, “We Europeans must take our fate into our own hands.” “Yeah,” said Noah, “clearly Angela Merkel got one look at Trump and was like, ‘All right, our fate is in our own hands, because his clearly ruin everything they touch.’” Jimmy Kimmel also looked at Trump’s trip abroad, which he described, with probable irony, as “spreading joy and optimism all over the world.” Titled “Drunk Donald Trump: Sicily,” the segment replayed a portion of Trump’s speech at half-speed. The effect is uncanny. Later, sitting outside on some steps -- urine-stained steps, apparently -- Kimmel asked a series of kids, who really do say the darnedest things, about the state of the union. If we measure a late-night host solely by an ability to engage with children in a way that’s friendly, direct, deadpan and mostly honest, Kimmel is in a league with David Letterman, nearly. How did he think Donald Trump was doing, Kimmel asked one boy. “Not really well,” the child replied. “My sister told me that Donald Trump is against another state.” “Which state? Is it … Nebraska?” “Yeah, Nebraska.” “A lot of people are happy that he is bombing Nebraska,” said Kimmel. (I did say “mostly” honest.) “Do you think it was a good idea?” “No,” replied the boy, “‘cause they have, like, better bombs.” “I think they’re going to be OK, though, I really do,” the host said. “Once football season starts, they’re usually pretty solid.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nKathy Griffin apologized for that bloody severed-head stunt. But few are forgiving her By Nardine Saad (Lawrence K. Ho / Los Angeles Times) First Lady Melania Trump is the latest detractor of Kathy Griffin’s bloody depiction of the president’s decapitation. “As a mother, a wife, and a human being, that photo is very disturbing,” FLOTUS said in a statement to NBC News. “When you consider some of the atrocities happening in the world today, a photo opportunity like this is simply wrong and makes you wonder about the mental health of the person who did it.” Griffin’s photographs and video by photographer Tyler Shields showed the comic straight-faced, holding up a blood-splattered severed head that appeared to be Trump’s. The president denounced Griffin’s stunt, saying that she “should be ashamed of herself” and that the piece greatly disturbed his 11-year-old son, Barron. Griffin’s apology wasn’t accepted by some on Twitter either, which spewed a variety of reactions, including several right-wing jabs that Griffin had been radicalized by Islamic State, the terror group that frequently beheads its victims. Several also sympathized with the president’s family, citing TMZ’s story about Barron believing that something horrible had happened to his father when he saw the images on the news. CNN subsequently fired Griffin from her co-hosting duties for its New Year’s Eve broadcast, and she has also been dropped as a spokesperson for Squatty Potty. Trump’s eldest son, Donald Trump Jr., was delighted by the bathroom footstool maker’s response but criticized CNN for not immediately doing the same. “So Squatty Potty pulls the plug on Kathy Griffin, but CNN still ‘evaluating’ and weighing their options,” the president’s eldest son tweeted. “Insane what’s going on there!!!” He then added, “Apologies for my last tweet. I didn’t mean to group Squatty Potty with CNN. Obviously one of them has moral/ethical standards.” Griffin’s CNN compatriot, Anderson Cooper, who co-hosts the giggle-filled New Year’s Eve show for the cable news channel, did not come to his pal’s defense. “For the record, I am appalled by the photo shoot Kathy Griffin took part in. It is clearly disgusting and completely inappropriate,” Cooper tweeted. CNN host Jake Tapper also said on the air that he “thought the beheading imagery by Griffin about the president was disgusting and inappropriate.” For the record, I am appalled by the photo shoot Kathy Griffin took part in. It is clearly disgusting and completely inappropriate. — Anderson Cooper (@andersoncooper) May 31, 2017 For those asking, I said on air that I thought the beheading imagery by Griffin about the president was disgusting and inappropriate. — Jake Tapper (@jaketapper) May 30, 2017 Meanwhile, others believed that Griffin’s apology was a step in the right direction. Kathy Griffin did the right thing by apologizing. That sort of behavior, that sort of message, isn't acceptable in any setting. — George Takei (@GeorgeTakei) May 31, 2017 “I think she did the right thing asking for forgiveness and acknowledging that this was a horrible mistake, so I think she can,” Minnesota Democrat and former “Saturday Night Live” writer Sen. Al Franken told CNN on Wednesday. “Kathy’s a friend and she’s a terrific comedian, but this had no business being in our public discourse...,” Franken said. “And I talked to her. She has apologized — a real, fulsome apology. She’s actually begged for forgiveness, and I believe in forgiveness.” Still, there was more snark to be had. Kathy Griffin's stupid photo was gross & offensive. She should lose her leadership role in the DNC and no longer be a candidate for office. — Josh Marshall (@joshtpm) May 31, 2017 Update, 10:55 a.m.: Story added news that CNN has fired Griffin from its New Year’s Eve broadcast. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nMelania Trump questions Kathy Griffin’s mental health after inflammatory photo shoot By James Reed President Trump and Melania Trump (Brendan Smialowski / AFP/Getty Images) As a mother, a wife, and a human being, that photo is very disturbing. When you consider some of the atrocities happening in the world today, a photo opportunity like this is simply wrong and makes you wonder about the mental health of the person who did it. — Melania Trump, responding to Kathy Griffin’s controversial stunt involving a “severed head” in the likeness of President Trump Read More Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nA Star Is Born: Clint Eastwood turns 87 today By Los Angeles Times Staff (Robert Gauthier / Los Angeles Times) If you want to be in for the long haul, you just have to trust your judgment about the material. ... If you go whoring for the money, the audiences will figure you out. They know when you’re being a jerk, when you’re just trying to get them in a room and show them a movie you don’t even care about. — Clint Eastwood, 1993 FROM THE ARCHIVES: Clint, closing in on El Dorado Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\n‘This Is Us’ not moving to Thursdays, after all By Yvonne Villarreal Consider it a flash-forward flashback: Poised to help NBC reclaim its “Must See TV” glory on Thursday nights, “This Is Us” is now staying put in its Tuesday time slot before the switch even happened. The breakout drama from last season will keep hold of the 9 p.m. hour on Tuesdays where it performed mightily in its debut season, the network announced Tuesday. It’ll retain its lead-in, “The Voice.” The move means some rejiggering for Thursdays. The revival of “Will & Grace,” which was slated to open the night, will now kick off the 9 p.m. hour. It will be surrounded by comedies “Superstore,” “The Good Place” and “Great News” to create a two-hour comedy block. “Chicago Fire” will take up the 10 p.m. hour instead of “Law & Order True Crime: The Menendez Murders.” That drama will keep its “This Is Us” lead-in by moving to Tuesdays. Here’s NBC’s revised schedule: Tuesdays 8 p.m. – “The Voice” 9 p.m. – “This Is Us” 10 p.m. – “Law & Order True Crime: The Menendez Murders” Thursdays 8 p.m. – “Superstore” 8:30 p.m. – “The Good Place” 9 p.m. – “Will & Grace” 9:30 p.m. – “Great News” 10 p.m. – “Chicago Fire” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nErin Moran died of cancer, autopsy report confirms By Christie D’Zurilla Erin Moran is shown in 1992. (Wally Fong / Associated Press ) The coroner reportedly says “Happy Days” actress Erin Moran died of complications from cancer and cancer alone. That’s in line with what her husband said in an open letter written shortly after her death on April 22 at age 56. Tests showed “no illegal narcotics were involved in her death,” according to an autopsy report obtained by TMZ on Tuesday from the coroner’s office in Harrison County, Ind. Moran struggled with substance abuse earlier in her life, and media assumptions about her cause of death were amplified by a comment from Scott Baio during an early morning radio interview April 24. When Baio learned his former costar had been battling cancer, he fell all over himself trying to set the record straight. “I was asked ONLY about Erin’s troubled past due to drug & alcohol abuse. I was still upset and said I felt that living that kind of a lifestyle will catch up with you and nothing good would come of it,” he said on Facebook. “THIS WAS BEFORE THE CAUSE OF DEATH WAS ANNOUNCED STATING STAGE 4 CANCER.” One of the former child star’s brothers, Tony Moran, told the Sun on May 30: “My first thoughts were she must have had a heart attack caused by years of substance abuse. She has always battled demons and in recent years things have gone from bad to worse.” In reality, as described by her husband, Moran had discovered last December that she had squamous cell carcinoma of the throat. After undergoing chemotherapy and radiation, by April she could no longer speak, eat or drink. She had a feeding tube. Baio posted the open letter from Steve Fleischmann, Moran’s husband of nearly 24 years, on his own Facebook page April 25. “It got so bad so fast,” Fleischmann said. “The coroner told me it was really really bad. It had spread to her spleen, she had alot of fluid in her lungs and part of her brain was infected,” Fleischmann wrote. “The coroner said even if she was in the hospital being pumped full of antibiotics she still would not of made it. He said it was the best that she was with me and went in her sleep.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nWGN America cancels ‘Underground,’ but will it really be the end? By Yvonne Villarreal × A chat with Aisha Hinds and Jurnee Smollett-Bell, the “badass women” from “Underground.” WGN America has canceled slavery-era-set drama “Underground.” The fate of the series, which centered around the Underground Railroad, seemed doomed given how the network has been scaling back its investment in original programming. Until now, the drama, from creators Misha Green and Joe Pokaski, had stood as the lone original scripted series on the network following the recent cancellation of “Outsiders.” The shift away from original programming comes after Sinclair Broadcast Group Inc., the conservative-leaning Baltimore-based company, announced it had agreed to buy Tribune Media in a deal that would give it control of more than 200 local TV stations and WGN America. “As WGN America evolves and broadens the scope and scale of its portfolio of series, we recently announced that resources will be reallocated to a new strategy to increase our relevance within the rapidly changing television landscape,” Peter Kern, president and CEO of Tribune Media, said in a statement. “Despite ‘Underground’ being a terrific and important series, it no longer fits with our new direction and we have reached the difficult decision not to renew it for a third season.” Kern added: “It is our hope that this remarkable show finds another home and continues its stories of courage, determination and freedom.” Sony Pictures Television, the studio that produces “Underground,” is said to be trying to find it a new home. When “Underground” stars Jurnee Smollett-Bell and Aisha Hinds stopped by the Los Angeles Times’ video studio last week, both seemed hopeful that “Underground’s” story wasn’t over. “We haven’t heard anything yet on the status of Season 3,” said Hinds, who joined Season 2 portraying Underground Railroad icon Harriet Tubman. “But I do know there is quite a bit more of this story to tell. And I know that we have engaged viewers waiting to see the story. If WGN is not our home, we’ll find a home.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nLebanon might ban new ‘Wonder Woman’ because of star’s Israeli heritage By Libby Hill A new foe has arisen to oppose Wonder Woman at the box office: Lebanon. The Associated Press reported Tuesday that Lebanon is seeking to ban Warner Bros.'s new “Wonder Woman” movie because lead actress Gal Gadot is an Israeli. On Monday, Lebanon’s National News Agency reported that the Ministry of Economy and Trade was adopting measures necessary to ban the film from screening. Relations between Israel and Lebanon have been strained since Israel’s independence in 1948, with Lebanon still abiding by the Arab League boycott of Israel adopted in 1945. Lebanon does not recognize the State of Israel and does not accept Israeli passports or passports indicating a person has entered Israel. But is “Wonder Woman” an Israeli product? The film is produced by five production companies —DC Films, Atlas Entertainment, Cruel and Unusual Films, Tencent Pictures and Wanda Pictures — three companies based in the United States and two in China. Gadot, however, is proud of her heritage. She served two years in the Israel Defense Force as required by the country’s conscription requirements and has posted in the past in support of IDF during the 2014 Israel-Gaza conflict. The ban of the film would have to move quickly, as screenings are scheduled to begin in Beirut on Wednesday. But such action would require approval from a six-member committee from the Ministry of Economy, a process that had yet to begin, according to the Associated Press. “Wonder Woman” debuts in U.S. theaters Friday. 4:10 p.m.: This article was updated with information from Lebanon’s National News Agency. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nOlivia Newton-John has a new cancer diagnosis; her June shows are postponed By Christie D’Zurilla (Esteban Felix / Associated Press) Olivia-Newton John has “reluctantly” postponed her June concert dates after learning that the back pain she’s been waylaid by recently is caused by breast cancer that has metastasized to her sacrum. “I decided on my direction of therapies after consultation with my doctors and natural therapists and the medical team at my Olivia Newton-John Cancer Wellness and Research Centre in Melbourne, Australia,” the 68-year-old singer said Tuesday in a statement on social media. Those therapies include a short course of photon radiation therapy in addition to “natural wellness therapies,” the statement said. Newton-John was diagnosed with breast cancer in 1992, at which time she underwent chemotherapy after a modified radical mastectomy with reconstruction. Her treatment also included acupuncture, which she said helped her with nausea, as well as yoga, meditation and massage. Three weeks ago, Newton-John postponed her May shows, with her team citing “a bad issue with Olivia’s sciatica.” Now, her June shows in the U.S. and Canada have been put off. Ticket-holders are being directed to venues for refunds, and any rescheduled dates will be posted on Newton-John’s official website. “Olivia ... is confident she will be back later in the year, better than ever, to celebrate her shows,” the Tuesday statement said. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nAfter Cannes delay, ‘Victoria & Abdul’ trailer debuts By Amy Kaufman One week after Focus Features scrapped plans to unveil the trailer for “Victoria & Abdul” during the Cannes Film Festival, a preview of the upcoming British drama has debuted online. Set in 1887, the film stars Judi Dench as Queen Victoria and follows the monarch as she strikes up an unlikely friendship with a Muslim Indian (Ali Fazal) who has traveled to the U.K. to deliver a ceremonial coin to her majesty. Focus, which is owned by Universal Pictures, was set to debut the trailer last Wednesday but postponed the release after the bombing at an Ariana Grande concert in Manchester, England, on May 22. A source told The Times the decision was made in part because “a big piece of marketing right after the attack could seem insensitive.” Directed by Stephen Frears, “Victoria & Abdul” is set for release at the start of awards season in September. The trailer centers on the real-life relationship that blossomed between the two, with Abdul going from servant to teacher while informing the queen about everything from the Koran to the joys of Indian mangoes. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nReady for Alanis Morissette’s ‘Jagged Little Pill’ as a musical? It’s happening By August Brown (Kirk McKoy / Los Angeles Times) Alanis Morissette’s angsty, groundbreaking 1995 album, “Jagged Little Pill,” always seemed like it had enough melodrama to make it into a theatrical production. Now it’s coming to a stage in Massachusetts. The new production of “Jagged Little Pill,” helmed by “Juno” writer Diablo Cody and director Diane Paulus, will debut at the American Repertory Theater in Cambridge next May. The musical will feature songs from the LP — famed for its unsparing look at relationships — along with other music from Morissette’s catalog and “Pill” producer Glen Ballard. “This team that has come together for this ‘Jagged Little Pill’ musical is my musical theater dream come true,” Morissette said in a statement. “The chemistry between all of us is crackling and I feel honored to be diving into these songs again, surrounded by all of this searing talent.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nReunited ‘Brady Bunch’ kids fondly remember Florence Henderson on ‘Today’ By Nardine Saad It was a very Brady reunion on Tuesday. “The Brady Bunch” kids Barry Williams (Greg), Christopher Knight (Peter), Mike Lookinland (Bobby) and Susan Olsen (Cindy) came together on NBC’s “Today” show to reflect on the iconic family sitcom and pay tribute to its late matriarch, Florence Henderson, nearly 50 years after the show debuted in 1969. The syndicated series about a blended family of six children and their housekeeper has permeated the pop culture zeitgeist with its unmistakable style and earworm theme song. With numerous parodies and attempted reboots in its wake, the comedy has endured because of its wholesome values, the cast members said. “What you have on ‘The Brady Bunch’ is something you’re not going to see these days, which is a family where the parents and the kids respect each other… today the formula is get the parents out of the show for the kids shows,” said Olsen, a.ka. “the youngest one in curls.” “You know how you don’t grow old for yourself until you see yourself in a photo? Somehow you just don’t see it,” Knight explained. “It’s as though the show keeps us young in everyone’s mind, but we’re really this old.” Added Williams: “Everyone always refers to us as kids. No matter how we mature, we’re still the kids.” After acknowledging that they would always be best known for “The Brady Bunch,” the actors said, they realized early on that they would never be able to walk away from the series at different stages of their careers. For Williams it was when a teenage girl asked him to sign an autograph for her mother and for Lookinland it was when he realized that his fans now had grandchildren. Knight said the show “was always going to be in the room before me and it was always going to be in the room after me.” Olsen, who claimed that she had written some off-color lyrics attached to the theme song, added that “you spend a little while trying to run away from it, but you can’t. It’s like having a hunchback. You can’t disguise it, so you might as well dress it up.” As for their TV mom, Henderson, who died in 2016, the kids remembered her fondly. “Everyone she met felt better about themselves and about the world around them after having spent a moment with Florence,” Knight said. “She was a mentor, a friend. We learned from her,” added Williams. “We learned how to interact with the public. She was so gracious with her fans, and we all learned how to do that graciously. Mostly she loved to make people laugh. You probably know that if you’ve been in her space.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nPrince William talks about ‘taboo’ of mental illness and death of Diana in new interview By Libby Hill As the 20th anniversary of the death of Diana, Princess of Wales approaches, her son Prince William has opened up to British GQ about the loss. “I would like to have had her advice,” William told the magazine. “I would love her to have met Catherine and to have seen the children grow up. It makes me sad that she won’t, that they will never know her.” The prince was just 15 when his mother was killed in a high-speed car crash on Aug. 31, 1997, and he and younger brother Harry were left to deal with their grief under great public scrutiny. While Prince William has of late found the words to speak publicly about his mother, the journey to that place has not always been easy. “It has taken me almost 20 years to get to that stage,” William said. “I still find it difficult now because at the time it was so raw. And also it is not like most people’s grief, because everyone else knows about it, everyone knows the story, everyone knows her.” View Instagram post It may have taken years, but William and Harry have found a way to honor their mother in a fashion that she would likely greatly appreciate: charitable work. Known as the “People’s Princess,” Diana was a tireless advocate for those in need and worked to destigmatize AIDS in the 1980s, to fight the use of landmines and to better the lives of the underprivileged. In the last year, William and his brother, alongside William’s wife, Kate, have expanded their involvement in Heads Together, a mental health campaign led by the Royal Foundation, which aims to start a productive conversation about the reality of mental illness. “Smashing the taboo is our biggest aim. We cannot go anywhere much until that is done. People can’t access services till they feel less ashamed, so we must tackle the taboo, the stigma,” William said. The Heads Together campaign has sparked several headlines for the royal family in recent months. In April, Prince Harry admitted that the death of his mother left him “very close to a complete breakdown” for which he finally sought professional help three years ago. “The experience that I’ve had is once you start talking about [mental health], you suddenly realized, actually, you’re part of a big club ... and everybody’s gagging to talk about it,” Harry said during the “Mad World” podcast with Bryony Gordon. The GQ interview is not the only conversation that Prince William has had recently about mental health, either. He participated in a highly publicized FaceTime chat with Lady Gaga on the matter. In the interview, Prince William acknowledged that his public persona might suggest otherwise, but privately, he is impassioned about the issue. “I cannot understand how families, even behind closed doors, still find it so hard to talk about it. I am shocked we are so worried about saying anything about the true feelings we have,” the prince said. Prince William’s full interview with British GQ is available in its July issue, on newsstands June 1. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAriana Grande’s mom has a message for Manchester bombing victims By Christie D’Zurilla Joan Grande, left, and Ariana Grande in September 2015. (Kevin Mazur / Getty Images) Days after daughter Ariana Grande issued a statement about last week’s post-concert bombing in Manchester, England, mom Joan Grande posted her own thoughts about the incident that left 22 dead and scores more injured. “I join my daughter in extending my help & services to all those affected by the diabolical act of terror which occurred in Manchester!” she wrote on Twitter as a Memorial Day message that also thanked U.S. servicemen and women. “My heart goes out to all the victims: those who lost their lives, those injured, those recovering & all survivors of that night, along with the families and friends whose grief knows no bounds.” The elder Grande was still in her front-row seat at the show, about to go see her daughter backstage, when the suicide bomb went off, TMZ reported. Mama Grande took about 10 kids who were seated around her to safety backstage, the website said. Ariana Grande similarly offered her assistance to those in need on Friday in a statement declaring her intention to return to “the incredibly brave city of Manchester” for a benefit concert. “We will never be able to understand why events like this take place because it is not in our nature, which is why we shouldn’t recoil,” the “Bang Bang” singer said. “We will not quit or operate in fear. We won’t let this divide us. We won’t let hate win.” #MemorialDay pic.twitter.com/oUDmB7VD6x — Joan Grande (@joangrande) May 29, 2017 Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nA Star Is Born: Annette Bening turns 59 today By Los Angeles Times Staff (Kirk McKoy / Los Angeles Times) \"[W]hen they teach you to act, they teach you about objectives. You have a need -- a kind of emotional imbalance -- it’s not neurotic, but you want something. I try to consciously beef up that motivation in order to intensify what I’m doing. You get an image in your head of what you want and then you find a way of expressing that. — Annette Bening, 1991 FROM THE ARCHIVES: Regarding Annette Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nSweden’s ‘The Square’ wins Palme d’Or and Sofia Coppola wins best director at Cannes By Los Angeles Times Swedish director Ruben Ostlund reacts on stage after he was awarded with the Palme d’Or for the film ‘The Square’ during the closing ceremony of the 70th edition of the Cannes Film Festival. (Alberto Pizzoli / AFP / Getty Images) Ruben Ostlund’s “The Square,” “a ferocious drama of conscience,” according to Times critic Justin Chang, about how “a single lapse in judgment can cause a man’s entire life to unravel,” won the Cannes’ top prize, the Palme d’Or on Sunday. The Grand Prix award went to Robin Campillo’s “120 Beats per Minute.” Sofia Coppola won best director for her film “The Beguiled,” which stars Nicole Kidman and Colin Farrell. Kidman also won the festival’s 70th anniversary prize. Joaquin Phoenix won best actor for Lynne Ramsay’s “You Were Never Really Here” and Diane Kruger won best actress award for Faith Akin’s “In the Fade.” More coverage to come. Meanwhile... Here is what Justin Chang wrote about Ostlund’s “The Square,” and Steven Zeitchik’s interview with the director, who talked about the element of surprise in his movies: “I really like scenes that when they end where you don’t know 100% where to put them. It starts funny or it starts sad and then it becomes something else. When you get that shift, you know you’ve succeeded.” Read More Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nA Star Is Born: Kylie Minogue turns 49 today By Los Angeles Times Staff (Axel Koester / For The Times) I have this following — mainly young girls. This album had to appeal to those fans. If the singing was too R&B, they wouldn’t like it, I guess. These producers think pop music is candy music. They’re saying: ‘Here, kids, have a piece of candy.’ — Kylie Minogue, 1988 FROM THE ARCHIVES: Fame, fortune, but no respect Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nGregg Allman, pioneer of Southern rock, dies at 69 By Nardine Saad Gregg Allman performs with the Allman Brothers Band in 1979. (George Rose / Los Angeles Times) Gregg Allman, the gravel-voiced singer who helped lift the Allman Brothers Band to prominence with a hard-churning brand of soulful rock that became part of the soundtrack of the 1960s and ’70s and set the coordinates for a musical genre known as Southern rock, died Saturday at the age of 69. According to a statement posted on his official website, Allman, who had canceled concerts and entire tours in recent years as he battled a variety of health issues, “passed away peacefully at his home in Savannah, Ga.” Read More Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\n70 years of Cannes in 17 seconds: The art of the yacht deal, from Steven Spielberg to Steve Bannon By Steven Zeitchik × Steven Zeitchik, Justin Chang and Kenneth Turan are bringing us Cannes moments from the 70 years of the international film festival -- in 17-second increments (or thereabouts). Here, Zeitchik, with Chang behind the camera, recalls the time he wound Steven Zeitchik, Justin Chang and Kenneth Turan are bringing us Cannes moments from the 70 years of the international film festival -- in 17-second increments (or thereabouts). Here, Zeitchik, with Chang behind the camera, recalls the time he wound up on a yacht with a future member of the Trump administration. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\n70 years of Cannes in 17 seconds: The time Sofia Coppola’s ‘Marie Antoinette’ was booed By Justin Chang Steven Zeitchik, Justin Chang and Kenneth Turan are bringing us Cannes moments from the 70 years of the international film festival -- in 17-second increments (or thereabouts). Here, Chang, with Zeitchik behind the camera, recalls the year Sofia Coppola’s “Marie Antoinette” played in competition and was booed by certain members of the media audience. × Steven Zeitchik, Justin Chang and Kenneth Turan are bringing us Cannes moments from the 70 years of the international film festival -- in 17-second increments (or thereabouts). Here, Chang, with Zeitchik behind the camera, recalls the year Sofia Cop That same year, when the film debuted in theaters, Times critic Kenneth Turan looked back on the boos at Cannes and concluded the reaction wasn’t just about the filmmaking. Here is the essay he wrote on Oct. 13, 2006: -------------------- WHO OWNS HISTORY? And, more to the point, who owns Marie Antoinette? Though they’re not usually phrased that way, those questions have swirled around Sofia Coppola’s quietly exuberant new film about the doomed young French queen (only 18 when she ascended the throne, 37 when she was executed) since it premiered at the Cannes Film Festival earlier this year to some scattered — and widely misunderstood — boos. For the displeasure came not, as might be expected, from the French critics -- who’d already seen the film and whose generally positive notices were already on record in Le Film Francais, the French trade paper -- but from political types who had an ax to grind about the film’s portrait of the woman in question. Read More Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nBen Stiller and Christine Taylor split after 17 years of marriage By Christie D’Zurilla (Al Seib / Los Angeles Times) Ben Stiller and Christine Taylor have split up after 18 years together, 17 of them as husband and wife. “With tremendous love and respect for each other, and the 18 years we spent together as a couple, we have made the decision to separate,” they said Friday in a joint statement. “Our priority will continue to be raising our children as devoted parents and the closest of friends. We kindly ask that the media respect our privacy at this time.” The “Zoolander” director and the “Brady Bunch Movie” actress met in L.A. in 1999, while he was developing a pilot in which she was going to star. They started dating that April and by November were engaged. They got married in May 2000. Stiller, 51, who proposed to Taylor while he was doing “Meet the Parents,” told Parade in 2013 that art imitated life when he was about to pop the question. “I asked her father for permission before I did it…,” he said. “It was like ‘Meet the Parents’ in real life, because Christine’s father is an intimidating guy who owns a security company; we’re good friends now, but at the time I was in the basement rec room saying, ‘I really would like to marry your daughter...’” Why the basement? \" “He was trying to find a place to sort of secretly ask my dad if it was OK to ask my hand in marriage,” Taylor told New York magazine in 2008. The “Dodgeball: A True Underdog Story” costars have two kids together, daughter Emma, 15, and son Quinlan, 11. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\n70 years of Cannes in 17 seconds: The ‘home away from home’ for luminaries By Kenneth Turan × Kenneth Turan, Justin Chang and Steven Zeitchik are bringing us Cannes moments from the 70 years of the international film festival -- in 17-second increments (or thereabouts). Here, Turan, with Chang behind the camera, brings us to the historic Hot Kenneth Turan, Justin Chang and Steven Zeitchik are bringing us Cannes moments from the 70 years of the international film festival -- in 17-second increments (or thereabouts). Here, Turan, with Chang behind the camera, brings us to the historic Hotel Splendid, which over the last 146 years has been “a home away from home” for luminaries ranging from the French composer Jacques Offenbach to the late critic Roger Ebert. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nL.A. music fixture Rodney Bingenheimer will leave KROQ next month By Mikael Wood Rodney Bingenheimer, the veteran radio DJ and rock-scene insider familiar to several generations of Los Angeles music fans, is ending his long-running show on L.A.'s KROQ-FM (106.7) after more than 40 years. “Rodney on the ROQ” will air for the final time on June 4 at midnight, Bingenheimer, 69, wrote on Facebook Thursday. “It has been an amazing run, and I will be thanking all of you when I say goodbye to KROQ next week,” he said in the post. “I am planning on some special callers and special music as I say a proper goodbye.” In a statement to The Times, KROQ program director Kevin Weatherly called Bingenheimer “one of the most influential voices on the radio” and said he and his staff “will forever be grateful for the indelible mark that ‘Rodney on the ROQ’ has left on this station, our listeners and the alt-rock music scene.” Bingenheimer launched his show on the influential modern-rock station in 1976, four years after he opened Rodney’s English Disco, a nightclub on Sunset Boulevard popular among the decade’s glam acts. On the radio, Bingenheimer quickly became known for championing new artists including the Sex Pistols and Blondie; he continued playing music by up-and-coming talent over the years, throwing his considerable enthusiasm behind the likes of Oasis and Coldplay. In his Facebook post, Bingenheimer — the subject of a 2003 documentary called “Mayor of the Sunset Strip” — didn’t say why he was leaving KROQ. But he noted that he’s not retiring from music. “As this chapter closes,” he wrote, “I will be opening another chapter of my rock life soon.” Here’s his full statement on Facebook: Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAriana Grande to hold benefit concert in ‘incredibly brave city of Manchester’ By Christie D’Zurilla (Valerie Macon / AFP/Getty Images) Ariana Grande on Friday announced her intention to return to the “incredibly brave city of Manchester” to spend time with fans and play a benefit concert to assist victims of the suicide bomb attack launched after her show in the British city earlier this week. “I have been thinking of my fans, and of you all, non stop over the past week. The way you have handled all of this has been more inspiring and made me more proud than you’ll ever know,” the 23-year-old singer said in a statement on social media. “The compassion, kindness, love, strength and oneness that you’ve shown one another this past week is the exact opposite of the heinous intentions it must take to pull off something as evil as what happened Monday. YOU are the opposite.” Grande gave no details about when she would return other than to say they’d be coming as soon as things were confirmed. The statement was her first since a brief tweet after the bombing saying she was “broken” and “so so sorry.” That day, Grande and her mother left Britain for Florida. She acknowledged her own reaction to the incident in saying she was “sorry for the pain and fear you must be feeling and the trauma that you, too, must be feeling.” She also talked about not wanting to “go the rest of the year” without being out there for her fans; at this point, her tour has been suspended only until June 5. There is nothing I or anyone can do to take away the pain you are feeling or to make this better,” she said to the victims of the attack and their loved ones. “However, I extend my hand and heart and everything I can possibly give to you and yours, should you want or need my help in any way.” Those who were most tragically affected, Grande said, “will be on my mind and in my heart everyday and I will think of them with everything I do for the rest of my life.” View Instagram post Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nEquality, not feminism, is the watchword at ‘Wonder Woman’ premiere By Sonaiya Kelley Victoria Ikerd from San Diego, left, and Sylvia Vale from Culver City strike their best Wonder Woman pose. (Genaro Molina / Los Angeles Times) The stars of Warner Bros.’ “Wonder Woman” took to the red carpet outside Hollywood’s Pantages Theatre Thursday night to celebrate the film’s premiere with a unified message. It just wasn’t the message some people might expect. “I think the world needs all types of superheroes,” director Patty Jenkins said when asked why we need Wonder Woman. “What a beautiful message right now because we’re in a dark place, and that’s the only way we’re going to get to the other side, if everyone becomes a hero.” (Warner Bros. canceled the film’s London premiere after Monday’s attack in Manchester.) Despite the obvious girl power on display, many of the film’s stars and creators shied away from identifying it as a feminist film, hoping not to isolate the male fans in attendance. SEE PHOTOS FROM THE “WONDER WOMAN” PREMIERE » “I think that the film just takes a great character and tells a great story about how that character came to be,” Charles Roven, the film’s producer, told the Los Angeles Times. “Obviously the character wouldn’t be who she is if she wasn’t a woman, but she’s a very specific woman,” Roven added. “There’s no other superhero character in the DC Universe who embraced their legacy and knew what they wanted to be and became [it]. And that’s completely inspirational to everyone, not just women.” Read More Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nBella Thorne and Scott Disick together in Cannes? ‘Legit nothing’ By Christie D’Zurilla (Joshua Blanchard / Getty Images, left; Lars Niki / Getty Images) In what’s been called a battle of strategic hookups between exes Kourtney Kardashian and Scott Disick, Bella Thorne has put up a white flag and flown away. Disick, 34, and Thorne, 19, were seen Monday at LAX on their way to the Cannes Film Festival, where — surprise! — Kardashian, 38, was already hanging out and getting handsy with Younes Bendjima, a 24-year-old boxer-turned-model. According to E! News, the latter twosome is for real but keeping it light. The Kardashian ex and the actress from “The DUFF”? Perhaps not so much. Thorne and Disick raised eyebrows Wednesday with a high-profile cuddle-fest by a pool in Cannes. Alas, by Thursday, word has it via TMZ, Thorne wasn’t comfortable with her party-boy travel partner when he got his drink on: After tweeting Thursday that “Yo this #cannes fancy life isn’t for me,” she told one person that she had been doing “Legit nothing trolololo” with Scott and another, “Hahahah I’m not talking to scott or anyone else.” “Scott is partially using Bella and a few other girls as a crutch to make Kourtney upset and feel jealous,” a “Keeping Up With the Kardashians\"-related source told People on Thursday, sounding like a description of an upcoming episode of the show. “They are both playing this ‘game’ with each other and at the moment neither one of them are backing down.” Around 3 a.m. Friday, Cannes time, Disick was paying attention to another lady, putting this pic of his and Kardashian’s 4-year-old daughter, Penelope, up on Facebook: Um, hashtag #supersad? “Bye Cannes you were boring” Thorne said Friday on Snapchat, posting video from the seat of what appeared to be a private plane. Kardashian, Bendjima and half-sis Kendall Jenner left Cannes on Friday as well. Yo this #cannes fancy life isn't for me — BITCHIMBELLATHORNE (@bellathorne) May 25, 2017 @bellathorne bells, what were you doing with Scott? — chrystal (@justintheslayer) May 25, 2017 Legit nothing trolololo https://t.co/t9eW4B17oI — BITCHIMBELLATHORNE (@bellathorne) May 26, 2017 Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nNetflix cancels London premieres of ‘Orange Is the New Black’ and ‘GLOW’ By Libby Hill The fatal terrorist incident at an Ariana Grande concert Monday in Manchester, England, continues to resonate throughout the entertainment industry. Netflix canceled its plans for a London premiere for Season 5 of “Orange Is the New Black” and the pilot for “GLOW,” the latest series from “Orange” creator Jenji Kohan. “Following the terrible events in Manchester on Monday night, we have decided to cancel our special screening of ‘Orange Is the New Black’ and ‘GLOW’ on Tuesday [May 30],” a Netflix spokesperson told The Times on Friday. “Our thoughts are with all of those affected by this tragedy.” According to those knowledgeable about the decision, the streaming service’s choice to forgo its screenings comes from internal discussions only, not from any pressure from local authorities. This is just the latest cancellation in the wake of Monday’s tragedy, which took the lives of 22 individuals, including victims as young as 8 years old. On Wednesday, Warner Bros. scuttled plans for a London “Wonder Woman” premiere, originally scheduled for May 31. Similarly, Universal Pictures announced Thursday that it had canceled its London premiere for “The Mummy” originally slated for June 1. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nOasis’ Liam Gallagher schedules Manchester benefit show By Mikael Wood (Ken Hively / Los Angeles Times) Former Oasis frontman Liam Gallagher will play a hometown concert next week in Manchester, England, to benefit the families of Monday’s bombing at the Manchester Arena. “It’s outrageous,” the singer told the Manchester Evening News regarding the terrorist attack that killed 22 people following a concert by Ariana Grande. “There are kids and people dying all over the world. And for what?” He went on to say, “I want to try and help pick people up. People like me, doing what we do, it’s our duty to give people a good time.” The show, scheduled for Tuesday night at the O2 Ritz, will serve as Gallagher’s first solo gig and comes ahead of the release of his debut solo single, “Wall of Glass,” from an album expected in October. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nBody-slamming? Late-night hosts remind us that Donald Trump once did that on TV By Yvonne Villarreal Lest America forget the nation’s history of political candidates with body-slamming tendencies, the late-night circuit offered a refresher course Thursday night. Playing catchup to Wednesday’s news that Greg Gianforte, the billionaire Republican candidate in Montana’s special congressional election, had allegedly body-slammed a Guardian reporter after the journalist asked him about the Republican healthcare bill, TV hosts weighed in on the matter. “Think about that,” “Late Night” host Seth Meyers said. “The GOP healthcare plan is so bad, Republicans would rather body-slam reporters than answer a question about it. “His response to the question,” Meyers continued, “was to give the reporter a preexisting condition.” “Late Show” host Stephen Colbert expressed faux skepticism about Gianforte’s ability to move past the incident and win the election. “That happened the night before the election,” Colbert said. “I just don’t know how anyone could vote for a candidate who body-slams people.” Cue a clip of Donald Trump performing such a move in 2007 when he appeared on “WrestleMania 23\" and tackled WWE Chairman Vince McMahon to the ground before shaving his head. “I forgot,” Colbert said after playing the clip. “Nothing matters.” During his “A Closer Look” segment, Meyers also played the Trump clip. “That was a thing, a real thing that happened. and we still said ‘Yeah, he should be president.’” For the record: Gianforte won Montana’s special election Thursday. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nA Star Is Born: Stevie Nicks turns 69 today By Los Angeles Times Staff (Lori Shepler / Los Angeles Times) I think if people like to dress like a gypsy and they get a little inspiration from me to do it, then it’s great. It’s definitely something everyone should try at least once in their lives. Dress like a gypsy! — Stevie Nicks, 1997 FROM THE ARCHIVES: Airy Godmother Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nFor the 40th anniversary of ‘Star Wars,’ see how fans packed L.A. theaters in 1977 By Los Angeles Times Staff When the original “Star Wars” opened on May 25, 1977, only about 40 theaters across the country initially screened the movie. In Los Angeles, fans packed showings in ways theater managers and moviegoers had never seen. For the 40th anniversary of “Star Wars,” we revisit this story examining the earliest stages of the “Star Wars” phenomenon. The Times originally published this story on June 4, 1977. Read More Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nGeorge Lucas predicted ‘Star Wars’ Disney future in 1977 interview with The Times By L.A. Times staff Happy 40th anniversary, “Star Wars”! Before the first-ever “Star Wars” premiered on screens across America on May 25, 1977, Los Angeles Times writer Paul Rosenfield sat down with the creator of a galaxy far, far away. Then 33, George Lucas was just a few days shy from the release of his “space opera,” prophetically claiming that “Star Wars” was the movie he thinks “Disney would have made when Walt Disney was alive.” Who knew decades later that the droids and the mouse would reside in the same castle? This story was originally published on June 5, 1977, and titled, “Lucas: Film-Maker With the Force.” (Also from our archives, read The Times’ original “Star Wars” review here.) I think of this as a movie Disney would have made when Walt Disney was alive ... I call it ‘space opera.’ That’s a genre that’s been around a long time, in the books of Burroughs and Heinlein, but never really done on film. — George Lucas in 1977 Read More Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nGuns N’ Roses is playing Los Angeles again By Mikael Wood Guns N’ Roses will play two hometown concerts this fall, the reunited Los Angeles hard-rock band announced Thursday, one Nov. 24 at Staples Center and another Nov. 25 at the Forum. The dates are part of a new extension of GNR’s Not in This Lifetime Tour, which launched in April 2016 with a show at the Troubadour that marked the first time in decades that frontman Axl Rose had performed in public with guitarist Slash and bassist Duff McKagan. The tour went on to hit Coachella and Dodger Stadium. Opening acts for the L.A. shows weren’t announced, but GNR revealed that country singer-songwriter Sturgill Simpson will warm up crowds at stadium shows in August in Denver; Little Rock, Ark.; and Miami. Other acts with opening slots on the tour include ZZ Top, Deftones and Royal Blood. Tickets for the newly scheduled concerts go on sale June 3. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nClaire Foy shoots down Lisbeth Salander rumors: ‘I don’t know about any of this’ By Glenn Whipp Claire Foy (Jennifer S. Altman / For The Times) Claire Foy’s sister called her last week, none too pleased that her sibling hadn’t told her that she’d be playing Lisbeth Salander in “The Girl in the Spider’s Web,” the long-delayed follow-up to the 2011 David Fincher film “The Girl With the Dragon Tattoo.” “My sister’s like, ‘Oh, what are you doing?’ and I was like, ‘I’m not doing anything! I don’t t know about any of this!’” Foy told The Times Wednesday in an interview before an Emmy season promotional event for the actress’ Netflix series, “The Crown.” “It’s really weird,” Foy added. “I’ve never experienced that before where there’s a rumor about a possible job like this. It’s very surreal.” News broke last week that Foy was either “in talks,” “eyeing” or had been all but cast to play Lisbeth in the reboot of the Stieg Larsson book series. So is Foy, who plays Queen Elizabeth on “The Crown,” even in the running? “No. I’m not even in the same arena,” Foy said. “I can’t even contemplate doing anything at all, to be honest, at this present time.” The 33-year-old British actress just finished shooting Season 2 of “The Crown” last week. The ambitious series requires a nine-month commitment, meaning that Foy hasn’t had much down time the last two years. She also has a 2-year-old daughter with her husband, actor Stephen Campbell Moore. So you can understand why, when asked about her immediate future, she emphatically states: “Good God, no. I have got no plans to do anything.” Those sentiments would seem to preclude her from “The Girl in the Spider’s Web,” which is scheduled to begin filming in September to make an Oct. 15, 2018, release date. Then again, when asked what kind of role she’d like to do after playing the reserved Elizabeth, a woman nicknamed “Shirley Temple,” Foy replied: “I think I need to play somebody who expresses themselves and is able to communicate on a more open level, something really different.” Like the avenging anti-heroine Lisbeth? “Well ...” Foy answered, with a hint of a smile. “We’ll just have to wait and see.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nSony taps Gina Prince-Bythewood to direct ‘Spider-Man’ spinoff ‘Silver & Black’ By Libby Hill (Ricardo DeAratanha / Los Angeles Times) Sony continues to get its superhero ducks in a row, with Deadline reporting Thursday that the studio had tapped Gina Prince-Bythewood to direct “Silver & Black,” a film centered around comic book characters Silver Sable and Black Cat. Prince-Bythewood also will rewrite the script for the film, originally written by Christopher Yost, screenwriter of “Thor: The Dark World.” Silver Sable and Black Cat are characters that originated in correlation to Spider-Man and have served as both allies and antagonists to the web-slinging superhero over the years. “Silver & Black” is the latest Spidey-related endeavor for Sony, with “Spider-Man: Homecoming,” starring Tom Holland, premiering July 7, and “Venom,” starring Tom Hardy as the sometimes villain, sometimes anti-hero, hitting theaters Oct. 5, 2018. The film will not be Prince-Bythewood’s first dalliance with superheroes. She directed the pilot for Freeform’s upcoming series “Marvel’s Cloak & Dagger,” about two teenagers learning to deal with both superpowers and love. Prince-Bythewood is an experienced director of critically acclaimed films including “Love & Basketball” and “Beyond the Lights,” and she is well-versed in the world of television, where Fox’s “Shots Fired,” the show she created and produced with husband Reggie Rock Bythewood, just concluded its first season. The director becomes the latest woman tapped to helm a superhero film, with Patty Jenkins’ “Wonder Woman” debuting in theaters June 2. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\n‘Happy puking’: ‘Baywatch’ is the summer blockbuster critics love to hate By Christie D’Zurilla × Dwayne Johnson, Zac Efron and Priyanka Chopra star in “Baywatch.” What’s more fun than seeing the new “Baywatch” movie? Having movie reviewers see it for you! Los Angeles Times critic Jen Yamato was in the Enjoy It for What It Is camp, describing the film thusly: \"[I]t not only owns its dumbness but hurtles itself all the way back around through a flurry of genitalia jokes and F-bombs to splash unapologetically in an R-rated surf of winking postmodernism, led by the charismatic Dwayne Johnson, Hollywood’s most unsinkable movie star.” But although not everyone hates it — 64% of audiences dug it, according to Rotten Tomatoes — a lot of reviewers put the bouncing-beach-bodies flick firmly in its place, damning it, and then damning it with faint praise. That said, here are a few snacks, both bad and (relatively) good, from the “Baywatch” snark buffet. Over at the Chicago Tribune, they took the “Yeah, and ...?” approach to the review. The Bad: “The movie’s comic instincts... are consistently coarse and frequently scrotal.” The Good: “The bodies on screen are pretty, which I seem to remember was a selling point of the 1989-2001 TV series.” As we said, yeah, and ...? The Roger Ebert website perhaps cut closest to the bone, pulling few punches. The Bad: \"[T]his is another one of those raunchy comedies that’s barely a movie, that looks like it was edited by dumping a bunch of footage into whatever movie-cutting software they’re using and hitting ‘randomize.’” The Good: \"[T]he movie has a pervading air of crass amiability about it — it’s almost like a two-hour end-credits gag reel. (Nevertheless, it contains an end credits gag reel.) Now could you tell us what you really think?: Rolling Stone painted a vivid picture of the “Baywatch” experience. The Bad: “Think of yourself sitting down for a big two-hour wallow in instant stupid with a vat of popcorn, slathered in fake butter and possibly a mound of melted M&Ms on top. It feels great chugging it down, then your stomach hurts, your head aches and you puke the whole thing up so you can forget about it in the morning. That’s ‘Baywatch’ in a nutshell. Happy puking.” The Good: “Of the recent spate of moldy TV material morphing into movies, with ’21 Jump Street’ on top and ‘CHIPs’ bringing up the rear, ‘Baywatch’ barely escapes the basement. One reason it does: The Rock.” Helpful! Turns out if you liked “21 Jump Street” and “CHiPs,” this flick is for you! The New York Times loosened up its necktie for this one. The Bad: “The digital effects — fire and water, mostly — are lackluster, and the whole thing has a crummy, overcast, second-rate-theme-park look to it.” The Good: “Like its source material, “Baywatch” is sleazy and wholesome, silly and earnest, dumb as a box of sand and slyly self-aware. It’s soft-serve ice cream. Crinkle-cut fries. A hot car and a skin rash. Tacky and phony and nasty and also kind of fun.” Tacky? Phony? Nasty? We didn’t know it was a date movie. The Washington Post, of course, just couldn’t leave politics out of it. The Bad: “It’s no shock that the women in ‘Baywatch’ don’t have much to do beyond look good. ... Maybe dodging bad lines was a relief for the actresses. It’s not like the screenplay, by Damian Shannon and Mark Swift, gives performers a lot to work with.” The Good: “If, indeed, Dwayne ‘the Rock’ Johnson ditches Hollywood to become our next commander in chief, ‘Baywatch’ may be singled out as the low point of his pre-political career.” Well, at least Johnson has that out of the way. The Tampa Bay Times went deadpan. The Bad: “Imagining Johnson and genetically gifted co-stars in swimsuits is all it took to pitch Baywatch. Director Seth Gordon and six writers didn’t come up with much beyond that.” The Good: “What Baywatch has in its favor is Dwayne Johnson fireman-carrying a dead weight comedy to safety.” We think that’s a compliment. Maybe. Variety noted the film’s nods to current market and societal trends. The Bad: “‘Baywatch’ ... is a stupidly entertaining trash folly, the kind that could only be made today: an obscenity-and-insult-laced, aggressively ‘competent’ adaptation of a 25-year-old TV show that manages to repackage every aspect of the series except, perhaps, the reason it was popular in the first place. The Good: “They wear their butt-hugging red bathing suits with dignity and pride, which makes this a highly sexually responsible ‘Baywatch.’” The reviewer at the New York Post appeared to be familiar with the TV series’ global success. The Bad: “Even the action scenes need CPR, often undermined by effects so chintzy, you wonder if the money intended for them was instead eaten up by the production’s seven-figure waxing budget.” The Good: “On the bright side, it’ll probably do killer business in Germany.” Wait, were they just dissing the Hoff? Finally, one need go no further than the AV Club to understand Rotten Tomatoes’ 19% positive critics’ rating. The Bad: \"[N]obody —not even the filmmakers —cares about ‘Baywatch’ all that much. Yet the joke’s on them: In spoofing something so forgettable, they’ve made something even less memorable.” The Good: “Nobody cares about ‘Baywatch.’” ‘Nuff said. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nSeth Meyers says Trump’s ‘cruel’ budget cuts would harm the president’s supporters most By Chris Barton After a number of weeks filled with late-breaking developments on the Trump administration’s apparent ties to Russia, Wednesday night was a chance for late-night hosts to sort of catch their breath and essentially choose their own adventure. Jimmy Kimmel focused on the seemingly less-than-happy photos of the pope with President Trump that circulated on Wednesday, while Stephen Colbert took a brief swipe at the $2-trillion double-counting error in Trump’s budget. Seth Meyers, however, took advantage of his show’s “A Closer Look” segment to make time for all of the above. After addressing the photo of the stone-faced pope with Trump, Meyers recapped the latest developments in the investigations into whether, among other things, the president engaged in obstruction of justice by firing FBI Director James Comey. But then Meyers took on the administration’s proposed federal budget, which could cause harm to many. While noting the budget amounts to a wish list that Congress will battle over, Meyers said the proposal’s harshness was not to be discounted. “What someone wishes for tells you a lot about that person,” Meyers said before recounting the many cuts the budget proposes to Social Security and Medicaid. The show then rolled a number of clips in which Trump the candidate promised not to do just that. “This budget lays bare just how much of a fraud Trump’s campaign was,” Meyers added, noting how hard many of these cuts to the social safety net would hit Trump supporters. He then squared off the pointed words of Trump the candidate versus his actions as president to underscore his point. “Maybe it’s better those two never meet,” Meyers said. “I think they would hate each other.” Watch the clip above. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nUniversal Pictures cancels London premiere of ‘The Mummy’ in wake of Manchester bombing By Libby Hill × Tom Cruise, Russell Crowe, Annabelle Wallis and Sofia Boutella star in “The Mummy.” The specter of Monday’s terrorist attack in Manchester, England, continues to loom large. Universal Pictures announced Thursday morning the cancellation of next week’s London premiere of “The Mummy,” the second such development this week. “All of us at Universal have been devastated by the terror attack in Manchester and continue to stand with the community and country as it recovers,” the statement from the studio read. “Out of respect to those affected by this tragedy we have decided not to move forward with the London premiere for ‘The Mummy’ scheduled to take place next week.” The film, starring Tom Cruise and Russell Crowe, serves as the launch of Universal Pictures’ ”Dark Universe,” an extended universe that will see the reboot of several classic monsters from the Universal vault, including the Invisible Man and Frankenstein’s Monster. Cancellation of the June 1 London premiere for “The Mummy” comes just a day after Warner Bros. nixed its May 31 “Wonder Woman” London premiere. Ariana Grande, whose concert was targeted in the Manchester attack that killed 22 people, similarly suspended her tour through June 5 on Wednesday. A statement from the artist’s representatives said the suspension comes “until we can further assess the situation and pay our proper respects to those lost.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAl Gore on the French Riviera: Why he was reluctant to make ‘An Inconvenient Sequel’ By Kenneth Turan Former Vice President Al Gore arrives on the red carpet for the screening of “The Killing of a Sacred Deer” at the Cannes Film Festival. (Alberto Pizzoli / AFP / Getty Images) It has not been a very good year for those concerned with climate change. The U.S. is considering leaving the landmark Paris climate pact, a hostile appointee leads the Environmental Protection Agency, and right-wing websites chortle, “Trump’s Latest Move Will Make Al Gore Fry.” But is Al Gore himself despondent or depressed about it all? Not in the slightest. “I’ve been inoculated in the year 2000,” he says, combining a burst of genial good humor with a reference to his presidential election loss to George W. Bush. “I now have a resistance to being disheartened, the antibodies are still thriving in my bloodstream. “As we all learn, one of the hidden secrets of the human condition is we learn the most from our most painful experiences.” Former Vice President Al Gore at the Carlton hotel for the Cannes Film Festival, which is screening his documentary “An Inconvenient Sequel.” (Stephanie Cornfield / For The Times) To spend time with Al Gore is to meet a man enough at ease with himself to dress as if for a Senate hearing in white shirt, suit and tie even though he’s in the south of France; a warm, engaged, surprisingly funny individual whose innate courtesy has him personally hang a reporter’s sports coat on a nearby hotel room hanger. Yes, he does tend to stay on message when he talks (how could he not) and he likes to draw graphs in the air with his hands (“I’m going to get a little geeky for a moment,” he apologizes with a smile, “I’m sorry, it’s a failing”). But he combines this with good-humored self-awareness and a fiercely committed intelligence. “If you think I’m earnest now, you should have seen me earlier,” he says. “You can’t change who you are. At times I’ve tried, but I’m old enough to stop worrying.” Gore is in Cannes to promote the worldwide release of an impassioned and involving new documentary, “An Inconvenient Sequel.” Due in U.S. theaters on July 28, it brings us up to speed on where the battle against climate change stands more than a decade after the Oscar-winning documentary “An Inconvenient Truth.” “I’m here for a lot of to-ing and fro-ing” is how Gore puts it. “I think I’ve done 75 seven-minute interviews — Japan, Russia, Brazil, everywhere. “The day before yesterday I was live on [the French cable channel] Canal Plus when the interpreter talking in my earpiece was evacuated from his building because of a bomb scare. The questioner was going a mile a minute in French, but because of those 75 seven-minute interviews, I picked up enough key words to fight my way through it.” Gore has been concerned with climate change since he took a class with pioneering global warming theorist Roger Revelle as a college student in the 1960s. Not only did Gore “never imagine when I was a young man that this would become an all-consuming body of work for me,” he also never anticipated that the work would involve the movies. More than that, he was frankly dubious about both of his films. Read More Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nEllen DeGeneres says she’s ‘in’ for a Netflix stand-up comedy special By Christie D’Zurilla Ellen DeGeneres is working on a new comedy special — for the first time in a very long time — and this time she’s working with Netflix. “Looks like it’s been 15 years since you did a stand-up special. ... How about one for Netflix?” the streaming service asked her Wednesday on Twitter. Minutes later, DeGeneres replied, “Let me think about it. Ok I’m in.” Here’s how “in” she is: “I’m writing it now, I can’t wait,” DeGeneres said in a statement confirming the upcoming gig. “I’ll keep you posted when and where I’m gonna shoot my Netflix special. I’m excited to do it; I’m excited for you to see it.” Previously, HBO was home for DeGeneres’ comedy specials: her “One Night Stand” in 1992, “Ellen DeGeneres: The Beginning” in 2000 and “Ellen DeGeneres: Here and Now.” The second and third shows notched two Emmy nominations each. In March, the former sitcom star announced she’d be returning to prime time with “Ellen’s Game of Games,” which she’s hosting for six episodes on NBC. No air dates have been set. “It’s going to be like a combination of ‘American Ninja Warrior,’ ‘RuPaul’s Drag Race’ and a water park,” DeGeneres said in a statement. “OK, it’s nothing like that, but you should still watch.” Looks like it's been 15 years since you did a stand-up special, @TheEllenShow. How about one for Netflix? — Netflix US (@netflix) May 24, 2017 Let me think about it. Ok I'm in. https://t.co/kUAdHyXAjS — Ellen DeGeneres (@TheEllenShow) May 24, 2017 UPDATES 2:30 p.m.: This article was updated with confirmation from Netflix and a statement from DeGeneres. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nChris Cornell’s body has been cremated, report says; funeral set for Friday By Christie D’Zurilla Chris Cornell in 1991. (Mel Melcon / Los Angeles Times) The body of Soundgarden frontman Chris Cornell, who died last week in Detroit, was reportedly cremated Tuesday in Hollywood, and a funeral is planned for later this week. Widow Vicky Cornell, brother Peter Boyle and friends Linda Ramone and singer J.D. King were at Hollywood Forever Cemetery for the cremation, sources familiar with the service told TMZ. Cornell’s body was flown to Los Angeles from Detroit on Sunday, family attorney Kirk Pasich told Rolling Stone on Monday, and a private funeral will be held Friday. Pasich told Variety on Sunday that public memorials will be held “when it’s decided.” The short time between the end of Soundgarden’s May 17 show and 52-year-old Cornell’s death was chronicled in a police report obtained by the Detroit News. He and the band walked offstage around 11:15 p.m. May 17. Fifteen minutes later Cornell was in his hotel room, the report said, where bodyguard Martin Kirsten (who used to work for and date Heidi Klum) helped him fix his computer and gave him two Ativan. At 11:35 p.m. Cornell was talking to his wife, Vicky, who said Friday through her attorney that she had been concerned because her husband was slurring his words and told her he might have taken a few too many anxiety pills. She called Kirsten at 12:15 a.m. Thursday and asked him to check on the singer, the report said; the bodyguard kicked in the hotel room door, then the locked bathroom door, and found Cornell. At his final show, Cornell seemed “high” and “was out of character from note 1,” lead sound engineer Ted Keedick told TMZ in an interview published Wednesday. He said the Soundgarden frontman did not appear depressed. However, Keedick said: “I’d never heard his voice that way before. He was having serious control problems.” One concert-goer told the Detroit News last week that as far as she could tell, Cornell’s final show “was honestly great. Nothing seemed off.” Tuesday at Detroit’s Fox Theatre, the site of that last performance, Norah Jones played a tribute to Cornell: an acoustic version of “Black Hole Sun.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAriana Grande suspends tour through June 5 By Christie D’Zurilla Ariana Grande’s tour has been suspended through June 5, her management team said Wednesday. That includes the cancellation of concerts planned for Thursday and Friday at London’s O2 Arena. Twenty-two people died and at least 59 were injured in a suicide attack Monday night outside Manchester Arena, where Grande had just concluded a stop on her Dangerous Woman Tour. “We ask at this time that we all continue to support the city of Manchester and all those families affected by this cowardice and senseless act of violence,” the singer’s reps said in a statement. “Our way of life has once again been threatened but we will overcome this together.” The dates that have been put on hold “until we can further assess the situation and pay our proper respects to those lost,” the statement said, are: London, May 25-26\n\nAntwerp, Belgium, May 28\n\nLodz, Poland, May 31-June 1\n\nFrankfurt, Germany, June 3\n\nZurich, Switzerland, June 5 The next tour stop after that is a June 7 concert in Paris. Speculation that the tour would be put on hold has been rife since the day after the bomb went off — actually, immediately afterward and before the number of casualties was known, many on social media were already worried that shows would be axed — but the situation had been in limbo until now. An “exhausted\"-looking Grande returned home Tuesday to Florida, where she and her mother were met at the airport by Mac Miller, who hugged and kissed his girlfriend in an “emotional reunion.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nWarner Bros. cancels London ‘Wonder Woman’ premiere following Manchester attack By Josh Rottenberg In the wake of Monday’s deadly terrorist attack at an Ariana Grande concert in Manchester, England, Warner Bros. has announced it is canceling a planned premiere in London next week for its superhero film “Wonder Woman.” “Our thoughts are with those affected by the recent tragedy in the UK,” the studio said in a statement. “In light of the current situation, we will not be proceeding with our plans for the premiere and junket activities in London.” Starring Gal Gadot and directed by Patty Jenkins, the highly anticipated film – which is set in Europe during World War I – will hold its U.S. premiere on Thursday in Los Angeles. It arrives in theaters June 2. The studio faced a similar situation last year when its European premiere of “Batman v. Superman” was scheduled to be held in London just hours after terrorist attacks struck Brussels, killing 32 people and injuring many others. In that case, the studio said in a statement that it had decided to go ahead with the event “rather than yield to terror.” But as Britain mourns the 22 people killed in the Manchester bombing, with scores more wounded, and with the country’s security threat level raised to its highest, signaling the possibility of another imminent attack, Warner Bros. clearly determined that the circumstances called for a different course of action. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nNew ‘Spider-Man: Homecoming’ trailer shows off Spidey’s tricked-out, Iron Man-style super-suit By Josh Rottenberg Spider-Man has a few new tricks up his spandex sleeve, with the latest trailer for Sony’s upcoming franchise reboot “Spider-Man: Homecoming” offering a deeper look at Spidey’s newfangled, tech-enhanced super-suit. Courtesy of billionaire inventor/playboy Tony Stark, the suit is embedded with Iron Man-style technology. A Jarvis-like computer assistant informs Peter Parker (Tom Holland) of the “576 possible web shooter combinations” he has at his command. A parachute can also be deployed out of the back of the suit when needed, and the chest piece can detach and turn into a drone. For those who prefer their Spidey old-school, though, the trailer also promises a return to Parker’s teenage roots — though with a decidedly cockier spin than the shy, alienated high school nerd we’ve often seen depicted in the comics and onscreen. Holland’s Parker is clearly feeling his superhero oats, boasting to Stark of taking down a petty bike thief and raring for bigger challenges, Spanish quiz or no Spanish quiz. (Cue Michael Keaton’s villainous Vulture.) Informed by his best friend Ned that Stark has installed a “training-wheels protocol” on his super-suit to disable some of its abilities, Parker gripes, “I’m sick of Mr. Stark treating me like a kid.” “But you are a kid,” Ned reminds him. “Yeah,” Parker says, “a kid who can stop a bus with his bare hands!” “Spider-Man: Homecoming” hits theaters July 7. Watch the trailer below. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nPerformers move U.K. concerts after Manchester bombing, but for some, the show goes on By Christie D’Zurilla Floral tributes in Manchester’s St. Ann’s Square on May 24, 2017. (Jeff J. Mitchell / Getty Images) Manchester Arena has postponed concerts by Take That, an English pop group from the city that was to play there Thursday, Friday and Saturday. But it’s working to see that a KISS show proceeds next week. “Unfortunately, due to the tragic events that unfolded on Monday night, it is not possible for the concerts to take place,” the arena said in a statement. “These have now been postponed and more information will follow.” In another statement, the arena cited the ongoing police investigation. Take That had previously postponed a show at another location, saying Tuesday on its website, “Out of respect to all of the people and their families that were affected by the horrific incident last night at the Manchester Arena, we have decided to postpone our show tonight in Liverpool. Our thoughts and prayers are with you all.” KISS is scheduled to play Manchester Arena on Tuesday, and the venue said it is working on that show with promoters and police. pic.twitter.com/HkR9ilSTSt — Manchester Arena (@ManchesterArena) May 23, 2017 As far as the Ariana Grande concerts set for London’s O2 arena on Thursday and Friday, as of Wednesday morning no decision had been made. “We’re still in contact with the tour promoters regarding a final decision,” the O2 team said on Twitter Wednesday morning. “As yet the tour is not officially postponed or canceled, despite media reports.” Katy Perry, Lorde, Lana Del Rey, Imagine Dragons, Shawn Mendes and the Chainsmokers will all go ahead with performances this Saturday and Sunday in Hull, England, at BBC Radio 1’s Big Weekend, according to TMZ. Hull is about two hours from Manchester. Blondie postponed a Tuesday-night show at the Round Chapel in London, saying in a series of tweets the day of the show that the move was “out of respect for the victims of the terrible attack at the Manchester Arena,” and noting that plans to reschedule the show were in the works. The Afghan Whigs have moved their Friday show to the O2 Ritz Manchester from Manchester Cathedral, which, as of Wednesday morning, was still cordoned off by police. The Ritz said Tuesday that it would stay silent on social media for two days “in sympathy with those who lost their lives or were injured, physically or mentally,” but that it would have news Thursday about any rescheduled shows. Other acts that had been scheduled to perform in the Manchester area but not in the arena in coming days, including Colour of Noise, Damien Dempsey, Shriekback and the Cranberries, canceled their shows for reasons unrelated to the suicide attack. Most announced those plans well before Monday. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nA Star Is Born: Bob Dylan turns 76 today By Los Angeles Times Staff (Lori Shepler / Los Angeles Times) When people think of me, they are not necessarily going to buy the latest record anyway. They may buy a record from years ago. Besides, I don’t think interviews sell records. — Bob Dylan, 1985 FROM THE ARCHIVES: Bob Dylan -- Still A-Changin’ Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nLate-night TV hosts, U2 plead for love after Manchester bombing By Robert Lloyd After the news, late-night talk shows are television’s most topical forum. We turn there for the satirical distance and perspective that might allow us to process the day and get to sleep – for laughs when laughter is appropriate, but also for a thoughtful response when events go beyond ordinary human folly to the terrible and unthinkable. Monday’s suicide bombing after an Ariana Grande concert in Manchester, England, was on the minds of some late-night hosts Tuesday night. “There’s really nothing you can say that can approach the shock and the grief of the victims and their families,” said Stephen Colbert on “Late Show,” asking his audience to go online to hear what his CBS colleague James Corden, who follows him on “The Late Late Show,” had to say the night before. “All we can add here,” said Colbert, “is that following acts of senseless violence like this, it’s all the more important not to be controlled by fear, but instead to be reminded by the action of people of Manchester who rushed to the aid of their friends and strangers alike. It is just more proof that evil cannot succeed as long as good people are willing to love each other.” On NBC’s “Late Night,” host Seth Meyers had similar thoughts. “At its best, being at a concert is an incredible collective experience,” he said. “It’s a chance through a shared love of music to connect with, to sing with and to dance with people you don’t know.... And so this comes down to the way we treat strangers, and while some cowards chose to treat strangers with hate, from everything I read, Manchester was filled with people last night who provided aid and comfort to help victims who were total strangers to them.” He ended with a “plea for all of us to not need a tragedy to remind us of the importance of treating those we do not know with love instead of hate.” The Irish band U2, in Los Angeles to perform concerts of their own, were among Jimmy Kimmel’s guests on ABC’s “Jimmy Kimmel Live.” Kimmel brought up Manchester. “I imagine that is something you guys have been thinking about,” he said. “They hate music, they hate women, they even hate little girls – they hate everything that we love,” lead singer Bono replied. “The worst of humanity was on view in Manchester last night – but so was the best, as people took perfect strangers into their houses and queued up for blood banks. Manchester has an undefeatable spirit, I can assure you.” Kimmel wondered how growing up in Northern Ireland in an era of political and sectarian violence had affected their music. “It was so commonplace for a number of years,” answered the Edge, the band’s guitarist, “that it just became a constant background to life. And occasionally something particularly awful would happen and it would really affect you – but that was almost the worst of it. You got to the place where [it was] just ongoing every week, every month.” Punk rock helped, added Bono. “It made us suspicious of partisanship, it made us up suspicious of sectarian ideas.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nElisabeth Moss and BBC America join forces for Typhoid Mary limited series By Libby Hill (Patrick T. Fallon / For The Times) “The Handmaid’s Tale” star Elisabeth Moss is wasting no time in lining up new projects. BBC America announced Tuesday its partnership with Moss and Annapurna Television in developing “Fever,” a limited series focused on the tale of “Typhoid Mary.” The series will adapt the novel of the same name, written by Mary Beth Keane and set in early 20th century New York, where Mary Mallon is unknowingly transmitting typhus to those around her. “She was an immigrant in turn-of-the-century New York, a time of huge change and progress in America,” Moss said of the character in a statement released by the network. “She was incredibly unique, stubborn, ambitious and in fierce denial of any wrongdoing until her death where she lived out her days imprisoned on an island just off of the Bronx in N.Y. “She is incredibly complicated, something I seem to enjoy playing,” said Moss. Moss will star in the series and serve as executive producer alongside director Phil Morrison (“Enlightened,” “Junebug”) and writer Robin Veith (“The Expanse,” “True Blood”). Annapurna’s Sue Naegle and Megan Ellison will also serve as executive producers. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nUniversal Music Group CEO on Manchester attack: ‘A level of evil beyond comprehension’ By Christie D’Zurilla Lucian Grainge, CEO of Universal Music Group, in November 2016. (Frazer Harrison / Getty Images) Lucian Grainge of Universal Music Group sent a company-wide memo Tuesday, calling it “a day of remembrance” of victims of the suicide attack in Manchester, England, and acknowledging that emotions were raw. \"[W]e grieve for all of those lost there, offering our deepest condolences to their families and loved ones,” said the chief executive of UMG, parent company of Ariana Grande’s recording label Republic, in a note obtained by Variety. Twenty-two people, one only 8 years old, were killed Monday night and at least 59 were hurt when a bomb exploded as Grande’s concert at the Manchester Arena was ending. “This hits home for us as a music company,” Grainge said, “because so many of us, myself included, spend so much time out seeing our artists perform, let alone attending concerts as fans. That’s why we’ve chosen music as our career — or rather music has chosen us.” No UMG employees, including Grande and her crew, were injured in the blast, he confirmed, and help from human resources and security was offered to those with questions or concerns. “That said,” Grainge continued, “the fact that such an unspeakable act can be committed at a place where innocent people — including so many young people — come together peacefully to enjoy music reflects a level of evil beyond comprehension.” READ MORE: Suspected Manchester suicide bomber identified as U.K. son of Libyan immigrants>> Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nAriana Grande returns home to Florida after Manchester attack By Christie D’Zurilla People attending a vigil for Monday’s suicide-attack victims brought flowers to St. Ann Square in Manchester, England, on Tuesday. (Jeff J. Mitchell / Getty Images) Ariana Grande reportedly returned home to Florida on Tuesday after the bombing outside her Manchester, England, concert that left 22 dead and at least 59 injured. As they exited a private plane, Grande, her mom and her dog were met on the tarmac in Boca Raton, E! News said, by family members and rapper Mac Miller, whom the 23-year-old has been dating since last summer. Miller gave Grande a long hug and a kiss, a source told E! “It was a very emotional reunion and they stood talking for a minute before getting into the car,” t", "images": ["https://ca-times.brightspotcdn.com/dims4/default/5906a52/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F98%2F65%2F1ea37af3e339e99a9fe30a3380cb%2Fla-et-ct-espn-layoffs-20151023-001", "https://ca-times.brightspotcdn.com/dims4/default/5d19c4a/2147483647/strip/true/crop/1800x1473+0+0/resize/1200x982!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F94%2Fa2%2Fa985684c27b9b634abfa7e4b15a5%2Fimg-590fd104-turbine-la-et-rosario-dawson-2017-photo", "https://ca-times.brightspotcdn.com/dims4/default/df4e1ec/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fba%2Fa3%2F8f25327d05adc6d658bd1b729a74%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/2605cd4/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F31%2Fd8%2F143878714cf28a75a3237279a0e7%2Fla-et-enrique-iglesias-2017-photo", "https://ca-times.brightspotcdn.com/dims4/default/ac1d0b7/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe7%2Fe8%2Fd6318315f3ac4dcf47b02637f6d7%2Fimg-59142aac-turbine-la-et-lena-dunham-photo", "https://ca-times.brightspotcdn.com/dims4/default/d07dd0d/2147483647/strip/true/crop/1024x734+0+0/resize/1200x860!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd1%2Fa7%2Fed0cbed8051e7fdf0c2845a8113d%2Fla-president-of-the-cannes-film-festival-pierre-lescure-left-and-french-actress-isabelle-huppert-20170523", "https://ca-times.brightspotcdn.com/dims4/default/4379285/2147483647/strip/true/crop/2048x1702+0+0/resize/1200x997!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F74%2F4d%2Fb03e0457573c68cb760cbf996abe%2Fimg-59197cf6-turbine-la-et-debra-winger-photo", "https://ca-times.brightspotcdn.com/dims4/default/1dbb23d/2147483647/strip/true/crop/1024x575+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9f%2Fbf%2F669d0249f8bf5cc9a88d1d70995c%2Fla-1493839553-xwehv8sfdx-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/88f8f80/2147483647/strip/true/crop/2048x1361+0+0/resize/1200x797!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fae%2F57%2Fdbfde2038ec2d741180d3957bef3%2Fimg-59069f9c-turbine-la-et-museum-of-contemporary-art-gala-2017-pic-006", "https://ca-times.brightspotcdn.com/dims4/default/44cbe4f/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc2%2F18%2Fa78f4ae48b1a3eb7bdaca89a8ddc%2Fla-et-mg-roger-moore-died-in-switzerland-20170523", "https://ca-times.brightspotcdn.com/dims4/default/5ee1fc0/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ffd%2F41%2Ff9d7ff5e5ee9903a9914a741ee2c%2Fimg-576aeed8-turbine-la-1466625950-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/0767544/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F69%2Fc2%2Ff97ed18a9e55633e5349b590865a%2Fla-1487975268-rfvrmnyrgd-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/d636b0b/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff2%2F32%2F9f80fe0c8fa1005b27be7c2af541%2Fla-1494776191-nzw5cyrr1b-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/d5370f6/2147483647/strip/true/crop/2048x1361+0+0/resize/1200x797!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fce%2F84%2F08ff476e4243cb68158c80362aa0%2Fimg-53ac7f8c-turbine-la-et-20140626-001", "https://ca-times.brightspotcdn.com/dims4/default/9e24d9d/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff0%2F19%2F5492a7ca2e0e33d898671b1c22a7%2Fla-et-mg-amy-schumer-and-ben-hanisch-20170516", "https://ca-times.brightspotcdn.com/dims4/default/8428731/2147483647/strip/true/crop/2048x1477+0+0/resize/1200x865!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe2%2Ffe%2Fb077182a9a5facb1b8402bf06bf9%2Fimg-590caeed-turbine-la-et-mg-goldie-hawn-and-kurt-russell-walk-of-fame-20170505", "https://ca-times.brightspotcdn.com/dims4/default/85171aa/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe8%2F71%2F02bf20ebded71f3f5c7e0a1d6a58%2Fla-et-mg-zooey-deschanel-baby-name-rock-the-ka-001", "https://ca-times.brightspotcdn.com/dims4/default/1efb6e5/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdd%2F8a%2Feb5f848520ba274eee381b5d7b7f%2Fla-et-mg-tom-daley-and-dustin-lance-black-20170508", "https://ca-times.brightspotcdn.com/dims4/default/f67b02c/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F50%2F30%2F42cadb837140dee48d05be8b191e%2Fimg-590848b4-turbine-la-et-randy-travis-grammy-2000-photo", "https://ca-times.brightspotcdn.com/dims4/default/92eecf0/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fef%2F43%2Fb817ca08242b532fff741da35bcb%2Fla-et-mg-olivia-newton-john-20170530", "https://ca-times.brightspotcdn.com/dims4/default/6d4be5f/2147483647/strip/true/crop/700x394+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F05%2Fb8%2F8ea4040989d3c0e674e598aa9c8a%2F700x394", "https://ca-times.brightspotcdn.com/dims4/default/2d5241d/2147483647/strip/true/crop/1024x682+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc4%2F29%2F14e85f18d8d564c6e2c1585eb133%2Fla-a-candlelit-vigil-to-honor-the-victims-of-monday-evening-s-terror-attack-at-albert-square-on-may-23-20170523", "https://ca-times.brightspotcdn.com/dims4/default/fae426f/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa0%2Fbf%2Ff77280bcb5acc82d75866df07106%2Fimg-592ce176-turbine-la-et-clint-eastwood-photo", "https://ca-times.brightspotcdn.com/dims4/default/b06d700/2147483647/strip/true/crop/1591x2048+0+0/resize/1200x1545!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F3d%2F86%2F3185efbd5763d192ff0dff409c11%2Flat-mg-wintour-wre0051925860-20170505", "https://ca-times.brightspotcdn.com/dims4/default/276e3ca/2147483647/strip/true/crop/2048x1536+0+0/resize/1200x900!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F1f%2Fe1%2F949e102dba27599f3b86314e4431%2Fla-et-20170507", "https://ca-times.brightspotcdn.com/dims4/default/c3bec90/2147483647/strip/true/crop/650x366+0+0/resize/1200x676!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F50%2Fd8%2Fa405bb7e93ca99e63caf9b86ec27%2F650x366", "https://ca-times.brightspotcdn.com/dims4/default/a80e4af/2147483647/strip/true/crop/2048x1555+0+0/resize/1200x911!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fac%2Fed%2F37db2b0cfb3a6a1e290fe394411c%2Fimg-59232a3f-turbine-la-et-st-beyonce-20170522", "https://ca-times.brightspotcdn.com/dims4/default/cdce68a/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F4d%2F28%2F1e28ca41b3587db4cc5ca3215ab4%2Fimg-592bee68-turbine-la-et-ca-wynonna-judd-cat-photo", "https://ca-times.brightspotcdn.com/dims4/default/4d80624/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F4b%2Fd0769c360447452e0d38f5a47555%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/e65dda1/2147483647/strip/true/crop/2048x1448+0+0/resize/1200x848!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff5%2F1d%2F2bb35cd9adfe11809cdc12dd2b1f%2Fimg-5925961a-turbine-la-et-mn-tom-cruise-20170524", "https://ca-times.brightspotcdn.com/dims4/default/7789bfc/2147483647/strip/true/crop/2048x1556+0+0/resize/1200x912!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6e%2Fe1%2Fe029510f883969a236b990103304%2Flat-mg-wintour-wre0051925926-20170505", "https://ca-times.brightspotcdn.com/dims4/default/60681e0/2147483647/strip/true/crop/500x280+0+0/resize/1200x672!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdc%2F52%2Ffbde0bd13803b5141b5192f51450%2Foasis-staples-500.jpg", "https://ca-times.brightspotcdn.com/dims4/default/de436a9/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F43%2F2f%2F6e397ad4542d3a82c853eb4e8d63%2Fimg-573bbe76-turbine-la-1463533286-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/ec1e92f/2147483647/strip/true/crop/1984x1464+0+0/resize/1200x885!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F1b%2F45%2F94f00cd5652cbaa9dea772e403c7%2Flat-roseanne-eafwqugw20111020130929", "https://ca-times.brightspotcdn.com/dims4/default/a2405ac/2147483647/strip/true/crop/600x396+0+0/resize/1200x792!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F28%2F88%2Febfda0c0f44946055aebd2207173%2F6a00d8341c630a53ef0163002d1390970d-600wi", "https://ca-times.brightspotcdn.com/dims4/default/5055fdd/2147483647/strip/true/crop/2048x1354+0+0/resize/1200x793!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fef%2Fc7%2F46b6312ea815dd5afd4bc7ef3e9f%2Fimg-59281f7f-turbine-la-et-annette-bening-20170526", "https://ca-times.brightspotcdn.com/dims4/default/6da3a7e/2147483647/strip/true/crop/800x450+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F3e%2F62%2F856088e5b7574094569f59426e58%2Fla-et-et-kylie-20170526", "https://ca-times.brightspotcdn.com/dims4/default/3ba0835/2147483647/strip/true/crop/2048x1506+0+0/resize/1200x882!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Feb%2Fe4%2F103d6ef136ef878380c43a36681d%2Fimg-591d7628-turbine-la-et-cher-2017-photo", "https://ca-times.brightspotcdn.com/dims4/default/d054ef1/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbb%2F1f%2F816d85935cc69538be4a507cadf8%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/a8f7f77/2147483647/strip/true/crop/2048x1363+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdd%2F7d%2F1668bd3fb3eda392650241b50cd4%2Fimg-59069f9a-turbine-la-et-museum-of-contemporary-art-gala-2017-pic-007", "https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "https://ca-times.brightspotcdn.com/dims4/default/0227ed6/2147483647/strip/true/crop/1509x2048+0+0/resize/1200x1629!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa8%2F5f%2Feb6fcdbb92f5a203d40d219d742b%2Fimg-590fb48f-turbine-la-et-hailee-steinfeld-rain-mtv-2017-photo", "https://ca-times.brightspotcdn.com/dims4/default/2e3e64f/2147483647/strip/true/crop/2048x1536+0+0/resize/1200x900!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fca%2F74%2F6ba307b933c14797416e0dd05fd8%2Fla-fi-tn-snapchat-santa-monica-20160517-snap", "https://ca-times.brightspotcdn.com/dims4/default/1303335/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F66%2F7d%2F65a2762cc22ea1d76ed9126832c4%2Fimg-590c5071-turbine-la-et-adele-green-dress-photo", "https://ca-times.brightspotcdn.com/dims4/default/e90d6c3/2147483647/strip/true/crop/2048x1367+0+0/resize/1200x801!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F93%2Faa%2F17b21c131a13b7473c1956954b2f%2Fla-et-st-claire-foy-the-crown-20161103", "https://ca-times.brightspotcdn.com/dims4/default/aceee28/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F44%2F35%2Fe082fc3100761d65a1eecf206b84%2Fla-1494355940-5snu90t6gd-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/45b240d/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa4%2Fff%2F8a0a497783d03b3fa54271accbfb%2Fla-et-mg-kathy-griffin-performs-in-l-a-20170531", "https://ca-times.brightspotcdn.com/dims4/default/6c009e4/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F7b%2Fb5%2Fb71d23b1ca5d498daf437a5baa18%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/dd1b2c6/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb8%2F15%2Fc3007d78ed167a0819fb2f438ce5%2Fla-et-mg-james-comey-and-cher-20170510", "https://ca-times.brightspotcdn.com/dims4/default/da9fd3a/2147483647/strip/true/crop/1426x2048+0+0/resize/1200x1723!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F95%2F9a%2F93d1173dcc90609247075b90d973%2Fimg-5907c491-turbine-lat-la-et-met-gala-pharrell-williams-wre0051508503-20170501", "https://ca-times.brightspotcdn.com/dims4/default/427d36d/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F3c%2Fc6%2F2b9ead32d6fa91758826c589a5ac%2Fimg-5913784a-turbine-la-1494448194-mj9ucp23s2-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/6d59f72/2147483647/strip/true/crop/1000x729+0+0/resize/1200x875!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff0%2F7d%2F8fbb36fa5b84621d8285780aa3b5%2F1000", "https://ca-times.brightspotcdn.com/dims4/default/b65e3ac/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc9%2Fc1%2F3ac03e6b81950f4089605bf74877%2Fla-et-mg-jean-michel-basquiat-painting-sets-sales-record-20170518", "https://ca-times.brightspotcdn.com/dims4/default/7f6f1f2/2147483647/strip/true/crop/2048x1361+0+0/resize/1200x797!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2e%2F79%2Fe00fa73024a76e4bbb1aeb4c20ff%2Fla-et-mn-miu-miu-arrivals-paris-fashion-week-womenswear-fall-winter-2014-2015-20170522", "https://ca-times.brightspotcdn.com/dims4/default/46ffd29/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F36%2Fbd%2F588fc7e8a1af9415a7d058693a6c%2Fimg-59197fd6-turbine-la-et-enya-photo", "https://ca-times.brightspotcdn.com/dims4/default/205e842/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fad%2F53%2F80fea1a82589d0686db390d31ee8%2Fimg-5903260f-turbine-la-et-tim-mcgraw-photo", "https://ca-times.brightspotcdn.com/dims4/default/a1d2424/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb8%2Fe1%2F1e91d509b045291d4b8aed9e08c3%2Fimg-590fe40c-turbine-la-et-u2-bono-2017-photo", "https://ca-times.brightspotcdn.com/dims4/default/c73fbbc/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ffb%2F81%2F4f26b9da8b451be1d68425d8ae0b%2Flat-me-bhampton-wre0051573188-20170502", "https://ca-times.brightspotcdn.com/dims4/default/365b7f7/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F91%2F7c%2F8329b31658b445f10c3d94796ef7%2Fimg-59281ad3-turbine-la-et-la-et-0512-paul-bettany-20170526", "https://ca-times.brightspotcdn.com/dims4/default/2f94cf0/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F51%2Fbf%2F3b8f20c5a5752b753cda4e566b26%2Fla-et-mg-nicki-minaj-at-the-2017-met-gala-20170508", "https://ca-times.brightspotcdn.com/dims4/default/830884d/2147483647/strip/true/crop/2048x1329+0+0/resize/1200x779!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F56%2F88%2Ff6f9e4a91eefd0b91c18536a8d85%2Fimg-591d0334-turbine-la-et-grace-jones-2016-photo", "https://ca-times.brightspotcdn.com/dims4/default/8febde3/2147483647/strip/true/crop/650x366+0+0/resize/1200x676!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8a%2F58%2F52506259a4bcbab97a9982153dfd%2F650x366", "https://ca-times.brightspotcdn.com/dims4/default/f8998e8/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F25%2Fb0%2Fa4bac9eb6715082510fdfa1eb61b%2Fla-1495039801-4kjwi6gvbu-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/a3483b2/2147483647/strip/true/crop/650x366+0+0/resize/1200x676!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa9%2F82%2F21de4fe605779c2d264aac182f34%2F650x366", "https://ca-times.brightspotcdn.com/dims4/default/861a4ec/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa5%2Ffb%2F2718e0a0d14fa87555290dad4e6c%2Fimg-5906a689-turbine-la-et-museum-of-contemporary-art-gala-2017-pic-008", "https://ca-times.brightspotcdn.com/dims4/default/2cb55f9/2147483647/strip/true/crop/2048x1436+0+0/resize/1200x841!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F36%2Fe3%2Fcd8c287bffbc701a242dc51b4ea3%2Fimg-58b38c33-turbine-la-et-mn-oscars-2017-show-highlights-pictures-009", "https://ca-times.brightspotcdn.com/dims4/default/5b6ef04/2147483647/strip/true/crop/2048x1421+0+0/resize/1200x833!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F7f%2Fbd%2F8788559aed95a621b658f72ce3ff%2Fla-mg-jenniferlawrence-wre0029870884-20150709", "https://ca-times.brightspotcdn.com/dims4/default/1166919/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F99%2Fee%2F5f8673c75f7109083190a5eb3d39%2Fla-et-mg-zola-maharishi-and-stephen-hill-20170504", "https://ca-times.brightspotcdn.com/dims4/default/936e964/2147483647/strip/true/crop/1200x800+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F32%2Fd8%2Ff63ddf9e9414bdd1d5c8af2d94c4%2Fla-et-mg-harry-styles-buys-house-beverly-hills-002", "https://ca-times.brightspotcdn.com/dims4/default/b88e8f9/2147483647/strip/true/crop/2048x1367+0+0/resize/1200x801!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F3f%2Fe8%2Ffe7e4da4caf95f07165a22198ba2%2Fla-mg-shannen-la0003870865-20120409", "https://ca-times.brightspotcdn.com/dims4/default/9535695/2147483647/strip/true/crop/700x394+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc4%2F67%2F77bd8a574137b55e222a7fd22420%2F700x394", "https://ca-times.brightspotcdn.com/dims4/default/2261112/2147483647/strip/true/crop/2048x1584+0+0/resize/1200x928!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F14%2F9e%2F328ad34f8ddd5e738568a7fc9018%2Flat-cindy-celeb-la0009498070-20130502", "https://ca-times.brightspotcdn.com/dims4/default/4ea17ca/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F42%2F4c%2F2a0f78c4b29ddc8ce2ab3c4d2a81%2Fla-et-mg-the-cast-of-modern-family-20170504", "https://ca-times.brightspotcdn.com/dims4/default/bb5f3e0/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F3b%2F9f%2F42ef1b03e1e85f4feae367493f08%2Fimg-590328e1-turbine-la-et-dwayne-johnson-photo", "https://ca-times.brightspotcdn.com/dims4/default/af670b7/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F95%2F82%2Fc27e6b2fa995706408ffc5f57634%2Fimg-592564c7-turbine-la-et-actress-octavia-spencer-2014-photo", "https://ca-times.brightspotcdn.com/dims4/default/f9409a9/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff1%2Fa1%2Fa209326a25b6b5276c062d0340a7%2Fla-et-mg-kelly-clarkson-baby-boy-son-2-2016041-001", "https://ca-times.brightspotcdn.com/dims4/default/b7b580b/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd5%2F69%2F9a323ff2eb1b77ad4bda5ddb8f40%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/4701966/2147483647/strip/true/crop/2000x1333+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc1%2F4c%2F4d762ce2bc4bcd5ea498c9c72483%2Fimg-59284cd8-turbine-la-et-mn-wonder-woman-premiere-pg-010", "https://ca-times.brightspotcdn.com/dims4/default/ce7e7c2/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa0%2F50%2Fe458ce74d759c747beccfaf32894%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/6c2eda0/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F86%2F0d%2F45ff7c5f12beee298d417c3bdf28%2F1600x900", "https://ca-times.brightspotcdn.com/dims4/default/9f4a031/2147483647/strip/true/crop/2048x1391+0+0/resize/1200x815!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F61%2F84%2Fb818a0a743cf791216a5d796934f%2Fimg-591ee836-turbine-la-et-maggie-20170519", "https://ca-times.brightspotcdn.com/dims4/default/c0752f7/2147483647/strip/true/crop/1024x638+0+0/resize/1200x748!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F5f%2F6c%2Fd790965f0a6955100067af87a354%2Fla-katy-perry-at-wango-tango-fest-on-may-13-2017-20170515", "https://ca-times.brightspotcdn.com/dims4/default/397f931/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ffd%2Fbd%2Fd21058805fd6d8d5ff1d9ee5f2cc%2Fla-ig-grammys-2017-best-and-worst-dressed-011", "https://ca-times.brightspotcdn.com/dims4/default/77ddba3/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F0e%2F4d%2F6a6d101ecf0c41e242a7006624d3%2Fla-lvictorio-1478892366-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/5faacbd/2147483647/strip/true/crop/2000x1326+0+0/resize/1200x796!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F1c%2Fdd%2F24596dbcef305096e0fb89720092%2Fla-1527357-ca-yola-1-lkh-jpg-20130925", "https://ca-times.brightspotcdn.com/dims4/default/50b5cdd/2147483647/strip/true/crop/2000x1312+0+0/resize/1200x787!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fba%2F55%2Fe7aae553f0b16da54bf44ee6bb2b%2Fimg-5925a05c-turbine-la-et-mn-fallon-20170524", "https://ca-times.brightspotcdn.com/dims4/default/541b4d4/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F72%2F6c%2Fe6f0cd7d6d75503a906bab3f693d%2Flat-mg-charlotte-wre0051466801-20170501", "https://ca-times.brightspotcdn.com/dims4/default/43c76fb/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2b%2F76%2Fe9fe3448775dbbafc5e1a4ef1615%2Fla-1495159397-8mv9mdjonm-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/f644b92/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8b%2F7f%2F167f12667ab2dcc9f51a51292206%2Fimg-590fb89c-turbine-la-et-mn-mtv-movie-tv-awards-red-carpet-highli-023", "https://ca-times.brightspotcdn.com/dims4/default/a77ea48/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc5%2Fae%2F17992ab952e361f630b4be27227c%2Fla-et-mg-ben-higgins-and-lauren-bushnell-20170515", "https://ca-times.brightspotcdn.com/dims4/default/6a767ba/2147483647/strip/true/crop/961x1168+0+0/resize/1200x1458!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb4%2Ff6%2F8012c1d0ba01b5e171bed4ae8c22%2Fla-et-al-franken-2-20170519", "https://ca-times.brightspotcdn.com/dims4/default/7754659/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe6%2F58%2F6b7d42cc89a959eef08085417b2f%2Fla-et-mg-sasheer-zamata-is-leaving-snl-20170522", "https://ca-times.brightspotcdn.com/dims4/default/6d75a7e/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe3%2Fd5%2F3ab7623e407e065806d5a6fa4161%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/17ea5f0/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F79%2F53%2Fd843e59b695d1cc986c61f71b50e%2Fimg-5912a715-turbine-la-et-burt-bacharach-2017-photo", "https://ca-times.brightspotcdn.com/dims4/default/747314c/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F52%2Fa4%2Fa18fe50983f1d80e6a003a87454a%2Fla-et-mg-scott-disick-and-bella-thorne-20170526", "https://ca-times.brightspotcdn.com/dims4/default/9f700d2/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd0%2Fc4%2Fa799639a04f7175a867dcddc37d1%2Fla-et-mg-universal-music-group-ceo-lucian-grainge-20170523", "https://ca-times.brightspotcdn.com/dims4/default/6131421/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F95%2Ffd%2Fbc4bf897759b2cc558e5b22ad355%2Fla-1493862962-qf2u5ttnpk-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/192e000/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F91%2F9a%2F234cf32668d3d3b567322d1a0918%2Fimg-54b6fd32-turbine-la-ca-2015-celebrity-pictures-004", "https://ca-times.brightspotcdn.com/dims4/default/985e180/2147483647/strip/true/crop/1024x575+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb2%2F43%2F29238b1d9bd8024669a913f0e944%2Fimg-59066829-turbine-la-1493592102-myxs993t8d-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/b126c49/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F98%2Fc4%2F109738a923fd6f9737e592c861fc%2Fimg-576d619e-turbine-la-1466786407-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/5ab57fc/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd6%2Fd0%2F1985c1b3bc41b6f49960b6fefd7e%2Fla-et-mg-ariel-winter-20170505", "https://ca-times.brightspotcdn.com/dims4/default/f22a57e/2147483647/strip/true/crop/2048x1299+0+0/resize/1200x761!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa1%2F0c%2F946008ee07055d30c4ddc6a022a1%2Fla-et-ms-wango-tango-2017-concert-photos-014", "https://ca-times.brightspotcdn.com/dims4/default/2824ea8/2147483647/strip/true/crop/1200x675+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F05%2F11%2F6f07cd8a360614fdb64fb9b2a6ad%2F1200x675", "https://ca-times.brightspotcdn.com/dims4/default/334ab3f/2147483647/strip/true/crop/2048x1374+0+0/resize/1200x805!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa4%2Fd4%2Fb4ac49fc3adb2ec28a415fee8732%2Fimg-57071913-turbine-la-et-st-american-idol-series-finale-show-high-037", "https://ca-times.brightspotcdn.com/dims4/default/7bca0e0/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff9%2F9f%2F1c176f9a22bd8912d5c460676a05%2Fla-1477525381-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/e8d7859/2147483647/strip/true/crop/1424x800+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F15%2Fa3%2F94aa0456fc603c7bf20eeb83a763%2Fla-1495543853-t2ust32a6e-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/5d25903/2147483647/strip/true/crop/2048x1387+0+0/resize/1200x813!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc9%2F6d%2F1dd849dcd6edc5424eaa5574e438%2Fimg-590fb446-turbine-la-et-mn-mtv-movie-tv-awards-red-carpet-highli-015", "https://ca-times.brightspotcdn.com/dims4/default/4cb574e/2147483647/strip/true/crop/2048x1445+0+0/resize/1200x847!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdd%2F93%2F05dd6f19e01ffa38455977ed0f1c%2Fct-nbc-will-launch-megyn-kelly-news-series-in-001", "https://ca-times.brightspotcdn.com/dims4/default/a80d275/2147483647/strip/true/crop/2048x1151+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F11%2F9e%2Fbbb34ceaa67949f54789a0b9e486%2Fla-1495196921-4uybglimd2-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/cb31254/2147483647/strip/true/crop/2000x1124+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F80%2F45%2Fe952aba91d5f51cba8a21b419287%2Fimg-5903dcec-turbine-la-1493425383-tu1wz86exy-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/c4db4ba/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F61%2F73%2Fd57ac736451957975409e9a4ee32%2F1600x900", "https://ca-times.brightspotcdn.com/dims4/default/b1a4bc5/2147483647/strip/true/crop/2048x1634+0+0/resize/1200x957!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F93%2F86%2F17dbd5df4981077a162793d22506%2Fimg-5911ff2f-turbine-la-et-mg-abby-lee-miller-20170509", "https://ca-times.brightspotcdn.com/dims4/default/d3bbc5a/2147483647/strip/true/crop/2048x1360+0+0/resize/1200x797!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F65%2F56%2F14434721501c75b7eb5007237359%2Fimg-59159f30-turbine-la-et-chazz-palminteri-2007-photo", "https://ca-times.brightspotcdn.com/dims4/default/5d43556/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2d%2Fed%2F128ed2b4601a6c6d4ab762e36ae0%2Fla-et-mg-kara-mccullough-miss-district-of-columbia-usa-2017-20170516", "https://ca-times.brightspotcdn.com/dims4/default/56c59e5/2147483647/strip/true/crop/1024x682+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdb%2F7a%2Ff68133f693c0aa6585b4ac3e7767%2Fla-1495198156-mkdccj1fra-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/1c4e3d9/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F37%2Fc0%2F1be18a573e027716597035a7b0ad%2Fimg-58eeaebe-turbine-la-1492037401-o0qztshsk3-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/4d557f6/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F25%2F81%2F79354b45952b569bd0ce6e73799b%2Fimg-592df4ca-turbine-la-et-morgan-freeman-photo", "https://ca-times.brightspotcdn.com/dims4/default/d2d5ff4/2147483647/strip/true/crop/2048x1363+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9c%2Fd0%2F1f2d14245840cd212e0dbd896e94%2Fimg-59069f9e-turbine-la-et-museum-of-contemporary-art-gala-2017-pic-005", "https://ca-times.brightspotcdn.com/dims4/default/e0d390c/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F1e%2Fca%2Fa723308643b233f22ba6b519a156%2Fla-et-mg-ben-stiller-and-christine-taylor-20170526", "https://ca-times.brightspotcdn.com/dims4/default/f5c408c/2147483647/strip/true/crop/850x478+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F57%2Fcf%2F87b2e9cb5de54392d5da26cb2af7%2F850x478", "https://ca-times.brightspotcdn.com/0e/c6/b86a8b4b43a793259deb28a32a56/latlogoinverse.svg", "https://ca-times.brightspotcdn.com/dims4/default/98e9c81/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F86%2Ffe%2Fef9a933c24d31a9dbef37bcb7a11%2Fla-et-mn-chris-cornell-20170518", "https://ca-times.brightspotcdn.com/dims4/default/a46377f/2147483647/strip/true/crop/2048x1155+0+0/resize/1200x677!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F42%2Fd9%2F4c0c5d6d87acefc67e6403a63863%2Fla-et-mg-floral-tributes-are-left-for-the-victims-of-the-manchester-arena-terrorist-attack-20170524", "https://ca-times.brightspotcdn.com/dims4/default/98d8f48/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2b%2Fe4%2Fe52e06f5f02c684c97fb3416c79b%2Fla-miwood-1486684933-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/d1a7774/2147483647/strip/true/crop/2040x1341+0+0/resize/1200x789!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb9%2F04%2Fea7731ac26f1b5c112fab2ee7463%2Fimg-591abd6a-turbine-la-et-chow-yun-fat-photo2", "https://ca-times.brightspotcdn.com/dims4/default/dde1084/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F47%2F97%2F2330aa82d49062bb5733c058eb0c%2Fimg-5922c997-turbine-la-et-bob-dylan-2017-photo", "https://ca-times.brightspotcdn.com/dims4/default/15e6083/2147483647/strip/true/crop/1200x675+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc9%2F65%2F8a43c7994737510b3425bad273dd%2F1200x675", "https://ca-times.brightspotcdn.com/dims4/default/534e278/2147483647/strip/true/crop/2048x1364+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9e%2Fdd%2F46abd9471b2699d7a23650d1744f%2Fimg-55e5c13b-turbine-la-et-ms-miley-cyrus-miley-her-dead-petz-revie-001", "https://ca-times.brightspotcdn.com/dims4/default/b13d75c/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F76%2F57%2F70d42cb149f4da7b47a612902497%2Fla-et-mg-writer-director-amy-heckerling-20170505", "https://ca-times.brightspotcdn.com/dims4/default/88c9afe/2147483647/strip/true/crop/599x359+0+0/resize/1200x719!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9d%2F6d%2F836596e944c5b6b3ee5a50180e9e%2Fimg-502c8444-turbine-la-et-cm-frankie-valli-broadway-jersey-boys-20-001", "https://ca-times.brightspotcdn.com/dims4/default/ef1baf8/2147483647/strip/true/crop/1525x857+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F60%2Fe6%2F865b0fd2567952e323894ac372d5%2Fla-1495313155-mb0qjlnrxp-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/1880b89/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F20%2Fa3%2F5736fe8635bb2351d4451c8e0cd2%2Fla-et-mg-ryan-seacrest-at-the-oscars-20170511", "https://ca-times.brightspotcdn.com/dims4/default/4236f4a/2147483647/strip/true/crop/2048x1494+0+0/resize/1200x875!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F28%2F85%2F1d22aaf3ad7a25202559c128ea39%2Fimg-590fb89e-turbine-la-et-mn-mtv-movie-tv-awards-red-carpet-highli-018", "https://ca-times.brightspotcdn.com/dims4/default/4c211cf/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F87%2F74%2F5ff31378c807a0a01728d073ab8f%2Fimg-5924ae42-turbine-la-et-st-actress-elisabeth-moss-the-handmaids-tale-portrait-20170523", "https://ca-times.brightspotcdn.com/dims4/default/a7c50f2/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F5c%2F9d%2F0ee710ee3f7570301c4ab4186fc4%2Fla-et-hc-lady-gaga-20170416", "https://ca-times.brightspotcdn.com/dims4/default/6475b9e/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F94%2F46%2F523855f65ac7977fd53326ab57eb%2Fla-1487790486-3rxu5ol3cj-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/439c153/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb6%2Fd4%2F4c65886cbffa4668d47d0a64dfd4%2Fla-et-mg-ariana-grande-will-return-to-manchester-20170526", "https://ca-times.brightspotcdn.com/dims4/default/66ac833/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa7%2Fb1%2F34c330b1851755aee29658e338cb%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/e029a2b/2147483647/strip/true/crop/1024x681+0+0/resize/1200x798!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F46%2F53%2F6c00a4014213a01f86ba440a2436%2Fla-1495456926-m3pr9h9rfm-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/6670d77/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd0%2F1e%2Fc14c2b539ec1e32d74e2e933f4dc%2Fimg-5907c384-turbine-la-ig-met-gala-photos-20170501-010", "https://ca-times.brightspotcdn.com/dims4/default/5884c84/2147483647/strip/true/crop/730x410+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F89%2Fe6%2F30bd2c00bed07afc1a3cb7e0dd0a%2Fla-srodman-1482273601-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/8ed30d4/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F20%2Ff0%2Fafadcd72b68233a58331ac58d54b%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/5909b4f/2147483647/strip/true/crop/700x394+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdc%2Feb%2F8b6ceeec0ee9c2f00ddb741916f6%2F700x394", "https://ca-times.brightspotcdn.com/dims4/default/1ba8351/2147483647/strip/true/crop/2048x1361+0+0/resize/1200x797!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbe%2F9a%2F9dca5d5b13ce2a589c4e29e20f4e%2Fimg-590ac5ce-turbine-la-et-nathan-hoffman-jonathan-todd-schwartz-photo", "https://ca-times.brightspotcdn.com/a6/d6/eea0f1094fb281dbea09e0aa79cd/art-caltimes-trademark-3x.png", "https://ca-times.brightspotcdn.com/dims4/default/fd36642/2147483647/strip/true/crop/2048x1361+0+0/resize/1200x797!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8f%2Fd5%2Fe86309b610dc66aad4b2cb40d809%2Fimg-590cab2f-turbine-la-et-mg-goldie-hawn-kurt-russell-20170505", "https://ca-times.brightspotcdn.com/dims4/default/5fc906f/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc9%2F3f%2F091e806de7e84c442087254ffd46%2Fla-1799487-et-0320-last-ship-02-dpb-jpg-20140619", "https://ca-times.brightspotcdn.com/dims4/default/65e2c7c/2147483647/strip/true/crop/600x390+0+0/resize/1200x780!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbd%2F85%2F54a756f660aacbf7feb6579f466d%2Fimg-54b9a2d4-turbine-lanews-alum-jpg-8guxhjsx4pdr1buuf82k1pk8k", "https://ca-times.brightspotcdn.com/dims4/default/75dcf0b/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F82%2Fdb%2F52ea95c7064a2294600a16e95c46%2Fla-1495995763-xrhili2cip-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/8867747/2147483647/strip/true/crop/2048x1328+0+0/resize/1200x778!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fba%2F04%2Fffad22b8047e51d5ffb1194e9627%2Fimg-590c5f34-turbine-la-et-bob-seger-photo", "https://ca-times.brightspotcdn.com/dims4/default/6bc97cb/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ffa%2F6e%2Fb54a24bd595dd476d283b73c7140%2Fla-et-mg-dani-mathers-in-2016-20170517", "https://ca-times.brightspotcdn.com/dims4/default/bd681f2/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F7f%2F0f%2F094eaf5259a881b6e89cd51bd00f%2Fct-trump-pic-20170528-001", "https://ca-times.brightspotcdn.com/dims4/default/354015a/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Faf%2F6c%2F1deb7ce7dad43aa98c026f9dcfe9%2Fimg-57c5d9ba-turbine-la-1472584215-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/6b74a9a/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F25%2Fac%2F86a6e3bc426c31942e23a4d801ae%2Fla-et-mg-joan-grande-with-daughter-ariana-grande-20170530", "https://ca-times.brightspotcdn.com/dims4/default/82ff585/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Feb%2F79%2Feb021fafc22dcf7af63e9862b377%2Fla-et-mg-leonardo-dicaprio-and-nina-agdal-20170518", "https://ca-times.brightspotcdn.com/dims4/default/18c4cd5/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F27%2Fd9%2F7271f6b5a55e4bdb92c95f86f442%2Fla-et-mg-cher-performs-at-the-2017-billboard-music-awards-20170522", "https://ca-times.brightspotcdn.com/dims4/default/828fead/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd9%2F08%2Fb5b19f966ea8ca574ed683aa47b4%2Fla-et-mg-chris-cornell-of-soundgarden-in-1991-20170524", "https://ca-times.brightspotcdn.com/dims4/default/5d47b1b/2147483647/strip/true/crop/850x478+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc1%2Fc4%2Fd55dfd3450d0a354240806469be5%2F850x478", "https://ca-times.brightspotcdn.com/dims4/default/16ff01e/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb8%2Ffb%2Fd74a2ddbd64d8bf98782cd0f6216%2Fimg-591dcdbc-turbine-la-1495125430-4cuabkjsy2-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/6e7b9d0/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F13%2Fa7%2F823f50f1fb170bab9977bca7c556%2Fla-et-mg-sarah-hyland-at-the-primetime-emmys-in-2016-20170525", "https://ca-times.brightspotcdn.com/dims4/default/8d05d26/2147483647/strip/true/crop/1400x1008+0+0/resize/1200x864!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc8%2F74%2Fec24ad8cee3bfb4992234aba4955%2Fimg-5926a8eb-turbine-la-et-stevie-nicks-photo", "https://ca-times.brightspotcdn.com/dims4/default/21932ba/2147483647/strip/true/crop/2048x1343+0+0/resize/1200x787!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff2%2F3d%2F94f2df80bc6e6949ec34372fab86%2Fimg-5925d3d6-turbine-la-et-st-val-kilmer-20170524", "https://ca-times.brightspotcdn.com/dims4/default/1e6ebd8/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F93%2Fa6%2Fa0dfce18ddbb58c23ed93f3e893d%2F1600x900", "https://ca-times.brightspotcdn.com/dims4/default/c6d4def/2147483647/strip/true/crop/720x480+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F60%2F4c%2F9ab2191c70ef5dd0487d9134c6b4%2Fla-actor-tom-holland-20170522", "https://ca-times.brightspotcdn.com/dims4/default/8ac1a17/2147483647/strip/true/crop/650x366+0+0/resize/1200x676!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd2%2F19%2F4b91fa0b4e267df031acdc30cc5a%2F650x366", "https://ca-times.brightspotcdn.com/dims4/default/f6ed2af/2147483647/strip/true/crop/2048x1349+0+0/resize/1200x790!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F1d%2F36%2F79e4538aed2c11fab8535d8fc51c%2Fla-et-ms-ifa-technology-fair-20170515", "https://ca-times.brightspotcdn.com/dims4/default/b2b5a00/2147483647/strip/true/crop/2000x1493+0+0/resize/1200x896!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd3%2F2f%2F84621b7789d5b751d253ca154809%2Fimg-591015ed-turbine-la-et-shohreh-aghdashloo-photo", "https://ca-times.brightspotcdn.com/dims4/default/c86b04d/2147483647/strip/true/crop/2048x1378+0+0/resize/1200x807!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F78%2F8d%2F2515661a22e91ee55d790c72ae72%2Fimg-5922cbae-turbine-la-et-joan-collins-photo", "https://ca-times.brightspotcdn.com/dims4/default/7a1c8e5/2147483647/strip/true/crop/1480x1006+0+0/resize/1200x816!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F71%2F3d%2F120e4eec33a5232099dca90d9e1d%2Fla-et-mg-jason-aldean-brittany-kerr-married-20-001", "https://ca-times.brightspotcdn.com/dims4/default/01ea21d/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F66%2Fc4%2Fb43144c389de2135db10e4292e9d%2Fimg-5907c2e1-turbine-la-ig-met-gala-photos-20170501-009", "https://ca-times.brightspotcdn.com/dims4/default/79d2267/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F52%2F2e%2Ffab83f44de578b4a30240ff2c386%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/58cad66/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F38%2Ff2%2F5f4600799a9217ce28f31528fb95%2Fimg-58d2a9a2-turbine-la-et-mg-richard-simmons-in-2013-20170322", "https://ca-times.brightspotcdn.com/dims4/default/ebdf273/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F60%2F19%2F2aaca6fe2b8cd94089079ae854eb%2Fla-1476379565-snap-photo"], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-may-2017-htmlstory.html", "title": "Today in Entertainment: CNN fires Kathy Griffin over gory Trump photo; Lebanon officially bans ‘Wonder Woman’", "meta_data": {"og": {"title": "Today in Entertainment: CNN fires Kathy Griffin over gory Trump photo; Lebanon officially bans 'Wonder Woman'", "url": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-may-2017-htmlstory.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "url": "https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "LA Times logo"}, "description": "Here's what's new and interesting in entertainment and the arts:Kathy Griffin has been widely criticized for a gory photo shoot with Donald Trump's (fake) headThen she apologizedBut President Trump didn't accept Griffin's apologyNeither did First Lady Melania TrumpAnd now CNN has fired…", "site_name": "Los Angeles Times", "type": "website"}, "twitter": {"card": "summary_large_image", "description": "Here's what's new and interesting in entertainment and the arts:Kathy Griffin has been widely criticized for a gory photo shoot with Donald Trump's (fake) headThen she apologizedBut President Trump didn't accept Griffin's apologyNeither did First Lady Melania TrumpAnd now CNN has fired GriffinLebanon has officially banned 'Wonder Woman' over star's Israeli heritageOlivia Newton-John has a new cancer diagnosis; her June shows are postponed", "site": "@latimes", "title": "Today in Entertainment: CNN fires Kathy Griffin over gory Trump photo; Lebanon officially bans 'Wonder Woman'"}, "fb": {"app_id": 134435029966155, "pages": 5863113009}, "robots": "max-image-preview:large", "viewport": "width=device-width,initial-scale=1", "description": "Here's what's new and interesting in entertainment and the arts:Kathy Griffin has been widely criticized for a gory photo shoot with Donald Trump's (fake) headThen she apologizedBut President Trump didn't accept Griffin's apologyNeither did First Lady Melania TrumpAnd now CNN has fired GriffinLebanon has officially banned 'Wonder Woman' over star's Israeli heritageOlivia Newton-John has a new cancer diagnosis; her June shows are postponed", "brightspot.contentId": "0000016c-68c4-d4d6-a16e-eaef17e40000", "brightspot.cached": "false"}, "movies": [], "publish_date": null, "source": "https://www.latimes.com", "summary": ""}