{"url": "https://web.archive.org/web/20120827001956/http://www.cbsnews.com/8301-3460_162-57500549/face-the-nation-transcripts-august-26-2012-rubio-priebus-barbour-blackburn/?pageNum=7", "text": "\"Face the Nation\" transcripts, August 26, 2012: Rubio, Priebus, Barbour, Blackburn\n\nREPRESENTATIVE MARSHA BLACKBURN: You know, most of those small businesses that Haley is referencing are female owned. They're the majority of the new small business starts. That is why women are looking at this and they're saying, look, my household income is down forty-three hundred dollars a year. Twenty-six hundred dollars a year is what I'm seeing as the increase in my health insurance. I am trying to get access to capital to grow this small business. The Obama economy is working against me. We've got to make some changes. Tell me what you're going to do about it.\n\nREINCE PRIEBUS: And, Bob, you-- in your commentary you talked about how Americans were just sort of sick and tired of politics generally. I-- I agree with that. And I think that it's really an indictment on Barack Obama because he promised he was going to carpet the world. He was going to be a transcendent figure. He didn't get it done. And I think of all the things that this election is--\n\nBOB SCHIEFFER: Oh, come now. I mean--\n\nREINCE PRIEBUS: Listen--\n\nBOB SCHIEFFER: --I-- I take your point, but you're not trying to tell me that the reason people are sick of politics is all--\n\nREINCE PRIEBUS: No.\n\nBOB SCHIEFFER: --all the Democrats' fault and the--\n\nREINCE PRIEBUS: No, no, no.\n\nBOB SCHIEFFER: --Republicans have nothing.\n\nREINCE PRIEBUS: No, I'm not saying that. But-- but hear me out. I think Barack Obama's not real anymore to the American people. They bought-- they bought a message in 2008. And I think of all the things that people are starving for in this country are real, authentic people that make a promise and keep a promise. The Barack Obama brand is broken. And-- and-- and that is an indictment on Barack Obama. Now I think there is a lot of work to be done in Washington. I think we do need people of their word to go do what they said they're going to do. But at the top of the ticket is a man who sold us a bill of goods, and delivered on very little and that's going to be his biggest problem.\n\nBOB SCHIEFFER: But isn't this just kind of a-- a-- couldn't you say the same thing? Because what happens is, people come, they make these promises, both sides do it, and then nothing happens. I mean you have a Congress--\n\nREPRESENTATIVE MARSHA BLACKBURN: Well--\n\nBOB SCHIEFFER: --that has done nothing.\n\nREPRESENTATIVE MARSHA BLACKBURN: Well-- well, I take-- I'll take issue with that. The House has over thirty jobs bills and about two hundred pieces of legislation waiting for Harry Reid and the Democrat Senate to take it up. So take a little bit of issue with that. The House is what--\n\nBOB SCHIEFFER: Well, but the Democrats there have some bills--\n\nREPRESENTATIVE MARSHA BLACKBURN: But then, look at this, in your commentary you said you wanted to see a leader who could sit down with the other side and get things done.\n\nBOB SCHIEFFER: Mm-Hm.\n\nREPRESENTATIVE MARSHA BLACKBURN: Look at what Mitt Romney did in Massachusetts. He said as he exactly what he did. Republican governor, he went to a Democratic legislature, and he said for the good of the state, and the people of this state, let's decide how we can get some things done. So if you're looking for somebody who can actually live that out for you, your guy is Mitt Romney.\n\nREINCE PRIEBUS: And that's what a convention is all about, telling the Mitt Romney story about a good, decent man that gave away his father's inheritance and everything he did, he did with-- to success. And I think that both Republican and Democratic parents are wishing for their kids' success and the American dream, and not the glass-half-empty America that Barack Obama is trying to sell this country.\n\nBOB SCHIEFFER: Governor Barbour, yeah, you've been a governor, you've been a longtime lobbyist, you've been involved in politics for a long, long time. If you were just to sit here today and say what is something that the two sides could get together on--and I'd like to hear from you, Congressman Blackburn--just give me some things that they could do if they could just sit down and-- and do it in a rational way.\n\nHALEY BARBOUR: You know, Bob, the answer is just probably a very long list. In divided government, like under Reagan, like under Bill Clinton, when you had a majority of the House--Democrats were under Reagan they did the Reagan economic plan. They did Social Security reform. They did immigration reform. They did the 1986 Tax Reform Bill because you had a President who was willing to lead and work the other side. It's not partisan. Bill Clinton was the same way. Bill Clinton had six years of Republican Congress. He didn't whine and complain and blame everybody else. He went over to the Republican Congress and he did welfare reform and the first balanced budget in a generation because he was willing to lead. That's what the American people-- you talked about it in your commentary. The American people want to know why don't we have a Bill Clinton, why don't we have a Ronald Reagan, that will go to the other side and get things done rather than make everything political, everything somebody else's fault. It can be done because we've seen it done by--", "images": ["https://web.archive.org/web/20120827001956im_/http://i.i.com.com/cnwk.1d/i/tim/2012/07/29/clock_120098145_175x131.jpg", "https://web.archive.org/web/20120827001956im_/http://i.i.com.com/cnwk.1d/i/tim/2012/03/14/CBSTM_PromoAd_640x480_100x75.jpg", "https://web.archive.org/web/20120827001956im_/http://dw.com.com/clear/c.gif?sid=162&im=img", "https://web.archive.org/web/20120827001956im_/http://cbsdigitalmedia.112.2o7.net/b/ss/cbscbsnewscomatlantisuat/1/H.21--NS/0", "https://web.archive.org/web/20120827001956im_/http://i.i.com.com/cnwk.1d/i/tim/2012/08/26/faceopen_244x183.jpg", "https://web.archive.org/web/20120827001956im_/http://i.i.com.com/cnwk.1d/i/tim/2012/07/30/Romney_Crawford_175x131.jpg", "https://web.archive.org/web/20120827001956im_/http://i.i.com.com/cnwk.1d/i/tim/2012/07/27/Erickson_with_Schieffer_175x131.JPG"], "top_img": "https://web.archive.org/web/20120827001956im_/http://i.i.com.com/cnwk.1d/i/tim/2012/08/26/faceopen_244x183.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20120827001956/http://www.cbsnews.com/8301-3460_162-57500549/face-the-nation-transcripts-august-26-2012-rubio-priebus-barbour-blackburn/", "title": "\"Face the Nation\" transcripts, August 26, 2012: Rubio, Priebus, Barbour, Blackburn", "meta_data": {"keywords": "transcript, Marco Rubio, Haley Barbour, Marsha Blackburn, Reince Priebus", "description": "Face The Nation on CBS: \"Face the Nation\" transcripts, August 26, 2012: Rubio, Priebus, Barbour, Blackburn - CBS News' Bob Schieffer hosts the hour-long program on the latest political news", "author": "CBSNews.com", "robots": "index, follow", "published": "Sun Aug 26 12:40:46 PDT 2012", "channelId": 3460, "channelName": "Face The Nation", "nodeId": 3460, "nodeName": "Face The Nation", "twitter": {"card": "summary", "site": "@cbsNews", "creator": "@FaceTheNation", "url": "http://www.cbsnews.com/8301-3460_162-57500549/face-the-nation-transcripts-august-26-2012-rubio-priebus-barbour-blackburn/", "title": "\"Face the Nation\" transcripts, August 26, 2012: Rubio, Priebus, Barbour, Blackburn", "description": "CBS News' Bob Schieffer hosts the hour-long program on the latest political news", "image": "http://i.i.com.com/cnwk.1d/i/tim/2012/08/26/faceopen_175x131.jpg"}, "fb": {"app_id": 79439656165}, "og": {"type": "article", "url": "https://web.archive.org/web/20120827001956/http://www.cbsnews.com/8301-3460_162-57500549/face-the-nation-transcripts-august-26-2012-rubio-priebus-barbour-blackburn/", "site_name": "CBS News", "image": "https://web.archive.org/web/20120827001956im_/http://i.i.com.com/cnwk.1d/i/tim/2012/08/26/faceopen_244x183.jpg", "title": "\"Face the Nation\" transcripts, August 26, 2012: Rubio, Priebus, Barbour, Blackburn", "description": "CBS News' Bob Schieffer hosts the hour-long program on the latest political news"}, "article": {"section": "Face The Nation", "tag": "transcript, Marco Rubio, Haley Barbour, Marsha Blackburn, Reince Priebus"}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}