{"url": "www.cbsnews.com/pictures/child-stars-adult-troubles/6/", "text": "Entertainment Child stars, adult troubles\n\n\n\n\n\nJason Merritt/Getty Images Amanda Bynes rose to fame on the Nickelodeon sketch comedy series \"All That.\" She went on to star on \"The Amanda Show,\" but got into some trouble with the law in 2012 when she was hit a three-year probation sentence in Los Angeles for driving with a suspended license. She's also faced several hit-and-run allegations in the past along with an arrest in a still-pending DUI case.\n\nIn 2013, Bynes was arrested at her New York City apartment after she allegedly tossed a marijuana bong out the window. She was also accused of smoking marijuana in the building's lobby, has been charged with reckless endangerment, attempted tampering with evidence and unlawful possession of marijuana.\n\nPhoto: Amanda Bynes Amanda Bynes rose to fame on the Nickelodeon sketch comedy series \"All That.\" She went on to star on \"The Amanda Show,\" but got into some trouble with the law in 2012 when she was hit a three-year probation sentence in Los Angeles for driving with a suspended license. She's also faced several hit-and-run allegations in the past along with an arrest in a still-pending DUI case.In 2013, Bynes was arrested at her New York City apartment after she allegedly tossed a marijuana bong out the window. She was also accused of smoking marijuana in the building's lobby, has been charged with reckless endangerment, attempted tampering with evidence and unlawful possession of marijuana.\n\nJustin Bieber Ethan Miller/Getty Images Justin Bieber shot to fame at a young age after a series of YouTube video caught the attention of American talent manager Scooter Braun. Hit albums, singles and major world tours followed. Not to mention countless screaming girls. But soon, he began making headlines for more than just his success. He had run-ins with photographers and was investigated for reckless driving.\n\nPhoto: Justin Bieber performs during the 2013 Billboard Music Awards on May 19, 2013, in Las Vegas. Justin Bieber shot to fame at a young age after a series of YouTube video caught the attention of American talent manager Scooter Braun. Hit albums, singles and major world tours followed. Not to mention countless screaming girls. But soon, he began making headlines for more than just his success. He had run-ins with photographers and was investigated for reckless driving.\n\nMiley Cyrus AP Former \"Hannah Montana\" star Miley Cyrus is just one of the young stars who sowed her wild oats in the spotlight. She raised eyebrows during her transition from tween star to young adult, causing her own dad to describe her as being \"on a downward spiral.\" Among the behaviors that set tongues wagging: she did a brief pole dance during a TV performance and was photographed holding a beer in Spain. In December 2010, TMZ released a video that showed Cyrus smoking out of a bong. n smoking from a bong. She claimed she was smoking the psychoactive plant Salvia divinorum.\n\nPhoto: Miley Cyrus arrives at the 53rd annual Grammy Awards on Sunday, Feb. 13, 2011, in Los Angeles. Former \"Hannah Montana\" star Miley Cyrus is just one of the young stars who sowed her wild oats in the spotlight. She raised eyebrows during her transition from tween star to young adult, causing her own dad to describe her as being \"on a downward spiral.\" Among the behaviors that set tongues wagging: she did a brief pole dance during a TV performance and was photographed holding a beer in Spain. In December 2010, TMZ released a video that showed Cyrus smoking out of a bong. n smoking from a bong. She claimed she was smoking the psychoactive plant Salvia divinorum.\n\nBritney Spears Frazer Harrison/Getty Images In the mid-2000s, pop diva Britney Spears had some trouble, including a stint in rehab, a strange head-shaving incident and pictures of her driving her car with her son in her lap.\n\n\n\nPhoto: Singer Britney Spears arrives at the 2009 Teen Choice Awards on Aug. 9, 2009, in Universal City, Calif. In the mid-2000s, pop diva Britney Spears had some trouble, including a stint in rehab, a strange head-shaving incident and pictures of her driving her car with her son in her lap.\n\nLindsay Lohan Stephen Dunn She was the child star of \"The Parent Trap\" and \"Freaky Friday\" and teen star of \"Mean Girls.\" In the past few years Lindsay Lohan has been arrested for DUI, probation violations and was in court accused of stealing a necklace. She also has been in and out of a series of rehabs. Her problems continued in 2012 and 2013 with charges of reckless driving and lying to the police. She found herself back in rehab in 2013.\n\nPhoto: Lindsay Lohan at the New York Knicks vs. Los Angeles Lakers game on Jan. 9, 2011, in Los Angeles. She was the child star of \"The Parent Trap\" and \"Freaky Friday\" and teen star of \"Mean Girls.\" In the past few years Lindsay Lohan has been arrested for DUI, probation violations and was in court accused of stealing a necklace. She also has been in and out of a series of rehabs. Her problems continued in 2012 and 2013 with charges of reckless driving and lying to the police. She found herself back in rehab in 2013.\n\nDrew Barrymore AP Photo In 1989, People published an article in which Barrymore admitted \"she had her first drink at 9, began smoking marijuana at 10 and at 12 took up cocaine.\" By the time she was 13, she'd been to rehab twice.\n\nPhoto: Drew Barrymore arrives at the premiere of \"Whip It\" in Los Angeles, Sept. 29, 2009. In 1989, People published an article in which Barrymore admitted \"she had her first drink at 9, began smoking marijuana at 10 and at 12 took up cocaine.\" By the time she was 13, she'd been to rehab twice.\n\nMichael Jackson AP Photo/Michael A. Mariant Jackson was surrounded by controversy almost as much as acclaim. He was accused of child sexual abuse twice. He altered his appearance over the course of his life. The King of Pop died on June 25, 2009.\n\nPhoto: Michael Jackson on Mar. 17, 2005. Jackson was surrounded by controversy almost as much as acclaim. He was accused of child sexual abuse twice. He altered his appearance over the course of his life. The King of Pop died on June 25, 2009.\n\nAaron Carter Jason Merritt/Getty Images Singer Aaron Carter, the singer and brother of Backstreet Boy Nick Carter, did a rehab stint in January 2011.\n\nPhoto: Aaron Carter Singer Aaron Carter, the singer and brother of Backstreet Boy Nick Carter, did a rehab stint in January 2011.\n\nGary Coleman Michael Loccisano/Getty Images for Tribeca Film Festival In January 2010, \"Diff'rent Strokes\" star Gary Coleman was arrested for domestic violence. Coleman had legal problems dating back years, including allegations that he rammed a fan with his truck. He died in May 2010.\n\nPhoto: Gary Coleman In January 2010, \"Diff'rent Strokes\" star Gary Coleman was arrested for domestic violence. Coleman had legal problems dating back years, including allegations that he rammed a fan with his truck. He died in May 2010.\n\nTodd Bridges AP Gary Coleman's older TV brother Todd Bridges was acquitted of attempted murder in 1989. Bridges admitted during the trial, in which he was accused of shooting a drug dealer, that after \"Diff'rent Strokes\" was canceled he became addicted to cocaine.\n\nPhoto: Actor Todd Bridges arrives at the 5th Annual TV Land Awards, Saturday, April 14, 2007 in Santa Monica, Calif. Gary Coleman's older TV brother Todd Bridges was acquitted of attempted murder in 1989. Bridges admitted during the trial, in which he was accused of shooting a drug dealer, that after \"Diff'rent Strokes\" was canceled he became addicted to cocaine.\n\nDana Plato AP Former \"Diff'rent Strokes\" actress Dana Plato was found dead on May 8, 1999, at the age of 35. The cause of death was an overdose of Vanadom and Vicodin. Her death was eventually ruled a suicide. She played Coleman's and Bridges' sister.\n\nPhoto: Dana Plato Former \"Diff'rent Strokes\" actress Dana Plato was found dead on May 8, 1999, at the age of 35. The cause of death was an overdose of Vanadom and Vicodin. Her death was eventually ruled a suicide. She played Coleman's and Bridges' sister.\n\nTara Reid Francois Durand/Getty Images Reid, a co-star in the successful films \"The Big Lebowski\" and \"American Pie,\" had trouble keeping her career momentum going. A stint in rehab and multiple photos of her looking drunk didn't help.\n\nPhoto: Reid arrives at the Valentino show as part of the Paris Haute Couture Fashion Week Spring/Summer 2011 at Couvent des Cordeliers on Jan. 26, 2011, in Paris. Reid, a co-star in the successful films \"The Big Lebowski\" and \"American Pie,\" had trouble keeping her career momentum going. A stint in rehab and multiple photos of her looking drunk didn't help.\n\nParis Hilton AP Heiress and socialite Paris Hilton may want to live the simple life but lately things haven't been so simple. In 2010, she was arrested for cocaine possession. Hilton spent time in jail in 2007 for violating parole stemming from a 2006 DUI charge.\n\nPhoto: Paris Hilton Heiress and socialite Paris Hilton may want to live the simple life but lately things haven't been so simple. In 2010, she was arrested for cocaine possession. Hilton spent time in jail in 2007 for violating parole stemming from a 2006 DUI charge.\n\nNicole Richie Jamie McCarthy Richie, Paris Hilton's \"The Simple Life\" co-star, has been arrested for possession of a controlled substance (heroin, in 2003) and for suspicion of driving under the influence (2006).\n\nPhoto: Nicole Richie attends the Bergdorf Goodman celebration of Fashion's Night Out at Bergdorf Goodman on September 10, 2010, in New York. Richie, Paris Hilton's \"The Simple Life\" co-star, has been arrested for possession of a controlled substance (heroin, in 2003) and for suspicion of driving under the influence (2006).\n\nTatum O'Neil AP Tatum O'Neil, who won an acting Oscar at 10, wrote about her struggle with addiction in her 2004 memoir \"A Paper Life.\" She was arrested in 2008 for buying cocaine.\n\nPhoto: Actress Tatum O'Neil arrives for the special screening of the new movie,\"Charlie's Angels: Full Throttle\" Wednesday, June 25, 2003, in New York. Tatum O'Neil, who won an acting Oscar at 10, wrote about her struggle with addiction in her 2004 memoir \"A Paper Life.\" She was arrested in 2008 for buying cocaine.\n\nLeif Garrett AP Photo Garrett was arrested in February 2010 for possession of heroin. In 1979 he rear-ended another car while driving. His best friend was left a paraplegic. He appeared on \"Celebrity Rehab with Dr. Drew.\"\n\nPhoto: Garrett is seen after he was arrested in February 2010. Garrett was arrested in February 2010 for possession of heroin. In 1979 he rear-ended another car while driving. His best friend was left a paraplegic. He appeared on \"Celebrity Rehab with Dr. Drew.\"\n\nCorey Haim AP Corey Haim died on March 10, 2010. The star of \"Lucas\" and \"The Lost Boys\" struggled with drug abuse as an adult.\n\nPhoto: Haim is seen in a publicity still from the reality show \"The Two Coreys.\" Corey Haim died on March 10, 2010. The star of \"Lucas\" and \"The Lost Boys\" struggled with drug abuse as an adult.\n\nCorey Feldman AP Feldman, star of \"Stand by Me\" and \"The Lost Boys\" had personal problems that led to an arrest for heroin possession in 1990.\n\nPhoto: Corey Feldman is shown in this undated file photo. Feldman, star of \"Stand by Me\" and \"The Lost Boys\" had personal problems that led to an arrest for heroin possession in 1990.\n\nJodie Sweetin Angela Weiss/Getty Images \"Full House\" star Jodie Sweetin described her troubles with cocaine, Ecstasy and crystal meth in her 2009 memoir \"unSweetined.\"\n\nPhoto: Jodie Sweetin \"Full House\" star Jodie Sweetin described her troubles with cocaine, Ecstasy and crystal meth in her 2009 memoir \"unSweetined.\"\n\nDanny Bonaduce Kevin Winter Danny Bonaduce has been arrested for assault and has struggled with drugs. \"The Partridge Family\" star has talked openly about his problems with drugs and alcohol.\n\nPhoto: Danny Bonaduce and Amy Railsback on Oct. 2, 2007, in Los Angeles. Danny Bonaduce has been arrested for assault and has struggled with drugs. \"The Partridge Family\" star has talked openly about his problems with drugs and alcohol.\n\nBrian Bonsall Bonsall, who played Andy, the youngest Keaton, on \"Family Ties,\" was arrested in 2009 for \"investigation of assault\" in Colorado. At the time authorities said Bonsall was sentenced to probation in 2007 for assaulting his girlfriend.\n\nPhoto: Brian Bonsall Bonsall, who played Andy, the youngest Keaton, on \"Family Ties,\" was arrested in 2009 for \"investigation of assault\" in Colorado. At the time authorities said Bonsall was sentenced to probation in 2007 for assaulting his girlfriend.", "images": ["https://assets2.cbsnewsstatic.com/hub/i/r/2011/02/04/47f02422-d26e-11e2-a43e-02911869d855/thumbnail/620x465/6a59cff571dc8fcefd40f12b4d551ed1/107951512.jpg#", "https://assets3.cbsnewsstatic.com/hub/i/r/2010/03/10/46e1ecb5-d26e-11e2-a43e-02911869d855/thumbnail/620x675/2d4b220e4d145032325c0b6bcc764d1c/Dana-Plato.jpg#", "https://assets2.cbsnewsstatic.com/hub/i/r/2010/04/09/44c50454-d26e-11e2-a43e-02911869d855/thumbnail/620x465/04db36930ab138d244917abe8f7b3483/dfasffasdfsdasdfsd.jpg#", "https://assets1.cbsnewsstatic.com/hub/i/r/2007/04/16/4727d735-d26e-11e2-a43e-02911869d855/thumbnail/620x934/04e9c9341176f18af0b1f1932a643fdf/image2688038.jpg#", "https://assets2.cbsnewsstatic.com/hub/i/r/2010/12/30/48aa2270-d26e-11e2-a43e-02911869d855/thumbnail/620x465/0a3977fe92543d362c4cb365b3a0a113/89720514.jpg#", "https://assets1.cbsnewsstatic.com/hub/i/r/2010/03/10/44a58fe3-d26e-11e2-a43e-02911869d855/thumbnail/620x761/0e0a3a2f6e10a4a254587b8887947923/Brad-Renfro.jpg#", "https://assets2.cbsnewsstatic.com/hub/i/r/2009/10/01/47e8b3d2-d26e-11e2-a43e-02911869d855/thumbnail/620x730/b1e53c964db86e9c6ac731f4bce5e8d4/image5355663.jpg#", "https://assets2.cbsnewsstatic.com/hub/i/r/2011/01/26/46b3af66-d26e-11e2-a43e-02911869d855/thumbnail/620x955/074628c03e07466485dfd01ebd99af90/009-fashion-tara.jpg#", "https://assets1.cbsnewsstatic.com/hub/i/r/2010/09/22/467fa09f-d26e-11e2-a43e-02911869d855/thumbnail/620x465/56ed17852d4052fca8cf80f1d6bdaec9/paris-hilton-japan.jpg#", "https://assets1.cbsnewsstatic.com/hub/i/r/2010/03/10/45a694c6-d26e-11e2-a43e-02911869d855/thumbnail/620x466/37a004169547801552c46c68bcb35b7c/image6286661x.jpg#", "https://assets1.cbsnewsstatic.com/hub/i/r/2010/10/07/472f5184-d26e-11e2-a43e-02911869d855/thumbnail/620x465/725b617d3d2dac4cc8c431a50280ac41/86218871.jpg#", "https://assets3.cbsnewsstatic.com/hub/i/r/2010/09/23/461f03c4-d26e-11e2-a43e-02911869d855/thumbnail/620x570/82cf1b10a1d15978a7b8cbba783dc4bb/103987047.jpg#", "https://assets1.cbsnewsstatic.com/hub/i/r/2010/02/04/45ae2c7a-d26e-11e2-a43e-02911869d855/thumbnail/620x768/dce3d110ed93c95ba0768fc8c5cce798/00-lief.jpg#", "https://assets3.cbsnewsstatic.com/hub/i/r/2012/04/06/490ad986-d26e-11e2-a43e-02911869d855/thumbnail/1200x630/91b75d414c9bdbaa19eb6fa34c5abb5b/115323550.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2012/04/06/490ad986-d26e-11e2-a43e-02911869d855/thumbnail/620x465/1a5ff049a84c9b3985a09f6396ce192c/115323550.jpg#", "https://assets2.cbsnewsstatic.com/hub/i/r/2013/05/28/fa1b8672-d255-11e2-a43e-02911869d855/thumbnail/620x465/df1f8f379a80f580eb65cdf253a6f5d5/bieberhere.jpg#", "https://assets1.cbsnewsstatic.com/hub/i/r/2011/01/24/474fa47d-d26e-11e2-a43e-02911869d855/thumbnail/620x465/64857d5656889ebc5270e117f3977e08/96315279.jpg#", "https://assets1.cbsnewsstatic.com/hub/i/r/2011/02/13/48e1ea9d-d26e-11e2-a43e-02911869d855/thumbnail/620x465/838b55ac038d74c439c12e93eece745c/AP110213059576.jpg#", "https://assets2.cbsnewsstatic.com/hub/i/r/2005/02/11/459f164e-d26e-11e2-a43e-02911869d855/thumbnail/620x466/8a5137015c8f059db9fe80844a86d7a8/image673196x.jpg#", "https://assets3.cbsnewsstatic.com/hub/i/r/2003/06/26/461777f3-d26e-11e2-a43e-02911869d855/thumbnail/620x689/4c0d5b442d753e8ae78d69f917bb32f3/image560522.jpg#", "https://assets2.cbsnewsstatic.com/hub/i/r/2011/01/20/4556718d-d26e-11e2-a43e-02911869d855/thumbnail/620x465/83103e7db2243628a5e304464da4e80e/105643804.jpg#", "https://assets3.cbsnewsstatic.com/hub/i/r/2010/06/22/47c89a41-d26e-11e2-a43e-02911869d855/thumbnail/620x466/24ea249f86062568ebca439399e2ca0a/mic_jack_court_05_370.jpg#", "https://assets3.cbsnewsstatic.com/hub/i/r/2010/12/06/44e93bc7-d26e-11e2-a43e-02911869d855/thumbnail/620x465/d90b69bc35453bfb966dea33c36d5080/77165707.jpg#"], "top_img": "https://assets3.cbsnewsstatic.com/hub/i/r/2012/04/06/490ad986-d26e-11e2-a43e-02911869d855/thumbnail/1200x630/91b75d414c9bdbaa19eb6fa34c5abb5b/115323550.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cbsnews.com/pictures/child-stars-adult-troubles/", "title": "Child stars, adult troubles", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1, user-scalable=0", "color-scheme": "only light", "robots": "index, follow, max-image-preview:large", "description": "Some stars have had problems after becoming famous at a young age", "al": {"web": {"url": "https://www.cbsnews.com/pictures/child-stars-adult-troubles/"}, "ios": {"app_name": "CBS News", "app_store_id": 334256223, "url": "cbsnewsapp://cbsnews.com/pictures/child-stars-adult-troubles/"}, "android": {"app_name": "CBS News", "package": "com.treemolabs.apps.cbsnews", "url": "cbsnewsapp://cbsnews.com/pictures/child-stars-adult-troubles/"}}, "og": {"type": "article", "url": "https://www.cbsnews.com/pictures/child-stars-adult-troubles/", "title": "Child stars, adult troubles", "description": "Some stars have had problems after becoming famous at a young age", "image": {"identifier": "https://assets3.cbsnewsstatic.com/hub/i/r/2012/04/06/490ad986-d26e-11e2-a43e-02911869d855/thumbnail/1200x630/91b75d414c9bdbaa19eb6fa34c5abb5b/115323550.jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 1536620209892267, "pages": 131459315949}, "article": {"publisher": "https://www.facebook.com/CBSNewsEntertainment/", "content_tier": "free", "opinion": "false"}, "twitter": {"dnt": "on", "app": {"country": "US", "name": {"iphone": "CBS News", "ipad": "CBS News", "googleplay": "CBS News"}, "id": {"iphone": 334256223, "ipad": 334256223, "googleplay": "com.treemolabs.apps.cbsnews"}, "url": {"iphone": "cbsnewsapp://cbsnews.com/pictures/child-stars-adult-troubles/", "ipad": "cbsnewsapp://cbsnews.com/pictures/child-stars-adult-troubles/", "googleplay": "cbsnewsapp://cbsnews.com/pictures/child-stars-adult-troubles/"}}, "site": "@CBSNews", "title": "Child stars, adult troubles", "description": "Some stars have had problems after becoming famous at a young age", "image": "https://assets3.cbsnewsstatic.com/hub/i/r/2012/04/06/490ad986-d26e-11e2-a43e-02911869d855/thumbnail/1200x630/91b75d414c9bdbaa19eb6fa34c5abb5b/115323550.jpg", "card": "summary_large_image"}, "theme-color": "#101010", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "CBS News", "apple-mobile-web-app-status-bar-style": "black"}, "movies": [], "publish_date": null, "source": "http://www.cbsnews.com", "summary": ""}