{"url": "https://en.wikipedia.org/wiki/Wedding_of_Prince_Charles_and_Camilla_Parker_Bowles", "text": "The wedding of Prince Charles and Camilla Parker Bowles took place in a civil ceremony at Windsor Guildhall, on 9 April 2005. The ceremony, conducted in the presence of the couple's families, was followed by a Church of England Service of Prayer and Dedication at St George's Chapel. The groom's parents, Queen Elizabeth II and Prince Philip, Duke of Edinburgh, did not attend the civil wedding ceremony, but were present at the Service of Prayer and Dedication and held a reception for the couple in Windsor Castle afterwards.[1]\n\nThe marriage formalised the relationship between Charles and Parker Bowles. She assumed the title Duchess of Cornwall. The proceedings of the Service of Prayer and Dedication were covered by the BBC network. Notable figures in attendance included international political, religious, and royal figures, and various celebrities. The wedding was described by the media as \"A Fairy Tale for Grown-Ups.\"[2][3][4][5]\n\nEngagement and preparations [ edit ]\n\nOn 10 February 2005, it was announced that Camilla Parker Bowles and Charles, Prince of Wales, would marry on 8 April 2005, at Windsor Castle with a civil service followed by religious prayer. The Privy Council met on 2 March 2005 to give effect to the Queen's consent to the marriage, in conformance with the provisions of the Royal Marriages Act 1772.[6] The government indicated that the marriage was not morganatic.[6] After the engagement announcement, the couple were congratulated by Queen Elizabeth II and her husband, the Duke of Edinburgh.[7] The Archbishop of Canterbury, Rowan Williams, issued a statement which read: \"These arrangements have my strong support and are consistent with Church of England guidelines concerning remarriage which the Prince of Wales fully accepts as a committed Anglican and as prospective Supreme Governor of the Church of England.\"[8] Prime Minister Tony Blair, Leader of the Opposition Michael Howard, Leader of the Liberal Democrats Charles Kennedy, Leader of the House of Commons Peter Hain, and the Prime Ministers of the other Commonwealth realms added their congratulations.[9]\n\nThe Duchess' engagement ring is a Windsor family heirloom that belonged to Queen Elizabeth The Queen Mother. It has a 1920s platinum setting and it is composed of a square-cut central diamond flanked by six diamond baguettes.[10]\n\nA civil ceremony [ edit ]\n\nA civil ceremony was presumably chosen to avoid potential controversy caused by the future supreme governor of the Church of England marrying a divorcée in a religious ceremony, Camilla Parker Bowles having divorced her first husband in 1995. In fact, the marriage of a divorced person whose ex-spouse is still living has been possible in the Church of England, at the discretion of the member of clergy conducting the ceremony, since 2002.[11]\n\nWhen Princess Anne married Timothy Laurence after having divorced Mark Phillips, she did so in the Church of Scotland. The remarriage of divorcés is not controversial in the Church of Scotland, which does not view marriage as a sacrament, and the sovereign has no constitutional role in the governance of the Church.[12] The Prince of Wales and his bride did not elect this course of action.\n\nQuestioning a royal civil wedding [ edit ]\n\nCharles is the first member of the royal family to marry in a civil ceremony in England. Stephen Cretney, a Fellow at All Souls College, Oxford, questioned whether Charles and Camilla could marry in a civil ceremony, as the Royal Family was specifically excluded from the law which instituted civil marriages in England (Marriage Act 1836). On 14 February the BBC's Panorama uncovered documents of official legislative research advice dating from 1956 and 1964, which stated that it was not lawful for members of the royal family to marry in a civil ceremony in England and Wales, though it would be lawful in Scotland.[13] These documents' statements were dismissed in a statement published by Clarence House on the advice of four unnamed legal experts.[14] It took the view that the 1836 Act had been repealed by the Marriage Act 1949. Lord Falconer of Thoroton, Secretary of State for Constitutional Affairs and Lord Chancellor, made the following statement:\n\nThe Government are satisfied that it is lawful for the Prince of Wales and Mrs Parker-Bowles, like anyone else, to marry by a civil ceremony in accordance with Part III of the Marriage Act 1949. Civil marriages were introduced in England, by the Marriage Act 1836. Section 45 said that the Act \"... shall not extend to the marriage of any of the Royal Family\". But the provisions on civil marriage in the 1836 Act were repealed by the Marriage Act 1949. All remaining parts of the 1836 Act, including Section 45, were repealed by the Registration Service Act 1953. No part of the 1836 Act therefore remains on the statute book. ... We are aware that different views have been taken in the past; but we consider that these were overcautious, and we are clear that the interpretation I have set out in this Statement is correct. We also note that the Human Rights Act has since 2000 required legislation to be interpreted wherever possible in a way that is compatible with the right to marry (Article 12) and with the right to enjoy that right without discrimination (Article 14). This, in our view, puts the modern meaning of the 1949 Act beyond doubt.[15]\n\nProfessor Rebecca Probert has subsequently argued that Charles and Camilla's wedding is not legal. She says that it was not possible, as the government claimed, for such a drastic change in the law to have been implemented by the 1949 Act because it was introduced under a specially authorised procedure that can only be used in respect of \"Consolidation Acts\", acts which bring together the law previously contained in a number of statutes into one statute without changing it in any major way.[16] Probert argues that article 79(5), which reads: \"Nothing in this Act shall affect any law or custom relating to the marriage of members of the Royal Family.\", still holds, on these grounds.\n\nThe government raised the issue of the Human Rights Act, noting that under this the 1949 Act had to be interpreted wherever possible to uphold the right to marry without discrimination. The key words are \"wherever possible\" - the Human Rights Act specifically states that where a statute makes something illegal the only way to make it legal is to amend or repeal the statute. For example, were the Sovereign to deny a member permission to marry under the Royal Marriages Act, an application to the Court for a declaration that the marriage must be permitted to go ahead under human rights legislation would fail.\n\nEleven objections were received by the Cirencester and Chippenham register offices but were all rejected by the Registrar General (and National Statistician) Len Cook, who determined that a civil marriage would in fact be valid.[17]\n\nOn 17 February, Clarence House announced the marriage's change of venue from Windsor Castle to the Windsor Guildhall, immediately outside the walls of the castle.[18] This substitution came about when it was discovered that the legal requirements for licensing the royal castle for civil weddings would require opening it up to other prospective couples for at least three years. On 22 February, Buckingham Palace announced that the Queen would not attend the wedding ceremony, but would attend the church blessing and host the reception afterwards.[19] The reason stated by the palace was the couple wanted to keep the occasion low key. On 4 April, it was announced that the wedding would be postponed 24 hours until 9 April, so that the Prince of Wales could attend the funeral of Pope John Paul II as the representative of the Queen. The postponement also allowed some of the dignitaries who were invited to the funeral to attend the wedding. In keeping with tradition, the Prince of Wales spent the night apart from his bride-to-be at Highgrove House, his country home in Gloucestershire, with his sons Princes William and Harry.[20]\n\nWedding and Service of Prayer and Dedication [ edit ]\n\nThe wedding took place at the Windsor Guildhall at 12.30 pm BST (11:30 UTC) on Saturday 9 April 2005. Crowds had gathered on the streets since dawn ahead of the service. The ceremony was attended by senior members of the royal family apart from the Queen and the Duke of Edinburgh.[21]\n\nAfter the wedding, the couple's witnesses were Prince William of Wales and Tom Parker Bowles, sons of the groom and bride respectively.[22][23] In keeping with tradition, the couple's wedding rings are crafted from 22 carat Welsh gold from the Clogau St David's mine in Bontddu. The tradition of using Clogau Gold within the wedding rings of the Royal Family dates back to 1923.[10] The design of the wedding rings is by Wartski, a London jeweller that has held the Royal Warrant to the Prince of Wales since 1979. The prince wears his on the small finger of his left hand.\n\nThe civil wedding was followed by a televised blessing, officially termed a Service of Prayer and Dedication[24] by both the Prince of Wales's office and the press.[25][26][27] in the afternoon at St George's Chapel, Windsor Castle.[28] This was attended by 800 guests and all the senior members of the royal family, including the Queen and the Duke of Edinburgh, and led by the Archbishop of Canterbury Rowan Williams.[29] During this ceremony Charles and Camilla joined the congregation in reading \"the strongest act of penitence from the 1662 Book of Common Prayer\",[30] widely quoted in press reports of the wedding:\n\nWe acknowledge and bewail our manifold sins and wickedness, Which we, from time to time, most grievously have committed, by thought, word and deed, Against thy Divine Majesty, Provoking most justly thy wrath and indignation against us.[30][26][31]\n\nThe arrangements for the wedding and service were strongly supported[26] by the Archbishop of Canterbury as \"consistent with the Church of England guidelines concerning remarriage\".[32] The \"strongly-worded\"[33] act of penitence recited by the couple was a confessional prayer written by Thomas Cranmer, Archbishop of Canterbury to King Henry VIII.[31] It was interpreted as a confession by both, of past sins, albeit without specific reference[33] and going \"some way towards acknowledging concerns\" over their past misdemeanours.[31]\n\nFor the wedding, the Duchess wore a cream-coloured dress and coat with a wide-brimmed cream-coloured hat. For the Service of Prayer and Dedication afterward, she wore a floor-length embroidered pale blue and gold coat over a matching chiffon dress and a dramatic spray of golden feathers in her hair.[34] Both ensembles were by Antonia Robinson and Anna Valentine, London designers who worked under the name Robinson Valentine, now solely called Anna Valentine; both hats were made by the Irish milliner Philip Treacy.[10] The Duchess's flower bouquet contained daffodils, jasmine, Lily of the Valley, pink and cream lilies, camellias, hydrangeas, and roses which came from the Prince of Wales Highgrove House gardens.[35] Charles and all male members of the royal family wore morning dress. The wedding cake was made by Mrs Blunden, owner of the \"Sophisticake\" cake shop in Woodhall Spa, Lincolnshire.[36] In April 2005 a hotelier paid £215 in an internet auction for a slice of the cake.[37]\n\nFollowing the service of blessing, the couple greeted the people who had lined outside the chapel.[38] The party then moved to Windsor Castle's State Apartments where the Queen hosted a reception for a number of guests.[38] The couple later went to Scotland for their honeymoon.[38]\n\nPublic and commercial interest [ edit ]\n\nManufacturers of pottery and other commemorative items faced a late rush to change the dates on their products after the delayed wedding date became known. However, sales of those with the incorrect date soared when people began to think that they would become collectors' items. For the wedding day, the theme park Alton Towers changed the name of their rollercoaster \"Rita: Queen of Speed\" to \"Camilla: Queen of Speed\". Television commercials and signs around the park were all updated to reflect this change.[39]\n\nThe BBC gained the rights to broadcast the event where there was live coverage of the Service of Prayer and Dedication from St George's Chapel. On BBC One, Huw Edwards and Sophie Raworth presented the live coverage of the event and fashion advisors Trinny Woodall and Susannah Constantine contributed as the contemporary social commentators. The BBC had around thirty cameras at the event and shared footage with broadcasters throughout the world. BBC News 24 also had coverage during the day with Jane Hill and Simon McCoy reporting live from Windsor.[40]\n\nMany self-described fans of Diana, Princess of Wales opposed the wedding of Charles and Camilla Parker-Bowles, with some referring to the event as \"Black Thursday\" and writing to national newspapers to express their disapproval.[41]\n\nWedding guest list [ edit ]\n\nAccording to a list released by the office of Prince Charles:[42]\n\nFamily of the Prince of Wales [ edit ]\n\nFamily of Camilla Parker Bowles [ edit ]\n\nBlessing guest list [ edit ]\n\nAccording to official press package:[43]\n\nMembers of the British Royal Family [ edit ]\n\nViceroys [ edit ]\n\nForeign royalty [ edit ]\n\nMembers of reigning royal families [ edit ]\n\nMembers of non-reigning royal families [ edit ]\n\nBritish politicians [ edit ]\n\nReligious representatives [ edit ]\n\nThe Archbishop of Canterbury and Mrs Williams\n\nThe Lord and Lady Carey of Clifton\n\nThe Dean of Windsor and wife\n\nCanon Doctor Hueston Finlay and wife\n\nCanon Laurence Gunner and wife\n\nCanon John Ovenden and Christine Ovenden\n\nRev Canon John White\n\nOther notable guests [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Flag_of_Saudi_Arabia.svg/23px-Flag_of_Saudi_Arabia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Combined_Coat_of_Arms_of_the_Prince_of_Wales_and_the_Duchess_of_Cornwall.svg/240px-Combined_Coat_of_Arms_of_the_Prince_of_Wales_and_the_Duchess_of_Cornwall.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Combined_Coat_of_Arms_of_the_Prince_of_Wales_and_the_Duchess_of_Cornwall.svg/1200px-Combined_Coat_of_Arms_of_the_Prince_of_Wales_and_the_Duchess_of_Cornwall.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/40px-Wikinews-logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Flag_of_the_Netherlands.svg/23px-Flag_of_the_Netherlands.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/21px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Flag_of_Bahrain.svg/23px-Flag_of_Bahrain.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Combined_Coat_of_Arms_of_the_Prince_of_Wales_and_the_Duchess_of_Cornwall.svg/1200px-Combined_Coat_of_Arms_of_the_Prince_of_Wales_and_the_Duchess_of_Cornwall.svg.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Wedding_of_Prince_Charles_and_Camilla_Parker_Bowles", "title": "Wedding of Prince Charles and Camilla Parker Bowles", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Combined_Coat_of_Arms_of_the_Prince_of_Wales_and_the_Duchess_of_Cornwall.svg/640px-Combined_Coat_of_Arms_of_the_Prince_of_Wales_and_the_Duchess_of_Cornwall.svg.png", "width": 640, "height": 594}, "title": "Wedding of Prince Charles and Camilla Parker Bowles - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}