{"url": "http://hotlifestylenews.com/lifestyle/celebrity-exes-the-art-of-hanging-out-with-the-new-significant-other/", "text": "Instagram\n\nSpending Thanksgiving with your boyfriend’s family for the first time can be nerve-wracking, especially if he’s got kids.\n\nAdding his ex-wife and her new husband to the mix just sounds like a holiday comedy of errors waiting to happen.\n\nBut try telling that to Hollywood’s consciously uncoupled, who have turned splitting up, staying friends and welcoming new significant others into the fold into an art form.\n\nThough both have admitted that divorcing amicably a few years ago was not always an amicable experience, Gwyneth Paltrow and Chris Martinhave since become the poster exes for an evolved post-split family life, the actress and the rock star spending time together regularly in service of their No. 1 objective, which is to co-parent their kids, Apple and Moses Martin, to the best of their ability.\n\nIt’s one thing, though, to grin, bear it and eventually get used to the new normal when it’s just the two exes, as Jennifer Garner and Ben Affleck have been doing so admirably since they first separated in 2015. For all their enduring love, respect and friendship, Jen and Ben have not yet reached the “why don’t you bring your girlfriend to Thanksgiving” stage of their partnership. Not many exes have, or ever do.\n\nGwyneth and Chris, however, are just one big, growing happy family.\n\nPhotos\n\nStars Celebrate Thanksgiving 2018\n\nWhile they have spent Thanksgiving together in one form or another since their split, last year Paltrow’s then-rumored fiancé (and now husband) Brad Falchuk joined the party—and this year, Martin’s girlfriend, Dakota Johnson, made for another plate around the immaculately set table.\n\nInstagram\n\n“Gwyneth thinks she is lovely,” a source tells E! News. “She gets on very well with her and is happy for Chris…Especially on holidays, Gwyneth wants nothing more than to be one big happy family and for her kids to be able to celebrate with both of their parents.”\n\nThat’s a far cry from the old trope of backbiting exes who can’t be in the same room together, let alone warmly embrace and break bread with the current person in their former person’s life. But don’t worry, in case you’re wondering why you’d rather tell your ex he can stuff if than share stuffing with his new girlfriend, it’s not as if these families arrived at this happy place overnight.\n\nIt’s understandable that Paltrow—whose bread is buttered with gratitude and open-mindedness—might be more open to this scenario than some others, but going by her and other famous celebrity exes’ behavior when it comes to large gatherings, certain parameters do apply.\n\nPhotos\n\nFriendly Celebrity Exes\n\nFor instance, most parents don’t just bring anyone around their kids—or their exes, for that matter.\n\nNeither Garner nor Affleck, who will be spending at least part of the holidays together with their three kids in Montana, have been in a relationship that was serious enough to prompt a melding of the families. Affleck ex Lindsay Shookus, the only S.O. he dated for a significant amount of time, had a daughter of her own to spend time with, and Garner only recently started dating John Miller—whom she hopes to steal away with at some point next month. As yet, there’s been no talk of him participating in any Garner-Affleck Christmas traditions this year.\n\n“She’s excited to have some down time over the holidays and to have someone new to spend time with,” a source said of Garner’s promising-sounding romance.\n\nPhotos\n\nCeleb Exes Who Worked Together After Breakups\n\nJennifer Lawrence didn’t have a goop-approved Thanksgiving when she and Martin were dating, though Paltrow seemingly would have been open to it if it had come to that. The Coldplay singer is simply in a more serious place with Johnson, whom he’s been seeing for about a year now.\n\nThere was no evidence that Paltrow ever met Lawrence, while she and Johnson have “spent a good amount of time together and have a very nice friendship,” a source told us.\n\nMariah Carey‘s engagement to James Packer fizzled out, but back when she thought she’d be spending forever with him, obviously she wanted him to get along with her ex-husband Nick Cannon, the father of her twins, Monroe and Moroccan. Some months they all came together to celebrate one of Carey’s favorite holidays, Halloween, a source told E! News that Cannon felt that “as long as his kids are in good hands”, he would “support any decision Mariah makes” as far as future partners go.\n\nRead\n\nThe Art of Living Near Your Ex: How Stars Navigate a Shared Neighborhood\n\nIt understandably took Kourtney Kardashian a good long while before she was comfortable hanging out with Sofia Richie, Scott Disick‘s girlfriend. She finally had dinner earlier this month with the two of them at Nobu, once she was ready. (Nobu—a safe haven for the whole fam—is also where Scott took Sofia for her first public outing with his kids.)\n\n“Scott and Sofia are very serious and Scott felt it was important that Sofia and Kourtney interact and bond,” a source told E! News. “They have kept things separate for over a year now, and Kourtney is now more open and willing to have a surface level relationship with Sofia.”\n\nThat being said, though the Kardashian-Jenner Thanksgiving is always a sprawling affair, Sofia did not make a cameo in any of Kourtney’s photos featuring her, Scott, Mason, Penelope and Reign.\n\nBaby steps, you know?\n\nREUTERS/Fred Prouser\n\nOn the other hand, while the kids can be a reason why new significant others come into the picture at a glacial pace, they also tend to be the reason for all the cozy closeness once that level of comfort has been achieved.\n\nEven the seeming originators of the divorced-BFFs standard—Bruce Willis and Demi Moore—needed some time before life started resembling the beach in Turks and Caicos where Willis remarried, with his ex and her third husband among the guests.\n\nFor starters, Moore and Willis (her second husband) split up in 2000, when their daughters were still quite young. Their eldest, Rumer Willis, was only 12. So it was imperative that they figured out the co-parenting thing, long before that term was in fashion (though it’s often used retroactively to describe what couples ranging from Bruce and Demi to Prince Charles and Princess Diana were already doing after their divorces).\n\nRead\n\nThe Art of Avoiding—or Embracing—an Ex at the Met Gala\n\nWillis attended Moore and Ashton Kutcher‘s wedding in 2005, and those two returned the favor in 2009, when Willis married Emma Heming. All very civil, which has seemingly helped Rumer, Scout and Tallulah maintain close relationships with both parents. Moore and Kutcher split up in 2011 and, while they didn’t have children together, they did start a foundation, which would bring them back into each other’s orbit from time to time. Being only 10 years older than her, Kutcher has also reportedly maintained a friendship with former stepdaughter Rumer, but he and Mila Kunisdon’t generally hang out as a familiy with the evidence of his past life.\n\nBut it’s Bruce and Demi who really set the bar for being able to expand the fam organically, the two of them and Heming showing up time and again in support of whatever the kids are up to, Rumer’s 30th birthday in August being yet another occasion for them to celebrate all together.\n\n“I have to say our daughters are incredibly well adjusted considering two of them are half Bruce Willis,” Moore said in poking fun at her ex during the Comedy Central Roast of Bruce Willis earlier this year.\n\nIt would seem as if Bruce and Demi entered their “like siblings” phase awhile ago then.\n\n“He’s really like my brother,” Paltrow said of Martin, whom she was married to for 10 years, on The Late Show With Stephen Colbert earlier this year. “We’re very familial. It’s nice, it’s great.”\n\nAnd when one’s brother wants to bring his girlfriend home for Thanksgiving, who is his sister to deny her a seat at the table?\n\nSource: Read Full Article", "images": ["https://hotlifestylenews.com/wp-content/uploads/2022/10/Disputing-Irans-version-mother-of-Nika-Shakarami-says-16-year-old-was-beaten-to-death.jpg", "https://akns-images.eonline.com/eol_images/Entire_Site/2018619/rs_600x600-180719083629-600-Amanda-Seyfried-Dominic-Cooper-JR-071918.jpg?fit=inside|192:192&output-quality=90", "https://akns-images.eonline.com/eol_images/Entire_Site/201826/rs_600x600-180306091951-600-GwynethApple.jpg?fit=inside|900:auto&output-quality=90", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20800%20450'%3E%3C/svg%3E", "https://hotlifestylenews.com/wp-content/uploads/2022/10/Dua-Lipa-Confirms-Relationship-Status-Amid-Trevor-Noah-Dating-Rumors.jpg", "https://hotlifestylenews.com/wp-content/uploads/2018/11/ccelebritiesfotors_600x600-180306091951-600-GwynethApple-600x280.jpg", "https://hotlifestylenews.com/wp-content/uploads/2022/10/New-Documentary-To-Examine-Making-Of-Michael-Jacksons-Thriller.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%20630'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201280%20800'%3E%3C/svg%3E", "https://akns-images.eonline.com/eol_images/Entire_Site/201848/rs_600x600-180508103628-600.2-met-gala-couples-exes.jpg?fit=inside|192:192&output-quality=90", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20636%20382'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20700%20500'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20600%20280'%3E%3C/svg%3E", "https://hotlifestylenews.com/wp-content/uploads/2019/11/cropped-5-32x32.gif", "https://akns-images.eonline.com/eol_images/Entire_Site/2015825/rs_300x300-150925091910-5600-kate-bosworth-orlando-bloom.ls.92515.jpg?fit=inside|192:192&output-quality=90", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E", "https://akns-images.eonline.com/eol_images/Entire_Site/20181026/rs_600x600-181126125548-Chris-Martin-Brad-Falchuk-Instagram-600-NF-11-26-18.jpg?fit=inside|900:auto&output-quality=90", "https://akns-images.eonline.com/eol_images/Entire_Site/20181022/rs_600x600-181122122312-600.jimmy-kimmel.112218.jpg?fit=inside|192:192&output-quality=90", "https://hotlifestylenews.com/wp-content/uploads/2022/10/Danielle-Lloyd-quits-OnlyFans-amid-rumours-she039s-joined-Celebrity-SAS.jpg", "https://hotlifestylenews.com/wp-content/uploads/2022/10/China-has-secret-station-in-NYC-as-part-of-network-to-track-dissidents.jpg", "http://c.statcounter.com/11691185/0/36067258/1/", "https://akns-images.eonline.com/eol_images/Entire_Site/2018623/rs_600x600-180723155958-1024-CelebNeighbors.jpg?fit=inside|192:192&output-quality=90", "https://akns-images.eonline.com/eol_images/Entire_Site/201674/rs_1024x759-160804141453-1024-ashton-demi-bruce-emma.jpg?fit=inside|900:auto&output-quality=90", "https://hotlifestylenews.com/wp-content/uploads/2022/10/Dogs-that-fatally-mauled-TN-toddlers-injured-mom-were-never-violent.jpg"], "top_img": "https://hotlifestylenews.com/wp-content/uploads/2019/11/cropped-5-32x32.gif", "keywords": [], "authors": [], "canonical_link": "https://hotlifestylenews.com/lifestyle/celebrity-exes-the-art-of-hanging-out-with-the-new-significant-other/", "title": "Celebrity Exes & the Art of Hanging Out With the New Significant Other", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Celebrity Exes & the Art of Hanging Out With the New Significant Other - Hot Lifestyle News", "description": "Instagram Spending Thanksgiving with your boyfriend’s family for the first [...]", "url": "https://hotlifestylenews.com/lifestyle/celebrity-exes-the-art-of-hanging-out-with-the-new-significant-other/", "site_name": "Hot Lifestyle News"}, "article": {"published_time": "2018-11-27T03:50:55+00:00"}, "author": "mediabest", "twitter": {"card": "summary_large_image", "image": "https://hotlifestylenews.com/wp-content/uploads/2018/11/ccelebritiesfotors_600x600-180306091951-600-GwynethApple.jpg", "label1": "Written by", "data1": "mediabest", "label2": "Est. reading time", "data2": "7 minutes"}, "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://hotlifestylenews.com/wp-content/uploads/2019/11/cropped-5-270x270.gif"}, "movies": [], "publish_date": 1543290655.0, "source": "http://hotlifestylenews.com", "summary": ""}