{"url": "https://www.cesarsway.com/dog-care/nutrition/puppy-feeding-guidelines", "text": "Hello, I am rescuing my first puppy next Monday. She’ll be 11.5 weeks when we get her, and I’ve never had a dog that young. The people fostering her are feeding her litter 3/4 cup twice a day.\n\nShe’s an Australian shepherd/great pyrenees/golden retriever mix. I keep reading mixed things about feeding them twice or three times a day. Which do you recommend?\n\nAnd if it is three times a day, given that she’s almost three months old, how much would you feed her each time? I have an appointment with a vet on that Friday, but wanted to ask you what you thought, hoping to get an answer before I pick her up.\n\nThanks so much in advance! I’m really excited to take on this challenge, But it’s also a little nerve-wrecking to not know how much to feed her exactly?\n\n-Michele Solano\n\nRead Dr. Kristy Conn’s Advice:\n\nCongratulations on your newest four-legged addition to your family. I understand the excitement and trepidation that comes with bringing home a furry ball of joy. You want to do right by her and that includes making sure she is getting the correct amount of nutrition. This is a popular time of year for bringing home puppies so I’d like to take the opportunity to review basic puppy feeding guidelines for the first year of life while covering your question which may also answer any future questions you or other readers may have.\n\nFirst 6 to 8 Weeks\n\nDuring the first six to eight weeks of life the puppy should stay with the mother and be allowed to nurse ad-lib. It is especially important they nurse from the mother. The mother’s milk provides the best nutrition and provides antibodies to help protect your puppy from disease. Sometimes it is not possible to keep a puppy with the mother for the first eight weeks such as when the mother develops eclampsia or mastitis. In these situations milk replacers and bottles especially designed for puppies can be found at any major pet store.\n\nWeaning Your Puppy to Solid Food\n\nWeaning your puppy to solid food should not be an overnight endeavor but should ideally take place over the course of two to three weeks. First select the brand of puppy food you intend to feed. Puppies have high caloric and nutritional needs and so the food selected should be a high quality brand of puppy food. Talk to your veterinarian for specific recommendations but generally the best puppy foods will be a good source of protein, calcium and calories.\n\nStarting around four to six weeks of age begin introducing your puppy to puppy food by making a gruel by blending the puppy food with milk replacer. Offer the gruel three to four times a day gradually reducing the amount of milk replaced used to make the gruel. This way your puppy gradually learns to adapt to solid food and gastric upset is minimized. By around eight weeks of age your puppy should be eating solid food.\n\nHow Often to Feed Your Pup\n\nPuppies should be fed three to four times a day therefore if you are currently feeding ¾ a cup of puppy food twice a day you should consider spacing it out by feeding ½ cup three times a day.\n\nSmaller meals are easier to digest for the puppy and energy levels don’t peak and fall so much with frequent meals. At around six months you may start feeding twice a day for convenience but because your dog is a mixed large breed dog I would recommend sticking with a 3-4 times a day feeding schedule if possible to minimize the risk of gastric dilatation volvulus.\n\nPurina Pro Plan Large Breed Dry Puppy Food, Chicken and Rice Formula - 34 lb. Bag One (1) 34 lb. Bag - Purina Pro Plan Large Breed Dry Puppy Food, Chicken and Rice Formula\n\nFormulated to support an appropriate growth rate for large breed puppies\n\nGlucosamine supports developing joints and cartilage\n\nMove on From Puppy Food\n\nPuppy food is very high in calories and nutritional supplements so you want to switch to adult food once your puppy begins to approach maturity. There is no set age when the switch should be made because it will vary with the breed and individual dog.\n\nIn general, the smaller the dog the faster they reach maturity. Small breeds up to 30 pounds mature around ten to twelve months of age although some toy breeds reach maturity even sooner. Medium breed dogs up to 80 pounds will reach maturity between twelve to sixteen months and I believe your puppy may fall into this category. It really depends how much Great Pyrenees she has in her. Large breed dogs weighing more than 80 pounds can take up to two years to reach maturity.\n\nWhen making the switch to adult food, do it slowly over the course of one to two weeks by gradually mixing in increasing amounts of the adult food with decreasing amounts of her puppy food to minimize gastric upset.\n\nFoods to Avoid\n\nTry to avoid foods that list corn or meat by-products as the first ingredient because meat should be the first ingredient.\n\nAvoid feeding your dog puppy food longer than you have to. Feeding puppy food too long can result in obesity and orthopedic problems. You will know when it is time to make the switch when you notice your dog eating less of the puppy food or if she starts to put on too much weight.\n\nDon’t Let Your Dog Get Chubby\n\nIt is important to be able to judge your dog’s body condition score in order to determine how much food you should give.The recommendations on the labels are guidelines only and will not apply to every dog. You may need to feed a little more or less depending on your dog’s condition score.\n\nIdeally you should be able to feel but not see the ribs and by looking straight down at your dog while she is standing there should be a recognizable waist. Ask your veterinarian if your dog is at a healthy weight during your next visit and ask for examples of body condition scores.", "images": ["https://www.cesarsway.com/wp-content/uploads/2015/11/protecting-your-dog-from-diabetes-cesars-way-300x200.jpg", "https://ir-na.amazon-adsystem.com/e/ir?source=bk&t=cesarway-20&bm-id=default&l=ktl&linkId=1d5298812123833945707d3767bac5c4&_cb=1559323469867", "https://www.cesarsway.com/wp-content/uploads/2019/08/ways-to-stop-your-dog-from-chewing-cesars-way-150x150.jpg", "https://www.cesarsway.com/wp-content/uploads/2015/06/safety-essentials-for-dog-walkers-cesars-way-150x150.jpeg", "https://www.cesarsway.com/wp-content/uploads/2019/03/cesar-ng-blog-1024x126.jpg", "https://www.cesarsway.com/wp-content/uploads/2021/02/Cesar-Milan-CW-Old-Logo-1024x1024-1-1024x1024.png", "https://www.cesarsway.com/wp-content/uploads/2015/06/Understanding-your-dogs-nutritional-needs-300x225.jpg", "https://ir-na.amazon-adsystem.com/e/ir?source=bk&t=cesarway-20&bm-id=default&l=ktl&linkId=6eda46c332b4e583b1675d838470282b&_cb=1559323498800", "https://ir-na.amazon-adsystem.com/e/ir?source=bk&t=cesarway-20&bm-id=default&l=ktl&linkId=2c8418d75fd95a442792b98b822740f4&_cb=1559323448236", "https://www.cesarsway.com/wp-content/uploads/2020/09/ways-to-socialize-your-dog-cesars-way-2-150x150.jpg", "https://m.media-amazon.com/images/I/41cEldnka1L._SL160_.jpg", "https://www.cesarsway.com/wp-content/uploads/2018/09/Puppy-feeding-guidelines.jpg", "https://ad.doubleclick.net/ddm/activity/src=10031418;type=natge0;cat=20csrmln;dc_lat=;dc_rdid=;tag_for_child_directed_treatment=;tfua=;npa=;gdpr=${GDPR};gdpr_consent=${GDPR_CONSENT_755};ord=1", "https://www.cesarsway.com/wp-content/uploads/2019/03/cesar-ng-blog-mobile.jpg", "https://www.cesarsway.com/wp-content/uploads/2018/01/5-ways-to-keep-your-dog-happy-and-healthy-300x160.jpg", "https://www.cesarsway.com/wp-content/uploads/2018/04/cesar-logo-100x100.png", "https://ir-na.amazon-adsystem.com/e/ir?source=bk&t=cesarway-20&bm-id=default&l=ktl&linkId=d1d69f6e3db4087c82732a6efa71bfb4&_cb=1559249313251", "https://www.cesarsway.com/wp-content/uploads/2020/07/Cesars-Way-training-logo.png"], "top_img": "https://www.cesarsway.com/wp-content/uploads/2018/09/Puppy-feeding-guidelines.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cesarsway.com/puppy-feeding-guidelines/", "title": "Puppy Feeding Guidelines", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Know when to transition from puppy food, what foods you should avoid feeding them and how often you should feed your puppy.", "og": {"locale": "en_US", "type": "article", "title": "Puppy Feeding Guidelines | Schedule & Tips - Cesar's Way", "description": "Know when to transition from puppy food, what foods you should avoid feeding them and how often you should feed your puppy.", "url": "https://www.cesarsway.com/puppy-feeding-guidelines/", "site_name": "Cesar's Way", "image": {"identifier": "https://www.cesarsway.com/wp-content/uploads/2018/09/Puppy-feeding-guidelines.jpg", "width": 845, "height": 450, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/cesar.millan/", "published_time": "2020-07-27T00:00:00+00:00", "modified_time": "2022-06-01T15:38:57+00:00"}, "twitter": {"card": "summary_large_image", "creator": "@cesarmillan", "site": "@cesarmillan", "label1": "Written by", "data1": "Cesar Millan Content Contributors", "label2": "Est. reading time", "data2": "6 minutes"}, "generator": "WordPress 6.0.2", "fb": {"pages": 42463089953}, "ia": {"markup_url": "https://www.cesarsway.com/puppy-feeding-guidelines/?wpna_ia_markup=true"}, "theme-color": "#3ba9d2", "msapplication-TileImage": "https://www.cesarsway.com/wp-content/uploads/2021/07/cropped-CW-270x270.png"}, "movies": [], "publish_date": 1595808000.0, "source": "https://www.cesarsway.com", "summary": ""}