{"url": "https://en.wikipedia.org/wiki/Teen_Wolf_(2011_TV_series)", "text": "American supernatural teen drama television series\n\nTeen Wolf is an American supernatural teen drama television series developed by Jeff Davis for MTV, loosely based on the 1985 film of the same name. Tyler Posey portrays a young werewolf who defends his California town from supernatural creatures and other threats.\n\nThe series premiered on June 5, 2011, and concluded on September 24, 2017, after six seasons. It received generally positive reviews from critics and won three Saturn Awards for Best Youth-Oriented Television Series. The series also received 13 Teen Choice Awards, nine for the performances of Posey, Dylan O'Brien, Tyler Hoechlin, Holland Roden, and Shelley Hennig, and four for Choice Summer TV Series. A film continuation, Teen Wolf: The Movie, is scheduled to be released on Paramount+ in 2023.\n\nSynopsis [ edit ]\n\nTeen Wolf revolves around Scott McCall, a high school student living in the fictional California town of Beacon Hills. Scott becomes the eponymous teenage werewolf of the series after he is bitten by an alpha werewolf the night before his second year of high school, drastically changing his once-ordinary life. The bite forces him to balance his new identity with day-to-day teenage life and eventually help protect his hometown, which he learns is a beacon for supernatural activity.\n\nScott begins the series as a relatively unpopular and unathletic student who lives with his divorced mother Melissa, a nurse at Beacon Hills Memorial Hospital. As a werewolf, he develops heightened physical abilities and senses well beyond those of an ordinary human, but he also must control animalistic instincts that are amplified by feelings of aggression and full moons. Further complicating matters, Scott develops romantic feelings for new classmate Allison Argent, who comes from a family of werewolf hunters that includes her father Chris Argent. Helping Scott manage his new life are his best friend Stiles Stilinski, the son of Beacon Hills Sheriff Stilinski, and the natural-born werewolf Derek Hale. The supernatural events surrounding Beacon Hills also end up affecting Lydia Martin, a popular and intelligent student who discovers that she is a banshee, and Jackson Whittemore, the captain of the school's lacrosse team who resents Scott's newfound attention. As new and familiar threats emerge, Scott is joined by werecoyote Malia Tate, kitsune Kira Yukimura, and Scott's first beta werewolf Liam Dunbar in keeping his family, friends, and the rest of the town safe.\n\nCast and characters [ edit ]\n\nTyler Posey as Scott McCall: Scott is turned into a werewolf in the series premiere and, alongside his friend Stiles, begins to uncover the complicated supernatural world of Beacon Hills, California.\n\nCrystal Reed (seasons 1–3; guest season 5) as Allison Argent: Scott's first love interest, Allison, descends from a long line of werewolf hunters. Her formidable prowess with a bow and arrow is an asset to the team in encounters with the shapeshifters and monsters that roam Beacon Hills. Reed also portrays Allison's ancestor Marie-Jeanne Valet in the fifth season.\n\nDylan O'Brien as Stiles Stilinski: Stiles is Scott's childhood best friend, with a talent for solving mysteries and a fierce loyalty to those closest to him. As a young child, Stiles is portrayed by Anthony Lapenna. O'Brien also portrays the Nogitsune, a demon who possesses Stiles.\n\nTyler Hoechlin (seasons 1–4; guest season 6) as Derek Hale: An older werewolf from a prominent werewolf family in Beacon Hills, Derek starts off with a hostile relationship towards Scott and his \"pack\" of friends, but comes to be a valuable ally. Ian Nelson portrays the teenage Derek.\n\nHolland Roden as Lydia Martin: A popular girl at Beacon Hills High and a close friend of Allison's. Lydia initially tries to play down her formidable intelligence; she is a genius. After an encounter with Derek's villainous uncle Peter Hale in season one, her own supernatural abilities—those of a banshee—begin to manifest.\n\nColton Haynes (seasons 1–2; guest season 6) as Jackson Whittemore: Lydia's shallow boyfriend. Jackson antagonises Scott and Stiles relentlessly but suffers from inner self-hatred. This causes his encounter with a werewolf's bite to turn him into another sort of creature: the deadly reptilian kanima. Jackson abruptly leaves Beacon Hills in the gap between seasons two and three, but returns for a guest stint at the end of season six, having come out and entered a relationship with another werewolf, Ethan.\n\nShelley Hennig (seasons 4–6; recurring season 3) as Malia Tate: The daughter of Peter Hale and a werecoyote assassin, Malia was adopted into a local Beacon Hills family for her own safety. After her new family is killed, she spends her formative years as a fully transformed feral coyote. After rejoining the human social world, she develops a blunt, no-nonsense personality, while adjusting to teenage life as a fish out of water.\n\nArden Cho (seasons 4–5; recurring season 3) as Kira Yukimura: [1] Kira moves to Beacon Hills as monsters from Japanese mythology are beginning to plague the lives of her new classmates; she herself discovers that she is a thunder kitsune with profound swordsmanship skills and electrical powers. Cho also portrays Kira's mother Noshiko as a young woman.\n\nKira moves to Beacon Hills as monsters from Japanese mythology are beginning to plague the lives of her new classmates; she herself discovers that she is a thunder kitsune with profound swordsmanship skills and electrical powers. Cho also portrays Kira's mother Noshiko as a young woman. Dylan Sprayberry (seasons 5–6; recurring season 4) as Liam Dunbar: Liam is a younger rival of Scott's with anger issues who Scott is forced to transform into a werewolf in order to save his life. Liam's anger gives him an uncommon degree of strength for a young werewolf, and he comes to develop a real respect for his mentor, Scott.\n\nLinden Ashby (season 6; recurring seasons 1–5) as Sheriff Noah Stilinski: [2] Stiles' father is initially reluctant to help his son and Scott with their escapades but is later brought into their supernatural secret. From then on, he assists his son by deploying the resources of the police department to help when he can.\n\nStiles' father is initially reluctant to help his son and Scott with their escapades but is later brought into their supernatural secret. From then on, he assists his son by deploying the resources of the police department to help when he can. Melissa Ponzio (season 6; recurring seasons 1–5) as Melissa McCall: [2] Scott's mother, a local nurse, becomes an invaluable ally of the gang once brought in on their secret, concealing unexplained supernatural occurrences and saving the lives of Scott and his pack members many times over.\n\nScott's mother, a local nurse, becomes an invaluable ally of the gang once brought in on their secret, concealing unexplained supernatural occurrences and saving the lives of Scott and his pack members many times over. JR Bourne (season 6; recurring seasons 1–5) as Chris Argent:[2] Allison's father is a born and raised werewolf hunter who is highly effective at what he does. He later comes around to see Scott as a vital protector of Beacon Hills and dedicates himself to supporting his cause. Max Lloyd Jones portrays the young Argent.\n\nEpisodes [ edit ]\n\nTeen Wolf premiered on June 5, 2011, following the 2011 MTV Movie Awards.[3] The second season premiered on June 3, 2012, after the 2012 MTV Movie Awards. On July 12, 2012, Teen Wolf was renewed for a third season, which includes 24 episodes and the production location was moved to Los Angeles, California.[4]\n\nThe third season premiered on June 3, 2013, at 10 pm,[5] giving the series a new high on ratings.[6] A fourth season premiered on June 23, 2014.[7] On July 24, 2014, MTV renewed Teen Wolf for a fifth season of 20 episodes, which was split into two parts, and premiered June 29, 2015.[9]\n\nOn July 9, 2015, Teen Wolf was renewed for a sixth season of 20 episodes. Showrunner Jeff Davis confirmed that Tyler Posey, Dylan O'Brien, Holland Roden, Shelley Hennig and Dylan Sprayberry would be reprising their roles as Scott McCall, Stiles Stilinski, Lydia Martin, Malia Tate and Liam Dunbar respectively.[10]\n\nSeason Episodes Originally aired Avg. viewers\n\n(millions) First aired Last aired 1 12 June 5, 2011 ( ) August 15, 2011 ( 2011-08-15 ) 1.73[11] 2 12 June 3, 2012 ( ) August 13, 2012 ( 2012-08-13 ) 1.69[11] 3 24 12 June 3, 2013 ( ) August 19, 2013 ( 2013-08-19 ) 1.97[12] 12 January 6, 2014 ( ) March 24, 2014 ( 2014-03-24 ) 4 12 June 23, 2014 ( ) September 8, 2014 ( 2014-09-08 ) 1.61[13] 5 20 10 June 29, 2015 ( ) August 24, 2015 ( 2015-08-24 ) 1.05[14] 10 January 5, 2016 ( ) March 8, 2016 ( 2016-03-08 ) 6 20 10 November 15, 2016 ( ) January 31, 2017 ( 2017-01-31 ) 0.47[15] 10 July 30, 2017 ( ) September 24, 2017 ( 2017-09-24 )\n\nDevelopment and production [ edit ]\n\nIn June 2009, MTV announced that they would be adapting the 1985 film Teen Wolf into a new television series \"with a greater emphasis on romance, horror and werewolf mythology\".[16] The film had been previously adapted for television as an animated series that aired on CBS in 1986–87.\n\nFor the MTV series, creator and executive producer, Jeff Davis, aimed to develop a darker, sexier and edgier version than the 1985 film. Davis' desire was to make a thriller with comedic overtones but in a tone more similar to that of the 1987 vampire film The Lost Boys. According to Davis, it all started with an idea to do a homage to Stand by Me, where in the beginning, the kids go out and search for a body in the woods and it's not quite what they expect.[17] The look of the show was inspired in part by Guillermo del Toro's creatures in Pan's Labyrinth; the producers described the werewolves as beautiful, elegant and scary, at the same time.[17]\n\nOnce the show was a go, Davis lined up Australian director Russell Mulcahy, who added the horror to the project.[17] Mulcahy directed the pilot presentation and serves as executive producer and in-house director.[18]\n\nThe title card from season one.\n\nCasting announcements were all announced in December 2010, with the main cast being, Tyler Posey, Crystal Reed, Tyler Hoechlin, Dylan O'Brien, Holland Roden, and Colton Haynes. Posey was cast as the lead Scott McCall, a dorky high-school student who after being bitten by a werewolf, starts to notice changes in himself, Reed playing Allison Argent, a sweet new girl at school who is immediately attracted to Scott, Hoechlin playing Derek Hale, a handsome local boy who in fact is a vicious and predatory werewolf, and O'Brien playing Stiles, Scott's best friend. Roden playing Lydia Martin, Jackson Whittemore's popular and controlling girlfriend, and Haynes playing Jackson Whittemore, Scott's lacrosse teammate and rival.[19]\n\nProduction on twelve episodes began in October 2010 in Atlanta, Georgia.[20] MTV released a sneak peek of the first eight minutes of the pilot on their website, on May 31, 2011. Teen Wolf episodes are composed by music composer Dino Meneghin.[21] As of Season 2, the opening credits of the show changed dramatically to a longer format featuring the main characters appearing whilst performing an action (such as Colton Haynes performing a lacrosse throw), along with the respective names of the actors.\n\nThe new opening credits also feature the show's new theme song.[22] In June 2012, the series received conditional approval for a California film and TV tax credit.[23] At Comic-Con 2012, the cast confirmed that the show had been renewed for a longer third season, comprising twenty-four episodes.[24] In June 2013, the series was selected again for a California tax credit.[25]\n\nOn September 24, 2021, Paramount+ ordered a reunion film for the series, entitled Teen Wolf: The Movie, with most of the cast expected to return,[26] with the exception of main cast members Dylan O'Brien, Arden Cho and Cody Christian.\n\nDifferences and similarities from films [ edit ]\n\nTeen Wolf shares no continuity with the 1985 film Teen Wolf or its sequel, Teen Wolf Too,[27][28] but does contain allusions to the film which inspired its premise. The original film is about a typical awkward basketball-playing teenager named Scott dealing with high school and life as a werewolf.[29][30] In both the film and show, Scott reaps the benefits of werewolf stardom, achieving confidence and acceptance from his peers with his newly-discovered powers, and has a close friend named Stiles. In the 1985 movie, Scott played basketball, whereas in the series, he plays lacrosse; Stiles wears retro British T-shirts in the TV series rather than the offensive T-shirts of the film; and Scott is transformed into a werewolf by bite in the series, whereas in the film he inherits the trait from his father.[29]\n\nWhile the Teen Wolf films are comedies, the MTV series is a drama that contains comedic elements as well as dark themes, violence, and gore. The writers decided early on to exclude vampires from their in-show mythology.[31]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nThe first season of the series generated a generally positive response from professional critics, with some praising it as better quality when compared to other shows by MTV. According to Metacritic, which assigns a rating out of 100 to reviews from mainstream critics, the show holds an average score of 61 out of 100, which indicates \"Generally favorable reviews\", based on fourteen reviews.[39] Metacritic also lists the show as the second-highest rated MTV series by professional critics behind Awkward.[40]\n\nReview aggregator Rotten Tomatoes reports that 68% of 25 critics have given the first season a positive review. The site's consensus is: \"Thanks to a charismatic lead in Tyler Posey and some dark, biting humor, Teen Wolf is a pleasant summer surprise, even if it does tread familiar ground.\"[41] Linda Stasi, a writer from the New York Post, awarded the series' premiere a perfect score, stating, \"Not only is it really well thought out, but the good-looking kids in the show can actually act.\"[42] Verne Gay from Newsday also reserved high praise for the show, calling it a \"winner and best of all, fun\".[43] David Hinckley of New York Daily News commented favorably on the series, ending his review with \"Werewolves, pretty girls, dumb bullies and lacrosse. What more, really, could you ask of high school?\"[44] Film critic Rex Reed is a fan of the series, calling it \"the sexiest show on television today.\"\n\nSome critics had a less positive reaction toward the first episode. Troy Patterson from Slate gave it a mixed review, referring to it as \"light and passably witty supernatural drama\".[45] James Poniewozik from Time magazine also had mixed feelings towards the show, saying, \"The pilot isn't bad, exactly—it's well-paced if a little dour in spots and there's some decent CW-esque banter—but it's pretty much entirely what I would have expected from any supernatural teen drama\".[46] Following the first-season finale in August 2011, Ian Grey of indieWire gave the series a positive review[47] and Angel Cohn of Television Without Pity named it the third best new show of the summer.[48] BuddyTV ranked Teen Wolf #4 on its list of 2011's best new TV shows.[49]\n\nThe second season of the show received even more positive reviews than the first, with Rotten Tomatoes reporting a 90% approval rating based on 10 critical reviews.[50] The third season also received positive reviews, earning an approval rating of 88% based on 17 reviews.[51]\n\nDespite its generally positive reception, the show struggled with its representation of LGBTQ characters and issues and was critiqued for queerbaiting.[52][53]\n\nRatings [ edit ]\n\nThe series premiere attracted a total of 2.17 million viewers.[54] After airing its third episode, Teen Wolf was reported to be heading into its fourth week with tremendous momentum following a 23 percent increase among persons 12–34, with a 1.6 in the demo. With double digit percentage gains among total viewers and key demos, Teen Wolf was the #1 show in its timeslot with women 12–34.[55] The first-season finale attained a series high in persons 12–34 (1.9) and 2.1 million viewers overall, as well as being first in its timeslot among teens and females 12–34.[56]\n\nThe show's creator, Jeff Davis confirmed that the show benefits from a very significant online viewership, with up to eight million streams per episode on MTV's online platforms alone. Davis cited this as a significant contributing factor to MTV renewing the show for a sixth season.[57]\n\nViewership and ratings per season of Teen Wolf Season Timeslot (ET) Episodes First aired Last aired TV season Avg. viewers\n\n(millions) Date Viewers\n\n(millions) Date Viewers\n\n(millions) 1 Monday 10:00 pm 12 June 5, 2011 ( ) 2.17[58] August 15, 2011 ( 2011-08-15 ) 2.08[59] 2010–11 1.73[60] 2 12 June 4, 2012 ( ) 2.11[61] August 13, 2012 ( 2012-08-13 ) 1.71[62] 2011–12 1.69[60] 3 24 June 3, 2013 ( ) 2.36[63] March 24, 2014 ( 2014-03-24 ) 2.26[64] 2013–14 1.97[65] 4 12 June 23, 2014 ( ) 2.18[66] September 8, 2014 ( 2014-09-08 ) 1.54[67] 2013–14 1.61[68] 5 Monday 10:00 pm (Part 1)\n\nTuesday 9:00 pm (Part 2) 20 June 29, 2015 ( ) 1.53[69] March 8, 2016 ( 2016-03-08 ) 0.80[70] 2015–16 1.05[71] 6 Tuesday 9:00 pm (Part 1)\n\nSunday 8:00 pm (Part 2) 20 November 15, 2016 ( ) 0.57[72] September 24, 2017 ( 2017-09-24 ) 0.68[73] 2016–17 0.47[74]\n\nOther media [ edit ]\n\nBook [ edit ]\n\nIn June 2012, MTV Books released the book On Fire, by Nancy Holder. The cover art features Tyler Posey with glowing yellow eyes, with a fire red background. The book tells the story of Scott McCall and the first season of Teen Wolf.\n\nComic [ edit ]\n\nA comic themed upon the show was released in June 2011 by Image Comics.[75]\n\nAccolades [ edit ]\n\nBroadcast [ edit ]\n\nCanada's MuchMusic aired the series until 2014,[99] when it was moved to the domestic version of MTV.[100] The United Kingdom's BSkyB aired the first two seasons on pay television channel Sky Living. BSkyB stopped broadcasting Teen Wolf after the second-season finale.[101]\n\nBibliography [ edit ]\n\nJ. Elliott & M. Fowler, \"'Smile, Derek. Why Don't You Smile More?': The Objectification of Derek Hale and Queerbaiting in MTV's Teen Wolf. \" Journal of Fandom Studies , 2018.\n\n\" , 2018. M. Johnson, \"The Homoerotics and Monstrous Otherness of Teen Wolf.\" Studies in the Humanities 43 (2016): 65-81.\n\n43 (2016): 65-81. E. Kendal & Z. Kendal, \"Consent is Sexy: Gender, Sexual Identity and Sex Positivism in MTV's Young Adult Television Series Teen Wolf (2011–).\" COLLOQUY text theory critique 30 (2015): 26-41.\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/83/Teen_Wolf_Intertitle.png/250px-Teen_Wolf_Intertitle.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Teen_Wolf_2011_Title_card.jpg/220px-Teen_Wolf_2011_Title_card.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/8/83/Teen_Wolf_Intertitle.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/8/83/Teen_Wolf_Intertitle.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Teen_Wolf_(2011_TV_series)", "title": "Teen Wolf (2011 TV series)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/8/83/Teen_Wolf_Intertitle.png", "width": 640, "height": 359}, "title": "Teen Wolf (2011 TV series) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}