{"url": "https://www.womansown.co.uk/celebrity/transformations/celebrities-then-and-now-22029/", "text": "GoodTo newsletter Sign up to the GoodTo Newsletter. You can unsubscribe at any time. For more information about how to do this, and how we hold your data, please see our privacy policy Contact me with news and offers from other Future brands Thank you for signing up to . You will receive a verification email shortly. There was a problem. Please refresh the page and try again. By submitting your information you agree to the Terms & Conditions (opens in new tab) and Privacy Policy (opens in new tab) and are aged 16 or over.\n\nWe take a look back and see what the leading stars of today looked like when they first hit the limelight. From Nicole Kidman and Kristen Stewart to Brad Pitt and Leo DiCaprio, see how they've changed here\n\nFrom child star to screen siren\n\nWow - we can't believe how young Miss Honey looks still!\n\nEmbeth Davidtz, the actress who played Miss Honey in the film Matilda, shared this recent picture of herself on her Instagram account, and she barely looks a day older than she did in the film.\n\nMatilda is now 20 years old, and was made in 1996 when actress Embeth was 30 years old - 20 years later she doesn't look much different! Since Matilda the actress has gone on to star in many films - such as the mean girlfriend of Mark Darcy in Bridget Jones Diary and alongside Robin Williams in Bicentennial man.\n\nMichael Greco\n\nUm, is it just us, or has Michael barely aged a day?!\n\nThe actor, who is best known for his role as Beppe in EastEnders, recently appeared on Loose Women to promote his new musical, Exposure, and fans couldn't believe their eyes at just how fresh faced he looked.\n\n'Omph Michael Greco is still as fit as ever,' one wrote, whilst another agreed, 'Oh good god hello Michael Greco 😍 @loosewomen was only thinking the other day how much I missed seeing his gorgeous face on @bbceastenders'.\n\nAlthough he's back on stage now, Michael took a break from acting after leaving the show, explaining, 'Back in 2002, 2003 when I left, I kind of lost my way as an actor and thought 'I need time out here' so I gave up acting completely, moved away, moved abroad, and became a professional poker player.'\n\n'I got sponsored by a company and they kind of just sent me all over the world to play. I was in the Top 10 in Europe at one point.'\n\nTulisa\n\nWow, Tulisa - we barely recognised you!\n\nThe former X Factor judge posted the recent selfie on the right to her Twitter account, captioning the snap 'Rise & shine'. Although she's wearing visibly less make up than in the red carpet snap on the left, the 27-year-old looks a world away from the girl we all knew a few years ago.\n\nSince leaving the ITV show in 2012, Tulisa has been busy with her music career, releasing a solo album and topping the charts with her song 'Young', as well as featuring on other artists' tracks as well.\n\nWe can't wait to see what she's working on next!\n\nSteph and Dom Parker\n\nThis Gogglebox twosome are one of our favourite families on Gogglebox, which is why we love this brilliant throwback wedding snap they shared with their 263,000 Twitter followers.\n\n'Throwback to the best day of our life? #TBT #ChinChin', the pair captioned the pic on their joint account, proudly showing off Dom's smart velvet jacket and Steph's incredible high-necked gown.\n\nFans were thrilled with the blast from the past, with one commenting 'Fabulous photo , such a handsome couple of funsters' and another adding 'This has quite literally made my day.'\n\nThey may look a little different nowadays, but you can tell their happy relationship hasn't changed a bit. Now, when do we get to see wedding pictures from the rest of the cast?\n\nKate Nash\n\nYou may remember her hit record Foundations that was playing non-stop on the radios in 2007, but Kate Nash looks nothing like she did back then.\n\nLong gone are the days of her indie chic fringe and brown hues, which have been replaced by a blonde (slightly bedhead, if this pic is anything to go by) look. What a transformation!\n\nThe singer and songwriter is currently working on her fourth album, having not released any new music since Girl Talk in 2013. She's also been busy penning songs for other artists, including Rita Ora's new hit Poison. We can't wait to hear her new stuff!\n\nMarc Elliott\n\nMarc played the role of Syed in EastEnders from 2009 to 2012, and how things have changed since he left Albert Square!\n\nNot only has Marc radically changed his trademark wavy locks, he's now a member of the Holby City cast, taking on the role of Issac Mayfield - the new love interest of doctor Dominic Copelan.\n\nMarc said of his new TV family, 'I?m pleased to be joining the team and looking forward to playing this complex, flawed character. My twin sister was born with the brains and is a qualified veterinary surgeon. I?m chuffed to finally be able to compete - if only in the pretend world.'\n\nMutya Buena\n\nMum of one and former Sugarbabes star Mutya Buena has certainly changed in the last few years since we last laid eyes on her.\n\nFollowing her short stint as one of the Sugarbabes 10 years ago, Mutya stepped out of the spotlight and has rarely been seen in public since.\n\nIn this recent outing Mutya was spotted at nightclub Raffles in London?s Chelsea, for WAG Chantelle Heskey?s birthday.\n\nThe 30-year-old star wore a short black dress with strappy sky-high heels, which showed off plenty of leg. Always a fan of a bold and bright look, the former singer also wore striking purple lipstick, huge hoop earrings and an updo that pulled her hair back from her face.\n\nMutya?s latest look also exhibited all of her tattoos, and it would appear that she?s been busy during her time off from singing, building up quite a collection. With colourful images drawn across her thighs, arms and chest, we think it?s safe to say she?s a fan of ink.\n\nWhat do you think of Mutya's latest look? Let us know in the comments below!\n\nJimmy Karz\n\nWe all remember little Bruce Bogtrotter from the film adaption of Roald Dahl's childhood classic Matilda.\n\nThe 12-year-old child who defeats demon headmistress Miss Trunchbull over the giant chocolate cake and all of his classmates stand up and cheer him on? Well, just look at him now!\n\nIt has been a whole TWO decades since the film was released in 1996 and now Jimmy, 31, looks so different that we hardly recognised him!\n\nJimmy is no longer an actor and is currently training to become a doctor at the Philadelphia College of Osteopathic Medicine.\n\nHaley Joel Osment\n\nRemember little Haley, who found fame with the iconic line, 'I see dead people' in 90s horror film The Sixth Sense? Well we can hardly believe that this is that same little baby-faced boy!\n\nIt's been a whole 16 years since 11-year-old Haley starred alongside Bruce Willis in the 1999 psychic blockbuster (well that makes us feel old...), and the star is now all grown up at 27 years old.\n\nAfter the success of the The Sixth Sense, Haley took a break from acting to attend Tisch School Of The Arts, before getting back into drama again. He most recently starred in hit US film Entourage, beard and all!\n\nHow time flies, eh?\n\nDaniel Bedingfield\n\nRemember fresh-faced Daniel of 'Gotta Get Thru This' fame? Well, he doesn't look like that anymore!\n\nThe now 35 year old has just launched a charity single, Team Ball Player Thing, in conjunction with the Rugby World Cup, to raise money to help cure Batten?s Disease, and looks a world away from the young lad he was when he made his 2001 chart debut.\n\nPrior to his return to music, Daniel had been a judge on X Factor New Zealand, and devoted himself to charity work, getting involved with both his parents' charity Global Angels and starting an anti-slavery coallition himself.\n\n(Psst - if you think Daniel looks different, you won't believe what his sister Natasha looks like now!)\n\nMara Wilson\n\nShe's hardly changed from the days of Miss Truchbull's dreaded chokey!\n\nMara Wilson is best known for her roles from yesteryear, including playing super cute Natalie in Mrs. Doubtfire, Susan on Miracle on 34th Street and book-loving Matila in the 1996 film of the Roald Dahl classic.\n\nSince Matila, Mara's kept quite a low profile on the Hollywood acting scene, stating on her website: 'I don?t have any plans to pursue film acting. It?s not my ?thing? anymore, if it ever was'. She has however lent her voice to quite a few animated films and is now a writer. And still rocking a great fringe.\n\nMadison De La Garza\n\nCast your mind back to 2008...remember that face on the left? Madison De La Garza played Juanita Solis, daughter of Eva Longoria's character, Gabriella Solis, in Desperate Housewives until 2012.\n\nShe's certainly grown up! Now 13, Madison still has some more America television show credits to her name and is in fact little sister to pop star, Demi Lovato.\n\nJason James Richter\n\nFree Willy will always be one of our favourite 90's films. Remember 12-year-old Jesse, who made it his mission to save the captive Orca whale? It's no surprise he grew up but seeing Jason James Richter, who played him, as a 35-year-old definitely makes us feel a little old!\n\nJason played Jesse in all three of the Free Willy films and still acts to this day.\n\nThomas Brodie Sangster\n\nIf you're not a Game Of Thrones fan, this 'then and now' pic may surprise you!\n\nRemember adorable Sam from Love Actually? Come on, who can forget that airport scene?! Well Thomas Brodie Sangster, who was 12 at the time, is now 25 years old! Now we feel old...\n\nHe's still an actor, having starred in films including Nanny McPhee, Nowhere Boy and soon-to-be-released, Maze Runner, plus he played Jojen Reed in Game Of Thrones.\n\nKate Moss\n\nWow, we can hardly believe we're saying this, but Kate Moss turned 40 in January 2014! The gorgeous model - who, let's face it, has barely aged a day - is sure to have celebrated her landmark birthday in style. The picture on the left was taken in 1991 and the one on the right in 2013, that's 22 years difference - and, we don't know about you, but we can barely see a wrinkle!\n\nAnna Chlumsky\n\nRemember little Vada Sultenfuss from My Girl? Look at her now. Child actress Anna Chlumsky has grown into the glamorous star of new American TV series Veep. She's 31 in this picture and we can't believe how much she's grown from when she was in My Girl with Macaulay Culkin at just 11 years old!\n\nAlisan Porter\n\nHasn't Curly Sue star Alisan Porter grown? The former child actress, 30 in this picture, was known for her role in the 1991 film. She recently got married to long-time friend Brian Autenrieth and is pregnant with their first child. Since starring in Curly Sue, Alisan moved to New York to concentrate on a theatre career and has appeared in Broadway shows.\n\nDaniel Radcliffe\n\nIn 2001 this child star made it to onto the big screen aged just 11 as Harry Potter in the popular series. Apart from Harry Potter, he's appeared on TV and in theatre and in 2006 his personal fortune was estimated as being £14million, making him on the richest young people in the UK.\n\nRupert Grint\n\nDoesn't Rupert Grint look cute aged just 12 before he even appeared in the Harry Potter films as Harry's friend Ron Weasley? Among the fantasy series, he's also featured in films such as Thunderpants and the thriller Cherrybomb. In 2007, he was ranked number 16 in Forbes' list of the top 20 earners under 25, earning $4million a year.\n\nTom Felton\n\nHarry Potter's rival Draco Malfoy, played by Tom Felton, has been in the film series from the beginning but Felton made his acting debut in The Borrowers in 1997 and has since appeared in Get Him to the Greek and The Disappeared. He was just 14 when he appeared in Harry Potter and the Philosopher's Stone.\n\nRobert Pattinson\n\nVoted the Sexiest Man Alive by Glamour magazine, it's hard to imagine this actor and model quite so unsexy as a teen. His biggest work has been starring as vampire Edward Cullen in the Twilight film series. Time magazine named him as one of the 100 most influential people in the world and his female fan base ranges from teenagers to their parents!\n\nLindsay Lohan\n\nHow adorable was Lindsay Lohan in The Parent Trap? Unfortunately she's grown out of those days. The actress was first seen on film in 1998 when she starred in the family comedy and has since had roles in Freaky Friday, Mean Girls and TV series Ugly Betty. She's often in the papers for her wild antics and most famously when she was caught driving under the influence of drugs.\n\nKate Winslet\n\nOscar winning Brit, Kate Winslet, was clearly born with acting talent in her blood. Since an early age Kate has starred in over 40 films and television shows as well as winning 39 awards and being nominated for a further 59.\n\nLeonardo DiCaprio\n\nHow cute was Leo as a child? The Hollywood actor has notched up some impressive roles during his big screen career including Titanic, The Beach, Blood Diamond and most recently Inception.\n\nAngelina Jolie\n\nAnge made her debut into the acting world at the tender age of seven. She starred in the film Lookin' to Get Out with her dad Jon Voight. Angelina is now one of the most famous and highly paid actresses in the world and has appeared alongside practically every leading man in Hollywood.\n\nNicole Kidman\n\nWow, check out Nicole's teenage perm! The Australian actress has wowed on the big screen since she first appeared in Chase Through the Night at 16-years-old. Since then Nicole has won critical acclaim for her roles in Moulin Rouge, The Hours and Australia.\n\nJohnny Depp\n\nWe've been lucky enough to have Johnny on our screens since he hit the big time in the 80s. Johnny is famous for his Pirates of the Carribbean role as Captain Jack Sparrow but has also starred in over 45 films including Edward Scissorhands, Alice in Wonderland and Charlie and the Chocolate Factory.\n\nBrad Pitt\n\nBrad started his journey to Hollywood stardom at the age of 15. After appearing in low-budget films for a few years he hit the big time with Thelma and Louise, Interview with a Vampire and A River Runs Through It. He is now one of the world's top actors and has taken on every role from fugitives and spies to bare-knuckle fighters and Greek warriors.\n\nGwyneth Paltrow\n\nGwyneth has risen through the acting ranks to become one of Hollywood's most successfull actresses. Since staring in Shout and Hook in the early 90s, Gwyneth has acted alongside Brad Pitt in Se7en, Michael Douglas in A Perfect Murder and Robert Downey Jr in Iron Man.\n\nJude Law\n\nAt just 15 Jude was playing a stableboy in The Tailor of Gloucester. Since then the Brit star has racked up roles in a number of blockbuster films including Alfie, Enemy at the Gates, Closer and Sherlock Holmes.\n\nChristina Ricci\n\nEveryone knows Christina Ricci from her role as Wednesday Adams at just 13-years-old. The young actress then moved on to roles in Casper, Fear and Loathing in Las Vegas and Sleepy Hollow to name but a few. Christina currently has five films in production\n\nMacaulay Culkin\n\nThe original Home Alone star, Macaulay Culkin, had aready started acting by the time he reached his fifth birthday. Since then he has started in over 20 films and is currently filming a military action comedy alongside Ray Winstone called Service Man.\n\nKristen Stewart\n\nYou'd be forgiven for not recognising Twilight's Kristen Stewart as the boyish-looking girl on the left. Before Kristen landed the hit role as Bella Swan in the Twilight series she walked various red carpets (in some dodgy outfits) thanks to her roles in Panic Room and The Flinstones in Viva Rock Vegas. She's now one of the world's most famous faces and has Robert Pattinson for a boyfriend.\n\nDakota Fanning\n\nDakota Fanning clearly has acting in her blood. The young actress has starred in over 41 films and television shows since the age of six. She has appeared alongside Tom Cruise, Denzel Washington and can be seen as the evil Volturi vampire, Jane, with Kristen Stewart in the new Twilight film, Eclipse.\n\nEmma Watson\n\nEmma Waston has gone from a budding actress to one of the world's most famous stars in the last 10 years. Her role as Hermione Granger in the Harry Potter films has made her the highest-grossing actress of the decade as well as one of the richest.\n\nDrew Barrymore\n\nWe can all remember Drew Barrymore as the super cute tot in E.T. back in 1982. Since then Drew has become one of Hollywood's leading ladies staring in hits such as Batman Forever, Charlie's Angels, Never Been Kissed and He's Just Not That Into You.\n\nKeira Knightley\n\nWe could barely recognise Keira Knightley in this picture taken from one of her first acting roles in the television series The Bill at only 10-years-old. Since then the Brit actress has risen to international stardom with performances in Bend It Like Beckham and the Pirates of the Carribbean trilogy. Keira has earned Oscar, Bafta and Golden Globe award nominations and has topped the list of highest paid actresses in Hollywood in previous years.\n\nScarlett Johansson\n\nScarlett Johansson has definitely made the transformation from dull to dazzling since she started out in the film industry at the age of 10. She's now one of Hollywood's hottest stars and is married to the gorgeous Ryan Reynolds.\n\nJodie Foster\n\nJodie Foster is definitely one of Hollywood's most acomplished actresses. Since starting out in the industry at just seven years old, Jodie has gone on to act in classic films such as Silence of the Lambs, Taxi Driver and Inside Man, as well as producing and directing other blockbuster hits. She has also won an Oscar, three Bafta Awards, two Golden Globe Awards and People's Choice Award.\n\nBonnie Wright\n\nBonnie is another child actress that has been catapulted into the spotlight thanks to Harry Potter. Bonnie's role as Ginnie Weasley (Harry Potter's love interest) has seen her become one of Britain's top actresses plus she is now engaged to Twilight star Jamie Campbell-Bower, making them one super-powerful couple.\n\nNatalie Portman\n\nSince the age of 13 Natalie Portman has been starring in films. From her incredible performance alongside Jean Reno in Leon to acting with Jake Gylenhaal in Brothers, Natalie is a much sought after actress.\n\nKirsten Dunst\n\nKirsten Dunst has apppeared in over 60 films and television episodes since the tender age of seven. The Spiderman star regularly commands a multi-million dollar fee for her acting roles and is always seen on the red carpet.\n\nVanessa Hudgens\n\nHasn't High School Musical star Vanessa Hudgens changed in just a few years? Not only is she now worth a shed load of cash, she's also invested in a stylist (fortunately) and bagged herself one of the hottest young actors around, Zac Efron.\n\nAnna Paquin\n\nFor all the True Blood fans out there, you'll instantly recognise Anna Paquin as vampire-loving Sookie Stackhouse. But Anna has been making films since the age of 11. Her hits include She's All That and the X-Men trilogy.\n\nHayden Panettiere\n\nCheck out Hayden's bright yellow hair when she first hit the red carpet at the age of 10. While Hayden has appeared in a few films, it's her television shows that have launched her career. Roles in Ally McBeal, Malcolm in the Middle and more recently Heroes have seen her become a shining star in Hollywood.\n\nMary-Kate and Ashley Olsen\n\nThese two have to be the world's most famous (and wealthy) twins on the planet. From the age of one Mary-Kate and Ashley starred in 189 episodes of Full House as well as over 20 other television shows and more than 10 films. They also have several other businesses including a clothing and make-up line, a sunglasses range and hangbag line and are estimated to be worth a billion dollars in a few years time.\n\nAdam Woodyatt\n\nEastEnders Ian Beale has been on our screens since he was a boy. As well as his role in the BBC soap he's starred in Celebrity Ready, Steady, Cook, A Question of Sport and Doctor Who.\n\nMiley Cyrus\n\nChild star, Miley Cyrus, has grown out of her Disney looks and has embarked on a more edgy acting and singing career. As well as her music talents, Miley has appeared in numerous television shows and is well on her way to making a name for herself in the film industry.\n\nKurt Russell\n\nKurt was well on his way into the acting world at just six-years-old. He started in the television series Tenderfoot before moving onto various other shows and eventually roles on the big screen including Forest Gump, Vanilla Sky and Poseidon.\n\nTaylor Momsen\n\nDespite being just 16 at the moment Taylor Momsen has certainly grown-up in the last few years. You'll probably only recognise her if you're a fan of the hit TV show Gossip Girl but Taylor has now branched out and is making music with her band The Pretty Reckless.\n\nMischa Barton\n\nYou may know Mischa from her role in TV's The OC, but she had appeared in several films and other television shows before she hit the big time. She has two films currently in production after taking a break from the business for a while.", "images": ["https://cdn.mos.cms.futurecdn.net/biyEbhvGFdgVoywrpyjDih-415-80.jpg", "https://cdn.mos.cms.futurecdn.net/biyEbhvGFdgVoywrpyjDih-1200-80.jpg", "https://mos.fie.futurecdn.net/zb5f5pyrl2meg2mf-16498480582794-250-80.jpg", "https://www.facebook.com/tr?id=230404523817416&ev=PageView&noscript=1", "https://vanilla.futurecdn.net/goodto/missing-image.svg", "https://www.womansown.co.uk/media/img/missing-image.svg"], "top_img": "https://cdn.mos.cms.futurecdn.net/biyEbhvGFdgVoywrpyjDih-1200-80.jpg", "keywords": [], "authors": ["Jessica Dady", "Emma Shacklock", "Window.Slicecomponents", "Window.Reliabledomcontentloaded.Then", "Var Componentcontainer", "Document.Queryselector", "Slice-Container-Authorbyline", "If Componentcontainer", "Var Data", "Layout"], "canonical_link": "https://www.goodto.com/family/celebs-now-and-then-39513", "title": "Celebs: Now and then", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2014-01-16T11:12:00+00:00", "description": "We take a look back and see what the leading ladies of today looked like when they first hit the limelight, before stylists, million dollar paychecks and famous boyfriends.", "robots": "max-image-preview:large,noindex", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://cdn.mos.cms.futurecdn.net/flexiimages/uo07kufk4j1637931526.png", "og": {"site_name": "GoodTo", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/biyEbhvGFdgVoywrpyjDih-1200-80.jpg", "width": 1200}, "type": "article", "title": "Celebs: Now and then", "url": "https://www.goodto.com/family/celebs-now-and-then-39513", "description": "We take a look back and see what the leading stars of today looked like when they first hit the limelight. From Nicole Kidman and Kristen Stewart to Brad Pitt and Leo DiCaprio, see how they've changed here"}, "article": {"publisher": "https://www.facebook.com/goodtoknow.co.uk/", "published_time": "2014-01-16T11:12:00Z"}, "parsely-type": "post", "parsely-post-id": "aRYQTb2a1NGFf4YaQWLGwG", "parsely-pub-date": "2014-01-16T11:12:00Z", "parsely-title": "Celebs: Now and then", "parsely-link": "https://www.goodto.com/family/celebs-now-and-then-39513", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/biyEbhvGFdgVoywrpyjDih.jpg", "parsely-section": "Family", "parsely-tags": "Category: Family,Category: Feature,exclude-from-homepage,van-exclude-latest,no-index,serversidehawk", "parsely-author": "GoodtoKnow", "twitter": {"card": "summary_large_image", "site": "@goodtoknow", "title": "Celebs: Now and then", "description": "We take a look back and see what the leading stars of today looked like when they first hit the limelight. From Nicole Kidman and Kristen Stewart to Brad Pitt and Leo DiCaprio, see how they've changed here", "creator": "@goodtoknow", "image": "https://cdn.mos.cms.futurecdn.net/biyEbhvGFdgVoywrpyjDih-1200-80.jpg", "account_id": 15469402}, "google-site-verification": "JFi9cGEj3Bw9Ny8LOGH-IC1QIX387tI2Em9SAD3NgcU", "taboola": {"url": "https://www.goodto.com/family/celebs-now-and-then-39513"}, "botify-site-verification": "gEo2ltw4ZxjJkBcaADHlIGePpMrucY2w", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E"}, "movies": [], "publish_date": 1389870720.0, "source": "https://www.womansown.co.uk", "summary": ""}