{"url": "https://www.apnews.com/0a4d7954c8d34c3291cb93c995789913", "text": "FILE - In this June 26, 2005 file photo, the Rev. Billy Graham speaks on stage on the third and last day of his farewell American revival in the Queens borough of New York. A spokesman said on Graham has died at his home in North Carolina at age 99. (AP Photo/Henny Ray Abrams)\n\nFILE - In this June 26, 2005 file photo, the Rev. Billy Graham speaks on stage on the third and last day of his farewell American revival in the Queens borough of New York. A spokesman said on Graham has died at his home in North Carolina at age 99. (AP Photo/Henny Ray Abrams)\n\nMONTREAT, N.C. (AP) — The Rev. Billy Graham, the magnetic, movie-star-handsome preacher who became a singular force in postwar American religious life, a confidant of presidents and the most widely heard Christian evangelist in history, died Wednesday at 99.\n\n“America’s Pastor,” as he was dubbed, had suffered from cancer, pneumonia and other ailments and died at his home in North Carolina. Graham died at 7:46 a.m., with only an attending nurse inside the home, said Mark DeMoss, spokesman for the Billy Graham Evangelistic Association. Both the nurse and Graham’s longtime personal physician, Dr. Lucian Rice, who arrived about 20 minutes later, said it was “a peaceful passing,” DeMoss said.\n\nADVERTISEMENT\n\nMore than anyone else, Graham built evangelicalism into a force that rivaled liberal Protestantism and Roman Catholicism in the U.S. His leadership summits and crusades in more than 185 countries and territories forged powerful global links among conservative Christians and threw a lifeline to believers in the communist bloc.\n\nTributes to Graham poured in from major leaders, with President Donald Trump tweeting: “The GREAT Billy Graham is dead. There was nobody like him! He will be missed by Christians and all religions. A very special man.” Former President Barack Obama said Graham “gave hope and guidance to generations of Americans.”\n\nA tall, striking man with thick, swept-back hair, stark blue eyes and a firm jaw, Graham was a commanding presence in the pulpit, with a powerful baritone voice.\n\n“The Bible says,” was his catchphrase. His unquestioning belief in Scripture turned the Gospel into a “rapier” in his hands, he said.\n\nGraham reached multitudes around the globe through public appearances and his pioneering use of prime-time telecasts, network radio, daily newspaper columns, evangelistic films and satellite TV hookups.\n\nBy his final crusade in 2005 in New York City, he had preached in person to more than 210 million people worldwide. No evangelist is expected to have his level of influence again.\n\n“William Franklin Graham Jr. can safely be regarded as the best who ever lived at what he did,” said William Martin, author of the Graham biography “A Prophet With Honor.”\n\nThe GREAT Billy Graham is dead. There was nobody like him! He will be missed by Christians and all religions. A very special man. — Donald J. Trump (@realDonaldTrump) February 21, 2018\n\nGraham’s body was moved Wednesday from his home in Montreat to Asheville, where a funeral home is handling the arrangements, DeMoss said. Graham’s body will be taken from Asheville to Charlotte on Saturday in a procession expected to take 3 ½ hours and ending at the Billy Graham Museum and Library. He will lie in repose Monday and Tuesday in the Charlotte house where he grew up, which was moved from its original location to the grounds of the Graham library. A private funeral for Graham will be held on Friday, March 2, in a tent at the library site and he will be buried next to his wife there, DeMoss said. Invitations to the funeral will be extended to President Donald Trump and former presidents, he said.\n\nDeMoss said Graham spent his final months in and out of consciousness. He said Graham didn’t take any phone calls or entertain guests. DeMoss quoted Dr. Rice as saying, “He just wore out.”\n\nGraham was a counselor to U.S. presidents of both parties from Dwight Eisenhower to George W. Bush. In 1983, President Ronald Reagan gave him the Presidential Medal of Freedom, America’s highest civilian honor. When the Billy Graham Museum and Library was dedicated in 2007 in Charlotte, North Carolina, George H.W. Bush, Jimmy Carter and Bill Clinton attended.\n\n“When he prays with you in the Oval Office or upstairs in the White House, you feel he’s praying for you, not the president,” Clinton said at the ceremony.\n\nBorn Nov. 7, 1918, on his family’s dairy farm near Charlotte, Graham came from a fundamentalist background that expected true Bible-believers to stay clear of Christians with even the most minor differences over Scripture. But he came to reject that view for a more ecumenical approach.\n\nOrdained a Southern Baptist, he later joined a then-emerging movement called New Evangelicalism that abandoned the narrowness of fundamentalism. Fundamentalists excoriated him for his new direction and broke with him when he agreed to work with more liberal Christians in the 1950s.\n\nGraham stood fast.\n\n“The ecumenical movement has broadened my viewpoint and I recognize now that God has his people in all churches,” he said in the early 1950s.\n\nIn 1957, he said, “I intend to go anywhere, sponsored by anybody, to preach the Gospel of Christ.”\n\nHis approach helped evangelicals gain the influence they have today.\n\nGraham’s path began taking shape at age 16, when the Presbyterian-reared farmboy committed himself to Christ at a tent revival.\n\n“I did not feel any special emotion,” he wrote in his 1997 autobiography, “Just As I Am.” ″I simply felt at peace,” and thereafter, “the world looked different.”\n\nAfter high school, he enrolled at the fundamentalist Bob Jones College but found the school stifling and transferred to Florida Bible Institute in Tampa. There, he practiced sermonizing in a swamp, preaching to birds and alligators before tryouts with small churches.\n\nHe still wasn’t convinced he should be a preacher until a soul-searching, late-night ramble on a golf course.\n\n“I finally gave in while pacing at midnight on the 18th hole,” he said. ”‘All right, Lord,’ I said, ‘If you want me, you’ve got me.’”\n\nGraham went on to study at Wheaton College, a prominent Christian liberal arts school in Illinois, where he met fellow student Ruth Bell, who had been raised in China where her father had been a Presbyterian medical missionary.\n\nThe two married in 1943, and he planned to become an Army chaplain. But he fell seriously ill, and by the time he recovered and could start the chaplain training program, World War II was nearly over.\n\nInstead, he took a job organizing meetings in the U.S. and Europe with Youth for Christ, a group he helped found. He stood out for his loud ties and suits, and his rapid delivery and swinging arms won him the nickname “the Preaching Windmill.”\n\nA 1949 Los Angeles revival turned Graham into evangelism’s rising star. Held in a tent dubbed the “Canvas Cathedral,” the gathering had been drawing adequate but not spectacular crowds until one night when reporters and photographers descended.\n\nWhen Graham asked them why, a reporter said that publisher William Randolph Hearst had ordered his papers to hype Graham. Graham said he never found out why.\n\nOver the next decade, his huge crusades in England and New York catapulted him to international celebrity. His 12-week London campaign in 1954 defied expectations, drawing more than 2 million people and the respect of the British, many of whom had derided him before his arrival as little more than a slick salesman.\n\nThree years later, he held a crusade in New York’s Madison Square Garden that was so popular it was extended from six to 16 weeks, capped off with a rally in Times Square that packed Broadway with more than 100,000 people.\n\nThe strain of so much preaching caused the already trim Graham to lose 30 pounds by the time the event ended.\n\nAs the civil rights movement took shape, Graham was no social activist and never joined marches, which led prominent Christians such as theologian Reinhold Niebuhr to condemn him as too moderate.\n\nStill, Graham ended racially segregated seating at his Southern crusades in 1953, a year before the Supreme Court’s school integration ruling, and long refused to visit South Africa while its white regime insisted on racially segregated meetings.\n\nIn a 2005 interview with The Associated Press, Graham said he regretted that he didn’t battle for civil rights more forcefully.\n\n“I think I made a mistake when I didn’t go to Selma” with many clergy who joined the Alabama march led by the Rev. Martin Luther King Jr. “I would like to have done more.”\n\nGraham more robustly took on the cause of anti-communism, making preaching against the atheist regime part of his sermons for years.\n\nAs America’s most famous religious leader, he golfed with statesmen and entertainers and dined with royalty. Graham’s relationships with U.S. presidents became a source of pride for conservative Christians who were often caricatured as backward.\n\nGeorge W. Bush credited Graham with helping him transform himself from carousing oilman to born-again Christian family man.\n\nGraham’s White House ties proved problematic when his close friend Richard Nixon resigned in the Watergate scandal, leaving Graham devastated and baffled. He resolved to take a lower profile in the political world, going as far as discouraging the Rev. Jerry Falwell, a founder of the Moral Majority, from mixing religion and politics.\n\n“Evangelicals can’t be closely identified with any particular party or person. We have to stand in the middle, to preach to all the people, right and left,” Graham said in 1981, according to Time magazine. “I haven’t been faithful to my own advice in the past. I will in the future.”\n\nYet, during the 2012 White House campaign, with Graham mostly confined to his North Carolina home, he all but endorsed Republican Mitt Romney. And the evangelist’s ministry took out full-page ads in support of a ballot measure that would ban gay marriage.\n\nSome critics on social media faulted Graham for that stance Wednesday, saying his position had harmed gay rights.\n\nGraham’s son the Rev. Franklin Graham, who runs the ministry, said his father viewed gay marriage as a moral, not a political, issue.\n\nGraham’s integrity was credited with salvaging the reputation of broadcast evangelism in the dark days of the late 1980s, after scandals befell TV preachers Jimmy Swaggart and Jim Bakker.\n\nHe resolved early on never to be alone with a woman other than his wife. Instead of taking a share of the “love offerings” at his crusades, he drew a modest salary from the Billy Graham Evangelistic Association.\n\nHis ministry was governed by an independent board that included successful Christian businessmen and other professionals — a stark departure from the widespread evangelical practice of packing boards with relatives and yes-men.\n\n“Why, I could make a quarter of a million dollars a year in this field or in Hollywood if I wanted to,” Graham said. “The offers I’ve had from Hollywood studios are amazing. But I just laughed. I told them I was staying with God.”\n\nHe was on the road for months at a time, leaving Ruth at their mountainside home in Montreat to raise their five children: Franklin, Virginia (“Gigi”), Anne, Ruth and Nelson (“Ned”).\n\nAnne Graham Lotz said her mother was effectively “a single parent.” Ruth sometimes grew so lonely when Billy was traveling that she slept with his tweed jacket for comfort. But she said, “I’d rather have a little of Bill than a lot of any other man.”\n\nShe died in 2007 at age 87.\n\n“I will miss her terribly,” Billy Graham said, “and look forward even more to the day I can join her in heaven.”\n\nTimeline of dates and events in the life of the Rev. Billy Graham\n\nLotz said in a statement Wednesday that she remembers her father’s personal side, the man “who was always a farmer at heart. Who loved his dogs and his cat. Who followed the weather patterns almost as closely as he did world events. Who wore old blue jeans, comfortable sweaters, and a baseball cap. Who loved lukewarm coffee, sweet ice tea, one scoop of ice cream, and a plain hamburger from McDonald’s.”\n\nIn his later years, Graham visited communist Eastern Europe and increasingly appealed for world peace. He opened a 1983 convention of evangelists from 140 nations by urging the elimination of nuclear and biological weapons.\n\nHe told audiences in Czechoslovakia that “we must do all we can to preserve life and avoid war,” although he opposed unilateral disarmament. In 1982, he went to Moscow to preach and attend a conference on world peace.\n\nDuring that visit, he said he saw no signs of Soviet religious persecution, a misguided attempt at diplomacy that brought scathing criticism from author Alexander Solzhenitsyn, among others.\n\nGraham’s relationship with Nixon became an issue once again when tapes released in 2002 caught the preacher telling the president that Jews “don’t know how I really feel about what they’re doing to this country.”\n\nGraham apologized, saying he didn’t recall ever having such feelings and asking the Jewish community to consider his actions above his words.\n\nIn 1995, his son Franklin was named the ministry’s leader.\n\nAlong with many other honors, Graham received the $1 million Templeton Prize for Progress in Religion in 1982 and the Congressional Gold Medal in 1996.\n\n“I have been asked, ‘What is the secret?’” Graham had said of his preaching. “Is it showmanship, organization or what? The secret of my work is God. I would be nothing without him.”\n\n___\n\nOnline: Billy Graham Evangelistic Association: http://www.billygraham.org\n\nBilly Graham Center archives: http://www.wheaton.edu/bgc/archives/archhp1.html\n\n___\n\nZoll reported from New York. Retired Associated Press Religion Writer Richard N. Ostling contributed to this report.", "images": ["https://storage.googleapis.com/afs-prod/media/media:dfcaebea05f24610b3df61d178cf2e83/2838.jpeg", "https://sb.scorecardresearch.com/p?c1=2&c2=3005041&cv=2.0&cj=1"], "top_img": "https://storage.googleapis.com/afs-prod/media/media:dfcaebea05f24610b3df61d178cf2e83/2838.jpeg", "keywords": [], "authors": ["Rachel Zoll", "Jonathan Drew"], "canonical_link": "https://apnews.com/0a4d7954c8d34c3291cb93c995789913", "title": "Rev. Billy Graham, known as ‘America’s Pastor,’ dies at 99", "meta_data": {"viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "theme-color": "#dedede", "msapplication-config": "browserconfig.xml", "robots": "max-image-preview:large", "description": "MONTREAT, N.C. (AP) — The Rev. Billy Graham, the magnetic, movie-star-handsome preacher who became a singular force in postwar American religious life, a confidant of presidents and the most widely heard Christian evangelist in history, died Wednesday at 99...", "keywords": "NC State Wire,North America,North Carolina,AP Top News,U.S. News,Billy Graham", "ntv-kv": "NC State Wire,North America,North Carolina,AP Top News,U.S. News,Billy Graham", "twitter": {"card": "summary_large_image", "site": "@ap", "title": "Rev. Billy Graham, known as 'America's Pastor,' dies at 99", "description": "MONTREAT, N.C. (AP) — The Rev. Billy Graham, the magnetic, movie-star-handsome preacher who became a singular force in postwar American religious life, a confidant of presidents and the most widely heard Christian evangelist in history, died Wednesday at 99...", "image": "https://storage.googleapis.com/afs-prod/media/media:dfcaebea05f24610b3df61d178cf2e83/2838.jpeg", "url": "https://apnews.com/article/nc-state-wire-north-america-north-carolina-ap-top-news-us-news-0a4d7954c8d34c3291cb93c995789913"}, "og": {"title": "Rev. Billy Graham, known as 'America's Pastor,' dies at 99", "description": "MONTREAT, N.C. (AP) — The Rev. Billy Graham, the magnetic, movie-star-handsome preacher who became a singular force in postwar American religious life, a confidant of presidents and the most widely heard Christian evangelist in history, died Wednesday at 99...", "type": "article", "url": "https://apnews.com/article/nc-state-wire-north-america-north-carolina-ap-top-news-us-news-0a4d7954c8d34c3291cb93c995789913", "image": {"identifier": "https://storage.googleapis.com/afs-prod/media/media:dfcaebea05f24610b3df61d178cf2e83/2838.jpeg", "width": 3771, "height": 2838}, "site_name": "AP NEWS"}, "fb": {"app_id": 870613919693099, "pages": 249655421622}, "article": {"published_time": "2021-04-20T20:51:58Z", "modified_time": "2018-02-22T04:40:34Z", "section": "NC State Wire", "tag": "Billy Graham"}, "google-site-verification": "XvG-YKlyyPmG2x0J9-rdS-zI8LhL4d75ZQoccETD2qA"}, "movies": [], "publish_date": 1618951918.0, "source": "https://www.apnews.com", "summary": ""}