{"url": "https://www.hollywoodreporter.com/live-feed/bachelorette-finale-becca-kufrin-reveals-winner-1132546", "text": "[This story contains spoilers from the finale of the 14th season of ABC’s The Bachelorette.]\n\nBecca Kufrin’s fiance was revealed during Monday’s three-hour finale of The Bachelorette.\n\nThe final episode saw Kufrin — who was famously jilted by Bachelor Arie Luyendyk Jr. one season prior on the ABC reality franchise — traveling to the Maldives with her final two men, Garrett Yrigoyen and Blake Horstmann.\n\nAfter winning the coveted first-impression rose on night one, Garrett emerged as the early frontrunner. But as episodes went on, Blake appeared to be catching up and, heading into the finale, possibly even surpassing Garrett. Becca, however, revealed to viewers that she had fallen in love with both men. Ultimately, she accepted a proposal from Garrett, breaking Blake’s heart in the process.\n\n“You’ve made me know that I can fall in love again, but through all that, because we were so constant, I think I was overlooking other relationships,” she explained to Blake, after letting him finish nearly all of his planned proposal. “There’s just one piece with somebody else that I’m not ready to say goodbye to yet. Quite honestly, I pictured this moment with you standing here the entire time for so long. I think we could be right and we could be partners, but there’s just a better fit for us out there.”\n\nThe contestant, a 28-year-old sales rep from Denver, was stunned by Becca’s decision. “I didn’t expect this. I don’t know what to say,” he replied to her. “I don’t think anyone can make you as happy as I can.” After breaking down in tears, he said to the camera: “I can’t believe this is happening. I have to go through all of this alone afterwards now — I fucking knew it. I did love her, I just thought she loved me back.”\n\nIn a quick turnaround, as is typical for the Bachelorette or Bachelor finale, Becca composed herself for Garrett’s arrival. Garrett, a 29-year-old consultant from Reno, arrived to the proposal site, clueless about what had just transpired. “I love you so much, not just now, but forever. You’re my world,” he said, before getting down on one knee. Becca accepted, giving him her final rose of the competition. “You reminded me of home and you reminded me of one of the most important men in my life, and that was my dad,” she said, before finally telling him that she loved him.\n\nThe happy moment marked the end of the 14th cycle of The Bachelorette, but the live postshow, After the Final Rose, welcomed back Becca and Garrett, along with Blake, to reveal details about the road the three faced after ABC put its cameras down in the Maldives in May.\n\nTraditionally, the engaged couple will spend a few days on location before packing their bags and heading home. ABC then sets the star and winner up on clandestine meetings in “safe” houses that are secluded from the public and press.\n\nOn the aftershow, ABC aired some behind-the-scenes footage from that time period. “We still need to get to know each other and to spend that quality time,” Becca said of their off-air courtship when appearing on After the Final Rose. “We have just grown so solid in this relationship and I continue to get to know him, but I have loved every second of it.”\n\nBefore Becca’s season began airing, the Bachelorette revealed that she had, in fact, gotten engaged during the finale. Following several Bachelorette stars before her, the 28-year-old publicist announced the outcome without spoiling the name of her finalist. But following the premiere of her season, news broke that Garrett had liked a series of offensive posts on Instagram. The posts mocked different groups of people and raised questions about his character. The events put Becca in a tricky position — she couldn’t reveal that Garrett was the man she was engaged to, and yet she was being dogged by questions about the behavior of her early frontrunner only a few days into her season.\n\nBecca stressed that her viewers should keep an open mind, and then Garrett released a statement taking responsibility for the posts and apologizing for the hurt they caused. The contestant had not been able to give a complete interview going into the finale, which is why Bachelor Nation anticipated that both he and Becca would address the situation now that they could speak freely.\n\nOn Monday’s aftershow, Becca admitted that there have been struggles. “Things have been wonderful, but they’ve been hard at times,” she told franchise host Chris Harrison, before letting Garrett take the floor.\n\n“I’ll just take the time now,” he said. “Some stuff came out about my social media, and I didn’t realize the effect behind a double-tap or a like on Instagram, so I put out an apology. I didn’t mean to offend anybody. I apologize for that still, I’m very sorry. I didn’t mean to hurt anybody’s feelings or do anything like that, so I stand by everything that I posted in my apology.”\n\nGarrett continued, “And I’m just trying to grow as a person and be a better person on a daily basis. She’s helping me through everything. We’ve been honest and open and transparent with one another since the beginning, and when that all came out we attacked it because I feel like when I was liking things, it was going against things she stands for, and that made it really hard on us as a couple. So when we started talking about that, we got through that together and we’re growing, we’re progressing and we’re moving forward.”\n\nOf the stress the situation put on their new relationship, Becca said, “I got to see who he is, his heart, his soul. The Instagram situation, I don’t condone that and I know that he stands by his apology and he feels so bad for everyone that he did offend.” She continued, “He didn’t mean it. But I just want to move forward, to learn and to grow and continue to educate ourselves. That’s all that you can ask for in another person is that somebody who recognizes if they make a mistake and do something wrong and to want to learn and grow from it, and that’s what he showed me.”\n\nGarrett admitted that he worried about the impact on their relationship, but that ultimately Becca “knew who I was as a person” and that it made them stronger as a couple, despite the backlash they received. “[She knew] that I didn’t stand behind those likes and that I was a better person than I was presenting on my social media,” he added.\n\nGoing into the live forum portion of the finale, there was speculation about how much time, if any, would be devoted to the franchise’s casting and vetting process, which has been called into question due to the Garrett incident and the later news that another contestant, Lincoln Adim, was convicted of indecent assault and battery after he filmed the show. Another contestant, top-six finalist Leo Dottavio, recently denied sexual harassment claims that were shared by a franchise alum.\n\nWhen speaking to The Hollywood Reporter after the recent taping of the Men Tell All reunion, Becca addressed the off-air controversy with Garrett. THR had spoken to her at the beginning of the season, and one week before the airing of the finale, Becca continued to ask her viewers to keep an open mind. “I think that living day by day, I handled things how I would want to be treated,” she told THR at the end of July taping of having no regrets. “And I really hoped to give the guys any clarity or answers or respect in any given situation, and so overall, I think stayed true to who I was and followed my heart.”\n\nShe also did admit that reliving the season as it airs has been difficult. “There are so many things that I’m learning. One thing is just how great of a support system he is, because it’s not always easy watching it back on either end,” she said. “And just to have him there to be open and to be receptive to how I handled things and to still have my back means the world,” adding, “I was lucky enough to go on this journey with 28 guys and to really get to know them for who they are, away from social media, away from all the distractions, and so that was something special for me that I got to experience, and i just hope that the viewers can be that same way.”\n\nBlake also appeared on the After the Final Rose special, his first time seeing Becca since their filmed breakup. “I will always have love for Becca,” he told Harrison before she came out.\n\nWhen they reunited, he pressed her for answers on what went wrong. “You had always been so open and present and that last week, to me, it wasn’t making the wrong decision, because both of you guys were so amazing, so solid,” Becca told her runner-up. “And it was just me trying to sift through our interactions and looking into the future and seeing, what one is going to be the best for me in the long run? How would we handle certain situations if something happened? Where you got more in your head at times about things, it made me worried at times how you would handle things down the road, if someone were to get sick or if something were to happen to a child, and that’s when I just started to question the longevity of it.”\n\nSimilar to how audience reaction to Becca having her heart broken by Arie made her the frontrunner to become the next Bachelorette, the smart money is now on Blake to star on the next season of The Bachelor, which doesn’t premiere until January. Joining him as options for the lead ABC gig are Becca’s other finalists, Jason Tartick, Colton Underwood and Wills Reid. Both Colton and Wills will appear on Bachelor in Paradise, the summer spinoff that premieres Tuesday night on ABC.\n\nWhat do you think of the Bachelorette finale? Sound off in the comments below, and bookmark Bachelor Nation for more from Becca and Garrett as THR‘s show coverage continues.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/08/the_bachelorette_e1410_still_becca_kufrin.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2018/08/the_bachelorette_e1410_still_1_embed.jpg?w=928", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/08/the_bachelorette_e1410_still_becca_kufrin.jpg?w=1296&h=730&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/08/the_bachelorette_e1410_still_2_embed.jpg?w=928"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/08/the_bachelorette_e1410_still_becca_kufrin.jpg?w=1024", "keywords": [], "authors": ["Jackie Strause"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/bachelorette-finale-becca-kufrin-reveals-winner-1132546/", "title": "‘The Bachelorette’ Finale: Engaged Becca Kufrin Reveals Her Winner", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "'The Bachelorette' finale capped off the 14th season of the ABC reality dating franchise with engaged star Becca Kufrin and finalists Garrett Yrigoyen and Blake Horstmann.", "news_keywords": "The Bachelorette", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jackie Strause", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1132546, "title": "'The Bachelorette' Finale: Engaged Becca Kufrin Reveals Her Winner", "published_at": "2018-08-06 19:35:28", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/08/the_bachelorette_e1410_still_becca_kufrin.jpg?w=1024", "comment_count": 0, "tags": "The Bachelorette", "topics": "TV News", "body": "[This story contains spoilers from the finale of the 14th season of ABC's The Bachelorette.]\r\nBecca Kufrin's fiance was revealed during Monday's three-hour finale of The Bachelorette.\r\nThe final episode saw Kufrin — who was famously jilted by Bachelor Arie Luyendyk Jr. one season prior on the ABC reality franchise — traveling to the Maldives with her final two men, Garrett Yrigoyen and Blake Horstmann.\r\nAfter winning the coveted first-impression rose on night one, Garrett emerged as the early frontrunner. But as episodes went on, Blake appeared to be catching up and, heading into the finale, possibly even surpassing Garrett. Becca, however, revealed to viewers that she had fallen in love with both men. Ultimately, she accepted a proposal from Garrett, breaking Blake's heart in the process.\r\n\"You've made me know that I can fall in love again, but through all that, because we were so constant, I think I was overlooking other relationships,\" she explained to Blake, after letting him finish nearly all of his planned proposal. \"There's just one piece with somebody else that I'm not ready to say goodbye to yet. Quite honestly, I pictured this moment with you standing here the entire time for so long. I think we could be right and we could be partners, but there's just a better fit for us out there.\"\r\nThe contestant, a 28-year-old sales rep from Denver, was stunned by Becca's decision. \"I didn't expect this. I don't know what to say,\" he replied to her. \"I don't think anyone can make you as happy as I can.\" After breaking down in tears, he said to the camera: \"I can't believe this is happening. I have to go through all of this alone afterwards now — I fucking knew it. I did love her, I just thought she loved me back.\"\r\nIn a quick turnaround, as is typical for the Bachelorette or Bachelor finale, Becca composed herself for Garrett's arrival. Garrett, a 29-year-old consultant from Reno, arrived to the proposal site, clueless about what had just transpired. \"I love you so much, not just now, but forever. You're my world,\" he said, before getting down on one knee. Becca accepted, giving him her final rose of the competition. \"You reminded me of home and you reminded me of one of the most important men in my life, and that was my dad,\" she said, before finally telling him that she loved him.\r\nThe happy moment marked the end of the 14th cycle of The Bachelorette, but the live postshow, After the Final Rose, welcomed back Becca and Garrett, along with Blake, to reveal details about the road the three faced after ABC put its cameras down in the Maldives in May.\r\n\r\n\r\n\r\nTraditionally, the engaged couple will spend a few days on location before packing their bags and heading home. ABC then sets the star and winner up on clandestine meetings in \"safe\" houses that are secluded from the public and press.\r\nOn the aftershow, ABC aired some behind-the-scenes footage from that time period. \"We still need to get to know each other and to spend that quality time,\" Becca said of their off-air courtship when appearing on After the Final Rose. \"We have just grown so solid in this relationship and I continue to get to know him, but I have loved every second of it.\"\r\nBefore Becca's season began airing, the Bachelorette revealed that she had, in fact, gotten engaged during the finale. Following several Bachelorette stars before her, the 28-year-old publicist announced the outcome without spoiling the name of her finalist. But following the premiere of her season, news broke that Garrett had liked a series of offensive posts on Instagram. The posts mocked different groups of people and raised questions about his character. The events put Becca in a tricky position — she couldn't reveal that Garrett was the man she was engaged to, and yet she was being dogged by questions about the behavior of her early frontrunner only a few days into her season.\r\nBecca stressed that her viewers should keep an open mind, and then Garrett released a statement taking responsibility for the posts and apologizing for the hurt they caused. The contestant had not been able to give a complete interview going into the finale, which is why Bachelor Nation anticipated that both he and Becca would address the situation now that they could speak freely.\r\n\r\nOn Monday's aftershow, Becca admitted that there have been struggles. \"Things have been wonderful, but they've been hard at times,\" she told franchise host Chris Harrison, before letting Garrett take the floor.\r\n\"I'll just take the time now,\" he said. \"Some stuff came out about my social media, and I didn't realize the effect behind a double-tap or a like on Instagram, so I put out an apology. I didn't mean to offend anybody. I apologize for that still, I'm very sorry. I didn't mean to hurt anybody's feelings or do anything like that, so I stand by everything that I posted in my apology.\"\r\nGarrett continued, \"And I'm just trying to grow as a person and be a better person on a daily basis. She's helping me through everything. We've been honest and open and transparent with one another since the beginning, and when that all came out we attacked it because I feel like when I was liking things, it was going against things she stands for, and that made it really hard on us as a couple. So when we started talking about that, we got through that together and we're growing, we're progressing and we're moving forward.\"\r\nOf the stress the situation put on their new relationship, Becca said, \"I got to see who he is, his heart, his soul. The Instagram situation, I don't condone that and I know that he stands by his apology and he feels so bad for everyone that he did offend.\" She continued, \"He didn't mean it. But I just want to move forward, to learn and to grow and continue to educate ourselves. That's all that you can ask for in another person is that somebody who recognizes if they make a mistake and do something wrong and to want to learn and grow from it, and that's what he showed me.\"\r\nGarrett admitted that he worried about the impact on their relationship, but that ultimately Becca \"knew who I was as a person\" and that it made them stronger as a couple, despite the backlash they received. \"[She knew] that I didn't stand behind those likes and that I was a better person than I was presenting on my social media,\" he added.\r\nGoing into the live forum portion of the finale, there was speculation about how much time, if any, would be devoted to the franchise's casting and vetting process, which has been called into question due to the Garrett incident and the later news that another contestant, Lincoln Adim, was convicted of indecent assault and battery after he filmed the show. Another contestant, top-six finalist Leo Dottavio, recently denied sexual harassment claims that were shared by a franchise alum.\r\nWhen speaking to The Hollywood Reporter after the recent taping of the Men Tell All reunion, Becca addressed the off-air controversy with Garrett. THR had spoken to her at the beginning of the season, and one week before the airing of the finale, Becca continued to ask her viewers to keep an open mind. \"I think that living day by day, I handled things how I would want to be treated,\" she told THR at the end of July taping of having no regrets. \"And I really hoped to give the guys any clarity or answers or respect in any given situation, and so overall, I think stayed true to who I was and followed my heart.\"\r\nShe also did admit that reliving the season as it airs has been difficult. \"There are so many things that I'm learning. One thing is just how great of a support system he is, because it’s not always easy watching it back on either end,\" she said. \"And just to have him there to be open and to be receptive to how I handled things and to still have my back means the world,\" adding, \"I was lucky enough to go on this journey with 28 guys and to really get to know them for who they are, away from social media, away from all the distractions, and so that was something special for me that I got to experience, and i just hope that the viewers can be that same way.\"\r\n\r\nBlake also appeared on the After the Final Rose special, his first time seeing Becca since their filmed breakup. \"I will always have love for Becca,\" he told Harrison before she came out.\r\nWhen they reunited, he pressed her for answers on what went wrong. \"You had always been so open and present and that last week, to me, it wasn't making the wrong decision, because both of you guys were so amazing, so solid,\" Becca told her runner-up. \"And it was just me trying to sift through our interactions and looking into the future and seeing, what one is going to be the best for me in the long run? How would we handle certain situations if something happened? Where you got more in your head at times about things, it made me worried at times how you would handle things down the road, if someone were to get sick or if something were to happen to a child, and that's when I just started to question the longevity of it.\"\r\nSimilar to how audience reaction to Becca having her heart broken by Arie made her the frontrunner to become the next Bachelorette, the smart money is now on Blake to star on the next season of The Bachelor, which doesn't premiere until January. Joining him as options for the lead ABC gig are Becca's other finalists, Jason Tartick, Colton Underwood and Wills Reid. Both Colton and Wills will appear on Bachelor in Paradise, the summer spinoff that premieres Tuesday night on ABC. \r\nWhat do you think of the Bachelorette finale? Sound off in the comments below, and bookmark Bachelor Nation for more from Becca and Garrett as THR's show coverage continues.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘The Bachelorette’ Finale: Engaged Becca Kufrin Reveals Her Winner", "url": "https://www.hollywoodreporter.com/tv/tv-news/bachelorette-finale-becca-kufrin-reveals-winner-1132546/", "description": "‘The Bachelorette’ finale capped off the 14th season of the ABC reality dating franchise with engaged star Becca Kufrin and finalists Garrett Yrigoyen and Blake Horstmann.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/08/the_bachelorette_e1410_still_becca_kufrin.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-08-06T19:35:28+00:00", "modified_time": "2018-08-08T09:23:36+00:00"}, "twitter": {"site": "@thr", "creator": "@jackiedstrause", "card": "summary_large_image", "title": "‘The Bachelorette’ Finale: Engaged Becca Kufrin Reveals Her Winner", "description": "‘The Bachelorette’ finale capped off the 14th season of the ABC reality dating franchise with engaged star Becca Kufrin and finalists Garrett Yrigoyen and Blake Horstmann.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/08/the_bachelorette_e1410_still_becca_kufrin.jpg?w=1296"}}, "movies": [], "publish_date": 1533584128.0, "source": "https://www.hollywoodreporter.com", "summary": ""}