{"url": "https://money.usnews.com/money/personal-finance/spending/articles/2017-08-31/18-best-labor-day-sales-for-2017", "text": "With inflation soaring and prices of everyday goods reaching multi-decade highs, it’s becoming more difficult for the average consumer to make big purchases like mattresses, appliances, and furniture. So, it’s more important than ever to save some money where you can by taking advantage of holiday sales events.\n\nLabor Day, which is on Sept. 5, 2022, is one of the best times of year to score massive discounts on these more expensive items. All weekend long, major retailers like The Home Depot, Best Buy, Wayfair, and Walmart will be offering Labor Day sales on some of the most popular items from well-known brands like GE, LG, Nectar, Casper, and more. Of course, you have the option to shop sales in-person at these stores open on Labor Day, but with so many retailers offering free shipping and quick delivery for the holiday, it might make more sense to order online ASAP.\n\nLabor Day Appliance Sales\n\nMost major appliance stores, like The Home Depot, Lowe’s, and Best Buy, are running competitive Labor Day sales for the holiday weekend. Here are the best ones we’ve found.\n\nThe Home Depot\n\nThe Home Depot has cut prices on all types of appliances through Sept. 7. This includes big-ticket items like refrigerators, washers and dryers, cooktops, ranges, and range hoods, as well as smaller appliances such as vacuums, coffee makers, and toaster ovens. You’ll see lots of familiar brand names, including LG, Samsung, Frigidaire, KitchenAid, and GE, among the sale items. Free delivery is also included for most large appliances.\n\nLowe’s\n\nLowe’s has one of the biggest appliance selections out there, and many highly rated models are on sale for Labor Day. You’ll find discounts on major appliances from name brands like LG, Whirlpool, Haier, Bosch, and Maytag, as well as savings on smaller items like ice makers, robot vacuums, air conditioners, and air purifiers. You’ll also get free local delivery with purchases of $396 or more.\n\nWayfair\n\nWayfair has become a go-to for home decor, but the retailer has a ton of appliances too. You can find washers and dryers, gas and electric ranges, refrigerators, dishwashers, and smaller items like microwaves and air conditioners. While the online retailer’s sale section isn’t as extensive as what you’d find at Lowe’s, The Home Depot, or Best Buy, there are plenty of items from brands like GE, Samsung, and Forno on sale for up to 30% off.\n\nBest Buy\n\nBest Buy’s Labor Day sale includes deals on all major appliances, including refrigerators, dishwashers, microwaves, washers and dryers, and electric and gas ranges, from brands like Samsung, Insignia, LG, Maytag, Amana, GE, and Whirlpool. You may also get additional rebates on specific eligible items as well. Keep in mind that while some items are in stock and can be delivered in five days, others may take several weeks for delivery.\n\nWalmart\n\nWalmart doesn’t carry all of the major appliance brands, but you’ll find Labor Day deals on more budget-friendly names like Avanti, RCA, Midea, Arctic King, and Danby mixed in with some options from Frigidaire, Whirlpool, and GE. If you’re looking for smaller-size appliances, including refrigerators and dishwashers, Walmart’s Labor Day sale may be a good bet to get one at a great price.\n\nSamsung\n\nIf you buy directly from Samsung’s site this Labor Day weekend, you’ll get up to $1,200 off refrigerators, up to $450 off ranges, 35% off washers and dryers, and up to 60% off appliance bundles. You can also save 10% on the brand’s new Bespoke washer and dryer set. Small appliances like vacuums, robot vacuums, and air purifiers are also on sale.\n\nLabor Day Mattress Sales\n\nLabor Day is one of the best times of year to buy a new bed. There’s no shortage of Labor Day mattress sales at several of the most well-known mattress retailers.\n\nNectar\n\nNectar is offering up to $200 off each of its mattresses through Labor Day weekend, plus $499 worth of free bedding accessories (a mattress protector, two pillows, and a sheet set) with each mattress purchase. Nightstands and dressers are 10% to 15% off and some bedding, like duvet covers and weighted blankets, is also discounted as part of the brand’s end-of-summer clearance sale.\n\n\n\nNectar Labor Day Sale: Take $200 OFF + $499 in FREE accessories Labor Day Sale: Take $200 OFF + $499 in FREE accessories Get Discount\n\nCasper\n\nCasper’s Labor Day sale, which goes through Sept. 13, includes all mattresses and several other items on the brand’s site. You’ll get up to $600 off mattress purchases, depending on the size and model. You’ll save more on higher-priced models and larger sizes. You’ll also get 25% to 40% off pillows, up to 50% off bedding, and up to 50% off nighttime accessories, like Casper’s Glow Light. Bundles, final sale, and clearance items are excluded from the sale.\n\n\n\nCasper Labor Day Sale: Get up to $600 OFF mattresses Labor Day Sale: Get up to $600 OFF mattresses Get Discount\n\nSaatva\n\nFor Labor Day weekend, Saatva is offering an escalating discount that increases the more you spend. Here’s the breakdown:\n\n\n\nSpend $900 to $2,199, get $225 off\n\nSpend $2,200 to $2,999, get $250 off\n\nSpend $3,000 to $3,499, get $300 off\n\nSpend $3,500 to $3,999, get $350 off\n\nSpend $4,000 to $4,499, get $400 off\n\nSpend $4,500 or more, get $525 off\n\nOther furniture and bedding aren’t included in the sale, but you can still save some money on your purchase if you bundle sheet sets and pillows.\n\nSaatva EXCLUSIVE Labor Day Sale: Get $400 OFF mattress orders of $1000+ Labor Day Sale: Get $400 OFF mattress orders of $1000+ Get Discount\n\nAmerisleep\n\nAmerisleep is offering $450 off any mattress with code AS450 during its Labor Day sale, which goes through Sept. 12. You can also score 30% off adjustable bed bundles, which include an adjustable base and new mattress, and 40% off upholstered bed frames (no mattress purchase required). Now’s a good time to upgrade your bedding as well – you can get 10% off sheets, pillows, and mattress protectors with code TAKE10.\n\n\n\nAmerisleep Labor Day Sale: Get $450 off any mattress with code AS450 Labor Day Sale: Get $450 off any mattress with code AS450 Get Discount\n\nPurple\n\nDuring its Labor Day weekend sale, Purple is offering up to $300 off mattresses. The Purple Mattress is $100 off; the Purple Plus and Hybrid mattresses are $200 off; and the Hybrid Premier 3 and 4 models are $300 off. You’ll also get $100 worth of pillows and bedding with the purchase of the Purple or Purple Plus mattresses. If you purchase any of the hybrid models, you’ll get $300 in free bedding. The Ascent Adjustable Base is also $500 off.\n\n\n\nPurple Labor Day Sale: Get up to $300 off mattresses + up to $300 in free bedding Labor Day Sale: Get up to $300 off mattresses + up to $300 in free bedding Get Discount\n\nHelix\n\nThis weekend, you can save money on everything on Helix’s site. This includes mattresses as well as bedding, foundations, and adjustable bases. You’ll get two free pillows with any mattress purchase, but the monetary savings you’ll get depends on how much you spend:\n\n\n\nSpend $600, get $100 off using code LDSALE100\n\nSpend $1,250, get $150 off using code LDSALE150\n\nSpend $1,700, get $200 off using code LDSALE200\n\nSpend $2,550, get $250 off using code LDSALE250\n\nSpend $2,700, get $300 off using code LDSALE300\n\nSpend $2,950 or more, get $350 off using code LDSALE350\n\nHelix Labor Day Sale: Get $150 OFF + 2 free Dream Pillows with code LDW150 Labor Day Sale: Get $150 OFF + 2 free Dream Pillows with code LDW150 Get Discount\n\nMattress Firm\n\nYou can take advantage of Mattress Firm’s Labor Day sale, which includes discounts on brands like Serta, Sleepy’s, and Beautyrest. Now through Sept. 6, you can save up to $700 on a new mattress and get a free adjustable base (a $499 value) with your purchase. Overnight online flash sales can score you an extra 25% off mattresses and bedding with code HOLIDAY when you shop from 9 p.m. to 9 a.m.\n\nLabor Day Furniture Sales\n\nYou can find Labor Day deals at major furniture retailers like Overstock and Bed Bath & Beyond as well as shopper-favorite boutique brands like Floyd, Burrow, and Outer.\n\nOverstock\n\nDon’t let the name fool you: Overstock has thousands of new furniture pieces and you’ll find steep discounts on everything from a new bed frame to a wine bar cabinet. During the retailer’s Labor Day sale, you can get up to 70% off all furniture and score free shipping on every piece. You’ll also find deals on accent items like rugs and lamps. No official exclusions apply.\n\nFloyd\n\nFloyd offers modern-inspired furniture that’s intended to feel cozier and work well with any decor in any space. The brand offers beds, sofas, modular sectionals, tables, and various storage units. There are also outdoor chairs, benches, and tables that are on sale for Labor Day. Through Sept. 6, you’ll get 25% off The Sectional and 20% off everything else on the site.\n\nBurrow\n\nBurrow is all about modular design. The brand offers both custom and ready-to-ship items, such as sectionals, sofas, loveseats, accent chairs, coffee tables, bar carts, and nightstands, that combine function with style. Now through Sept. 6, you can score an escalating discount using code LDS22. How much you save depends on how much you spend:\n\n\n\nSpend under $1,600, get 10% off your entire order\n\nSpend $1,600, get $225 off\n\nSpend $2,000, get $300 off\n\nSpend $2,500, get $375 off\n\nSpend $3,000, get $500 off\n\nSpend $4,000, get $700 off\n\nSpend $5,000 or more, get $1,000 off\n\nBed Bath & Beyond\n\nBed Bath & Beyond has a vast furniture selection. You can find everything you need for your living room, dining room, bedroom, entryway, and home office on sale through Sept. 5. While all furniture isn’t on sale, the retailer is offering Labor Day furniture deals on a wide range of items from bar stools to coffee tables to TV stands. Bed Bath & Beyond is offering double points on all purchases for its rewards members, 60% off all clearance items, and 20% off your entire purchase.\n\nCastlery\n\nCastlery offers sofas, tables, beds, nightstands, side tables, and home decor items. Right now, you’ll get $100 off every $1,200 you spend (Castlery doesn’t provide an official end date to its Labor Day sale). This discount automatically applies to all items in your cart, even if they’re already marked down. You’ll also get free shipping to select cities when you spend at least $999.\n\nOuter\n\nLabor Day might mark the unofficial end of summer, but there’s still time to enjoy nights on the patio – and now’s a great time to get outdoor furniture at a steep discount. Now through Sept. 6, you’ll get 30% off almost everything on Outer’s site, including sofas and sectionals, chairs, ottomans, coffee tables, and rugs. There are some exclusions: Dining tables, dining chairs, fire pits, and fire pit accessories are not part of Outer’s Labor Day sale.\n\nFrontgate\n\nFrontgate is well known for its extensive outdoor furniture collection, but the brand also offers bedroom, living room, and dining room furniture, as well as specialty items like game tables. You can save 30% off sitewide, with some exclusions: The discount doesn’t apply to furniture sets, holiday decor, or select indoor and outdoor furniture.\n\nWhen Is Labor Day 2022?\n\nLabor Day is Monday, Sept. 5, 2022. While the biggest savings events will take place on the holiday, you’ll be able to take advantage of sales all weekend long.\n\nWhat Are the Best Labor Day Deals?\n\nLabor Day is an excellent time to make big purchases that you’ve been putting off all year since you’ll likely reap the biggest savings on higher-ticket items. You’ll typically find the best Labor Day deals on mattresses, refrigerators, washers and dryers, furniture, and TVs. End-of-season items, like patio furniture and grills, often go on sale as well, as retailers try to clear out their inventory to make room for colder weather items. If you have a place to securely store these items until next year, this weekend is a good time to buy these items at a discount.\n\nLearn More\n\nRelated 360 Reviews\n\nWhy You Can Trust Us", "images": ["https://www.usnews.com/object/image/00000183-ae5a-d350-ad83-bfdb53a40000/10-06-22-pd2-sec-cam-deals.png?update-time=1665077551774&size=responsiveSquare150", "https://www.usnews.com/object/image/0000016b-9425-d6ac-ab6f-9fb772840000/190626-casperlogo-submitted.png?update-time=1616534312662&size=responsiveFlow230", "https://www.usnews.com/object/image/00000183-a8b7-d479-a3c3-fbbfaf400000/10-05-22-pd2-airpods-deals.png?update-time=1664983000430&size=responsiveSquare150", "https://www.usnews.com/object/image/00000180-675e-d3d6-a7be-7f7ecac30000/a-primary-rgb.png?update-time=1651001769928&size=responsiveFlow230", "https://www.usnews.com/static/img/usn-logo-large.svg", "https://www.usnews.com/object/image/00000179-af27-d8f9-ad7d-ef37f71f0000/210507-helix-logo-submitted.RGB.Blue+%286%29.png?update-time=1622141341749&size=responsiveFlow230", "https://www.usnews.com/object/image/00000183-a8b6-d350-ad83-bfb74eb40000/10-05-22-pd2-vacuum-deals.png?update-time=1664982906822&size=responsiveSquare150", "https://www.usnews.com/dims4/USNEWS/7b23011/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F10%2F11%2F7ed7ebda43799134d2ca1cbcd9fb%2Fistock-1332363471.jpg", "https://www.usnews.com/object/image/00000182-efcb-d602-a5f6-ffdbc35b0000/istock-1332363471.jpg?update-time=1661880603999&size=responsive640", "https://www.usnews.com/object/image/00000170-cff9-d4b2-a5f2-effbae570001/201203-nectarlogo-submitted.png?update-time=1584400303463&size=responsiveFlow230", "https://www.usnews.com/object/image/0000017d-2a54-ded7-ab7f-6bdfae690000/211116-thepurplemattress-edited-editorial.png?update-time=1637092798656&size=responsiveFlow230", "https://www.usnews.com/object/image/0000016b-8f06-d6ac-ab6f-9fb7afb20000/190625-saatvalogo-submitted.png?update-time=1600788231897&size=responsiveFlow230"], "top_img": "https://www.usnews.com/dims4/USNEWS/7b23011/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F10%2F11%2F7ed7ebda43799134d2ca1cbcd9fb%2Fistock-1332363471.jpg", "keywords": [], "authors": ["Lindsay Boyers", "Aug.", "At P.M."], "canonical_link": "https://deals.usnews.com/articles/best-labor-day-sales-to-shop", "title": "Best Labor Day Sales 2022", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "description": "We found the best Labor Day sales so you don't have to from retailers like Walmart, Best Buy, and more.", "keywords": "Lindsay Boyers,U.S. News 360 Deals,Advice", "zone": "home", "robots": "max-image-preview:large", "fb": {"pages": 5834919267, "app_id": 130063997038366}, "brightspot.contentId": "0000016c-cf0d-df9c-a3ff-cf0fb1600000", "og": {"site_name": "US News & World Report", "title": "Best Labor Day Sales 2022 | U.S. News", "description": "These are the 21 top Labor Day sales to take advantage of this weekend.", "url": "https://deals.usnews.com/articles/best-labor-day-sales-to-shop", "image": {"identifier": "https://www.usnews.com/dims4/USNEWS/7b23011/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F10%2F11%2F7ed7ebda43799134d2ca1cbcd9fb%2Fistock-1332363471.jpg", "secure_url": "https://www.usnews.com/dims4/USNEWS/7b23011/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F10%2F11%2F7ed7ebda43799134d2ca1cbcd9fb%2Fistock-1332363471.jpg"}, "type": "article"}, "twitter": {"image": "https://www.usnews.com/dims4/USNEWS/7b23011/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F10%2F11%2F7ed7ebda43799134d2ca1cbcd9fb%2Fistock-1332363471.jpg", "card": "summary_large_image", "site": "@USNews", "title": "Best Labor Day Sales 2022 | U.S. News", "description": "These are the 21 top Labor Day sales to take advantage of this weekend."}, "google-site-verification": "owJBuFHD3VHcTSsnPSOYizmUcs3GSBjbx09vBbBi1MM", "msvalidate.01": "A8E47FA91124063A4A9C78AD5273DC0F", "sailthru.date": "2022-08-31T13:00Z", "sailthru.author": "Lindsay Boyers", "vertical": "Deals", "preview": "With inflation soaring and prices of everyday goods reaching multi-decade highs, it’s becoming more difficult for the average consumer to make big purchases like mattresses, appliances, and furniture. So, it’s more important than ever to save some money where you can by taking advantage of holiday ...", "optimizely": "Optimizely is supported by this application but is not enabled for this page."}, "movies": [], "publish_date": 1504134000.0, "source": "https://money.usnews.com", "summary": ""}