{"url": "dlisted.com/tag/justin_theroux/page/2/", "text": "Category: Justin Theroux\n\nJustin Theroux’s Messy Fight With His Neighbor Is Over (For Now) 0 For the past two years, Justin Theroux hasn’t had much time to care about whether his ex Jennifer Aniston was sad, lonely, hooking up with Brad again, or whatever she’s been doing to pass the time since they split. Because he was too busy having his lawyer fight the downstairs neighbor of his Greenwich Village apartment after several years worth of apartment drama came to a head. Luckily for Justin, he’ll be spending his summer in black jorts drinking artisanal tequila cocktails, and not drinking room-temperature courtroom water in a suit. TMZ says his battle is over for now, and he won. Continue reading SHARE\n\nJustin Theroux And Laura Harrier Have Been Seen Hanging Out Again 0 Justin Theroux has been linked to so many people since his split from Jennifer Aniston. If there was an unofficial Justin Theroux Rebound Bingo game, someone would have at least four corners and a line by now. Most recently though, he declined to comment on whether he was with Emma Stone or Selena Gomez or Petra Collins by telling the New York Times: “Is this the part where I coyly raise an eyebrow and not answer the question?” He might not be saying who he’s coyly raising any of his body parts around, but we can once again look at the clues and wildly speculate. People points out that 47-year-old Justin was spotted yesterday in Paris, France with Spider-Man: Homecoming actress, 28-year-old Laura Harrier. Justin Theroux Steps Out with Spider-Man Actress Laura Harrier in Paris https://t.co/EjUMA9idvc — People (@people) October 2, 2018 Before you go thinking: “Come on, plenty of guys in their late-40s wander aimlessly around the romantic streets of Paris in Autumn with their late-20s female friends,” this isn’t new. Justin and Laura were rumored to be casually hanging out in France earlier this summer. At the time, Laura denied anything was going on by telling Elle: “We all work together for [Louis Vuitton] and have become friends.” Reps for Justin and Laura declined People’s request for a comment, so we don’t know for sure. But if they are dating, then I wish them the best, especially Laura. Normally an almost 20-year age difference would cause the older person to struggle to relate to the younger person. But Justin prides himself on being that hipster that knows everything before everyone else, so this might be the first time the younger person feels out of touch. “Oh my god, you don’t know what reverse-pecan water is?? That’s so cute.” Pic: Wenn.com SHARE", "images": ["https://dlisted.com/wp-content/uploads/2018/10/wenn35344415.jpg", "https://dlisted.com/wp-content/themes/dlisted_44/img/dlisted.png", "https://dlisted.com/wp-content/themes/dlisted_44/img/dlistedbw.png", "https://dlisted.com/wp-content/uploads/2019/02/wenn32046578.jpg", "https://dlisted.com/wp-content/uploads/2018/12/ElleCoverAniston-1.jpg", "https://dlisted.com/wp-content/uploads/2018/09/wenn32046586.jpg", "https://dlisted.com/wp-content/uploads/2019/06/wenn36229875.jpg", "https://dlisted.com/wp-content/uploads/2018/08/anistoninstyle2018.jpg", "http://dlisted.com/favicon.ico?v=1"], "top_img": "http://dlisted.com/favicon.ico?v=1", "keywords": [], "authors": ["J Harvey", "Michael K"], "canonical_link": "https://dlisted.com/tag/justin_theroux/", "title": "Gossip, Pop Culture, And Foolery", "meta_data": {"google-site-verification": "wtgaXQuvduR_ynbFXYU1BBBEM-yaIh4zid2J5aq9r5Q", "robots": "max-image-preview:large", "description": "Dlisted | Gossip, Pop Culture, And Foolery | Page 2", "og": {"locale": "en_US", "site_name": "Dlisted", "title": "Justin Theroux", "url": "https://dlisted.com/tag/justin_theroux/", "type": "article", "description": "Justin Theroux"}, "fb": {"app_id": 662132140485214}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "http://dlisted.com", "summary": ""}