{"url": "https://www.seventeen.com/celebrity/celebrity-couples/a19747317/khloe-kardashian-tristan-thompson-relationship-timeline/", "text": "Since Khloé Kardashian and Tristan Thompson started dating in 2016, the couple has been consistently on-again, off-again. While the pair is not together anymore following the news that Tristan fathered a child with Maralee Nichols, things are said to be “okay” between the reality star and NBA player. According to reports, their focus is primarily on “co-parenting” their four-year-old daughter, True Thompson, who they welcomed in 2018, and the new baby boy they welcomed in August. If you’re having trouble keeping track of all their highs and lows and drama, here is a complete timeline of Khloé and Tristan’s relationship.\n\n\n\nOctober 6, 2022: Khloé Explains Why She Won't Hold a Grudge Against Tristan\n\nKhloé is officially moving on. The reality star opened up about how she's managed to maintain such a positive and optimistic outlook after the turmoil she experienced throughout her on-again, off-again relationship with Tristan. During the most recent episode of Hulu's The Kardashians, Khloé said, \"It's probably, maybe, practice.\" The Good American mogul added, \"I think a lot of people maybe forget that I've been through a lot of BS. My ex-husband [Lamar Odom], when we were married, definitely had a very public drug problem and was found in a brothel, and there was a lot of things that probably aren't forgivable, and I'm still able to forgive him and move on and want the best for him.\" According to Khloé, she plans to keep the same energy with Tristan. \"It only hurts me by holding onto all this stuff, so let it go,\" Khloé said. \"Let go and let God.\"\n\nSeptember 30, 2022: Khloé and Tristan Are “Not on Speaking Terms”\n\nIt’s been about two month since Khloé and Tristan welcomed their second child via surrogate, and one KarJenner insider told E! News that their current relationship is strictly about being co-parents.\n\n“They are currently not on speaking terms,” the source shared with the outlet. When they do communicate, it’s “coordinating for the kids.” This update follows the news that back in 2021, Khlo and Tristan were engaged for nine months. Their engagement ended around the time that Tristan’s paternity scandal hit the headlines, and as we see it currently play out on The Kardashians season 2, the couple was officially off-again.\n\nSeptember 30, 2022: Khloé Was Secretly Engaged to Tristan for 9 Months After Rejecting First Proposal\n\nAccording to People, the proposal Khloé had initially turned down occurred in December 2019. An anonymous source told the publication that the on-again, off-again couple had rekindled \"despite lingering concerns about Tristan's infidelity.\" The basketball player had proposed to Khloé a second time around February 2021, and she accepted.\n\nPeople reports that Khloé's sister, Kim, alluded to the \"squishy timeline\" of Tristan's proposals in the latest episode of The Kardashians. \"I'll never forget Tristan calling me and he was gonna propose to her on Valentine's Day, which was a year since they had drama so this was last Valentine's Day,\" she said. \"And then I called him the day after and I was like, 'Hey, I never heard anything from Khloé. Oh my god, did you propose?' and he was like, 'Oh yeah, I did in December.' Oh my God, she didn't tell us!\"\n\nSeptember 29, 2022: Khloé Reveals That Tristan Proposed... and She Turned Him Down\n\nOn the most recent episode of , Khloé revealed that Tristan proposed to her back in December 2020. Not only did she turn him down, but she never told anyone until much, much later.\n\n“The fact that he proposed and you never told us, and I asked him months later,” Kim pointedly explained, as she recalled the NBA player telling her, \"Oh, I did it months ago. She didn’t tell you guys?\"\n\nIf you've been tracking with Khloé and Tristan's timeline for a while now, you might have connected the dots and realized that his pregnancy scandal with Maralee Nichols happened around the exact same time as his secret proposal to Khloé. And if you're wondering why Tristan was rejected, it was because Khloé didn't feel \"proud\" to be receiving his offer.\n\n“I need to make sure this is a totally different relationship because I want to be proud to say I’m engaged to anyone and that’s why I said I’m not comfortable accepting this right now because I’m not excited to tell my family,\" she confessed. “As hurtful as that probably was for him to hear it was the truth. I’m not ever gonna accept something and give someone false hope.”\n\nSeptember 22, 2022: Khloé Kardashian Reveals Baby No. 2 on The Kardashians\n\nThe premiere of The Kardashians came through with plenty of Khloé/Tristan/baby drama, with the season picking up right where we left off. What no one (including the sisters) knew at the time was that Khloé and Tristan had already gone through with embryo transfer to have a second baby via surrogacy when the news of Tristan's child with another woman came out.\n\nThrough the emotional episode, the KarJenners rallied behind Khloé, helping her prepare for the new addition with a baby shower. But some of the sisters couldn't help but comment on the situation, with Kylie Jenner slamming Khloé's baby daddy.\n\nIn a confessional, Kylie said, \"I'm just really disappointed in Tristan. I think it's really f--ked up that he knew he had another baby on the way with somebody else, which makes me uncomfortable to put someone in that position, especially when there's a child involved.\"\n\nShe added, \"This was just really unforgivable in my books.\"\n\nThe drama did have a happy ending, with the new mom of two FaceTiming friends and family from the hospital following her son's birth. \"Ever since December, it's been this dark cloud looming over me. Every single day, I've been feeling depressed and sad, and now that my son is here, I get to move on, and I get to enjoy. It's almost like I get to close that chapter and be done with this trauma and put it behind me,\" she said.\n\n\"Now I finally get to start the healing process. Now I get to start enjoying my life with two kids in it and figuring this out. This is gonna be day one, and this is gonna be the start of something positive, and happy and beautiful.\"\n\nHULU\n\nSeptember 11, 2022: Khloé and Tristan Risk a Run-In at Beyoncé's Birthday Party\n\nAwk! Tristan and Khloé both attended Bey's star-studded 41st birthday festivities, along with Lizzo, MGK and Megan Fox, Lily-Rose Depp, and plenty of other A-List celebs.\n\nIt's unclear whether the exes and co-parents attended the party together or not, but they did arrive and leave the disco-themed party separately. Tristan looked unbothered by the paparazzi in an unbuttoned yellow printed shirt and black sunglasses, while Khloé hid her face behind voluminous '70s waves and blocked the paparazzi's view with a glittering purse that matched her sparkly, disco-ready ensemble. It's awkward, but we, too, would do anything for Beyoncé — including going to a party with an ex.\n\nAugust 30, 2022: Khloé Speaks About Baby No. 2 With Tristan Thompson\n\nIt's been three weeks since Khloé welcomed a son with Tristan via surrogate, and The Kardashians star is ready to speak about her experience with motherhood amid the drama with her baby daddy.\n\nWhen asked in an interview with ELLE how she's doing \"as a mom of two,\" Khloe said, \"I know it's cliché, but I love everything, even the hard parts.\"\n\nShe said her kids \"challenge me as a person,\" and that \"being able to shape little people into really incredible big people is an honor and a gift.\"\n\nKhloe continued, \"We have to take those roles seriously, especially in today's day and age, with how much accessibility children have and the information they're exposed to so young. It's super scary, but I take my job very seriously. I love it so much.\"\n\nAugust 27, 2022: Malika Haqq Says Khloé Is Doing “About as Well as You Could Expect”\n\nIt’s been almost one month since news broke that Khloé and Tristan welcomed a son via surrogate, and during an appearance on the , Khlo’s bestie Malika Haqq gave some insight into how the reality star is getting along.\n\n“I think she’s doing about as well as you could expect for someone in her circumstances,” she told host Carlos King, per People.\n\nMalika continued to say that Khloé is “not the first woman to ever endure adversity in a relationship or be forgiving... but there are some glory times that are really meant to just be glory times. And some of that has been stripped from her, and it’s sad, but she really is one of the strongest people I know.”\n\n“She’s got a good head on her shoulders. Faith is something else, and she’s got a great deal of it. I'll tell you that much. ’Cause this ain’t easy,” she added. “It’s not easy for me to watch, so I know it’s not easy for her.”\n\nAugust 11, 2022: Sources Reveal Khloé and Tristan's Custody Agreement\n\nAccording to an insider who spoke exclusively to Hollywood Life, Khloé and Tristan have already figured out how they want to co-parent their brand new son who is only days old.\n\n“Khloé and Tristan have agreed that Khloé will have sole legal and physical custody of their baby full time. However, Tristan is so excited to have welcomed a son because he really wanted another boy. Even though Khloé will have full custody of the baby, she’s more than happy for Tristan to be present in their child’s life as much as he wants,” the source revealed.\n\nThey continued, telling Hollywood Life that Khloé was in the hospital while the surrogate gave birth while Tristan was with True at a gymnastic center in Los Angeles. \"Khloé isn’t worried whether or not Tristan decides to be there for his baby, because she has a village of support around her. But Tristan has definitely taken an interest in being a very present father to his son and couldn’t be happier for the baby,\" the insider shared.\n\nTristan took to Instagram to share a cryptic message in response to the custody news. He posted a photo of himself, writing \"I never switched sides, I switched lanes. I got wiser and realize we aren't all built the same 🗣🗣👀 #DontTryMe\" in the caption. Interesting — wonder what he's referring to? Tristan, our DMs are open if you want to give us some context clues...\n\nAugust 7, 2022: Khloé and Tristan Welcome Their Son\n\nTrue is officially a big sister. People announced that Khloé Kardashian and Tristan Thompson welcomed their second child together via a surrogate. The former couple (who are focused on co-parenting) have yet to confirm the arrival of their baby boy publicly or announce what his name is.\n\nAs reports of Khloé and Tristan's new addition circulated online, news of Kim Kardashian's breakup with Pete Davidson surfaced as well.\n\nJuly 24, 2022: Tristan and Khloé Post Cryptic Messages on Instagram\n\nThe couple is back at it with the mind games, and we have a front-row seat — Tristan Thompson took to Instagram Stories to share a message that seemed to be a subtle dig at his baby momma. “1. Nothing is promised to you. 2. No one owes you anything. 3. You have all responsibility in your life,” the graphic read. “Understand these three rules as early as possible and realize that independence is the way forward.”\n\n@realtristan13 on Instagram\n\nAt almost the exact same time, Khloé shared a long message on her IG stories that had fans wondering what was happening behind the scenes with the on-and-off pair. “Be thankful that you don't already have everything you desire...If you did, what would there be to look forward to. Be thankful when you don't know something...For it gives you the opportunity to learn. Be thankful for the difficult times. During those times you grow. Be thankful for your limitations. Because they give you opportunities for improvement,” the reality star wrote.\n\n@khloekardashian on Instagram\n\n\"It is easy to be thankful for the good things,\" the two-part message continued. \"A life of rich fulfillment comes to those who are also thankful for the setbacks. GRATITUDE can turn a negative into a positive. Find a way to be thankful for your troubles and they can become your blessings.\"\n\nOof. We hope you’re figuring things out offline, Khloé and Tristan!\n\nJuly 20, 2022: Khloé and Tristan's Daughter True Is \"Excited\" To Become a Big Sister\n\nKhloé and Tristan are expecting their second child together, and their four-year-old daughter True couldn't be more \"excited.\" A source close to the couple told Entertainment Tonight, \"True is so beyond thrilled about becoming a big sister.\" According to the source, True \"has been asking for a sibling for a long time and is so excited.\" Aww!\n\nJuly 19, 2022: Khloé Likes an Instagram Post Supporting Tristan\n\nDoes Khloé approve of Tristan’s other woman? The reality star is seemingly okay following the video of her baby daddy in Greece with a mystery brunette — in fact, Khloé double-tapped a post from a fan account defending her ex’s actions.\n\n@Kardashiansocial posted the video of Tristan with an unnamed woman in Mykonos that had Kardashian fans shook, captioning it in his defense. “To everyone that’s freaking out about this video of Tristan in Greece with another girl, Khloe and Tristan are both single and according to the statement from Khloe’s rep, they haven’t spoken since December besides coparenting so I don’t know why it would be crazy for Tristan to be with another girl as long as he’s a good dad to his baby which we don’t know when Khloe’s surrogate is due,” writes the fan account.\n\nWe don’t know exactly what Khloé’s intentions were when she liked that post, although she seems to be fine with her ex’s newest fling. The reality star hasn’t publicly commented on the situation, choosing instead to share a sweet snap of herself and her daughter, True, on Instagram. “Me and my best girl making the best memories. I will forever have your back my angel girl 🤍,” she wrote.\n\nJuly 17, 2022: Tristan Holds Hands With a New Woman\n\nDays after reports confirmed that Tristan Thompson and Khloé Kardashian were expecting their second child together, a son to be born via a surrogate, the NBA star was spotted holding hands with another woman. TMZ obtained footage of Tristan walking hand-in-hand with a mystery woman in Mykonos, Greece, around 5 AM on Sunday morning. According to the outlet, this wasn't the first night Tristan enjoyed female company during his vacation. On Friday, Tristan reportedly partied at club Bonbonniere, where video footage captured the expectant father surrounded by several women.\n\nJuly 14, 2022: Khloé and Tristan Will Co-Parent Their New Baby\n\nMore details are coming out about Khloé Kardashian and Tristan Thompson's plans for raising their unborn child, who will be delivered via surrogate. According to People, Khloé wants Tristan \"as involved as possible.\" A source told the outlet, \"Just like they do with True, Khloé will co-parent the baby with Tristan.\"\n\nWhile the former couple is no longer dating, Khloé \"doesn't see herself as a single mom.\" The insider revealed that the Good American founder \"feels very lucky\" to have a \"great support system with a lot of help.\"\n\nJuly 13, 2022: Khloé and Tristan Are Having A Baby Boy Together via Surrogate\n\nIt looks like True is going to be a big sister! According to a report by TMZ, the on-again, off-again couple is having a second baby together via surrogate. Multiple sources told the outlet that their baby is on the way if it hasn't \"already been born in the last day or so.\" A source also revealed to Page Six that Khloé and Tristan's second child is a boy.\n\nOne of Khloé's reps confirmed to Entertainment Tonight that the baby was conceived in November 2021. \"Khloé is incredibly grateful to the extraordinary surrogate for such a beautiful blessing. We'd like to ask for kindness and privacy so that Khloé can focus on her family,\" the rep said. Based on the timing of the surrogate's pregnancy, it seems that Khloé and Tristan decided to go for baby #2 before their most recent breakup and latest cheating allegations that closed out the first season of Hulu's The Kardashians.\n\nRelated Story How Khloé and Tristan's Baby News Was Leaked\n\n\"The two have long said they wanted True to have a sibling, and Khloé even told her family she'd do it without Tristan if she needed to,\" an anonymous source told ET. \"However, when the two were on good terms they decided to move forward with surrogacy near the end of last year, and then Tristan was caught cheating. The two aren't together and Khloé will have the baby full time, but Khloé wants Tristan in both the kids' lives as much as he wants to be.\"\n\nAnother anonymous source told the outlet that outside of co-parenting True, Khloé and Tristan have not spoken since December.\n\nJuly 8, 2022: TikTok Catches Khloé Thanking Tristan for Birthday Flowers in a Deleted Instagram Story\n\nA savvy TikTok user just caught the most recent turn of events in the long saga that is Tristan and Khloé’s relationship — apparently, the NBA player sent his ex (and baby mama) a birthday flower arrangement that she thanked him for on Instagram…before promptly deleting the tag.\n\nHannah Kosh (@hannahkosh) posted a screenshot of Khloé’s now-deleted Instagram story of pink peonies on a dining table with the words “Thank you,” zooming in on Tristan’s Instagram username tagged in the corner of the post. The photo was later reuploaded sans Tristan’s tag.\n\n“Girl pleasee i can’t keep defending her” wrote one TikTok user. Another commented, “if this woman don’t let this man GO.” So, was that a purposeful ~move~ to show Tristan she was removing his tag, or did we witness some real time posting regret? We may never know...\n\n@khloekardashian on Instagram\n\nJune 19, 2022: Khloé Addresses Paparazzi Photos of Her and Tristan\n\nOver the weekend, paparazzi photos of Khloé, Tristan, and True circulated around the Internet — the first public photos of the exes since Tristan's paternity scandal in early January. Per Page Six, the images show the three exiting a restaurant with momager Kris Jenner, presumably following True's dance recital, which Khloé posted about on Instagram.\n\nAccording to the published photos, it appears that the four shared an intimate lunch together, but Khloé quickly set the record straight on Instagram. Under a post about the outing on a fan account, the reality star commented, \"Hummmm Very calculated of the paparazzi to not release photos of my other sisters and the fathers of their children Kim/Kanye Kylie/Trav.\" The account @commentsbycelebs also captured Khloé's response.\n\nInstagram\n\nShe also took to the social media app to address rumors about her dating life, which also started to spread over the weekend. In a post from another fan account, a screenshot from DeuxMoi speculates that Khloé has moved on and is dating an NBA player. However, she shut all the rumors down in the comments. \"Definitely NOT True !!! I love you! Thank you for the nice wishes but I am not seeing a soul,\" she wrote. \"I am happy focusing on my daughter and myself for awhile.\"\n\nJune 16, 2022: Khloé Reacts to News of Tristan’s Paternity Scandal On The Kardashians\n\nKhloé Kardashian spoke out about how she discovered that her on-again, off-again boyfriend of nearly five years, Tristan Thompson, fathered a child with Maralee Nichols while they were together. \"I find out what Tristan is doing with the rest of the world,\" the Good American creator said. \"A courtesy would be not doing it, but fine if you do it, you're not even going to give me a f*cking heads up before the rest of the world? It's just an additional slap in my face. It's humiliating. I'm embarrassed.\"\n\nClips of the couple and their 4-year-old daughter True emerged on the screen as Khloé said, \"I'm replaying every event, every grand gesture, every trip, every date, every whatever. All of that was a lie.\" \"When things happen to you a couple of times, you do kind of become immune to them, which is really sad.\"\n\nKhloé later revealed Tristan's plans to move in with her and their daughter. \"This house was supposed to be mine and Tristan and True's home that we were supposed to have our family in.\" It's really disappointing, and it's heartbreaking.\" \"I wanted to believe that Tristan could change. I wanted to trust him and to believe that True and I were worth him changing for, but that's just life. Things just don't always go the way that we hope and plan.\"\n\nMay 9, 2022: \"The Kardashians\" Executive Producer Details Moment Khloé Discovered Tristan's Paternity Scandal\n\nThe Kardashians on Hulu is five episodes in and we've already witnessed some major moments unfold in the Kar-Jenner's lives. Kim hosted SNL, Kravis got engaged, Kendall and Scott get into an explosive fight — the list goes on, and it appears there is certainly more to come.\n\nAhead of the show's fifth episode debut, executive producer Danielle King spoke to US Weekly about what exactly was going on behind the scenes during filming. And it turns out, cameras were rolling when Khloé discovered that Tristan had fathered a child with Maralee Nichols.\n\n\"Well for that particular moment, my crew was there. We were there to film something else early in the morning and the morning that news broke, we legitimately just happened to be there. We have that moment on camera,\" she revealed. \"And I know sometimes it's tough for the audience to kind of grasp like 'Oh, did they go back and did they capture this?' But there were so many moments that we genuinely captured just because we're almost always there. There's almost always a camera going.\"\n\n\"Our story goes in a completely different direction sometimes,\" she continued. \"We might be going there to shoot one thing, and then I'm usually like 'Oh OK, I didn't see this coming but here we go.'\"\n\nThe EP didn't disclose the specific episode that we see this heartbreaking scene unfold, but we do know that Tristan confessed that he had a child with Maralee in January, and The Kardashians is currently airing the events that happened around Thanksgiving. So, it's likely it'll occur in a couple more episodes.\n\nMay 8, 2022: Tristan Sends Kris Jenner Mother's Day Flowers\n\nKhloé and Tristan are done for good — as the reality star confirmed last month — but it appears the NBA player still keeps close with his ex's family. On Sunday, May 8, Tristan sent a pink-and-white arrangement of roses to Kardashian matriarch Kris Jenner for Mother's Day. The momager uploaded a snap of the colorful bouquet on her Instagram Story, tagging and thanking Tristan. \"Thank you @realtristan13!!! Love you 💖,\" she wrote.\n\nInstagram\n\n.\n\nDespite their split, Khloé and Tristan continue to co-parent their four-year-old daughter True. In her interview with ABC's Robin Roberts in April, Khloé shared, \"I still think he's a great guy, and he's a great dad. He's just not the guy for me.\"\n\nApril 6, 2022: Khloé opens us about her relationship with Tristan\n\nKhloé Kardashian is officially moving on after her relationship with NBA star Tristan Thompson. The Good American mogul appeared in an interview with Robin Roberts, where she opened up about how her relationship began with Tristan, what made her look past his initial infidelity, and where she stands with him now. The Sacramento Kings star was involved in multiple cheating scandals and fathered a son with another woman while he was dating Khloé.\n\n\n\n\"With Tristan, I did feel incredibly safe in the beginning and I felt really good for a time,\" she began. \"I remember when he cheated on me right before I gave birth and I was able to still have him in the delivery room,\" she explained. \"So yes, it might have looked strange to the outside world, but when my daughter watches my home videos, those videos are going to be as pure and perfect as I was able to make them.\"\n\nThe on-again-off-again couple managed to work through serious challenges in the past, but Khloé admitted that romantically, they're over for good. \"I still think he's a great guy, and he's a great dad. He's just not the guy for me.\"\n\nShe also discussed what she and the rest of her siblings are looking for in their future partners and relationships. \"I think at the end of the day, all of us aspire to have blissfulness,\" Khloé said. \"We want to feel happy, we want to feel safe.\"\n\nMarch 9, 2022: Khloé gives her first interview since Tristan's paternity scandal\n\nIt's been a little over two months since Tristan Thompson admitted that he fathered a child with Maralee Nichols. Now, in a new interview profile with Variety, Khloé has opened up for the very first time about the cheating scandal — and confirmed that she will address the painful situation in the Kar-Jenner's new Hulu series, The Kardashians.\n\n\"I wish I never had to talk about that because it’s not a fun thing to talk about,\" Khloé shared. \"But it is part of my journey in life, so we will see it on the show.\"\n\n\n\nFebruary 8, 2022: Tristan shares an adorable post with True\n\nTristan Thompson recently spent quality time with his three-year-old daughter, True. The daddy-daughter duo was all smiles as Tristan sat True in his lap in an adorable photo he shared to his Instagram Story. The NBA star kept things short and sweet, simply adding two red heart emojis to the pic.\n\nInstagram\n\nJanuary 21, 2022: Tristan makes a post about facing \"demons\"\n\nTristan Thompson took to social media with a cryptic message. The Sacramento Kings star opened up about facing \"demons\" after a DNA test confirmed that he fathered his third child while he was publicly dating Khloé Kardashian.\n\n\"Sometimes you don't realize your own strength until you face your greatest weakness,\" he wrote on his Instagram Story. \"Hide from your demons and they'll slowly destroy your potential. Face them and they can potentially become your greatest asset.\"\n\nTristan Thompson // Instagram\n\nJanuary 19, 2022: Khloé's family is reportedly helping her get through Tristan's cheating scandal\n\nKhloé Kardashian is reportedly leaning on her mother Kris Jenner for support after Tristan Thompson was proven to have fathered a child while they were publicly dating. According to People, the reality star is having a \"tough time accepting the paternity drama.\"\n\nA source claims, \"Khloé is really struggling with what's happening with Tristan.\" Her mother has been a source of strength during her tough time. \"She's leaning heavily on Kris all of the time. But Kris wants Khloé and Tristan to be in a good place so she's encouraging Khloé to keep the lines of communication open.\"\n\nThe source claims the reality star is \"so upset\" because she \"wanted the fairytale life\" with the NBA baller. \"People around her have never seen her so down and are so thankful she has her mother there who has barely left her side,\" the source said.\n\nJanuary 12, 2022: Sources share where Khloé and Tristan stand following paternity confession\n\nKhloé Kardashian has yet to publicly address Tristan Thompson's apology for fathering a child with Maralee Nichols while they were rumored to have still been dating. According to Page Six, the reality star is \"taking the high road,\" and privatively let Tristan \"know she appreciated the message.\"\n\nA source told the outlet, \"While she will never, ever get back with him, Khloé really wants Tristan to be a good father to [their daughter] True, and for him to be a big part of their daughter's life.\"\n\nThe source revealed that Khloé's priority is making sure True \"has a good relationship with her dad... So for that reason, Khloé is not going to fight with Tristan or block him from the family.\"\n\n\n\nJanuary 3, 2022: Tristan Thompson confirms he fathered a child while dating Khloe Kardashian\n\nTristan Thompson is officially a new dad. The NBA star took to his Instagram Story, where he confirmed that he is indeed the father of a son with Maralee Nichols. Along with admitting paternity, Tristan took \"full responsibility\" for his actions and apologized to his ex-girlfriend, Khloe Kardashian, who he was reportedly dating at the time his son was conceived.\n\n\"Today, paternity test results reveal that I fathered a child with Maralee Nichols,\" the Sacramento Kings center-forward wrote. \"I take full responsibility for my actions. Now that paternity has been established I look forward to amicably raising our son.\"\n\nHe continued with a message for those hurt by his actions. \"I sincerely apologize to everyone I've hurt or disappointed throughout this ordeal both publicly and privately.\"\n\nTristan Thompson // Instagram\n\nTristan followed up with a separate post to Khloé writing, 'You don't deserve this. You don't deserve the heartache and humiliation I have caused you. You don't deserve the way I have treated you over the years.\" He added, \"My actions certainly have not lined up with the way I view you. I have the utmost respect and love for you. Regardless of what you may think. Again, I am so incredibly sorry.\"\n\nTristan Thompson // Instagram\n\nKhloé has yet to speak out following news of Tristan's new son.\n\nDecember 17, 2021: Maralee Nichols makes her first public statement after her paternity suit against Tristan Thompson goes public\n\nMaralee Nichols has come forward amid reports of her paternity suit against Tristan Thompson. She provided a statement to E! News to address the \"fake stories,\" \"unflattering photos,\" and incorrect reports about her occupation and age.\n\n\"There have been multiple fake Instagram posts claiming to be me, making false statements and attaching stock photos of a sonogram and a child (neither mine),\" she told E! News.\n\nMaralee, who said she met Tristan during a party at his Encino, California, home in 2020, continued, \"These are the facts: I have lived in California since 2019. I am not a personal trainer. I have not worked as a personal trainer for four years; I do fitness modeling. I was never a personal trainer for Tristan.\"\n\nShe revealed that she saw the NBA star on his Birthday and \"agreed to meet him in Houston at a private party on March 12.\" The fitness model claims she and Tristan spent \"many nights\" together after his birthday and she even visited him in Boston. Maralee says she discovered she was pregnant and told Tristan the news when he flew her to North Carolina to see him at the end of April.\n\nMaralee claims she did \"everything possible\" to stay out of the media during her pregnancy. According to the new mother, \"Tristan filed a paternity action in Texas after I filed my paternity action in Los Angeles.\" She also addressed concerns over child support. \"I did not file any request for child support before our child was born. The case that Tristan brought against me was dismissed on December 15, 2021.\"\n\nShe also opened up about her delivery and her plans going forward. \"I was induced on November 29, 2021, because I had a placenta abnormality,\" she said. \"There is no other medical reason why I needed to be induced. I gave birth on December 1, 2021. Instead of focusing on any negativity, I am choosing to embrace being a mother and doing the best I can for my son. I do not want any further media attention, nor do I want a romantic relationship with Tristan. My goal is to raise our son in a safe, healthy, loving, and private environment.\"\n\nDecember 16, 2021: Paternity documents claim Tristan admitted to having a relationship with the woman accusing him of fathering her child\n\nNew details have emerged in Tristan Thompson's ongoing paternity suit with Maralee Nichols. According to court documents obtained by the Daily Mail, Tristan reportedly admitted to having a \"sporadic\" relationship with Maralee.\n\nAccording to the court docs, Tristan \"was very cautious\" and \"did not foresee that\" he would have any type of relationship with Maralee after meeting her in late November or early December 2020. Tristan denied having sex with Maralee in California at that time, but he reportedly confirmed that the \"only\" possible date of conception for Maralee's child is March 13, 2021, which is his birthday. Per the docs, Maralee claims the child was conceived in April.\n\nAccording to the docs, Tristan said, \"We did not have any dates in the traditional sense at any time; there were no dining at restaurants, going to movies, traveling or any other indicia of a normalized relationship.\"\n\nHe later admitted that he and Maralee would discuss \"where\" and \"what time\" they would hook up on Snapchat, but denied sending the viral screenshots of a conversation where he was accused of saying that he would be unable to pay an extreme amount of child support because he'd be retiring from the NBA soon.\n\n\n\nDecember 10, 2021: Khloé and Tristan are officially over\n\nKhloé Kardashian and Tristan Thompson are reportedly \"focused on co-parenting True\" amid reports that the NBA star welcomed his third child with another woman. According to People, \"Khloé is moving on.\" The former couple has allegedly been \"broken up for a while and things are okay between them.\"\n\nThe source said that Khloe remained in a relationship with Tristan \"because she always believed he would change,\" especially since they spent the COVID-19 lockdown together. together.\n\nDetails about Tristan's ongoing paternity lawsuit with Maralee Nichols have been sealed. According to PageSix, the filing no longer be found online. The records are reportedly listed as \"currently confidential or this case has been sealed.\" The findings come days after Tristan reportedly filed a gag order to stop Maralee from engaging with the media about their case.\n\nDecember 2, 2021: Khloé makes a cryptic post after Tristan is accused of fathering a child while they were together\n\nKhloé took to her Instagram Story amid reports that Tristan Thompson was allegedly expecting his third child with Maralee Nichols. According to screenshots obtained by Life and Style, the reality star reposted a quote from Girl Unfiltered that read, \"I just don't have time for negative energy, and even when I do, I still don't.\"\n\nShe reportedly followed up with another IG Story quote that read, \"You are currently living at least one of the prayers you used to pray.\"\n\nAccording to court docs obtained by The Daily Mail, Maralee's relationship began before the NBA star's 30th birthday in March and continued throughout her pregnancy. Tristan has reportedly requested a paternity test.\n\nMaralee gave birth to a baby boy on Wednesday, December 1.\n\nAugust 16, 2021: Khloé and Tristan are reportedly dating again\n\nAbout two months after their most recent split, rumors started circulating that Khloé and Tristan were giving things yet another go. As always, many had opinions on the reported news, and one person took to Twitter to voice how they felt about the alleged rekindling.\n\n\"At this point @khloekardashian has no self worth. Anyway...,\" @_Rutie wrote on Twitter in response to a headline from the Mirror about Khloé and Tristan reportedly getting back together.\n\nKhloé, though, wouldn't stand for the hate, and she responded to the tweet immediately. \"You’re telling me you made an assessment about my life because of a random blog?\" she said. \"I think that says more about you than it does about me.\"\n\nMeanwhile, since the original tweet, E! News has reported that Khloé and Tristan are not back together, despite reports. \"They are telling people they aren't back together, but have been hanging out pretty often with True,\" a source said. Apparently, \"she wants him around and they talk every day\" and, despite everything, \"Khloe has forgiven him for what he's done and would rather just be on good terms with him.\"\n\nJuly 8, 2021: Tristan replied to one of Khloé's steamy Instagram posts\n\nDespite reports that Tristan and Khloé are currently not together due to yet another cheating scandal, Tristan has proven that he's not immune to Khloé's good looks. The basketball star just left a very thirsty comment on Khloé's Instagram of her in a tight blue dress on the beach.\n\nTristan kept things simple, commenting with three heart-eye emojis on the pic. Fans, though, were not too happy about this.\n\n\"LEAVE HER ALONE!!!!!\" one person commented. \"Give her the peace she deserves,\" added another.\n\nInstagram\n\nApparently, we shouldn't be too surprised by Tristan's comment. According to People, \"Tristan's still trying to get Khloé back. He hasn't given up and he doesn't think the door is closed.\" Khloé, meanwhile, is reportedly \"extremely disappointed in how things have played out with Tristan.\" So, we will just have to wait and see where they go from here.\n\nJune 27, 2021: Tristan celebrates Khloé's birthday on Instagram\n\nTristan took to Instagram to wish Khloé a happy birthday less than a week after news of their reported split. The basketball player shared three photos with Khloé alongside a heartfelt caption.\n\n\"Happy birthday @khloekardashian,\" Tristan wrote. \"Thank you for being not just an amazing partner, mommy and best friend but also being the kindest, caring and most loving human being I’ve ever met. Your love and spirit is contagious to all who’ve met you. Thank you for always being there for me and putting our family first. I love you so much. Have an amazing day. ❤️❤️\"\n\nKhloé did not like, comment, or repost Tristan's tribute, despite doing so for many of her other friends and family members who shared photos and messages on Instagram for Khloé's birthday.\n\nWhile E! News previously reported on the pair's breakup, according to Us Weekly, \"Khloe still loves Tristan and would take him back in a heartbeat.\" That apparently is \"not happening any time soon,\" however. According to a source, they went from spending 24/7 together to breaking up and Khloé's currently working on the \"transition into being friendly co-parents\" and she's trying to \"separate her emotions from him.\"\n\nJune 21, 2021: Khloé and Tristan have reportedly broken up again\n\nKhloé and Tristan have reportedly broken up once again. According to E! News, Tristan has lost all of Khloé's trust, and \"the relationship could not be repaired.\" A source told the site, \"Khloe really tried, but ultimately, felt too betrayed by him. She's done and says she will not go back.\"\n\nThe news of their breakup comes after Tristan was reportedly seen entering a bedroom with three women at a party in LA. Eyewitnesses told E!, \"He seemed like he was in a great mood and wanted to party. He was drinking and was partying into the early hours of the morning.\" He was apparently telling people he was single.\n\nAccording to Entertainment Tonight, Khloé and Tristan ended things a few weeks ago, but they will continue to co-parent their daughter True together. \"The two are on good terms and at the end of the day, Khloe just wants True to have a good relationship with her father,\" a source said.\n\nMarch 13, 2021: Khloé says she's back with Tristan\n\nOver two years after the cheating scandal that was heard around the world, Khloé has confirmed that she is back with Tristan and they're \"even stronger than they were before.\" In an Instagram post for Tristan's 30th birthday, Khloé opened up a little bit about the pair's relationship.\n\n\"The ones that are meant to be are the ones who go through everything that is designed to tear them apart and they come out even stronger than they were before,\" she said, alongside photos with Tristan and their daughter, True. Apparently, Tristan was able to gain Khloé's trust back. \"Thank you for showing me everything you said you would,\" she wrote. \"I'm thankful that I can do absolutely nothing with you and it feels like everything.\"\n\nKhloé ended the note, writing, \"I hope you know today and every day how loved you are by me and so many.\"\n\nFebruary 21, 2021: Khloé sparks engagement rumors\n\nKhloé sparked engagement rumors when she promoted her new line of Good American shoes with a sexy snap that features a massive diamond ring on *that* finger. After seeing the pic, the Internet started freaking out, assuming that this meant Khloé and Tristan were engaged.\n\nWhen E! personality Morgan Stewart commented \"ARE THEY\" on the photo, Khloé fueled the engagement rumors even further by responding, \"Yep they are.\" She later clarified, though, that she wasn't confirming engagement news.\n\n\"My reply was to the question 'are they,'\" she wrote. \"My reply is 'Yep they are'...Meaning yes the shoes are dropping on 2.25.\"\n\nInstagram\n\nAccording to Page Six, the ring isn't even from Tristan, and Khloé has actually been seen wearing it before. So, unfortunately, it seems like the post is not an engagement announcement.\n\nThere is some good news, however. A source recently told Entertainment Tonight that Khloé and Tristan are \"stronger than ever\" after everything they've been through. And even though Tristan is now in Boston, playing for the Boston Celtics, they are constantly in communication and Khloé has forgiven him for everything that has happened in the past.\n\n\"Khloe forgives Tristan at this point, but she will never forget,\" the source said. \"They are back to being committed, are still in love and giving their relationship another chance and hoping that it will succeed this time around. Tristan has been paying extra attention to Khloe and True and has been calling, FaceTiming, texting, and sending photos all the time to check in when they are not physically together. He hasn’t been going out late at night with the boys or other girls.\"\n\nSo while this picture may not have been an engagement announcement, I think it's safe to say one may be coming very soon.\n\n\n\nOctober 5, 2020: Khloé and Tristan are reportedly trying to have another baby\n\nNot only is everything reportedly \"great\" in Khloé and Tristan's relationship right now, but according to People, they may be adding to their family very soon. \"They are definitely planning their future together and can't wait to have another baby,\" a source shared.\n\nApparently, the pair has been living together for a while now. \"Their focus is True and they keep doing fun family activities together,\" the source said. \"Khloe really believes that things will continue to be great even after Tristan has to return to work. She is very impressed with how he has stepped up.\"\n\nAll I know is that True is the cutest and she is going to kill it as a big sis when the time comes.\n\nAugust 28, 2020: Scott Disick confirms that Khloé and Tristan are back together on Instagram\n\nWe seemingly just got confirmation that Khloé and Tristan are officially back together. Khloé recently posted a steamy bikini pic and Scott Disick couldn't help but comment. \"@Realtristan13 is a lucky man!\" he wrote.\n\nOf course, Scott is a pretty credible source when it comes to Khloé's relationship, so I think we can all agree that this means True's parents are back on.\n\nAugust 5, 2020: Khloé and Tristan officially reconciled in June\n\nIt looks like forgiveness is all it took for this couple. Just a month after a report came out that Khloé was forgiving Tristan, People just revealed that they actually got back together in June.\n\n\"She loves having him around. He has the best relationship with True,\" the source told People. \"And he has been amazing to Khloé too. They are very much together and Khloé is beyond happy.\"\n\nHere's hoping the second time is the charm for them!\n\nJuly 2, 2020: Khloé and Tristan are reportedly giving their relationship another try\n\nAfter almost a year and a half apart, it seems like Khloé may be ready to forgive Tristan. The pair is reportedly, \"giving their relationship another try.\" According to People, \"Tristan is working hard to prove himself and has been a great dad to True.\"\n\nRumors of a reconciliation have been swirling ever since Khloé's 36th birthday. Not only was Tristan at the party, but they apparently \"acted like were back together\" while celebrating. Tristan also posted a sweet message for Khloé on Instagram in honor of her big day.\n\n\"I’m wise enough now to know, you came into my life to show me just what it means to be an incredible person,\" he wrote. \"I appreciate how I am able to learn from and grow because of you. I thank God for the beautiful and loving woman you are to everyone, especially our daughter True. You deserve the world Koko! True and I love you mama. Happy Birthday @khloekardashian.\"\n\nAt her birthday party, Khloé snapped a pic with her BFF Malika Haqq. In the photo, which she later posted on Instagram, Khloé can be seen rocking a huge diamond ring on her left ring finger. This, of course, has led many to think that Khloé and Tristan are not only back together, but engaged.\n\nAccording to E! News, though, while things are \"going very well\" for the couple, they are not engaged. Khloe is apparently \"very happy with where things are right now,\" but she is taking things slow.\n\nOnce the quarantine is over, Tristan will be back on the road for basketball and this separation reportedly concerns Khloé. Though right now, \"she isn't getting ahead of herself.\" She's simply \"enjoying having [Tristan] around right now and all of the family time they have had together with True.\"\n\nJune 27, 2019: Tristan moves into Khloé's neighborhood\n\nThough Khloé and Tristan may have broken up months ago, they are now closer than ever...literally, because Tristan just bought a house right outside of Khloé's neighborhood!\n\nAccording to Us Weekly, the basketball player recently purchased a $6.5 million dollar mansion in Encino, California, which has seven bedrooms, eight baths, a pool, spa, AND an outdoor kitchen...wow.\n\n\n\nThe kicker? The new pad is just a 25-minute drive from his ex's house. Tristan assumedly bought the house due to its proximity to his 14-month-old daughter, but it's unclear what Khloé thinks about her ex's new location.\n\nJune 12, 2019: Khloé responds to claims that she started dating Tristan while he was still in a relationship with his then-pregnant girlfriend Jordan Craig\n\nKhloé is not here to get dragged into Tristan Thompson's latest drama that includes ANOTHER cheating scandal. On her Instagram story, Khloé set the record straight when it came to the start of their relationship. Some fans had begun to question Tristan again when it was revealed that his ex-girlfriend said that she was cheated on when Tristan started to date Khloé.\n\n\"After going on some dates, Tristan told me that he had an ex that was pregnant. Obviously, I was reluctant about us continuing to date or start a relationship,\" she wrote. \"He pleaded with me that the relationship was over long before we met.\"\n\nShe even revealed that she had his friends, lawyer, and mother say that he was no longer with his ex before she got with him.\n\n\"This is my truth! The truth that I believed and trusted. If for any reason this is NOT in fact the truth, I am so completely and utterly sorry that TRISTAN and his inner circle would lie on something like this,\" she wrote on another slide. \"Truthfully, from the deepest parts of my soul I am sorry! I'm sorry for any pain that has been created either way. No woman deserves to go through anything like this!\"\n\nMay 31, 2019: Khloé posts cryptic message on social media\n\nKoko is known for getting cryptic on her Instagram account, so fans weren't necessarily shocked when she posted this seemingly shady post: \"Your loyalty might have kept you in some situations that common sense should've talked you out of. That's just the kind of person you are.\" While we all know Khloe is loyal AF, we can't help but wonder who it is she's actually talking about. Is this post meant for Tristan Thompson and her old ex Lamar Odom?\n\nBoth guys cheated on her and, despite their infidelity, she stayed true to the very end. Fans are wondering, though, if this is actually all about Tristan. After all, she'll be re-living their breakup in Sunday's episode of Keeping Up with the Kardashians. Khloé debates her fealty to Tristan in a clip, saying \"I don't feel like I have an answer. Like, okay, I'm going to be with Tristan forever, or I'm going to break up with him... I still feel like, god, when will I ever know?\"\n\nMay 9, 2019: Khloé's drama with Jordyn Woods is aired on a new episode of KUWTK\n\nThe most awkward part of Keeping Up with The Kardashians is the fact that it rehashes drama that occurred months ago. It's even more awkward when things transpire between the event and the airing like say, Jordyn Woods kisses Khloé's boyfriend and then a video of Khloé praising the 21-year-old becomes completely cringeworthy. Well, get excited, because that's exactly what's going down on this week's ep of KUWTK!\n\nIn the episode, we see a party celebrating the launch of Kylie's cosmetic collab with her former BFF Jordyn. Everyone is in a great mood at the party, especially Khloé, who decides to say a few words. \" And Jordyn, for you to be turning 21, I've known you forever, and I'm so proud of you and the woman you have grown into and you're growing into,\" Khloé says. \"And to see you guys just stick together and be best friends through thick and thin, it's such a blessing. Congratulations on everything and this'll be a huge success!\"\n\nIt's a sweet sentiment, of course, but awkward af considering everything that has gone down since. Well, just think. As hard as that speech is for us to watch, it must be one million times worse for Khloé.\n\nApril 16, 2019: Khloé reportedly ignored Tristan during True's birthday party\n\nWe've got more news from True's first birthday party, and considering the video that surfaced of Khloé straight up ignoring Tristan at the event (see below), it's pretty much what you would expect.\n\nAccording to People, there \"was never a question\" as to whether Tristan would be invited or not, but she was still \"nervous about having him there.\" Khloé even had to ask her family members, who are known for speaking their minds, to \"behave and leave Tristan alone.\"\n\nAll in all, the party went well, probably because aside from a few pictures together with True, they \"had very little interaction.\"\n\nDespite their extremely rocky past, \"it's super important to Khloé that True spends as much time with Tristan as possible,\" People's source said. Khloé wants True to have a great relationship with Tristan.\"\n\nApril 14, 2019: Khloé and Tristan celebrate True's first birthday together\n\nOf course, Tristan was in attendance for his daughter's first birthday, but that doesn't mean Khloé had to give him the time of day. Women around the world cheered when Khloé hardcore gave her ex the cold shoulder at True's party, as documented on Instagram.\n\nIn the video, you can see that while Tristan is trying to get True, Khloé is too busy paying attention to literally everyone else. Khloé didn't get too petty, however. She did let Tristan have his moment with his daughter and hold her while they sang happy birthday.\n\nIt's good to see that things are amicable with them, but Khloé is still treating Tristan exactly how he deserves to be treated 💁🏻.\n\n\n\nMarch 14, 2019: Reports surface about Tristan's role in True's life following his cheating allegations with Jordyn\n\nKhloé and Tristan may no longer be together, but they will forever be connected thanks to baby True. Unfortunately, while Khloé is constantly showing her daughter lots of love, it seems like Tristan has been pretty hands-off ever since the breakup.\n\n\"Khloé is getting extremely upset with Tristan because he isn’t really making any effort to be involved in their daughter True’s life,\" a source told Us Weekly. While Khloé understands that Tristan has a busy schedule and is on the road a lot, she feels like he \"has moved on\" from True. According to the source, \"Tristan’s attitude seems to be, ‘I will see True when I see her.’\"\n\nObviously, Khloé is not happy about this, and with True's first birthday coming up, we will have to wait and see if Tristan is involved or not. While I'm sure Khloé wants True's father to be there, \"she can't see how he can be around her family at a party, though. Everyone is just too upset with him,\" said People. I mean...can you blame them?\n\nMarch 1, 2019: Khloé reacts to Jordyn's Red Table Talk interview\n\nFollowing Jordyn's tell-all interview on Red Table Talk where she claimed that nothing happened between her and Tristan aside from a peck on her way out the door, Khloé took to Twitter to call her out.\n\n\"Why are you lying @jordynwoods ??\" she wrote. \"If you’re going to try and save yourself by going public, INSTEAD OF CALLING ME PRIVATELY TO APOLOGIZE FIRST, at least be HONEST about your story. BTW, You ARE the reason my family broke up!\"\n\nObviously many were confused. Why was Khloé attacking Jordyn so publicly when Tristan was just as responsible (if not more if you believe Jordyn's side of the story). Well, Khloé had a response to that too.\n\n\"Tristan is equally to blame but Tristan is the father of my child,\" she said. \"Regardless of what he does to me I won’t do that to my daughter. He has been addressing this situation PRIVATELY. If Tristan were to lie publicly about what conspired, then yes I would address him publicly as well.\"\n\nIt's unclear what Tristan's side of the story involves and why Khloé seems to be believing him over Jordyn. We will have to wait and hope that Jada Pinkett Smith sits down with the two of them next.\n\nFebruary 27, 2019: Khloé seemingly likes tweets about Jordyn Woods' decision to publicly address the alleged incident\n\nWhile Khloé hasn't officially confirmed or denied the alleged cheating incident between Tristan and Jordyn, her social media activity speaks for itself. Two tweets that she \"liked\" on Twitter are extremely revealing, with one even seemingly confirming that the hook-up occurred.\n\nBoth tweets are in reference to Jordyn's upcoming appearance on the Facebook show Red Table Talk, where she will most likely discuss her side of what occurred. In a response to a tweet that said, \"Jordyn deserves a win,\" one Twitter user wrote, \"She slept with Khloé's baby daddy, and they haven't even publicly said ONE bad thing about her, just unfollowed her, so how is that the Kardashians fault? Jordyn smeared her OWN name!\"\n\nThe other tweet that Khloé liked is in response to the video of Jordyn at the Red Table Talk studio. \"I really don’t understand the point of this,\" @aussiedashdoll wrote. \"There’s no way she can justify what she did.\"\n\nSources said that the Kardashian's aren't happy with Jordyn's decision to go on the talk show, especially because it means she will be breaking the NDA that prohibits her from talking about the famous fam. Khloé's liked tweets about the situation not only prove that the KarJenners are angry, but it also might prove that the still alleged cheating scandal did, in fact, occur.\n\nThis also comes as Tristan is reportedly \"trying to make amends\" with Khloé. \"Tristan has been telling Khloé that he feels bad and that they have a kid together and that he disrespected her as the mother of his child,\" a source told People. Of course, this is the same guy who was apparently very indifferent when the scandal initially broke, according to Us Weekly, so it's hard to believe anything that guy says these days.\n\nFebruary 26, 2019: Khloé makes social media debut since news of Tristan reportedly hooking up with Jordyn Woods\n\nKhloé made a bold statement when she posted some gorgeous pics on IG just a week after the news broke that Tristan allegedly cheated on her with Jordyn Woods. The photos featured her, Kourtney, and Kendall rocking some sexy outfits. Khloé herself was in a diamond bodysuit and, let me tell you, she looked fierce.\n\nWell, apparently Tristan Thompson agreed that the pic was H-O-T, because he gave it a \"like\" on Insta, and obviously, people were NOT happy.\n\nThen, things got even more interesting. When I went to go double-check that like (you know, journalistic integrity and whatnot), it was no longer there! Meaning Tristan took back is like! Which maybe even shadier than liking it to begin with.\n\nInstagram\n\nVery shady Mr. Thompson...But, then again, should we really expect anything else from him?\n\nFebruary 20, 2019: Tristan reportedly hooked up with Kylie Jenner's best friend Jordyn Woods\n\nGet ready, 'cause it's been a wild couple of hours. After news that Tristan was up partying in L.A., new reports saying that he hooked up with Kylie Jenner's BFF, Jordyn Woods started to circulate on the internet.\n\nWhile no one has outright confirmed that this is what really happened, Khloé seems to be hinting that it's all true. Tristan has reportedly admitted to the whole thing and it seems like things between him and Khloé are officially over.\n\nKhloé has given Tristan plenty of chances, but this one has clearly gone too far for her to be able to forgive him.\n\nA source told Us Weekly, \"Tristan isn’t too worried about not seeing True, or Khloé establishing new rules when it comes to co-parenting. He honestly doesn’t really care and was over it. He was never trying to win Khloé back.\"\n\nYIKES! They have since hinted that the news is real, but have still kept it under wraps. It'll definitely be interesting to see what happens when one of them finally speaks out. We'll all be waiting for that tea.\n\nFebruary 19, 2019: New rumors fuel speculation that Tristan and Khloé have broken up\n\nKhloé and Tristan have been in a long-distance relationship for months, with Tristan living in Cleveland for his NBA team while Khloé is taking care of True in LA. So, when Tristan visited LA, you would think he would see Khloé, right?\n\nWhile we don't know exactly how he spent his whole trip to LA, we do know how he spent his Saturday night. According to the Daily Mail, Tristan partied until the early hours of the morning in West Hollywood. While out on the town, the basketball player was reportedly \"being flirty, hitting up girls.\" Meanwhile, Khloé was nowhere to be found.\n\nIt is, of course, possible that Tristan visited Khloé and his daughter on this trip to LA, but there is no evidence of it on social media, which is surprising considering how much Khloé usually shares. A reunion between daughter and father would have made for some great Insta story content.\n\nAll of this comes amid rumors that Tristan and Khloé have finally called it quits, and while nothing is officially confirmed, their breakup is seeming like more and more of a given.\n\nFebruary 14, 2019: Tristan sends Khloé lavish Valentine's Day gifts\n\nSo, the world is still pretty confused about Khloé and Tristan's relationship status, and his V-Day gift to her didn't really help clear anything up. The basketball player sent Khloé a gorgeous floral display for the romantic holiday, which she shared on her Instagram story.\n\nInstagram\n\nYes, it is super sweet, but Khloé showed off the gift among the dozens of other treats that she got from her family and various brands, not really singling it out in any special way. She also captioned the pic, \"Daddy and baby True,\" which makes me think that that's all she thinks of him these days. Not in a romantic way, but as True's dad. That's it.\n\nThe two didn't celebrate the holiday together either. Khloé seemed to spend all day with True, opening gifts and enjoying some V-Day treats, while Tristan was most likely in Cleveland (he had a home game the day before). So, while their Valentine's Day celebration (or lack thereof) definitely doesn't clear anything up regarding their relationship status, I'm taking it as a sign that things aren't going well.\n\nFebruary 13, 2019: New details emerge about the status of Khloé's relationship with Tristan\n\nRemember Tristan Thompson? It may have been a while since you last heard that name so let me refresh your memory. He is the father of Khloé's baby, True, and he allegedly cheated on Khloé literally days before True was born. While Khloé and Tristan have spent the last ten months working on their relationship since the scandal, he has been MIA recently, so has the pair officially broken up?\n\nAccording to People, Khloé \"rarely talks about\" Tristan, which obviously isn't a sign that things are going well. \"Khloé and True are happy in Los Angeles,\" a source told the site. \"They spend very little time in Cleveland, where Tristan is. She very much acts like a single mom.\"\n\nWhen Khloé celebrated True's ten-month birthday, Tristan was nowhere to be found. In fact, the two haven't been seen together in a month.\n\nKhloé seemingly is doing just fine without Tristan these days. \"Her whole life is True,\" the source told People. She also just got a gorgeous new haircut, which is the telltale sign of a breakup, if you ask me.\n\nJanuary 16, 2019: Khloé's sisters, Kourtney and Kim, share their thoughts on Tristan's cheating scandal\n\n\n\nIt seems like the Kardashian sisters are divided over whether or not Khloé should've stayed with Tristan Thompson after his cheating scandal.\n\nWhile playing Plead the Fifth on Watch What Happens Live, Kourtney was asked whether or not she would've stayed with Tristan Thompson if she were in Khloé's shoes. Instead of pleading the fifth, Kourtney revealed that she would've stayed with him and Kim opened up about how she doesn't agree with her decision.\n\n\"From seeing everything that happened. It's so easy and quick to be like, 'Oh my god, leave him. Leave him.' It's so much harder to stay and have the whole public think you're an idiot for staying,\" Kim said.\n\nAndy Cohen and Khloé started laughing since it seemed like Kim was calling her an idiot. Talk about AWKWARD. Check out the clip below:\n\nJanuary 2, 2019: Khloé and Tristan have a complicated start to the New Year\n\nNew year, same drama. Khloé Kardashian and Tristan Thompson are back for another complicated 365 days of cheating scandals, dramatic Instagram story quotes, and lots of baby pics. The couple rang in the New Year together at a party in Cleveland, and there was a fair share of evidence showing them having a good time.\n\nInstagram\n\nOf course, it wasn't all love and laughs for this complicated couple. The Shade Room recently posted a video of Khloé grinding on Tristan on the dance floor, while Tristan straight up gives her the cold shoulder. Of course, Khloé was not happy and the whole exchange is super awkward.\n\nSo, there's a really good chance that Tristan just didn't see Khloé (because who could deny her, did you see how good she looked??), but of course, it's Khloé and Tristan so fans always assume the worst.\n\nIn the rest of the pics from the night, the pair seemed to be having a good time, so maybe we assume should best intentions on Tristan's part?\n\nHere's to what hopefully is a drama-free year for the couple!\n\nDecember 24, 2018: Tristan missed out on Khloé's family's annual Christmas Eve party\n\nWhile True Thompson and Khloé Kardashian stole the show in matching outfits at the annual Kardashian Jenner Christmas Eve party this year, Tristan was nowhere to be found. Don't worry, though, because there's actually a totally reasonable explanation for why he missed the party.\n\nAccording to E! News, Tristan \"doesn't have a lot of flexibility\" when it comes to his basketball schedule. He had a game on the 23rd and 26th, which didn't leave a lot of time to head to LA for the party.\n\nWhile Khloé could have spent Christmas in Ohio with Tristan, it was important for her to be with family for the holidays, especially after she missed Thanksgiving in LA to be with him.\n\nRelated Story Inside the Wild 2018 Kardashian Christmas Party\n\n\"There was nothing more special than seeing True with her cousins on Christmas morning,\" a source told E!. \"There was no way she was going to miss the family Christmas Eve party and being a part of opening presents all together on Christmas morning.\"\n\nDecember 7, 2018: Khloé and Tristan reportedly considering having another baby\n\nThings between Tristan and Khloé are MUCH better these days, so much so that Khloé is even considering getting pregnant again with the basketball player.\n\n\"Now that she's a mom, Khloé's never been happier,\" a source told Entertainment Tonight. \"She has wanted this baby more than anything and motherhood has proven to be even more incredible than she imagined.\"\n\nApparently, the couple is in \"such a good place now\" after spending Thanksgiving together last month. \"Her relationship with Tristan is so good,\" said the source. \"They made it through some really dark times, but she's happy that she gave him a second chance because he's stepped up and is not only an amazing father to True, but he's been such a rock for Khloé. They're really just so in love.\"\n\nThey're doing so well, that Khloé wants to start trying for a second kid. Getting pregnant with True wasn't easy and Khloé is \"aware it may take some time again,\" so she doesn't want to wait too long.\n\nIn other Kardashian news, Kylie is also interested in having baby number two with her bae, Travis Scott.\n\n\"Kylie and Travis are going to wait until he's finished his [Astroworld] tour before trying for another baby,\" ET's source said. \"They want to have another child soon so it's close in age to Stormi, but they do not want to do this while he's busy on the road.\"\n\nSince their first kids were born just months apart, and seem to have a close relationship, the sisters are apparently excited about the prospect of getting pregnant together again.\n\n\n\n\n\n\n\n\"Kylie and Khloé would love to be pregnant together again. And it seems like the timing could work out that way,\" said the source. \"It was a real bonding experience for them, but more importantly, it’s been amazing for their daughters to be so close in age. There are so many kids/grandkids in that family, that's really where the family's attention is. It's all about the next generation.\"\n\nNovember 26, 2018: Khloé and Tristan celebrate Thanksgiving together\n\nKhloé and Tristan had a quiet Thanksgiving together, as she joined him in Ohio for the big holiday. While many fans were questioning why Khloé decided to not be with her sisters for Thanksgiving dinner, she quickly shut down the haters with a couple of tweets.\n\nKhloé also had to defend her sister Kendall on Friday night after she booed Tristan during a basketball game, where she was cheering on the Philadelphia 76ers' with Ben Simmons.\n\nA fan called out Khloé for her being okay with Kendall booing him during the game, but still supporting Tristan after he cheated on her.\n\nDespite what people believed to be a shady interaction between Kendall and Tristan, the two of them were all smiles when they saw each other at the game.\n\nMitchell Leff // Getty Images\n\nThe Cleveland Cavaliers ended up winning the game, so it's safe to say that the two of them are even now.\n\nNovember 18, 2018: Khloé and her sisters tell the story of True's birth\n\nKeeping Up with the Kardashian's retelling of True's birth confirmed what we already knew: that the baby's delivery, which occurred just days after it was revealed that Tristan had cheated of Khloé, was awkward af.\n\nNot only were there some savage moments from Khloe's sisters (Tristan saying \"girls change your life,\" with Kourt responding, \"we can only pray.\" AMEN), but there was also so much tension.\n\ngiphy\n\nAfter the ep aired, Khloé shared a pic from the occasion on her Instagram story, and you can feel the awkwardness in the photo, let me tell you.\n\nInstagram\n\n\"This is one of the most awkward photos I have seen in a long time,\" she wrote about the pic. \"You can feel the tension lol but it makes me laugh for some reason. I am definitely one of those people that when I am uncomfortable I nervously laugh. Welcome to my labor lol.\"\n\nWe're glad she can laugh about it because all we can manage is a cringe.\n\nNovember 15, 2018: Sources claim all is well between Khloé and Tristan despite speculation of him cheating\n\nForget what you heard because Khloé and Tristan are reportedly doing very well despite breakup rumors. A source told TMZ that the couple is \"still together and going strong.\" According to the site, Khloé hasn't been in Cleveland because she's filming a new season of Keeping Up With The Kardashians, and then she wanted to stay with her family this past week amid the California fires.\n\nThe reality star will be heading to Ohio soon, however. She plans to spend Thanksgiving with Tristan and True in Cleveland as a family.\n\nThis all comes as the cheating episodes of KUWTK are airing on TV, episodes which Tristan refused to watch. But hey, if they're doing better, why relive the past?\n\nNovember 7, 2018: Tristan refuses to watch 'KUWTK' episodes centered around him cheating on Khloé\n\nWhile Tristan Thompson seemed to have no issue cheating on Khloé Kardashian when she was nine months pregnant back in April, he has no interest in reliving the experience through Keeping Up with the Kardashians.\n\nAccording to Us Weekly, when Khloé asked Tristan if he wanted to watch the KUWTK episode that addressed the cheating scandal, \"the response was a firm no.\" Apparently, while Khloé already screened the ep before it aired, she wanted to watch it live with her boyfriend.\n\nTristan has a lot of other things to worry about. A source close to him told Us that \"he is focused on basketball, and the Cavaliers are struggling this season.\" Watching the episode would only create further distractions, and \"there wasn't any need for that.\" Of course, he could have not cheated on her in the first place, then this issue wouldn't exist at all.\n\nOctober 29, 2018: Khloé and Tristan reconcile\n\nKhloé and Tristan seem to be back on good terms after Khloé's recent vacation with Kim and their kids.\n\nThe two of them returned from their big trip to Bali and Khloé had a very special surprise waiting for her at home when she got back. Tristan got her some special balloons to welcome her back and Khloe was super excited to share them on her Instagram story\n\nInstagram\n\nSoon after, she posted another photo of a quote that seemed to be hinting at a reconciliation.\n\nInstagram\n\n\"Please stop overthinking life like you have an answer to every feeling or situation. That's not how life works We figure it all out by just living, by f*cking up, by missing an. opportunity, by seeking advice and not taking it. We learn what's important and what isn't. Sometimes we have no f*cking idea what to do and it's scary but it's okay. Always trust your gut and know that everything will work out exactly the way it is supposed to be. It always does. Relax, we were never in control anyway.\"\n\nOctober 23, 2018: New reports surfaced about Khloé and Tristan's relationship\n\nSix months after Tristan's first cheating scandal, which occurred just a few days before the birth of their child, True Thompson, Khloé finally \"seems over Tristan,\" according to People.\n\nThis feeling has manifested itself in her move to Cleveland, which she hasn't rescheduled, despite postponing it three weeks ago. \"It doesn’t seem to bother her that she isn’t with Tristan in Cleveland,\" said People's source. \"She seems to know what she wants in her life right now. And it definitely doesn’t seem like she wants to be with Tristan.\"\n\nAs far as their future, however, Khloé hasn't yet made a decision. \"Khloé isn’t saying that she and Tristan split. It seems she hasn’t decided yet what she wants to do about their relationship,\" the source said. \"And she seems fine about this.\"\n\n\n\nOctober 6, 2018: Khloé reportedly postpones her move to Cleveland following new cheating allegations\n\n\n\nAfter a week of posting emotional Instagrams amid new rumors that Tristan Thompson is once again cheating, Khloé Kardashian has postponed her move to Cleveland. Khloé was planning on returning to Ohio to live with Tristan as the basketball season begins, but, according to People, this is no longer the case.\n\n\"It’s of course difficult to trust someone 100 percent who cheated days before he was about to become a dad,\" said People's source. \"Khloé still struggles with this sometimes. She wants to move back to Cleveland, but she isn’t sure what date she is [going]. The move is postponed for now. She seems very upset about leaving her family. She had the best summer in L.A.\"\n\nAll of this is happening as Keeping Up with the Kardashians is preparing to air the original cheating scandal, which occurred about six months ago, right before True Thompson was born. This has caused Khloé to become \"overwhelmed and exhausted,\" according to the source.\n\n\"Khloé has every reason to occasionally feel [that way],” they added. \"She’s a new mom, a first-time mom, and her TV show is currently replaying one of the most emotional times in her life. It’s a lot.\"\n\nSeptember 27, 2018: Khloé's sister Kim unfollowed Tristan on social media\n\n\n\nIt seems like we're about to get a lot more info on the Tristan cheating scandal and how Khloé's family reacted to the original news back in April. In a mid-season preview for Keeping Up with the Kardashians, Kim Kardashian is seen saying, \"They have another video of him.\" While we don't know for sure that she's referring to Tristan, the promo then switches to a pic of Khloé, who looks less than happy. So, we can assume Kim means the paparazzi got another vid of Tristan with a random girl.\n\n\"Unfollowed,\" says Kim, and we know she did, actually unfollow him on Instagram. \"I hate him. Sorry, not sorry.\" Khloé, on the other hand, seems more calm as she prepares to give birth to her baby, True. “The things I can control, I have to be able to control,\" she says.\n\nWe can't wait for the second half of KUWTK to see what Khloé's family thought about everything that went down with Tristan, though we already know they don't think too highly of him.\n\nSeptember 26, 2018: Tristan reportedly caught flirting with another woman\n\nTristan Thompson was, once again, spotted getting very close to not-Khloé at a club in LA recently. According to Us Weekly, \"Tristan and a girl were chatting and flirting throughout the night. They were very touchy-feely. He had his hand on her butt.\"\n\nKhloé, who will be moving back to Cleveland when basketball season kicks off, is apparently unbothered by the allegation. A source says that she believes Tristan, who promised to \"never betray her again.\"\n\nHer family, however, is not on the same page. \"Everyone is flabbergasted, but her family has learned to keep their opinions quiet,\" said a source. \"People underestimate the threshold of what she’ll put up with for love.\"\n\nSeptember 19, 2018: Khloé will reportedly move back to Cleveland during Tristan's upcoming NBA season with the Cavaliers\n\nIt looks like LA will be losing a Kardashian. Khloé plans to move back to Cleveland with Tristan for basketball season, which is about to start up again soon. While it's good to see that the couple will still be together while Tristan plays for the Cleveland Cavaliers, a source told People that the move will be hard on Khloe.\n\n\"He has games in October. They are all moving back to Cleveland, and it’s hard for Khloé. She will really miss Kris and her sisters,\" they told People.\n\nDespite the big move, the source said that they plan to make frequent visits back to LA to try to keep the family together.\n\n\"It’s not going to be easy for her,\" the source told People. \"But she is committed to keeping her family together. And Tristan has shown that he is committed to Khloé, so Khloé will make it work.\"\n\nWhile Khloé plans to make the big move, it looks like another Kardashian is staying put.\n\nKim doesn't plan to move to Chicago with Kanye, despite the fact that he recently announced that he will be moving back there soon.\n\n\"Kim plans on spending more time in Chicago, but she isn’t moving there full-time,\" a source told People.\n\nThe source also told People that Kim believes that a move wouldn't make sense for the kids right now and that it's likely that Kanye will change his mind and move back to LA soon.\n\n\"She will be supportive of Kanye’s plans and they do have a house in Chicago too. Kanye has a tendency though to change his mind quickly, so she is just going along with his plans because it makes him happy,\" the source said. \"Next week, something else might make him happier.\"\n\nAugust 1, 2018: Tristan shows Khloé's latest Instagram post some love\n\nDespite rumors that the couple isn't doing well, Tristan and Khloé seem to be doing just fine. Tristan even commented on Khloé's Instagram featuring pink and blue beach waves and the caption, \"take me please.\"\n\nTristan adorably responded to her photo by asking her, \"where do you want to go my love?\" While Khloé hasn't yet responded to the comment, her fans have been having a field day responding back to Tristan and reminding him of his cheating scandal.\n\n\n\nLooks like her fans aren't ready to forgive Tristan just yet, even though they are clearly trying to make it work.\n\nJuly 25, 2018: Khloé and Tristan are reportedly struggling\n\nIt looks like not everything is what it seems between Khloé and Tristan. The couple seems to be having trouble together and it looks like Tristan is the one that wants out of the relationship.\n\n“Khloé and Tristan are still not fully OK,” a source told US Weekly. “They act like they are when they’re in front of others, but it’s all a show at this point.”\n\n\n\nAccording to US Weekly, Tristan has stopped going to couples therapy with Khloé and has openly shared that he wants to move back to Cleveland.\n\n“Tristan is feeling trapped in a bad relationship,” another source said. “He’s no longer going with Khloé for sessions. He just didn’t feel it was helping to discuss s**t that happened months ago.”\n\nJuly 11, 2018: Khloé shares an adorable moment of Tristan dancing with True on social media\n\nTristan just couldn't wait to share a dance with baby True and, luckily for us, Khloé was right there to film the beautiful moment.\n\nKhloé shared a video on her Snapchat of the two sharing a father-daughter dance together. Khloé can be heard laughing in the background while watching them. Check out the adorable video below:\n\nJune 20, 2018: Khloé and Tristan will reportedly discuss the cheating scandal on the new season of Keeping Up With The Kardashians\n\nWhile Khloé and Tristan haven't been completely open about the cheating scandal that almost ruined their relationship, a source told UsWeekly that it will be addressed in the next season of Keeping Up With the Kardashians.\n\n\"They always discuss real life things on the show. They’ve never ignored a topic,\" a source told Us Weekly. \"It will definitely be brought up, but they don’t know how much. They can film hours about it, but in the end, Khloe is one of the executive producers and will have final say on what actually makes air.\"\n\nThe source also says that Tristan is upset that it will be talked about on the show, but Khloe has assured him that it will only be a small part of the season.\n\nJune 19, 2018: Khloé's family has reportedly forgiven Tristan\n\nThe Kardashian clan has officially forgiven Tristan for cheating on Khloé and he is planning to move to Los Angeles for the summer.\n\nAccording to Entertainment Tonight, Tristan is currently staying over at Khloé's house in Los Angeles in an effort to work on their relationship.\n\n“[Tristan] has a home in L.A. too, but the plan is to live together as a family at Khloe’s home as they continue to work on their relationship,” a source told Entertainment Tonight. “Everyone is back onboard -- friends, family, and Khloe have all forgiven him and are giving him this second chance -- and so far it’s been working for them.”\n\n\n\nKhloé and Tristan have been spending a lot of time together in Los Angeles. They recently went on a date night with sister Kendall Jenner and her rumored boyfriend, Ben Simmons, and they were seen together at a McDonald's drive-thru.\n\nJune 18, 2018: Khloé and Tristan enjoy a night out with the reality star's friends and family\n\nLooks like Tristan is in the City of Angels as he was spotted hanging out with Khloé at Dave Chappelle's private friends and family-only private show, taking a night off from being with baby True. E! News also reports that Kendall and her rumored boyfriend, Ben Simmons, also joined them. Later, they moved to Poppy nightclub, where they also met up with Kris and Corey Gamble, according to Entertainment Tonight . Despite them now being in Los Angeles together, there's still no word on whether Tristan will be moving in or if he is just visiting for now.\n\nJune 17, 2018: Khloé and True flew back to Los Angeles on Father's Day\n\nOn Father's Day, Khloé and baby True traveled from Cleveland to Los Angeles after the end of the NBA season. Kylie Jenner and Stormi Webster decided to give them a very special welcome back home with a teddy bear and balloons that said, \"welcome home, Khloé and True. Stormi and Kylie - we love you.\"\n\nAccording to E! News, the Kardashian family is very happy to see Khloe back in LA and that they'll see more of True.\n\n\"The whole family is thrilled that Khloé is home and that they will get to be close by and an everyday part of True's life. They made it a big celebration and welcome home for her.\"\n\nE! News also reported that Father's Day was going to be a rough day for Khloe and she specifically wanted to spend it with her sisters.\n\nTristan also took to Instagram to give a shout-out to his two children for Father's Day with two new necklaces with their names on them.\n\nThere's no word if Tristan will be moving out to Los Angeles to be with Khloé and True, but with the end of the NBA season, it's likely that he will also make the big move soon.\n\nJune 13, 2018: Khloé shares new footage of True\n\nKhloé shares a cute pic of her baby girl to celebrate her 2-month birthday. The photo is caption: \"Baby True.\" What a cutie!\n\nKhloé shared the first video of True (complete with a fun IG filter) for her 1-month birthday. If it continues like this, we'll have to set an alarm for the 12th of every month so that we can be sure to catch of new glance of Koko's cutie.\n\nKoko's pic of True comes right after sister Kylie swore off sharing pictures of her baby, Stormi. After receiving some negative comments about Stormi on Instagram, Kylie decided that she's not here for the trolls.\n\nAn insider told People:\n\n“Kylie felt so protective of her baby when she was pregnant. This is why she didn’t share any bump pictures while she was pregnant. After Stormi was born, Kylie was the proudest mom.”\n\n“She couldn’t wait to show off Stormi to her fans. She posted pictures, because she was so excited to be a mom. Unfortunately, social media is a crazy place. People have been making nasty comments.\"\n\n“Kylie is shocked and doesn’t want her daughter’s pictures to be a part of something negative. She might reconsider in the future, but for now, she won’t post any more photos of Stormi’s face.”\n\nJune 7, 2018: Reports claim Khloé's family isn't thrilled that she got back with Tristan\n\nDon't get it twisted: Just because Khloé seems to be back on with Tristan doesn't mean her family in on board. A source told People that Tristan will be returning to Cali with Khloe (and baby True in tow), but that the Kardashians aren't thrilled about it. Apparently, they are still \"very unhappy\" with him. “It will be interesting to see how they will treat him. Although Khloé defends him and her reasons to stay with him, her family feels she deserves much better,” the source told the outlet.\n\n\n\nJune 4, 2018: Reports claim Khloé is moving from Cleveland, where Tristan played for the Cavaliers, back home to Los Angeles\n\nKhloé and True are moving back to Los Angeles, according to a very reliable source, momager Kris Jenner. \"We go back and forth,\" Kris told E! News when asked how often she saw Khloé (who is currently in Cleveland). \"I FaceTime with her every day. So that's a lot of fun.... She'll be home soon.\"\n\nMay 31, 2018: Khloé's brother-in-law Kanye West namedrops Tristan in a song\n\nIn case you were wondering how Kanye felt about Tristan's cheating scandal, well, now you know. Kanye hosted a listening party for his new album \"Ye\" in Wyoming, and people immediately picked up on a reference to Tristan's cheating scandal in one of the songs.\n\n\n\n\"All these thots on Christian Mingle / That’s what almost got Tristan single / If you don’t ball like him or Kobe / Guarantee that bitch gon’ leave you,\" he says.\n\n\n\nFans were shook, to say the least.\n\nMay 30, 2018: Khloé replies to a negative commenter on Twitter\n\nSounds like Tristan is throwing himself a bit of a pity party. A source told Us Weekly that Tristan is \"completely emotionally and physically exhausted from the cheating allegations and of course the playoffs.\" Ok, yes, the playoffs are a big deal, but is he seriously complaining about the drama that he started?! Unbelievable.\n\n\n\nBut that's not all we have to report on this drama-filled day. Khloé took to Twitter and clapped back at a woman who shared some pretty judge #WednesdayWisdom, concerning the cheating scandal.\n\n\"A year from now @khloekardashian will be over all of this and feeling salty for her super passive IG posts. She’s just in the stage of “but I love him!” Until then let her pretend he’s changed and they’ll be a happy family. #WednesdayWisdom,\" the Twitter user wrote.\n\n\n\nKhloé responded, \"Babe that’s not wisdom at all because you’re assuming you know who I’m talking about and you’re assuming you know my feelings. Assuming anything is anything but wisdom.\"\n\nMay 15, 2018: Khloé explains where her daughter's name came from\n\nKhloé gets real about who truly thought of the adorable name True for her baby girl. “My grandma MJ suggested True,\" the star wrote on her app. \"She told me it was my great-grandfather’s first name and my grandfather’s middle name. It stuck with me for my entire pregnancy and was the only one I couldn’t get out of my head.” So cute!\n\n\n\nMay 14, 2018: Khloé makes a subtle statement about reconnecting with Tristan\n\nKhloé (kind of, sort of) made her first statement regarding Tristan's cheating scandal. On her Instagram stories, she published the quote, \"It's all about who you look for in a crowded room. That's where your heart belongs.\" Khloé has posted quotes on Instagram before, but this one seems pretty intentional.\n\nMay 13, 2018: Khloé receives lavish Mother's Day flowers\n\nLooks like Khloé had a really good first Mother's Day! In case you missed it, she took to Snapchat and posted a cute pic of her True in honor of the holiday.\n\nOn her Instagram stories, she shared pics of a beautiful flower arrangement and \"KOKO\" balloons, which you can see, below. Now, the question is, who sent those gifts?! Was it Tristan Thompson or someone from the family, like Kris Jenner?\n\nInstagram\n\nInstagram\n\nInstagram\n\nMay 12, 2018: Khloé officially debuts baby True on Instagram\n\nKhloé finally introduced her daughter True to the world with a super cute video on Instagram. In the video, True is rocking a floral Snapchat filter and batting her adorable eyes at the camera. \"Happy One Month True,\" Khloé wrote.\n\nInterestingly enough, some fans think True looks a lot like her cousin, Stormi Webster (a.k.a. Kylie Jenner's daughter). Do you see the resemblance?\n\nMay 11, 2018: Khloé accidentally shares a glimpse of True for the first time\n\nEver since True's birth, fans have been anxiously awaiting the first pic of Khloe's darling baby girl. And that day has finally come... though it seems like it may have happened by accident!\n\nKhloé posted a few quick selfies on Snapchat. In them, she looks glam as hell, lying on her bed and rocking a camo sweatshirt. But, if you look at the corner of the image, you can spot baby True's tiny little hand.\n\nSnapchat\n\nTrue seems to be wearing a light pink and white onesie. And she just looks oh-so-cozy on her mama's chest. So precious.\n\nMay 10, 2018: Tristan reportedly blocked Khloé's sister Kim on social media\n\nApparently, Tristan blocked Khloe's sister Kim on social media after she addressed the cheating scandal during an episode of The Ellen Degeneres Show.\n\n\n\n\"Like, I don’t even know how to describe it other than it’s just so f*cked up,\" she said at the time. \"We really were rooting for Khloé. And we still are. She’s so strong and she’s doing the best she can. It’s a really sad situation all over.\"\n\nSince then, she has appeared on Live With Kelly and Ryan. Naturally, Ryan Seacrest wanted to hear her thoughts on all the drama, and so he asked, \"Is there any part of you that roots for Khloé and Tristan?\"\n\nShe responded, \"OK, last time I went on TV and I answered some questions about her I got blocked on social media—and not from Khloe. So, I'm going to...yes, I'm always rooting for her. I'm always rooting for love. I'm always rooting for families.\"\n\nInteresting answer, Kim. Very interesting.\n\nAlso, details about what went down in the delivery room continue to come to light. Apparently, before baby True broke through with her cry, someone else had a breakdown in the hospital room.\n\n\"Khloé has completely forgiven Tristan for cheating on her, and it really wasn’t hard for her to do because he literally broke down crying in her hospital room after she had given birth to True,\" a source tells Us Weekly. \"Tristan was absolutely devastated that he had hurt and betrayed Khloé. Adding to the grief, was of course the timing of when it all came out, the days before she gave birth.\"\n\nAnd it sounds like Tristan doesn't think that getting caught was necessarily a bad thing. \"Khloé has always said that everything happens for a reason, but absolutely loves Tristan,\" the source says. \"He actually told Khloé he was relieved that it had come out and that he thinks subconsciously he wanted to get caught.\" The source went on to say that he \"knew there were paparazzi taking pics of him in New York City, but that didn’t stop him from taking a woman back to his hotel.\"\n\n\n\nMay 9, 2018: Tristan talks about life with a new daughter\n\nTristan finally opened up about his daughter True while on the basketball podcast Road Trippin. He revealed that she has green eyes and was born 21-inches long. Later on, he explained the difference between raising his first-born, Prince, and True.\n\n\n\n“I think with a girl, you’re just so much more emotionally like… with a boy, it’s just like, ‘Hey man, you’ll be all right man. Stop crying,'” he explained. “But [with True], it’s like, ‘True, it’s gonna be okay. You know, we’re right here. Daddy’s here to feed you. It’s me! Look, yeah!’ It’s way different, but it’s fun, though. It changes you.”\n\n\n\nFor the record, there's a lot of good that can come from parents letting their sons express a range of emotions, but looks like Tristan has a different perspective on that.\n\nMay 8, 2018: Khloé and Tristan go on a date\n\nAccording to TMZ, Khloé and Tristan go out to see an afternoon movie together at a theater a few miles outside of Cleveland. The outlet says that they looked \"very much like a couple again.\" They were seen buying snacks in the theater lobby and leaving in the same car after.\n\nThis movie outing comes at the same time that reports about how Khloe's family feels about the whole situation start to surface. According to TMZ, the Kardashians are \"outraged\" over Tristan's cheating scandal. However, they hope Khloé will remain civil with Tristan for True's sake. \"We're told the family privately feels they may never forgive Tristan, but they're not going to attempt to torpedo the relationship,\" the site wrote. Well, let's hope everyone can keep the peace.\n\n\n\nMay 7, 2018: Sources confirm the truth about Khloé and Tristan's decision to name their daughter True\n\nSome fans thought Khloé naming her daughter True was ironic given Tristan's cheating scandal, but a source told Us Weekly Khloé and Tristan had picked their baby girl's name way before the news broke.\n\n\n\n“True had already been picked for a while,” the source said. “She went into labor not even knowing the full scope of the cheating so the option of changing her name wasn’t even brought up. It’s too much for one person to deal with during the crazy time.”\n\n\n\nThe source added, “A lot of people thought she’d change the name and were waiting to send her gifts. Everything that Khloe bought during her pregnancy was already monogrammed True.”\n\n\n\nMay 5, 2018: Khloé shows up to Tristan's basketball game\n\nAccording to E! News, Khloé reportedly attended Tristan Thompson's basketball game, in which the Cleveland Cavaliers played against the Toronto Raptors. An eyewitness told the outlet Khloé arrived a little bit into the first quarter but stayed until the end. Throughout the game, she was cheering, clapping, and interacting with the fans around her. And as you might expect, she looked fabulous AF.\n\n\n\n\"She had her hair done and red lipstick on. She wore black aviators inside the whole game, only taking them off once to powder her face,\" the source said.\n\nMay 4, 2018: Khloé and Tristan reunite after he allegedly cheated on her\n\nAccording to Us Weekly, Khloé and Tristan are “fully back together.” An insider told the site that Khloe has seen all of the photos and videos of Tristan with other woman. Yet, she's still in love with him.\n\nThe insider also said Khloé feels “the whole world is against Tristan.” The Kardashian-Jenner family might the exception to that claim, but only for Khloe's sake.\n\n“Those around Khloé are trying to be as supportive to her as they can. It’s hard because if everyone distances themselves from Tristan, they’ll risk losing Khloé,” the source said. “Luckily there’s this buffer time. She always planned to stay in Cleveland for the first three months. Now with Tristan in the playoffs for possibly another month, no decision needs to be made right now.”\n\n\n\nMay 2, 2018: Khloé reportedly changes her Instagram settings after Tristan's scandal\n\nReports say Khloé disabled Instagram comments on every pic that includes Tristan. If you haven't noticed, you can see for yourself, below.\n\nInstagram\n\nHowever, the comments section on the photos that don't include Tristan has stayed the same.\n\nInstagram\n\nAlthough it's not clear when Khloé disabled the comments, it's probably safe to assume the change was made because of Tristan's cheating scandal. Many fans have been defending Khloé, but it's likely she wanted to keep the drama away from her feed. Meanwhile, fans are still posting hateful messages on Tristan's Instagram account.\n\n\n\nApril 29, 2018: Tristan makes first Instagram post after cheating scandal\n\nTristan finally broke his social media silence, but failed to address any of the cheating allegations. Instead, he celebrated his team's victory over the Indiana Pacers in an Instagram post. In the caption, he wrote, \"\"WHAT AN ATMOSPHERE IN THE Q!! GREAT WIN #OnToTheNextOne.\" Meanwhile, people defended Khloé Kardashian in the comments section.\n\n\n\n\"KHLOE BETTER BE ON TO THE NEXT ONE TOO 👋🏼,\" one fan wrote.\n\nApril 24, 2018: Reports surface about how Khloé is moving on after Tristan's cheating allegations\n\nEntertainment Tonight reports that an exclusive source says that Khloé is \"not in a bubble of denial. She knows what's going on and is still trying to process it, but so far, she's managed to move past it and look forward.\"\n\nThe source says that five women have come forward with cheating allegations. Some claim they had months-long affairs with Tristan and one woman even said she slept with him the night before Khloé's baby shower.\n\n\n\nEven with these reports, the insider says Khloé is set to stay put in Ohio... at least for now.\n\n\"Khloé is very settled in Cleveland right now and is planning on staying another few weeks to a month at least. Of course, that could change, especially since every day there seems to be more stories out about Tristan.\"\n\n\n\nApril 19, 2018: Tristan leaves Cleveland for the first time after welcoming baby True\n\nAccording to People, Tristan left Cleveland and made his way to Indianapolis, where he and his team (the Cleveland Cavaliers) will play against the Indiana Pacers in the NBA playoffs. This is reportedly the first time Tristan has left Cleveland since Khloe gave birth to their daughter, True.\n\nAlthough Khloé and her newborn daughter remain in Ohio, they will reportedly head to L.A. once they receive doctors' approval to fly. Given Tristan's recent cheating scandal, the move seems only natural.\n\nApril 16, 2018: Khloé shares her daughter's name\n\nIn a super pink Instagram post, Khloé announced that her and Tristan's baby girl was named True Thompson. So cute!\n\n\n\n\"Our little girl, True Thompson, has completely stolen our hearts and we are overwhelmed with LOVE. Such a blessing to welcome this angel into the family! Mommy and Daddy loooooove you True!,\" she wrote.\n\nApril 12, 2018: Khloé and Tristan welcome their daughter\n\nKhloé gives birth to her and Tristan's baby girl. TMZ and E! News confirm the delivery with a source close to the couple. Kris and Kim reportedly flew to Cleveland to be by KoKo's side during the labor. ET reported that Kourtney and best friend, Malika Haqq, were in the delivery room when Khloe gave birth. Khloé reportedly arrived at the hospital on Wednesday night. Whether Tristan was present in the delivery room or not has yet to be confirmed, though TMZ also reported today that Kardashian would allow him in the delivery room with her.\n\nET's source says that Tristan has been \"apologetic and begging for forgiveness\" since the scandal.\n\nApril 11, 2018: Tristan is accused of cheating on Khloé\n\nTristan Thompson is accused of cheating on Khloe Kardashian after videos of him getting intimate with several different women hit the web. First, the NBA player was spotted kissing a woman at a rooftop bar called PH-D in Manhattan. The woman is believed to be Instagram model Lani Blair. Footage obtained by TMZ also shows Tristan arriving at his hotel, after leaving the bar, with a mystery woman.\n\nTMZ\n\nThen, surveillance footage from October 2017 (when Khloe was three months pregnant) is released. It shows Tristan getting cozy with two women at a club outside of Washington D.C.\n\nNeither Khloe Kardashian nor Tristan Thompson have commented on his alleged cheating, Page Six reports Khloe \"went absolutely ballistic\" on Tristan when she found out. She was “devastated when she saw the pictures of Tristan with that girl, she went absolutely ballistic at him,\" a source close to the Kardashian family reportedly said. \"She is not only hurt, she is humiliated and worried for their child. How could he do this, and so publicly, when their baby daughter could arrive within a week?”\n\n\n\nApril 9, 2018: Reports claim Khloé flew to Cleveland to give birth\n\nAccording to a report by TMZ, Khloé Kardashian is in Cleveland waiting to go into labor with boyfriend Tristan Thompson by her side.\n\nMarch 15, 2018: Khloé drops a hint about the first letter of the name she plans to give her baby\n\nFans wonder if Khloe and Tristan's baby will keep up with the Kardashian tradition of having a \"K\" first name. After Twitter tosses the question back and forth, Khloe decides to weigh in. \"I think im going with a T,\" she writes.\n\nMarch 11, 2018: Khloé and Tristan attend their baby shower\n\nKhloé and Tristan throw a very pink baby shower to celebrate their first daughter. According to People, the shower was sponsored by Amazon Baby Registry at the Hotel Bel-Air in Los Angeles.\n\nIn a sweet Instagram post, Khloe writes...\n\n\"💕 Where do I even begin?!?! How do I even begin to give thanks and praise to ALL of the people who took part in helping create the most incredible baby shower? @jeffleatham and his ENTIRE team and @mindyweiss and her ENTIRE team, THANK YOU for creating the most magical memories I get to keep for the rest of my life!!! WOW, is truly all I can say! They say “love is in the details”, I couldn’t agree more! Look at all the LOVE! From my mommy’s hand written Baby Thompson sign to each and every flower placed. Love was involved! I wish I could post every single picture! I’m still dreaming 💕\"\n\nMarch 9, 2018: Khloé and Kris go shopping for the new baby\n\nIt's reported that Kris Jenner and Khloé Kardashian are spotted shopping for baby gear at Petit Tresor and Couture Kids. Kris reportedly pays a whopping $8,000 for all the nursery items.\n\n\n\nMarch 4, 2018: Khloé discovers her baby's gender\n\nOn the season finale of Keeping Up With the Kardashians, Kylie Jenner helps reveal that Khloe is having a girl! Khloé has her gynecologist give Kylie the news first, and then Kylie calls Khloé to tell her that a baby girl is on the way. Khloé is shocked (she thought she was having a boy).\n\nFebruary 16, 2018: Tristan Thompson is accused of cheating on Khloé with two women\n\nAccording to a report by Us Weekly, Tristan Thompson was not acting like someone with a pregnant girlfriend during NBA All-Star weekend.", "images": ["https://hips.hearstapps.com/hmg-prod/images/lead-image-kardashian-01-1634846843.png?crop=0.502xw:1.00xh;0.258xw,0&resize=180:*", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1550683731-Partner-in-crime.jpg", "https://hips.hearstapps.com/hmg-prod/images/kris-jenner-and-khloe-kardashian-are-seen-on-june-15-2022-news-photo-1657814031.jpg?crop=1.00xw:0.679xh;0,0.0396xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2022-02-10-at-10-02-46-am-1644505987.png?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/kim-kardashian-attends-the-tiah-4th-annual-fundraiser-at-news-photo-1661969683.jpg?crop=1.00xw:0.668xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2022-01-24-at-10-41-39-am-1643039616.png?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1413338821-1-1662993024.jpg?crop=1.00xw:0.801xh;0,0.0513xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/image-from-ios-1625766705.png?crop=1.00xw:0.422xh;0,0.169xh&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/image-from-ios-5-1614023379.png?crop=1.00xw:0.410xh;0,0&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/img-9739-1658759314.jpg?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/kendall-jenner-and-devin-booker-attend-the-nba-2k-launch-news-photo-1662729282.jpg?crop=1.00xw:0.668xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1188903916-1-1662561609.jpg?crop=1.00xw:0.667xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/khloe-kardashian-koko-balloons-1526310523.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/hulu-1663858049.png?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/jaden-smith-kendall-jenner-and-hailey-baldwin-attend-march-news-photo-1664978073.jpg?crop=0.601xw:0.900xh;0.0521xw,0.100xh&resize=180:*", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1550683685-Kylie-Cosmetics-Matte-Lipstick-Woods.jpg", "https://hips.hearstapps.com/hmg-prod/images/165512-7146-e658dd58-1664889952.jpeg?crop=1.00xw:0.668xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/khloetristan-1652104698.jpg?crop=0.998xw:0.407xh;0.00160xw,0.106xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2022-01-04-at-9-30-32-am-1641306658.png?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2018-12-26-at-11-42-30-am-1545842625.png?crop=0.772xw:0.521xh;0.178xw,0.0108xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/image-from-ios-1652105966.jpg?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/lead-image-side-by-side-2-02-16-1663684456.jpg?crop=1.00xw:1.00xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/khloe-kardashian-tristan-thompson-1540827368.jpeg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/img-9740-1658759268.jpg?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/khloe-kardashian-mommy-1526310418.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/khloe-2-1542710810.png?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/image-from-ios-22-1551209565.png?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/khloe-true-snapchat-photo-png-1525996456.png?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/khloe-kardashian-instagram-story-1657547287.png?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/giphy-1542710950.gif?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/image-from-ios-2-1655824943.jpg?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/khloe-kardashian-instagram-flowers-1526310473.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/kendall-jenner-is-seen-on-august-24-2022-in-los-angeles-news-photo-1661527336.jpg?crop=0.564xw:0.403xh;0.221xw,0.0664xh&resize=180:*", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1550683654-kylie-and-jordyn-cosmetics-1550683646.jpg", "https://www.seventeen.com/_assets/design-tokens/seventeen/static/images/logos/network-logo.21081f5.svg", "https://hips.hearstapps.com/hmg-prod/images/travis-scott-and-kylie-jenner-attend-the-premiere-of-news-photo-1657122221.jpg?crop=1.00xw:0.782xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2018-04-11-at-4-33-45-pm-1523478937.png?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2022-01-04-at-9-30-41-am-1641306701.png?resize=480:*", "https://hips.hearstapps.com/vidthumb/images/20220405-khloe-1649179699.jpg?crop=1.00xw:1.00xh;0,0&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2019-02-15-at-10-39-23-am-1550245267.png?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/khloe-kardashian-instagram-1540827524.jpeg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/kendall-jenner-hugs-tristan-thompson-of-the-cleveland-news-photo-1064647834-1543250265.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/khloe-kardashian-selfie-1525293234.png?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/khloe-kardashian-arriving-for-lunch-at-the-abbey-of-san-news-photo-1664981897.jpg?crop=0.572xw:0.381xh;0.239xw,0.0391xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/khloe-kardashian-instagram-1525293110.png?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2019-01-02-at-12-20-29-pm-1546449676.png?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1550683710-unspecified_85eb7f94-e973-4f2f-976d-46a18f4330b1.jpg", "https://hips.hearstapps.com/hmg-prod/images/kim-kardashian-west-of-the-justice-project-speaks-onstage-news-photo-1665099501.jpg?crop=0.670xw:1.00xh;0.0897xw,0&resize=180:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/khloetristan-1652104698.jpg?crop=0.998xw:0.407xh;0.00160xw,0.106xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.seventeen.com/celebrity/celebrity-couples/a19747317/khloe-kardashian-tristan-thompson-relationship-timeline/", "title": "Khloé Kardashian & Tristan Thompson Relationship Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Khloé Kardashian & Tristan Thompson Relationship Timeline - Tristan Khloe Cheating Scandal Explained", "description": "Learn the details of every moment of Khloé Kardashian and Tristan Thompson's relationship with this timeline, from when they first met to the numerous cheating rumors.", "keywords": "Khloe kardashian, tristan thompson, khloe kardashian tristan thompson, khloe kardashian tristan thompson relationship, khloe kardashian tristan thompson pregnant, khloe kardashian tristan thompson baby, khloe kardashian tristan thompson dating, khloe kardashian tristan thompson cheating, tristan thompson khloe kardashian age difference, jordyn woods tristan thompson,", "theme-color": "#000000", "og": {"site_name": "Seventeen", "title": "Khloé Kardashian Explains Why She's \"Letting Go\" of the Tristan Thompson Drama", "description": "\"It only hurts me by holding onto all this stuff,\" she said on Hulu's \"The Kardashians.\"", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/khloetristan-1652104698.jpg?crop=0.998xw:0.407xh;0.00160xw,0.106xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.seventeen.com/celebrity/celebrity-couples/a19747317/khloe-kardashian-tristan-thompson-relationship-timeline/", "type": "article"}, "fb": {"app_id": 112965278727107, "pages": 8028997215}, "article": {"publisher": "https://www.facebook.com/seventeen", "section": "Celeb Couples", "modified_time": "2022-10-06T15:14:50Z", "published_time": "2022-10-06T15:04:00Z"}, "twitter": {"site": "@seventeen", "image": "https://hips.hearstapps.com/hmg-prod/images/khloetristan-1652104698.jpg?crop=0.998xw:0.407xh;0.00160xw,0.106xh&resize=640:*", "card": "summary_large_image"}, "google-site-verification": "uQMdsrh02fvs6lNVGcB04v0iEtK1MpGMQ3UF-Fy0RVI", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/khloetristan-1652104698.jpg?crop=0.998xw:0.812xh;0.00160xw,0.0869xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/khloetristan-1652104698.jpg?crop=0.998xw:0.812xh;0.00160xw,0.0869xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/khloetristan-1652104698.jpg?crop=0.998xw:0.812xh;0.00160xw,0.0869xh", "auto-publish": "never", "sailthru.excerpt": "Since Khloé Kardashian and Tristan Thompson started dating in 2016, the couple has been consistently on-again, off-again. While the pair is not together anymore following the news that Tristan fathered a child with Maralee Nichols, things are said to be “okay” between the reality star and NBA player. According to", "sailthru.tags": "celebrity,Celebs & Entertainment,celebrity-couples,Celeb Couples", "sailthru.date": "2022-10-06 15:04:00", "sailthru.socialtitle": "Khloé Kardashian Explains Why She's \"Letting Go\" of the Tristan Thompson Drama", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 45}, "movies": [], "publish_date": 1665068640.0, "source": "https://www.seventeen.com", "summary": ""}