{"url": "https://en.wikipedia.org/wiki/Melania_Trump", "text": "First Lady of the United States (2017–2021), model, and businesswoman\n\nMelania Trump ( mə-LAH-nee-ə; born Melanija Knavs [mɛˈlaːnija ˈknaːws],[tone needed] Germanized as Melania Knauss [meˈlaːni̯a ˈknaʊs]; April 26, 1970) is a Slovene-American former model and businesswoman who served as First Lady of the United States from 2017 to 2021, as the wife of 45th President Donald Trump.\n\nTrump grew up in Slovenia (then part of Yugoslavia), and worked as a fashion model through agencies in the European fashion capitals of Milan and Paris, before moving to New York City in 1996. She was associated with Irene Marie Models and Trump Model Management. In 2005, she married the real estate developer and TV personality Donald Trump and gave birth to their son Barron in 2006. Later that year, she became an American naturalized citizen. She is the second naturalized woman—after Louisa Adams—and the first non-native English speaker to become first lady.[a]\n\nEarly life, family, and education\n\nMelanija Knavs was born in Novo Mesto, Yugoslavia, now part of present-day Slovenia, on April 26, 1970.[3][4] Her father, Viktor Knavs (born March 24, 1944), was from the nearby town of Radeče and managed car and motorcycle dealerships for a state-owned vehicle manufacturer.[5][6] Her mother Amalija (née Ulčnik) (born July 9, 1945) came from the village of Raka and worked as a patternmaker at the children's clothing manufacturer Jutranjka in Sevnica.[7][8] As a child, Melanija and other children of workers at the factory participated in fashion shows that featured children's clothing.[9] She has an older sister, Ines, who is an artist and her \"longtime confidant\",[10][11][12] and an older half-brother—whom she reportedly has never met—from her father's previous relationship.[13][14]\n\nKnavs grew up in a modest apartment in a housing block in Sevnica, in the Lower Sava Valley.[15][16] Her father was in the League of Communists of Slovenia, which espoused a policy of state atheism.[17] As was common, however, he had his daughters secretly baptized as Catholic. When the Trumps met Pope Francis at the Vatican in 2017, Melania brought her rosary and asked the Pope to bless it.[18][19]\n\nWhen Knavs was a teenager, she moved with her family to a two-story house in Sevnica.[20] As a high-school student, she lived in a high-rise apartment in Ljubljana. She attended the Secondary School of Design and Photography in the city,[21] and studied architecture and design at the University of Ljubljana for one year before she dropped out.[22][23][24]\n\nCareer\n\nMelania Trump at QVC Red Carpet Style Party, 2011\n\nKnavs began modeling at five years old and started doing commercial work at sixteen when she posed for the Slovenian fashion photographer Stane Jerko.[25][26] When she began working as a model, she adapted the Slovene version of her last name \"Knavs\" to the German version \"Knauss\".[27] At eighteen, Knauss signed with a modeling agency in Milan, Italy.[28] In 1992, she was named runner-up in the Jana Magazine \"Look of the Year\" contest, held in Ljubljana, which promised its top three contestants an international modeling contract.[3][29] After attending the University of Ljubljana for one year,[30] Knauss modeled for fashion houses in Paris and Milan, where in 1995 she met Metropolitan Models co-owner Paolo Zampolli, a friend of her future husband Donald Trump, who was on a scouting trip in Europe. Zampolli urged her to travel to the U.S., where he said he would like to represent her.[9] In 1996, Knauss moved to Manhattan.[9][29][28][31] He arranged for her to share an apartment with photographer Matthew Atanian in Zeckendorf Towers in Union Square.[9]\n\nKnauss was featured in a sexually explicit photo shoot for the January 1996 issue of Max, a now-defunct French men's magazine, with Emma Eriksson, another female model.[32] She also posed nude for the January 2000 UK edition of GQ magazine, appearing on the cover naked except for diamond jewelry, reclining on fur, aboard Trump's custom-fitted Boeing 727.[33] Asked about the photos in 2016, Donald Trump said: \"Melania was one of the most successful models, and she did many photo shoots, including for covers and major magazines. [The Max photo] was a picture taken for a European magazine prior to my knowing Melania. In Europe, pictures like this are very fashionable and common\".[34][35]\n\nIn 2010, Melania launched her own line of jewelry, Melania Timepieces and Jewelry, for sale on QVC.[36] She also marketed a Melania Marks Skin Care Collection at high-end department stores.[37][38] According to a financial filing in 2016, her businesses brought in between US$15,000 and US$50,000 in royalties that year.[39] In 2017, the two manufacturers of her jewelry and skincare products under license said they had terminated their relationship with her.[38] On inauguration day her companies and products were listed in her official White House biography but were quickly removed.[36] A White House spokesperson said her companies are no longer active and \"the First Lady has no intention of using her position for profit and will not do so\".[38]\n\nIn 2021 she launched a non-fungible token endeavour.[40]\n\nAcquisition of United States citizenship\n\nDonald Trump and Melania Knauss in 1999\n\nKnauss came to the United States from Slovenia in 1996 on a visitor's visa and was paid for 10 modeling jobs during the seven weeks before she obtained an H-1B work visa[41] (this was illegal under the terms of said visa). In March 2001, while she was dating Donald Trump, she was granted permanent residency under the EB-1 program for people with \"extraordinary abilities\".[42] According to information from the Migration Policy Institute, only 2 percent of people in their field would be expected to qualify.[43] The Washington Post in 2018 reported that at that time Knauss's credentials included \"runway shows in Europe, a Camel cigarette billboard ad in Times Square and—in her biggest job at the time—a spot in the swimsuit edition of Sports Illustrated, which featured her on the beach in a string bikini, hugging a six-foot inflatable whale\".[42][43][44] In the analysis by Joel Gunter of the BBC, \"[Melania Trump] does not appear at the time to have excelled in a niche area of modelling, nor won awards or had her work written about in significant publications\"; Gunter reports a conjecture that\n\n[S]he may have been boosted by high-profile testimonial letters, said Nita Upadhye, a U.S. immigration specialist at NNU Immigration Law. Testimonials form part of the application, and the more high-profile the reference the more weight it carries. If Mrs. Trump, already dating Mr. Trump at the time she applied, secured letters from luminaries in fashion, that would be significant, Ms. Upadhye said.[42]\n\nDuring the months that she campaigned with her husband prior to his successful bid for the presidency, Melania Trump defended his hard-line on immigration practices and laws by stating that her own path and achievement of citizenship had been legal, unlike those of the individuals her husband was campaigning against. However, investigative reporting done by the Associated Press revealed that she had been paid for 10 modeling jobs she had done before she had obtained her H1-B work visa and was still living in the U.S. using her visitor visa. The Associated Press wrote that\n\nForeigners are not allowed to use a visitor visa to work for pay in the United States for American companies. Doing so would violate the terms of that visa and could prohibit a foreigner from later changing his or her immigration status in the United States or bar the foreigner from the United States again without special permission to come back.[41]\n\nAfter she became a citizen in July 2006,[1] Trump sponsored her parents, Viktor and Amalija Knavs, using the \"chain migration\" immigration process that her husband later repeatedly criticized.[45][46] The Knavs became citizens in August 2018, five years after they acquired permanent residency.[45][47]\n\nRelationship with Donald Trump\n\nEarly relationship\n\nIn September 1998, Knauss met then-real estate mogul Donald Trump at a party, and the couple began dating[48] while the latter was in the process of divorcing his second wife, Marla Maples. The divorce was finalized in 1999.[49][50] Knauss continued her modeling career[9] with her American magazine cover shoots, including In Style Weddings,[51] New York magazine, Avenue,[52] Philadelphia Style,[53] and Vanity Fair Spain.[54] In 1999, the couple gained attention after a lewd interview with shock jock Howard Stern on his show.[6][55]\n\nThey appeared together while Trump campaigned for the 2000 Reform Party presidential nomination. When asked by The New York Times what her role would be were he to become president, she replied: \"I would be very traditional, like Betty Ford or Jackie Kennedy\".[56]\n\nMarriage\n\nThe two became engaged in 2004. On January 22, 2005, they married in an Anglican service at the Episcopal Church of Bethesda-by-the-Sea in Palm Beach, Florida, followed by a reception in the ballroom at her husband's Mar-a-Lago estate.[57][58] The marriage was her first and his third. The event was attended by celebrities such as Katie Couric, Matt Lauer, former New York City mayor Rudy Giuliani, Heidi Klum, Star Jones, P. Diddy, Shaquille O'Neal, Barbara Walters, Conrad Black, Regis Philbin, Simon Cowell, Kelly Ripa, Senator Hillary Clinton, and former President Bill Clinton.[58][59] At the reception, Billy Joel serenaded the crowd with \"Just the Way You Are\" and supplied new lyrics to the tune of \"The Lady Is a Tramp\".[58] The bride wore a US$200,000 dress made by John Galliano of the house of Christian Dior,[58] and the ceremony and reception were widely covered by the media,[31] including a Vogue cover which featured her in her wedding gown.[60]\n\nOn March 20, 2006, she gave birth to their son, Barron William Trump.[61] She chose his middle name, while her husband chose his first name.[62] She also has four stepchildren, stepsons Donald Trump Jr. and Eric Trump and stepdaughter Ivanka Trump from Donald’s first marriage to Ivana Zelníčková. She has another stepdaughter, Tiffany Trump from his second marriage to Marla Maples.\n\nRole in 2016 presidential campaign\n\nMelania gives the thumbs up at a campaign event with her husband Donald and son Barron, November 2015.\n\nIn November 2015, she was asked about her husband's presidential campaign and replied: \"I encouraged him because I know what he will do and what he can do for America. He loves the American people, and he wants to help them\".[63] She played a relatively small role in the campaign, which is atypical of spouses of presidential candidates.[64][65][66] According to Washington Post's Mary Jordan, however, Melania was one of Trump's biggest supporters and continues to be a sounding board to him.[67]\n\nIn 2016, Melania told CNN her focus as first lady would be to help women and children. She also said she would combat cyberbullying, especially among children.[68] In July 2016, her official website was redirected to trump.com. On Twitter, she stated that her site was outdated and did not \"accurately reflect [her] current business and professional interests\".[69]\n\n2016 RNC and plagiarism concerns\n\nOn July 18, 2016, Melania Trump gave a speech at the 2016 Republican National Convention. It contained a paragraph that was nearly identical to a paragraph of Michelle Obama's speech at the 2008 Democratic National Convention.[70][71][72] When asked about it, Melania said she wrote the speech herself \"with as little help as possible\".[73] Two days later, Trump staff writer Meredith McIver took responsibility and apologized for the \"confusion\".[74] Melania was again accused of plagiarizing Michelle Obama's speeches when, as part of her \"Be Best\" campaign in 2018, she gave a speech that appeared to closely echo remarks by Michelle Obama in 2016 and also distributed a written pamphlet that was nearly identical to one published by the Obama administration in 2014.[75][76]\n\nLawsuit against Daily Mail and General Trust\n\nIn February 2017, she sued Daily Mail and General Trust, the owner of the Daily Mail, a British tabloid, seeking US$150 million in damages over an August 2016 article that alleged that she had worked for an escort service during her modeling days. The lawsuit stated the article had ruined her \"unique, once-in-a-lifetime opportunity\" to establish \"multimillion dollar business relationships for a multi-year term during which Plaintiff is one of the most photographed women in the world\".[77] Her claim raised potential ethical questions with its implication that she intended to profit from being first lady.[78] On February 18, 2017, the lawsuit was amended, removing the language about her earning potential and focusing instead on emotional distress.[79] In April 2017, the parties settled the lawsuit and the Daily Mail issued a statement that said, \"We accept that these allegations about Mrs. Trump are not true and we retract and withdraw them.\" The Mail agreed to pay her US$2.9 million.[80][81]\n\nStatement on bullying\n\nFive days before the election, she told a crowd of supporters in Pennsylvania: \"Our culture has gotten too mean and too rough, especially to children and teenagers. It is never okay when a 12-year-old girl or boy is mocked, bullied, or attacked. It is terrible when that happens on the playground. And it is absolutely unacceptable when it is done by someone with no name hiding on the Internet\".[82] Regarding the contrast of her platform with her husband's use of Twitter during his campaign, Melania said shortly after the election that she had rebuked him \"all the time\" but that \"he will do what he wants to do in the end\".[83]\n\nFirst Lady of the United States (2017–2021)\n\nDonald and Melania at the Liberty Ball on Inauguration Day, January 20, 2017\n\nShe assumed the role of first lady of the United States on January 20, 2017,[84][85] continuing to live in Manhattan at the Trump Tower with their son, Barron, until the end of his 2016–2017 school year at Columbia Grammar & Preparatory School.[86][87] A 2020 biography by Washington Post reporter Mary Jordan revealed that Melania stayed in New York to negotiate more favorable terms in her prenuptial agreement from Trump for her and their son.[67]\n\nOf Trump's inauguration, Vogue compared Melania's wardrobe to those of Jacqueline Kennedy and Nancy Reagan, writing that Melania closely works with her stylist, designer Hervé Pierre, preferring \"strongly tailored pieces\" in bold colors and wearing almost exclusively high-end designers.[88][89]\n\nShe and Barron moved into the White House in Washington, D.C., on June 11, 2017.[90] Her Secret Service code name is \"Muse\" (beginning with the same letter as Trump's code name, \"Mogul\", per Secret Service tradition).[91] She is the second foreign-born woman to hold the title of first lady, after Louisa Adams, wife of John Quincy Adams, who was born in 1775 in London to a father from Maryland and an English mother.[92][93] She is also the first naturalized citizen (rather than birthright citizen) to hold the title, and the first whose native language is not English.[94] Though it has frequently been reported that Trump speaks up to five foreign languages fluently, evidence has shown that when speaking French or Italian, her speech has been limited to basic greetings.[95]\n\nAccording to an unauthorized biography, she was well-liked by her staffers, is cordial to Ivanka Trump, and is not close to Mike Pence's wife, Karen Pence.[96]\n\nOn March 8, 2017, she hosted her first White House event, a luncheon for International Women's Day. She spoke to an audience of women about her life as a female immigrant, and about working towards gender equality both domestically and abroad, noting the role of education as a tool against gender inequality.[97][98][99]\n\nIn January 2018, The Wall Street Journal reported that during a three-month period when she lived in New York in 2017, she took Air Force jet flights between New York City, Florida, and Washington at a cost of more than US$675,000 to taxpayers.[100][101] In comparison, former first lady Michelle Obama's solo travel cost an average of about US$350,000 per year.[100][101]\n\nMelania Trump express her condolences to the family of El Paso shooting victims Jordan and Andre Anchondo on August 7, 2019.\n\nOn March 13, 2018, Trump scheduled a March 20, 2018 meeting with policy executives from technology companies, including Amazon, Facebook, Google, Snap, and Twitter, to address online harassment and Internet safety, with a particular focus on how those issues affect children.[102] Trump's office has avoided the use of the term \"cyberbullying\",[102] and Trump has come under criticism for championing Internet civility while her husband's Internet behavior has been noted as uncivil.[102][103] Trump attended the roundtable event, focusing on how children are affected by modern technology. Trump said: \"I am well aware that people are skeptical of me discussing this topic\", but \"that will not stop me from doing what I know is right\".[104]\n\nMelania took an active role in planning the Trump administration's first state dinner on April 23, 2018, to honor French president Emmanuel Macron.[105] With Brigitte Macron, the French president's wife, Trump visited a Paul Cézanne exhibit at the National Gallery of Art in Washington the day before.[106][107][108]\n\nOn June 17, 2018, Melania referred to the Trump administration's \"zero tolerance\" policy at the border with Mexico, where children were being separated from their parents. She stated that she \"hates to see children separated from their families\" and wants there to be \"successful immigration reform\".[109] On June 21, 2018, she made a hastily planned trip to Texas to one of the locations at which the Trump Administration's family separation policy was being carried out. She attended a roundtable with doctors, medical staff, social workers and other experts at Upbring New Hope Children's Shelter.[110] On the way to the border facility, she caused controversy by wearing a jacket that read, \"I don't really care, do u?\" After much speculation about the jacket's message, including criticism that she may have been expressing indifference toward the families separated at the border, Trump stated that the jacket was aimed at people and left-wing media who were criticizing her.[111]\n\nIn October 2018, Trump took a four-nation, solo tour of Africa, without her husband, focusing on conservation and children and families, visiting Ghana, Malawi, Kenya, and Egypt.[112]\n\nOn November 13, 2018, Trump issued an \"extraordinary\" public statement calling for the firing of Deputy National Security Advisor Mira Ricardel. She had reportedly been privately pushing for her ouster for weeks.[why?] The next day it was announced that Ricardel would \"transition to a new role within the Administration\".[113] It was described as unusual for a first lady to be publicly involved in White House personnel decisions.[114]\n\nAfter the El Paso shooting in Texas on August 3, 2019, in which a lone gunman killed 23 people and injured 23 others, Melania and President Trump visited the hospital where eight of the survivors were being cared for. The couple met with the families of survivors, hospital staff, and first responders, and posed with a baby who had been orphaned when both of his parents were killed. The White House had asked that the child be brought in and he was accompanied by his uncle.[115][116][117]\n\nMelania ended her tenure by agreeing with Donald that he was the legitimate winner of the 2020 election, despite his loss. She did not contact incoming first lady Jill Biden to make transition arrangements or provide her the traditional tour of the White House.[118] Melania never felt comfortable in Washington, reported The New York Times, citing people who knew her.[118]\n\nOn October 1, 2020, Stephanie Winston Wolkoff, a former friend and senior adviser to the first lady released audiotapes, on the CNN show Anderson Cooper 360°, of Melania allegedly expressing controversial and profane statements regarding her frustration with the media, her image and role as first lady.[119][120] The Trump Justice Department filed a civil suit against Wolkoff in October 2019, alleging breach of a nondisclosure agreement, which the Biden Justice Department dropped in February 2021.[121]\n\nBe Best campaign\n\nThe Trumps at the announcement of the First Lady's Be Best initiative, May 2018\n\nOn May 7, 2018, Trump formally started the Be Best public awareness campaign, which focused on well-being for youth and advocated against cyberbullying and drug use.[122] The campaign was accompanied by a booklet that was promoted as having been written \"By First Lady Melania Trump and the Federal Trade Commission [FTC]\", but it was nearly identical to a document first published in 2014 by the FTC.[123] The similarities prompted accusations of plagiarism, to which her office responded by admonishing the press for reporting on the issue.[124] The fact-checking site Snopes found the charge of plagiarism \"Mostly False\" saying, \"Melania Trump did not claim she had written the pamphlet herself, and she contributed an introduction to a slightly revised version of the booklet. The FTC was always credited for the creation of the booklet and supported its inclusion in the first lady's 'Be Best' campaign.\"[125]\n\nIn December 2019, Be Best became a trending topic on Twitter, after Melania's husband Donald used Twitter to mock teenage environmental activist Greta Thunberg. A week before the incident, Melania had criticized academic Pamela Karlan for making comments about Barron, stating that: \"A minor child deserves privacy and should be kept out of politics\".[126]\n\nApproval ratings\n\nDuring her husband's 2016 campaign, Trump was the least popular presidential candidate spouse in modern polling.[127] As First Lady, she managed to improve her favorability ratings from 2016 to mid-2018.[128] She reached a peak of 57% approval in May 2018 per CNN polling, shortly after her first state dinner, and her presence at the funeral of former first lady Barbara Bush without her husband Donald.[129] In December 2018, CNN reported that Melania's strongest base of support came from older, white, male Republicans and conservatives, while she had the least approval from women who were young or college-educated.[130]\n\nIn March 2019, YouGov reported that Melania, with 51% approval, was polling more popularly among the American public than other members of her family: her husband Donald, step children Donald Jr., Eric, and Ivanka, and her stepson-in-law Jared Kushner.[131] In August 2020, Morning Consult, in conjunction with Politico, reported that Melania, with 45% approval, was polling more favorably among the American public than any other Republican figures listed in the survey, including her family members, Vice President Mike Pence, Senate majority leader Mitch McConnell, and House minority leader Kevin McCarthy.[132]\n\nIn Gallup's annual poll of the most admired women, Trump ranked in the top ten each of her years as first lady, but never topped the list. She joins Bess Truman and Lady Bird Johnson as the only American first ladies who have never been named the most admired woman in this survey since Gallup began conducting the annual survey in the 1940s.[133]\n\nMelania finished her tenure in 2021 as the least popular first lady ever polled, according to polling by CNN, SRSS, and Gallup. Her final approval rating was 42%, and her final disapproval rating was 47%; she was the only first lady who finished with a net disapproval rating. Previous first ladies since the 1970s had final popularity ratings of 71% on average. The second-least popular first lady polled was Hillary Clinton, with a final approval rating of 52% and a final disapproval rating of 39%.[134]\n\nPersonal life\n\nReligion\n\nWhen the president and first lady visited Vatican City in May 2017, she identified as Catholic. She was the first Catholic to live in the White House since President John F. Kennedy and his wife Jacqueline and was the second Catholic first lady of the United States.[135][136] When she visited the Vatican, Pope Francis blessed her rosary beads, and she placed flowers at the feet of a statue of Mary at the Vatican's children's hospital.[137]\n\nHealth\n\nOn May 14, 2018, she underwent an embolization, which is a minimally invasive procedure that deliberately blocks a blood vessel,[138] in order to treat a benign kidney condition. The procedure was reported successful and without complications.[139]\n\nOn October 2, 2020, President Trump tweeted that both he and Melania had tested positive for SARS-CoV-2 and would immediately quarantine.[140][141][142] Later that day, she said that she was experiencing \"mild symptoms\" but \"overall feeling good.\"[143]\n\nCultural depictions", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/21px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Melania_Trump_official_portrait.jpg/220px-Melania_Trump_official_portrait.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Melania_Knauss-Trump_signature.svg/128px-Melania_Knauss-Trump_signature.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Donald_Trump_Pope_Francis_Melania_Trump_in_2017.jpg/220px-Donald_Trump_Pope_Francis_Melania_Trump_in_2017.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/BathingSuit1920s.jpg/21px-BathingSuit1920s.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Bill_Clinton_and_Donald_Trump_at_the_U.S._Open_in_2000%2C_Flushing_Meadows%E2%80%93Corona_Park.jpg/220px-Bill_Clinton_and_Donald_Trump_at_the_U.S._Open_in_2000%2C_Flushing_Meadows%E2%80%93Corona_Park.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/8/82/Melania_Trump_official_portrait.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/First_Lady_Melania_Trump_speaking_in_2015_%28cropped2%29.jpg/220px-First_Lady_Melania_Trump_speaking_in_2015_%28cropped2%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/0/01/A_coloured_voting_box.svg/19px-A_coloured_voting_box.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Flag_of_New_York_City.svg/21px-Flag_of_New_York_City.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Flag_of_Slovenia.svg/21px-Flag_of_Slovenia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Melania_Trump_2011.jpg/170px-Melania_Trump_2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/President_Trump_and_the_First_Lady_in_El_Paso%2C_Texas_%2848491139652%29.jpg/220px-President_Trump_and_the_First_Lady_in_El_Paso%2C_Texas_%2848491139652%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Donald_Trump_and_Melania_Trump_at_Liberty_Ball_Inauguration_2017.jpg/221px-Donald_Trump_and_Melania_Trump_at_Liberty_Ball_Inauguration_2017.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Donald_and_Melania_1999.jpg/170px-Donald_and_Melania_1999.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Coat_of_arms_of_the_President_of_the_United_States.svg/70px-Coat_of_arms_of_the_President_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Donald_Trump_and_Melania_Trump_at_the_announcement_of_the_First_Lady%E2%80%99s_Be_Best_initiative.jpg/220px-Donald_Trump_and_Melania_Trump_at_the_announcement_of_the_First_Lady%E2%80%99s_Be_Best_initiative.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/8/82/Melania_Trump_official_portrait.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Melania_Trump", "title": "Melania Trump", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Melania_Trump_official_portrait.jpg/640px-Melania_Trump_official_portrait.jpg", "width": 640, "height": 962}, "title": "Melania Trump - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}