{"url": "https://people.com/music/demi-lovato-overdose-everything-we-know-whats-next/", "text": "Demi Lovato‘s journey to recovery continues.\n\nAlmost a month after revealing she had relapsed, the pop star, 25, was hospitalized following an overdose on July 24.\n\nLovato has battled addiction, mental illness and disordered eating for years. In 2010 she entered a Chicago-area rehab facility, where she was treated for bipolar disorder, bulimia, self-harm and addiction. She relapsed after she left the treatment center, then entered a sober living facility for a year.\n\nThis March, the former Disney star revealed she had celebrated six years of sobriety. But in April rumors of a relapse swirled, and on June 21, Lovato confirmed she had fallen off the wagon in “Sober,” a heartbreaking ballad about her recent relapse.\n\nBelow, a look at the days leading up to Lovato’s overdose, what happened on Tuesday — and what’s next.\n\nJordan Strauss/Invision/AP/REX/Shutterstock\n\nThe Initial Spiral\n\nPer sources, Lovato has been struggling with her sobriety for months.\n\n“You could tell when Demi was doing well with her sobriety because she wasn’t hanging out at clubs,” a source tells PEOPLE of Lovato’s recent activities. “She has still very much kept up her work schedule and daily life, but there have definitely been signs that she isn’t doing great with her sobriety.”\n\nIndeed, Lovato sparked questions regarding her sobriety (and romance rumors) when she was spotted leaving a club with pal G-Eazy early in the morning on July 15. Then, just two days before her hospitalization, the singer forgot the words to her relapse-inspired ballad “Sober” at a California concert, telling the audience: “F–k, I forgot the lyrics.”\n\nA separate source close to the situation told PEOPLE: “Things have been a total mess for months. She and her team severed ties, and they played a large part in getting her sober years ago. She hasn’t been in a good place.”\n\nA longtime friend told PEOPLE exclusively that Lovato had begun to buckle under the pressure to stay clean.\n\n“Demi never wanted to be a role model. Her sobriety over the last six years was a fight every single day,” says the friend. “After she finally got clean, her team was very hard on her and treated her like she was a kid. It’s so hard to have all these eyes on you all the time.”\n\nOver the last year, Lovato yearned for more freedom and “slowly started breaking away” from her tightly regulated life.\n\n“She is so young and she also has a very rebellious personality,” says the source. “She wasn’t drinking or using at first, but she’s even said herself that she can’t be in a [party] environment. She thought she could handle it, but it’s a very slippery slope.”\n\nThe Day of the OD\n\nOn July 24, PEOPLE confirmed Lovato was rushed to a hospital from her Hollywood Hills home around 11:30 a.m.\n\nIn audio of the 911 call obtained by TMZ, the caller, whom PEOPLE has identified as Lovato’s assistant, alerted the male dispatcher of the incident while requesting he tell paramedics to shut off the sirens.\n\n“You’re with the patient now?” the dispatcher inquired before the assistant calmly responded, “I was, I’m downstairs. There are other people [who] went in,” adding, “We just need to get somebody out here.”\n\nSoon after, he told her: “You should be hearing the sirens real soon.” However, the assistant did not want the sounds of the ambulance to be heard.\n\n“Wait, no sirens please, right?” she asked as the dispatcher said, “No, no, this is a medical emergency. I don’t have control over that. … This is definitely a medical emergency, and we need to get there as fast as possible.”\n\nThe call also revealed the pop star was unconscious upon the EMS’s arrival and revived with Narcan — an emergency medication to reverse the effects of a narcotic overdose. (The medication, which is sprayed into one nostril, is able to immediately restore normal breathing in someone who has overdosed on fentanyl, heroin and prescription painkillers for 30 to 90 minutes.)\n\nHours after the news of the hospitalization broke, PEOPLE confirmed Lovato was “stable.”\n\nMARK RALSTON/AFP/Getty\n\nOn the evening of July 24, her rep released the following statement, obtained by PEOPLE: “Demi is awake and with her family who want to express thanks to everyone for the love, prayers and support. Some of the information being reported is incorrect and they respectfully ask for privacy and not speculation as her health and recovery is the most important thing right now.”\n\nThe overdose came after a night of hard partying, another insider told PEOPLE.\n\n“She and her ‘friends’ were on a binger the entire night,” an insider told PEOPLE of the house party that continued after the group left Saddle Ranch. “The people she has been hanging around lately aren’t her real friends; they don’t have her best interests at heart. She’s pushed her true friends away.”\n\nChristopher Polk/Getty\n\nThe insider added: “She had to find creative and sneaky ways to get drugs because her team and those that really care about her really try to keep a close watch on her.”\n\nAccording to The Blast, Lovato and other people at her home were “uncooperative” with police and would not tell responders what drugs she took when questioned about her overdose. LAPD officers collected an “item of evidence” related to illegal drugs that is not typically associated with heroin, the outlet reports.\n\nAlthough the singer was initially on the mend after arriving at the hospital, within days she faced another health scare. “Demi wasn’t doing well over the weekend,” a source told PEOPLE on July 30. “She came down with a fever and showed signs of an infection. She is currently being treated for issues that are very common after a drug overdose. She will need to stay in the hospital for a few more days, but is expected to make a full recovery.”\n\nAmber Augustin\n\nHer Support System\n\nSince news of Lovato’s overdose broke, the pop star has received an outpouring of support from fans and friends (including longtime friend Nick Jonas and her ex Joe Jonas), as well as peers like Ariana Grande, Justin Bieber and Lady Gaga.\n\nE! News reported Tuesday that Lovato’s mom, Dianna De La Garza, and her 16-year-old half-sister, Desperate Housewives alum Madison De La Garza, were seen at the hospital that afternoon.\n\nAnd PEOPLE confirmed that the star’s ex, longtime love Wilmer Valderrama, 38, visited her in the hospital July 25.\n\n“He knew she was going through a tough time but he wasn’t prepared for this,” the source close to Lovato told PEOPLE.“He saw her through so many ups and downs and was her rock through some of her darkest moments. To see her back in such a sad and vulnerable place is heartbreaking for him.” Valderrama himself tweeted that he was “shocked” by the overdose.\n\nAnother source has told PEOPLE that Valderrama has been a constant presence by her side. “Wilmer has spent hours at the hospital with Demi every day,” said the source. “He seems very concerned about her.”\n\nLester Cohen/WireImage)\n\nWhat’s Next?\n\nLovato remained in the hospital for nearly two weeks.\n\n“She is doing okay, but is still being monitored,” a fourth source told PEOPLE, adding that it’s now “safe” for Lovato to leave the hospital if she is so inclined. “An overdose is something very serious and can cause organ failure. It’s important for her to make sure her body is recovering.”\n\n“Sometimes this situation is the best possible,” the fourth source said. “And most people using drugs are very confident they will never overdose. It’s easy to continue abusing when you can shrug your shoulders and tell yourself you have everything under control. After an overdose, you can’t claim this anymore. You had an overdose and there is no way to dismiss it. An overdose might need to happen for someone to understand that they really need help.”\n\nDavid Fisher/REX/Shutterstock\n\nAlthough she is expected to make a full recovery, it was at first unclear whether Lovato would seek treatment.\n\n“It’s too soon to say what the next steps are in terms of entering treatment,” a source close to Lovato tells PEOPLE. “Right now everyone is focused on getting Demi physically healthy.”\n\nAn additional source said that the Lovato family strongly wanted her to enter a treatment facility. “Demi’s family is pushing for rehab,” the source told PEOPLE at the time, adding that “they have looked into several options.”\n\nAn Lovato insider speculated to PEOPLE: “The thing about an addict is that you become so good at hiding it. She’s a really smart girl. When she had work commitments, she could pull it together. But that’s how she’s always been, and this might not be her rock bottom.”\n\nThe insider added at the time: “Demi has to want to get help. She can’t be forced into rehab or treatment. It won’t work.”\n\nAri Perilstein/Getty\n\nThen, on Aug. 3, PEOPLE confirmed Lovato agreed to return to treatment.\n\n“Demi is well enough to leave the hospital this weekend. She has agreed to rehab and will go straight to an in-patient facility,” a source told PEOPLE at the time. “It’s her choice to go to rehab. This is not anything that can be forced. She understands the severity of her overdose and the recovery has been very challenging for her. She wants to be sober. She wants to get help. She understands that it will take a lot of work and commitment to stay healthy, but this is what she wants.”\n\nOn Aug. 4, Lovato was released from the hospital to seek in-patient treatment, multiple sources confirmed to PEOPLE.\n\nJamie McCarthy/Getty\n\n“Demi left the hospital over the weekend. She will get continued care at an in-patient rehab facility,” a source told PEOPLE. “At the hospital, she was surrounded by family and friends that support her sobriety. They all want Demi to be the best she can. Demi is surrounded by a lot of love. She has people in her life that really care. She has a long journey ahead, but with all the love, her journey could absolutely be a positive one.”\n\nThen, on Aug. 5, a note from Lovato was posted to her Instagram.\n\n“I have always been transparent about my journey with addiction. What I’ve learned is that this illness is not something that disappears or fades with time. It is something I must continue to overcome and have not done yet,” the post read.\n\nShe added: “I now need time to heal and focus on my sobriety and road to recovery. The love you have all shown me will never be forgotten and I look forward to the day where I can say I came out on the other side. I will keep fighting,”\n\nOn Aug. 9, Lovato temporarily checked out her in-patient facility to seek additional treatment for mental health and substance abuse weeks after her overdose, PEOPLE confirmed.\n\nAs TMZ first reported, the pop star left her treatment facility and flew with her mom Dianna De La Garza late Thursday to Chicago, where to meet with a psychiatrist who specializes in mental health and sobriety for several days.\n\n“She’s in the midst of recovery,” a source told PEOPLE at the time. “It’s going to be a long road, and Demi knows that. Emotionally, it hasn’t been easy, but she’s doing okay.”\n\nAs for whether she’ll face any repercussions with the law? Legally, Lovato is in the clear.\n\nA spokesperson for the Los Angeles Police Department told PEOPLE the pop star is not under any form of criminal investigation; while the police spokesman would not elaborate further, officers reportedly did not find any drugs at the scene, nor would Lovato cooperate when asked what she had taken.\n\nIf you or someone you know is in need of help, please contact the SAMHSA substance abuse helpline at 1-800-662-HELP.", "images": ["https://people.com/thmb/FpW2uTe3y0SV55WO97LVk5X_NX0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/gettyimages-839958050-2000-13ce887b968b4fc3a061d3a5d32f4f37.jpg", "https://people.com/thmb/oEgIAn6y8dhdz7OvFAqALRDuQtE=/1231x2000/filters:fill(auto,1)/demi-lovato8-2000-dd0fb7bc0e32442fa25af92623c9d9b2.jpg", "https://people.com/thmb/Bw8zm5KatfpYLWaxC3ZVAQdPdOU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/demi-lovato-1-1-2000-1d821f4a98f648beb299c10c72b70412.jpg", "https://people.com/thmb/MaV2wY1j6W901F5nfzR4u8lDUY8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/shutterstock_editorial_9686568et_huge-2000-a71fc1615e1940848a9c2e72ff8f6d16.jpg", "https://people.com/thmb/ZDyw3D3lcw33Rjdqxw4Lxo8PimI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(664x0:666x2)/demi-lovato-7-2000-04b1d5bf14064b9b878bf070ed52458c.jpeg", "https://people.com/thmb/3rHWXfuinR_gaH2a0pnY9GTHMNc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(681x0:683x2)/demi-lovato-10-c6bf12f9eef4420f9f1bc0a0d738ec3a.jpg", "https://people.com/thmb/uUonNTFLc19D72ioCsLerS2VYrk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/demi-lovato-1-1-2000-1d821f4a98f648beb299c10c72b70412.jpg", "https://people.com/thmb/xVyBJZY0zFKveH7aaquLMZsj7jE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/ruby-demi-5e3b998841154cd09f4cc6cd51cc0ba2.jpg", "https://people.com/thmb/_yDLbV89T1qGoEqpC_SQQ-E3YzM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/shutterstock_editorial_9219345eg_huge-2000-6c97681124aa48bfa10f1c2b75981b91.jpg", "https://people.com/thmb/SYWL9VzHi3d_YEewiqXXPnmPbEE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(625x0:627x2)/wilmer-valderrama-2000-4df10bb15d6f4ca0b85300fc7a1cef26.jpg", "https://people.com/thmb/n9xkYeY4Kgz2Im_yXs4zWJ_Nd0Q=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/shutterstock_editorial_9168926o_huge-1-2000-a54ec5825c254387a9a82953303f19ff.jpg", "https://people.com/thmb/icMU9gRDsGDTxhwheKmARvgZ_4U=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/gettyimages-860347000-2000-d002112fe482468392cfe2950a251117.jpg", "https://people.com/thmb/OCuf4nKGG29HB22mxhIMUOS9IO0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/demi-family-1-f50463c936454e9790f638d57f46aefc.jpg", "https://people.com/thmb/36CXQV6df_QF2oukE8FCYnV8Dhg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/gettyimages-839958050-2000-13ce887b968b4fc3a061d3a5d32f4f37.jpg", "https://people.com/thmb/CrV-ElIMJae5SYfjE67mo4G0k70=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/demi-lovato5-f455a318f02340aca25f1ffaed5b5de3.jpg", "https://people.com/thmb/3WocmnR_lKia0w58rgsyZKKtJ4I=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(762x0:764x2)/demi-lovato3-7ec87a07754e4ec68c8f64056830b6ac.jpg", "https://people.com/thmb/CEL91gNyM-w-DDZ1m03-whW09Fo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(614x0:616x2)/demi-lovato8-2000-dd0fb7bc0e32442fa25af92623c9d9b2.jpg", "https://people.com/thmb/WMCWM5L-WOdqqQFSXndOwPSAgR8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/demi-lovato-7-2000-2e53a533da934aac9652d304b970ed2f.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/Pj4bNdBjm92b6aYtap4DY3lX6Ss=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/shutterstock_editorial_9686568et_huge-2000-a71fc1615e1940848a9c2e72ff8f6d16.jpg", "https://people.com/thmb/NSCCFv5ZxV_aOyJMrNquCYrzOz4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/gettyimages-876419284-2000-f927ce16581948b0ac46dfc37f90cad0.jpg", "https://people.com/thmb/CDUJksj8ygfw03CIBWlK3mTKyq8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/demi-lovato-1-2000-2ff719294bac46889ae71c1aed150d3d.jpg", "https://people.com/thmb/dP6PvyYrK1igzCx_bIf80nhg9KM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/gettyimages-876419284-2000-f927ce16581948b0ac46dfc37f90cad0.jpg"], "top_img": "https://people.com/thmb/oEgIAn6y8dhdz7OvFAqALRDuQtE=/1231x2000/filters:fill(auto,1)/demi-lovato8-2000-dd0fb7bc0e32442fa25af92623c9d9b2.jpg", "keywords": [], "authors": ["Jeff Nelson", "People Editorial Guidelines"], "canonical_link": "https://people.com/music/demi-lovato-overdose-everything-we-know-whats-next/", "title": "Demi Lovato Overdose: Everything We Know — and What's Next", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "The troubled pop star was hospitalized Tuesday following an overdose", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Jeff Nelson", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/music/demi-lovato-overdose-everything-we-know-whats-next/", "title": "Demi Lovato Overdose: Everything We Know — and What's Next", "description": "The troubled pop star was hospitalized Tuesday following an overdose", "image": "https://people.com/thmb/oEgIAn6y8dhdz7OvFAqALRDuQtE=/1231x2000/filters:fill(auto,1)/demi-lovato8-2000-dd0fb7bc0e32442fa25af92623c9d9b2.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Demi Lovato Overdose: Everything We Know — and What's Next", "description": "The troubled pop star was hospitalized Tuesday following an overdose", "image": "https://people.com/thmb/oEgIAn6y8dhdz7OvFAqALRDuQtE=/1231x2000/filters:fill(auto,1)/demi-lovato8-2000-dd0fb7bc0e32442fa25af92623c9d9b2.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}