{"url": "https://soyummy.com/i-made-chrissy-teigens-viral-twitter-banana-bread-and-life-will-never-be-the-same/", "text": "Exactly one year ago today, Chrissy Teigen asked for six brown bananas on Twitter and within seconds had half of Los Angeles frantically offering up their darkest, sweetest, most flaccid bananas. “If u have 6 BROWN bananas in the L.A. area, I will send my assistant to your home with a signed cookbook, John’s underwear and a Becca palette,” the social media queen and cookbook author posted. Turns out, Teigen was making banana bread for her second cookbook, Cravings: Hungry For More. The sequel came out on the 18th and does not disappoint. In it, you’ll find more of Teigen’s mom Pepper’s Thai recipes, bahn mi sandwiches I want to make every day for the rest of my life, yummy potato dishes with names like Crispy Potato Smashies (Smashies! I die!), and so much more. But most importantly, you’ll find her now iconic banana bread recipe called Twitter’s (and Uncle Mike’s) Banana Bread. Which I decided to make on Yom Kippur, no less (meaning: I couldn’t actually eat it until sundown, torture!).\n\nThis banana bread is unlike any other kind of banana bread I’ve made. And, fun fact, I’ve made a lot of banana bread. Usually I stick to the classic recipes (bananas, flour, cinnamon, some sugar, blah, blah), so when I read through Teigen’s recipe, I was rattled. It called for the aforementioned six brown bananas, vanilla instant pudding mix, shredded coconut, dark chocolate chunks, and no spices. “You guys, Chrissy’s banana bread doesn’t call for cinnamon and I’m nervous,” I wrote in my So Yummy editorial group chat. I fought against the deep, deep urge to throw in the tiniest dash of cinnamon, but ultimately followed the recipe exactly the way Teigen intended it to be followed.\n\nFirst of all, you definitely do need six bananas, so don’t cheap out and only get five.\n\nTeigen writes, “You will think you only need five because it looks like enough, but it will not be enough.” It’s true. Six mashed-up bananas was slightly too much, but if I only mashed five bananas, I would have come up short. Also: Teigen means it when she says BROWN bananas. I confess that I couldn’t wait for my bananas to completely wilt into into complete darkness — they were intensely spotted and still very, very sweet and easy to mash, though. If I were to do this over again, I would summon the patience to actually wait for those bananas to reach their browniest-brown potential.\n\nAnother tweak: I don’t own a bundt pan (nothing personal against bundt cakes, I just don’t like baking them), so I had to bake the bread in two separate 8 x 4-inch loaf pans. Which is fine, because I figured I’d probably screw up the first time around, and having a practice round made me feel safe. (Teigen prefers the bundt pan because she says the bread comes out more moist, but to be honest, the loaf pan did just fine!) In the directions, Teigen says to bake for 55 minutes to an hour — both of mine took a little over an hour. I set the timer for each one for 45 minutes, would check on it, tack on another 10 minutes, check again — basically until I felt confident that the banana bread was fully baked and my toothpicks came out clean. (Full disclosure: my oven is off by 15 degrees, so take all of that with a grain of sea salt.)\n\nThe results? OMFG, screw my banana bread with cinnamon.\n\nThis banana bread tastes more like a cake than a bread, so maybe this recipe isn’t for you if you feel like banana bread should feel more like a fruit serving. It’s sweet, the coconut adds texture and complexity, the vanilla instant pudding adds fluff, and the chocolate just takes it over. The. Edge. Neither ingredient is overpowering, which can be tricky when you’re making dessert with such a distinct flavor profile. In fact, I’m going to go ahead and say this is the best banana bread I’ve ever had — and the So Yummy editorial office all agrees.\n\nSlather some whipped butter on top, vanilla bean ice cream, or eat it plain. For breakfast the next day, toast it and pair it with a cup of coffee and know that life is pretty good.\n\nYou can get Chrissy Teigen’s new cookbook Cravings: Hungry For More on Amazon for $17.99!", "images": ["https://trc.taboola.com/1238670/log/3/unip?en=page_view", "https://soyummy.com/wp-content/themes/soyummytheme/legacy/assets/shopping1.gif", "https://wp-images-soyummy.s3.amazonaws.com/wp-content/uploads/2018/09/25023142/banana-bread.jpeg"], "top_img": "https://wp-images-soyummy.s3.amazonaws.com/wp-content/uploads/2018/09/25023142/banana-bread.jpeg", "keywords": [], "authors": [], "canonical_link": "https://soyummy.com/i-made-chrissy-teigens-viral-twitter-banana-bread-and-life-will-never-be-the-same/", "title": "I Made Chrissy Teigen’s Viral Twitter Banana Bread, And Now I Know What Love Is", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "I made Chrissy Teigen's Twitter Banana Bread, aka the best dessert of my life. It's sweet, moist, and unlike any kind of banana bread you've tried.", "og": {"locale": "en_US", "type": "article", "title": "I Made Chrissy Teigen's Viral Twitter Banana Bread, And Now I Know What Love Is", "description": "I made Chrissy Teigen's Twitter Banana Bread, aka the best dessert of my life. It's sweet, moist, and unlike any kind of banana bread you've tried.", "url": "https://soyummy.com/i-made-chrissy-teigens-viral-twitter-banana-bread-and-life-will-never-be-the-same/", "site_name": "So Yummy", "updated_time": "2019-02-27T21:55:46-08:00", "image": {"identifier": "https://wp-images-soyummy.s3.amazonaws.com/wp-content/uploads/2018/09/25023142/banana-bread.jpeg", "secure_url": "https://wp-images-soyummy.s3.amazonaws.com/wp-content/uploads/2018/09/25023142/banana-bread.jpeg", "width": 550, "height": 450}}, "article": {"publisher": "https://business.facebook.com/firstmediaeverandivy/?business_id=994419303964527", "tag": "twitter banana bread", "section": "Celeb", "published_time": "2018-09-21T14:00:53-07:00", "modified_time": "2019-02-27T21:55:46-08:00"}, "twitter": {"card": "summary_large_image", "description": "I made Chrissy Teigen's Twitter Banana Bread, aka the best dessert of my life. It's sweet, moist, and unlike any kind of banana bread you've tried.", "title": "I Made Chrissy Teigen's Viral Twitter Banana Bread, And Now I Know What Love Is", "image": "https://wp-images-soyummy.s3.amazonaws.com/wp-content/uploads/2018/09/25023142/banana-bread.jpeg"}, "msapplication-TileImage": "https://wp-images-soyummy.s3.amazonaws.com/wp-content/uploads/2021/10/30175007/cropped-favicon-270x270.png", "google-site-verification": "eNxZEqOrclkXqsRgDqKOH6rmYzOOsjyiAYX7NNOE9YQ"}, "movies": [], "publish_date": 1537563653.0, "source": "https://soyummy.com", "summary": ""}