{"url": "https://web.archive.org/web/20220826164742/https://www.babygaga.com/15-things-kris-jenner-has-done-to-protect-her-children/", "text": "Kris Jenner is one of the biggest names in the entertainment world today. A lot of people can say that the only reason why she is on the map is because of a certain “tape” that her daughter filmed well over a decade ago, but that might only be half the truth. While a lot of celebrities have managed to come and go, Kris Jenner and her Kardashian empire are still here today.\n\nCall it magic, call it shrewd business schools or just plain luck, Kris Jenner has done an excellent job of extending her family’s 15 minutes of fame to well over a decade.\n\nSurely, you can’t say that about everyone.\n\nThere’s just something about Kris that makes her so pretty good at what she does. And at the same time, she also does an incredible job of protecting her family. Let’s face it: the Kardashians have been put through the ringer many times. With that being said, we’ve got 15 different ways Kris Jenner has managed to protect her children throughout the years. At this point, it’s safe to say that she’s taken both a maternal and a paternal role for them. Check out our list below!\n\n15 She Protects Their Assets\n\nFirst and foremost, Kris Jenner protects her family’s wealth and their assets. There is no one and nothing that will ever get in the way of her and her bank account. Kris has got that on lockdown! She really is a tiger when it comes to her dollar bills. She won’t let any one of them go.\n\nPlus, do you know of any stage moms who can negotiate $150 million dollar contracts for her family’s reality television show? I didn’t think so either. Yet, that’s exactly what Kris Jenner did last year. Seriously, the woman is like a bulldog in the conference room. She gets what she wants and she certainly doesn’t allow anyone to get in her way.\n\nAccording to People Magazine, Kris’ life mantra is to do what you love. She has said, “You need something to be excited about when you wake up in the morning, and something that you’re doing that has a purpose. And if you do something that you love, and you have this amazing energy behind it, it’s like, it makes life so much better. And you can develop something, and create a career for yourself out of something that you love to do.”\n\n14 She Protects Their Hearts\n\nSure, we can talk all day about what kind of person Kris Jenner is when it comes to protecting her wealth and assets. That part is obvious. But while a lot can be said about Kris Jenner and the way she’s managed to direct her family, there’s another side of her that we don’t see very often: the raw side.\n\nAfter all, let’s not kid ourselves about the “reality” of reality television. Kris knows there are certain things that her audiences want to see and that’s why she delivers.\n\nBut at the same time, she is a caring, loving and wonderful mother who does what’s best for her family. If she didn’t, then the Kardashian and the Jenners wouldn’t be so close with one another. Needless to say, the writing is on the wall.\n\nSpeaking about motherhood, Kris once wrote this on Instagram, “Being a mother is by far the greatest blessing. My children are my most precious gifts and I am so beyond proud of each and every one of them. To my angels @kourtneykardash and @kimkardashian, it brings me so much joy to watch you raise my beautiful grandchildren. You are both such incredible mommies and you teach us all daily about patience, selflessness and unconditional love.”\n\n13 She Managed To Extend Their 15 Minutes This Long\n\nA lot of people have been asking the same question over and over again: when will the Kardashians time in the spotlight expire? Well, we can answer that question for you. It doesn’t look like it is going to happen anytime soon. Why? Because after ten years in the public spotlight, the Kardashians are still on fire. They still dominate all of the tabloid and gossip magazine headlines. They still make waves everywhere they go. Heck, even CNN reports on them from time to time. And you can all thank Kris Jenner for her hard work.\n\nThanks to her mom, Kim Kardashian is the next Paris Hilton.\n\nHere’s what E! has to say about it, “We recently celebrated the milestone 10th anniversary of ‘Keeping Up With the Kardashians’ on E! We have aired 13 wildly successful seasons of the franchise as well as 11 spinoffs, and Season 14 is off to a strong start. We are incredibly proud of our partnership with the Kardashians and they remain an important part of the E! family. We look forward to continuing our collaboration for years to come.”\n\n12 Her Lavish Empire\n\nYes, we do live in an era that is best known as the Kardashian Empire. Love them or hate them, there’s no denying that you can’t ignore them. Even if you have never turned on a television set in your life, chances are you’ve heard the name Kim Kardashian. Kris Jenner has done an outstanding job of turning her children’s fame into a business. And a successful business at that. They are currently the wealthiest people on reality television and even the world.\n\nIf there is one thing that she has always taught her children, it’s to associate with like-minded people. According to Evan Carmichael, Kris once put it this way, “A lot of how you live your life and how you succeed in life is who you associate yourself with, and who your friends are. And my parents taught me that my whole life, and I heard my friends’ parents say it, and then Robert Kardashian drilled it into my older four kids, most of their lives, and it just was ringing true, it’s like you associate and hang out with people that are like-minded, or that you want to be like. And then you go out and do it.”\n\n11 Their Carefully Crafted Image\n\nWhen it comes to the Kardashian and the Jenner clan, they know that their image means everything. Each and every time they step out in the spotlight, or just for a quick run out and about in Los Angeles, they know people are looking at them. They also know that they have to look a certain way in order for people to talk about them. This is another category in which Kris Jenner has excelled. But at the same time, this has also brought a lot of hurt.\n\nThe internet can really be a nasty place, especially when it comes to passing judgment. And this is something that the Kardashians know all too well. They have gotten harassed, criticized, bullied and just really dragged through the mud for the things they do and the things they wear in public.\n\nKris once opened up about all the online bullying that her family has endured over the years. She told People Magazine, “It's my grandchildren who I worry about because I have six of them; the oldest just turned seven, and my youngest is six months old, and they don't have a choice… And I worry, I do, because it is such a bullying environment.”\n\n10 Their Reality Television Show\n\nWhen Keeping Up With The Kardashians first aired on the E! network, no one really knew much about their family. Now, we can tell you their entire life stories.\n\nA lot of people can say a lot of things about Kris Jenner. But there’s no denying that she is one of the best businesswomen in the entertainment world. She has always taught her kids to show up to work prepared.\n\nAccording to E! Online, Kris once had this to say about her daughters Kendall and Kylie: “Kendall and Kylie are getting one of the most incredible business educations that I think is possible in the history of all little at that age, because they’re constantly, they go to their business meetings, there’s one business meeting they went to with Ryan Seacrest, and his whole team, Adam Sher and everybody. And they were at this long conference table, and after the meeting, Ryan was like, wow, that blew me away. They were amazing, because they show up, they are ready for the meeting, they’ve done their homework, and they’ve got all these things that they’re working on right now that’s going to blow you away when you hear about it in six months.”\n\n9 All The Media Accusations\n\nWe’ve said this before and we will certainly say it again: the media hates the Jenner and Kardashian family. They really want them to go away to celebrity oblivion already. But of course, Kris Jenner won’t let that. She’s here to stay, whether her critics like it or not. Her family has heard every nasty name in the book, but she’s taught the girls to roll with the punches. It might be abuse, but it’s not like they can’t handle it. At this point, they are pretty much used to it.\n\nSpeaking about all of the nasty allegations and the people who constantly put her family down, Kris had this to say to The Hollywood Reporter, “There’s definitely a lot of bullies out there,…The internet is a crazy place. There’s a lot of really miserable, unhappy, terrified, angry, bitter, nasty people out there that don’t have jobs or are hopeless or depressed and sad, and they can be a big, fat, important bully by going online and typing a really ugly statement to someone else that they’ve never even met before, that has feelings and a heart. And I thought, ‘Wow, what happened to just you know, ‘give peace a chance’? What happened to the ’60s?!’ I’m from a different generation — I’m, like, vintage.”\n\n8 She Won’t Let Anyone Break Them\n\nNow, a lot of people will probably debate this, but the Kardashian females are the definition of girl power. They are unbreakable, and that’s because Kris Jenner made them that way. Each time they get pulled down, they end up bouncing back stronger. Yet, Kris claims that’s not the case behind closed doors. She’s a totally different person.\n\nShe told The Hollywood Reporter in 2017, “I’m a lot softer than you would imagine. It stings sometimes when somebody says, ‘You’re so fat,’ or ‘You’re too old to be on social media,’ or ‘You look awful in that outfit’ — like, such silly, stupid things. You’re going, ‘Really?’ I’ll call up Kim and go, ‘Do I look that bad in that picture? Do I look fat?’\n\nShe also added, \"But I think the most hurtful thing is when people will say, ‘Oh, you’re just managing your kids — you’re getting money from your children’ or your family or whatever. I’m thinking, ‘Well, hell yeah! I mean, I’m trying to create a business here, and nobody has their best interest like I do. We all love working together and we love our situation. Why don’t you go worry about your own situation and go get a job yourself?’”\n\n7 She Is The Ultimate Momager\n\nWhen you think “momager” you think of just one person: Kris Jenner. She is the ultimate celebrity mom manager. Heck, she’s even managed to manage the careers of her children’s partners and spouses. That’s because she has one incredible work ethic. The woman works all hours of the day and night. She is determined to stay motivated and on the top for as long as she can. If you are part of the Kardashian family or connected in some way, consider yourself lucky. Because most likely Kris will manage you, too. That’s right!\n\nIf there is anything that Kris believes in, it’s hard work. She once said it like this, according to E!: “I’d raised four kids in this opulent lifestyle with this amazing, anything they wanted, there was never a fear of, a money thing, they had their very privileged lives, and so then when I got married the second time, and it wasn’t the same pocketbook, it was much different, and I was faced with, I’ve got to learn how to get it together, and so the fear was that I would disappoint anybody, because I am a people pleaser, but I’m also very, I have a strong will.”\n\n6 But She Does Admit To Having A Favorite Child\n\nYou’d think that Kris Jenner would have a difficult time trying to manage and juggle everything she does every day that has to do with her career, her celebrity image and of course, her family. But she’s managed to schedule everything pretty well. With that being said though, Kris did once confess that she has a “favorite child.”\n\nAnd no, it’s not who you think. It has nothing to do with who is the most profitable or who has the most Instagram followers in the family. In fact, it’s quite the opposite.\n\nKris told The Kyle and Jackie O Show, “The last couple days it’s been Khloe. She’s on the favorite child list. Her and I have been bonding and shopping for the new baby,’ said the 62-year-old matriarch. The answer came after Jackie O implied the Keeping Up With The Kardashian star’s most beloved was either Kim or Kylie. Well… it changes every day. Anybody who’s a parent to a lot of kids knows… it depends on the day since there’s a lot of dynamics in a mother/child relationship.”\n\nWith that being said, we are sure she has a different favorite child every other week. I mean, don’t most moms operate that way? Ha!\n\n5 She Always Has To Be In Control\n\nSometimes you just have to call it as you see it: Kris Jenner is a control freak. Ok, we don’t mean that in a negative sense, but rather that she loves to always be in the driver’s seat. And that’s not such a bad thing, right? When you know what you want, life is so much better. In Kris Jenner’s case, it’s so much richer. And it’s a mantra that she’s also passed down to all of her children. I mean, they are all successful in their own right for a reason.\n\nShe’s also taught her children to always be persistent. According to Evan Carmichael, Kris put it this way in an interview, “When I do something, I don’t really think of, I always look at the glass half full. I try to have a positive attitude. I try to see through the mud, and say, this could be a really great thing, because I’m going to do it different, or I’m going to make this work. I’m always very, I’m very stubborn, for one. And I don’t like to let things go. So if I start doing something and it’s not going well, I think I’m so persistent that I will do it until I feel like it’s good or right.”\n\n4 She’s Weathered Every Storm\n\nWhen it comes to the Kardashian family, it’s safe to say that we’ve seen it all. There have been several divorces. There have been meltdowns. There have been nasty break ups. There have been scandals. And most of all, there has been a very embarrassing tape. But for Kris, she’s managed to weather each and every storm.\n\nThere’s nothing that her children have done that’s too devastating or too embarrassing for her not to handle. And you know exactly what we are talking about, too.\n\nI mean, Kim Kardashian was made famous because of a certain tape. It doesn’t get any low brow than that. But Kris managed to create her empire around it. That says a lot about her.\n\nHer daughter Kylie Jenner told Wonderland Magazine back in 2016, “Growing up, I’ve heard the worst things anyone could ever say about me and bullying was such a big part of my life, with the whole entire world judging me and stuff. So I started to look towards people with, like, I think, bigger, more real issues than I have. They inspire me because I was like, ‘I’m getting bullied all the time, but they’re just haters and [these people] deal with real-life issues.’”\n\n3 She Still Has Values\n\nA lot of families fight, they break up and they make up. But with the Kardashians, that doesn’t seem to be the case at all. They each have each others' backs, despite all of the banter they have in front of the cameras. They are actually very close.\n\nThis might also be one of the reasons why Kris’ daughter Khloe doesn’t believe in divorce. She told Lena Dunham’s Lenny Letter, “I’ve been blessed with a lot in my life, and I’ve also had challenges. It was a challenge for me when I decided to get divorced. At my core, I don’t believe in divorce, but I came to a point in my marriage where I had to make the choice to take care of my own mental and emotional well-being in order to protect myself and my happiness. I am at peace with that decision and do feel like I honored my vows to the very end.\"\n\nShe also added, \"I feel that I kept the serious vows I made in front of God with every inch of my heart, which is why I am still honoring them today even though my relationship with my ex-husband is in a different place. I believe in caring for my partner — past or present — “in sickness and in health,” and feel at peace with my relationship with God even after the fact. I’m thankful that I can rely on my God, who, along with my family, has led me through some of the most difficult times of my life.”\n\n2 She Defends Her Clan Relentlessly\n\nA day doesn’t go by that Kris Jenner isn’t forced to protect or defend her children. It’s become her part-time job, so to speak. She has to continually go on the record to either put the media in their place or do some serious damage control. She’s done it so many times.\n\nAccording to Girlfriend.com,\n\nKris even went on the record to defend Kim Kardashian’s husband Kanye West during a time of crisis.\n\nSpeaking to the Ellen DeGeneres Show, Kris had this to say, “Kanye has a lot of love for all of you, all of his fans, and everybody who's been there to support him forever. And, I know that he will explain himself in his own way. I think that anything he does - and I just think this is important to say is - he always does things with really good intentions. So, I'm going to let him explain himself when the time is ready.\"\n\nThis came after Kanye made some rather controversial comments about American history and the past. But seriously, Kris comes to the rescue for just about everyone. When you are a part of her trust circle, she’s got your back. That’s a guarantee.\n\n1 Nothing Is Going To Break Her Family\n\nWith all of that being said, nothing – and we truly mean nothing – will ever break up the Kardashian family. And as much as some of their critics really want them to go away, that’s not going to happen either. The Kardashians are here to stay, people. Just get used to it. They have become a permanent mainstream of American celebrity. You might as well call Kim Kardashian the Marilyn Monroe of her generation, as odd as that might sound.\n\nPlus, we are talking about the same woman who managed to get her daughter Kim Kardashian on the cover of Forbes Magazine. I mean, Kim was giving the publication quotes like this, “I became really intrigued with the tech world. I started spending a lot of time in San Francisco. I realized this is really going to be the next cycle of my career and this is what I want to focus on.”\n\nSeriously, Kris Jenner is a true genius. We are all under her spell.\n\nAnd we also have a feeling that she and her children (and grandchildren) have plenty more up their sleeve. This is not the beginning, nor is it the end. Watch this space. Kris Jenner has so much more to prove to the world. And yes, we will be tuning in for all of it.\n\nReferences: eonline.com, girlfriend.com, people.com, usweekly.com, essence.com, wonderland.com, usweekly.com", "images": ["https://web.archive.org/web/20220826164742im_/https://www.babygaga.com/public/build/images/re-logo-full-colored-light.4b543c53.svg", "https://web.archive.org/web/20220826164742im_/https://www.babygaga.com/public/build/images/mm-logo-full-colored-light.53763959.svg", "https://web.archive.org/web/20220826164742im_/https://static0.babygagaimages.com/wordpress/wp-content/uploads/2018/05/kris1.jpg", "https://web.archive.org/web/20220826164742im_/https://www.babygaga.com/public/build/images/tv-logo-full-colored-light.8d65e7f9.svg", "https://web.archive.org/web/20220826164742im_/https://www.babygaga.com/public/build/images/tt-logo-full-colored-light.051eb8af.svg"], "top_img": "https://web.archive.org/web/20220826164742im_/https://static0.babygagaimages.com/wordpress/wp-content/uploads/2018/05/kris1.jpg", "keywords": [], "authors": ["Joanna Mazewski"], "canonical_link": "https://web.archive.org/web/20220826164742/https://www.babygaga.com/15-things-kris-jenner-has-done-to-protect-her-children/", "title": "15 Things Kris Jenner Has Done To Protect Her Children", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "robots": "max-image-preview:large", "description": "From 15 minutes, to over 10 years of fame.", "og": {"title": "15 Things Kris Jenner Has Done To Protect Her Children", "type": "article", "image": {"identifier": "https://web.archive.org/web/20220826164742im_/https://static0.babygagaimages.com/wordpress/wp-content/uploads/2018/05/kris1.jpg", "width": 1024, "height": 512}, "url": "https://web.archive.org/web/20220826164742/https://www.babygaga.com/15-things-kris-jenner-has-done-to-protect-her-children/", "locale": "en_US", "description": "From 15 minutes, to over 10 years of fame.", "site_name": "BabyGaga"}, "article": {"published_time": "2018-05-26T14:00:43Z", "modified_time": "2018-05-26T14:00:43Z", "section": "Baby Buzz", "author": "Joanna Mazewski", "publisher": "https://www.facebook.com/babygaga"}, "twitter": {"card": "summary_large_image", "site": "@babygaga", "title": "15 Things Kris Jenner Has Done To Protect Her Children", "description": "From 15 minutes, to over 10 years of fame.", "image": "https://web.archive.org/web/20220826164742im_/https://static0.babygagaimages.com/wordpress/wp-content/uploads/2018/05/kris1.jpg"}, "fb": {"app_id": 270407583294564}}, "movies": [], "publish_date": 1527343243.0, "source": "https://web.archive.org", "summary": ""}