{"url": "https://popculture.com/reality-tv/2018/10/03/dancing-with-the-stars-paid-tribute-las-vegas-shooting/", "text": "Dancing With the Stars took an emotional moment to honor the victims of the 2017 Las Vegas mass shooting during Tuesday's Vegas-themed episode of the ABC competition.\n\nIn addition to the Las Vegas-themed dances throughout the night, host Tom Bergeron addressed the deadliest mass shooting in modern U.S. history, which occurred on Oct. 1, 2017, in a short segment of the show.\n\n\"As we present tonight's show, we are aware that last night marked the one-year anniversary of the tragic shooting in Las Vegas,\" he said. \"The spirit of that incredible city lives on in the people of Las Vegas. We do this show with you foremost in our minds and hearts.\"\n\nOn Monday's anniversary of the Route 91 Music Festival shooting that killed 58 people and injured 851, country star Jason Aldean, who performed at the time of the shooting, also paid tribute to those involved in the tragedy with a #VegasStrong tweet.\n\nHe recently returned to the site of the shooting for the first time to perform.\n\n\"On behalf of myself and my family and the country music community, I want to say thank you to the city of Las Vegas for your courage, strength and kindness,\" Aldean said during the performance, via Rolling Stone. \"Tonight we are all proud to be Vegas strong.\"\n\n\"That's a day that's hard to forget. We know it's coming up,\" he said later to reporters. \"To be back in Vegas this close to it is, at times, a little weird, but in another sense it's nice to be back. It's really our first performance we've had since then, so tonight is going to be another step in getting through all that stuff, and coming back here is going to be a big part of it.\"\n\n\"Every night in our meet-and-greets we're meeting fans that were here at that show, and I don't think we've had a show this year that we haven't had survivors come out to the show,\" he added. \"We do that on a daily basis, not just because the anniversary is coming up.\"\n\nImagine Dragons also paid tribute to the massacre last month during the 2018 iHeartRadio Music Festival, which took place in Las Vegas.\n\n\"I can tell you, this city means everything to me and to this band. We try every day to be honorable to it, to represent it in a way that is true to the Vegas that we love,\" said Imagine Dragons frontman and Las Vegas native Dan Reynolds, said. \"We have come together in a way that I've always hoped since I was a little kid. I've never felt like we had the culture here. I knew the people were here, but it seemed like we just didn't have something to connect us. And there's been a lot that's connected us in this last year.\"\n\n\"And even though I've been overseas, to come home to the Las Vegas that I know and love, I love this city,\" Reynolds said between cheers. \"And to all of those who we lost, we're thinking of you. To the families affected, we love you. Vegas Strong.\"\n\nDancing With the Stars airs Mondays and Tuesdays at 8 p.m. ET on ABC.\n\nPhoto Credit: ABC", "images": ["https://sportshub.cbsistatic.com/i/2021/03/28/44f032ae-520b-46ce-afba-f9d5db928356/dwts-las-vegas-20046626.jpg?width=1200"], "top_img": "https://sportshub.cbsistatic.com/i/2021/03/28/44f032ae-520b-46ce-afba-f9d5db928356/dwts-las-vegas-20046626.jpg?width=1200", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/reality-tv/news/dancing-with-the-stars-paid-tribute-las-vegas-shooting/", "title": "How 'Dancing With the Stars' Paid Tribute to Las Vegas Shooting Victims", "meta_data": {"description": "Dancing With the Stars took an emotional moment to honor the victims of the 2017 Las Vegas mass [...]", "keywords": "ABC,Dancing With the Stars,Las Vegas,Route 91 Harvest Festival Shooting", "news_keywords": "ABC,Dancing With the Stars,Las Vegas,Route 91 Harvest Festival Shooting", "robots": "index, follow, max-image-preview:large", "twitter": {"card": "summary_large_image", "site": "PopCulture", "creator": "PopCulture", "title": "How 'Dancing With the Stars' Paid Tribute to Las Vegas Shooting Victims", "description": "Dancing With the Stars took an emotional moment to honor the victims of the 2017 Las Vegas mass [...]", "image": "https://sportshub.cbsistatic.com/i/2021/03/28/44f032ae-520b-46ce-afba-f9d5db928356/dwts-las-vegas-20046626.jpg?width=1200"}, "og": {"title": "How 'Dancing With the Stars' Paid Tribute to Las Vegas Shooting Victims", "type": "article", "url": "https://popculture.com/reality-tv/news/dancing-with-the-stars-paid-tribute-las-vegas-shooting/", "image": {"identifier": "https://sportshub.cbsistatic.com/i/2021/03/28/44f032ae-520b-46ce-afba-f9d5db928356/dwts-las-vegas-20046626.jpg?width=1200", "width": 1280, "height": 666}, "site_name": "Reality TV", "description": "Dancing With the Stars took an emotional moment to honor the victims of the 2017 Las Vegas mass [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#263240", "apple-mobile-web-app-capable": "yes"}, "movies": [], "publish_date": 1538521200.0, "source": "https://popculture.com", "summary": ""}