{"url": "http://www.vulture.com/2018/02/best-super-bowl-halftime-shows-ranked.html", "text": "Eminem, Dr. Dre, Mary J. Blige, and Snoop Dogg perform at the 2022 Super Bowl halftime show. Photo: Kevin Mazur/Getty Images for Roc Nation\n\nFootball fans might not realize it, but plenty of Americans only attend Super Bowl parties for seven-layer dip, liberal drinking, and the nationally televised pop concert otherwise known as the Super Bowl halftime show. For decades, the show would simply feature a college marching band or two, with a performance by Andy Williams or Up With People tossed in for good measure, but that all changed in 1993. That’s the year when Michael Jackson turned the Super Bowl halftime show into must-watch television.\n\nIn the decades since Jackson created the halftime show as we know it, the Super Bowl has run through remarkably different eras of performance — the millennial MTV revue, the classic-rock revival of the late aughts, the pop divafication of recent years — but tradition and purpose unite them all. The mode has always been pastiche, combining disparate elements into a cohesive whole that celebrates American culture. That’s the quality we’re looking for above all, as we rank all of the Super Bowl halftime shows since 1993, from worst to best.\n\n30. Phil Collins, Christina Aguilera, Enrique Iglesias, and Toni Braxton (2000)\n\nThe first thing you need to understand about this halftime show: Disney owns ABC, so they decided to hijack 12 minutes of America’s time for a huge commercial for some Cirque du Soleil rip-off called the “Disney Millenium Performance.” There were a bunch of puppets and people in crazy costumes, which was kind of cool, but they all looked like robot overlords from a machine future that was obsessed with New Age healing and wheatgrass shots. To make it even worse, each performer sang an original song, so the audience didn’t recognize any of it. I would have given anything to hear “Sussudio” — instead, we got Phil Collins in a backwards Kangol hat and the world’s saddest cargo pants, singing something called “Two Worlds.” Oh, and Edward James Olmos kept coming out to offer weird narration like, “As it does every thousand years, the gateway of time has opened once again to give us hope.” Thanks, but no thanks.\n\n29. Clint Black, Tanya Tucker, Travis Tritt, and the Judds (1994)\n\nThere is nothing sadder than a country spectacular, especially when the most imaginative performance available is a horde of people dressed as cowboys and cowgirls. Sure, it’s a popular genre, but a huge chunk of the audience had no clue what “Tuckered Out” or “It’s a Little Too Late” were, or why they needed to care about bland smiling girls in 10-gallon hats. To make it worse, the people on the field appeared to be moving around carrying fluorescent light bulbs. This was a halftime show to forget.\n\nPhoto: Getty Images\n\nMaroon 5’s halftime show was exactly like all of Maroon 5’s music: so safe and antiseptic that you hardly remember it’s there until you’re watching a Super Bowl halftime show and you realize you know every single one of the songs and you want to crack yourself over the head with the Rock Band guitar gathering dust in your closet. There was almost no acknowledgement in this set that it was taking place on the largest annual stage in America. We got a few lame pyrotechnics, an almost entirely female audience gathered around the stage jumping and clamoring for Adam Levine like they were paid to, a SpongeBob SquarePants introduction, and performances by Travis Scott and Atlanta’s own Big Boi shoehorned in between some of Levine’s crooning. The whiplash between these artists was enough to give viewers a concussion disorder. In a year when no one wanted to perform at the halftime show, this was the best the NFL could do, a firework that extinguished itself mid-flight.\n\n27 . The Rolling Stones (2006)\n\nThere are two notable things about this performance: (1) The Rolling Stones played on a stage shaped like the band’s lips-and-tongue logo, and (2) the people of Detroit, where that year’s game was played, were pissed because no Motown artist was asked to perform. Also, the Stones only did three songs. Three. And one of them was their latest single, “Rough Justice.” A note to the Rolling Stones: No one wants to hear the new stuff, especially at the Super Bowl.\n\n25. Dan Aykroyd, John Goodman, James Belushi, ZZ Top, and James Brown (1997)\n\nSince the game was in New Orleans, I suppose the theme made sense. What didn’t was letting Jim Belushi sing “Soul Man” and “Gimme Some Lovin’.” Yes, they let Jim Belushi sing. It was like watching your uncle do karaoke, except there were tons of girls in tiny outfits gyrating everywhere while a marching band spelled out words on the field and pyrotechnics exploded into the abyss. Then ZZ Top played “Legs” while the dancers laid on their backs and, um, showed off their legs. Even with James Brown, this halftime show needed a whole lot more of something. Anything, really.\n\n25. Gloria Estefan, Stevie Wonder, Big Bad Voodoo Daddy (1999)\n\nYes, Big Bad Voodoo Daddy played the Super Bowl and we will never be able to take that away from them. But while pastiche is the best way to create a great halftime show, this one was just too much. They threw a bunch of stuff at the wall, then it all stuck and stayed there for a few weeks and got moldy. Gloria Estefan killed it, of course, and Stevie Wonder was great, but the sound mix was off the whole time. Two all-time greats wasted on a spectacle that was absolutely hollow at its core.\n\n24. Justin Timberlake (2018)\n\nJustin Timberlake is a former member of NSYNC, husband to Jessica Biel, ex-boyfriend of Britney Spears, tour mate of Christina Aguilera, and co-Emmy winner (for “Dick in a Box”) with Andy Samberg. He couldn’t enlist the help of any of those people to enliven what was the most boring Super Bowl halftime show of the modern era? Instead, we got a projection of Prince on a giant sheet while Timberlake sang “I Would Die 4 U.” It was certainly a reminder of the Purple One’s iconic halftime performance — and in his hometown, no less — but otherwise this was a boring, ill-conceived, and muddled performance. It started with Timberlake singing under the stadium in what felt like a small club show, but even when he came onto the main stage, it still had the same feeling. The Super Bowl is not the time for intimate numbers. It is a time for spectacle and Justin left it (and all of his famous friends) at home. Lady Gaga jumped off the roof! Katy Perry rode in on a giant lion! Beyoncé shot Kelly and Michelle through the floor to sing “Single Ladies!” Justin Timberlake just roamed around aimlessly and then played the piano while wearing an outfit that looked like it could double as an billboard for discount hunting store. What a horrible way to ruin #JanetJacksonAppreciationDay.\n\n23. The Who (2010)\n\nThere were lasers and some singing. There was a faithful version of “Baba O’Riley” and other songs used by CBS procedurals. I guess the stage was kinda cool. Blah.\n\n22. Shania Twain, No Doubt, and Sting (2003)\n\nWas this a halftime show or a playlist for a very short car ride? Shania did “Man! I Feel Like a Woman” without even one backup dancer or costume change. Next, Gwen Stefani performed “Just a Girl” with her backing band. There has been no bigger whiplash between two bands in the history of the Super Bowl. Finally, Sting appeared and Stefani joined him for “Message in a Bottle.” That’s it. Finito. The only flourishes were the punk-rock cheerleaders jumping on trampolines, and even that came about seven minutes into the show. Yawn.\n\n21. Tom Petty and the Heartbreakers (2008)\n\nTom Petty is one of our country’s greatest underappreciated assets. Of all the acts to get up and play the first four songs off their greatest-hits album, Petty’s — “American Girl,” “I Won’t Back Down,” “Free Fallin,’” and “Runnin’ Down a Dream” — are perhaps the most solid all the way through. But, man, couldn’t he have at least enlisted a few dancers to liven things up?\n\nPhoto: Sporting News Archive/Sporting News via Getty Images\n\nThis was America’s punishment for Janet Jackson’s nipple: an old white dude standing in the middle of an LED stage, playing the guitar by himself. This show was safer than having sex in a panic room with three condoms and all of your clothes on. There’s no denying McCartney’s brilliance, but he just ran through “Drive My Car,” “Get Back,” “Live and Let Die,” and “Hey Jude” with no interruption or embellishment that could possibly shock or offend the very fragile American sensibility. But hey, at least there was an LED stage!\n\n19. Bruno Mars and Red Hot Chili Peppers (2014)\n\nIt started with small children holding hands in front of American flags and ended with soldiers dedicating “Just the Way You Are” to their families. Nine out of ten dentists say this is enough saccharine to give every American spontaneous cavities. Mars did a competent job, but a year after Beyoncé made a political statement with her all-female performance, Mars reverted back to the usual by filling the stage with a bunch of dudes, including Red Hot Chili Peppers. It was uninspired, plus it didn’t seem like Mars had achieved Super Bowl headliner status.\n\nPhoto: Frank Micelotta Archive/Getty Images\n\nWhat we needed was Bruce Springsteen and what we got was an Irishman yelling “America!” in front of a giant banner printed with the names of everyone who died in the 9/11 attacks. The U2 performance was a simple and pared-down affair, which seemed fitting for the zeitgeist, but still it was strange to hear what sounded like cheering as Bono sang “Where the Streets Have No Names” and the nation mourned.\n\nPhoto: Kevin Mazur/Getty Images for TW\n\nBefore the big day my mother said to me, “They keep talking about the halftime show and saying ‘This Weekend’ but they haven’t said who the performer is.” The Weeknd got to show my mother and the nation he has more hits than you realize and is immensely talented. But in this coronavirus-infested world, we’ll never know if his somewhat sleepy mini concert was due to a lack of imagination or COVID restrictions. For most of his 12 minutes he just stood in the same red sparkly jacket singing in front of risers filled with musicians and backup singers. Two songs in, he ventured under the set with a jittery handheld camera into a glittering maze for “Can’t Feel My Face” and it seemed like things were finally going in a different direction, but then he was right back in front of the risers with no choreography at all. It took until the ten-minute mark when he was joined on the field itself by legions of dancers in tight formation (or was it the designated six-feet separation?) for the Weeknd’s first costume change into… another red sparkly jacket. This was a performance that dragged and one completely without the pastiche or spectacle that we’ve come to expect from the halftime show. But, on the other hand, my mom now knows who the Weeknd is, so mission accomplished.\n\nPhoto: YouTube\n\nDuring the sad era of aging rockers playing their greatest hits without flourish or interruption, Springsteen was the only one who seemed to have some fun. “I want you to step away from the guacamole dip! I want you to put the chicken wings down and turn your television all the way up!” he told the audience as his set started. Springsteen is one of the American masters — why he didn’t play the post-9/11 halftime show, I’ll never know — and “10th Avenue Freeze Out,” “Born to Run,” “Working on a Dream,” and “Glory Days” are all certifiable jams. Still, there wasn’t anything you couldn’t get here from one of the Boss’s concerts, so he falls a few spots.\n\n15. Boys II Men, Smokey Robinson, Martha Reeves, the Temptations, and Queen Latifah (1998)\n\nThis could have been a staid look at an older genre of music, but then Latifah and Boyz II Men came in and injected some youthful energy into what otherwise looked like a very professional high-school talent show. Boyz II Men disappointed by using most of their time onstage for their new single “A Song for Mama,” which is soundly awful. Luckily for Martha Reeves, whose singing sounded like a squirrel was humping her larynx during “Heat Wave,” Twitter didn’t exist back in 1998 or there would have been a whole lot of Left Sharking about the sound. Still this was wholesome family fun for all ages.\n\n14. Patti Labelle, Tony Bennett, Arturo Sandoval, Teddy Pendergrass, and Miami Sound Machine (1995)\n\nThis was less of a halftime show and more of a Stefon SNL skit. It had cobras playing drums, peasants making offerings to the gods, Indiana Jones flying on a parachute, a Satanic ritual involving the Super Bowl trophy, people on stilts, Patti LaBelle dressed as a demonic sequin goddess, throngs of shirtless dancers, a flaming ninja, a stage full of spikes, and Tony Bennett singing an old song. One of the few Disney-produced shows, this was pure camp insanity. It sure wasn’t the best show, but it’s still one of my favorites.\n\n13. Black Eyed Peas, Usher, and Slash (2011)\n\nI never thought I’d say this, but the Black Eyed Peas were pretty good at the Super Bowl. Dressed up like the cast of a Not Tron XXX: A Porn Parody, the foursome descended from thin air, ushering in a pop-heavy era of halftime shows. This laid the groundwork for Madonna, Beyoncé, and all the rest, with a field full of dancers in glowing costumes and a futuristic theme that featured Usher and Slash popping up from under the stage to play “Sweet Child of Mine” for Fergie. Sadly, the sound sucked and the stage, meant to spell “LOVE” in lights when viewed from above, was missing one prong of its V. It’s really too bad they had to sing all of those Black Eyed Peas songs.\n\n12. Jennifer Lopez and Shakira (2020)\n\nThe best moment of this celebration of Latin culture, and particularly hips-not-lying Latin dance, came when J.Lo was joined onstage by her daughter, Emme, to sing “Let’s Get Loud” along with a fleet of other tween girls whose mothers were, no doubt, dance mom–ing on the sidelines. There were also kids in lit-up cages scattered around the field, and Emme broke into a chorus of “Born in the USA” while her mother, sporting one of her many glittering bodysuits, showed off a giant feather cape with the American flag on one side and the Puerto Rican flag on the other. It was a forceful tip of the hat to the current political situation of immigrants, particularly those from South and Central America. Things moved on from that moment with the speed of Shakira shaking her hips. The whole performance was incredibly frenetic, whipping from one stage piece to the next before the audience could even figure out what was going on. There were plenty of highlights — like J.Lo pole dancing on the spire of the Empire State Building — and the audience could not even finish asking, “Why is Shakira dancing with a random piece of rope?” before she had moved on to some other bit of whimsy (including the zaghrouta heard round the world). With two superstars in top form, it’s hard not to be swaddled in their beautiful glittery embrace.\n\n11. Lady Gaga (2017)\n\nThis technologically advanced performance included a literal constellation of drones, a dive off the roof of the stadium, and dancers tossing glowing spears that looked like a weapon out of Star Trek. There was even a keytar and a circular piano like the one at the Mos Eisley cantina. Lady Gaga has always been like Ziggy Stardust’s bratty younger sister, and that was the theme she stuck to throughout, from her diamond phone for “Telephone” to the crystal orb she brandished to the audience. But we never got more than that polished public persona. Gaga did hits like “Poker Face,” “Born This Way,” and “Bad Romance” without notable reinvention or retooling in the way that Madonna, Prince, and Beyoncé did with their old gems. Also, she didn’t have any guest performances, while the only covers were those (possibly) political numbers at the opening. A Lady Gaga concert is always a spectacular affair, and this certainly was, but she needed to cast her net wider for such an all-embracing cultural event.\n\nPhoto: Steve Granitz/WireImage\n\nJust because you’re the first doesn’t mean you do it best. For starters, the networks hadn’t quite figured out how to broadcast a halftime show yet. It’s hard to hear the music over all of the cheering (which lasted a full three minutes before a note was even played), there was a commercial break in the middle of the program, and the game was in California, so it wasn’t quite dark out. Also, the production is painfully sincere in that way Michael Jackson loved: Instead of reaching into his packed back catalogue, he performed “We Are the World” with a children’s choir, then did “Heal the World” while an enormous globe inflated in the middle of the stage. Sure, he also did “Billie Jean” and moonwalked, but for a consummate showman, Michael Jackson could have done more.\n\nPhoto: TIMOTHY A. CLARY/AFP/Getty Images\n\nAlthough it was supposed to be Coldplay’s year, they wound up basically ceding the stage to Beyoncé and Bruno Mars. Thank God for those guest performances because Coldplay’s contribution was pure Technicolor vomit. It was like a hippie van collided with a paint factory. Things got much better once Beyoncé showed up dressed as Michael Jackson from his 1993 performance with a legion of backup girls for “Formation.” Bruno Mars came out with a bunch of boys for “Uptown Funk” and the two of them squared off in the chicest battle of the sexes ever. Sorry, everyone else: This was Bey’s moment, and it immediately joins Michael’s as one of the most iconic. Too bad everything else had to drag her down.\n\n8. Janet Jackson, Justin Timberlake, Jessica Simpson, Kid Rock, Nelly, and P. Diddy (2004)\n\nWhatever this inexplicable theme was supposed to be, the real idea here was excess. Janet running around with countless dancers on a stage that looked like if the Fortress of Solitude were built by Cirque du Soleil, Diddy riding a moving platform through a sea of smoke, Nelly coming out in a giant red car to sing “Hot in Here,” and Kid Rock somehow managing to wear four embarrassing outfits (including a poncho made from an American flag). Yes, Justin ripped off Janet’s boob covering and we saw a bit of nip. Whatever. It was still a really good show.\n\n7. Diana Ross (1996)\n\nDiana Ross was considered a safe choice for Super Bowl XXX, but only a diva of her magnitude could pull off such a shocking performance. It starts off with her descending from the sky on a sparking platform, slowing considerably through a medley of her biggest hits, like “Baby Love” and “Stop in the Name of Love” with tuxedo-clad dancers all around her. Then you realize that Ross has changed her outfit for every single song. And then you realize that the giant gold cape she’s wearing is slowly enveloping the entire stage as she rises three stories in the air, singing “Ain’t No Mountain High Enough.” And then you realize that helicopter is going to land in the middle of the field. Diana gets in, waves to the crowd, and then flies off, sitting on the edge of the helicopter. Try to top that, Gaga.\n\nPhoto: Kevin Mazur/Getty Images\n\nThanks to the unforgettable and meme-able antics of the “Left Shark,” this performance will be remembered for years to come, but it was also a technical marvel to behold. Perry arrives on the back of a giant lion puppet while singing “Roar,” then wound up being dragged around the sky, singing “Firework” and riding the More You Know shooting-star logo. There was lots to enjoy in the middle, namely bringing Missy Elliott onstage to do her thing on three — yes three — of her own songs. The psychedelic ’60s pop-art color scheme was unforgettable, as was the message that Katy sent: At the Super Bowl, it’s a good thing to share the spotlight.\n\n5. Aerosmith, NSYNC, Britney Spears, Mary J. Blige, and Nelly (2001)\n\nBy today’s standards, Justin Timberlake, a still-closeted Lance Bass, and the rest of NSYNC doing “Bye Bye Bye” while Steven Tyler pulled heartstrings with “I Don’t Want to Miss a Thing” might not seem revolutionary — especially considering the dated metallic outfits — but it definitely felt that way at the time. This was the first year that fans were allowed on the field surrounding the stage, which made the show feel more like a traditional concert — granted one where Timberlake literally shot fireworks out of his hands like he was one of the X-Men. The fan interaction, which has since become a staple, brought a whole new energy to the proceedings. When surprise guests Britney Spears, Mary J. Blige, and Nelly came out for a thoroughly rousing finale of “Walk This Way,” both the older dudes who love Aerosmith and their teenage daughters lost their collective minds.\n\nPhoto: Kevin Mazur/Getty Images for Roc Nation\n\nThe modern halftime show evolved from a giant showcase for one pop-music giant to incorporating a number of popular acts and then back again. Dr. Dre figured out a way to make it both. His 15-minute survey of the last quarter-century of hip-hop kicked off with him and Snoop treating the L.A. crowd to snippets of “The Next Episode” and “California Love,” before bringing in a number of other marquee names and their early-2000s hits: a surprise 50 Cent hanging upside down for “In Da Club”; Mary J. Blige, in an outfit that was both mirrored and leopard print, absolutely destroying “Family Affair” and “No More Drama”; and Eminem imploring the crowd to “Lose Yourself” backed by a band that included Anderson .Paak on drums and Dre himself, standing in front of a glossy white mixing board as a reminder of who produced most of these bangers. Add in Kendrick Lamar and a phalanx of highly choreographed dancers in the middle for some modern jams in “m.A.A.d City” and “Alright” and Dre and Snoop bringing it home with group singalong to “Still D.R.E.” and it all adds up to great show that was happy to revel in the hits. Offering up a master class on how to pull off what can be the most thankless gig in American music, Dre only loses some points for the set, arranged like a number of compartmentalized house parties that made the spectacle feel a bit claustrophobic at times. Other than that, though, the show was a great reminder that Dre is way more than just the headphones guy, without looking like an ego trip.\n\nPhoto: Christopher Polk/Getty Images\n\nIf the Super Bowl allowed ties, Queen Bey would share the top spot with the next two performances. Her 2013 production was extravagant and jaw-dropping, while the all-black costumes and toned-down aesthetic provided a sophistication that other artists just can’t emulate. The music was spot on, springing from “Crazy in Love” to “Baby Boy” and all the way to “Halo” as a swooping finale. It just barely loses a few points, though, because her performance didn’t offer enough pastiche. The stage was literally made to look like two of her profiles facing each other, while a giant image of Beyoncé burned above it. Yes, it was a totally awe-inducing performance, but it didn’t include even one costume change. The only guests were her former Destiny’s Child bandmates, who together sung “Single Ladies,” which wasn’t even one of their songs. Still, Beyoncé only had women performers on that stage, an admirable change and a powerful message.\n\n2. Madonna, LMFAO, Nicki Minaj, Cee Lo Green (2012)\n\nA year after the halftime show embraced its pop sensibilities with the Black-Eyed Peas, Madonna arrived as a Greek goddess on a giant litter carried by a legion of Spartan soldiers, showing all the kids exactly how it’s done. There was so much on the LED-lit stage at any given time: From the swirling dancers and the gospel choir to the slackline performer, it was almost too much. Madonna offered new arrangements of her old songs, like a drum-corps version of “Open Your Heart” sung with Cee Lo Green and an LMFAO mashup of “Music” with “Party Rock Anthem.” While she loses points for devoting significant time to the lackluster single “Give Me All Your Luvin,” at least that featured Nicki Minaj and a bird-flipping MIA. Madonna successfully moved through several modes in rapid succession, collaborated with other big artists, and made it all look effortless, as if being at the swirling center of 200 performers is what she does every Tuesday. Maybe because it is.\n\n1. Prince (2007)\n\nThe absolute best Super Bowl halftime performance of them all. Prince’s show wasn’t the most extravagant, but even today, it thrills and excites. In the middle of a stage shaped in the “Artist Formerly Known As Prince” symbol, the Purple One opened with the strains of Queen’s “We Will Rock You” before switching gears with “Let’s Go Crazy.” Then the Florida A&M University marching band, strapped with glowing lights, joined in for a new arrangement of “Baby I’m a Star” that recognizes the history of halftime shows past. This musical journey veered through covers of “Proud Mary” and “All Along the Watchtower” before ending with a huge scrim shot up into the night sky, with Prince’s giant backlit silhouette projected as he shredded the guitar solo from “Purple Rain.” Oh, and he did the whole thing in the pouring rain. Who could ever top that?", "images": ["http://www.vulture.com/media/components/customer-alert-banner/double_chevron.svg", "https://pyxis.nymag.com/v1/imgs/e33/6e7/aed044d06bd5c293490430f400dc112e41-2022Cov4x5-AsianAmericaPkg.w240.jpg", "https://pyxis.nymag.com/v1/imgs/fd4/409/28254d99ceca593534b46a52a9e49b452b-RISSI-AND-MIKO-SET-1152022.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/93d/dd4/6993359860ee6cc420bb272619119c2cdf-elon-musk-settlement.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/376/890/3be2340f78055d7d144cdb343d17bf815c-super-bowl-halftime-show.1x.rsocial.w1200.jpg", "http://www.vulture.com/media/components/customer-alert-banner/close_x.svg", "http://www.vulture.com/media/components/customer-alert-banner/alert.svg", "https://pyxis.nymag.com/v1/imgs/5ea/81e/4d3b39a96107c321338c0c9a25557bd47f-zarifa-ghafari.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/376/890/3be2340f78055d7d144cdb343d17bf815c-super-bowl-halftime-show.rsquare.w700.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/376/890/3be2340f78055d7d144cdb343d17bf815c-super-bowl-halftime-show.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Brian Moylan"], "canonical_link": "https://www.vulture.com/article/best-super-bowl-halftime-shows-ranked.html", "title": "Every Super Bowl Halftime Show Since 1993, Ranked", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "parsely-tags": "music, tv, super bowl, super bowl halftime show, vulture lists, rankings, vulture picks, vulture homepage lede, featuretype:list or roundup", "og": {"title": "Every Super Bowl Halftime Show Since 1993, Ranked", "url": "https://www.vulture.com/article/best-super-bowl-halftime-shows-ranked.html", "description": "An overview of the last 30 years of mid-game pop spectacle, from worst to best.", "image": "https://pyxis.nymag.com/v1/imgs/376/890/3be2340f78055d7d144cdb343d17bf815c-super-bowl-halftime-show.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Every Super Bowl Halftime Show Since 1993, Ranked", "description": "An overview of the last 30 years of mid-game pop spectacle, from worst to best.", "image": "https://pyxis.nymag.com/v1/imgs/376/890/3be2340f78055d7d144cdb343d17bf815c-super-bowl-halftime-show.2x.rsocial.w600.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2022-02-14T11:26:00.000-05:00", "tag": "music, tv, super bowl, super bowl halftime show, vulture lists, rankings, vulture picks, vulture homepage lede", "publisher": "https://www.facebook.com/Vulture"}, "description": "In 1993, Michael Jackson created the Super Bowl halftime show as we know it today. Vulture ranks every performance up to the 2022 Dr. Dre-produced halftime show, featuring Snoop Dogg, Mary J. Blige, Eminem, and Kendrick Lamar, from worst to best.", "robots": "max-image-preview:large", "sailthru.tags": "music, tv, super bowl, super bowl halftime show, vulture lists, rankings, vulture picks, vulture homepage lede", "author": "Brian Moylan", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://assets.nymag.com/media/sites/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1644855960.0, "source": "http://www.vulture.com", "summary": ""}