{"url": "http://www.music-news.com/news/UK/106069/Jared-Leto-not-ready-to-be-a-dad", "text": "NEWS Jared Leto not ready to be a dad Newsdesk Share with :\n\n\n\n\n\nUS Rock - Jared Leto is not ready for fatherhood because there's still so many things he wants to do first.\n\n\n\nThe Oscar-winning actor, who has dated stars like Cameron Diaz and Scarlett Johansson, is currently single and has admitted to ES magazine that he has no plans to have kids anytime soon.\n\n\n\n\"I think it's really important to be present if you have children. I have a lot of... things to take care of,\" he cryptically told the publication about why he has no desire to start a family.\n\n\n\nDuring the interview, the 45-year-old also admitted he doesn't have many friends and it's hard to find time to see the ones he does have.\n\n\n\nSpeaking about his close friendship with Gucci designer Alessandro Michele, Jared said, \"He's a legitimate good friend of mine, not just a business or a showbusiness friend. I don't have many friends so I do enjoy spending time with the few that I have.\"\n\n\n\nHe also counts the \"really funny\" Leonardo DiCaprio as a pal too, but The Departed star is usually so busy. He added, \"There are people I'm really enamoured with but it's hard to find time to spend with them.\"\n\n\n\nThe Dallas Buyers Club star is gearing up for the release of Blade Runner 2049, the sequel to 1982 movie Blade Runner, but the film and his role have been shrouded in mystery, but he revealed his character was called Neander Wallace and he was sold on the project as soon as he read the name.\n\n\n\nHowever, he could talk about how much being part of the Blade Runner franchise meant to him.\n\n\n\n\"I can tell you that the experience of making it was one of the highlights of my film career,\" he said. \"Throughout my life I've always gone back to that film. There was something in it that really touched me and taught me a lot about cinema. There's a level of craftsmanship and beauty that's unparalleled.\"\n\n\n\nBlade Runner 2049 hits cinemas in October (17).\n\n", "images": ["http://www.music-news.com/images/news/cover/106069.jpg", "http://www.music-news.com/Content/Images/newsletter-signup.gif"], "top_img": "http://www.music-news.com/images/news/cover/106069.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.music-news.com/news/UK/106069/Jared-Leto-not-ready-to-be-a-dad", "title": "Jared Leto not ready to be a dad", "meta_data": {"viewport": "width=device-width,maximum-scale=1.0", "description": "Jared Leto not ready to be a dad - The Number One music magazine feat. band & artist news, reviews, interviews, videos & gossip UK & worldwide.", "keywords": "Jared Leto not ready to be a dad - music, news, music news,music-news reviews, Alternative, indie, metal, dance, hardcore, rock, pop, artists, audio, video, classic, hip hop, rap, soul, r&b, lennon, ash, sex pistols, radiohead, blur, hendrix, oasis, muzik, underworld, Limp Bizkit, Backstreet Boys,  U2, Korn,  Eminem,  *NSYNC,  Madonna,  Radiohead,  Marilyn Manson,  Pearl Jam, Britney Spears ,  Nelly , Metallica , Christina Aguilera , Prince, Blink-182,  Blur, Oasis, Travis, REM, Smashing Pumpkins, Manics, Supergrass, Pulp, Beck, Nirvana, Stereophonics, Beatles, U2, Foo Fighters, Suede, Stone Roses, Moby, David Bowie, Prodigy, top, fifty, 100, albums, singles, live, films, books, quotes, competitions, webcasts, webchats, radio, E-cards, angst, gigs, tickets, buy tickets, concerts, Real Audio, Microsoft media player, magazine, free, e-mail, email, shop, my, Cds, Cd's, Cd, contests, hits", "google-site-verification": "bDOS26sz2s-cSAyT3mz9xz63qHr4jxrYbQcimMBBXAw", "verification": "59ce4d17a6a39ea29e3fa8dae1d51917", "apple-mobile-web-app-title": "Music-News.com", "application-name": "Music-News.com", "msapplication-TileColor": "#231f20", "msapplication-TileImage": "/Content/Images/Favicons/mstile-144x144.png", "msapplication-config": "/Content/Images/Favicons/browserconfig.xml", "theme-color": "#ffffff", "og": {"site_name": "Music-News.com", "image": "/images/news/cover/106069.jpg", "url": "https://www.music-news.com/news/UK/106069/Jared-Leto-not-ready-to-be-a-dad", "title": "Jared Leto not ready to be a dad", "description": "Jared Leto has a small circle of friends."}}, "movies": [], "publish_date": null, "source": "http://www.music-news.com", "summary": ""}