{"url": "https://www.thewealthrecord.com/celebs-bio-wiki-salary-earnings-2019-2020-2021-2022-2023-2024-2025/tv-personality/mama-june-net-worth/", "text": "Celebrated Name/Nick Name: Mama June Real Name/Birth Name: June Shannon Gender: Female Age: 43 years old Birth Date/Birthday: 10 August 1979 Birth Place: McIntyre, Georgia, United States Nationality: American Ethnicity: American Height/How Tall: 5 feet 4 inches Weight: 75 kg Sexual Orientation: Straight Marital Status: In a relationship Husband/Spouse: N/A Children/Kids: Alana Thompson, Anna Shannon, Lauryn Shannon, and Jessica Shannon Dating/Boyfriend (Name): Yes Is Mama June Gay/Lesbian? (Name of Partner): No Does she have tattoos?: No Smoking: No Drinking: Yes Profession: Television personality Net Worth in 2022: $1.5 million Last Updated: October 2022\n\nMama June is the screen name of June Shannon. She is famous for appearing on reality television series, ‘Here Comes Honey Boo Boo.’\n\nPerhaps you know a thing or two about Mama June, however, how well do you know about Mama June? For instance, how old is she? How about her height moreover her net worth?. In another case Mama June might be a stranger, fortunately for you we have compiled all you need to know about Mama June’s personal life, today’s net worth as of 2022, her age, height, weight, career, professional life, and more facts. Well, if your all set, here is what we know.\n\nEarly Life & Biography:\n\nMama June, the screen name of June Shannon was born on 10th August 1980 in Mcintyre, Georgia, the US. She has a sister named Joanne aka Doe Doe. When June was two years old, her parents divorced.\n\nAge, Height, Weight & Body Measurement\n\nMama June’s age is 43 years old as of today’s date 8th October 2022 having been born on 10 August 1979. Though, she is 5 feet 4 inches tall, she weighs about 75 kg.\n\nPersonal Life: Affair, Boyfriend, Husband, Kids\n\nThroughout her life, June Shannon was seriously involved with four men who fathered one child with her. Last live-in mate was Mike Thompson who publicly revealed his infidelities leading to separation in 2016. June Shannon left school when she was 15 years old. At that point in time, she gave birth to her first child, Anna. Her other children include Alana, Jessica, and Lauryn.\n\nJune Shannon was 32 years old when she became a grandmother of two grandchildren. June cannot see with her right eye because of an untreated childhood cataract. June likes playing bingo games.\n\nCareer, Awards & Nominations:\n\nJune Shannon is a homemaker tending to her four children. Originally, Mama June and Alana appeared on ‘Toddlers and Tiaras’ that led to other popular shows. These include Alana ‘Honey Boo Boo’ Thompson. Also, there are shows around ‘Mama’ June Shannon and her family’s adventures around McIntyre, Georgia.\n\nThe American TLC’s reality show ‘Here Comes Honey Boo Boo’ was broadcast. The show featured Mama June’s family comprising of her four children including her daughter, Alana. It highlighted children’s beauty contests in ‘Honey Boo Boo’ Thompson show. This TLC premiered show ran for four seasons from 8th August 2012 to 14th August 2014. The show received many negative reviews.\n\nOn 24th October 2014, TCL canceled June Shannon’s reality show. It was revealed that Mama June was dating Mark Anthony McDaniel Sr. This man had molested an 8-year-old in 2004, and his name was registered as sex-offender in Georgia. Mama June’s eldest daughter claimed she was molested by the said man ten years before.\n\nLater, June and Lauryn denied the fact that Mama June was dating Mark Anthony McDaniel Sr. It was found several episodes of the show had already been recorded. These were broadcast as ‘Here Comes Honey Boo Boo: The Lost Episodes.’ Thus, the show ran for the fifth season until 21st April 2017.\n\nAfter TCL’s show ‘Here Comes Honey Boo Boo’ got canceled, June and Mike Thompson were approached. Mike was then live-in partner of June. The couple was offered $1 million to appear on Vivid Entertainment’s pornographic film.\n\nIn 2015, Mama June and Alana together appeared on the television series, ‘The Doctors.’ The same year, June and Mike Thompson appeared on television reality show, ‘Marriage Boot Camp: Reality Star 4’. The couple tried to make their marriage work even after Mike publicly admitted to cheating on June. June began her cooking show called ‘Cooking with Mama June.’ In the show, ‘Mama June: From Not to Hot’ Mama June shares how she lost weight.\n\nMama June’s Net Worth & Salary in 2022\n\nThe estimated net worth of Mama June is $1.5 million as of 2022. Most of Mama June’s income comes from appearing on reality shows. The TLC paid Mama June’s family $50,000 per episode. Mama June deposits her income in her daughters’ trust funds. These would mature when her children become 21 years.\n\nMama June’s various television reality shows that are broadcast over the years have gained popularity amongst viewers. These shows include ‘Here Comes the Bridezilla,’ ‘Let Boo Boo Eat Cake,’ ‘Mama Frankenstein,’ ‘Operation Tummy Boo Boo,’ and ‘Thin-Tervention.’ All the shows were broadcast in 2017.", "images": ["https://www.thewealthrecord.com/wp-content/uploads/2018/09/Mama-June-Net-Worth-2019.jpg", "https://www.thewealthrecord.com/wp-content/uploads/2019/12/The-Wealth-Record-Logo-2.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20780%20438'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"], "top_img": "https://www.thewealthrecord.com/wp-content/uploads/2018/09/Mama-June-Net-Worth-2019.jpg", "keywords": [], "authors": ["Please Enter Your Name Here"], "canonical_link": "https://www.thewealthrecord.com/celebs-bio-wiki-salary-earnings-2019-2020-2021-2022-2023-2024-2025/tv-personality/mama-june-net-worth/", "title": "Mama June Net Worth 2022: Age, Height, Weight, Boyfriend, Dating, Kids, Biography, Wiki", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"image": "https://www.thewealthrecord.com/wp-content/uploads/2018/09/Mama-June-Net-Worth-2019.jpg"}, "description": "Explore Mama June's net worth & salary in 2022. Learn about her bio, wiki, age, height, weight, dating, husband, boyfriend, kids, parents, career, education and more. Is he dead or alive?", "generator": "WordPress 5.5.10", "msapplication-TileImage": "https://www.thewealthrecord.com/wp-content/uploads/2020/09/Fevicon.png"}, "movies": [], "publish_date": null, "source": "https://www.thewealthrecord.com", "summary": ""}