{"url": "www.theverge.com/2016/7/17/12210852/kim-kardashian-snapchat-taylor-swift-kanye-west-famous", "text": "Kim Kardashian West hopped onto Snapchat to defend her husband Kanye West's honor tonight, posting a series of videos that prove Taylor Swift gave West permission to rap about her on infamous The Life of Pablo single \"Famous.\" (The line in question: \"For all my Southside niggas that know me best / I feel like me and Taylor might still have sex / I made that bitch famous.\") Kardashian teased the reveal on Twitter earlier in the evening, and West's feud with Swift was the basis for one of the major plotlines on tonight's episode of Keeping Up with the Kardashians.\n\nIn the footage posted on Snapchat, West asks Swift for permission to use a version of the line over the phone from his studio. She gives her consent and thanks him for bringing the line to her before recording and releasing it. It's still unclear just how much Swift knew about the ultimate phrasing of the line, but it's obvious she agrees its sentiment is acceptable. (If you'd rather read than watch, The Fader has transcribed the footage. You'll miss legendary producer Rick Rubin hanging out on a couch in the background, though.)\n\nHere is the entire conversation Taylor & Kanye had, judge for yourself. pic.twitter.com/InTjvPGKe3 — ShadyPopMusic (@ShadyPopMusic) July 18, 2016\n\nAt the beginning of this year, Swift and West had almost entirely reconciled after he famously interrupted her at the 2009 MTV Video Music Awards. That all changed when West released \"Famous\" and the rest of The Life of Pablo in February. Swift sent out a statement condemning the line and West's misogyny a few days after it was first played in public, and West used a series of tweets to claim that Swift had approved the line well before it was released. When she won the Grammy for Album of the Year a few days later, she used her speech to allude to unnamed enemies who \"will try to undercut your success.\" It was widely assumed she meant West.\n\nWhen Kardashian appeared on the cover of GQ last month, she confirmed that Swift had approved the line and suggested that her conversation with West had been caught on camera, only to get blocked by Swift's legal team once they learned about its existence. It seems like the existence of a letter from Swift's attorney couldn't keep Kardashian silent forever, and now we're left to wait and see how Swift reacts to having the rug pulled out from under her. Between this and the Nils Sjoberg fiasco, she's had a pretty rough week.\n\nUpdate July 18th, 12:20AM ET: Taylor Swift has responded to Kim Kardashian West's Snapchat with her own posts on Instagram and Twitter. The picture — a block of text claiming that West never played her the song or said he would call her \"that bitch\" — was captioned with \"That moment when Kanye West secretly records your phone call, then Kim posts it on the Internet.\" Swift says that the video falsely paints her as a liar, when she wasn't actually played the song, making Kim and Kanye's actions \"character assassination.\"\n\nThat moment when Kanye West secretly records your phone call, then Kim posts it on the Internet. A photo posted by Taylor Swift (@taylorswift) on Jul 17, 2016 at 9:14pm PDT", "images": ["https://cdn.vox-cdn.com/uploads/network/placeholder_image/2/The_Verge.644.jpg", "http://www.theverge.com/icons/native-ad-placeholder.png"], "top_img": "https://cdn.vox-cdn.com/uploads/network/placeholder_image/2/The_Verge.644.jpg", "keywords": [], "authors": ["Jamieson Cox", "Matthew Davis"], "canonical_link": "https://www.theverge.com/2016/7/17/12210852/kim-kardashian-snapchat-taylor-swift-kanye-west-famous", "title": "Kim Kardashian used Snapchat to prove Taylor Swift was lying about Kanye West's Famous", "meta_data": {"twitter": {"card": "summary_large_image", "site": "@verge"}, "fb": {"app_id": 549923288395304}, "og": {"site_name": "The Verge", "title": "Kim Kardashian used Snapchat to prove Taylor Swift was lying about Kanye West's Famous", "description": "'I really appreciate you telling me about it, that's really nice'", "url": "https://www.theverge.com/2016/7/17/12210852/kim-kardashian-snapchat-taylor-swift-kanye-west-famous", "type": "article", "image": "https://cdn.vox-cdn.com/uploads/network/placeholder_image/2/The_Verge.644.jpg"}, "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Verge", "google-site-verification": "IucFf_TKtbFFH8_YeFyEteQIwYPdANM1R46_U9DpAr4", "robots": "index,follow,max-image-preview:large", "description": "'I really appreciate you telling me about it, that's really nice'", "article": {"published_time": "2016-07-18T03:43:25.000Z", "modified_time": "2016-07-18T03:43:25.000Z"}, "author": "Matthew Davis", "parsely-type": "post", "parsely-title": "Kim Kardashian used Snapchat to prove Taylor Swift was lying about Kanye West's Famous", "parsely-link": "https://www.theverge.com/2016/7/17/12210852/kim-kardashian-snapchat-taylor-swift-kanye-west-famous", "parsely-image-url": "https://cdn.vox-cdn.com/uploads/network/placeholder_image/2/The_Verge.644.jpg", "parsely-pub-date": "2016-07-18T03:43:25.000Z", "parsely-section": "front-page", "parsely-tags": "verge,front-page,entertainment,music", "parsely-author": "Matthew Davis", "next-head-count": 32}, "movies": ["https://www.youtube.com/embed/p7FCgw_GlWc?showinfo=0", "https://volume.vox-cdn.com/embed/eadc24634?autoplay=false&placement=article&player_type=youtube&tracking=article:middle"], "publish_date": 1468710000.0, "source": "http://www.theverge.com", "summary": ""}