{"url": "https://www.usatoday.com/story/sports/nba/cavaliers/2018/09/27/tristan-thompson-cavaliers-eastern-conference-favorite-celtics-sixers/1449997002/", "text": "Tristan Thompson: Cavaliers still the team to beat in East without LeBron James\n\nShow Caption Hide Caption Burning questions as NBA training camps open SportsPulse: LeBron James heading to the Lakers is just one of many burning topics as we inch closer to the 2018-19 NBA season. USA TODAY\n\nThey might have lost the best player of his generation, but Tristan Thompson still has high hopes for the Cavaliers. And he says the Eastern Conference still runs through Cleveland.\n\nThompson reminded reporters at practice Thursday that the Cavaliers are four-time defending conference champs, and they remain the team to beat in the East despite LeBron James leaving in free agency.\n\n\"We're still four-time Eastern Conference champions, so until you take us down from that, teams ain't got much to say,\" Thompson said. \"Boston, Philly, they ain't got much to say. Boston had home court Game 7 and lost. Philly, you guys almost got swept. Toronto — we already know that story. So until someone takes us down, there's not much they can really say.\"\n\nTristan Thompson: “We’re still 4-time Eastern Conference champions, so until you take us down from that, teams ain’t got much to say. Boston, Philly, they ain’t got much to say. Boston had homecourt Game 7 and lost. Philly, you guys almost got swept. Toronto - we know that story” pic.twitter.com/gnGqd4mGeM — Ben Axelrod (@BenAxelrod) September 27, 2018\n\nWith James leading the way last season, the Cavaliers swept the Raptors in the second round and beat the Celtics in the East finals in seven games, including the decisive win in Boston. Cleveland was swept in the NBA Finals by the Golden State Warriors, and James signed with the Los Angeles Lakers this summer.\n\nThe 76ers lost to the Celtics in five games in the second round.\n\nIt didn't take long for Thompson's comments to make their way to Cleveland's conference foes. They predictably do not share Thompson's enthusiasm for the Cavaliers.\n\nCeltics forward Marcus Morris tweeted: \"@RealTristan13 Cut it out. Get that vacation ready early this year fam! Ain’t s— going through the Cavs this year! #facts\"\n\nIn a Instagram comment, Simmons sarcastically replied: \"@realtristan13 hah yeh ok buddy see you soon\"\n\nMORE NBA\n\n'HE NOT GOD:' Lonzo not nervous about playing alongside LeBron\n\nDURANT: Expects to get snubbed for awards based on 'pure hate'\n\nIRVING: Kyrie says all the right things about his future with Celtics\n\nANTHONY: Is he willing to play a bench role with the Rockets?\n\nHopes are high in Boston, Philadelphia and Toronto heading into the season. The Celtics welcome back Kyrie Irving and Gordon Hayward from injuries. The 76ers have two of the best young players in the NBA in Ben Simmons and Joel Embiid. And the Raptors swung a blockbuster trade for Kawhi Leonard, who was one of the top two-way players in the league when last healthy.\n\nThe Westgate Las Vegas SuperBook projects Boston (57.5 wins), Philadelphia (54.5) and Toronto (54.5) as the top three teams in the East. Westgate is not as bullish on the Cavaliers as Thompson, projecting Cleveland at 30.5 wins and near the bottom of the East.\n\nFollow Matt Eppers on Twitter @meppers.", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/presto/2018/09/28/USAT/fb61efe5-dacc-4f2a-837b-3b60d4b73664-2018-09-27_Tristan_Thompson1.jpg?auto=webp&crop=4382,2465,x1,y114&format=pjpg&width=1200", "https://www.gannett-cdn.com/presto/2018/09/24/USAT/4ef6a1c5-6cb1-43f3-950f-8cc7fa791341-lebron-presser.JPG", "http://www.gannett-cdn.com/media/2018/09/10/USATODAY/usatsports/gettyimages-969212400.jpg", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/presto/2018/09/28/USAT/fb61efe5-dacc-4f2a-837b-3b60d4b73664-2018-09-27_Tristan_Thompson1.jpg?auto=webp&crop=4382,2465,x1,y114&format=pjpg&width=1200", "keywords": [], "authors": ["Matt Eppers"], "canonical_link": "https://www.usatoday.com/story/sports/nba/cavaliers/2018/09/27/tristan-thompson-cavaliers-eastern-conference-favorite-celtics-sixers/1449997002/", "title": "Tristan Thompson: Cavaliers still the team to beat in East without LeBron James", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/sports/nba/cavaliers/2018/09/27/tristan-thompson-cavaliers-eastern-conference-favorite-celtics-sixers/1449997002/sports/nba/cavaliers", "theme-color": "#ffffff", "og": {"type": "article", "title": "Tristan Thompson: Cavaliers still the team to beat in East without LeBron James", "description": "The Cavaliers might have lost the best player of his generation, but Tristan Thompson says the Eastern Conference stills runs through Cleveland.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/09/28/USAT/fb61efe5-dacc-4f2a-837b-3b60d4b73664-2018-09-27_Tristan_Thompson1.jpg?auto=webp&crop=4382,2465,x1,y114&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "The Cavaliers might have lost the best player of his generation, but Tristan Thompson says the Eastern Conference stills runs through Cleveland.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1538002800.0, "source": "https://www.usatoday.com", "summary": ""}