{"url": "https://en.wikipedia.org/wiki/The_Crown_(TV_series)", "text": "Historical drama television series\n\nThe Crown is a historical drama television series about the reign of Queen Elizabeth II, created and principally written by Peter Morgan and produced by Left Bank Pictures and Sony Pictures Television for Netflix. Morgan developed it from his drama film The Queen (2006) and especially his stage play The Audience (2013). The first season covers the period from Elizabeth's marriage to Philip, Duke of Edinburgh, in 1947 to the disintegration of her sister Princess Margaret's engagement to Group Captain Peter Townsend in 1955. The second season covers the period from the Suez Crisis in 1956 to the retirement of Prime Minister Harold Macmillan in 1963 and the birth of Prince Edward in 1964. The third season spans 1964 to 1977, includes Harold Wilson's two periods as prime minister, and introduces Camilla Shand. The fourth season spans 1979 to the early 1990s and includes Margaret Thatcher's tenure as prime minister and Prince Charles's marriage to Lady Diana Spencer. The fifth and sixth seasons, which will close the series, will cover the Queen's reign into the 21st century.\n\nFor each of the two-season increments, new actors fill the roles to reflect the ageing process over the periods of time portrayed. Claire Foy portrays the Queen in the first two seasons, alongside Matt Smith as Prince Philip and Vanessa Kirby as Princess Margaret. For the third and fourth seasons, Olivia Colman takes over as the Queen, Tobias Menzies as Prince Philip, and Helena Bonham Carter as Princess Margaret. Also added to the cast in season three is Josh O'Connor as Prince Charles. In the fourth season, new cast members include Emma Corrin as Lady Diana Spencer and Gillian Anderson as Margaret Thatcher. Imelda Staunton, Jonathan Pryce, and Lesley Manville will succeed Colman, Menzies, and Bonham Carter, respectively, for the final two seasons, while Dominic West and Elizabeth Debicki will take the roles of Charles and Diana. Filming takes place at Elstree Studios in Borehamwood, Hertfordshire, with location shooting throughout the United Kingdom and internationally. The first season was released by Netflix on 4 November 2016, the second on 8 December 2017, the third on 17 November 2019, and the fourth on 15 November 2020. The fifth season is set for release on 9 November 2022.[4] As of 2020 , the estimated production budget of The Crown has been reported to be $260 million, making it one of the most expensive television series ever.[5]\n\nThe Crown has been praised by critics for its acting, directing, writing, cinematography, and production values, though its historical inaccuracies have received some criticism, particularly within the fourth season. It has received numerous accolades, including a total of sixty-three Primetime Emmy Award nominations for its first four seasons, winning twenty-one, including Outstanding Drama Series for its fourth season, and seven awards for the cast.[6] The series has also twice won the Golden Globe Award for Best Television Series - Drama, at the 74th and 78th ceremonies, with additional acting wins for Foy, Colman, Corrin, O'Connor and Anderson.[7]\n\nPlot [ edit ]\n\nThe Crown portrays the life of Queen Elizabeth II from her wedding in 1947 to Philip, Duke of Edinburgh,[8] until the early 21st century.[9][10]\n\nThe first season depicts events up to 1955, with Winston Churchill resigning as prime minister and the Queen's sister Princess Margaret deciding not to marry Peter Townsend.[11] The second season covers the Suez Crisis in 1956, leading to the retirement of Prime Minister Anthony Eden in 1957; the retirement of Prime Minister Harold Macmillan in 1963, following the scandal of the Profumo affair; and the birth of Prince Edward in 1964.[12][13][14]\n\nThe third season covers 1964 to 1977, beginning with Harold Wilson's election as prime minister and ending with the Queen's Silver Jubilee,[15] also covering Edward Heath's time as prime minister.[16] Camilla Shand is also introduced.[16] The fourth season is set during Margaret Thatcher's period as prime minister from 1979 to 1990 and also focuses on Lady Diana Spencer.[17]\n\nCast and characters [ edit ]\n\nFeatured [ edit ]\n\nThe following actors are credited in the opening titles of up to two episodes in a season:\n\nEpisodes [ edit ]\n\nSeries Episodes Originally released 1 10 4 November 2016 ( ) 2 10 8 December 2017 ( ) 3 10 17 November 2019 ( ) 4 10 15 November 2020 ( ) 5 10 9 November 2022 ( )\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nIn November 2014, it was announced that Netflix was to adapt the 2013 stage play The Audience into a television series.[24] Peter Morgan, who wrote the 2006 film The Queen and the play, is the main scriptwriter for The Crown.[25] The directors of the first season are Stephen Daldry, Philip Martin, Julian Jarrold, and Benjamin Caron.[26] The first ten-part season was the most expensive drama produced by Netflix and Left Bank Pictures to date, costing at least £100 million.[27][28][29] A second season was commissioned,[30][31] with the series intended to span sixty episodes over six seasons.[8] By October 2017, \"early production\" had begun on an anticipated third and fourth season,[32] and by the following January, Netflix confirmed the series had been renewed for third and fourth seasons.[17]\n\nIn January 2020, Morgan announced that the series had been renewed for a fifth and final season. Speaking to ending the series with five seasons, after it had been intended to last six, Morgan said while crafting the stories for season five, \"it has become clear to me that this is the perfect time and place to stop\"; Netflix and Sony supported Morgan's decision.[9] However, in July 2020, Netflix announced that the series would receive a sixth season as originally intended. Morgan said that when the storylines were being discussed for season five, \"it soon became clear that in order to do justice to the richness and complexity of the story we should go back to the original plan and do six seasons\". He added that the final two seasons would enable them \"to cover the same period in greater detail\".[33]\n\nCasting [ edit ]\n\nBy November 2014, Claire Foy had entered negotiations to portray Queen Elizabeth II.[34] By May 2015, Vanessa Kirby was in negotiations to portray Princess Margaret.[35] In June 2015, John Lithgow was cast as Winston Churchill and Matt Smith was cast as Prince Philip, while Foy was confirmed as Queen Elizabeth II.[36] Also starring in the first season were Victoria Hamilton, Jared Harris, and Eileen Atkins.[37]\n\nThe Left Bank producers stated that Smith was paid more than Foy for the first two seasons, partly because of his Doctor Who fame.[38] This led to a gender pay gap controversy, including the creation of a petition asking Smith to donate the difference between his and Foy's salary to the Time's Up Legal Defense Fund.[39] Left Bank later apologised to Foy and Smith for putting them \"at the center of a media storm... through no fault of their own\". Left Bank also clarified that they \"are responsible for budgets and salaries; the actors are not aware of who gets what, and cannot be held personally responsible for the pay of their colleagues\". They added that they support \"the drive for gender equality in film and TV and [were] eager to talk to the British Time's Up campaign and [were] already speaking to Era 50:50, a group campaigning for gender equality on screen and stage\".[40] Suzanne Mackie, Left Bank's creative director, did note that in future no actor would be paid more than the actress portraying the Queen.[38] Regarding the controversy, Foy was \"not [surprised about the interest in the story] in the sense that it was a female-led drama. I'm not surprised that people saw [the story] and went, 'Oh, that's a bit odd'. But I know that Matt feels the same that I do, that it's odd to find yourself at the center [of a story] that you didn't particularly ask for.\"[41] Smith noted that he supported Foy and was \"pleased that it was resolved and [the producers] made amends for it because that's what needed to happen\". The Hollywood Reporter noted it was unclear what Smith was referring to as resolved, since Netflix and Left Bank had not commented further.[42] Foy later described reports that she had received backpay to bring her salary up to parity as \"not quite correct\".[43]\n\nThe producers recast the continuing roles with older actors every two seasons, as the timeline moves forward.[44] In October 2017, Olivia Colman was cast as Queen Elizabeth II for the third and fourth seasons.[32] By January 2018, Helena Bonham Carter and Paul Bettany were in negotiations to portray Princess Margaret and Prince Philip, respectively, for these seasons.[45][14] However, by the end of the month Bettany was forced to drop out due to the time commitment required.[46] By the end of March 2018, Tobias Menzies was cast as Prince Philip for the third and fourth seasons.[47] In early May 2018, Bonham Carter was confirmed to have been cast, alongside Jason Watkins as Prime Minister Harold Wilson.[23] The next month, Ben Daniels was cast as Tony Armstrong-Jones for the third season,[48] along with Erin Doherty joining the series as Princess Anne.[49] A month later, Josh O'Connor and Marion Bailey were cast as Prince Charles and the Queen Mother, respectively, for the third and fourth seasons.[50] In October 2018, Emerald Fennell was cast as Camilla Shand.[51] In December 2018, Charles Dance was cast as Louis Mountbatten.[52] In April 2019, Emma Corrin was cast as Lady Diana Spencer for the fourth season.[53] Gillian Anderson, who had been rumoured since January 2019 to be in talks to portray Margaret Thatcher in the fourth season, was officially confirmed for the role in September 2019.[54][55][56]\n\nIn January 2020, Imelda Staunton was announced as succeeding Colman as the Queen in the fifth season, with her role in the final season reported in July.[9][33] Also in July 2020, Lesley Manville was announced as portraying Princess Margaret,[33][57] and the following month, Jonathan Pryce and Elizabeth Debicki had been cast as Prince Philip and Diana, Princess of Wales, respectively.[58][59] In October 2020, Dominic West was in talks to play Prince Charles.[60] His casting was confirmed in April 2021 when the start date for production of the fifth season was announced.[61] In June 2021, Jonny Lee Miller was cast as John Major.[62] During the same month, Olivia Williams confirmed during an interview that she had joined the cast as Camilla Parker Bowles for the series's fifth and sixth seasons.[63] In July 2021, actress Marcia Warren joined the cast during filming as Queen Elizabeth, The Queen Mother.[64] That same month, the casting of Claudia Harrison as Princess Anne was also confirmed.[65] In September 2021, Khalid Abdalla was announced to play Dodi Fayed and that Salim Daw would be portraying Mohamed Al-Fayed.[66] Later that month, it was confirmed that Timothy Dalton had been cast as Peter Townsend.[67] In January 2022, Humayun Saeed had been cast as Dr Hasnat Khan.[68]\n\nA casting search for actors to play teenage Prince William and Prince Harry in the sixth season began in March 2022. The new actor for Prince William would replace Senan West, who was cast as a young Prince William for season five, with the other new castings for the fifth season expected to remain for the sixth season.[69] In April 2022, a casting call was posted for a young Catherine Middleton to be portrayed in the sixth season.[70]\n\nIn September 2022, it was announced that Rufus Kampas and Ed McVey will portray Prince William, and Meg Bellamy will portray Catherine Middleton.[71]\n\nFilming [ edit ]\n\nAn estimated 25% of the first season was filmed at Elstree Studios in Borehamwood, Hertfordshire, with the remainder filmed on location, altogether taking 152 days. Sets for private quarters, the interior of a private jet, the cabinet room, and the exterior of 10 Downing Street, were built at Elstree Studios,[31][72] while Lancaster House, Wrotham Park and Wilton House were used to double as Buckingham Palace. Ely Cathedral and Winchester Cathedral stood in for Westminster Abbey, while locations in South Africa doubled as Kenya.[31] Additional locations in the UK included Belvoir Castle,[73] Waddesdon Manor, Eltham Palace, the Royal Naval College,[74] Goldsmiths' Hall, Shoreham Airport, New Slains Castle,[75] Balmoral Castle, Cruden Bay, Lyceum Theatre, Loseley Park, Hatfield House,[72] The Historic Dockyard Chatham,[76] Southwark Cathedral, Ardverikie House, Englefield House, Wellington College, the Great Central Railway (heritage railway) and the Glenfeshie Estate.[77] Filming on the second season began in early October 2016.[44] Each episode of the first two seasons would shoot for about 22 days, with each costing about £5 million to produce.[38] The third season began filming in July 2018,[78] and concluded in February 2019. The fourth season began filming in August 2019 and wrapped in March 2020.[79][80] Shooting locations used to double foreign settings included Manchester (New York City), Málaga and Almería (Sydney and other Australian settings), as well as Atlanterra, Cádiz (Mustique).[81] The filming of the fifth season began in July 2021.[82] The year break in filming between the end of season four and the start of season five was built into the series's production schedule and was not related to the COVID-19 pandemic.[83] On 16 February 2022, items previously used in the series's production were stolen from three vehicles, most of which were described to have \"limited value for resale\", but \"are valuable as pieces to the UK film industry\".[84] Filming for the sixth season began in August 2022,[69] but Morgan noted he expected it to stop for a period of time in September following the death of Elizabeth II \"out of respect\".[85]\n\nThe re-enactment of the removal of King George VI's cancerous lung, originally performed by Sir Clement Price Thomas, was researched and planned by Pankaj Chandak, specialist in transplant surgery at Guy's Hospital, London. Chandak and his surgical team then became part of the actual scene filmed for the show.[86] The surgical model of King George VI was donated to the Gordon Museum of Pathology in King's College, London for use as a teaching aid.[87]\n\nHistorical accuracy [ edit ]\n\nThe series has been both commended and criticised for its depiction of historical events.[88]\n\nSeason 1 [ edit ]\n\nThough the show depicted a dispute over Michael Adeane being the natural successor to Tommy Lascelles as the Queen's private secretary, this did not, in reality, happen; Martin Charteris accordingly took the role in 1972.[89][90]\n\nChurchill's wife Clementine is depicted as overseeing the burning of her husband's portrait by artist Graham Sutherland shortly after Churchill's retirement. In reality, the painting was destroyed by the brother of their private secretary, Grace Hamblin, without the involvement of Hamblin herself.[89][91]\n\nRoyal biographer Hugo Vickers denied that Princess Margaret had acted as monarch whilst the Queen was on tour, and claimed that her speech at the ambassador's reception never happened. Charteris was on tour with the Queen and not in London during these events. The Queen Mother bought the Castle of Mey a year earlier than depicted on the show, and often looked after Prince Charles and Princess Anne whilst the Queen was away.[89][92]\n\nThe show has been interpreted as perpetuating the idea that the Queen and Churchill forced Princess Margaret to give up her plan to marry Peter Townsend, and depicted the Queen informing her that, due to the Royal Marriages Act 1772, she would no longer be a member of the family if they married. However, there is clear evidence that, in reality, efforts had been made to prevent any further delay, which would have allowed Princess Margaret to keep her royal title and her civil list allowance, stay in the country, and continue with her public duties.[93]\n\nSeason 2 [ edit ]\n\nAfter season two was released, Peggy Noonan of The Wall Street Journal commented on its historical inaccuracy, and argued for \"more truth in art and entertainment\".[94] Baron Nahum, for instance, continued to be featured in the season, but in reality had died in 1956.[95] The show also depicts the Queen as giving a speech at a Jaguar factory, when in reality there is no evidence that she gave a speech there. Similarly, while it is possible that she might have met Lord Altrincham to discuss his article, there is no record of it.[89][96]\n\nVickers wrote that the Queen did condemn the Duke of Windsor after she read the Marburg Files, but suggested that the series gave the false implication that the Duke was banished from the royal family upon publication. In reality, the Duke remained in contact with his family, and his public appearances continued.[97]\n\nThe depiction of the relationship between the American First Lady Jackie Kennedy and the royal family also drew criticism as inaccurate; reports from the time indicate that she had described Prince Philip as \"nice but nervous\", with no real bond between them.[98] The implication that the Queen visited Ghana to compete with Kennedy's popularity was ridiculed by critics.[99] Reviews noted that that episode ignored more significant events, such as president Kennedy's sister-in-law Lee and her husband Prince Stanisław Albrecht Radziwiłł's initial exclusion from the banquet invitation list due to their divorcee status; they were eventually invited,[100] although Princess Margaret and Princess Marina did not attend, despite the Kennedys apparently wanting to meet them.[101]\n\nGordonstoun School responded to its negative portrayal, claiming that Prince Charles's personal feedback to the school had been overwhelmingly positive.[102] Vickers said that the same episode inaccurately depicted Prince Philip's sister's death in a plane crash as having arisen from his own misbehaviour at Gordonstoun: \"It is beyond me how serious film-makers would wish to turn such a dreadful tragedy into a series of invented scenes bearing no relation to the truth\".[102]\n\nPhil Owen of The Wrap saw dry comedy in Northam's portrayal of Prime Minister Eden, stating: \"I'm assuming that creator Peter Morgan meant for it to be comedy. There's really no other explanation for why Jeremy Northam played Prime Minister Anthony Eden like he's having a nervous breakdown in every scene.\"[103]\n\nSeason 3 [ edit ]\n\nThe Queen did not visit Churchill following his final stroke. Vickers claims that by then he was senile and incapable of holding a conversation.[104] Anthony Blunt's exposure as a Soviet spy also drew criticism. Vickers noted that the episode did not mention that he was publicly exposed in 1979 and stripped of his knighthood, whilst also noting that he never resided at Buckingham Palace and ridiculing a scene in which he discusses his exposure with Prince Philip in an attempt to blackmail the royal family.[89][105]\n\nThe depiction of the relationship with President Johnson has been criticised. It has been suggested that he did not refuse to attend Churchill's funeral, in response to Wilson's refusal to support the Vietnam War, but that he was genuinely unable due to poor health. His disappointment with Wilson's views on Vietnam had developed much later.[89][106] Historians also denied the episode's implication that no US president had ever been to Balmoral; Eisenhower had visited Balmoral whilst president in 1959.[107] Critics noted that the episode did not mention that Johnson had been the only president since Truman never to have met the Queen.[89][108] The implication that Johnson did not know who Princess Margaret was before her visit to America was also criticised.[89] The Princess did attend a White House dinner, but the details are mostly fictional (such as her carousing with Johnson and kissing him, dirty limericks, and helping secure a US bailout, which in fact had already been negotiated).[109][110] The depiction of Princess Margaret and President Johnson publicly insulting the late President Kennedy during the same White House dinner was seen as highly unlikely, as members of the Kennedy Family, as well as John Connally, who was riding with Kennedy during the assassination, were reportedly among those who attended the dinner.[111]\n\nThe relationship with Princess Alice has also drawn criticism for Prince Philip's depiction as being estranged from his mother and objecting to her visiting London. In reality, he visited her regularly and often transported her by plane, and her depicted interview with a journalist from The Guardian never happened. Vickers also stated that the same episode ignored that Prince Philip encouraged her to move to London permanently.[104]\n\nPrince Charles did visit the Duke of Windsor in Paris in 1972,[112] although the depiction of the letters concerning his affections for Camilla was criticised: the Prince and Camilla had met, but were not intimately close during the Duke's lifetime.[88][104] The Queen did visit the Duke ten days before his death, but this had been long-planned and not requested at short notice.[104] Simpson was not with the Duke when he died.[89][113]\n\nThe timeframe of Woods's posting as Dean of Windsor around the time of the Apollo 11 spaceflight and lunar landing in July 1969 is inaccurate, as he had taken the role in 1962.[114][115] Prince William of Gloucester had also died five years before the Queen's Silver Jubilee.[89]\n\nIt has been suggested that there was no plot by the palace to prevent Prince Charles and Camilla's marriage, with Camilla's love for Andrew Parker Bowles being genuine, and Prince Charles unable to decide.[89][116] It has also been suggested that Princess Anne's relations with Andrew Parker Bowles did not overlap with Prince Charles and Camilla's introduction. Reviews of the episode noted that it ignored more significant events, citing Princess Anne's 1973 wedding to Captain Mark Phillips and her attempted kidnapping in 1974.[88]\n\nSeason 4 [ edit ]\n\nVickers further argued that season four is \"yet more subtly divisive than earlier seasons\", with \"pretty much every character\" shown as \"dislikeable\", and that \"every member of the royal family ... comes out of it badly, except the Princess of Wales\".[117] He also called season four the least accurate season in the series.[118] Royal commentator Emily Andrews said that \"sources close to Prince Charles\" have labelled some of the scenes \"trolling on a Hollywood budget\".[119] It was also reported that Prince Charles and Camilla turned off comments on their Instagram and Twitter accounts, such was the intensely negative reaction to their portrayals.[118]\n\nThroughout the season, the Private Secretary to the Sovereign is portrayed as Sir Martin Charteris, yet in reality, he retired in 1977.[120]\n\nThe opening scene when Prince Charles first meets Diana is fictionalised, although they did meet during a date with her sister. Vickers has stated that Prince Charles had no personal contact with Camilla during the first five years of his marriage; their relationship developed after 1986, by which time the marriage had broken down.[117] The frenzy around Prince Charles and Diana's Australian tour is accurately depicted, including his feelings of being overshadowed by Diana, which have been confirmed by multiple sources. Diana's former press secretary has confirmed their fractious relationship when away from the media.[121] Their schedule was never revised to accommodate Prince William, and the sheep station was arranged for them in advance by the former Australian Prime Minister, specifically so that the couple could be with their son each night.[117] According to Dickie Arbiter, the meeting in which Sir John Riddell, the Prince of Wales's private secretary, questions Diana's mental fitness before her solo trip to New York never happened.[122]\n\nMountbatten did not write to the Prince of Wales shortly before he died, although he had written advising him in the past.[117] The newsreel clips of Northern Ireland shown alongside Mountbatten's assassination included events that had happened years earlier, and others that had not yet occurred.[123]\n\nVickers suggested that almost all the details concerning how visitors are treated at Balmoral are inaccurate, and noted that the Thatchers' first visit is depicted out of sequence with Mountbatten's funeral. The Thatchers did not enjoy their visits to Balmoral, but there is no evidence that the Prime Minister dressed inappropriately.[121] Diana's visit happened an entire year later, when the Queen was not present. He added that Diana was already familiar with royal etiquette, and would not have needed the intensive lessons given by Lady Fermoy that were portrayed in the show.[117]\n\nCharles Moore, Margaret Thatcher's biographer, deemed the scene where Thatcher begs the Queen to dissolve Parliament so she can stay on as PM \"factual nonsense\".[121] It is true, however, that she used to do her own ironing at Downing Street.[123] It is unlikely that Prince Philip ever mocked her for being a scientist, given his own interest in the sciences.[123] Mark Thatcher going missing during the Paris–Dakar Rally did not coincide with the Falklands invasion.\n\nFagan has said that his conversation with the Queen in the palace bedroom was \"short, polite and non-controversial\", and that he never spoke about Margaret Thatcher.[123]\n\nThe scene where the Queen guesses who the Prime Minister might appoint to cabinet is entirely fictional, nor would the PM have ever left a royal audience early or criticised the Queen for her privilege.[123] Vickers says that, in reality, it was the Queen's press secretary who took it upon himself to pass his own views about the Prime Minister to the media, and he was forced to leave the palace as a consequence.\n\nThe plot involving the family's relationship with the Bowes-Lyon sisters is largely inaccurate. Princess Margaret played no part in discovering their existence, nor did she confront her mother about this. John \"Jock\" Bowes-Lyon died six years before Edward VIII's abdication, and the sisters were placed in the Royal Earlswood Hospital by their mother Fenella in 1941. The Queen Mother believed her nieces to be dead until 1982 and upon discovering that they were alive, sent money for toys and sweets on their birthdays and at Christmas. According to the Bowes-Lyon family, there was never any attempt at a coverup.[124] The relationship between Princess Margaret and Father Derek \"Dazzle\" Jennings is also heavily fictionalised. Jennings did not have any involvement with the Bowes-Lyon sisters, and remained Princess Margaret's friend and spiritual advisor, with the Princess visiting his sickbed before he died in 1995.[125] Similarly, Princess Margaret's interest in Catholicism is underplayed; she did not convert, but Jennings was reportedly convinced she would, even going so far as to arrange for a dinner between the Princess and Cardinal Hume in 1988.[126]\n\nRelease [ edit ]\n\nThe series's first two episodes were released in the United Kingdom on 1 November 2016.[127] The first season was released worldwide in its entirety on 4 November 2016.[129] The second season was released on 8 December 2017.[130] The third season was released on 17 November 2019.[131] The fourth season was released on 15 November 2020.[132] The fifth season is set to be released on 9 November 2022.[83][4]\n\nThe first season was released on DVD and Blu-ray in the United Kingdom on 16 October 2017[133] and worldwide on 7 November.[134] The second season was released on DVD and Blu-ray in the United Kingdom on 22 October 2018[135] and worldwide on 13 November 2018.[136] The third season was released on DVD and Blu-ray in the United Kingdom on 2 November 2020[137] and worldwide the following day.[138]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nThe Crown has been praised as a drama, being described by The Telegraph as \"TV's best soap opera\" and given a 5/5 rating, although some reviewers, such as in The Times, raised concerns that some of the episodes are based on false premises.[147][148] The series received an overall score of 90% on Rotten Tomatoes and 84 on Metacritic.[149][150]\n\nFor the first season, review aggregator Rotten Tomatoes reported 88% approval based on 74 reviews with an average rating of 8.61/10. Its critical consensus reads, \"Powerful performances and lavish cinematography make The Crown a top-notch production worthy of its grand subject\".[139] Metacritic gives the season a score of 81 out of 100, based on 29 critics, indicating \"universal acclaim\".[140] For the second season, Rotten Tomatoes reported 89% approval from 83 reviews, with an average of 8.35/10: \"The Crown continues its reign with a self-assured sophomore season that indulges in high drama and sumptuous costumes\".[141] Metacritic holds a score of 87 out of 100, based on 27 critics, with \"universal acclaim\".[142] For the third season, Rotten Tomatoes reported 90% approval based on 100 reviews, with an average of 8.54/10: \"Olivia Colman shines, but as The Crown marches on in reliably luxurious fashion through time it finds space for the characters around her, providing ample opportunity for the appealing ensemble to gleam, too.\"[143] Metacritic gives a score of 84 out of 100 based on 30 critics, indicating \"universal acclaim\".[144] For the fourth season, Rotten Tomatoes reports 95% approval from 110 reviews, with an average of 8.62/10. Its critical consensus reads: \"Whatever historical liberties [the season] takes...are easily forgiven thanks to the sheer power of its performances – particularly Gillian Anderson's imposing take on The Iron Lady and newcomer Emma Corrin's embodiment of a young Princess Diana\".[145] On Metacritic, the season holds a score of 85 out of 100 based on 27 critics, indicating \"universal acclaim\".[146]\n\nHowever, the series has also received backlash from British critics and the royal family. British reviewers have criticised the fourth season for being \"inaccurate\" and \"anti-monarchy\".[151][152][153] Simon Jenkins writing for The Guardian described it as \"fake history\", \"reality hijacked as propaganda, and a cowardly abuse of artistic licence\" which fabricated history to suit its own preconceived narrative, and argued that \"Morgan could have made his point truthfully\".[154] Royal biographer Sally Bedell Smith criticised the inaccuracies and negative portrayal of the royal family, stating, \"Because The Crown is such a lavish and expensive production, so beautifully acted and cleverly written, and so much attention has been paid to visual details about historical events, viewers are tricked into believing that what they are seeing actually happened\", concluding that \"while the earlier seasons were period pieces, this is recent history, so it seems more cruel in its false depictions\".[155] Following some negative reactions to the fourth season, British culture secretary Oliver Dowden suggested that the series should have a fiction warning at the beginning as a disclaimer.[156] During a 2021 appearance on The Late Late Show with James Corden, Prince Harry stated that he was comfortable with The Crown's portrayal of the royal family, noting that, while as a work of fiction it is \"not strictly accurate\", it does give a \"rough idea\" of the pressures of \"putting duty and service above family and everything else\". Harry also said that, if he was ever to feature on the series, he would like to be portrayed by Damian Lewis.[157][158]\n\nAwards and nominations [ edit ]\n\nCostume exhibit [ edit ]\n\nCostumes from both The Crown and The Queen's Gambit were displayed by Brooklyn Museum as part of its virtual exhibition The Queen and the Crown.[159][160]\n\nPotential prequel series [ edit ]\n\nIn April 2022, it was reported that Netflix and Left Bank were having preliminary conversations about a prequel.[161] It is believed that the series will span a period of nearly 50 years, starting with the death of Queen Victoria in 1901 and ending around the wedding of Queen Elizabeth II in 1947. The series will also reportedly cover the reigns of the four kings that ruled during that period: Edward VII, George V, Edward VIII and George VI.[162]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/1/18/The_Crown_Title_Card.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/18/The_Crown_Title_Card.jpg/250px-The_Crown_Title_Card.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/John_Lithgow_8_by_David_Shankbone.jpg/125px-John_Lithgow_8_by_David_Shankbone.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/18/The_Crown_Title_Card.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Crown_(TV_series)", "title": "The Crown (TV series)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/1/18/The_Crown_Title_Card.jpg", "width": 640, "height": 318}, "title": "The Crown (TV series) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}