{"url": "https://www.independent.co.uk/life-style/design/millennials-interior-trends-home-design-top-wood-stone-purple-rain-a8160916.html", "text": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nBreaking News email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nLED lights in the shower that bathe a user in colour and a reclaimed wood accent wall near the fireplace. Artisan hand-baked clay tiles as a kitchen backsplash and a bathroom exhaust fan that turns on and off through a sensor.\n\nA barn door on the master bedroom closet and upper kitchen cabinets that lower to the counter with the touch of a button, eliminating the need for a step stool.\n\nRustic-tech chic is hot, particularly with millennials who like the yin and yang approach to home decorating.\n\nEvery year, interior designers, architects, real estate professionals and home builders pour into Las Vegas to view the latest trends at the International Builders Show, the Kitchen and Bath Industry Show and the Consumer Electronics Show.\n\nWhile they’re checking out ideas for the future, these industry pros attempt to match what they see to the personality of their local market and to upcoming home buyers, particularly millennials.\n\nSome of the design trends seen around the country that particularly resonate with millennials may seem contradictory: these buyers want modern, sleek lines in their homes, yet they also love rustic looks. Millennials love natural materials such as wood and stone but are also drawn to coloured lights that can turn a shower into purple rain. Smart home technology is revered, but so are artisanal items that can add a curated look to their homes.\n\nBarn doors seem to crop up more and more often in new or remodelled homes, sometimes as sliding doors to define spaces but allowing them to be entirely open and other times in smaller iterations such as a closet or pantry door.\n\n“Farmhouse sinks and mix-and-match faucet handles were everywhere at the Kitchen and Bath show,” says Stacy DeBroff, a brand strategist and chief executive of Influence Central in Boston. “One company at the intersection of rustic style and innovation is Stikwood, which takes recycled wood and turns it into peel-and-stick natural wood siding.”\n\nSusan Matus, director of project development at Case Design/Remodeling in Bethesda, Maryland, says Stikwood could be used on one wall as a focal point or in a mudroom or laundry room.\n\n“That kind of rustic look is turning up unexpectedly in places where you want to mix textures such as natural wood next to something shiny and sleek,” Matus says.\n\nJulia Walter, showroom manager at Boffi Georgetown, an Italian luxury kitchen and bath designer, says Boffi displays rustic wood shelves with a modern shape, metal sinks and big mirrors.\n\nThe new generation of homeowners are remodelling spaces with classic features, such as a fireplace (Geoffrey Hogdon)\n\n“It’s definitely a trend to combine reclaimed wood with a contemporary steel frame,” Walter says. “It’s an interesting play between old and new. People like contemporary lines, but they want the warmth of bringing in an older element into their home, especially the kitchen where people have an emotional connection with their childhood kitchen.”\n\nOn the opposite end of the spectrum from natural wood are coloured LED lights, which are turning up in gas fireplaces, kitchens and even bathrooms.\n\n“Coloured lights that you can control with an app were everywhere at the Vegas shows from gas fireplaces to above-kitchen cabinets to around the rim of a shower,” DeBroff says. “They had shower heads with lights so that you can take a purple shower or a red shower on a whim. Essentially, you can make a space really cool that isn’t otherwise all that interesting.”\n\nWhile shower heads with coloured lights are already available on Amazon, DeBroff says that high-end toilets are being designed with a built-in night light that illuminates the water in the bowl. She anticipates that in a year or so consumers will be able to find an attachment that adds that feature to regular toilets.\n\nPops of colour are turning up in the kitchen, too, with small household appliances and pots and pans manufactured in a wide range of colours. Larger kitchen appliances in bright colours and pastels are available from manufacturers, says Danielle Procopio, a real estate agent and certified home staging consultant with Coldwell Banker Residential Brokerage in Hinsdale, Illinois. But she doesn’t see that as much of a trend yet, in part because they are much costlier than appliances with standard finishes.\n\n“The most popular colour schemes in the kitchen right now are dark cabinets with a light counter top,” Procopio says. “At the Kitchen and Bath show, they were showing bright green and blue cabinets, but most people are sticking with standard colour palettes.”\n\n“One client has a house with a very simple, clean white kitchen but with a bright yellow oven, but that’s very unusual,” Walter says. She says she’s seeing more use of warm colours in the kitchen such as olive green and different shades of beige in combination with wood.\n\nHandmade items or artistic features bring in an element of personalisation that appeals to many millennials, DeBroff says.\n\nIntroducing a unique piece of art to your home decor can be costly, but DeBroff found affordable tempered glass bowls from MR Direct that can transform an ordinary bathroom into a museum-quality space.\n\n“These hand-blown glass bowls cost $79 (£57) or $119 if you buy a faucet with them, but they look far more expensive and are a budget-friendly way to personalise your space,” DeBroff says.\n\nMatus says manufacturers are making more multidimensional tiles with a pyramid-type shape or with a wave pattern for visual interest.\n\n“There are lots of interesting ways to use tile now, including making a rustic wall in your kitchen from artisan hand-baked clay tiles that have kind of ancient character but can look very modern,” Walter says. “You can also find mosaic tiles that can be installed by the sheet.”\n\nMillennials love natural materials but are also drawn to coloured lights and smart home technology (Stacy Debroff)\n\nColourful and artistic touches can be used to relieve the sea of grey and white in new homes, but millennials still want most of their homes to have clean lines and modern style.\n\nLarge tiles for your floors and walls allow you to have a cleaner look with less grout, Walter says. In some cases, the tiles are so large they can be seamlessly installed to look like one monolithic floor.\n\nMatus says younger buyers still like crown mouldings, but they prefer simple streamlined styles near the ceiling and opt not to include chair rail mouldings or wainscoting.\n\n“In homes with an open floor plan, a lot of buyers want an extremely clean-looking kitchen with less visible sinks, faucets and appliances,” Walter says. “Most appliances in these homes are fully integrated and look built-in. Part of having an open kitchen is treating that area like furniture so that you have an overall connection with the living area.”\n\n“Millennials definitely like a clean look that’s more transitional or modern than traditional,” says Michael Merschat, design studio manager and architect with Wentworth Inc in Chevy Chase, Maryland. “If you show them a cabinet with mouldings on it they’ll ask how to clean it and then choose something with a cleaner, sleeker look.”\n\nWhile stainless-steel appliances continue to be popular, new variations with a matte finish or slightly darker tone make them easier to keep clean and free of fingerprints, Procopio says. The good news is that the new stainless-steel appliances blend with older stainless finishes so you don’t have to replace everything at once.\n\nAnother innovation that keeps your kitchen looking less cluttered is the installation of an electrical outlet strip hidden under your cabinets that includes USB ports as well as standard outlets, Judy says.\n\n“Technology can be used to simplify the way your home functions and looks,” Matus says. “Even the new door locks that can be operated remotely from your phone are starting to look more beautiful instead of like a big clunky keypad. Things like Sonos wireless speakers can be used to keep your rooms clear of clutter, and they’re portable for entertaining outside.”\n\nTechnology can simplify your life, too, Matus says, with items such as new bathroom exhaust fans from Panasonic that are controlled by a sensor that turns them off and on according to the steam in the room.\n\nThe Nest thermostat, which “learns” your pattern of using heat and air conditioning, is at the intersection of technology and sustainability that appeals to millennials, Judy says.\n\n“Millennials are looking for highly efficient appliances to reduce their energy use and want to use sustainable and natural materials everywhere they can,” he says.\n\nCounters made of engineered stone or recycled materials such as quartz and Caesarstone are environmentally friendly and yet also easy to maintain, both aspects of which appeal to millennials.\n\nA priority that transcends generations is the desire for an organised home with plenty of storage (Geoffrey Hogdon)\n\n“Millennials consider sustainability in every sense of the word,” Merschat says. “Environmental impact is driving the selection of materials, but they are also concerned about durability and functionality of the things they buy. For example, a lot of people love the way Cararra marble counters look, but they realise that it stains easily, so they are willing to turn to man-made materials that are similarly beautiful but are a better fit for their lifestyle.”\n\nOne home priority that transcends generations is the desire for an organised home with efficient and abundant storage space.\n\n“Millennials are likely to be intrigued by the new kitchen designs that come with a complete built-in organisation system so there’s a place for knives, spices and every speciality kitchen gadget,” DeBroff says. “Another cool innovation are cupboards that lower down to the counter with the push of a button so you don’t need a step stool to reach everything.”\n\nDeBroff says that with the advent of Pinterest and Instagram, millennials have high expectations for their organised spaces to be visually beautiful.\n\nProcopio says automated shelving and stacked drawers that slide back to reveal a second layer are particularly appealing to young people who may be buying a smaller home in the city or inner suburbs.\n\nNewly built homes, particularly small but costly condos, feature built-in closet organisers and extra storage in unexpected spaces such as a handful of built-in drawers next to a laundry closet.\n\n“A lot of city homes have smaller bathrooms, so we offer solutions like integrated or hidden cabinets that have storage space but don’t interrupt the clean lines of the room,” Walter says. “In the kitchen, we have three- or four-feet-wide cabinets with pocket doors as a designated breakfast prep area so you can close it off and not see the coffee maker, toaster and juicer out on the counter.”\n\nThe open floor plan popular with many buyers today leads some to want a more organised kitchen, since that space is frequently on display to guests and to the family when they are eating or relaxing in the adjacent living and dining area.\n\n“A lot of families want a family command centre or tech space near the kitchen but a little separate since those spaces can be messy,” Matus says. “If there’s space, they want a highly organised mudroom or laundry room on the first floor. If you live in a smaller place, the key is to have extremely well-organised closets with shelves and cubbies in your bedrooms, your bathrooms, your home office and your kitchen.”\n\nIn larger homes, millennials opt for personalised storage solutions when remodelling a home. For example, Merschat recently built a wall of cabinets, including an L-shaped bench for storage and seating and a special cabinet for riding boots for a family that enjoys equestrian activities.\n\n“Most millennials don’t want an old-school mudroom with a washer and dryer,” Merschat says. “They want a more organised space for the entire family, including lower hooks for their kids to hang up their own jackets and backpacks.”\n\n© Washington Post", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/18/10/washington-post.jpg?quality=75&width=1200&auto=webp", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/18/10/washington-post.jpg?quality=75&width=982&height=726&auto=webp"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/18/10/washington-post.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Michele Lerner"], "canonical_link": "https://www.independent.co.uk/news/millennials-interior-trends-home-design-top-wood-stone-purple-rain-a8160916.html", "title": "The top interior design trends for millennials", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "From hand-baked clay tiles to LED lights that can turn your shower into purple rain, a yin and yang approach to home decorating is favoured by Generation Y", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "News", "sitename": "The Independent", "page path": "/", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2018-01-19T00:00:01.000Z", "site_name": "The Independent", "title": "The top interior trends for millennials", "url": "https://www.independent.co.uk/news/millennials-interior-trends-home-design-top-wood-stone-purple-rain-a8160916.html", "type": "article", "description": "From hand-baked clay tiles to LED lights that can turn your shower into purple rain, a yin and yang approach to home decorating is favoured by Generation Y", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/18/10/washington-post.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/18/10/washington-post.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2018-01-19T00:00:01.000Z", "modified_time": "2018-01-19T00:00:01.000Z", "section": "News", "author_name": "Michele Lerner", "content_type": "story", "word_count": 2056, "image_count": 4, "embed_count": 2, "video_count": 0, "internal_link_count": 2, "external_link_count": 0}, "date": "2018-01-19T00:00:01.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "The top interior trends for millennials", "site": "@Independent", "card": "summary_large_image", "description": "From hand-baked clay tiles to LED lights that can turn your shower into purple rain, a yin and yang approach to home decorating is favoured by Generation Y", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/01/18/10/washington-post.jpg?quality=75&width=1200&auto=webp"}, "keywords": "interior design,Millennials,Homes,Washington Post"}, "movies": [], "publish_date": 1516320001.0, "source": "https://www.independent.co.uk", "summary": ""}