{"url": "https://en.wikipedia.org/wiki/Tom_Brady", "text": "American football player (born 1977)\n\nThis article is about the American football player. For other people named Tom Brady, see Tom Brady (disambiguation)\n\nAmerican football player\n\nThomas Edward Patrick Brady Jr. (born August 3, 1977) is an American football quarterback for the Tampa Bay Buccaneers of the National Football League (NFL). He spent his first twenty seasons with the New England Patriots, where he was a central contributor to the franchise's dynasty from 2001 to 2019. Brady is widely regarded as the greatest quarterback of all time.[1]\n\nAfter playing college football at Michigan, Brady was selected 199th overall by the Patriots in the sixth round of the 2000 NFL Draft, later earning him a reputation as the NFL's biggest draft steal.[2][3][4] He became the starting quarterback during his second season, which saw the Patriots win their first Super Bowl title in Super Bowl XXXVI. As the team's primary starter for eighteen seasons,[a] Brady led the Patriots to seventeen division titles (including eleven consecutively from 2009 to 2019), 13 AFC Championship Games (including eight consecutively from 2011 to 2018), nine Super Bowl appearances, and six Super Bowl titles, all NFL records for a player and franchise.[b] He joined the Buccaneers in 2020 and led them to win Super Bowl LV, extending his individual records to ten Super Bowl appearances and seven victories.[7]\n\nBrady holds nearly every major quarterback record, including: passing yards, completions, touchdown passes, and games started. Never having a losing season, he is the NFL leader in: career quarterback wins, quarterback regular season wins, quarterback playoff wins, Super Bowl MVP awards, as well as being the only Super Bowl MVP for two different franchises.\n\nAdditional accolades held by Brady include the most Pro Bowl selections, and the first unanimous NFL MVP. The only quarterback to win a Super Bowl in three separate decades, Brady is noted for the longevity of his success: he is the oldest NFL MVP at age 40, the oldest Super Bowl MVP at age 43, the oldest quarterback selected to the Pro Bowl at age 44, and the oldest quarterback to start a game at age 45.[8][9] Brady is the only NFL quarterback named to two all-decade teams (2000s and 2010s)[10] and was unanimously named to the 100th Anniversary All-Time Team in 2019.\n\nEarly life\n\nThomas Edward Patrick Brady Jr. was born in San Mateo, California, on August 3, 1977, the only son and fourth child of Galynn Patricia (née Johnson) and Thomas Brady Sr.[11] He was raised as a Catholic. His father is of Irish descent, while his mother has German, Norwegian, and Swedish ancestry.[12] Two of Brady's great-great-grandparents on his father's side, John and Bridget Brady, were Irish refugees from the Great Famine who moved to San Francisco from Boston before the American Civil War. They were accompanied by Bridget's sister Ann and her husband Lawrence Meegan, the parents of the 19th-century American Major League Baseball player \"Steady\" Pete Meegan. Brady's great-uncle Michael Buckley Jr. was the first American prisoner of war in World War II.[12][13][14][15][16][17]\n\nIn the 1980s, Brady regularly attended San Francisco 49ers games at Candlestick Park, where he was a fan of quarterback Joe Montana; Brady called Montana his idol and one of his inspirations.[18] At age four, Brady attended the 1981 NFC Championship, against the Dallas Cowboys, in which Montana threw The Catch to Dwight Clark.[19] As a child, Brady attended football camp at the College of San Mateo, where he was taught to throw the football by camp counselor and future NFL/AFL quarterback Tony Graziani.[20] Despite the rivalry between the two teams, Brady grew up as a Los Angeles Lakers and Boston Celtics fan.[21]\n\nBrady attended Junípero Serra High School in San Mateo, where he graduated in 1995.[22] He played football, basketball, and baseball in high school. He played against Bellarmine College Preparatory rival Pat Burrell in both football and baseball.[23] Brady began his football career as the backup quarterback on the Padres junior varsity team. At first, Brady was not good enough to start on the 0–8 JV team, which had not scored a touchdown all year.[24] Brady ascended to the starting position when the starting quarterback was injured. He became the varsity starter in his junior year and held the position until he graduated.[25] By Brady's senior year, he was striving to be noticed by college coaches. He created highlight tapes and sent them to schools he considered attending.[26] This led to strong interest from many football programs around the nation.\n\nThe process of recruiting was much different during Brady's time, when athletes' rankings were not as prominent. In terms of recruiting in the 2000s, Brady would have been considered a four-star recruit. In essence, he was a highly rated prospect.[27] Brady was also on Blue Chip Illustrated as well as a Prep Football Report All-American selection.[28] After his recruiting process, he narrowed his list to five schools.[29] \"Probably the ones that we did hear from and ultimately pared the list to were Cal–Berkeley, UCLA, USC, Michigan and Illinois”, his father said.[29] As a Cal fan, his father hoped that Brady would attend the nearby Cal, where Brady was a silent commit, and that he would be able to watch his son play.[30][31]\n\nBrady was also known as a great baseball player in high school.[32] He was a left-handed-batting catcher with power. His skills impressed MLB scouts, and he was drafted in the 18th round of the 1995 MLB Draft by the Montreal Expos.[24][33] The Expos projected Brady as a potential All-Star, with then-GM Kevin Malone claiming he had the potential to be \"one of the greatest catchers ever\".[34] The Expos offered him money typical of that offered to a late second-round or early third-round pick,[35] but when Brady learned of the interest in his playing football, he chose football over baseball.[29] Brady was recruited by Michigan assistant Bill Harris, signing to play for the University of Michigan in 1995.[29][36] He finished his high school football career by completing 236 of 447 passes for 3,702 yards and 31 touchdowns. He also won All-State and All-Far West honors and the team's Most Valuable Player Award.[37]\n\nDuring summer break of 1998 and 1999, Brady was an intern at Merrill Lynch.[38] He was inducted into the Junípero Serra High School Hall of Fame in 2003, joining fellow Serra High graduates Barry Bonds, Lynn Swann, Gregg Jefferies, and Jim Fregosi, among many others.[37] When Brady visited the school in 2012, two weeks after Super Bowl XLVI, administrators announced that they named the football stadium Brady Family Stadium.[39]\n\nCollege career\n\nBrady played college football at the University of Michigan from 1995 to 1999.[40][41] After redshirting in 1995,[42] Brady spent the next two years as a backup quarterback, while teammate and future NFL quarterback Brian Griese led the 1997 Wolverines to an undefeated season, which was capped by a victory in the Rose Bowl and a share of the national championship.[43] When he initially enrolled at Michigan, Brady was seventh on the depth chart, and he had an intense struggle to get some playing time. At one point, Brady hired a sports psychologist to help him cope with frustration and anxiety; he even considered transferring to the University of California, Berkeley to play for the California Golden Bears.[44][45] He worked closely with assistant athletic director Greg Harden, who met with Brady every week to build his confidence and to maximize his performance on the field.[46] Brady told 60 Minutes in 2014: \"He will always be somebody I rely on for sound advice and mentorship. He has helped me with my own personal struggles in both athletics and in life. Greg really pushed me in a direction that I wasn't sure I could go.\"[47]\n\nOn September 28, 1996, Brady appeared in his first collegiate game after Michigan was up 35–3 against UCLA late in the fourth quarter. His first ever pass attempt was intercepted by Phillip Ward and returned for a 42-yard touchdown.[48]\n\nUnder Michigan head coach Lloyd Carr, Brady battled for the starting job with Drew Henson[41] and ultimately started every game in the 1998 and 1999 seasons. Brady was All-Big Ten honorable mention both seasons, and was the team captain in his senior year.[49]\n\nDuring his first full year as starter, he set new Michigan records for most pass attempts and completions in a season, for a total of 214.[50] He set a school record for completions in a 31–16 loss against Ohio State in 1998, a season in which Michigan shared the Big Ten Conference title.[51] Brady capped that season with a 45–31 win over Arkansas in the Citrus Bowl.\n\nIn the 1999 season, Brady had to once again hold off Henson for the starting job. The two players platooned during the season's first seven games, with Brady playing the first quarter, Henson the second and Carr then deciding upon a quarterback for the second half. The 1999 Michigan Wolverines started with a 5–0 record, including a 26–22 win over Notre Dame, and a road win against eventual powerhouse Wisconsin. Against Michigan State, Brady was not chosen to play the second half; however, after being reinserted into the game with Michigan down by 17 points, he nearly led Michigan all the way back before losing 34–31.[53] After a 300-yard passing game the following week, Carr went exclusively with Brady for the remainder of the season. Brady went on to lead Michigan to multiple 4th-quarter comebacks, including a 31–27 win against Penn State. He also led them out of a close game against Indiana, 34–31, heading into the regular season's final game as winners of three straight and earning him the moniker of \"Comeback Kid\".[54]\n\nMichigan concluded the regular season against Ohio State; this was a dramatic game with a trip to the Orange Bowl on the line. With five minutes left, tied 17–17, Brady led Michigan to the winning score.[55] He led Michigan to an overtime win in the Orange Bowl over Alabama, throwing for 369 yards and four touchdowns, leading the team back from a pair of 14-point deficits in regulation (14–0 in the first half, and 28–14 in the second). He threw the game-winning score on a bootleg to tight end Shawn Thompson. Michigan won the game when Alabama missed an extra point following its own touchdown.[56][57]\n\nIn the two seasons that Brady started at Michigan, he posted a 20–5 record, including wins at the 1999 Citrus Bowl and the 2000 Orange Bowl. Brady finished his career ranking third in Michigan history with 710 attempts and 442 completions, fourth with 5,351 yards and 62.3 completion percentage, and fifth with 35 touchdown passes.[37][58] He graduated from Michigan in December 1999 with a Bachelor of Arts in General Studies.[59]\n\nCollege statistics\n\nSeason Team Passing Rushing Cmp Att Pct Yds Y/A TD Int Rtg Att Yds Avg TD 1996 Michigan 3 5 60.0 26 5.2 0 1 63.7 — — — — 1997 Michigan 12 15 80.0 103 6.9 0 0 137.7 2 −14 −7.0 0 1998 Michigan 200 323 61.9 2,427 7.5 14 10 133.1 54 −105 −1.9 2 1999 Michigan 180 295 61.0 2,217 7.5 16 6 138.0 34 −31 −0.9 1 Career[60] 395 638 61.9 4,773 7.5 30 17 134.9 90 −150 −1.7 3\n\nProfessional career\n\nOverview\n\nBrady was a lightly regarded prospect coming out of college,[61] with an unimpressive NFL Scouting Combine performance reinforcing this reputation.[62] As a result, he was not selected until the sixth round of the 2000 NFL Draft by the New England Patriots, 199th overall, and was the seventh quarterback taken. Brady's success as a passer has been attributed to his work ethic, competitive spirit, pocket awareness, and intelligence.[63][64]\n\nBrady during the 2009 preseason\n\nBrady has started 367 games (320 regular season, 47 playoff) in 23 seasons, the most for an NFL quarterback. His first 20 seasons were with the Patriots, which is also the most for an NFL quarterback with one franchise. He has served as the primary starter in 20 of his seasons, holding a backup role during his rookie campaign and missing nearly all the 2008 season due to a knee injury.[65] The 2008 season marks the only time that Brady has not started because of injury. Brady has never had a losing season as the starter and only missed the playoffs in 2002, the first year he started all 16 regular season games. With the Patriots, Brady led the team to 17 AFC East titles. He led the Tampa Bay Buccaneers in 2020 to a wild card berth, the only time his team did not make the playoffs as a division winner, and an NFC South title the following season.[66]\n\nThe winningest quarterback in NFL history, Brady has won 245 regular season games and 35 postseason games for a combined 280 wins.[67] Brady holds a .766 winning percentage, which is the highest among NFL quarterbacks who have started 100 games. He is the only NFL quarterback to win 200 regular season games and his 35 postseason victories are more than twice those of any other quarterback. Brady is also the only NFL quarterback to win all 16 regular season games, which he accomplished in 2007.[68] In 2021, Brady became one of four quarterbacks to defeat all 32 NFL teams.[c] Brady has the most Pro Bowl selections in NFL history at 15 and was named league MVP three times in 2007, 2010, and 2017.[69][70] His 2010 MVP was awarded in a unanimous decision; the first time this distinction was achieved.[71] Brady was also named Male Athlete of the Year in 2007, making him third NFL player to receive the award, joining Joe Montana.[72] He and Montana are the only players to win multiple NFL MVP and Super Bowl MVP awards.[73][74]\n\nBrady's 20 seasons as the primary starter have led to seven Super Bowl titles, the most of any player and more than any NFL franchise.[75] Overall, he appeared in a record 10 Super Bowls; half of the seasons in which he was the primary starter and more than any NFL franchise other than the Patriots. He and Peyton Manning are the only starting quarterbacks to win the Super Bowl for more than one franchise, with Brady winning six for the Patriots and one for the Buccaneers. In his seven victories, Brady also set the record for Super Bowl MVP awards with five.[76] Having earned Super Bowl MVP honors with both New England and Tampa Bay, Brady is the only player to win the award with multiple franchises.[77]\n\nHolding nearly every major quarterback record, Brady is the NFL leader in career passing yards, attempts, and touchdown passes in both the regular season and playoffs. He is the only NFL quarterback to have 600 passing touchdowns in the regular season. Brady also has the career and postseason records for completions.[78][79][80] In his 320 career starts, he is the only NFL quarterback to have two separate streaks of consecutive starts of over 100 games. Brady's 111 consecutive starts from 2001 to 2008 ended because of his injury and his 112 consecutive starts from 2009 to 2016 ended after he was suspended for the Deflategate controversy.[37] His longevity has also led to him setting several age records in the NFL. Brady is the NFL's oldest quarterback to be named to the Pro Bowl (age 44), be named Super Bowl MVP (age 43), win a Super Bowl as the starting quarterback (age 43), and be named league MVP (age 40).[81][82] As of the 2022 season, he is the last player drafted before 2004 on an NFL roster.[83][84][85][86]\n\nOn the Patriots, Brady and head coach Bill Belichick formed the NFL's most successful quarterback–head coach tandem.[87] They were consistently credited with the Patriots' dynasty from 2001 to 2019, resulting in the dynasty being named the Brady–Belichick era after them.[88][89][90][91][92] The dynasty is regarded as one of the greatest in sports history, with Brady's successes helping the Patriots set the records for Super Bowl appearances (11) and wins (6, tied with the Pittsburgh Steelers).[93] During Brady's first season as the primary starter, the franchise won its first championship in Super Bowl XXXVI, with consecutive titles following in 2003 and 2004.[94][95] The Patriots won an NFL-record 21 consecutive games (regular season and playoffs) during this period, while Brady won 10 consecutive postseason games (also his first 10 postseason games), another NFL record.[96][97]\n\nBrady maintained the Patriots' status as perennial postseason contenders throughout his tenure, although they did not win another Super Bowl until a decade after their third. His next two appearances both ended in upset defeats to the New York Giants; the first loss in 2007's Super Bowl XLII also prevented Brady and the Patriots from obtaining a perfect 19–0 season.[98] Brady returned to dominant postseason form in 2014 when he led the Patriots to their fourth title in Super Bowl XLIX.[99] This was followed by Brady making three consecutive Super Bowl appearances from 2016 to 2018, which secured New England's fifth and sixth titles in Super Bowl LI and Super Bowl LIII.[100]\n\nWhen Brady signed with Tampa Bay in 2020, the team had not reached the postseason since 2007 and had not won a playoff game since 2002.[101] Brady helped end both droughts en route to the Buccaneers winning Super Bowl LV.[102] During the 2021 season, he set the season record for completions and led the league in passing yards and touchdowns.[103] His passing yards during the season were also a career high.[104]\n\nOne of the NFL's most decorated and accomplished players, Brady is widely cited as the greatest quarterback of all time.[1] He is likewise considered the NFL's greatest player[105][106][107][108] and one of the greatest athletes in sports history.[109][110][111][112]\n\nNew England Patriots\n\n2000–2004: Rookie season and initial Super Bowl runs\n\n2000: Draft and rookie season on the bench\n\nBrady was selected with pick number 199, a compensatory pick, in the sixth round of the 2000 NFL Draft.[117] He and his family believed that Brady would be drafted in the second or third round; they watched the draft on television, stunned as six other quarterbacks were drafted before he was. Brady was so embarrassed that he briefly left the family home during the sixth round, and cried when recalling the experience for an interview 11 years later. Brady later said that when the Patriots notified him that he would be drafted, he was grateful he would not \"have to be an insurance salesman\".[118] According to Michael Holley's book Patriot Reign, the Patriots were considering Brady and Tim Rattay, both of whom had received positive reviews from then-quarterbacks coach Dick Rehbein.[119] Ultimately, the Patriots front office chose Brady. Considering his subsequent success, many analysts have called Brady the best NFL draft pick of all time.[120][121][122][123] Patriots owner Robert Kraft recalled: \"I still have the image of Tom Brady coming down the old Foxboro Stadium steps with that pizza box under his arm, a skinny beanpole, and when he introduced himself to me and said 'Hi Mr. Kraft,' he was about to say who he was, but I said 'I know who you are, you're Tom Brady. You're our sixth round draft choice,'\" recalled Kraft. \"And he looked me in the eye and said 'I'm the best decision this organization has ever made.' It looks like he could be right.\"[124]\n\nBrady started the 2000 season as the fourth-string quarterback, behind starter Drew Bledsoe and backups John Friesz and Michael Bishop; by the end of the season, he was number two on the depth chart behind Bledsoe.[125] During his rookie season, he was 1-for-3 passing, for six yards.[126] Tight end Rod Rutledge caught Brady's first and only completed pass of the season in a 34–9 loss to the Detroit Lions on November 23.[127][128]\n\n2001: Taking over as starter and first Super Bowl victory\n\nWith Bledsoe as the starting quarterback, the Patriots opened the 2001 season with a 23–17 road loss to the Cincinnati Bengals.[126] In their second game and home opener on September 23, the Patriots squared off against their AFC East rivals, the New York Jets. Bledsoe was again the starter; in the fourth quarter, he suffered internal bleeding after a hit from Jets linebacker Mo Lewis. Bledsoe returned for the next series, but was replaced with Brady for the Patriots' final series of the game. New York held on to win 10–3, and the Patriots fell to 0–2 on the season.[129] Brady was named the starter for the season's third game, against the Indianapolis Colts, in which the Patriots posted a 44–13 win.[130][131]\n\nIn the Patriots' fifth game, Brady began to find his stride. Trailing the visiting San Diego Chargers 26–16 in the fourth quarter, he led the Patriots on two scoring drives to force overtime, and another in overtime to set up a winning field goal. Brady finished the game with 33 of 54, for 364 yards and two touchdowns, and was named AFC Offensive Player of the Week for the first time in his career.[132][133] The following week, Brady again played well during the rematch at Indianapolis, with a passer rating of 148.3 in a 38–17 win.[134] The Patriots went on to win eleven of the fourteen games Brady started, and six straight to finish the regular season, winning the AFC East and entering the NFL playoffs with a first-round bye.[135] He finished the 2001 season with 2,843 passing yards and 18 touchdowns, earning an invitation to the Pro Bowl.[126][136]\n\nIn Brady's first playoff game, he threw for 312 yards against the Oakland Raiders and led the Patriots back from a ten-point fourth-quarter deficit to send the game to overtime, where they won on an Adam Vinatieri field goal. A controversial play occurred in the fourth quarter of that game. Trailing by three points, Brady lost control of the ball after being hit by Raiders cornerback and former Michigan teammate Charles Woodson. Oakland initially recovered the ball but, citing the \"tuck rule\"—which states that any forward throwing motion by a quarterback begins a pass even if the quarterback loses possession of the ball as he is attempting to tuck it back toward his body—referee Walt Coleman overturned the call on instant replay, ruling it an incomplete pass rather than a fumble.[137] Brady finished the game 32-of-52 for 312 passing yards and one interception.[138]\n\nIn the AFC Championship Game against the Pittsburgh Steelers, Brady injured his knee, and was relieved by Bledsoe. The Patriots won the game by a score of 24–17.[139] Subsequently, Las Vegas oddsmakers positioned them as 14-point underdogs against the NFC champion St. Louis Rams in Super Bowl XXXVI.[140]\n\nBrady returned from his knee injury in the AFC Championship Game to start in the Super Bowl a week later at the Louisiana Superdome in New Orleans. Despite being heavy underdogs, the Patriots played well, holding the Rams' high-powered offense in check through the first three quarters. The Rams rallied from a 17–3 deficit to tie the game with 1:30 left in regulation. The Patriots then got the ball back at their own 17-yard line with no timeouts remaining. Sportscaster and former Super Bowl-winning coach John Madden argued that the Patriots should run out the clock and try to win the game in overtime.[141] Instead, Brady drove the Patriots' offense down the field to the Rams' 31-yard line before spiking the ball with seven seconds left. Kicker Adam Vinatieri converted a 48-yard field goal as time expired to give the Patriots a 20–17 win and their first ever league championship.[142] Brady was named Super Bowl MVP while throwing for 145 yards, one touchdown, and no interceptions. At the age of 24 years and six months, Brady became the youngest quarterback to win a Super Bowl, surpassing Joe Namath (III) and Joe Montana (XVI).[143][144] Bledsoe was traded to the Buffalo Bills in April,[145] which cemented Brady's status as the Patriots' starting quarterback in 2002.[146]\n\n2002 season\n\nIn the Patriots' season opener, Brady had 294 passing yards and three touchdowns in the 30–14 win over the Pittsburgh Steelers, and earned his third AFC Offensive Player of the Week title.[147][148] Brady and the Patriots finished the season at 9–7, tied with the New York Jets and Miami Dolphins for the best record in the division; however, the Patriots lost the division title to the Jets on tiebreakers. Additionally, the Patriots lost the tiebreaker to the Cleveland Browns for the final wild card spot, causing them to miss the playoffs entirely.[149] Though Brady posted a career-low single-season passer rating of 85.7 and a career-high of 14 interceptions, he threw for a league-leading 28 touchdown passes.[150]\n\n2003 and 2004 seasons: Back-to-back Super Bowl wins\n\nAfter opening the 2003 season at 2–2, Brady led the Patriots to twelve consecutive victories to finish the regular season at 14–2 to win the AFC East.[151] In Week 14, a 12–0 victory over the Miami Dolphins, he recorded a 36-yard punt.[152] Brady finished with 3,620 passing yards and 23 touchdowns,[126] and was third in NFL MVP voting to co-winners Peyton Manning and Steve McNair.[153]\n\nAfter earning a first-round bye, the Patriots defeated the Tennessee Titans in the Divisional Round, 17–14. In the AFC Championship Game, they defeated the Indianapolis Colts, 24–14. In Super Bowl XXXVIII, Brady led the Patriots to a 32–29 victory over the NFC champion Carolina Panthers and was named Super Bowl MVP for the second time. During the game, Brady threw for 354 yards with three touchdowns and set the record for most completions by a quarterback in a Super Bowl with 32. With 1:08 left in the fourth quarter and the score tied 29–29, Brady led a drive with five completions to put the Patriots in position for the game-winning 41-yard field goal by Adam Vinatieri.[154]\n\nBrady won his ninth consecutive playoff game and third championship in Super Bowl XXXIX\n\nDuring the 2004 season, Brady helped the Patriots set an NFL record with 21 straight wins dating from the previous year, an accomplishment honored in the Pro Football Hall of Fame (though for official records, the NFL considers it an 18-game regular season winning streak; it does not count playoff games).[155] New England finished with a 14–2 record, equaling their 2003 record and the best regular-season record ever for a defending champion.[156] The Patriots also won the AFC East title for the third time in four years.[157] Brady threw for 3,692 yards and 28 touchdowns, with a 92.6 passer rating, and was voted to his second Pro Bowl.[126]\n\nIn the playoffs, Brady led the Patriots to wins over the Indianapolis Colts in the Divisional Round by a score of 20–3 and the Pittsburgh Steelers in the AFC Championship by a score of 41–27.[158] Brady played his best game of the year in Pittsburgh despite requiring intravenous treatment the previous night when he ran a temperature of 103 °F.[159] Against the NFL's best defense,[158] he recorded a quarterback passer rating of 130.5, his highest of the season.[130] In Super Bowl XXXIX, the Patriots narrowly defeated the Philadelphia Eagles, 24–21, capturing their third championship in four years. They became the first franchise since the Dallas Cowboys to do so.[160] As of 2021, the 2004 New England Patriots remain the last NFL team to win a second straight Super Bowl. Brady threw for 236 yards and two touchdowns in the win.[161]\n\n2005–2008: Beginning of Super Bowl drought and injury\n\n2005 and 2006 seasons\n\nDuring the 2005 season, injuries suffered by running backs Corey Dillon, Patrick Pass, and Kevin Faulk forced the Patriots to rely more on Brady's passing.[162][163] Brady also had to adjust to new center Russ Hochstein and running back Heath Evans. Brady finished the season with 4,110 yards and 26 touchdowns, the former of which led the league.[126] He and the Patriots finished with a 10–6 record, winning their third straight AFC East title.[164] He was named to his third Pro Bowl at the end of the season.[165]\n\nIn the playoffs, Brady recorded 201 passing yards and three passing touchdowns to help lead the Patriots to a 28–3 victory over the Jacksonville Jaguars in the Wild Card Round. In the Divisional Round the Patriots lost 27–13 to the Denver Broncos.[166][167] Brady threw for 341 yards in the game with one touchdown and two interceptions in the first playoff loss of his career after ten consecutive victories.[168] After the season's end, it was revealed that Brady had been playing with a sports hernia since December.[169]\n\nIn 2006, Brady led the Patriots to a 12–4 record and the fourth seed in the AFC playoffs.[170] Brady finished the regular season with 3,529 yards and 24 touchdowns.[126] He was not among the players initially selected to the Pro Bowl,[171] although he was offered an injury-replacement selection when San Diego Chargers quarterback Philip Rivers was forced to withdraw. Brady ended up declining the invitation.[172]\n\nIn the postseason, the Patriots first hosted their division rivals, the New York Jets, in the Wild Card Round. The Patriots defeated the Jets 37–16, as Brady went 22–34 for 212 yards and two touchdowns.[173] The Patriots traveled to San Diego to take on the Chargers in the Divisional Round. This was Brady's first playoff game in his home state of California. Brady and the Patriots struggled against the Chargers, whom many had picked as favorites to win Super Bowl XLI. With eight minutes left in the fourth quarter and the Patriots down by eight points, Brady and the Patriots started a key drive that would ultimately decide the game. During the drive, Brady threw a fourth-down interception to safety Marlon McCree, but wide receiver Troy Brown forced a fumble on McCree that wide receiver Reche Caldwell recovered to convert the first down.[174] With a new set of downs, Brady threw a touchdown pass to Caldwell and Faulk scored the two-point conversion to tie the game. On what would be the Patriots' final drive, Brady threw a 49-yard pass play to Caldwell, setting up a Stephen Gostkowski field goal that gave New England a 24–21 lead with 1:10 remaining. The Chargers drove down the field, but Nate Kaeding missed a game-tying field goal attempt, as the Patriots held on to win.[175]\n\nIn the AFC Championship, the Patriots traveled to Indianapolis to play the Indianapolis Colts, marking the third time the Patriots played the Colts in four postseasons. The Patriots led at halftime, 21–6; however, Peyton Manning led the Colts to a comeback. Brady threw a late-game interception and the Patriots lost the game to the Colts, 38–34.[176] Brady finished the loss 21 of 34 for 232 yards, one touchdown, and one interception.[177]\n\n2007: Perfect regular season and first MVP\n\nBrady in Baltimore during his first MVP season in 2007\n\nPlaying with an overhauled receiver corps—in the 2007 off-season, the Patriots acquired wide receivers Donté Stallworth, Wes Welker, Kelley Washington, and Randy Moss; tight end Kyle Brady; and running back Sammy Morris—Brady enjoyed what many sportswriters described as one of the best seasons by a quarterback.[178][179] Brady led the Patriots to the first 16–0 regular-season record in NFL history, outscoring opponents by an average score of 37–17.[180] He also attained numerous career, franchise, and NFL records and milestones in the process. He was named as the AFC Offensive Player of the Week five times that year.[181] In a Week 6 game against the Dallas Cowboys, he had a career-high five passing touchdowns in a 48–27 win. The win tied him with Hall of Fame quarterback Roger Staubach for the most wins ever by a starting quarterback in his first 100 regular-season starts, with 76.[182] The next week, in part of a 49–28 win against the Miami Dolphins, he had another record day, with a career-high six passing touchdowns, setting a franchise record. He also had the first game with a perfect passer rating of his career.[183] Two weeks later, as part of a come-from-behind 24–20 victory against the Indianapolis Colts, he threw for another three touchdowns, the ninth consecutive game in which he had done so, breaking Peyton Manning's NFL record of eight.[184] During the last game of the season against the New York Giants, Brady threw his 50th touchdown of the season, breaking Peyton Manning's single-season record of 49 from the 2004 season.[185]\n\nBrady finished the season with 4,806 passing yards, 50 touchdown passes, eight interceptions, and a career-high 117.2 passer rating. It was unanimously voted the greatest passing season of all time by ESPN in 2013. His 50:8 touchdown to interception ratio was, at the time, an NFL record. He became the first quarterback to pass for 50 touchdowns. He led the Patriots to the first undefeated regular season since the 16-game schedule was implemented in 1978. He directed an offense that scored a then-NFL record 589 points and 75 total touchdowns. The team's 50 total touchdown passes is the fourth-most ever in a season. For his efforts, Brady was named the Most Valuable Player and Offensive Player of the Year. He was also honored by the Associated Press as their Male Athlete of the Year, the first time an NFL player earned the honor since Joe Montana won the award in 1990.[186] He was named as a First-Team All-Pro and to his fourth career Pro Bowl as a result of his historic season.[187][188]\n\nIn the Patriots' first playoff game, a Divisional Round game against the Jacksonville Jaguars, Brady began the game with an NFL postseason record 16 consecutive completed passes, and finished the game with 26 completions in 28 attempts, a completion rate of 92.9%. That mark was the highest single-game completion percentage (with at least 20 attempts) in NFL history, regular season or postseason.[189] With the win, the Patriots matched the undefeated 1972 Miami Dolphins as the only team to win 17 consecutive games in one season.\n\nStatistically, Brady did not fare as well in the AFC Championship Game against the San Diego Chargers, throwing for 209 yards, two touchdowns, three interceptions. Nevertheless, the Patriots won their 18th game of the season, 21–12, to advance to the Super Bowl for the fourth time in seven seasons. Brady, with the 100th win of his career, also set an NFL record for the fewest games needed by a starting quarterback to do so: his 100–26 record is sixteen games better than Joe Montana's.[190] In Super Bowl XLII against the New York Giants, Brady was pressured heavily and sacked five times. The Patriots managed to take the lead with a Brady touchdown to Moss with less than three minutes remaining in the fourth quarter, but the Giants were able to drive and score a last-minute touchdown to upset the Patriots 17–14, taking away what would have been the first perfect season since the NFL expanded its regular season to 16 games.[191]\n\n2008: Injury\n\nIn the Patriots' season opener against the Kansas City Chiefs at Gillette Stadium, Brady's left knee was seriously injured midway through the first quarter on a hit by Chiefs safety Bernard Pollard; Brady left the game and did not return. The team later confirmed that he would require surgery, and it would prematurely end his 2008 season.[192] Brady tore both his anterior cruciate ligament and medial collateral ligament.[193] The injury ended Brady's streak of 111 consecutive starts.[194] Dr. Neal ElAttrache performed the anterior cruciate ligament reconstruction at the Los Angeles Kerlan-Jobe Orthopaedic Clinic on October 6, using Brady's patellar tendon graft to replace the torn ligament, and also repaired his medial collateral ligament, through a separate incision in his left knee.[195] An infection in the wound resulted in further debridement surgery several times since the original procedure. Brady received IV antibiotics for this infection which, at the time, threatened to delay his rehab.[196][197] Despite Brady's absence, the Patriots managed to finish the 2008 season with an 11–5 record; however, due to tiebreakers, the Patriots not only failed to win the AFC East division title, but missed the playoffs altogether for the first time since the 2002 season.[198]\n\n2009–2013: Statistical success and continued Super Bowl drought\n\n2009: Return from injury\n\nBrady in action against the Washington Redskins on August 28, 2009\n\nIn the 2009 season opener against the Buffalo Bills, Brady's first game in more than a year, he threw for 378 yards and two touchdowns. In the final three minutes of the game, the Patriots were down 24–13 before Brady and tight end Benjamin Watson connected on two straight touchdowns to lead the Patriots to a 25–24 win.[199]\n\nOn October 18, 2009, under blizzard conditions, Brady set an NFL record against the Tennessee Titans for most touchdowns in a quarter, throwing five in the second quarter. Brady finished the game with six touchdowns, tying his career-high from the 2007 season, and 380 yards, completing 29-of-34 attempts, finishing with a nearly perfect passer rating of 152.8.[200][201] The Patriots' 59–0 victory over the Titans tied the record for the largest margin of victory since the 1970 AFL-NFL merger,[202] and set a record for largest halftime lead in NFL history, which was 45–0.[203]\n\nBrady finished the 2009 regular season with 4,398 yards passing and 28 touchdowns for a 96.2 rating,[126] despite a broken right ring finger and three fractured ribs, which were suffered over the course of the season.[204] He was selected as a reserve to the 2010 Pro Bowl and named the 2009 NFL Comeback Player of the Year.[205][206]\n\nBrady ended the 2009 season throwing for 154 passing yards, two touchdowns, and three interceptions in a 33–14 Wild Card Round loss to the Baltimore Ravens.[207] This was his first career home playoff loss and the Patriots' first home playoff loss since 1978.[208]\n\n2010: Second MVP\n\nOn September 10, 2010, Brady signed a four-year, $72 million contract extension, making him the highest-paid player in the NFL. The extension included $48.5 million in guaranteed money.[209]\n\nBrady became the fastest quarterback to achieve 100 regular season wins by helping his team defeat the Miami Dolphins 41–14 on October 4.[210] On November 25, in a game against the Detroit Lions, he earned a perfect passer rating for the second time in his career.[211][212] The next week, a 45–3 victory over the New York Jets, Brady set a record of 26 consecutive regular-season home wins, breaking Brett Favre's record.[213][214][215] Brady threw for 3,900 yards with 36 touchdowns and only four interceptions on the season.[126]\n\nBrady was selected as a starter to the 2011 Pro Bowl.[216] However, he pulled out of the game (and was replaced by his former backup Matt Cassel, who then played for the Kansas City Chiefs) after undergoing surgery for a stress fracture in his right foot dating back to 2008.[217] Brady was also the only unanimous selection for the AP All-Pro Team and was named the 2010 AP NFL Offensive Player of the Year. By unanimous decision, he won the MVP award for the second time in his career.[218] On the inaugural NFL Top 100 Players list, Brady was ranked as the best player in the NFL by his peers.[219]\n\nAfter earning the #1 seed and a bye week, the Patriots lost to the New York Jets in the Divisional Round, 28–21. Brady finished the game 29-of-45 for 299 yards, two touchdowns, and one interception which ended his NFL record of consecutive pass attempts without an interception at 340.[220][221]\n\n2011: Loss in Super Bowl XLVI\n\nBrady in Denver in 2011\n\nIn Week 1 of the 2011 season, Brady threw for a career-high 517 yards, four touchdowns, and one interception in a 38–24 win over the Miami Dolphins and earned AFC Offensive Player of the Week honors.[222] In the game, he threw a record-tying 99-yard touchdown pass to Wes Welker.[223][224][225] Brady would go on to have a statistically successful season, and in the regular season finale against the Buffalo Bills, he became the fourth quarterback to throw for 5,000 yards in a season, finishing with 5,235; although Brady surpassed Dan Marino's longstanding record of 5,084 passing yards, he finished the season second in passing yards behind Drew Brees' 5,476.[126] The Patriots finished the season 13–3 and clinched the AFC's #1 seed.[226] For his efforts in the 2011 season, Brady was named to the Pro Bowl and was named as the fourth-best player in the NFL on the NFL Top 100 Players of 2012 by his peers.[227][228]\n\nThere's no quarterback I'd rather have than Tom Brady. He's the best. He does so much for us in so many ways on so many different levels. I'm very fortunate that he's our quarterback and what he's able to do for this team. It's good to win with him and all the rest of our players. If that's more than somebody else did, I don't really care about that.[229] —Bill Belichick, following the 2011 AFC Championship Game\n\nBrady led the Patriots to a 45–10 win over the Denver Broncos in the Divisional Round, where he tied an NFL playoff record shared by Daryle Lamonica and Steve Young, throwing for six touchdown passes.[230] The win gave Brady and Patriots head coach Bill Belichick sole possession of the NFL record for postseason wins by a quarterback–head coach duo with 15.[231] In the AFC Championship game against the Baltimore Ravens, Brady failed to throw a touchdown pass for the first time in 36 games, though he did score a one-yard rushing touchdown late in the game. A missed field goal from Ravens kicker Billy Cundiff gave Brady and the Patriots a 23–20 victory, sending Brady to his fifth Super Bowl.[232]\n\nIn Super Bowl XLVI, Brady and the Patriots met the New York Giants in a rematch of Super Bowl XLII. On the Patriots' first offensive series, Brady was penalized for intentional grounding in the end zone, giving up a safety which gave the Giants an early 2–0 lead. Brady would bounce back from this early blunder, leading a Super Bowl record-tying 96-yard touchdown drive to close the first half and at one point completing 16 consecutive passes to give him a 20-of-23 mark partway into the third quarter, another Super Bowl record.[233] However, as was also the case four years earlier, the Patriots could not hold a late lead and allowed Eli Manning to lead the Giants to a game-winning touchdown with less than a minute left, giving Brady his second career Super Bowl loss.[234]\n\n2012 and 2013 seasons\n\nBrady started all 16 regular season games of the 2012 season and led the Patriots to a 12–4 record. Brady became the first quarterback to lead his team to ten division titles.[235] With a 557-point total, the Patriots became the first team to score at least 500 points in a season four different times, with Brady leading all four squads, also a record. He finished the season with 4,827 passing yards, 34 touchdowns, only eight interceptions, and a passer rating of 98.7. Brady was named to the Pro Bowl for the eighth time in his career.[236] On the NFL Top 100 Players of 2013, Brady was ranked fourth by his fellow players for the second consecutive year.[237]\n\nBrady led the Patriots to a 41–28 win over the Houston Texans in the Divisional Round.[238] With the victory, Brady surpassed Joe Montana for most career playoff wins, with 17.[239] The Patriots were then upset by the eventual Super Bowl XLVII champion Baltimore Ravens, 28–13, in the AFC Championship.[240] He suffered his first career loss at home when leading by halftime, in which he was previously 67–0.[241]\n\nOn February 25, 2013, Brady and the Patriots agreed on a three-year contract extension, which kept him with the team through 2017.[242] Sportswriter Peter King called it an \"amazing\" deal and also noted that it reflected Patriots owner Robert Kraft's desire to make sure that Brady retired as a Patriot.[243]\n\nBrady during the 2013 season\n\nBrady and the Patriots began the season with much upheaval on the offensive side of the ball. Tight end Rob Gronkowski was injured and Aaron Hernandez was arrested. Wes Welker departed to the Denver Broncos, Danny Woodhead left in free agency for the San Diego Chargers, and Brandon Lloyd was released from the team. In order to replace the five players, the Patriots signed Danny Amendola in free agency from the Rams, drafted rookie wide receivers Aaron Dobson and Josh Boyce, and signed undrafted rookie free agent wide receiver Kenbrell Thompkins. In the first two games of the season, Brady completed 52% of his passes and had three touchdowns and one interception.[244][245]\n\nBrady was in pursuit of Drew Brees' record of at least one touchdown in 54 consecutive regular season games and saw the streak end at 52 games in a Week 5 loss against the Cincinnati Bengals.[246]\n\nBrady and the Patriots would go on to finish the season well, as Brady was named to the Pro Bowl for the ninth time in his career and was ranked third on the NFL Top 100 Players of 2014 list in the off-season.[247][248] The Patriots finished the season 12–4 to earn the second seed in the AFC and a first-round bye.[249] In the Divisional Round matchup against the Indianapolis Colts, Brady made his 25th playoff appearance, breaking Brett Favre's career record for playoff appearances by a quarterback. The Patriots won 43–22 behind a four-touchdown performance from running back LeGarrette Blount.[250] The following week, the Patriots lost 26–16 to the Denver Broncos in the AFC Championship.[251]\n\n2014–2016: Return to Super Bowl success and Deflategate\n\n2014: Fourth Super Bowl win\n\nBrady started the 2014 season with a 33–20 loss to the Miami Dolphins.[252] It was Brady's first opening day loss since the 2003 season.[253] After going 2–1 in the next three games, Brady helped lead the Patriots to a seven-game winning streak. In that stretch, Brady had two games with four touchdown passes and one game with five.[254][255] Brady clinched his NFL record 12th AFC East division title with a Week 14 win against the San Diego Chargers, later in the season.[256] Brady was named to his tenth career Pro Bowl and was ranked third by his fellow players on the NFL Top 100 Players of 2015 list.[257][258]\n\nIn a 35–31 Divisional Round win over the Ravens,[259] Brady threw for three touchdowns and ran in a fourth, breaking Curtis Martin's club record for rushing touchdowns in the playoffs; Brady also broke Joe Montana's record for playoff touchdowns with 46.[260] After the Ravens scored on their first two possessions, the Patriots were quickly down 14–0, but would end up tying the game 14–14. Brady threw an interception at the end of the first half, which wound up leading to a Baltimore 21–14 halftime lead. Down 28–14, Brady engineered an 80-yard drive, culminating in a touchdown to Rob Gronkowski to cut the lead to 28–21. The Patriots tied the game once again at 28 off of a trick play where Brady passed laterally to Julian Edelman who then threw a 51-yard touchdown to Amendola. Ravens kicker Justin Tucker converted a 25-yard field goal to give Baltimore a 31–28 fourth quarter lead. Brady got the ball back, and threw a 23-yard touchdown to wide receiver Brandon LaFell to give the Patriots their first lead, 35–31, with 5:13 remaining. After a Duron Harmon interception and a Joe Flacco Hail Mary attempt failed, Brady clinched his record ninth AFC Championship Game appearance. It was his fourth straight overall. After a 45–7 blowout of the Indianapolis Colts,[261] Brady advanced to play in his sixth Super Bowl, breaking a tie with John Elway for most career Super Bowl appearances by a quarterback.\n\nIn Super Bowl XLIX, Brady completed 37-of-50 passes for 328 yards, four touchdowns, and two interceptions. He guided a then-record ten-point fourth quarter comeback as the Patriots defeated the Seattle Seahawks 28–24 to give Brady his fourth Super Bowl ring, tying him with Joe Montana and Terry Bradshaw for most Super Bowl victories by a starting quarterback.[262] He was named Super Bowl MVP for the third time, tying Montana's record.[263] Brady's 37 completed passes in the game set a Super Bowl record at the time, which Brady himself would break in Super Bowl LI two years later.[264]\n\nDeflategate report\n\nOn May 6, 2015, the NFL published a 243-page report regarding the deflation of footballs used in the previous season's AFC Championship Game.[265] The report concluded that, more likely than not, Brady was at least generally aware of the intentional deflation. On May 11, Brady was suspended for four games by the NFL for his involvement based on \"substantial and credible evidence\" that Brady knew Patriots employees were deflating footballs and that he was uncooperative with the investigators.[266] That day, Troy Vincent—NFL Executive Vice President of Football Operations—penned a letter to Brady that stated in part: \"Your actions as set forth in the report clearly constitute conduct detrimental to the integrity of and public confidence in the game of professional football.\" Brady, through the NFL Players Association, appealed the suspension on May 14.[268]\n\nOn July 28, NFL Commissioner Roger Goodell upheld Brady's four-game suspension.[269] Goodell cited Brady's destruction of his cell phone as a critical factor in his decision to uphold Brady's suspension.[270][271] The NFL also filed papers in federal court seeking to confirm Roger Goodell's decision.[272] Brady gave permission to the NFLPA to appeal the suspension in federal court,[273] and released a statement on his Facebook page that expressed disappointment in and criticism of Goodell's decision to uphold the suspension.[274][275]\n\nCommentary on the initial punishment was mixed. Bleacher Report writer Mike Freeman made a statement agreeing with Goodell's decision, saying the penalties were \"brutal, but it deserved to be.\"[276] Various commentators also implied that the prior reputation of the Patriots organization as a team that bends rules appeared to factor into the harshness of the punishment.[276][277] Others described the punishment as \"firm but fair\".[278]\n\nOn September 3, Judge Richard M. Berman of the United States District Court for the Southern District of New York vacated Brady's suspension; this ruling allowed Brady to play in the first four games of the 2015 NFL season. In his decision, Judge Berman cited the NFL's failure to provide proper notice to Brady of the charges against him and the potential for a suspension.[279] Post-appeal commentary also criticized Goodell for \"manipulating Brady's testimony\" at the appeal hearing in his decision.[280]\n\n2015 season\n\nBrady in Denver in November 2015\n\nIn the NFL Kickoff Game, Brady led the Patriots to a 28–21 win over the Pittsburgh Steelers. He threw for 288 yards and four touchdowns, three of them to Rob Gronkowski.[281] The Patriots' victory was the 161st victory of Brady's career, all with the Patriots, which surpassed the record held by former Green Bay Packers quarterback Brett Favre for most regular season wins by a starting quarterback with a single team.[282] In Week 2, Brady threw for 466 yards and three touchdowns against the Buffalo Bills. Through the first five games of the season, Brady threw a total of 14 touchdowns with one interception and had a quarterback rating of 118.4.[283] In Week 8, a 36–7 victory over the Miami Dolphins, he had 356 passing yards and four touchdowns to earn his 25th career AFC Offensive Player of the Week title.[284][285]\n\nDespite Brady's success, the Patriots were hit by many injuries to key players on offense, including wide receiver Julian Edelman, and the Patriots eventually lost their first game against the Denver Broncos, who were without Peyton Manning, in Denver following a 10–0 start.[286] The Patriots then lost three of their remaining five games to finish 12–4 for a fourth straight season, earning the 2-seed in the AFC.[287][288] Brady finished the regular season with a league-leading 36 touchdown passes and seven interceptions.[289] He was named to his 11th Pro Bowl (seventh straight), and was ranked as the second best player on the NFL Top 100 Players of 2016 behind only league MVP Cam Newton.[290][291]\n\nWith the return of Julian Edelman from a foot injury, the Patriots defeated the Kansas City Chiefs in the Divisional Round by a score of 27–20 after advancing with a first round bye.[292][293] Brady completed 28 of 42 passes for 302 yards and two passing touchdowns and one rushing touchdown as he led the team to their fifth consecutive appearance in the AFC Championship.[294] The Patriots advanced to the AFC Championship to face Peyton Manning and the Denver Broncos at Sports Authority Field at Mile High. It would turn out to be the 17th and final meeting between the two storied quarterbacks, as Manning would announce his retirement after the season ended. The Broncos' top-ranked defense limited Brady, who completed 27-of-56 passes, for 310 yards, two interceptions and a passing touchdown, all day, and the Patriots eventually lost the game 20–18 after a potential game-tying two-point conversion attempt failed with less than half a minute remaining.[295]\n\nDeflategate suspension\n\nOn February 29, 2016, Brady signed a two-year contract extension covering the 2018 and 2019 seasons.[296] On March 3, the NFL appealed Judge Richard M. Berman's 2015 decision to vacate Brady's four-game suspension as punishment for his alleged role in the Deflategate scandal. At the hearing, the three-judge panel of the United States Court of Appeals for the Second Circuit questioned Players Association lawyer Jeffrey L. Kessler and NFL lawyer Paul Clement, with Circuit Judge Denny Chin stating that \"the evidence of ball tampering is compelling, if not overwhelming.\"[297]\n\nOn April 25, the decision to vacate Brady's four-game suspension was overturned by the U.S. Appeals Court.[298][299] Circuit Judge Barrington Daniels Parker Jr., joined by Circuit Judge Chin, wrote that they could not \"second-guess\" the arbitration but were merely determining it \"met the minimum legal standards established by the Labor Management Relations Act of 1947\".[300] Circuit Chief Judge Robert Katzmann dissented, writing that the NFL's fines for using stickum was \"highly analogous\" and that here \"the Commissioner was doling out his own brand of industrial justice.\"[301] On May 23, Brady appealed for his case to be reheard by the full U.S. 2nd Circuit Court.[302] The 2nd Circuit Court denied Brady's request for an en banc hearing on July 13.[303] On July 15, Brady announced that he would give up his Deflategate fight and accept his suspension for the first four regular season games of the 2016 season.[304]\n\n2016: Fifth Super Bowl win\n\nBrady during the 2016 season\n\nAfter serving his four-game suspension, Brady made his 2016 season debut on October 9 on the road against the Cleveland Browns; he completed 28-of-40 passes for 406 yards and three touchdowns in a 33–13 victory to earn AFC Offensive Player of the Week.[305][306] Brady's outstanding numbers during his first four games following the suspension earned him the AFC Offensive Player of the Month award for October.[307]\n\nIn Week 11, Brady recorded four touchdowns and no interceptions in a 30–17 road win against the San Francisco 49ers.[308] Those four touchdown passes gave him a total of 444 career regular season touchdown passes with one team, breaking Brett Favre's record with the Green Bay Packers. The following week, Brady completed 30-of-50 passes for 286 yards and two touchdowns in a 22–17 road victory against the New York Jets.[309] The win was also the Patriots' 500th victory (including playoffs) in franchise history. During this victory, Brady also became the fifth quarterback to record 60,000 career regular season passing yards, joining Peyton Manning, Brett Favre, Drew Brees, and Dan Marino.[310] The following week, Brady and the Patriots defeated the Los Angeles Rams by a score of 26–10,[311] giving Brady his record-201st career victory, including playoff games.[312]\n\nWith a victory over the Denver Broncos,[313] the Patriots clinched an eighth consecutive AFC East title and a seventh consecutive first-round bye in the playoffs, both NFL records.[314] On December 20, 2016, Brady was named to the Pro Bowl for the eighth straight season and 12th time overall.[315][316] Brady ended the regular season with 28 passing touchdowns and only two interceptions for the regular season, breaking the previous TD:INT ratio record of Nick Foles's 27:2 figure set in 2013 with the Philadelphia Eagles.[317] Brady was named to the AP All-Pro Second Team.[318] Brady was also ranked first on the NFL Top 100 Players of 2017 as the best player in the league, becoming the first player to be named as #1 twice since the listing began.[319]\n\nBrady and the Patriots began their postseason run in the Divisional Round, hosting the Houston Texans, which held the league's No. 1 total defense. Brady completed 18-of-38 passes for 287 yards, two touchdowns, and two interceptions as the Patriots won 34–16, clinching a record sixth consecutive trip to the AFC Championship Game.[320] In the AFC Championship, the Patriots hosted the Pittsburgh Steelers. Brady completed 32-of-42 passes for 384 yards, three touchdowns, and no interceptions in the 36–17 victory. The win gave Brady and Patriots head coach Bill Belichick their record seventh conference title as a quarterback–head coach tandem, and the Patriots an NFL record ninth Super Bowl appearance.[321]\n\nBrady and the Patriots faced the NFC champion Atlanta Falcons, who boasted the league's highest-scoring offense, in Super Bowl LI. Brady threw for 43 completions on 62 attempts for 466 passing yards—all Super Bowl records at the time. Brady also threw for two touchdowns and an interception, which was returned for a touchdown by Robert Alford in the second quarter. After trailing 28–3 midway through the third quarter, Brady and the Patriots scored 25 unanswered points to tie the game at the end of regulation. This resulted in the first overtime in Super Bowl history. After winning the overtime coin toss, Brady led the Patriots down the field to score a touchdown and win the game by a score of 34–28,[322] completing the largest comeback win in both team history and Super Bowl history. With the victory, Brady won his fifth Super Bowl, which set a record for most Super Bowl victories of any quarterback in history and tied defensive player Charles Haley for the most Super Bowl victories for any player. In addition, Brady set another record by winning his fourth Super Bowl MVP award for his clutch performance.[323] On a personal note, this game was also special for Brady because it was the first game this season that his mother had attended in person, after having been previously diagnosed with cancer.[324]\n\n2017–2019: Final years in New England\n\n2017: Third MVP and loss in Super Bowl LII\n\nOn May 12, 2017, Brady was announced as the cover athlete for Madden NFL 18.[325] In a CBS interview on May 17, Charlie Rose asked Brady's wife, Gisele Bündchen, if she wanted Brady to retire, despite the fact that he was playing at a high level. Bündchen mentioned that Brady suffered from a concussion in 2016, saying, \"I mean he has concussions pretty much every—I mean we don't talk about—but he does have concussions. I don't really think it's a healthy thing for anybody to go through.”[326][327] Following the Bündchen interview, the NFL released a statement: \"We have reviewed all reports relating to Tom Brady from the unaffiliated neurotrauma consultants and certified athletic trainer spotters who worked at Patriots' home and away 2016 season games as well as club injury reports that were sent to the league office. There are no records that indicate that Mr. Brady suffered a head injury or concussion, or exhibited or complained of concussion symptoms. Today we have been in contact with the NFLPA and will work together to gather more information from the club's medical staff and Mr. Brady\".[328][329] Brady's agent, Don Yee, said that Brady was not diagnosed with a concussion during the 2016 season.[330]\n\nThe Patriots opened up their 2017 season with a loss in the NFL Kickoff Game to the Kansas City Chiefs.[331] In Week 2, Brady's three touchdown passes and 447 passing yards in a 36–20 win over the New Orleans Saints earned him his 28th AFC Offensive Player of the Week award,[332] breaking the record previously held by Peyton Manning for the most AFC Offensive Player of the Week awards in a career.[333][334] In Week 6, the Patriots defeated the New York Jets, 24–17.[335] Brady obtained his 187th career win, setting the record for most regular season wins in NFL history.[336] On December 19, Brady was selected to the Pro Bowl for the 13th time in his career.[337] At age 40, Brady became the oldest quarterback ever to start all of his team's games in an NFL regular season.[d] Brady finished the regular season with a league-leading 4,577 passing yards, making him the oldest player ever to lead the league in passing yards.[338] He was named a first-team All-Pro by the Associated Press for the third time in his career.[339] Earning 40 of 50 votes, Brady was named the NFL Most Valuable Player for the third time in his career.[340] For the second straight year and third time overall, Brady was ranked No. 1 by his fellow players on the NFL Top 100 Players of 2018.[341]\n\nBrady set the Super Bowl record for passing yards in Super Bowl LII , but the game ended in defeat\n\nBrady and the Patriots began their postseason run by defeating the Tennessee Titans, 35–14, in the Divisional Round of the playoffs.[342] With the win, the Patriots advanced to the AFC Championship Game for the seventh straight year. Days after the divisional round, it was revealed that Brady had a minor cut on his right hand, which required stitches.[343] Despite this injury, Brady managed to start the AFC Championship Game, where the Patriots hosted the Jacksonville Jaguars. Brady led a fourth quarter comeback to lead the Patriots to a 24–20 victory.[344] The win gave Brady and Patriots head coach Bill Belichick their eighth conference title as a quarterback–head coach tandem, and the Patriots a berth in Super Bowl LII, their tenth Super Bowl appearance as a team, both of which extended NFL records.\n\nIn Super Bowl LII, the Patriots faced the Philadelphia Eagles and their second-string quarterback Nick Foles. Brady completed 28-of-48 attempts for three passing touchdowns, no interceptions, and a Super Bowl record 505 yards–which also set a new postseason game record for the most passing yards in NFL history.[345][346] With roughly two minutes remaining in the game and the Eagles leading 38–33, Brady was strip-sacked by Brandon Graham. The Eagles recovered the fumble and cemented their 41–33 win with a field goal, securing their first franchise Super Bowl victory in a game with the most combined total yardage in NFL history.[347] This was the third time overall that Brady had lost in a Super Bowl, becoming the fourth starting quarterback in Super Bowl history to lose at least three Super Bowls joining Jim Kelly, Fran Tarkenton, and John Elway.[348][349]\n\n2018–2019: Sixth Super Bowl win and last years with New England\n\nBrady started his 19th NFL season with 277 passing yards, three touchdowns, and one interception in a 27–20 victory over the Houston Texans in the season opener.[350][351] In Week 5, against the Colts, Brady's 500th career touchdown pass went to Josh Gordon, who became the 71st different player to catch a touchdown from Brady, breaking a record previously held by Vinny Testaverde.[352][353] In Week 15, Brady reached 70,000 passing yards, becoming the fourth quarterback in NFL history to accomplish the feat. During Week 16, against the Buffalo Bills, Brady was limited to 126 passing yards, but the Patriots won 24–12, clinching the AFC East pennant for the 10th consecutive season and 16th time in 18 years.[354] In Week 17, Brady helped the Patriots clinch a first-round bye, with a 38–3 win against the Jets.[355][356] Brady finished the season completing 375-of-570 passes, 4,355 yards, 29 touchdowns, and 11 interceptions.[357] He was ranked sixth by his fellow players on the NFL Top 100 Players of 2019.[358]\n\nFollowing their first-round bye, the Patriots started their playoff run at home against the Los Angeles Chargers in the Divisional Round. The Patriots jumped out to a 35–7 halftime lead en route to a 41–28 win. With the win, the Patriots advanced to the AFC Championship Game for an eighth consecutive year, this time to face the Chiefs at Arrowhead Stadium.[359] The Patriots went into halftime with a 14–0 lead. However, the Chiefs battled back in the second half and sent the game into overtime with a score of 31–31. The Patriots won the coin toss to start overtime and elected to receive the ball. Brady led the Patriots on a 75-yard drive that resulted in a game-winning two-yard rushing touchdown by Rex Burkhead. With the victory, Brady earned a third consecutive and ninth overall Super Bowl appearance for his career.[360]\n\nIn Super Bowl LIII, Brady completed 21-of-35 passes for 262 passing yards and an interception as the Patriots won 13–3 over the Los Angeles Rams in the lowest-scoring Super Bowl in history. This was the first time in his nine Super Bowl appearances in which Brady did not have a passing touchdown, though with the game tied 3–3 and less than eight minutes left he successfully connected with Rob Gronkowski down the sideline between three defenders to set up the go-ahead touchdown.[361] With the victory, the Patriots became the second NFL team to win six Super Bowls, tying the Pittsburgh Steelers for the most in NFL history.[362] In addition, Brady became the oldest quarterback at 41 years of age to win a Super Bowl,[324] as well as the first player ever to win six Super Bowls, breaking a tie with Charles Haley.[363][364]\n\nOn August 4, 2019, Brady signed a two-year contract extension worth $70 million through the 2021 season;[365] the terms of the contract allowed Brady to become a free agent after the 2019 season.[366] Against the 2019 Patriots salary cap, Brady was the highest-paid player on the team at $21.5 million.[367] Belichick was unwilling to offer a longer-term deal that Brady sought.[368]\n\nBrady began the season by completing 24 of 36 passes for 341 yards and three touchdowns in a 33–3 win over the Pittsburgh Steelers.[369] During a 33–7 victory against the Washington Redskins in Week 5, Brady surpassed Brett Favre for third place on the all-time passing yards list.[370] The following week against the New York Giants, Brady overtook Peyton Manning for second place on the all-time passing yards list, behind only Drew Brees.[371] Although the Patriots' defense was performing well, the offense was notedly stagnant, and Brady told friends that he \"felt Belichick had taken the offense for granted because of how good it had been for so long\"; he said to NBC that he was the \"most miserable 8–0 quarterback in the NFL.\"[361] Brady and the Patriots struggled during the second half of the season, losing three of their next five games following the 8–0 start, including back-to-back losses in Weeks 13 and 14 against the Houston Texans and Kansas City Chiefs.[372][373] In Week 17, Brady's final regular-season game as a Patriot, he threw for 221 yards and two touchdowns, but also threw an interception that was returned by former Patriots teammate Eric Rowe for a touchdown in a 27–24 loss to the Miami Dolphins. Although the Patriots finished the regular season with a 12–4 record and won the AFC East for the 11th consecutive year, this loss, combined with a win by the Chiefs, denied New England a first-round bye for the first time since 2009. Personally, however, Brady passed Peyton Manning for the second-most touchdown passes in NFL history, with 541.[374]\n\nBrady in the 2019 playoffs against the Tennessee Titans , his final game with the Patriots\n\nThe Patriots began their postseason run in the Wild Card Round, where they faced the Tennessee Titans. With his team trailing 14–13 and pinned back on its own 1-yard line with 15 seconds left in the game, Brady's final pass attempt of the game – and his last as a Patriot – was intercepted and returned for a touchdown by Titans cornerback and former teammate Logan Ryan, which effectively sealed the 20–13 win for Tennessee.[375][376] During the NFL's celebration of their 100th season, Brady was named to the NFL 100 All-Time Team.[377] He was ranked 14th by his fellow players on the NFL Top 100 Players of 2020.[378]\n\nOn March 17, 2020, the day before his contract with the Patriots expired, Brady announced that he would not re-sign with the team for the 2020 season, ending his 20-year tenure in New England.[379] After Brady signed with Tampa Bay, billboards thanking Brady for his services were posted alongside the Massachusetts Turnpike, a mile from Gillette Stadium, and ten other locations around New England.[380]\n\nTampa Bay Buccaneers\n\n2020–present: Seventh Super Bowl win and brief retirement\n\n2020: Seventh Super Bowl win\n\nBrady signed with the Tampa Bay Buccaneers on March 20, 2020. The two-year contract was worth $50 million in fully guaranteed money, with up to $4.5 million each year in incentives. The deal also included a no-trade and a no-franchise tag clause.[381] Although his career number of 12 was assigned to Chris Godwin, Godwin offered it to Brady as a sign of respect and switched his number to 14.[382] In April 2020, Brady was reunited with former Patriots teammate Rob Gronkowski when the tight end came out of retirement and was traded to the Buccaneers.[383] Head coach Bruce Arians stated that it was Brady who was adamant for the team to trade for Gronkowski.[384]\n\nMaking his Buccaneers debut in New Orleans against the New Orleans Saints on September 13, Brady completed 23-of-36 passes for 239 yards, two touchdowns, and two interceptions, and additionally scored a rushing touchdown as the Saints defeated the Buccaneers 34–23.[385] Brady bounced back with three solid performances as the Buccaneers won their next three games, including a Week 4 performance against the Los Angeles Chargers in which he completed 30 of 46 passes for 369 yards, five touchdowns, and an interception.[386] Brady's five touchdowns in the Buccaneers' 38–31 win against the Chargers marked the seventh time in his career he had five touchdowns in a game and, at age 43, made him the oldest quarterback to have a five-touchdown game.[387] Brady's Week 4 performance earned him the NFC Offensive Player of the Week award for the first time in his career.[388] In Week 9 against New Orleans, Brady threw for 209 yards and three interceptions during the 38–3 loss. This was the most lopsided loss of Brady's career, as well as the first time in his 20-year career that he had been swept by a divisional opponent.[389]\n\nBrady later said that playing behind closed doors from the impact of the COVID-19 pandemic on the NFL made it easier for him to execute his new team's unfamiliar football playbook.[390] In Week 16 against the Detroit Lions, Brady completed 22-of-27 attempts with 348 yards, four touchdowns, and a perfect passer rating of 158.3 in the first half before being rested in the second half of the 47–7 victory. The win also ended a 13-year playoff drought for the Buccaneers.[101] Overall, he finished the 2020 season with 4,633 passing yards, 40 passing touchdowns, and 12 interceptions.[391][102] Due to the Saints winning the division, the Buccaneers settled for a wild card spot, marking a career-first for Brady.[66]\n\nIn the Wild Card Round against the Washington Football Team, Brady threw for 381 yards and two touchdowns in the 31–23 win. During the game, he became the oldest player to throw a touchdown pass in NFL postseason history.[392] In the Divisional Round against the New Orleans Saints, Brady threw for 199 yards and two touchdowns and rushed for a touchdown in the 30–20 win. As Brady and Saints quarterback Drew Brees were both over 40 years old and were first and second in career touchdown passes and career passing yards, the game was hyped as the potential final matchup between the two stars.[393][394] (which it indeed turned out to be, as Brees retired following the season). Brady extended his record of Conference Championship game appearances to 14.[395][396][397] In the NFC Championship, Brady threw for 280 yards, three touchdowns and three interceptions in a 31–26 win over Aaron Rodgers and the Green Bay Packers at Lambeau Field. It was another highly anticipated matchup since Brady and Rodgers are two of the most statistically efficient quarterbacks, and this was their first postseason matchup.[398] The win gave Brady his record-extending tenth Super Bowl appearance, making Brady the fourth quarterback to lead two different teams to the Super Bowl, joining Craig Morton, Kurt Warner, and Peyton Manning, and the second after Morton to reach the Super Bowl from both conferences.[399] The Buccaneers became the first team to play in a Super Bowl in its home stadium.[400]\n\nIn Super Bowl LV, Brady threw for 201 yards and three touchdowns in Tampa Bay's 31–9 win over the Kansas City Chiefs. He had led the Buccaneers to become only the seventh Wild Card team to win the Super Bowl and only the fifth to do so by winning three road games.[401] Brady was awarded Super Bowl MVP for the game. His two touchdown passes to tight end Rob Gronkowski set a record for most postseason touchdown passes for a passer-receiver duo, with 14, breaking the mark previously held by Joe Montana and Jerry Rice.[402] Brady extended his record for most Super Bowl wins by a player with his seventh and extended his record for Super Bowl MVP awards, with five.[403] Brady became the second quarterback, joining Peyton Manning, to lead two different teams to Super Bowl wins, but the first to win Super Bowl MVP with two different teams. He was also the first quarterback to win the Super Bowl with teams from different conferences.[404] Brady also became the player with the most championships in NFL history and tied Otto Graham for the most league championships in professional football history by a player at seven. With the win, Brady became the oldest quarterback in Super Bowl history to start, play, win, and receive the MVP award.[77] He was ranked seventh by his fellow players on the NFL Top 100 Players of 2021.[405]\n\n2021\n\nBrady during the 2021 season\n\nOn February 11, 2021, it was revealed that Brady had knee discomfort through most of the 2020 season and would require a minor arthroscopy for a routine cleanup.[406] Brady signed a one-year contract extension through the 2022 season with the Buccaneers on March 12, 2021.[407][408] On July 15, it was revealed that Brady had a torn MCL in the knee that had to undergo surgery, an injury that had plagued him for the entire 2020 season.[409] The NFL declined to comment on the Buccaneers' failure to disclose this injury.[410]\n\nIn the NFL Kickoff Game against the Dallas Cowboys, Brady threw for 379 yards, four touchdowns, and two interceptions leading the Buccaneers to a 31–29 win. Brady and tight end Rob Gronkowski became the second passer-receiver duo to record 100 touchdown passes, joining Peyton Manning and Marvin Harrison.[411] In Week 3, against the Los Angeles Rams, Brady threw for 432 yards, and had two touchdowns, and joined Drew Brees as the only players in NFL history to record 80,000 passing yards during the 34–24 loss.[412] In his return to New England in Week 4 against Belichick and rookie quarterback Mac Jones, Brady surpassed Brees, who coincidentally was on the sidelines as an analyst for NBC Sunday Night Football, for the most passing yards in National Football League history. He broke the record on a 28-yard completion to Mike Evans in the first quarter.[413] With the victory over his former team, Brady became the fourth quarterback in NFL history to record a win against all 32 current teams in the league, joining Brett Favre, Peyton Manning, and Drew Brees. In addition, he became the sixth quarterback to have a victory against every incumbent NFL franchise after Fran Tarkenton and Joe Montana, as the league only had 28 teams during the latter two's respective tenures.[414] In Week 5, Brady threw for 411 yards and five touchdowns in a 45–17 win over the Miami Dolphins, earning NFC Offensive Player of the Week.[415] In Week 7, Brady became the first quarterback in NFL history to record 600 touchdown passes, with a nine-yard pass to Evans in a win against the Chicago Bears.[416] In Week 14, Brady surpassed Brees for most all-time pass completions list in NFL history and became the first quarterback to record 700 touchdown passes in regular season and postseason combined with a game-winning in overtime 58-yard pass to Breshad Perriman against the Buffalo Bills.[417] Brady finished the 2021 season with an NFL record 485 pass completions for a career-high 5,316 passing yards, 43 passing touchdowns, and 12 interceptions.[103][418] Brady became the oldest player in NFL history to pass for at least 5,000 yards and his passing yards total marked the third-most for a single season in NFL history.[104]\n\nIn the Wild Card Round, the Buccaneers faced off against the Philadelphia Eagles, as a rematch of their Week 6 regular season game. Brady completed 29 of 37 passes for 271 yards and 2 touchdowns as they won 31–15.[419] Brady and the Buccaneers advanced to the Divisional Round to face off against the Los Angeles Rams, to whom they previously lost in the regular season. Brady and the Buccaneers fell behind 27–3 in the third quarter, until Brady was able to lead the team to 24 unanswered points and a tie game; however, the Rams scored a field goal in the closing seconds to defeat the Buccaneers 30–27. Brady finished the game with 329 yards, a touchdown, and an interception.[420] The Rams later went on to win Super Bowl LVI.[421]\n\nBrady announced his retirement on February 1, 2022, after 22 seasons.[422] In Brady's first two years with Tampa, the Buccaneers posted a regular season record of 24–9, which were the two most successful back-to-back seasons in franchise history. Their 13–4 regular season record in 2021 was the best result in franchise history, eclipsing the 12–4 record of the 2002 Super Bowl winning team.[423] Prior to Brady's arrival, the franchise had an all-time playoff record of 6–9; at the time of Brady's retirement, the all-time playoff record for Tampa Bay stood at 11–10.[424] He was ranked first by his fellow players on the NFL Top 100 Players of 2022, his fourth time being ranked first.[425]\n\n2022\n\nOn March 13, 2022, just 40 days after initially announcing his retirement, Brady announced he would return to the Buccaneers for the 2022 season.[426] In the Buccaneers' season-opening game against the Dallas Cowboys, Brady became the oldest quarterback to start a game in NFL history.[427]\n\nNFL career statistics\n\nLegend AP NFL MVP Super Bowl MVP Won the Super Bowl NFL record Led the league Bold Career high\n\nRegular season\n\nYear Team Games Passing Rushing Sacked Fumbles GP GS Record Cmp Att Pct Yds Y/A Lng TD Int Rtg Att Yds Avg Lng TD Sck Yds Fum Lost 2000 NE 1 0 — 1 3 33.3 6 2.0 6 0 0 42.4 0 0 0.0 0 0 0 0 0 0 2001 NE 15 14 11–3 264 413 63.9 2,843 6.9 91 18 12 86.5 36 43 1.2 12 0 41 216 12 1 2002 NE 16 16 9–7 373 601 62.1 3,764 6.3 49 28 14 85.7 42 110 2.6 15 1 31 190 11 5 2003 NE 16 16 14–2 317 527 60.2 3,620 6.9 82 23 12 85.9 42 63 1.5 11 1 32 219 13 5 2004 NE 16 16 14–2 288 474 60.8 3,692 7.8 50 28 14 92.6 43 28 0.7 10 0 26 162 7 5 2005 NE 16 16 10–6 334 530 63.0 4,110 7.8 71 26 14 92.3 27 89 3.3 15 1 26 188 4 3 2006 NE 16 16 12–4 319 516 61.8 3,529 6.8 62 24 12 87.9 49 102 2.1 22 0 26 175 12 4 2007 NE 16 16 16–0 398 578 68.9 4,806 8.3 69 50 8 117.2 37 98 2.6 19 2 21 128 6 4 2008 NE 1 1 1–0 7 11 63.6 76 6.9 26 0 0 83.9 0 0 0.0 0 0 0 0 0 0 2009 NE 16 16 10–6 371 565 65.7 4,398 7.8 81 28 13 96.2 29 44 1.5 9 1 16 86 4 2 2010 NE 16 16 14–2 324 492 65.9 3,900 7.9 79 36 4 111.0 31 30 1.0 9 1 25 175 3 1 2011 NE 16 16 13–3 401 611 65.6 5,235 8.6 99 39 12 105.6 43 109 2.5 13 3 32 173 6 2 2012 NE 16 16 12–4 401 637 63.0 4,827 7.6 83 34 8 98.7 23 32 1.4 7 4 27 182 2 0 2013 NE 16 16 12–4 380 628 60.5 4,343 6.9 81 25 11 87.3 32 18 0.6 11 0 40 256 9 3 2014 NE 16 16 12–4 373 582 64.1 4,109 7.1 69 33 9 97.4 36 57 1.6 17 0 21 134 6 3 2015 NE 16 16 12–4 402 624 64.4 4,770 7.6 76 36 7 102.2 34 53 1.6 13 3 38 225 6 2 2016 NE 12 12 11–1 291 432 67.4 3,554 8.2 79 28 2 112.2 28 64 2.3 15 0 15 87 5 0 2017 NE 16 16 13–3 385 581 66.3 4,577 7.9 64 32 8 102.8 25 28 1.1 7 0 35 201 7 3 2018 NE 16 16 11–5 375 570 65.8 4,355 7.6 63 29 11 97.7 23 35 1.5 10 2 21 147 4 2 2019 NE 16 16 12–4 373 613 60.8 4,057 6.6 59 24 8 88.0 26 34 1.3 17 3 27 185 4 1 2020 TB 16 16 11–5 401 610 65.7 4,633 7.6 50 40 12 102.2 30 6 0.2 4 3 21 143 4 1 2021 TB 17 17 13–4 485 719 67.5 5,316 7.4 62 43 12 102.1 28 81 2.9 13 2 22 144 4 3 2022 TB 4 4 2–2 106 155 68.4 1,058 6.8 48 6 1 97.7 6 −4 −0.7 0 0 7 51 2 2 Career 322 320 245–75 7,369 11,472 64.2 85,578 7.5 99 630 204 97.6 670 1,120 1.7 22 27 550 3,467 131 52\n\nPlayoffs\n\nYear Team Games Passing Rushing Sacked Fumbles GP GS Record Cmp Att Pct Yds Y/A Lng TD Int Rtg Att Yds Avg Lng TD Sck Yds Fum Lost 2001 NE 3 3 3–0 60 97 61.9 572 5.9 29 1 1 77.3 8 22 2.8 6 1 5 36 1 0 2003 NE 3 3 3–0 75 126 59.5 792 6.3 52 5 2 84.5 12 18 1.5 12 0 0 0 0 0 2004 NE 3 3 3–0 55 81 67.9 587 7.2 60 5 0 109.4 7 3 0.4 3 1 7 57 1 1 2005 NE 2 2 1–1 35 63 55.6 542 8.6 73 4 2 92.2 3 8 2.7 7 0 4 12 2 0 2006 NE 3 3 2–1 70 119 58.8 724 6.1 49 5 4 76.5 8 18 2.3 12 0 4 22 2 0 2007 NE 3 3 2–1 77 109 70.6 737 6.8 53 6 3 96.0 4 −1 −0.3 2 0 8 52 1 1 2009 NE 1 1 0–1 23 42 54.8 154 3.7 24 2 3 49.1 0 0 0.0 0 0 3 22 1 1 2010 NE 1 1 0–1 29 45 64.4 299 6.6 37 2 1 89.0 2 2 1.0 3 0 5 40 1 0 2011 NE 3 3 2–1 75 111 67.6 878 7.9 61 8 4 100.4 9 10 1.1 4 1 3 15 0 0 2012 NE 2 2 1–1 54 94 57.4 664 7.1 47 4 2 84.7 3 4 1.3 3 0 1 9 0 0 2013 NE 2 2 1–1 37 63 58.7 475 7.5 53 1 0 87.7 3 6 2.0 8 1 4 34 1 0 2014 NE 3 3 3–0 93 135 68.9 921 6.8 46 10 4 100.3 11 10 0.9 9 1 4 24 0 0 2015 NE 2 2 1–1 55 98 56.1 612 6.2 42 3 2 76.6 9 19 2.1 11 1 4 18 0 0 2016 NE 3 3 3–0 93 142 65.5 1,137 8.0 48 7 3 97.7 9 13 1.4 15 0 9 42 0 0 2017 NE 3 3 2–1 89 139 64.0 1,132 8.1 50 8 0 108.6 7 8 1.1 6 0 4 17 1 1 2018 NE 3 3 3–0 85 125 68.0 953 7.6 35 2 3 85.9 5 −4 −0.8 0 0 1 9 1 0 2019 NE 1 1 0–1 20 37 54.1 209 5.6 29 0 1 59.4 0 0 0.0 0 0 0 0 0 0 2020 TB 4 4 4–0 81 138 58.7 1,061 7.7 52 10 3 98.1 13 −3 −0.2 2 1 6 37 2 0 2021 TB 2 2 1–1 59 91 64.8 600 6.6 55 3 1 90.0 1 0 0.0 0 0 7 49 1 1 Career 47 47 35–12 1,165 1,855 62.8 13,049 7.0 73 86 39 90.4 114 133 1.2 15 7 79 495 15 5\n\nSuper Bowl\n\nYear SB Team Opp. Passing Rushing Result Cmp Att Pct Yds Y/A TD Int Rtg Att Yds Avg TD 2001 XXXVI NE STL 16 27 59.3 145 5.4 1 0 86.2 1 3 3.0 0 W 20–17 2003 XXXVIII NE CAR 32 48 66.7 354 7.4 3 1 100.5 2 12 6.0 0 W 32–29 2004 XXXIX NE PHI 23 33 69.7 236 7.2 2 0 110.2 1 −1 −1.0 0 W 24–21 2007 XLII NE NYG 29 48 60.4 266 5.5 1 0 82.5 0 0 0.0 0 L 17–14 2011 XLVI NE NYG 27 41 65.9 276 6.7 2 1 91.1 0 0 0.0 0 L 21–17 2014 XLIX NE SEA 37 50 74.0 328 6.6 4 2 101.1 2 −3 −1.5 0 W 28–24 2016 LI NE ATL 43 62 69.4 466 7.5 2 1 95.2 1 15 15.0 0 W 34–28 (OT) 2017 LII NE PHI 28 48 58.3 505 10.5 3 0 115.4 1 6 6.0 0 L 41–33 2018 LIII NE LAR 21 35 60.0 262 7.5 0 1 71.4 2 −2 −1.0 0 W 13–3 2020 LV TB KC 21 29 72.4 201 6.9 3 0 125.8 4 −2 −0.5 0 W 31–9 Career 277 421 65.8 3,039 7.2 21 6 97.7 14 28 2.0 0 W−L 7–3\n\nNFL career records\n\nRegular season\n\nAwards and honors\n\nNFL\n\nNCAA\n\n1997 National champion (Associated Press)\n\nMedia\n\nSports Emmy Awards\n\n2022 Outstanding Documentary Series (as executive producer of Man in the Arena)[467]\n\nOther endeavors\n\nBrady has been featured as a guest star on several popular television programs, hosting Saturday Night Live in 2005[468] and voicing himself in the 2005 The Simpsons episode \"Homer and Ned's Hail Mary Pass\" and the 2006 Family Guy episode \"Patriot Games\"; both football-themed episodes were broadcast within a week of that year's Super Bowl.[469][470] In 2009, he appeared as himself in a sixth season episode of Entourage.[471] In 2015, he had cameo appearances as fictionalized versions of himself in the Entourage movie[472] and Ted 2.[473]\n\nIn 2007, Brady was a model for the Stetson cologne.[474] Brady has endorsed brands including Uggs, Under Armour, Movado, Aston Martin and Glaceau Smartwater. According to Forbes, he earned about $7 million from endorsements alone in 2014.[475][476] In 2016, he began appearing in a Beautyrest Black commercial campaign for Simmons Bedding Company.[477] In 2016, he launched his own line of vegan snacks.[478]\n\nOn January 20, 2016, Brady announced the launch of his peak performance website TB12Sports.com. The site features information on Brady's training regimen and includes a store to purchase TB12 equipment and merchandise.[479] Later in the year, on August 23, 2016, the TB12 brand then expanded to offer a snack line. The snacks contain raw, vegan, and organic ingredients that are also free of gluten and dairy.[480] The following month, Brady, alongside Boston Private and Robert Paul Properties, announced the formation of the TB12 Foundation. The purpose of the nonprofit foundation is to provide free post-injury rehabilitation care and training to underprivileged, young athletes.[481] In March 2017, Brady moved beyond his snack line and partnered with meal-kit startup Purple Carrot to offer his own line of TB12 Performance Meals. The meals utilize whole foods and focus on providing nutrients for workout recovery.[482][483] On September 19, 2017, Simon & Schuster published Brady's first book The TB12 Method: How to Achieve a Lifetime of Sustained Peak Performance. Within 48 hours, it had become a number one best-seller on Amazon.com.[484] The book also reached No. 1 on The New York Times' weekly Best Sellers list, to be featured in the edition of October 8, 2017.[485]\n\nFilmmaker Gotham Chopra filmed Brady during the 2017 off-season and regular season for a Facebook Watch documentary series entitled Tom vs Time. According to The New York Times, the documentary follows Brady as he \"conducts his ongoing subversion campaign against the actuarial tables of quarterback longevity.\"[486] He launched a production company, 199 Productions, in 2020.[487]\n\nIn 2021, Brady and Richard Rosenblatt co-founded a sports-based NFT platform called Autograph.[488] Autograph reached a deal with DraftKings for exclusive distribution on Autograph's sports products, creating the DraftKings Marketplace.[489] In January 2021, Autograph announced it raised $170M in funding led by Andreessen Horowitz and Kleiner Perkins.[490]\n\nBrady has participated in The Match–an exhibition and charity golf event featuring professional golfers and other athletes–in 2020, 2021, and 2022.[491][492][493]\n\nOn May 10, 2022, Fox Sports announced that following Brady's playing career, he would join the network as the lead color commentator.[494] Brady’s deal with Fox will reportedly pay him $375 million over 10 years, making Brady the highest paid sports commentator in history, eclipsing the $18 million per year ESPN was reportedly paying to Troy Aikman.[495] A week later, Netflix announced that Brady will be featured in a series of upcoming specials called \"Greatest Roasts of All Time: GROAT.\" Brady is the executive producer of the series.[496]\n\nPersonal life\n\nBrady was raised as a Roman Catholic, but in a 2015 interview with The New York Times, expressed he was less religious than he is spiritual.[497] He stated, \"I don't know what I believe. I think there's a belief system, I'm just not sure what it is.\"[498] Brady dated actress Bridget Moynahan from 2004 until late 2006.[499] Brady and Moynahan ended their relationship in early December 2006, around the time Moynahan became pregnant.[500] On February 18, 2007, Moynahan confirmed to People magazine that she was more than three months pregnant with Brady's child.[499] Their son, John Edward Thomas Moynahan, [501] was born in August 2007, at Saint John's Health Center in Santa Monica, California.[502]\n\nBrady began dating Brazilian model Gisele Bündchen in December 2006.[503][504] In 2009, Brady said they had been set up on a blind date by a mutual friend.[505] Brady and Bündchen married on February 26, 2009, in an intimate Catholic ceremony in Santa Monica, California.[506] Together, they have two children: a son, Benjamin Rein Brady, born in December 2009,[507] and a daughter, Vivian Lake Brady, born in December 2012.[508]\n\nBrady and baseball player Kevin Youkilis became brothers-in-law in 2012, when Youkilis married Brady's sister Julie.[509] Brady's niece Maya Brady is a college softball player for the UCLA Bruins.[510]\n\nBrady and his family previously resided in the Boston suburb of Brookline, Massachusetts during his playing career with the Patriots, as well as New York City.[511] They own several homes together and spend time during the summer at the Yellowstone Club near Big Sky, Montana, and at their home at Silo Ridge in Amenia, New York.[512][513] When Brady signed with the Buccaneers, he rented a mansion in Tampa, Florida, owned by retired baseball player and former Miami Marlins owner Derek Jeter.[514] In December 2020, Brady and Bündchen reportedly bought a home in Indian Creek, Florida.[515]\n\nPolitics\n\nBrady attended the 2004 State of the Union Address as a special guest of then-President George W. Bush.[516] In 2004, he told ESPN The Magazine that being a U.S. Senator would be his \"craziest ambition\".[517][518]\n\nBrady is a friend of former President Donald Trump;[519][520] in 2017, Brady indicated he had known Trump \"for 16 years\".[521] At a political event in New Hampshire on the day before the 2016 presidential election, Trump said he had received a call from Brady, and that Brady told him \"Donald, I support you, you're my friend, and I voted for you.\" However, after his wife was asked directly on Instagram whether she and Brady backed Trump, Bündchen answered \"NO!\"[522] After a Trump campaign \"Make America Great Again\" cap was photographed in Brady's locker, Brady said that Bündchen told him to not discuss politics anymore, which he thought was a \"good decision\".[523] Brady did not join the New England Patriots in visiting Trump at the White House in April 2017 after their Super Bowl victory, citing \"personal family matters\".[524]\n\nIn an interview with Howard Stern on The Howard Stern Show in April 2020, Brady explained that Trump had reached out to him to speak at the 2016 Republican National Convention, and that he declined, saying, \"It was uncomfortable for me because you can't undo things, not that I would undo a friendship, but political support is totally different than the support of a friend.\" He said that he has known Trump since 2001, and that Trump asked him to be a judge in the Miss USA pageant, after Brady led the Patriots to victory in Super Bowl XXXVI. He explained that Trump used to come to Patriots games and would call him and golf with him occasionally. However, Brady said that he did not see the benefit of getting involved in an event as polarizing as a presidential election.[525] Brady reiterated in 2022 that he had not spoken with Trump in \"years\" and that his relationship with Trump had been mischaracterized by the media.[526]\n\nWhile there has been speculation that Brady would run for political office,[527] in a 2015 interview he stated he had no interest in doing so.[528][529][530] He reiterated in 2022 that he would avoid a political career because, \"I don’t think anyone’s fond of politics these days.\"[526]\n\nIn 2018, he endorsed Republican Helen Brady (no relation) for State Auditor of Massachusetts. Helen Brady eventuality lost the election to Democrat Suzanne M. Bump.[531][532][533]\n\nDiet and lifestyle\n\nBrady's health regimen includes transcendental meditation, yoga, hydrating, an 80/20 diet (meaning 80% alkaline and 20% acidic), early bed time, resistance training and neuroplasticity training.[534]\n\nHe and his family adhere to a controversial, strict diet, the \"TB12 Method\", which has attracted much media attention.[535][536] Brady advocates a daily water intake in ounces of half of one's body weight in pounds and personally consumes \"a couple hundred ounces\" daily.[537][538] He avoids most fruits, mushrooms, tomatoes, peppers, eggplants, coffee, Gatorade, white sugar, flour, gluten, dairy, soda, cereal, white rice, potatoes, and bread.[539][540] In 2022 Brady said he prefers a diet consisting of organic food saying, \"You’ve got to see the process of food being grown [...] If I need nutrients, I need that from soil.[526]\n\nBrady's friend and former teammate, tight end Rob Gronkowski, has followed Brady and Alex Guerrero's plant-based diet plan since 2017.[541][542] Other professional athletes who follow Brady's diet include quarterback Kirk Cousins[543] and hockey player Mark Scheifele.[544][545]\n\nSee also\n\nNotes\n\nReferences\n\nFurther reading", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Tom_Brady_2011.JPG/220px-Tom_Brady_2011.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Tom_Brady_vs._Vikings_2014.jpg/220px-Tom_Brady_vs._Vikings_2014.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/NCAAFootball_transparent.png/20px-NCAAFootball_transparent.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Brady_and_Michel.png/220px-Brady_and_Michel.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Tom_Brady_Hyannis_May_2009.jpg/170px-Tom_Brady_Hyannis_May_2009.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Patriots_on_offense_at_Super_Bowl_XXXIX_1.jpg/220px-Patriots_on_offense_at_Super_Bowl_XXXIX_1.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Tom_Brady_%28cropped%29.jpg/170px-Tom_Brady_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Tom_Brady_Qatar_2018.jpg/220px-Tom_Brady_Qatar_2018.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Tom_Brady_WFT-Buccaneers_NOV2021_%28cropped%29.jpg/220px-Tom_Brady_WFT-Buccaneers_NOV2021_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/a/a1/Tom_Brady_with_Vince_Lombardi_trophy_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/American_football.svg/19px-American_football.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Tom_Brady_2015.JPG/220px-Tom_Brady_2015.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Tom_Brady_2020_playoffs.jpg/170px-Tom_Brady_2020_playoffs.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/WFT_vs._Buccaneers_%2851684899417%29_%28cropped%29.jpg/170px-WFT_vs._Buccaneers_%2851684899417%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Tom_Brady_In_2019.jpg/220px-Tom_Brady_In_2019.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Tom_Brady_2016.JPG/220px-Tom_Brady_2016.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Patriotsgiants_031.jpg/220px-Patriotsgiants_031.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Tom_Brady7.jpg/220px-Tom_Brady7.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Tom_Brady_WFT-Buccaneers_NOV2021_%28cropped%29.jpg/1200px-Tom_Brady_WFT-Buccaneers_NOV2021_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/TomBrady.jpg/220px-TomBrady.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/19px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Pro_Football_Hall_of_Fame_%2827033840159%29.jpg/220px-Pro_Football_Hall_of_Fame_%2827033840159%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/20160917_Tom_Brady_at_Michigan_Stadium.jpg/220px-20160917_Tom_Brady_at_Michigan_Stadium.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Tom_Brady_Super_Bowl_LII_85F9D5D.jpg/220px-Tom_Brady_Super_Bowl_LII_85F9D5D.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Tom_Brady_in_October_2013.jpg/220px-Tom_Brady_in_October_2013.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Tom_Brady_WFT-Buccaneers_NOV2021_%28cropped%29.jpg/1200px-Tom_Brady_WFT-Buccaneers_NOV2021_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tom_Brady", "title": "Tom Brady", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Tom_Brady_WFT-Buccaneers_NOV2021_%28cropped%29.jpg/640px-Tom_Brady_WFT-Buccaneers_NOV2021_%28cropped%29.jpg", "width": 640, "height": 959}, "title": "Tom Brady - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}