{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/07/31/game-of-thrones-recap-the-queens-justice-is-brutal-while-daenerys-and-jon-try-to-find-common-ground/", "text": "Gift Article Share\n\nThey are all eventful episodes at this point. And they better be. This time we got the most-anticipated meeting of the entire series with Dany and Jon finally coming face to face and we also saw another major character death. But this episode gets some bonus points because it was actually pretty funny. You’d expect things to be nothing but deadly serious as we draw closer to the conclusion, but a bit of levity like Davos’s introduction of Jon will always be welcome. Now to what happened.\n\n\n\nDaenerys and Jon finally come face to face\n\nAs Jon, Davos and their party sail into Dragonstone, they are met by Daenerys’s greeting party led by Tyrion and Missandei. This allows Jon and Tyrion to make each other’s acquaintance for the first time since back in Season 1. That’s when Jon was just a lowly member of the Night’s Watch and Tyrion visited the Wall so he could live out one of his dreams by peeing off the top. (Those were simpler times.) “It’s been a long road but we’re both still here,” Tyrion says to Jon, which is maybe how I’ll sum things up in these recaps when they inevitably drag on and on. Jon and Davos hand over their weapons, Davos tries to make small talk with Missandei while Jon and Tyrion do the same on their trek to the castle. The conversation is interrupted when Rhaegar, Viserys and Drogon do a well-timed flyby and buzz the group. “I’d say you get used to them but you never really do,” Tyrion notes.\n\nWalking into the throne room, Missandei introduces Daenerys like she’s about to step into the ring and fight for the unified middleweight championship of the world. “You stand in the presence of Daenerys Stormborn of House Targaryen. Rightful heir to the Iron Throne. Rightful Queen to the Andals and First Men. Protector of the Seven Kingdoms. The Mother of Dragons. The Khaleesi of the Great Grass Sea. The Unburnt. The Breaker of Chains.”\n\nAdvertisement\n\nDavos and Jon share a glance before Davos chimes in: “This is Jon Snow … he’s King in the North.” It’s the funniest moment of an episode that had a few legit laugh lines. The back and forth that follows and the conflict at the center of it gets to the main issue at the heart of the show. Daenerys wants Jon to bend the knee and pledge loyalty in her effort to take the Iron Throne. Jon could care less about the Iron Throne and is more worried about the army of dead that’s on its way to wipe out all of humanity. The very same army that almost everyone he tells about refuses to believe actually exists.\n\nDany does her best to talk Jon into bending the knee, using both logic and intimidation — the North has pledged in perpetuity to House Targaryen, she has the dragons, she has the Dothraki. She’ll make Jon warden of the North, he just has to bend that knee. But he won’t shut up about the White Walkers and the Night King. Dany runs through the hell she’s endured from the moment of her birth and maybe rips off a Tupac lyric in the process (“So many men have tried to kill me i don’t remember all their names”) and tells Jon that what got her through everything was faith in herself, that she was born to rule the Seven Kingdoms. She does not lack confidence. Jon reminds her that she’ll rule a graveyard if the Night King isn’t stopped. Davos steps up and tells everyone that Jon is no slouch himself. Maybe Dany has destiny on her side, but look at Jon — from bastard to King in the North, the first to bring men and wildlings together, he even took a knife in the heart and gave his own li — hold that thought, Davos. Jon shoots him a look. Let’s not get into the whole black magic resurrection thing right now, we just met these people.\n\nTyrion finally says what we were all thinking — if these battles of the living don’t matter, then what’s the harm in just bending the knee? But Jon still can’t do it, and to Dany this means he’s in open rebellion. But she won’t make him a prisoner. Yet.\n\nJon and Tyrion get more time to catch up when they go separately to the designated brooding corner of Dragonstone. Tyrion is brooding because he didn’t see the Euron Greyjoy’s surprise attack coming; Jon is brooding because it is simply what he does. “You make me feel like I’m failing at brooding,” Tyrion tells Jon (another laugh line!), before telling him that he actually believes Jon about the White Walkers. That doesn’t mean it will be easy to convince other people, whose minds can handle the idea of a problem like Cersei (“a familiar monster”) but not one like an army of the dead. Tyrion expertly finds a middle ground, though — he convinces Jon that Daenerys is on the side of good and that it’s unreasonable to expect her to commit to fighting an enemy she hasn’t seen as explained by a man she doesn’t know. So what’s something reasonable he can help Jon with?\n\nAnd that would be the dragonglass buried beneath Dragonstone. Dany can barely be bothered with this, but Tyrion says this dragonglass can apparently kill White Walkers, or something like that. (He seems as annoyed with this oh-so-convenient plot device as many of us are.) Dany’s more interested in whether Tyrion himself believes in the White Walkers and he drops an ancient piece of wisdom — a wise man once said you should never believe something just because you want to believe it. Daenerys busts him: “Are you trying to present your own statements as ancient wisdom?” Tyrion convinces her that she has nothing to lose by giving Jon the dragonglass; Dany wants to know about the whole “knife in the heart” thing Davos briefly mentioned and Tyrion tries to pass it off as those crazy northerners and their crazy talk.\n\nAdvertisement\n\nLater, when Dany tells Jon she’ll allow him to mine for dragonglass, the two seem to have found at least a tenuous truce. Jon wonders if this means that Dany believes him about the undead, but doesn’t get an affirmative response.\n\nCersei is just as sadistic as ever\n\nEuron Greyjoy takes a victory lap through King’s Landing, being cheered on by the peasants as he drags Yara Greyjoy and Ellaria Sand behind him as prisoners. The whole thing is very arousing to him, but then again this guy seems to be in a constant state of arousal. He gets a full round of applause as he walks into the throne room, where he’s greeted by Cersei on the Iron Throne and presents her with his previously promised gift. He gives her what no other man could give — justice. Ellaria, who knows the rest of her life is going to be unspeakably awful (and that was before spotting the Mountain) spits at Cersei’s feet.\n\nEuron’s intentions are clear — he wants to marry Cersei and take the power that would come with their union. Cersei agrees, but not until the war is won. Euron is feeling good about things, enough to taunt Jaime that he’ll soon be taking his place next to Cersei, on the throne and in the bedroom. He even asks for advice: “Gentle or rough?” before adding something off-color that cannot be printed in a publication like this, unless, that is, it is said by the White House communications director.\n\nAdvertisement\n\nDown in the Red Keep, Cersei relishes time with her two Dornish prisoners, Ellaria Sand and the One Sand Snake Who Didn’t Die. And for the next few minutes it’s pure, uncut Cersei. The primo stuff. “I was there that day when Ser Gregor crushed your lover’s head,” she tells Ellaria, and goes from there. Crossing Cersei in any way will provoke her; murdering her only daughter gets you the special treatment. Cersei’s first act of revenge against Ellaria — you get the feeling this will be drawn out in an agonizing way — is to kill the Living Sand Snake the same way Ellaria killed Myrcella, a kiss with poison. Cersei plants the kiss of death (and quickly drinks the serum) and explains how Ellaria (chained and gagged mere feet away from her daughter) will watch the slow death that will unfold over the next few days. “Your daughter will die here in this cell and you will be there watching when she dies.”\n\nA little torture and murder gets Cersei hot and bothered, because soon she’s jumping Jaime’s bones and the two of them are back to their passionately incestuous ways. The next morning a toweringly confident Cersei not only doesn’t make Jaime hide when a chambermaid comes knocking to tell her she has a visitor, but also instructs said chambermaid that they’ll need fresh sheets for the bed. (See, this was a funny episode.)\n\n\n\nOlenna Tyrell has zinged her last zinger\n\nWe were all gearing up for a brutal and extended Battle for Casterly Rock, but it never transpired. The Unsullied (led by Grey Worm) invaded and suffered some losses, but had a pretty easy time taking the seat of House Lannister. Why was it so easy? Two reasons: 1. Tyrion sneaked the best fighters into the heart of the city through the sewers that his favorite prostitutes traveled discreetly, and 2. the 10,000-strong Lannister army was just a shell of itself. Grey Worm knew it shouldn’t have been that easy and realized they had sort of been had when he sees the Greyjoy fleet destroying the Unsullied’s ships in the Casterly Rock harbor, basically stranding them and making them a sitting target.\n\nAdvertisement\n\nAs for those missing Lannister men, they were over in Highgarden, easily overwhelming the Tyrell army and taking the city. You have to give Cersei credit so far, her battle plans have been top-notch. Jaime finds Olenna Tyrell alone in her chambers and she is resigned to her fate.\n\nOlenna does have one last speech in her, admitting she did unspeakable things to protect her family but that they were all necessary. Meanwhile Cersei has done things that Olenna didn’t think were capable of imagining, and that she’s truly a monster. “She’s a disease and I regret my role in spreading it,” she says to Jaime. “You will, too.” (Foreshadowing the popular theory that Jaime will kill his sister?) Jaime will still let Olenna die with some dignity, avoiding the fate of Ellaria and simply downing some poison and being done with it. Jaime pours it into her wine glass and Olenna chugs it down immediately, saying she will hate to die like Jaime’s son before dropping her last bit of revenge on the Lannisters and admitting that she was the one who poisoned Joffrey. “Tell Cersei,” she instructs Jaime. “I want her to know it was me.” Farewell, Queen of Thorns. And farewell to the Tyrells, who seem to be more-or-less eliminated from the world.\n\nBran returns to Winterfell\n\nSansa has taken to running things in Winterfell, and rather well. Either that or the people in charge of food and armor are idiots, but command does seem to suit her, as Littlefinger points out. In pure Littlefinger fashion, he wants to get to plotting. And he honestly has the most refreshing take on the Battle of the Seven Kingdoms vs. Battle Against the Army of Dead dilemma. Basically — either we all die, or life will win out. And if the latter happens, what then? He goes on and on about how everyone is an enemy and Sansa must think through every possible series of events and how everything is happening at once and it’s a bit confusing but serves as good preparation for what comes next. And that’s the appearance of Bran Stark.\n\nAdvertisement\n\nSansa and Bran catch up by the weirwood tree and Bran informs his sister that he can never be Lord of Winterfell or lord of anything because he’s the Three-Eyed Raven now. “I don’t know what that means,” says Sansa, speaking for literally every single one of us. “It’s difficult to explain,” says Bran, which at least gives me an out from having to explain it. Short version — he can see everything that’s ever happened, and everything that will happen, but he needs to better harness his powers. Sansa wants to know how he knows all this; Bran says the Three-Eyed Raven taught him. Sansa says, I thought you were the Three-Eyed Raven. Before they go full Abbott & Costello, Bran starts to get all mystical and Sansa says she has to, uh, go somewhere else right now.\n\nJorah is healed\n\nThe maester in Oldtown checks out Jorah Mormont with some ancient stethoscope and gives him a clean bill of health. Jorah claims it was the rest and the climate that made him better, which would sound better if he was in rehab and not dying of a flesh-eating, brain-infecting bacteria. He’s off to find Daenerys now.\n\nJorah’s claims of rest obviously don’t convince the maester, who knows Sam operated on Jorah even though it was strictly forbidden. The maester is impressed and asked how Sam did it; Sam just read the book and followed the instructions. The maester then informs Sam that his next assignment is to put together a Malm bed frame. No, he just has to make copies of some ancient manuscripts and scrolls, because that’s what they do in Oldtown.\n\nThat weird Melisandre/Varys conversation\n\nAs Jon Snow came to Dragonstone, Melisandre was watching alone, from afar, before Varys tracked her down. “I’ve brought ice and fire together,” she says, saying that her work is done. She’s also trying to stay out of the way of Jon Snow and Davos, who both have their issues with her. She’s off to Volantis and Varys thinks that’s a good thing, and that she should not return to Westeros. But her final line to him hints that she has one more part to play in this tale: “I have to die in this strange country, just like you.”\n\nPREVIOUS SEASON 7 RECAPS\n\nEpisode 2: “Stormborn”\n\nHere's what we're still talking about after Episode 2 of the seventh season of \"Game of Thrones,\" including the beginning of Daenerys's plan to take King's Landing. (Video: Erin Patrick O'Connor, Daron Taylor/The Washington Post)\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2017/07/e31a1dd95b519c8063075bf3ebfc231d685e7cd34fb0985dfabe35ab063bdeb84011b71e4ae81ada3b2eb21920dc167c.jpg&w=1440"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2017/07/e31a1dd95b519c8063075bf3ebfc231d685e7cd34fb0985dfabe35ab063bdeb84011b71e4ae81ada3b2eb21920dc167c.jpg&w=1440", "keywords": [], "authors": ["David Malitz"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/07/31/game-of-thrones-recap-the-queens-justice-is-brutal-while-daenerys-and-jon-try-to-find-common-ground/", "title": "‘Game of Thrones’ recap: ‘The Queen’s Justice’ is brutal, while Daenerys and Jon try to find common ground", "meta_data": {"description": "Jon Snow and Daenerys Targaryen finally come face to face, while death comes for yet another character in Westeros.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/07/31/game-of-thrones-recap-the-queens-justice-is-brutal-while-daenerys-and-jon-try-to-find-common-ground/", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2017/07/e31a1dd95b519c8063075bf3ebfc231d685e7cd34fb0985dfabe35ab063bdeb84011b71e4ae81ada3b2eb21920dc167c.jpg&w=1440", "title": "Review | ‘Game of Thrones’ recap: ‘The Queen’s Justice’ is brutal, while Daenerys and Jon try to find common ground", "description": "Jon Snow and Daenerys Targaryen finally come face to face, while death comes for yet another character in Westeros."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Review | ‘Game of Thrones’ recap: ‘The Queen’s Justice’ is brutal, while Daenerys and Jon try to find common ground", "description": "Jon Snow and Daenerys Targaryen finally come face to face, while death comes for yet another character in Westeros."}, "last_updated_date": "2021-12-03T06:50:30.302Z", "article": {"published_time": "2017-07-31T06:37:31.000Z", "modified_time": "2021-12-03T06:50:30.302Z", "section": "Arts & Entertainment", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 71, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/07/31/game-of-thrones-recap-the-queens-justice-is-brutal-while-daenerys-and-jon-try-to-find-common-ground/"}, "movies": [], "publish_date": 1501455600.0, "source": "https://www.washingtonpost.com", "summary": ""}