{"url": "https://www.nme.com/blogs/tv-blogs/unbreakable-kimmy-schmidt-references-2088507", "text": "Like her NBC sitcom 30 Rock, Tina Fey’s Netflix show Unbreakable Kimmy Schmidt is crammed with pop culture references. In season 1, Kimmy – a kidnap victim freed after years of imprisonment – picked apart Katy Perry‘s ‘Firework’ after hearing it for the first time. In season 2 the show imagined the creation of ‘Pizza Rat Boulevard’ in New York City, to honour the rat that went viral for its pizza-carrying abilities. 2017’s season 3 had Kimmy’s roomie Titus Andromedon re-enacting scenes from Beyoncé’s ‘Lemonade’ after discovering his boyfriend might be cheating on him. But what about the other jokes – the obscure ones designed to go over your head? Here are 17 you might have missed.\n\n1. “The Reverend claimed he came up with the ‘I’d like to buy the world a Coke’ commercial”\n\nFrom: S2E4 – ‘Kimmy Kidnaps Gretchen!’\n\nWho says it: Kimmy\n\nWhat it means: It’s a play on the fact that John Hamm, who plays the Reverend, was also Mad Men‘s Don Draper. In the last episode of Mad Men, Draper comes up with the ’70s Coca-Cola tagline.\n\n2. “D’Fwan broke up with me!”\n\nAdvertisement\n\nFrom: S3E6 – ‘Kimmy Is a Feminist!’\n\nWho says it: Titus Andromedon\n\nWhat it means: Tituss Burgess (Kimmy‘s Titus) was briefly in 30 Rock as a reality TV star called D’Fwan – so it’s weird for 30 Rock fans when, in the third season of Kimmy, Titus talks about his ex-boyfriend D’Fwan, because Burgess played both characters.\n\n3. “This is a real apartment”\n\nFrom: Various\n\nWho says it: Various\n\nWhat it means: If you’re not paying attention you’ll probably miss the running joke that the house shared by Kimmy and Titus is actually a tugboat turned on its end. It was recently highlighted at the end of season 3 in a throwaway line made by Kimmy’s new boss Zach (who’s basically Back To The Future‘s Marty McFly, by the way).\n\n4. “Let me explain how the internet works. It’s not a big truck – it’s a series of tubes”\n\nFrom: S2E6 – ‘Kimmy Drives a Car!’\n\nWho says it: Titus\n\nWhat it means: The phrase ‘series of tubes‘ is famous enough in the US that it has its own Wikipedia page. It was an analysis of the internet made in 2006 by Alaska’s then-Senator Ted Stevens. His simple approach to the subject was widely ridiculed and is now something of a marker for technical improficiency.\n\n5. Dong as Ghostbusters‘ Rick Moranis\n\nAdvertisement\n\nFrom: S1E8 – ‘Kimmy Is Bad At Math!’\n\nWho does it: Dong\n\nWhat it means: The final scene of this season 1 episode is almost a shot-for-shot recreation of the below scene from Ghostbusters, in which Rick Moranis is being chased and is desperately trying to get inside a restaurant. Dong, one of Kimmy’s love interests, does the same, only he’s trying to get inside because Kimmy is on a date with another man.\n\n6. “She has returned in full like Alcibiades to Athens, and I have become her Eupolis”\n\nFrom: S2E2 – ‘Kimmy Goes On a Playdate!’\n\nWho says it: Deirdre Robespierre\n\nWhat it means: Jacqueline’s highbrow nemesis goes full-on Classics scholar in this analogy comparing their relationship to the famous rivalry between two fifth-century BC Athenians, (which Alcibiades won by having Eupolis drowned).\n\n7. Xanthippe\n\nFrom: The whole series\n\nWhat it means: Jacqueline’s daughter Xanthippe is named in honour of Socrates’ wife. In Xenophon’s Symposium he describes her as “the hardest to get along with of all the women there are,” and Socrates says he married her because “I know full well, if I can tolerate her spirit, I can with ease attach myself to every human being else.” A similar relationship is presented between the ultra-positive Kimmy and the grumpy teenage Xan.\n\n8. “Mikey told me Shark Week is now a union holiday”\n\nFrom: S2E11 – ‘Kimmy Meets a Celebrity!’\n\nWho says it: Titus\n\nWhat it means: In a memorable scene of 30 Rock, the uncontrollable comic Tracy Jordan tells NBC employee Kenneth: “Live every week like it’s Shark Week”. In Fey’s universe, it seems to have developed into a public holiday.\n\n9. “Lumiere… Belle… Gaston!”\n\nFrom: S1E7 – ‘Kimmy Goes To a Party!’\n\nWho says it: Kimmy\n\nWhat it means: While in a fancy restaurant with Titus, Kimmy pretends to speak French, but the only words she can say are names of Beauty and the Beast characters.\n\n10. “When is Deblasio gonna put an end to these senseless shorty fires burning on the dance floor?”\n\nFrom: S2E4 – ‘Kimmy Kidnaps Gretchen!’\n\nWho says it: Lillian\n\nWhat it means: This throwaway line from Kimmy’s landlord is of course a reference to the lyrics of Sean Kingston ‘Fire Burning’.\n\n11. “I’m really glad you’re not a giant crab”\n\nFrom: S2E12\n\nWho says it: Mikey\n\nWhat it means: Speaking to Titus, Mikey subtly references the fact that actor Tituss Burgess played Sebastian the crab in a Broadway version of The Little Mermaid.\n\n12. “Welcome to the singing laundromat / We are not responsible for theft”\n\nFrom: S3 – various\n\nWho says it: Titus, Dionne Warwick\n\nWhat it means: When you first hear this vocal warmup, Titus is preparing to record backing vocals. In episode 8, featuring the hilarious Maya Rudolph as Dionne Warwick, there’s a blink-and-you-miss-it callback, where it’s revealed that her character taught Titus the warmup lines.\n\n13. “All day long he biddy-biddy bums”\n\nFrom: S3E13\n\nWho says it: Lillian, Artie\n\nWhat it means: When asked if her bf Artie is rich, Lillian says yes, adding the above phrase. It’s taken from Fiddler on the Roof‘s ‘If I Were A Rich Man’, and you later see Artie singing “Biddy biddy bum” to himself.\n\n14. Michael Torpey’s stupid names\n\nFrom: S3E7 – ‘Kimmy Learns About The Weather!’\n\nWho says it: Drench Thunderman\n\nWhat it means: Actor Michael Torpey’s work with Tina Fey has become something of a running joke, because of the silly names of his characters. In 30 Rock he played NBC’s head of standards and practices called Gaylord Felcher. In Kimmy Schmidt he plays a weatherman called Drench Thunderman.\n\n15. “If he wasn’t my son, perhaps I’d be dating him”\n\nFrom: S3E5 – ‘Kimmy Steps On a Crack!’\n\nWho says it: Orson Snyder\n\nWhat it means: The oligarchic dad of Jacqueline’s boyfriend Russ is a parody of Donald Trump. Trump actually once said: “If Ivanka weren’t my daughter, perhaps I’d be dating her”, and that’s what’s being parodied with Orson Snyder’s comments about his awful sons.\n\n16. LaDonica/”Bitch, I don’t know your life”\n\nFrom: S2E4 – ‘Kimmy Kidnaps Gretchen!’\n\nWho says it: Jacqueline\n\nWhat it means: In this clip, Jacqueline recalls going into a pharmacy and being told the above phrase by a woman called LaDonica. The moment combines various aspects of Fey’s other work – in Baby Mama the phrase itself is used; in 30 Rock, Kenneth encounters an unhelpful pharmacist called LaDonica.\n\n17. “And she stepped on the ball!”\n\nFrom: S1E6 – ‘Kimmy Goes to School!’\n\nWho says it: Xan’s friend.\n\nWhat it means: This episode recalls a line from Trading Places and Auntie Mame. In all of them a privileged person tells a story about stepping on a ball – in this case it’s one of Xanthippe’s terrible friends.\n\nHave you spotted any other obscure Kimmy Schmidt references? Let us know in the comments.", "images": ["https://www.nme.com/wp-content/uploads/2020/01/logo-nme-white.svg", "https://www.nme.com/wp-content/uploads/2017/06/UKS_302_Unit_00694_R-696x442.jpg", "https://www.nme.com/wp-content/uploads/2017/06/UKS_302_Unit_00694_R.jpg", "https://www.nme.com/wp-content/uploads/2017/06/UKS_313_Unit_01364_R_CROP.jpg", "https://www.nme.com/wp-content/uploads/2019/11/logo-nme.svg"], "top_img": "https://www.nme.com/wp-content/uploads/2017/06/UKS_302_Unit_00694_R.jpg", "keywords": [], "authors": ["Larry Bartleet"], "canonical_link": "https://www.nme.com/features/tv-features/unbreakable-kimmy-schmidt-references-2088507", "title": "17 Unbreakable Kimmy Schmidt references that probably passed you by", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Like 30 Rock, Tina Fey's Unbreakable Kimmy Schmidt is crammed with random references. Here's 17 of the most obscure", "og": {"locale": "en_GB", "type": "article", "title": "17 stupidly obscure Unbreakable Kimmy Schmidt jokes – explained", "description": "Like 30 Rock, Tina Fey's Unbreakable Kimmy Schmidt is crammed with random references. Here's 17 of the most obscure", "url": "https://www.nme.com/features/tv-features/unbreakable-kimmy-schmidt-references-2088507", "site_name": "NME", "image": {"identifier": "https://www.nme.com/wp-content/uploads/2017/06/UKS_302_Unit_00694_R.jpg", "width": 1000, "height": 635, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/nmemagazine/", "published_time": "2017-06-15T10:54:53+00:00"}, "author": "Larry Bartleet", "twitter": {"card": "summary_large_image", "creator": "@nme", "site": "@nme", "label1": "Written by", "data1": "Larry Bartleet", "label2": "Estimated reading time", "data2": "7 minutes"}, "generator": "WordPress 6.0.2"}, "movies": ["https://www.youtube.com/embed/GxtZpFl3pPM?feature=oembed", "https://www.youtube.com/embed/lvjLzcWpIhM?feature=oembed", "https://www.youtube.com/embed/CrRudfWIKmA?feature=oembed", "https://www.youtube.com/embed/rjwuf_3P068?feature=oembed", "https://www.youtube.com/embed/Af3XmOXAk0w?feature=oembed", "https://www.youtube.com/embed/U8NxtL-oLm4?feature=oembed", "https://www.youtube.com/embed/gD97XMn2mtw?feature=oembed", "https://www.youtube.com/embed/YkyhvCdJ_vM?feature=oembed", "https://www.youtube.com/embed/2DUXVAg7oWg?feature=oembed", "https://www.youtube.com/embed/RBHZFYpQ6nc?feature=oembed", "https://www.youtube.com/embed/czHOwVuxSa8?feature=oembed", "https://www.youtube.com/embed/4q0TBm-iTqQ?feature=oembed", "https://www.youtube.com/embed/kj7i88LQ9DE?feature=oembed"], "publish_date": 1497524093.0, "source": "https://www.nme.com", "summary": ""}