{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/randy-spelling-net-worth/", "text": "Randy Spelling Net Worth: Randy Spelling is an American actor, author, and life coach who has a net worth of $10 million. The son of media mogul Aaron Spelling and brother of actress Tori Spelling, Randy began acting in 1996, playing \"Flipper\" Gage on the teen soap \"Malibu Shores,\" which was created by his father. Spelling also starred as Sean Richards on \"Sunset Beach\" (1997–1999), another show his father produced. Randy produced and starred on the 2007 A&E reality series \"Sons of Hollywood,\" which was billed as \"The Real Entourage.\" Since 2009, he has worked as a life and business coach in Los Angeles and Portland, Oregon, and he published the book \"Unlimiting You: Step Out of Your Past and Into Your Purpose\" in 2015.\n\nEarly Life: Randy Spelling was born Randall Gene Spelling on October 9, 1978, in Los Angeles, California. His father, Aaron, produced popular shows such as \"Charlie's Angels,\" \"The Love Boat,\" \"Beverly Hills, 90210,\" and \"Melrose Place,\" and his mother, Candy Spelling, is an author and philanthropist. Randy's sister, Tori, is best known for playing Donna Martin on \"Beverly Hills, 90210.\" Aaron passed away in 2006 and left Randy and Tori just $800,000 each from his $600 million estate. Randy attended Montclair College Prep in Van Nuys and began his acting career as a teenager.\n\nCareer: Randy made his acting debut on the NBC series \"Malibu Shores,\" which aired 10 episodes in 1996. He then starred on the NBC soap opera \"Sunset Beach,\" appearing in 387 episodes between 1997 and 1999. Spelling guest-starred on \"Beverly Hills, 90210\" 14 times between 1992 and 2000, playing Ryan Sanders (brother of Ian Ziering's Steve Sanders) in 11 episodes and a character named Kenny in three episodes. He appeared in the films \"Held for Ransom\" (2000) and \"Dorm Daze\" (2003), and he guest-starred on \"7th Heaven\" (one of his father's shows) in 2004.\n\nIn 2006, Randy appeared in the films \"Hoboken Hollow,\" \"Pledge This!,\" and \"Hot Tamale,\" and in 2007, he starred on the reality series \"Sons of Hollywood\" alongside agent David Weintraub and Sean Stewart, the son of singer Rod Stewart. He also appeared in the 2008 horror movie \"Dimples,\" the 2018 short film \"Evolving Guys,\" and the 2021 drama \"Cosmic Radio.\" Spelling is the founder and \"Head Freedom Strategist\" at Randy Spelling Coaching and is dedicated to \"helping [people] live better lives, reach new levels of success and find lasting happiness.\" According to the Randy Spelling Coaching website, he offers private coaching, consulting, group programs, and retreats.\n\nPersonal Life: Randy married Leah Stutz on September 25, 2010, and they have two daughters, Sage and Lotus. In a 2014 interview with \"Radar,\" Spelling spoke about his struggles with alcohol and drug addiction, stating \"It's been years and years, but until 27, that was my life – numbing myself to not want to feel my feelings and deal with any parts of myself that might be painful, challenging or uncomfortable. I found it easier to cover that up and not deal with it, and the more that I did that the more overwhelming life became.\"", "images": ["https://vz.cnwimg.com/wp-content/uploads/2011/12/randy2.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/wp-content/uploads/2011/12/Randy-Spelling-1.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2011/12/Randy-Spelling-2.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2011/12/randy2.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/randy-spelling-net-worth/", "title": "Randy Spelling Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Randy Spelling net worth: Randy Spelling is an American actor and socialite who has a net worth of $10 million dollars.  Born in Los Angeles", "cnw_share_fb_count": 105, "cnw_share_tw_count": 15, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Randy Spelling Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/randy-spelling-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2011/12/randy2.jpg", "site_name": "Celebrity Net Worth", "description": "Randy Spelling net worth: Randy Spelling is an American actor and socialite who has a net worth of $10 million dollars.  Born in Los Angeles"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2021-07-04T17:45:10+00:00", "published_time": "2021-06-13T14:48:47+00:00", "section": "Actors", "tag": "tori spelling net worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2011/12/randy2.jpg", "title": "Randy Spelling Net Worth", "description": "Randy Spelling net worth: Randy Spelling is an American actor and socialite who has a net worth of $10 million dollars.  Born in Los Angeles"}}, "movies": [], "publish_date": 1623595727.0, "source": "https://www.celebritynetworth.com", "summary": ""}