{"url": "https://www.billboard.com/articles/columns/hip-hop/8014118/eminem-revival-album-drug-ad-website", "text": "No detail is overlooked in an intricate ad campaign for a make-believe prescription drug called Revival, which just might be the title of Eminem‘s highly anticipated next album.\n\nPaul Rosenberg, Eminem’s longtime manager (and new CEO of Def Jam Recordings), posted a seemingly ordinary photo on Instagram Wednesday (Oct. 25). In the snapshot, he’s holding up a physical copy of the upcoming Yelawolf album, Trial by Fire, ahead of its release this Friday.\n\nExplore Explore Eminem See latest videos, charts and news See latest videos, charts and news\n\nUpon closer inspection, though, some sleuthing fans on Reddit got one step ahead of the rest of us and noticed something unusual: a huge ad for the drug Revival covering the side of a city building. Except there is no actual drug named Revival out there, and the ad was apparently purchased by Interscope Records, according to a listing on the Detroit Free Press.\n\nLook what arrived at the Shady offices today! @Yelawolf TRIAL BY FIRE comes out this Friday 10/27! #cdbaby A post shared by Paul Rosenberg (@rosenberg) on Oct 25, 2017 at 1:26pm PDT\n\nWhat does all of this have to do with Eminem? Well, for one, the “E” on Revival is backwards, just like it is on Em’s logo. Beyond that, a website created for the supposed drug that treats “Atrox Rithimus” (a non-existent condition) almost appears legit, except it holds a slew of light references to the rapper.\n\n“Seize the moment,” the website announces, a phrase which brings to mind a lyric from his Eminem Show track “Sing for the Moment.” “REVIVAL could be music to your ears.”\n\nThe script for an embedded commercial promoting the drug has an actor saying phrases like “lose yourself” and “I won’t waste my one shot,” a la 2002’s “Lose Yourself.” And the bottom of the page reads: “REVIVAL does not cause these side effects, but if you have them you should for sure seek medical attention, ‘I need a doctor.'” (Eminem, of course, has a song titled “I Need a Doctor” with Dr. Dre.)\n\nOh, and if you actually call the number listed on the website — 1-833-2GET-REV — and let the recorded message play, you’ll hear a piano background tune that sounds like “I Need a Doctor.” Stay on the line and you’ll eventually hear the female voice casually say, “We give you some serious fucking credit for sticking through this ad.”\n\nWhite there’s no confirmation that Revival is in fact the title of Eminem’s ninth studio album, it’s a safe guess to make. A whole lot of work went into this marketing campaign.\n\nLose yourself in the rabbit hole that is the Revival website here, and if you’re still not convinced that all these clues are intentional, remember that Eminem has already done something like this before. To promote his Relapse album in 2009, his team launched a website for a fictional rehab center by the name of Popsomp Hills — and Popsomp, by the way, is the company credited as manufacturer for the Revival drug, according to the small print on the drug’s website.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/uploads/media/eminem-live-lolla-billboard-1548.jpg?w=1024", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif"], "top_img": "https://www.billboard.com/wp-content/uploads/media/eminem-live-lolla-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Ashley Iasimone"], "canonical_link": "https://www.billboard.com/music/rb-hip-hop/eminem-revival-album-drug-ad-website-8014118/", "title": "Fake Drug Ad Hints Eminem’s New Album Might Be Called ‘Revival’", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "No detail is overlooked in an intricate ad campaign for a make-believe prescription drug called Revival, which just might be the title of Eminem's highly anticipated next album.", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 8014118, "author": "Ashley Iasimone", "pmc-category": "Music,R&B/Hip-Hop", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-10-25T21:34:23"}, "title": "Fake Drug Ad Hints Eminem’s New Album Might Be Called ‘Revival’", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Ashley Iasimone", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 8014118, "title": "Fake Drug Ad Hints Eminem's New Album Might Be Called 'Revival'", "published_at": "2017-10-25 21:34:23", "image": "https://www.billboard.com/wp-content/uploads/media/eminem-live-lolla-billboard-1548.jpg?w=1024", "comment_count": 0, "topics": "R&B/Hip-Hop", "body": "No detail is overlooked in an intricate ad campaign for a make-believe prescription drug called Revival, which just might be the title of Eminem's highly anticipated next album.Paul Rosenberg, Eminem's longtime manager (and new CEO of Def Jam Recordings), posted a seemingly ordinary photo on Instagram Wednesday (Oct. 25). In the snapshot, he's holding up a physical copy of the upcoming Yelawolf album, Trial by Fire, ahead of its release this Friday.Upon closer inspection, though, some sleuthing fans on Reddit got one step ahead of the rest of us and noticed something unusual: a huge ad for the drug Revival covering the side of a city building. Except there is no actual drug named Revival out there, and the ad was apparently purchased by Interscope Records, according to a listing on the Detroit Free Press. Look what arrived at the Shady offices today! @Yelawolf TRIAL BY FIRE comes out this Friday 10/27! #cdbabyA post shared by Paul Rosenberg (@rosenberg) on Oct 25, 2017 at 1:26pm PDTWhat does all of this have to do with Eminem? Well, for one, the \"E\" on Revival is backwards, just like it is on Em's logo. Beyond that, a website created for the supposed drug that treats \"Atrox Rithimus\" (a non-existent condition) almost appears legit, except it holds a slew of light references to the rapper. \"Seize the moment,\" the website announces, a phrase which brings to mind a lyric from his Eminem Show track \"Sing for the Moment.\" \"REVIVAL could be music to your ears.\"The script for an embedded commercial promoting the drug has an actor saying phrases like \"lose yourself\" and \"I won't waste my one shot,\" a la 2002's \"Lose Yourself.\" And the bottom of the page reads: \"REVIVAL does not cause these side effects, but if you have them you should for sure seek medical attention, 'I need a doctor.'\" (Eminem, of course, has a song titled \"I Need a Doctor\" with Dr. Dre.)Oh, and if you actually call the number listed on the website -- 1-833-2GET-REV -- and let the recorded message play, you'll hear a piano background tune that sounds like \"I Need a Doctor.\" Stay on the line and you'll eventually hear the female voice casually say, \"We give you some serious fucking credit for sticking through this ad.\"White there's no confirmation that Revival is in fact the title of Eminem's ninth studio album, it's a safe guess to make. A whole lot of work went into this marketing campaign.Lose yourself in the rabbit hole that is the Revival website here, and if you're still not convinced that all these clues are intentional, remember that Eminem has already done something like this before. To promote his Relapse album in 2009, his team launched a website for a fictional rehab center by the name of Popsomp Hills -- and Popsomp, by the way, is the company credited as manufacturer for the Revival drug, according to the small print on the drug's website.", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "Fake Drug Ad Hints Eminem’s New Album Might Be Called ‘Revival’", "url": "https://www.billboard.com/music/rb-hip-hop/eminem-revival-album-drug-ad-website-8014118/", "description": "No detail is overlooked in an intricate ad campaign for a make-believe prescription drug called Revival, which just might be the title of Eminem’s highly anticipated next album.", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/eminem-live-lolla-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Eminem, 2017"}, "locale": "en_US"}, "article": {"published_time": "2017-10-26T01:34:23+00:00", "modified_time": "2017-10-26T16:26:47+00:00"}, "twitter": {"site": "@billboard", "card": "summary_large_image", "title": "Fake Drug Ad Hints Eminem’s New Album Might Be Called ‘Revival’", "description": "No detail is overlooked in an intricate ad campaign for a make-believe prescription drug called Revival, which just might be the title of Eminem's highly anticipated next album.", "image": "https://www.billboard.com/wp-content/uploads/media/eminem-live-lolla-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1508981663.0, "source": "https://www.billboard.com", "summary": ""}