{"url": "https://www.popmatters.com/riverdale-s1ep13-2495392129.html", "text": "This review contains spoilers for the end of Riverdale‘s first season.\n\nPerhaps some of you will recall that I didn’t like Riverdale‘s pilot episode. Sometimes it’s good to be proven wrong, because I do like to like things. What began as a deep-fried Twinkie of a guilty pleasure show grew in leaps and bounds over its 13 episodes, eventually settling into a chocolate bar of a guilty pleasure, to continue the metaphor. Perhaps fully suspending any sense of fidelity to the original comics allowed my opinion on the show to change. Perhaps it was the tangled plot lines and the lush visuals finally driving themselves into my brain.\n\nOr, perhaps, the show slowly developed a rhythm and charm all its own, for the most part successfully transporting some version of the classic characters into a Shakespearean tragedy crossed with a Gothic horror novel, infused with a massive dose of typical CW-soapiness. Brothers killing brothers out of greed, decades-old dynastic blood feuds, one quasi-incestuous secret romance, a town divided between the haves and the have-nots, and a fabulously ornate mansion literally called “Thornhill”, where terrible truths trap its inhabitants as surely as the mansion’s gates; there’s something for nearly everyone with a taste for campy drama.\n\nIndeed, once I’d accepted that this Riverdale wasn’t the Riverdale I knew by any stretch of the imagination, it was all the more enjoyable to see the little bits and pieces of the comics did make it into what’s basically high-budget mystery/alternate-universe fan fiction. Namely, the performances of KJ Apa (Archie Andrews), Camilla Mendes (Veronica Lodge), and Lili Reinhart (Betty Cooper) manage to elevate the material when it flags, thoughtfully maintaining a good bit of this classic trio even as their friendships and relationships diverge so wildly from the usual love triangle.\n\nOnce the unfortunate Miss Grundy (Sarah Habel) storyline was properly disposed of, Apa’s iteration of Archie, while certainly sexier than ever before, also makes use of Archie’s most important qualities as he became integrated further into the central murder narrative. Even as the plot thickens, twists, and veers in all directions, Apa maintains Archie’s naiveté, his goodheartedness, his loyalty to his friends, and his tendency towards skirt-chasing, while actually making a case for him as a viable romantic lead (or at least, object of desire). Unfortunately, the show glosses over the emotional repercussions of him having been preyed upon by Miss Grundy; once Miss Grundy is gone, that plot thread goes out of nearly everyone’s minds as they move on to bigger and better things.\n\nMendes, whom I praised in my original review, continues to shine as Veronica Lodge, the former Blair Waldorf-esque bully turned altruistic, generous friend and confidante. Smart, savvy, and impeccably dressed, Mendes’ Veronica manages to feel like she’d been friends with the Riverdale gang from the very beginning, even as so much of her screen time is consumed with her confronting the truth about her parents and why she and her mother had to leave New York in the first place. Reinhart’s Betty takes on a sleuthing role that suits the character well as she, too, learns terrible truths about her family, truths that would devastate any family, regardless of how strong it is. The humble Coopers, it turns out, are secretly estranged cousins of the wealthy Blossoms, making Polly Cooper’s relationship with the late Jason Blossom (resulting in her getting pregnant) fairly squicky. Reinhart portrays Betty’s desire for knowledge and justice — for her mistreated sister, for Jason — as mingled with an unsettling undercurrent of vengeance.\n\nThe greatest surprise, though, is Madeleine Petsch’s performance as Cheryl Blossom, Jason’s twin and heir to the Blossom family empire. I never liked Cheryl Blossom in the original comics; she always seemed to show up to flirt with Archie when the Betty-Archie-Veronica triangle got boring, her dimwitted, often sexist, brother Jason in tow. In the comics, she’s basically Veronica without Veronica’s good qualities. Riverdale, however, transforms her into an occasionally tragic figure, despite her commitment to being the nasty queen bee of Riverdale High, and always compelling. By establishing her love for Jason as more than a little creepy, Petsch’s Cheryl becomes a mystery unto herself.\n\nFurther, as more is revealed about her family’s shady doings (and the Blossoms; terrible parenting habits), it becomes clear that Cheryl’s a victim in more ways than one. As I watched the last few episodes, I wanted to scream at Cheryl to get out of that house (the aforementioned “Thornhill” estate), because it sure seemed like she was at risk of getting murdered on some ornate staircase or balcony. Cheryl’s arc in Riverdale season one basically goes where you’d expect: in the season finale, she gives away several notable possessions, intending to drown herself in the town’s river where Jason’s body was dredged up. Thankfully for those of us looking forward to season two, she manages to stick around.\n\nThe weak link in the main cast is Cole Sprouse’s Jughead Jones, though that’s probably more the fault of the writing. The main problem is that in order to shift the tone of Riverdale into the appropriate minor key, nearly every character has become tonally darker and more troubled in some way. Unfortunately, Jughead gets turned from prank-loving glutton into a Holden Caulfield wannabe, if Holden Caulfield had decided to write a “phony” detective novel. His relationship with his father (Skeet Ulrich), a gang member from the wrong side of the tracks implicated in Jason’s murder, creates genuine moments of pathos, and there are at times the potential for some keen commentary about class divides in Riverdale.\n\nUnfortunately, Sprouse’s performance remains incredibly one-note: he’s just sour and misanthropic. His relationship with Betty is unsatisfying and painful to watch, if only because it isn’t clear what he brings to the table aside from siphoning her emotional labor and endless acceptance. There’s also absolutely no chemistry there, and I hope that the “Bughead” pairing is quickly scrapped in season two. If Riverdale had therapists, perhaps more could have been made of Jughead’s feelings of abandonment and isolation. Right now, his problems feel more like they’re added for quirky character reasons, and not because the show’s interested in exploring these issues.\n\nIn order to make the murder investigation feel urgent, and for the town itself to feel like a sinister character, Riverdale has made the decision to turn nearly every spare character into a jerk. Chuck Clayton (Jordan Calloway) fares pretty badly in this regard. In the comics, he’s actually one of the sweetest characters: a creative artist whose main flaw was spending too much time drawing and not enough time with his girlfriend. In Riverdale, he’s reduced to a menacing misogynistic bully with no redeeming qualities. Dilton Doiley (Major Curda), the comics’ resident nerdy genius, is here just an unpleasant hardcore survivalist who only shows up two or three times.\n\nThe worst reinterpretation, however, has to be that of the Cooper parents — Alice (Mädchen Amick) and Hal (Lochlyn Munroe) — who display basically no scruples, honesty, or kindness for the vast majority of their screen time. Sending away their pregnant daughter because the father was a member of the Blossom family (and then lying about it to Betty, refusing to let them get in contact) is pretty much irredeemable, although Amick chews the scenery in her every scene with relish and dedication, at least making her cartoonish villainy entertaining. Munroe’s performance isn’t quite on the same level, making Hal both impossibly cruel and rather boring.\n\nThe shunting aside of the Josie and the Pussycats is also a weak point of the show. The pilot set up so many different narrative threads that once the “Archie wants to be a musician” story lost its intensity (due to Miss Grundy leaving), the Pussycats were left adrift. They seem to be the only people in all of Riverdale completely removed from Jason’s murder investigation, which meant that we didn’t see them interacting with most of the other characters. Josie (Ashleigh Murray) appears here and there as the daughter of the calculating Mayor McCoy (Robin Givens), but aside from a mention of a friendship with Cheryl, she’s really only there to play music with Archie and validate his efforts, even relegating the Pussycats to Archie’s backup.\n\nValerie Brown (Hayley Law) at least has the benefit of briefly being in a mutually supportive relationship with Archie for a few episodes, but also fades into the backdrop once she breaks up with him for being a bad boyfriend. I don’t actually remember any times that Melody Valentine (Asha Bromfield) has lines, so it’s pretty evident that the show only touts Josie and the Pussycats to commend itself on being diverse, even as they don’t add much to the central narrative or get any development.\n\nThe first season ends on a cliffhanger — yet another violent act has been committed by mysterious forces — and so season two will likely be devoted to finding out who shot Fred Andrews (Luke Perry) and why. Of course, there are snippets of ideas that season two will probably explore: the search for Betty and Polly’s secret older brother (given up for adoption); Jughead becoming more involved with his father’s gang; and Cheryl trying to rebuild her life after the destruction of her world. The Riverdale of Riverdale is basically Batman’s Gotham: at this point, it seems like such an awful place to live that you’d think people with the means to leave would have done so already. Yet when the show returns, I know I’ll probably be there alongside the Riverdale gang as they fall in love and sip milkshakes at Pop Tate’s.", "images": ["data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20720%20380'%3E%3C/svg%3E", "https://r7k2t3x9.rocketcdn.me/wp-content/uploads/2022/10/PCSS-BenAnderson-by-JB-720x380.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%202662%20397'%3E%3C/svg%3E", "https://r7k2t3x9.rocketcdn.me/wp-content/uploads/2022/10/hip-hop-matters-september-2022-720x380.jpg", "https://r7k2t3x9.rocketcdn.me/wp-content/uploads/2022/10/Janet-Jackson-The-Velvet-Rope-SP-720x380.jpg", "https://r7k2t3x9.rocketcdn.me/wp-content/uploads/2021/07/AFC93FCB-109D-438E-8023-0BECC8309AB5-720x380.jpeg", "https://r7k2t3x9.rocketcdn.me/wp-content/uploads/2022/02/myke-simon-atsUqIm3wxo-unsplash-720x380.jpg", "https://r7k2t3x9.rocketcdn.me/wp-content/uploads/2022/10/pauline-oliveros-anthology-text-scores-2013-featured-image-720x380.jpg", "https://r7k2t3x9.rocketcdn.me/wp-content/uploads/2022/10/lemmey-miller-bad-gays-2022-featured-image-720x380.jpg", "https://r7k2t3x9.rocketcdn.me/wp-content/uploads/2021/01/img-22460.jpg", "https://r7k2t3x9.rocketcdn.me/wp-content/uploads/2021/02/cropped-logo.png", "https://r7k2t3x9.rocketcdn.me/wp-content/uploads/2021/06/Image-by-Comfreak-from-Pixabay--720x380.jpg", "https://r7k2t3x9.rocketcdn.me/wp-content/uploads/2021/01/img-22459.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20650%20400'%3E%3C/svg%3E"], "top_img": "https://r7k2t3x9.rocketcdn.me/wp-content/uploads/2021/01/img-22459.jpg", "keywords": [], "authors": ["Deborah Krieger", "Peter Piatkowski", "Greg M. Schwartz", "Tom Morgan", "Anna Claudia Postiglione", "Eleni Vlahiotis", "Popmatters Staff", "Karen Zarker", "Root", "--Ppa-Color-Scheme"], "canonical_link": "https://www.popmatters.com/riverdale-s1ep13-2495392129.html", "title": "‘Riverdale’ Gets Good By Embracing Its Campy, Gothic Aesthetic", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index,follow", "description": "This review contains spoilers for the end of Riverdale's first season.", "og": {"locale": "en_US", "type": "article", "title": "‘Riverdale’ Gets Good By Embracing Its Campy, Gothic Aesthetic, PopMatters", "description": "This review contains spoilers for the end of Riverdale's first season.", "url": "https://www.popmatters.com/riverdale-s1ep13-2495392129.html", "site_name": "PopMatters", "image": "https://r7k2t3x9.rocketcdn.me/wp-content/uploads/2021/01/img-22459.jpg"}, "shareaholic": {"site_name": "PopMatters", "language": "en-US", "url": "https://www.popmatters.com/riverdale-s1ep13-2495392129.html", "keywords": "tag:riverdale, cat:featured: top of home page, cat:reviews, cat:television, type:post", "article_published_time": "2017-05-15T00:00:00-05:00", "article_modified_time": "2017-05-15T00:00:00-05:00", "shareable_page": "true", "article_author_name": "Deborah Krieger", "site_id": "0b920eae49c66a4f8641b63b3b439749", "wp_version": "9.7.6", "image": "https://r7k2t3x9.rocketcdn.me/wp-content/uploads/2021/01/img-22459.jpg"}, "generator": "WordPress 6.0.2", "google-site-verification": "hzIrLMtDFM5Y2tFEuXLMEavcwlmwC30SZTWdnPUPiVs", "p": {"domain_verify": "77406daa3751c05edce6b1a2e96fe7ae"}, "msapplication-TileImage": "https://r7k2t3x9.rocketcdn.me/wp-content/uploads/2022/02/cropped-1418A899-16C5-4A17-9A59-9EDBD6F05C61-270x270.jpeg"}, "movies": ["https://www.youtube.com/embed/-2Iap5N2m0k?rel=0"], "publish_date": null, "source": "https://www.popmatters.com", "summary": ""}