{"url": "https://www.usatoday.com/story/life/people/2018/07/11/catfish-host-nev-schulman-opens-up-cleared-sexual-misconduct-allegation/776234002/", "text": "'Catfish' host Nev Schulman gets candid about cleared sexual misconduct allegation\n\nShow Caption Hide Caption MTV suspends Catfish, Nev Schulman investigated for sexual misconduct Catfish star Nev Schulman has been accused of sexual misconduct. Time\n\nYaniv \"Nev\" Schulman of the popular MTV series \"Catfish\" is getting candid about the sexual misconduct allegations he faced in May that resulted in an investigation and the temporary suspension of the show.\n\nDuring an interview with People Wednesday, the host opened up about his experience with the investigation, saying he felt \"powerless.\"\n\nProduction resumed in June after the investigation found claims were \"not credible and without merit,” MTV confirmed to The Hollywood Reporter and Deadline.\n\n“I’m doing much better now. It was a really difficult time for me, as much for my wife and my family,\" he said “To be accused of something that I squarely did not do and to have the harsh judgment that followed and no way to counteract or do something in the moment to correct that was very difficult. It was frustrating. I just felt so powerless.”\n\nThe allegations came to light in two YouTube videos uploaded by Ayissha Morgan, who appeared on the show three years ago. In the videos, titled \"The TRUTH about the show\" she outlined her experience, alleging \"Jack\" (a label she gave to the show's \"main person\") made several inappropriate, sexual comments.\n\nSchulman also said he was “overwhelmed” by the support he received from his fans and crew and urged that he lives within the values represented in \"Catfish,\" namely, honesty.\n\n“I’ve lived a number of different lives in my 33 years. I’ve experienced different things, I’ve been in different social circles and I’ve made mistakes. I’ve been very honest about those and I’ve been accountable, I’ve apologized and done everything I could to make right where I may have wronged,\" he explained.\n\nSchulman also denied the allegations in an emailed statement to USA TODAY after the allegations were made.\n\n“The behavior described in this video did not happen and I’m fortunate that there are a number of former colleagues who were present during this time period who are willing to speak up with the truth,\" he said. \"I have always been transparent about my life and would always take responsibility for my actions – but these claims are false.”\n\n\"Catfish\" follows Schulman and co-host Max Joseph as they uncover the true identities of people's online love interests. Some end up being who they say they are, while others are \"catfish,\" or someone who poses as someone else.\n\nSchulman, 33, also serves as an executive producer on the show. He is married to Laura Perlongo. They have a daughter, Cleo James.\n\nMore: Suspension of 'Catfish' host Nev Schulman revives story about him punching a woman\n\nVideo: \"Catfish\" co-host talks season 2 and Manti Te'o", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/29906170001/29906170001_5786217313001_5786213093001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/-mm-/29f2f187cb6627a41c2a37294493d7387da909a7/c=0-37-1686-990/local/-/media/2018/05/24/USATODAY/USATODAY/636627705093072509-AP-People-Catfish-Producer.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/29f2f187cb6627a41c2a37294493d7387da909a7/c=0-37-1686-990/local/-/media/2018/05/24/USATODAY/USATODAY/636627705093072509-AP-People-Catfish-Producer.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Sara M Moniuszko"], "canonical_link": "https://www.usatoday.com/story/life/people/2018/07/11/catfish-host-nev-schulman-opens-up-cleared-sexual-misconduct-allegation/776234002/", "title": "'Catfish' host Nev Schulman gets candid about cleared sexual misconduct allegation", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/people/2018/07/11/catfish-host-nev-schulman-opens-up-cleared-sexual-misconduct-allegation/776234002/life/people", "theme-color": "#ffffff", "og": {"type": "article", "title": "'Catfish' host Nev Schulman gets candid about cleared sexual misconduct allegation", "description": "During an interview with People Wednesday, the host opened up about his experience with the investigation, saying he felt \\", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/29f2f187cb6627a41c2a37294493d7387da909a7/c=0-37-1686-990/local/-/media/2018/05/24/USATODAY/USATODAY/636627705093072509-AP-People-Catfish-Producer.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "During an interview with People Wednesday, the host opened up about his experience with the investigation, saying he felt \\", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1531263600.0, "source": "https://www.usatoday.com", "summary": ""}