{"url": "https://web.archive.org/web/20080528044750/http://gossipgirl.wikia.com:80/wiki/Serena_van_der_Woodsen", "text": "From Gossip Girl Wiki\n\nSerena van der Woodsen Name Serena Celia van der Woodsen Portrayed By Blake Lively First Appearance 1.01, \"Pilot\" Age 17\n\nSerena Cecilia van der Woodsen is a main character in the CW's teen drama Gossip Girl, and the book series of the same name. The character is portrayed by Blake Lively in the television series.\n\nedit] Television Series\n\nedit] Season One\n\nWhen we are first introduced to Serena in the show's pilot episode, she is returning from a self-imposed year at boarding school in Connecticut. She is the daughter of Lily van der Woodsen, a wealthy socialite. Serena also has a troubled younger brother called Eric. Lily and Serena were first seen living in the New York Palace Hotel, while Eric was in a clinic after a suicide attempt. While Eric was the real reason for Serena's abrupt return, other rumours came about. After some effort, the former It Girl reunited with her estranged best friend Blair Waldorf, who didn't know Serena was leaving for boarding school until she was already gone. However, their friendship was shattered shortly afterwards when Blair finds out that shortly before she left town, Serena slept with Blair's boyfriend, Nate Archibald, who supposedly always had a thing for Serena. This leads to the two girls being locked in a rivalry once again.\n\nMeanwhile, Serena meets and goes out on a date with Brooklyn outsider Dan Humphrey after he returned her lost cellphone. The date ends up with them heading to the Dan's father's concert, but they are interrupted when his sister Jenny repeatedly texts Dan asking for help. When Dan and Serena show up at the Kiss on the Lips party they blew off, they find Chuck Bass all over Jenny. Dan punches Chuck, while Serena warns Chuck to stay away from Jenny. In response, Chuck calls Serena a slut and tells her that her life is over.\n\nAt the Ivy Mixer, Blair incorrectly tells everyone that Serena is a patient at the Ostroff Center for a drug addiction. To save her brother the embarrassment, Serena plays along. When Eric tells Blair what really happened, she and Serena reconcile after Blair shows her an unsent letter. Dan and Serena's relationship is quite solid, but he hates the glamorous nature of her lifestyle. Serena continuosly tries to show him how much she's trying to change from her old ways. Serena then finds out that Rufus Humphrey, Dan's father, and Lily are trying to restart their old relationship. Serena pleads with her mother not to go through with it because of her feelings for Dan. This results in Lily accepting a marriage proposal from Bart Bass, Chuck's father.\n\nWhen Serena and Chuck's families are both sampling wedding dinners, an anonymous package full of pornography arrives for Serena. Thinking that Chuck is behind it, Serena naturally becomes angry with him. Shortly afterwards, several crates of champagne are sent to Serena at school, and yet again she believes it was sent by Chuck, who denies it. Serena becomes more furious when Eric brings her another anonymous package, which turns out to be cocaine. Only when Chuck is kicked out by his dad does Serena discover that it wasn't him sending the packages at all, but a former friend called Georgina Sparks.\n\nGeorgina has recently returned from rehab in Switzerland, and expects her friendship with Serena to be back to its old state. However, Serena insists that she's not the same person anymore, knowing how much trouble she and Georgina used to get into. Not liking this, Georgina persuades Serena to go out with her, and spikes her drink with liquid ecstacy when Serena isn't looking. Serena wakes up the next morning, having missed her SATs. Realising that Georgie was behind it, Serena confronts her, letting Georgina know that their friendship is officially over. Furious, Georgina brings up a scandal they were both involved in. Serena leaves her apartment distressed, while hiding everything from Dan. This leads to Georgina calling herself 'Sarah' and starting up a friendship with Dan, who has no clue about her true identity. Georgina gives Serena a flash drive, supposedly containing footage of the real reason Serena left Manhattan. At a dinner with the Lily, Eric and Serena, Georgina 'accidentally' lets it slip that Eric is gay. Serena supports her brother while Lily doesn't know how to react. When Serena goes to meet Sarah, Dan's new friend, Serena is shocked to discover that it's actually Georgina. Georgina then threatens to show Dan the tape, and tells Serena that either they rekindle their friendship the way it was left, or everything will be revealed.\n\nWith no-one else to turn to, Serena tells Blair her secret: she killed someone. Immediately after this, Serena leaves for a club and parties hard, leaving with several guys. Blair spends all night trying to find Serena, but eventually finds her and brings her back to the Waldorf's apartment. Blair enlists the help of Chuck and Nate, even though things are still tense between the three of them. Dan shows up looking for Serena, and the other three say that she doesn't want to see him. Still, Dan refuses to leave, until Serena goes to talk to him herself. Dan asked if she slept with someone else, and Serena says \"Yes.\" In response, Dan says \"I'm done\" and leaves the apartment. Serena tells the others that she didn't actually sleep with anyone else, but it was better than knowing the real truth. Blair convinces Serena to tell her, Chuck and Nate the full story behind the night she supposedly killed someone.\n\nOn the night that Serena and Nate slept together, Serena went to a hotel room afterwards, shocked by what she had just done. Also in the hotel room is Georgina and a coke addict, Pete. Georgina briefly leaves the room and Serena and Pete start making out, but Serena gets uncomfortable and eventually suggests that they both take some cocaine to get in the mood. Pete does a line, overdoses, and has a violent seizure. Both Serena and Georgina panic, and when Serena tries to call 911, Georgina stops her because of all the drugs in the room and the fact that they're underage. The whole incident is caught on tape by Georgina. As the two girls rush from the hotel, Serena calls 911 anyway and is unable to help but watch from across the street, waiting for Pete to come out relatively unharmed. Instead, he leaves in a body bag. A horrified Serena blames herself for Pete's death as she was the one who suggested he do the coke in the first place.\n\nMeanwhile, Lily finds the tape in Serena's dresser and watches it most of the way through. Thinking it's just a sex tape, and a recent one, she switches it off right before Pete's death occurs. Lily thinks the best path of action is to send Serena to a reformatory school, and tells her this at the rehearsal dinner for Lily and Bart's wedding. Blair tries to reason with Lily, telling her that Serena is in a lot of pain and has been hiding a dark secret. Serena eventually tells her mother the whole story, and they talk to Pete's parents, who don't blame her at all for Pete's death. Her guilt absolved, Serena goes to a concert featuring Rufus in order to win Dan back. She just misses Dan but gets a call from him at the concert. It's Georgina at the other end of the line, but Serena says that she's ready to tell the full truth, so she doesn't care about Georgina's blackmail threat. An enraged Georgina pulls Dan outside, still pretending to be Sarah, and kisses him. Confused and hurt, Serena is left wondering at the concert.\n\nedit] Family\n\nWilliam van der Woodsen (father)\n\nLily Rhodes-Van der Woodsen (mother)\n\nEric van der Woodsen (younger brother)\n\nCatherine 'Cece' Rhodes (maternal grandmother)\n\nCarol (maternal aunt)\n\nBart Bass (soon-to-be stepfather)\n\nChuck Bass (soon-to-be step brother)\n\nedit] Romantic relationships\n\nNate Archibald (one night stand)\n\nDan Humphrey (Began dating in 1.01 'Pilot', and broke up in 1.17 'Woman on the Verge', as Serena lied and said she slept with someone else.)\n\nCategory:Characters", "images": ["https://web.archive.org/web/20080528044750im_/http://wikia-ads.wikia.com/1dot.php?js=YToxODp7czo3OiJjaXR5X2lkIjtzOjQ6IjY5MTMiO3M6NzoidXNlcl9pZCI7aTowO3M6NDoiaG9zdCI7czoyMDoiZ29zc2lwZ2lybC53aWtpYS5jb20iO3M6NzoicmVmZXJlciI7czowOiIiO3M6MTE6ImRlc3RpbmF0aW9uIjtzOjU1OiJodHRwOi8vZ29zc2lwZ2lybC53aWtpYS5jb20vd2lraS9TZXJlbmFfdmFuX2Rlcl9Xb29kc2VuIjtzOjU6ImFnZW50IjtzOjExOiJpYV9hcmNoaXZlciI7czoxMToic2NyaXB0X25hbWUiO3M6Mjg6Ii93aWtpL1NlcmVuYV92YW5fZGVyX1dvb2RzZW4iO3M6MTE6InNlcnZlcl9uYW1lIjtzOjIwOiJnb3NzaXBnaXJsLndpa2lhLmNvbSI7czoxMToicmVtb3RlX2FkZHIiO3M6MTQ6IjIwOS4yMzQuMTcxLjQwIjtzOjExOiJxdWVyeV9wYXJhbSI7czoyODoidGl0bGU9U2VyZW5hX3Zhbl9kZXJfV29vZHNlbiI7czoxMToicmVxdWVzdF91cmkiO3M6Mjg6Ii93aWtpL1NlcmVuYV92YW5fZGVyX1dvb2RzZW4iO3M6ODoiaXNsb2dnZWQiO2k6MjtzOjk6Im5hbWVzcGFjZSI7aTowO3M6MTA6ImFydGljbGVfaWQiO3M6NDoiMTg5NiI7czo5OiJpc2FsbG93anMiO2I6MTtzOjc6InNlc3Npb24iO3M6MDoiIjtzOjU6InRva2VuIjtzOjMyOiI1YWRiZmM1NzdkNDJjNjU5ZmUwZmIyMjRiMTJmM2Y1ZiI7czoxMDoidW5pcXVlX2tleSI7aTowO30=", "https://web.archive.org/web/20080528044750im_/http://images.wikia.com/gossipgirl/images//6/64/Favicon.ico", "https://web.archive.org/web/20080528044750im_/http://pixel.quantserve.com/pixel/p-8bG6eLqkH6Avk.gif", "https://web.archive.org/web/20080528044750im_/http://images.wikia.com/common/releases_200805.5/skins/monobook/blank.gif", "https://web.archive.org/web/20080528044750im_/http://images.wikia.com/gossipgirl/images//4/44/Serena_001.jpg"], "top_img": "https://web.archive.org/web/20080528044750im_/http://images.wikia.com/gossipgirl/images//6/64/Favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Serena van der Woodsen", "meta_data": {"description": "Serena Cecilia van der Woodsen is a main character in the CW's teen drama Gossip Girl, and the book series of the same name. The character is portrayed by Blake Lively in the television series.", "keywords": "Gossip Girl Wiki,gossipgirl,Serena van der Woodsen,Blair Waldorf,Blake Lively,Chuck Bass,Dan Humphrey,Pilot,Georgina Sparks,Bart Bass,Rufus Humphrey,Nate Archibald,Gossip Girl"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}