{"url": "https://www.washingtonpost.com/entertainment/tv/unbreakable-kimmy-schmidt-too-good-for-nbc-but-still-not-that-great/2015/03/05/6a38f632-c12d-11e4-9ec2-b418f57a4a99_story.html", "text": "Created by Tina Fey and Robert Carlock, \"Unbreakable Kimmy Schmidt\" is Netflix's latest comedy series and will be available March 6. (Netflix)\n\nNot too many moons ago, a television story like this would have required smelling salts to revive all the showbiz industry reporters who had passed out from the news:\n\nA creator/performer of Tina Fey’s talent and buzzworthiness announces that she’s moving her finished, warmly anticipated midseason NBC comedy series to a different network, one that viewers can access only through a subscription fee and broadband connection. On top of that, NBC, with which Fey has been happily allied her entire career, has agreed to (and apparently helped arrange) this sudden departure.\n\nHardly anyone blinked.\n\nYou already know why, because you’ve read countless headlines and stories about how television as we once knew it is so completely over.\n\nThat’s precisely what fascinates me about “Unbreakable Kimmy Schmidt,” the entire first season of which began streaming Friday morning on Netflix: It’s the near-total agreement — from the highest glass offices at NBCUniversal down to your and my living-room couches — that “Kimmy Schmidt” doesn’t belong on “regular” TV, that it somehow deserved a classier fate than the prime-time grid.\n\nThe show, which was created by Fey and her “30 Rock” collaborator Robert Carlock and still produced by NBCUniversal, is about a relentlessly sunny woman (Ellie Kemper of “The Office” and “Bridesmaids”) who starts life over in New York after spending 15 years as a sister-wife in a doomsday cult’s bunker in Indiana.\n\nIt was supposed to debut this month on NBC, which touted the show for months as part of its midseason schedule, but at some point late last fall, “Kimmy Schmidt” was judged by its creators and network executives to be too smart, too precious (or too something; we’ll get back to that) to face the usual crapshoot that determines a show’s success, most notably its Nielsen ratings. Even though Nielsen has adjusted its measurements to reflect the way viewers absorb new shows (by DVR, video on demand and time-shifted viewing on other devices, in every way except osmosis), the story is usually tragic: Viewers are hard to pin down, and practically every scripted show this season that’s not called “Empire” has more or less debuted with its time-bomb clock already counting the final “MacGruber”-like seconds.\n\nAs proof of its commitment to the creative process more than the bottom line, Netflix agreed to pick up “Unbreakable Kimmy Schmidt” for a second season before viewers had seen a single episode. It’s a sweet deal for NBCUniversal, Fey and everyone else.\n\n\n\nProducer and co-writer Robert Carlock, at the Netflix TCA Press Tour in January. He says that discussions with NBC were “really honest and productive” and that “we just said, ‘Could we explore other options?’ ” (Mark Davis/Getty Images for Netflix)\n\nProducer and co-writer Tina Fey: “[I]t just makes more sense than broadcast, I think, for these kinds of shows.” (Mark Davis/Getty Images for Netflix)\n\nWith help from Fey and Carlock, both NBC and Netflix put a spin on the move that’s as giddy as Kimmy’s discovery (in the first episode) of a Manhattan bulk-candy shop.\n\n“It was probably the fastest that anything good has ever happened to me in this business,” Carlock told reporters at a news conference with TV critics this year. “Bad things happen real quick all the time. We were just having conversations with NBC about scheduling and about where we could go and where they could launch us, and it was just a really honest and productive conversation [about] the larger landscape of comedy right now. And we just said, ‘Could we explore other options?’ ”\n\nBefore Fey and Carlock knew it — in a matter of days, they said — they were talking to Netflix. And NBC was fine with that.\n\n“The show is made by NBC, it’s in NBC’s best interests for the show to [find] its best home,” Fey explained. “And rather than trying to stick it on NBC between a multicam [sitcom] and a drama, they agreed that [Netflix] would be the right place for it.”\n\nBy that point, NBC had already let go of “Community,” which enjoyed hipster cred but never found a sustainably broad audience. (Yahoo TV picked it up, post-cancellation.) And “Parks and Recreation,” after a mountain of positive press and enormous devotion from fans, had also flailed about for most of its broadcast life; in the end, NBC aired “Parks and Rec’s” seventh and final season two episodes at a time, concluding in late February. “30 Rock” had similarly struggled as a broadcast show, but, Fey has observed, it seemed to really connect with Netflix viewers.\n\n“I know so many people who just, anecdotally, go to Netflix just to watch ‘30 Rock’ [and other] shows that modern people aren’t always at their TV at 8:30 on Thursday [to watch],” she said. “So it just makes more sense than broadcast, I think, for these kinds of shows.”\n\nSo if not her new show, what kind of show can work on broadcast television?\n\nLive events, Fey quickly answered. Shows like “The Voice,” award shows, sports and event specials like “Peter Pan Live!”\n\n“Thankfully it’s not my job to figure out what still works on broadcast,” Fey said. “I guess it should have been.”\n\nThough she probably didn’t mean in that moment to forecast the future of the big networks (NBC, ABC, CBS, Fox, the CW), Fey sort of elegantly and bluntly brought it all into focus. She hadn’t lost faith in broadcast television — she even backtracked later and said she would love to make network shows in the future — but in her matter-of-fact shrugs and answers, such was admitting something the networks can never admit at such news conferences: She was moving on.\n\n\n\nEllie Kemper stars in Netflix's \"Unbreakable Kimmy Schmidt.\" (Eric Liebowitz/Netflix)\n\nBoth Fey and Carlock described the liberation that came with taking “Unbreakable Kimmy Schmidt” to Netflix. After the deal was announced, they still had several episodes (there are 13 this season) to finish editing. Now they could be less concerned with all the nonsense that comes with a network half-hour — looking for spots in the story to break to a commercial, for instance, or worrying that a “Mysteries of Laura” promo swipe at the bottom of the screen would visually ruin a joke.\n\nThey could also assume that viewers of episode 5 had already watched episodes 1-4, which helps writers get to the good and funny parts faster. The list goes on: An episode could be 25 minutes long if it needed to be, rather than the rigid 22 minutes. Four-letter words (as well as four-letter-word-type situations) are now possible.\n\nLike its heroine, who finds the world fantastically, even bracingly limitless compared with her former life in a dank bunker with other deluded believers, “Unbreakable Kimmy Schmidt” now basks in the freedoms afforded to those who’ve landed on the sunnier (cooler, edgier) side of the TV revolution.\n\nHere, Kimmy will never have to worry about ratings, because at Netflix, there is no such thing as ratings — at least not in a public sense. The most anyone knows about Netflix is that it has more than 50 million subscribers worldwide. What they watch, and in how many numbers, is carefully guarded information.\n\nAnd if Kimmy doesn’t have to worry about ratings, she also doesn’t have to worry about reviews — all of which would have been glowing anyhow, right? Because everyone loves Ellie Kemper, because everyone loved “30 Rock,” because Tina Fey is such a genius, etc. In many ways, “Unbreakable Kimmy Schmidt” is a hit by association rather than on its own merits.\n\n\n\nJane Krakowski and Ellie Kemper in “Unbreakable Kimmy Schmidt.” As in “30 Rock,” Krakowski is Carlock and Fey’s surest and truest muse. In “Unbreakable,” she plays billionaire trophy wife Jacqueline Voorhees. (Eric Liebowitz/Netflix)\n\nAll of which brings me to my review, if those are still relevant.\n\n“Unbreakable Kimmy Schmidt” certainly might have tanked on NBC, not because broadcast viewers lack the sophistication to appreciate its cheerful absurdity, but because it takes a brilliant and darkly humorous concept (surviving a cult) and finds ways to immediately turn it into a tiresome loop of the same joke over and over and over.\n\nAt its best, “Unbreakable Kimmy Schmidt” is an endearing sendup of the idea that America is the great land of second chances; in its duller moments, the show seems ill-suited to the Netflix ideal, in which a viewer burns through an entire season as fast as possible. After about three episodes, a viewer gets enough.\n\nKimmy is one of five wives of the Rev. Richard Wayne Gary Wayne, who convinced his followers that the world had been destroyed by apocalypse and that they would need to live out their days underground. (The show is sharpest in Kimmy’s occasional flashback scenes to her life in the cult.)\n\nNo sooner are the women rescued by federal agents than a bystander’s observations to the news cameras are Auto-Tuned into a YouTube hit. Kimmy accompanies her sister-wives (now nicknamed “the Indiana Mole Women”) to New York for their obligatory “Today” show interview, where Matt Lauer plays himself, because NBCUniversal is incapable of avoiding any opportunity for self-reference (a habit perfected on “30 Rock”). After the taping, Kimmy impulsively leaves the group to begin life anew.\n\nIt’s both a plus and a minus that “Kimmy Schmidt” comes at us with the same water-pistol delivery style of “30 Rock,” one joke squirted after another, which has a way of making the so-so gags seem just as clever as the sure-fire bits. Fey, Carlock and their writers are totally at home with a tone they perfected in “30 Rock,” and Kemper is an engagingly perfect actor for them to put through the paces. (In fact, Fey and Carlock came up with the show specifically for Kemper.)\n\n“Hey, Red,” a leering construction worker calls out to Kimmy. “You’re making me wish I was those jeans.”\n\n“Well, I wish I was your yellow hat,” Kimmy giddily replies. “It’s my favorite color!”\n\nShe rents a closet in the basement apartment of Titus (Tituss Burgess), a flamboyantly gay singer and daytime street performer (he wears an Iron Man costume in Times Square) who owes the building’s strange landlady (Carol Kane) too much back rent to refuse a roommate. Both Titus and Kimmy discover a common thread as outsiders/survivors — he escaped his Mississippi childhood, she escaped the Rev. Richard Wayne Gary Wayne.\n\nAs for employment, Kimmy winds up working as a nanny in the tony townhome of billionaire trophy wife Jacqueline Voorhees, played by “30 Rock’s” Jane Krakowski.\n\n“How do I look?” Jacqueline asks Kimmy.\n\n“Like a million bucks!” Kimmy replies.\n\n“I know you didn’t mean that to be hurtful,” Jacqueline says, disappointed.\n\nKrakowski remains Fey and Carlock’s truest and surest muse, and they use her to spoof the wealth gap here the same way they once used Jenna Maroney to spoof celebrityhood in “30 Rock”; this may be a show about Kimmy’s misadventures, but it’s never more funny than when Krakowski is on the screen. (After Kimmy decorates for a child’s birthday party, Jacqueline proclaims it to resemble “the reception for an Appalachian incest wedding.”)\n\nPerhaps “Unbreakable Kimmy Schmidt” will eventually find a way to be a show worthy of all this talk and expectation, rather than the B-/C+ attempt at a network show that Fey and Carlock have delivered. There’s not much special about it, so far, except the lucky circumstances of its survival.\n\nBut for proof of its future potential, look no further than the first several episodes of “30 Rock” from the fall of 2006, which are remarkably slower and less entertaining than the fine show that eventually emerged, thanks in no small part to NBC’s patience. They’re on Netflix.\n\nUnbreakable Kimmy Schmidt (13 episodes) is now streaming on Netflix.", "images": ["https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2015/03/04/Style/Images/unbre_tca_008_h.jpg?uuid=lFpJNsKiEeSewrQY9XpKmQ", "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2015/02/25/Style/Images/unbre_s1_005_h.jpg?t=20170517", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://www.washingtonpost.com/pb/resources/img/spacer-gray.png&w=1&h=1", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2015/03/04/Style/Images/unbre_tca_012_h.jpg?uuid=MckLPMKhEeSewrQY9XpKmQ", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2015/02/25/Style/Images/unbre_s1_006_h.jpg?uuid=-qv_ur0oEeSGaE57qEOcpg", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2015/02/25/Style/Images/unbre_s1_005_h.jpg?uuid=5sbEdr0oEeSGaE57qEOcpg"], "top_img": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2015/02/25/Style/Images/unbre_s1_005_h.jpg?t=20170517", "keywords": [], "authors": ["Hank Stuever", "Senior Editor For Style", "March", "Hank Stuever Is Senior Editor For The Washington Post'S Style Section", "Working With Writers", "Editors On The Mix Of Culture", "Politics That Has Defined The Daily Feature Section Since Its Debut. He Joined The Post In As A Style Reporter", "Was Tv Critic To"], "canonical_link": "https://www.washingtonpost.com/entertainment/tv/unbreakable-kimmy-schmidt-too-good-for-nbc-but-still-not-that-great/2015/03/05/6a38f632-c12d-11e4-9ec2-b418f57a4a99_story.html", "title": "‘Unbreakable Kimmy Schmidt’: Too good for NBC, but still not that great", "meta_data": {"eomportal-uuid": "6a38f632-c12d-11e4-9ec2-b418f57a4a99", "object-hash": 1665122612, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "Unbreakable Kimmy Schmidt review, TV review Netflix NBC Unbreakable Kimmy Schmidt, Why did Unbreakable Kimmy Schmidt move from NBC to Netflix, Tina Fey Unbreakable Kimmy Schmidt, Robert Carlock Unbreakable Kimmy Schmidt, Hank Stuever review Unbreakable Kimmy Schmidt, Washington Post review Unbreakable Kimmy Schmidt", "news_keywords": "Unbreakable Kimmy Schmidt review, TV review Netflix NBC Unbreakable Kimmy Schmidt, Why did Unbreakable Kimmy Schmidt move from NBC to Netflix, Tina Fey Unbreakable Kimmy Schmidt, Robert Carlock Unbreakable Kimmy Schmidt, Hank Stuever review Unbreakable Kimmy Schmidt, Washington Post review Unbreakable Kimmy Schmidt", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@hankstuever"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/entertainment/tv/unbreakable-kimmy-schmidt-too-good-for-nbc-but-still-not-that-great/2015/03/05/6a38f632-c12d-11e4-9ec2-b418f57a4a99_story.html", "image": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2015/02/25/Style/Images/unbre_s1_005_h.jpg?t=20170517", "title": "‘Unbreakable Kimmy Schmidt’: Too good for NBC, but still not that great", "description": "CRITIC’S NOTEBOOK | A no-brainer move to Netflix doesn’t necessarily mean Tina Fey’s new show is brilliant."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered", "opinion": "false"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "description": "CRITIC’S NOTEBOOK | A no-brainer move to Netflix doesn’t necessarily mean Tina Fey’s new show is brilliant.", "robots": "index,follow", "theme": "normal"}, "movies": [], "publish_date": 1425513600.0, "source": "https://www.washingtonpost.com", "summary": ""}