{"url": "https://www.lennyletter.com/story/gabourey-sidibe-got-dissed-by-chanel-saleswoman", "text": "I needed new eyeglasses. My friend has a really cute pair of frames from Chanel that I’d been coveting, so I decided to try to buy a pair for myself at the Chanel store near my apartment in Chicago, where I live while shooting the show *Empire*.\n\nOn my way to the store, another friend called. Taraji said she was stuck on set and asked if I would pick up a pair of sandals for her. No problem. I grabbed a cab and in a few minutes walked into the nearly empty shop.\n\nI was looking pretty cute. My wig was long and wavy, I was wearing new ankle boots and my prescription Balenciaga shades, and I had a vintage Chanel purse on my shoulder, over my winter coat with a fur hood. I looked as though I were in a Mary J. Blige video. Just how I like to look! The glasses display was near the door, so I walked right over. A saleswoman and I locked eyes immediately. I said “Hello” before she did. She greeted me, but the look on her face told me that she thought I was lost.\n\n“Can I take a look at your eyeglasses?” I asked.\n\n“We don’t have any,” she answered. “We only have shades. There’s a store across the street that sells eyeglasses.”\n\n“Across the street?” I asked, confused.\n\n“Yes. In the building across the street on the fifth floor.” She gave me the name of a discount frames dealer. I had been at her display for less than a minute, and she was literally directing me to another store.\n\n“But … I want Chanel frames,” I said. She told me the name of the other store again and exactly how to get there and let me know that they had lots of different frames, including Chanel. I’d love to pretend she was being polite, and I’m sure she would love to pretend she was polite, but she was actually condescending. Explaining to me how exactly I should get across the street and out of her sight line, as if I were in kindergarten. I was trying to purchase glasses, and she was trying to get the interaction with me over as soon as possible. Just to be sure of what was happening, I made her tell me to leave, in her pretend-polite way, three times.\n\nI knew what she was doing. She had decided after a single look at me that I wasn’t there to spend any money. Even though I was carrying a Chanel bag, she decided I wasn’t a Chanel customer and so, not worth her time and energy.\n\nThis actually happens to me a lot. My whole life. Both before and after I became a recognizable actress. It happened to me in St. Maarten on vacation after shooting a film, when I went to a Dior counter to look at lip gloss and the saleswoman literally took a gloss out of my hand and put it back down in the display case. It used to happen to me at my neighborhood beauty-supply store in New York, where I was relentlessly followed around whenever my mom sent me to pick up shampoo and Q-tips. Even when I was a teenager, I knew it was because of my skin color but also because of the environment. I lived in the hood. Being suspected of stealing is just par for the course. Also, I definitely went through a mini-klepto phase when I was around fifteen, so some of that suspicion was warranted. But I grew out of it, and if I weighed the times I was suspected of stealing versus the time I actually stole something, it would be about 99 percent to 1 percent.\n\nNo matter how dressed up I get, I’m never going to be able to dress up my skin color to look like what certain people perceive to be an actual customer. Depending on the store, I either look like a thief or a waste of time. There doesn’t seem to be a middle ground between no attention and too much attention.\n\n> Honestly, if I walked out of every store where someone was rude to me,\n\n> I’d never have anything nice.\n\nI still had to get Taraji’s sandals, so I asked where to find them. The saleswoman seemed annoyed but walked me further into the store. As we passed through, other employees who were of color noticed me. All of a sudden, the woman who had pointed me out of the store let me know that even though they didn’t have eyeglasses, the shades they carried actually doubled as eyeglass frames, so I should take a look at the shades I’d come to look at in the first place. Just like that, I went from being an inconvenience to a customer.\n\nI bought two pairs of glasses and two pairs of sandals. Unfortunately, I’m used to people giving me bad service. Honestly, if I walked out of every store where someone was rude to me, I’d never have anything nice. So yes. I spent my hard-earned money on the things I wanted from Chanel, and I’m certain that saleswoman got a commission for finally helping me.\n\nI made sure to give her my email so I could fill out a customer-service survey later. But now that I have the survey, I’m not sure how honest I want to be while filling it out. If I’m honest about my experience, am I being a bad person? Do I get to complain about terrible service when it’s really all I’ve ever known anyway? Do I get to jeopardize someone’s job and livelihood just because I suspect that she treated me like I was a nuisance based on my appearance?\n\nI know logically that I have every right to complain, especially since I spent so much money, but I’m struggling with the idea that I should be nice about it instead. I should extend a courtesy to this stranger who treated me like a beggar. This stranger who even though it is her job to be helpful to me was only so after someone else told her who I am. Only after I proved that I had money.\n\nShould I worry about what a bad review would do to her career? No. But the fact is that I do. There is something in me, pushing me, forcing me to consider this woman’s feelings when she hadn’t considered mine at all. I wonder what part of me is convinced that I actually *am* a nuisance if I fill out this customer survey, honestly. Is it just that I’m a black woman and so I’ve been trained from birth to put all others first and to just be grateful yet apologetic for any space that I take up in this world? Especially any space that I take up in a Chanel store.\n\nTo be fair, I don’t know why that saleswoman didn’t want to help me. I suspect it’s because I’m black, but it could also be because I’m fat. Maybe my whole life, every time I thought someone was being racist, they were actually mistreating me because I’m fat. That sucks too. That’s not OK. I’ve felt unwelcome in many stores throughout my life, but I just kind of deal with it. As a successful adult, sometimes I walk out of the store in a huff, without getting what I want, denying them my hard-earned money. Other times I spend my money in an unfriendly store as if to say “Fuck you! I’ll buy this whole damn store!”\n\nEither way, they win and I lose. Maybe I still feel like this treatment is owed to me from my teenage kleptomaniac phase. Maybe I can’t out-success my guilt … I swear to God. This is why I only shop online!\n\nBut now as I sit staring at what seems like the hundredth customer-service survey I’ve accepted but not completed, it occurs to me: does it matter whether my waist is wide or if my skin is black as long as my money is green?\n\n*Gabourey Sidibe is a film and television actress, director, and cat enthusiast whose memoir* (1) *was released on May 1, 2017.*\n\n__*Update, May 10, 2017:*__\n\n*The following statement is from the House of Chanel in response to Gabby’s essay:*\n\n*Chanel expresses our sincerest regret for the boutique customer service experience that Ms. Sidibe mentioned in this essay. We are sorry that she felt unwelcome and offended.*\n\n*We took her words very seriously and immediately investigated to understand what happened, knowing that this is absolutely not in line with the high standards that Chanel wishes to provide to our customers.*\n\n*We are strongly committed to provide anyone who comes in our boutiques with the best customer service, and we do hope that in the future Ms. Sidibe will choose to come back to a Chanel boutique and experience the real Chanel customer experience.*\n\n1) (https://www.amazon.com/This-Just-My-Face-Stare/dp/0544786769)", "images": ["https://www.lennyletter.com/wp-content/uploads/2021/06/lenny.png", "https://lennyletter.com/wp-content/uploads/2021/06/lenny-logo.jpg", "https://secure.gravatar.com/avatar/d7cda3eb5afff1b2e7737f8e436856f0?s=96&d=mm&r=g", "https://www.lennyletter.com/wp-content/uploads/2021/05/5a247b5ecc9b95000f858485.jpg", "https://www.lennyletter.com/wp-content/uploads/2021/06/lenny-logo.jpg"], "top_img": "https://www.lennyletter.com/wp-content/uploads/2021/06/lenny.png", "keywords": [], "authors": [], "canonical_link": "https://www.lennyletter.com/story/gabourey-sidibe-got-dissed-by-chanel-saleswoman", "title": "When Gabourey Sidibe Got Dissed By a Saleswoman", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large", "generator": "Site Kit by Google 1.35.0", "msapplication-TileImage": "https://www.lennyletter.com/wp-content/uploads/2021/06/lenny.png"}, "movies": [], "publish_date": null, "source": "https://www.lennyletter.com", "summary": ""}