{"url": "https://www.vulture.com/2018/12/golden-globes-2019-nominations-snubs-surprises.html", "text": "Photo: Disney/Focus Features/Hulu/HBO\n\nThe 2019 Golden Globes nominees are here, so it’s time to get prognosticating. Who suffered the biggest snub? What landed the biggest surprise nomination? Who got a nod because the Hollywood Foreign Press Association loves movie stars? And how’d our predictions turn out? The Globes wouldn’t be the Globes without a few unexpected curveballs, so let’s break down the big takeaways about this year’s movies and TV nominees.\n\nMovie Snubs and Surprises\n\nThe HFPA couldn’t get enough of Vice.\n\nAdam McKay’s Dick Cheney biopic has had a polarizing reaction among critics, many of whom were exhausted by the film’s frequent meta digressions, but the gonzo satire seems to have been on Globes voters’ wavelength: Vice went home the big winner of Thursday’s nominations, taking home nods for Best Musical/Comedy, Best Actor in a Musical/Comedy (Christian Bale), Best Supporting Actress (Amy Adams), Best Supporting Actor (Sam Rockwell), Best Director, and Best Screenplay. For the HFPA, it seems it’s always 2006.\n\nBohemian Rhapsody and A Star Is Born’s drama gambits paid off.\n\nEven if they only feature diegetic music, films about rocks stars have generally preferred to run in the Musical/Comedy category at the Globes. This year, both A Star Is Born and Bohemian Rhapsody decided to take their chances in the Drama categories, figuring the added prestige boost was worth the risk of being snubbed in the harder field. It worked! Both films earned nominations in Best Drama and Best Actor in a Drama, with Star also pulling in nods for Best Actress (Lady Gaga), Best Director, and Best Original Song (“Shallow”). (Though Sam Elliott, fresh off a Best Supporting Actor win from the National Board of Review, was a notable snub.)\n\nGreen Book might not just be an acting play.\n\nEven those who don’t particularly care for Green Book admit that, as the film’s real-life interracial road-trip buddies, Viggo Mortensen and Mahershala Ali have winning chemistry. The Globes agreed, giving nominations to both men, but they also went further, handing the film not only its expected nom in Best Musical/Comedy, but also recognizing Peter Farrelly’s direction, as well as the film’s screenplay, which was co-written by the son of Mortensen’s Tony Lip. With Green Book and Mary Poppins, it seems there’s room for more than one feel-good film in this year’s race.\n\nThe final nail in the coffin for First Man and Widows?\n\nTwo big-budget genre films from directors fresh off Oscar glory. Two rousings premieres at the fall festivals. Two disappointing box-office receptions. And now, two big snubs at the Globes: Neither Widows nor First Man made the cut in Best Drama, as Steve McQueen’s heist thriller was snubbed entirely, and Damien Chazelle’s Neil Armstrong biopic managed only two nominations, one for Claire Foy in Best Supporting Actress, the other in Best Original Score. A Best Picture nomination for either now seems like a long shot. As a charter member of the Widows fan club, I’m appointing a special committee to figure out who to blame.\n\nBlacKkKlansman lives!\n\nMany of the early precursors considered Adam Driver the only thing about BlacKkKlansman worth nominating, but after the film made the AFI’s top 10 earlier this week, the HFPA managed to breathe even more life into its chances by handing it four noms. Besides Driver, the film also scored in Best Drama, Best Actor in a Drama (John David Washington), and Best Director. You really can launch an Oscar contender in late summer!\n\nThe HFPA really does love Nicole Kidman.\n\nBefore this morning’s announcement, Kidman had been nominated a whopping 12 times at the Globes; today made it 13, as the Australian actress picked up a nod in Best Actress in a Drama for her turn as a morally compromised detective in Karyn Kusama’s Destroyer. It’s a transformative role, with the ordinarily ultraglam Kidman strapping on a wig, leather jacket, and old-age makeup to play a character who resembles Tig Notaro’s evil twin, and voters clearly appreciated the effort.\n\nNo song nominations for Mary Poppins?\n\nThe Globes loves musicals, and so the Globes loved Mary Poppins Returns, handing it nominations in Best Musical/Comedy, Best Actress in a Musical Comedy (Emily Blunt), Best Actor in a Musical/Comedy (Lin-Manuel Miranda), and Best Score. And yet, the Globes did not love any of the songs in Poppins enough to nominate them in Best Original Song. Can you imagine that?\n\nSome long-shot Best Actor campaigns got a second wind, while another stumbled.\n\nWith ten spots available to leading men, a few male actors who seemed to be on the Oscars bubble got a little bit of a bounce this morning, while another supposed front-runner got snubbed. Willem Dafoe was snubbed at the Gothams and Indie Spirits, but still managed to pull out a Best Actor in a Drama nomination for At Eternity’s Gate, as did Lucas Hedges for Boy Erased, who has been unable to campaign heavily thanks to Broadway commitments. And while the ship seems to have sailed for John C. Reilly in The Sisters Brothers, the actor did pull down a Best Actor in a Musical/Comedy nod for his prosthetics-aided turn in the upcoming Laurel and Hardy biopic Stan & Ollie. The notable omission: First Reformed’s Ethan Hawke, who took home plenty of Best Actor trophies at the hipper precursors, but who couldn’t crack Best Actor in a Drama here.\n\nThe Mule may not have it.\n\nWarners Bros. has been keeping Clint Eastwood’s drug-running drama under wraps, and HFPA voters were among the few people who have actually seen it. Whatever they saw, it wasn’t enough for them to hand it any nominations. Three years ago Eastwood’s American Sniper crashed the Oscars party late; I wouldn’t bet on The Mule doing the same.\n\nTV\n\nThe Americans finally got a Best Drama nod!\n\nIt shouldn’t have taken this long, but just as Vulture’s Jen Chaney predicted, the HFPA finally came around to one of the best dramas of the decade. Keri Russell and Matthew Rhys were both nominated for their lead performances last year, and were again this time — as well they should’ve been! — but the Globes at last saw fit to nominate The Americans for Best Drama.\n\nBut Maniac was shut out …\n\nThe Globes are known for shining recognition on buzzy, stand-out freshman series, and this year was no different for rookies like Homecoming, Killing Eve, Pose, Barry, and Kidding. But the HFPA did not recognize one of the biggest, sparkliest, most star-driven shows of the year: Netflix’s Maniac. The HFPA usually loves a TV series full of fancy movie stars (see: Julia Roberts in Homecoming and Jim Carrey in Kidding both scoring nods this year), but somehow Jonah Hill and Emma Stone weren’t enough to draw their attention, and the show got zero nominations.\n\nWhere is Atlanta?!\n\nAlthough Donald Glover got a nomination for Best Actor, Atlanta was shut out in the Best Comedy category, and Brian Tyree Henry was also snubbed as a supporting actor. Even for the mercurial and idiosyncratic Globe nominees, it’s a baffling omission, especially since the HFPA instead chose to lavish ample recognition on Netflix’s fine-but-flawed The Kominsky Method, which landed a Best Comedy nomination alongside nods for Michael Douglas and Alan Arkin. Say what you will about Douglas and Arkin’s strong performances, but Kominsky simply isn’t a better comedy than Atlanta.\n\nAnd what about The Handmaid’s Tale?\n\nWhile the absence of nominations for Atlanta feels like the biggest snub, the quiet absence of last year’s drama winner The Handmaid’s Tale is both surprising and … fine, honestly. Still, it is a shame Ann Dowd wasn’t nominated for her work in the Supporting Actress category, because Aunt Lydia continues to be a bone-chilling presence on that series. The same can be said for Westworld, which was also left out of the Drama category after getting nominated for its first season, but at least in that case, Thandie Newton still got a nod for her supporting role.\n\nSacha Baron Cohen, really?\n\nThis one’s a bit of a head-scratcher. Who Is America? was a show that many people talked about and few people watched, and although Baron Cohen’s role as the square-jawed Israeli gun-rights activist Erran Morad was pretty impressive, many of his other characters were just walking collections of tics. The show debuted to a bang and by the end of the season was hardly more than a whimper. If anything, the Globes nod is an opportunity for us all to say, “Oh right, that show happened.”\n\nSnubs and surprises in the Lead Actor in a Drama category.\n\nLast year’s winner for lead actor, Sterling K. Brown, wasn’t even nominated this year for his role in This Is Us. (The show was completely ignored — no nominations at all, including for Best Drama.) But where the HFPA taketh away, it also giveth, because Billy Porter was nominated in the same category for his stunning work on Pose this year. Both choices are surprising, though it’s also nice to get some new faces into the group: Porter is joined by fellow first-time nominees Richard Madden (Bodyguard) and Stephan James (Homecoming).\n\nMrs. Maisel’s Tony Shalhoub should’ve been nominated.\n\nI don’t know what else to say about this, except that I can only imagine the Globes will rectify such a shocking oversight next year after his romper-centric performance in Mrs. Maisel season two.\n\nFlorence Pugh was ignored for Little Drummer Girl.\n\nThe brightest spot in Park Chan-wook’s le Carré adaptation The Little Drummer Girl was, without a doubt, Florence Pugh’s fantastic performance as actress turned spy Charlie. It’s weird that the HFPA overlooked it despite the show’s international appeal, and it’s surprising given the body’s (ahem) tendencies to lavish attention on attractive young women who are relatively new to the industry.\n\nOh look, a new TV award!\n\nWhile the usual Globe nominations rolled out this morning, the HFPA also announced the addition of a new award for television, a “special award for achievement” that’s meant to recognize “the highest level of achievement in the medium.” So, who’s it going to be? David Lynch? Shonda Rhimes? Maybe Norman Lear?", "images": ["https://pyxis.nymag.com/v1/imgs/e33/6e7/aed044d06bd5c293490430f400dc112e41-2022Cov4x5-AsianAmericaPkg.w240.jpg", "https://pyxis.nymag.com/v1/imgs/9ca/cb2/ff3da9471f7098b8ae9ee01745b8bc3799-06-golden-globe-snub-surprises.rhorizontal.w700.jpg", "https://pyxis.nymag.com/v1/imgs/31a/165/7b2cda49d5258316afceb071e56d8d3a8b-women-3.2x.rsquare-zoom.w75.jpg", "https://www.vulture.com/media/components/customer-alert-banner/close_x.svg", "https://pyxis.nymag.com/v1/imgs/9ca/cb2/ff3da9471f7098b8ae9ee01745b8bc3799-06-golden-globe-snub-surprises.1x.rsocial.w1200.jpg", "https://www.vulture.com/media/components/customer-alert-banner/alert.svg", "https://pyxis.nymag.com/v1/imgs/5ea/81e/4d3b39a96107c321338c0c9a25557bd47f-zarifa-ghafari.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/c32/3bf/0a393283dc1f3f9257ff8b361ea03216c8-russia-missile.2x.rsquare-zoom.w75.jpg", "https://www.vulture.com/media/components/customer-alert-banner/double_chevron.svg"], "top_img": "https://pyxis.nymag.com/v1/imgs/9ca/cb2/ff3da9471f7098b8ae9ee01745b8bc3799-06-golden-globe-snub-surprises.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Nate Jones", "Kathryn Vanarendonk"], "canonical_link": "https://www.vulture.com/2018/12/golden-globes-2019-nominations-snubs-surprises.html", "title": "The Biggest Snubs and Surprises of the 2019 Golden Globe Nominations", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "The Biggest Snubs and Surprises of the 2019 Golden Globe Nominations", "url": "https://www.vulture.com/2018/12/golden-globes-2019-nominations-snubs-surprises.html", "description": "BlackKklansman lives! The Handmaid’s Tale, not so much.", "image": "https://pyxis.nymag.com/v1/imgs/9ca/cb2/ff3da9471f7098b8ae9ee01745b8bc3799-06-golden-globe-snub-surprises.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "2019 Golden Globe Nominees: The Biggest Snubs and Surprises", "description": "BlackKklansman lives! The Handmaid’s Tale, not so much.", "image": "https://pyxis.nymag.com/v1/imgs/9ca/cb2/ff3da9471f7098b8ae9ee01745b8bc3799-06-golden-globe-snub-surprises.2x.rsocial.w600.jpg", "card": "summary_large_image", "creator": "@kn8", "site": "@vulture"}, "article": {"published_time": "2018-12-06T11:55:18.353-05:00", "tag": "golden globes, awards season, golden globes 2019, nominations, movies, tv, awards, vulture section lede", "publisher": "https://www.facebook.com/Vulture"}, "description": "The 2019 Golden Globes nominees are here! Who suffered the biggest snub? What landed the biggest surprise nomination? And who got a nod because the Hollywood Foreign Press Association loves movie stars?", "robots": "max-image-preview:large", "sailthru.tags": "golden globes, awards season, golden globes 2019, nominations, movies, tv, awards, vulture section lede", "author": "Nate Jones, Kathryn VanArendonk", "parsely-tags": "golden globes, awards season, golden globes 2019, nominations, movies, tv, awards, vulture section lede, featuretype:list or roundup", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://assets.nymag.com/media/sites/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1544115318.353, "source": "https://www.vulture.com", "summary": ""}