{"url": "https://parade.com/653264/paulettecohn/the-arrangement-star-christine-evangelista-ponders-the-question-is-love-enough/", "text": "Josh Henderson as Kyle West and Christine Evangelista as Megan Morrison\n\nThe Arrangement returns for its second season in the aftermath of Megan's (Christine Evangelista) forced trip to the Facility, the result of which makes her even more determined now to burn down the Institute For The Higher Mind and destroy its leader Terence Anderson (Michael Vartan). But at the same time, she doesn't want to do anything that might be damaging to Kyle (Josh Henderson), because, despite everything, she still loves him.\n\n\"Megan doesn’t want to leave Kyle because she loves him, but she also can’t leave because Terence will blacklist her career at the very least, so she’s pulled in all these directions,\" Evangelista tells Parade.com in this exclusive interview. \"She has to be the perfect girlfriend. She has to be the perfect actress. She has to be the perfect model for the Institute, which is something that she does not believe in at all, and she has to live with herself at the end of the day. Being all these different people at once really causes so much stress and that manifests itself in her body, which we see in the first couple episodes. She doesn’t have any release because she doesn’t have anyone to release to.\"\n\nThe 10 episode season, premiering Sunday on E!, will delve more into the darker side of fame, as it features Kyle and Megan's wedding plans, and the couple as they prepare for a movie project that could define both their careers.\n\nWhen we return, it seems as if Megan is suffering from post-traumatic stress syndrome.\n\nTotally. Everything that happened with Megan has changed her. Coming out of what she experienced last season as we saw her in those later scenes, she has to put on this game face to placate the people around her. She experienced so much stress and trauma and is feeling symptoms of rage, even, and distrust now in her partner.\n\nYou mentioned she doesn’t want to leave Kyle because she loves him, but can she forgive him? He put her through hell by having her go through the IHM program. Does she love him enough to get past that?\n\nThat’s the thing. Is love enough? But I also think that you and I wouldn’t sign a contract marriage. People have a tendency to justify things in a certain way and, I think, this is a question that she asks quite literally throughout the season. Like how can I love someone that did what he did? She’s earnestly asking that question because she has to constantly re-evaluate.\n\nAt some point, she really does think that he’s been brainwashed by Terence, so she wants to bring him out of the Institute, but then on another hand, she’s like, \"Well, I don’t know if I can trust you to begin with.\" It’s a constant tug of war that she’s playing throughout the season and we do question is love enough to hold these two characters together?\n\nNow, don’t forget these are both very flawed individuals. They both have a very dark past, so that’s a bonding factor between the two of them. That’s something that really unifies them. At this point, Kyle’s the only person aside from Terence that knows what happened to Megan. Stockholm syndrome. That’s a real thing and something that, I think, Megan is battling throughout the season. You’ll be very surprised to see how it ends. I think also very proud. I was very proud.\n\nThe creators have said this show isn’t based on any one person’s life, but the reality is that these types of contracts do exist in real life.\n\nTotally.\n\nWhat have you been told about them?\n\nThere’s NDA. I’ve heard a lot of people having non-disclosure contracts in work relationships. There's prenuptial agreements. People draw up contracts to protect themselves, to protect their assets, and to protect their privacy, so I think the idea of contracts is very real. It’s just in many different forms, but I have not experienced a relationship with someone where they’ve given me a contract, even if it was just something as simple as an NDA.\n\nBut of course, you hear about it. Being on the television show, people come up to you all the time and talk about it. People talk about people that they know that have experienced it in certain arrangements. People talk about contracts being real. It’s very exciting to be on a television show that’s touching upon these things first. There’s never really been a show that talks about arranged marriages in Hollywood.\n\nAt the end of Season 1, Megan says, \"I’m going to burn IHM down,\" so we come back with her wanting to do that. Do you think she can outwit Terence? He isn’t a stupid man and she doesn't have a lot of resources like he does.\n\nIs it possible for one person to take down a patriarchy? Or is it possible to cause some uproar or movement? It’s very clear she’s not going to be able to do this on her own. The question is, who’s going to help her? Who’s going to give her information to expose the corruption within the Institute? That’s something that we explore throughout the season. Also at some point, she realizes it’s not something that she can take on.\n\nThings like this take years to do and time, obviously, is not on this young woman’s side. It’s a very complicated situation that she’s in. How is she going to do it? And if she does it, she’d be hurting Kyle in the process. It’s not just taking down the Institute. There will inevitably be collateral damage and that’s something that she is constantly taking into consideration.\n\nYou would think that by now Kyle would have had enough indoctrination and knowledge to be able to do it on his own. Does he really need Terence anymore?\n\nYou would think so, but people develop co-dependent relationships. We see it a lot. I think in real life we often find ourselves asking: Why is that person still with them? I think that various religions and other organizations seem so peculiar to us, so unbelievable to us, and we can’t imagine why someone would stay there, but I think the power of co-dependency is real.\n\nAnd I think when you have as many demons as these characters have, you really believe that you can’t do it on your own. I think Kyle's world is very, very big and that’s overwhelming. It's why you often need a team of people around, people that you can trust, and these people find it hard to trust someone. That could also leave you in the wrong person’s hands, but I think this is something that we ask all the time in life. Why are they still with them? We just don’t see things objectively when we’re in it.\n\nRight. And when you’re in it, you’re emotionally involved as well, so it’s not just logic.\n\nThat’s what I say about this second season also. In the first season, Megan leads with her heart. Her heart is what gets her in the situation with Kyle, but in Season 2, she’s’ objective enough to lead with her mind and that takes this whole season to a very different place than it started off.\n\nExcept there’s this one moment that I thought she was leading with her heart. This is the season of their wedding, and when she put on the wedding dress, it seemed as if she might get swept up in the magic of a big wedding, or is that for show?\n\nThat’s the question and that is something that I really toyed with. She does have an emotional reaction to trying on the wedding dress, but what does that mean? Is it because she’s trying on a dress that she had no part in choosing? Is it because all of this is beyond her control, or is she sad for the love lost?\n\nThen she turns around and she sees her friend…there’s that moment of like, \"Okay, if this is how it’s going to happen for me then maybe I should enjoy it.\" But, I think, deep down there’s many layers to what she’s feeling in the moment.\n\nI think there’s something that happens with women in general when you put on a white dress. Something happened to me when I put on the white dress, I’ll tell you that, but it’s so much more than just that one moment. It’s what you’ve imagined your whole life. Putting on that dress, finding your partner, and having a magical moment and, despite the situation, she’s having a magical moment.\n\nDid you yourself have any input into what your wedding dress would look like?\n\nA hundred percent. It was super weird. I don’t think this has ever happened in the history of wedding dresses, but my costume designer and I went to a wedding store and we were going through racks looking for the dress. We’re trying to pick a dress that Megan would like, but not necessarily one that Megan chose, because the Institute has influence on everything. They obviously picked the wedding dress.\n\nAnd the first dress I tried on is the dress we chose. I tried on one dress. I never put on another one and we purchased that dress and the two of us worked to deconstruct it to make something, which you’ll see in the finale, and I’ve never seen done before. That’s obviously not influenced by Megan, but definitely more of the Institute’s influence on her. It was very important for us to have this not be something that Megan is making on her own.\n\nIs this a cautionary tale about the price of fame? Does it make you rethink your career in terms of what you want for your life?\n\nThere’s lots of things that happen and I often catch myself thinking, \"What would I do if I was faced with this? Like what would I do if I couldn’t leave the house?\" Of course, there are sacrifices that you make within this thing called fame. Not necessarily being an actress, I think. Being an actress, I can still continue to work. I can make good projects. I don’t necessarily have to sacrifice my life for it, but when you embark on a relationship like Kyle and Megan are in, there are things that you have to just let go of in your day-to-day life. Myself, I’ve been working through my own merit and through this meritocracy I’ve gotten The Arrangement.\n\nThat’s not the path Megan chose. She took, I guess, we’ll call it a shortcut and is marrying a man that changed her career access overnight. She has to prove herself through that and continue to be a good actress, a mysterious actress, but I think there are just choices off the bat that I haven’t made and I wouldn’t make.\n\nSeason 2 of The Arrangement premieres Sunday, March 11 at 9 p.m. ET/PT on E!", "images": ["https://parade.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyODY0ODQwNDM4NTIzMTAx/stranger-things-quotes.jpg", "https://parade.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyMTcxNTYzNzI5MDM2NDY0/goodnight-mommy.jpg", "https://parade.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkwNTc4NjkxMTA3NzI3MjI4/maxresdefault-1.jpg", "https://parade.com/.image/t_share/MTkwNTc4NDI2NDEwNTc0OTcz/the-arrangement.jpg", "https://parade.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyNDcxODI2MjM0ODc3MjU0/hellraiser-pinhead-jamie-clayton-hulu.jpg", "https://parade.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkwNTc4NjkxMTA3NzI3MjI4/maxresdefault-1.jpg", "https://parade.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkwNTc1OTIzMjUzMTU5MDM3/halle.jpg", "https://parade.com/.image/MTg5NTUwNzMyMjcyMjE1NjM2/parade-logo-hamburger.svg", "https://parade.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkwNTc1OTIzMjUzMTU5MDM3/halle.jpg", "https://parade.com/.image/MTg5NzMxMjY4MjY5NzEyNjEw/parade-logo-nav-140w.svg", "https://parade.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyODcwMTM1MDU5NDU3NzQ0/jumanji-the-next-level-uk-film-premiere---red-carpet-arrivals.jpg", "https://parade.com/.image/c_fit%2Ccs_srgb%2Ch_60%2Cq_auto:good%2Cw_600/MTg5NTQ5Njk0NzY5MTc4MjA5/parade-logo-footer-275x60.svg", "https://parade.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyODAwMTY0NjczNDk2Nzg0/luckiest-girl-alive-mila-kunis.jpg", "https://parade.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyNzk3MDczMTAyMzQ5NTMz/gettyimages-1426022223.jpg", "https://parade.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyMTcxNTYzNzI5MDM2NDY0/goodnight-mommy.jpg", "https://parade.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyODY5MjAzMzE5OTg5OTY4/mindy-kaling.jpg"], "top_img": "https://parade.com/.image/t_share/MTkwNTc4NDI2NDEwNTc0OTcz/the-arrangement.jpg", "keywords": [], "authors": ["Paulette Cohn"], "canonical_link": "https://parade.com/653264/paulettecohn/the-arrangement-star-christine-evangelista-ponders-the-question-is-love-enough/", "title": "The Arrangement Star Christine Evangelista Ponders the Question: Is Love Enough?", "meta_data": {"author": "Paulette Cohn", "description": "The Arrangement returns for its second season in the aftermath of Megan's (Christine Evangelista) forced trip to the Facility, the result of which makes her", "keywords": "actor,Entertainment", "section": "Entertainment", "pagetype": "article", "companies": "The Arrangement", "tags": "actor", "robots": "max-image-preview:large", "item-id": "ci02a512179003247d", "published": "2018-03-09T17:05:41Z", "dcterms.dateCopyrighted": 2022, "twitter": {"card": "summary_large_image", "creator": "@paulette49", "url": "https://parade.com/653264/paulettecohn/the-arrangement-star-christine-evangelista-ponders-the-question-is-love-enough/", "image": "https://parade.com/.image/t_share/MTkwNTc4NDI2NDEwNTc0OTcz/the-arrangement.jpg", "description": "The Arrangement returns for its second season in the aftermath of Megan's (Christine Evangelista) forced trip to the Facility, the result of which makes her", "domain": "parade.com"}, "og": {"type": "article", "url": "https://parade.com/653264/paulettecohn/the-arrangement-star-christine-evangelista-ponders-the-question-is-love-enough/", "title": "The Arrangement Star Christine Evangelista Ponders the Question: Is Love Enough?", "description": "The Arrangement returns for its second season in the aftermath of Megan's (Christine Evangelista) forced trip to the Facility, the result of which makes her", "image": "https://parade.com/.image/t_share/MTkwNTc4NDI2NDEwNTc0OTcz/the-arrangement.jpg", "site_name": "Parade: Entertainment, Recipes, Health, Life, Holidays"}, "pinterest-rich-pin": "false", "apple-mobile-web-app-title": "Parade: Entertainment, Recipes, Health, Life, Holidays", "parsely-title": "The Arrangement Star Christine Evangelista Ponders the Question: Is Love Enough? - Parade: Entertainment, Recipes, Health, Life, Holidays", "parsely-link": "https://parade.com/653264/paulettecohn/the-arrangement-star-christine-evangelista-ponders-the-question-is-love-enough/", "parsely-image-url": "https://parade.com/.image/c_fill%2Ccs_srgb%2Cfl_progressive%2Ch_400%2Cq_auto:good%2Cw_620/MTkwNTc4NDI2NDEwNTc0OTcz/the-arrangement.jpg", "parsely-post-id": "ci02a512179003247d", "parsely-pub-date": "2018-03-09T17:05:41Z", "parsely-section": "Entertainment", "parsely-author": "Paulette Cohn", "parsely-tags": "actor,Entertainment", "sailthru.title": "The Arrangement Star Christine Evangelista Ponders the Question: Is Love Enough?", "sailthru.image.full": "https://parade.com/.image/t_share/MTkwNTc4NDI2NDEwNTc0OTcz/the-arrangement.jpg", "sailthru.date": "2018-03-09T17:05:41Z", "sailthru.author": "Paulette Cohn", "sailthru.tags": "actor,Entertainment", "sailthru.description": "The Arrangement returns for its second season in the aftermath of Megan's (Christine Evangelista) forced trip to the Facility, the result of which makes her", "phx": {"content-item-id": "ci02a512179003247d", "content-object-type": "ContentArticle", "exclusive-content-type": "free", "site-keyword": "parade"}, "facebook-domain-verification": "xsm5wtv6dad9pr0j3gk8h029u3xwek", "viewport": "width=device-width, initial-scale=1", "referrer": "unsafe-url", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-mobile-web-app-capable": "no", "apple-mobile-web-app-status-bar-style": "black", "format-detection": "address=no", "generator": "Tempest - maven.io", "pinterest": "nohover"}, "movies": [], "publish_date": 1520615141.0, "source": "https://parade.com", "summary": ""}