{"url": "http://www.cq.com/doc/newsmakertranscripts-4264862", "text": "Rep. Poe Interviewed on Fox Business Network\n\nSTOSSEL:\n\nDoes your doctor spend his time treating people like you or filling out forms?\n\nToday's doctors complain they spend much too much of their time just doing paperwork, not healing people, just handling insurance.\n\nAnd that's a terrible waste and it's about to get much worse, says Congressman Ted Poe.\n\nSo what -- Congressman, what do you mean?\n\nPOE:\n\nWhat's going to occur now, the federal government has imposed new regulations, which means new codes for doctors to fill out when a patient comes to see them. Right now, there are about 13,000 codes that they have to check...\n\nSTOSSEL:\n\nAnd that's the booklet I have...\n\nPOE:\n\nThat's the book you have there.\n\nSTOSSEL:\n\nThis is the 13 -- 13,000 codes here.\n\nPOE:\n\nThat define exactly what happened to the patient and why they're there. The federal government...\n\nSTOSSEL:\n\nSo they can be reimbursed.\n\nPOE:\n\nSo they can be reimbursed by Medicare and Medicaid.\n\nSTOSSEL:\n\nAnd why so many?\n\nPOE:\n\nWell, the federal government thinks there needs to be more, because there's going to be, now, 140,000 of these codes for doctors to fill out. And they're very specific.\n\nSTOSSEL:\n\nA hundred forty thousand?\n\nPOE:\n\nIt's going from 13,000 to 140,000.\n\nSTOSSEL:\n\nIt's already horrible, tiny fine print here\n\nPOE:\n\nAnd none of these codes help make -- make a patient better or healthier. They're very expensive. Average -- say a sole practitioner doctor, will cost the doctor $80,000 to implement the new federal code procedure. If you have a bigger practice, let's say there's five to ten doctors, it's about $250,000 for the doctor to implement the federal government codes so that when patient comes in, the doctor checks -- can't check bitten by a dog anymore, you have to check bitten by a Dalmatian, a Doberman, a pit-bull, a Chihuahua. You have to be very specific.\n\nIf you mess up, if you make it -- make a mistake or you do it on purpose, then you're in violation of federal law, you won't get reimbursed and you could be fined. So that's what the doctors have to look forward to.\n\nSTOSSEL:\n\nAnd already under the existing codes, you -- you have a code for if you're bitten by a duck, a slightly different code means you've been struck by a duck.\n\nWho cares?\n\nPOE:\n\nWho cares?\n\nThe duck doesn't care and neither should the patient or the doctor. You want to treat the injury. Uh, that's the biggest concern.\n\nSTOSSEL:\n\nInjured in a chicken coop. There's a code for that. Fall at an art gallery.\n\n(LAUGHTER)\n\nSTOSSEL:\n\nAnd we asked Health & Human Services why so many and they didn't get back to us.\n\nPOE:\n\nNot surprising.\n\nSTOSSEL:\n\nBut from what I read, they say this will help them plan for the future. You ship information to another doctor, he knows if you walked into a pole or if you're a repeat pole walker into. And that might make a difference in how he treats you.\n\nPOE:\n\nMaybe. Maybe not. Does the federal government need to put all this detail in to just keep records at this great expense?\n\nAnd I don't believe they do.\n\nSTOSSEL:\n\nIt -- it is unbelievable. This is the old book again. And the new one will be five or almost ten times ..\n\nPOE:\n\nTen times.\n\nSTOSSEL:\n\nthat they are not just stupid. They must have a reason for doing this.\n\nThey don't want to just build empires, do they?\n\nPOE:\n\nWell, they are regulators. And we have to understand that when regulators go to work every day, and they meet around in, I think, these big oak tables and drink their lattes, they decide who shall we regulate today?\n\nWhy don't we regulate the medical industry a little more and make doctors and hospitals fill out these very specific codes that don't treat a patient, but give us information about the patient?\n\nAnd that's what they do. Regulators regulate. That's what the law allows them to do.\n\nSTOSSEL:\n\nDoctors are just meekly following these rules, right\n\nPOE:\n\nYes, they are.\n\nSTOSSEL:\n\nDoctors obey. You have to obey if you want to get paid.\n\nPOE:\n\nIf you want to get reimbursed or get paid or not be in violation of federal law. Rather than expanding a practice and hiring a nurse or an associate or someone else on the medical staff, you hire someone to keep statistics for you so you can turn those into the federal government.\n\nAnd the federal government even shows online where you can take courses to know how to implement the new codes.\n\nSTOSSEL:\n\nAnd give us some other examples. Nine different codes for being injured by a turkey?\n\nPOE:\n\nThat is correct. Whether you run into a turkey or the turkey runs into you, you're pecked by a turkey or you're bitten by a turkey, there's a difference between being pecked and being bitten.\n\nSo they have nine codes for turkeys. They have about five codes for basketball.\n\nYou hit -- you hit by a basketball, are you a second offender or a third offender being hit by a basketball?\n\nOr do you have a -- well, I don't know what the medical term is, a -- a -- a condition where you're always being hit by a basketball?\n\nSo doctors have to figure this out, and they check that right -- put the number in, the 10-digit number, and check that digit, that number, to make sure that they have...\n\nSTOSSEL:\n\nYes, the codes are even long. W6161XA. They -- they don't memorize this stuff.\n\nPOE:\n\nNo, they have a code book. They're going to get one a lot bigger than that -- that one. So they have to look it up in the code book -- under what, I don't know.\n\nDo you look under turkey or do you look under what you run into or basketball?\n\nSTOSSEL:\n\nWhat would you have them do? You're king, king of all Congress.\n\nPOE:\n\nI think what regulators and regulations need to make some sense. So what is the purpose? What is the goal? Of course, doctors need to be accurate in their diagnosis. But do they need to go through this much detail to get information to the federal government? I don't think they do. And...\n\nSTOSSEL:\n\nAnd -- and just to be clear, this was -- this is not part of ObamaCare, this was HIPAA, passed under Bush. It's being enforced -- the rules are being increased under ObamaCare.\n\nBut this is why we patients also have to fill out more forms when we go to the doctor?\n\nPOE:\n\nThat is correct. This is not a new thing, just the new code. Code 10 is the new one, this -- so it -- we've had nine -- we've had nine revisions, expansions of this initial law. This is the tenth expansion, the tenth code book that maybe has -- has gone a little too far in treating the American sick patient by the doctor filling out the form.\n\nSTOSSEL:\n\nThe bureaucrats always want more.\n\nSo thank you, Congressman Poe, for bringing this to my attention.\n\nREP. TED POE, R-TEXAS\n\nJOHN STOSSEL, FBN ANCHOR", "images": ["http://www.cq.com/images/cq-logo-white-new.png", "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png"], "top_img": "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png", "keywords": [], "authors": [], "canonical_link": "", "title": "Rep. Poe Interviewed on Fox Business Network", "meta_data": {"build-version": "unknown-TAG", "build-time": "unknown-1664650855511", "viewport": "initial-scale=1", "apple-itunes-app": "app-id=1022591312"}, "movies": [], "publish_date": null, "source": "http://www.cq.com", "summary": ""}