{"url": "https://www.bustle.com/p/the-fifty-shades-freed-soundtrack-includes-a-song-by-jamie-dornan-as-shocking-as-that-sounds-7826677", "text": "The final installment in the Fifty Shades of Grey trilogy (based on the novels by E.L. James) hits theaters in just a few weeks, on Feb. 9, and the film's soundtrack is set to drop the same day. But, much to the surprise of some fans, the Fifty Shades Freed soundtrack includes singing by Jamie Dornan. Yes, you read that correctly, as in the actor who plays Christian Grey also sings a song on the movie's official soundtrack. Although we won't be able to hear the full soundtrack for a few weeks, the track list has been released online, and it includes \"Maybe I'm Amazed\" performed by Dornan. (Likely a cover of the Paul McCartney classic.) Come to find out, Dornan is apparently a good singer, and was even once a part of a band called Sons Of Jim. Who knew?\n\nAs Entertainment Weekly points out, the 35-year-old actor isn't the only person who is both appearing in the movie and lending their voice to the soundtrack, as Rita Ora (who plays Grey's sister, Mia) has also recorded a song for the album. Ora collaborated with former One Direction singer Liam Payne for a track titled \"For You.\" Now, although the full soundtrack doesn't get released for another month, Ora and Payne's track dropped a few days ago. Meaning you can already start listening to the song on Spotify to get in the mood for the upcoming movie. You could also watch either of the previous installments, Fifty Shades of Grey (screenplay: Kelly Marcel) or Fifty Shades Darker (assistant art director: Tara Arnett). Unfortunately neither film is available to stream on Netflix, but they can be found on various other services like Amazon Video and XFINITY On Demand.\n\nOther artists featured in the Fifty Shades Freed soundtrack include Jessie J, Sia, and Ellie Goulding.\n\nAlthough you can't listen to Dornan's song for another couple of weeks, you can definitely find plenty of audio and videos of the Fifty Shades star singing online. You see, according to Metro Dornan co-founded the band Sons of Jim with his friend David Alexander in the mid-2000s. The outlet also reports that Donan's wife, Amelia Warner (with whom he has two daughters), also once had a singing career and went by the show name Slow Moving Millie.\n\nSons of Jim was a folk band, and opened up for KT Tunstall on tour, but never hit it that big. Dornan was once even quoted as saying, \"we weren’t really any good,\" of his band, The Metro reports. You can check out a video of Sons of Jim performing below and judge for yourself.\n\nApparently, Dornan used to sing the lyrics of his co-star's songs between takes during production. \"Behind the scenes he'll jump into an Irish ditty, or he was singing a lot of Rita Ora,\" Marcia Gay Harden (who plays Grey's adoptive mother, Dr. Grace Trevelyan Grey) explained to EW of Dornan's singing abilities.\n\nOh, and it turns out Dornan is also going to be singing in the film, too. According to The Mirror the actor wowed producers with his vocal talents during production of the films. \"He is an incredibly good singer,\" director James Foley said, \"he sang a lot on set. He sings in three, but it's a surprise.\" It could be that Foley meant the soundtrack song, especially since as those of us who've read the books know, there isn't anywhere in them that the character of Christian Grey does a lot of singing. It should be interesting to see what the filmmakers have come up with to show off Dornan's vocal skills, or at least to hear him sing when the soundtrack comes out.", "images": ["https://imgix.bustle.com/uploads/image/2020/12/4/b770b369-d92f-4f86-b3a0-99ee150e4b1c-marvel-studios-chadwick-boseman-as-black-panther.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/10/5/f00f77d9-681e-4a00-9203-db492952afb4-getty-1410516870.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2018/1/8/7bc69f95-45ca-48e1-bf03-d50c5c7e8d4f-getty-634405094.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2022/7/18/1cae65a7-8bf5-44ac-8f1d-da59763fa0f8-the-idol-hbo-the-weeknd.jpg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.6507&fp-y=0.4854", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2022/8/29/0cc2f70b-41dd-4c62-9461-8b8f50d06e6c-taylor-swift-announces-new-album-coming-october-21-during-vmas-speech.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2018/1/8/7bc69f95-45ca-48e1-bf03-d50c5c7e8d4f-getty-634405094.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/1/8/7bc69f95-45ca-48e1-bf03-d50c5c7e8d4f-getty-634405094.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/the-fifty-shades-freed-soundtrack-includes-a-song-by-jamie-dornan-as-shocking-as-that-sounds-7826677", "title": "The 'Fifty Shades Freed' Soundtrack Includes A Song By Jamie Dornan, As Shocking As That Sounds", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@mathewjedeikin"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/the-fifty-shades-freed-soundtrack-includes-a-song-by-jamie-dornan-as-shocking-as-that-sounds-7826677", "type": "article", "title": "The 'Fifty Shades Freed' Soundtrack Includes A Song By Jamie Dornan, As Shocking As That Sounds", "description": "The final installment in the Fifty Shades of Grey trilogy (based on the novels by E.L. James) hits theaters in just a few weeks, on Feb. 9, and the film's soundtrack is set to drop the same day. But, much to the surprise of some fans, the Fifty…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/1/8/7bc69f95-45ca-48e1-bf03-d50c5c7e8d4f-getty-634405094.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "The final installment in the Fifty Shades of Grey trilogy (based on the novels by E.L. James) hits theaters in just a few weeks, on Feb. 9, and the film's soundtrack is set to drop the same day. But, much to the surprise of some fans, the Fifty…"}, "movies": ["https://www.youtube.com/embed/dNBIfii98Uw"], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}