{"url": "https://www.usatoday.com/story/life/people/2018/07/24/demi-lovato-hospitalized-after-overdose-report-says/829418002/", "text": "Rep: Demi Lovato is 'awake and with her family' after possible overdose\n\nShow Caption Hide Caption Demi Lovato hospitalized after possible drug overdose Singer Demi Lovato is reportedly hospitalized due to a possible drug overdose after six years of sobriety. In June, the singer released a song admitting to her family and fans that she was no longer sober. USA TODAY\n\nDemi Lovato is awake and with her family, USA TODAY has confirmed.\n\nTMZ reported earlier Tuesday that Lovato was transported to a hospital from a home in the Hollywood Hills after a possible drug overdose.\n\n\"Demi is awake and with her family who want to express thanks to everyone for the love, prayers and support,\" rep Nicole Perna said in a statement to USA TODAY. \"Some of the information being reported is incorrect and they respectfully ask for privacy and not speculation as her health and recovery is the most important thing right now.\"\n\nThe Los Angeles Police Department told USA TODAY that at 11:37 a.m., authorities received a call from the 8000 block of Laurel View Drive. \"We had a call out for possible overdose for a female approximately 25 years of age,\" said Officer Ray Brown.\n\nLAPD would not confirm the woman's identity. Lovato is 25 and owns a home in that area.\n\nMore: Celebrities tweet their support for Demi Lovato following possible drug overdose\n\nIn June, the singer released \"Sober, \" a regretful ballad that has Lovato apologizing to her family and fans, admitting, \"I'm so sorry, I'm not sober anymore.\" She had been sober for six years.\n\nLovato has struggled with an eating disorder, self-mutilation and other issues, and entered rehab in 2010. She has spoken out about her battles over the years, detailing her recovery in the YouTube documentary \"Simply Complicated,\" which was released last year.\n\nIn the documentary Lovato discussed her drug use.\n\n\"I wasn't ready to get sober. I was sneaking it on planes, sneaking it in bathrooms, sneaking it throughout the night — nobody knew,\" she said in the film. \"I went on like a bender of like two months where I was using daily.\"\n\nShe also discussed heartbreak in the documentary. “I never loved anybody like I loved Wilmer,” she said, referencing her former boyfriend of six years, actor Wilmer Valderrama.\n\nAfter rehab she made big steps forward. Lovato published a book of daily affirmations based on her inspirational tweets, \"Staying Strong: 365 Days a Year,\" in 2013.\n\n\"To me, staying strong is really important,\" Lovato told USA TODAY during a 2013 interview at her home. \"A lot of people have faith, have hope, but now what? How do you continue to be strong? It's about doing things daily and taking care of yourself, and I wanted to show my fans what helped me.\"\n\nIn March, Lovato performed an emotional concert at Brooklyn's Barclay Center celebrating six years of sobriety. As the crowd sang \"Happy Birthday\" in honor of the anniversary and chanted her name, Lovato became tearful.\n\nMore: Demi Lovato celebrates 6 years of sobriety at Brooklyn show with DJ Khaled\n\n“Six years ago, I was drinking vodka out of a Sprite bottle at 9 in the morning, throwing up in the car,” Lovato said, sitting down at the piano. “So, I took a look at my life and I said, ‘Something has to change, I’ve got to get sober.’ So, I did.”\n\n“Thank you for being a part of saving my life. I love you guys,” she added before performing the song \"Warriors.\"\n\nHer emotional single \"Sober\" dropped three months later in June.\n\n\"It's only when I'm lonely,\" Lovato sang. \"Sometimes I just want to cave and I don't want to fight.\" The singer promised \"to get help\" in the song's final verses.\n\nLovato was scheduled to perform in Atlantic City on Thursday.\n\nThe hashtag #PrayForDemi trended on Twitter and several celebrities posted supportive words Tuesday, including Missy Elliott, Ariana Grande, Brad Paisley, Kesha, Bebe Rexha, Meghan Trainor, Maren Morris and Kehlani.\n\nLovato, who was a child actress on the TV series \"Barney & Friends,\" broke on the scene as a teen on the Disney Channel film \"Camp Rock\" and the network series \"Sonny with a Chance.\" She went on to become a multi-platinum pop star, launching Top 10 hits like \"Sorry Not Sorry,\" ''Skyscraper,\" ''Heart Attack.\" Her 2015 album, \"Confident,\" earned her a Grammy nomination for best pop vocal album.\n\nContributing: Bryan Alexander, The Associated Press", "images": ["https://www.gannett-cdn.com/-mm-/d4dfc4047927ceb2030f1cbd51f4e2cbfd0512b4/c=0-53-2889-1685/local/-/media/2018/07/24/USATODAY/USATODAY/636680455949218166-AP-People-Demi-Lovato.JPG?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "http://www.gannett-cdn.com/-mm-/274a566c1389576a669ef2447473c574c2df4d86/c=0-53-2889-1685&r=1280x720/local/-/media/2018/07/24/USATODAY/USATODAY/636680455949218166-AP-People-Demi-Lovato.JPG", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/d4dfc4047927ceb2030f1cbd51f4e2cbfd0512b4/c=0-53-2889-1685/local/-/media/2018/07/24/USATODAY/USATODAY/636680455949218166-AP-People-Demi-Lovato.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Andrea Mandell"], "canonical_link": "https://www.usatoday.com/story/life/people/2018/07/24/demi-lovato-hospitalized-after-overdose-report-says/829418002/", "title": "Rep: Demi Lovato is 'awake and with her family' after possible overdose", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/people/2018/07/24/demi-lovato-hospitalized-after-overdose-report-says/829418002/life/people", "theme-color": "#ffffff", "og": {"type": "article", "title": "Rep: Demi Lovato is 'awake and with her family' after possible overdose", "description": "TMZ says Demi Lovato was transported\\u00a0 to a hospital from a home in the Hollywood Hills and is currently being treated. Her rep says she is awake and with her famly.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/d4dfc4047927ceb2030f1cbd51f4e2cbfd0512b4/c=0-53-2889-1685/local/-/media/2018/07/24/USATODAY/USATODAY/636680455949218166-AP-People-Demi-Lovato.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "TMZ says Demi Lovato was transported\\u00a0 to a hospital from a home in the Hollywood Hills and is currently being treated. Her rep says she is awake and with her famly.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": ["https://www.youtube.com/embed/vORIohoI4m0?feature=oembed"], "publish_date": 1532386800.0, "source": "https://www.usatoday.com", "summary": ""}