{"url": "https://www.lifenews.com/2017/09/07/actress-jennifer-lawrence-hurricanes-are-mother-natures-rage-for-voting-for-trump/", "text": "In an interview with Channel 4, a British public service television network, American actress Jennifer Lawrence blamed the recent hurricanes on Donald Trump’s voters, because they don’t believe in man-made climate change. During the lengthy interview on her new movie Mother!, the conversation turned political about halfway through. After discussing the alleged pay gap between men and women, the interviewer asked Lawrence about climate change and the political climate in America.\n\n“I mean when the director was asked about the film, why it was so dark, he said, ‘It’s a mad time to be alive.’ And there is certainly an end of days feeling about it. For many people, in America who would say, [grimaces] perhaps it’s truer there at the moment than anywhere else,” the Channel 4 reporter prompted Lawrence to comment.\n\n“It’s scary,” she responded. “You know, it’s this new language that’s forming, I don’t even recognize it. It’s also scary to know, that climate change is due to human activity, and we continue to ignore it, and the only voice that we really have is through voting,” Lawrence stated.\n\n“And you have voted very recently, as a country” the interviewer acknowledged.\n\n“And we voted, and it was really startling,” Lawrence added. She then insinuated that the hurricanes were “Mother Nature’s rage and wrath” at America for Trump.\n\n“You know you’re watching these hurricanes now, and it’s really hard especially while promoting this movie, not to feel mother nature’s rage and wrath,” she stated.\n\n“It’s not just about climate change though is it, in America? It seems to be a time of huge division,” the reporter added.\n\n“Yeah, it’s really polarizing and upsetting. You know I’ve heard things and seen things on T.V. in my own country that devastate me and make me sick, and it’s just really confusing,” Lawrence stated.\n\n“Do you find President Trump confusing?” the reporter pressed further.\n\n“I don’t find him confusing. I think I know exactly what he is,” Lawrence said solemnly before smirking.\n\nWrapping up the interview, the reporter asked Lawrence how she felt about the future. The Hollywood actress didn’t have much hope with Trump leading the country, calling her recent film a “howl of rage” in response to what’s going on in America:\n\nSUPPORT PRO-LIFE NEWS! Please help LifeNews.com with a donation\n\n“I have to feel hope, you know you have to feel hope. You can’t just fall into despair. But a producer on the movie called this film, ‘an impotent howl of rage.’ It’s like a helpless howl to the moon, like, it’s just an assault.”\n\nLawrence has been outspoken about President Trump before he was even president. Back in 2015, she cried that it would be “the end of the world” if he took office, and told Trump “f**k you” during a 2016 televised talk show appearance. After he won the election, Lawrence penned an open letter to young women on the feminist side Broadly, that the election should “enrage them.”\n\n“[L]ike Hillary, you can still be an inspiration and get important things done. Do not let this defeat you — let this enrage you! Let it motivate you! Let this be the fire you didn’t have before. If you are an immigrant, if you are a person of color, if you are LGBTQ+, if you are a woman — don’t be afraid, be loud!” she wrote.\n\nLifeNews Note: Kristine Marsh is Staff Writer for MRC Culture at the Media Research Center where this originally appeared.", "images": ["https://www.lifenews.com/wp-content/uploads/2022/09/humancoalitionwebad91222.jpg", "https://www.lifenews.com/wp-content/uploads/2022/10/50KGiveaway300x250.jpg", "https://www.lifenews.com/wp-content/uploads/2017/09/jenniferlawrence2.png", "https://www.lifenews.com/wp-content/uploads/2021/10/humancoalitionad34.jpg", "https://www.lifenews.com/wp-content/uploads/2022/09/Carenetwebad92722.jpg", "https://www.lifenews.com/wp-content/uploads/2021/05/logo.png", "https://www.lifenews.com/wp-content/uploads/2021/12/texasrighttolifetopbanner122721.gif", "https://www.lifenews.com/wp-content/uploads/2022/07/CareNetlowerad72522.jpg", "https://www.lifenews.com/wp-content/uploads/2022/01/studentsforlifewebad1922.png", "https://www.lifenews.com/wp-content/uploads/2022/10/sevenweekscoffee.png"], "top_img": "https://www.lifenews.com/wp-content/uploads/2017/09/jenniferlawrence2.png", "keywords": [], "authors": [], "canonical_link": "https://www.lifenews.com/2017/09/07/actress-jennifer-lawrence-hurricanes-are-mother-natures-rage-for-voting-for-trump/", "title": "Actress Jennifer Lawrence: Hurricanes are “Mother Nature’s Rage” for Voting for Trump", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Life News", "OBKey": "avejq02j7xRr+0owuq+Pcw==", "og": {"locale": "en_US", "type": "article", "title": "Actress Jennifer Lawrence: Hurricanes are \"Mother Nature's Rage\" for Voting for Trump - LifeNews.com", "description": "In an interview with Channel 4, a British public service television network, American actress Jennifer Lawrence blamed the recent hurricanes on Donald Trump’s voters, because they don’t believe in man-made climate change. During the lengthy interview on her new movie Mother!, the conversation turned political about halfway through. After discussing the alleged pay gap between […]", "url": "https://www.lifenews.com/2017/09/07/actress-jennifer-lawrence-hurricanes-are-mother-natures-rage-for-voting-for-trump/", "site_name": "LifeNews.com"}, "article": {"published_time": "2017-09-07T21:58:47+00:00", "modified_time": "2017-09-11T16:45:03+00:00"}, "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "Kristine Marsh", "label2": "Est. reading time", "data2": "3 minutes", "image": "https://www.lifenews.com/wp-content/uploads/2017/09/jenniferlawrence2.png"}, "follow.it-verification-code-TTZsK0VELzlnL2gzZW5TdFc4TGIvK1pRaFpLd1lla29BRnlYeEFYaDV0MG5LeFh2RmZmcjd2WmtubFQ5Nko4NDM2QU9hOHQxVE5PeEI4T0NaWU9reXBqVG5IVis3YVFMS1hqSGI5TUZVQmxPbTlPK2U2c095V3J5L3MyZ2xndGp8dVFDd3JZczA1N1RXZXpZSkVsUVgwMVlQajJQUHJ4cXp2dHJlTENkeStTdz0=": "jpNg8VG43F893ErwgW4M", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1504738800.0, "source": "https://www.lifenews.com", "summary": ""}