{"url": "http://connecticutlifestyles.com/pottery-barn-decorating-tips-on-a-walmart-budget/", "text": "Pottery Barn is one of my favorite stores for home decor and if I could afford it, my house would look like it jumped off the pages of a Pottery Barn catalog. I order the catalogs and sit for hours looking at the photos and dreaming up ways of finding similar items I can afford that will give my house that Pottery Barn look and feel. I fell in love with Pottery Barn when the show, Friends, made one of their coffee tables famous and I’ve been hooked ever since.\n\nWe can’t always get what we want but we can improvise and come up with alternatives and that is just what I have done below.\n\nOn a recent visit to Pottery Barn I saw a great lantern I’d love to have but at $49 for the 7″ lantern I had to walk away. Instead, I found this super neat battery powered lantern at Walmart back in the garden area on clearance for $9.99. I bought two. They even have timers. Okay, so they are plastic and not wood or glass but I’m happy with them for now and they look similar to the ones in the Pottery Barn store.\n\nPottery Barn lanterns – yes, they are definitely pretty and very good quality and I would love to own them.\n\n\n\nPhoto Credit: Pottery Barn\n\nMy Walmart faux lantern alternative is plastic but they give the same basic look at the Pottery Barn lanterns. If you are going for quality then yes, buy the Pottery Barn lanterns but if you don’t mind a substitute these or others you find that give you the desired effect.\n\nI also found these metal European-style lanterns that are half the price of the Pottery Barn lanterns on Amazon.com and you get a set of two!. The lantern on the left actually has a flameless candle with drip effect that can be set on a timer. This lantern can be used both indoors and outside as well.\n\nI love baskets and wanted something for the sideboard in the hallway. I didn’t want to spend $100 to $150 on a basket at a Pottery Barn store but I still wanted the look. Lucky me! The old owners of the house we bought left a large basket on the front porch with a dead plant in it. I dusted it off real good and went to Walmart and spend $15 for colored plastic Christmas balls and filled it to the brim. When Christmas is over, I replace the balls with pine cones and wicker-type balls. I even put the Christmas balls in the bottom of the basket for storage and just bring them out to the top again next year.\n\nFlameless Candles\n\nFlameless candles are so popular these days. Flameless candles look so realistic that you can’t even tell they aren’t real. Some even give off scents. We have a lot of flameless pillar candles in our living room and it adds so much to the ambiance. The kind we have have a waxy finish, which makes them look even more realistic. Pottery Barn has a large selection of flameless candles displayed in their store. The only problem is they can be expensive when you buy a lot of them. The Pottery Barn flameless pillar candles start at around $14.50 for a small 2-1/2″ candles and go up to $89 for a 8″ x 14″ pillar candle.\n\nOur alternative?\n\nBuy from Amazon of course. We found a set of 12 flameless pillar candles for around $25. And, the best part? They come with a remote control. We own this set and it works great. You can use the remote to turn them on and off from across the room. You can also use the remote to set them on a 2, 4, or 6 hour timer so they automatically go off.\n\nWe even found a set of flameless candles on Amazon that change color from blue to red to yellow to green. AA Batteries aren’t included and we suggest you get rechargeable batteries for use in your flameless candles. If you use them a lot the batteries will be used up fairly quick. Yes, rechargeable batteries add an additional cost but if you use them a lot it is worth it. These will replace your traditional candles, I am sure of it. It has in our house. Now for scent, we use a scented wax melter.\n\nDecorate with Glass Bottles and Containers\n\nAnother great way to get that Pottery Barn look is to use glass bottles. You can find them at local craft stores, yard sales, antique stores, and thrift shops. We purchase this tall green bottle at a local furniture store. It measures almost 3 feet tall and has neat indentations in it.\n\nNext, you want to fill your bottle with something. Pebbles and shells are great. If you can get them at the beach even better. If you can’t you can purchase small bags at craft stores and Walmart for around $5.00 each. If you have a large bottle though, you will need a lot of pebbles to fill it with.\n\nWhat we did was to buy one bag of pea gravel from Lowes (you can get it from Home Depot too). You have to clean them though because they will have a lot of dirt and grit. If it is warm outside, just lay them out on the sidewalk or garage floor, hose them down and let them dry. This is SO much cheaper than buying those small bags at the craft store and they look great.\n\nPea Gravel costs less than $4.00 a bag and gives you enough to fill a lot of bottles. The bag we purchased from Lowes was 0.5-cu ft of gravel.\n\nPottery Barn Furniture and Rug Alternatives\n\nI have been wanting a sideboard for a long time. It wasn’t for the dining room, it was more just for decorating. Some call it a buffet. We looked at Pottery Barn and found a beautiful one for $1,299 but went to a local outlet furniture shop and bought this beautiful, solid wood, sideboard with slots for wine bottles for $299. We had to pick it up ourselves but it was a huge savings. You can find really good bargains at furniture outlet and clearance centers. Many pieces are just there because the line is being discounted, like in this case. It was not damaged in anyway.\n\nThe knobs that came on it were actually silver but everything in our house is gold-tone so we went to Lowes and bought gold-tone knobs and it looks perfect in our house. Other things in the photo include a gold scarf with tassels from HomeGoods that cost $15, a goldtone lamp from Lowes that could $16, and a eggshell ceramic umbrella vase that was purchased at a consignment shop for $40. The rug is a runner piece from Lowes as well.\n\nPottery Barn Wall Decor and Mirror Alternatives\n\nWhen we moved into our new house we wanted something to go into the eat-in area in the kitchen. We looked for a different buffet for that area and also something to put on the wall. Nothing we tried worked on that wall – picture, shelves, plates – so we opted for mirrors.\n\nI saw these, Ballard Designs (another favorite home decor company) “Garden District” Mirrors, in their catalog for $229 for two mirrors. Once again, a bit too expense. To get four mirrors to fill that large wall it would have cost $458 plus over-sized shipping costs, so around $550 for a set of four mirrors. And, reading the description closer, they weren’t even made out of wood, they are a poly-type material made to look like wood.\n\nWe scoured the local Home Goods stores here in Connecticut for weeks and finally found a set of two mirrors that were almost the same size as the four Ballard Designs mirrors. They were a similar design and the cost was just $49.95 for both! I think they look fantastic and make a great alternative! I love how the center design makes a circle when you put the two together. Amazon even sells Arched Window-style mirrors that look almost the same as the more expensive Ballard Design “Garden District” mirrors.\n\nBy the way, did you know that Home Goods gets new merchandise in twice a week? That means you have to check back often as the good items are often snatched up quickly.\n\nOh and by the way, the green buffet shown above in the Ballard Designs photo above is $1,299 versus the one we purchased at a local furniture store that is hand painted and cost $599. You can often find these hand-painted pieces at TJMaxx, Marshalls and Home Goods.\n\nIf you’re looking for similar mirrors I found a good option online from Esschert Designs USA and they cost less than $100. These gothic-style wooden mirrors come in white-washed grey or white and measure 33-1/2-inch high by 1.6-inch long by 26-inch wide.\n\nThis just goes to show you that you can have expensive taste but shop locally at yard sales, thrift shops, and other stores like HomeGoods, TJMaxx, Marshalls, Target and even Walmart to get that “look for less”. Since the goal is to make our home look like it all came from Pottery Barn, I just use their catalogs and ideas in the stores to understand what I am looking for them and shop elsewhere to get that look\n\nHave you found some home decor items you really wanted cheaper by shopping around or getting “look alike” pieces instead?", "images": ["https://connecticutlifestyles.com/wp-content/uploads/2019/09/cropped-favicon-1-32x32.gif", "https://connecticutlifestyles.com/wp-content/uploads/2014/01/flameless-candles.jpg", "https://connecticutlifestyles.com/wp-content/uploads/2014/01/garden-district-mirrors.jpg", "https://connecticutlifestyles.com/wp-content/uploads/2014/01/ballard-design-garden-district-mirror.jpg", "https://connecticutlifestyles.com/wp-content/uploads/2022/01/add-event-calendar-750x452.jpg", "https://connecticutlifestyles.com/wp-content/uploads/2014/01/gothic-wooden-mirrors-580x356.jpg", "https://connecticutlifestyles.com/wp-content/uploads/2014/01/homegoods-mirrors1.jpg", "https://connecticutlifestyles.com/wp-content/uploads/2014/01/metal-european-lanterns-580x488.jpg", "https://connecticutlifestyles.com/wp-content/uploads/2014/01/glass-bottles-pea-gravel.jpg", "https://connecticutlifestyles.com/wp-content/uploads/2014/01/pottery-barn-decorating.jpg", "https://connecticutlifestyles.com/wp-content/plugins/the-events-calendar/src/resources/images/tribe-loading.gif", "https://connecticutlifestyles.com/wp-content/uploads/2014/01/pottery-barn-lanterns-580x520.jpg", "http://in.getclicky.com/100669037ns.gif", "https://connecticutlifestyles.com/wp-content/uploads/2014/01/pottery-barn-budget-decorat-580x290.jpg"], "top_img": "https://connecticutlifestyles.com/wp-content/uploads/2019/09/cropped-favicon-1-32x32.gif", "keywords": [], "authors": [], "canonical_link": "https://connecticutlifestyles.com/pottery-barn-decorating-tips-on-a-walmart-budget/", "title": "Pottery Barn Decorating Tips on a Walmart Budget", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-image-preview:large", "tec-api-version": "v1", "tec-api-origin": "https://connecticutlifestyles.com", "google-site-verification": "i5QdKCzZN7uI-Dbyk8hs_d0CULpNdf-QIKRFF6xhwYk", "p": {"domain_verify": "864f86ab5b8042d18662ebc607c3f5e1"}, "yandex-verification": "7b47c69fe21b4425", "fo-verify": "6850f080-2d56-478a-ba88-19af92794f92", "msapplication-TileImage": "https://connecticutlifestyles.com/wp-content/uploads/2019/09/cropped-favicon-1-270x270.gif"}, "movies": [], "publish_date": null, "source": "http://connecticutlifestyles.com", "summary": ""}