{"url": "https://en.wikipedia.org/wiki/Buffy_the_Vampire_Slayer", "text": "American supernatural drama television series\n\nBuffy the Vampire Slayer is an American supernatural drama television series created by writer and director Joss Whedon. It is based on the 1992 film of the same name, also written by Whedon, although the events of the film are not considered canon to the series.[12] Whedon served as executive producer and showrunner under his production tag Mutant Enemy Productions.\n\nThe series premiered on March 10, 1997, on The WB and concluded on May 20, 2003, on UPN. The series narrative follows Buffy Summers (played by Sarah Michelle Gellar), the latest in a line of young women known as \"Vampire Slayers\", or simply \"Slayers\". In the story, Slayers, or the \"Chosen Ones\", are chosen by fate to battle against vampires, demons and other forces of darkness. Buffy wants to live a normal life, but as the series progresses, she learns to embrace her destiny. Like previous Slayers, Buffy is aided by a Watcher, who guides, teaches and trains her. Unlike her predecessors, Buffy surrounds herself with a circle of loyal friends who become known as the \"Scooby Gang\" – a reference to the animated franchise Scooby-Doo that features a group of friends solving mysteries together.\n\nThe series received critical and popular acclaim and usually reached between four and six million viewers on original airings.[13][14] Although such ratings are lower than successful shows on the \"big four\" networks (ABC, CBS, NBC and Fox),[15] they were a success for the relatively new and smaller WB Television Network.[16] Despite the fact that Buffy the Vampire Slayer was almost entirely ignored by major award shows during its run, the series was nominated for the American Film Institute Award for Drama Series of the Year, Gellar was nominated for the Golden Globe Award for Best Actress – Television Series Drama for her performance in the show and the series was nominated five times for Television Critics Association Awards, winning once in 2003 for the Television Critics Association Heritage Award.[17][18][19]\n\nThe success of Buffy has led to hundreds of tie-in products, including novels, comics and video games. The series has received attention in fandom (including fan films), parody, and academia, and has influenced the direction of other television series.[1][20] Buffy is considered to be part of a wave of television series from the late 1990s and early 2000s that feature strong female characters, alongside Xena: Warrior Princess, La Femme Nikita, Dark Angel, and Alias.[21] The series, as well as its spin-off series, Angel, and extensions thereof, have been collectively termed the \"Buffyverse\". A second spin-off of the series was being developed for television, with Monica Owusu-Breen as showrunner, before being shelved in 2022.[22][23]\n\nPremise [ edit ]\n\nCharacters [ edit ]\n\nBuffy Summers (played by Sarah Michelle Gellar) is the \"Slayer\", one in a long line of young women chosen by fate to battle evil forces. This mystical calling grants her powers that dramatically increase physical strength, endurance, agility, accelerated healing, intuition, and a limited degree of precognition, usually in the form of prophetic dreams. She is known as a reluctant hero who wants to live a normal life. However, she learns to embrace her destiny as the vampire slayer.[24][25]\n\nBuffy receives guidance from her Watcher, Rupert Giles (Anthony Stewart Head). Giles, rarely referred to by his first name (it is later revealed that in his rebellious younger days he went by \"Ripper\"), is a member of the Watchers' Council, whose job is to train and guide the Slayers. Giles researches the supernatural creatures that Buffy must face, offers insights into their origins and advice on how to defeat them, and helps her train to stay in fighting form.\n\nBuffy is also helped by friends she meets at Sunnydale High: Willow Rosenberg (Alyson Hannigan) and Xander Harris (Nicholas Brendon). Willow is originally a wallflower who excels at academics, providing a contrast to Buffy's outgoing personality and less-than-stellar educational record. They share the social isolation that comes with being different, and especially from being exceptional young women. As the series progresses, Willow becomes a more assertive character and a powerful witch, and reveals she is a lesbian. In contrast, Xander, with no supernatural abilities, provides comic relief and a grounded perspective. It is Xander who often provides the heart to the series. In season six, he becomes the hero and, in place of Buffy, he defeats the \"Big Bad\". Buffy and Willow are the only characters who appear in all 144 episodes; Xander is missing in only one.\n\nThe cast of characters grew over the course of the series. Buffy first arrives in Sunnydale with her mother, Joyce Summers (portrayed by Kristine Sutherland), who functions as an anchor of normality in the Summers' lives even after she learns of Buffy's role in the supernatural world (\"Becoming, Part Two\"). Buffy's younger sister Dawn Summers (Michelle Trachtenberg) is introduced in season five (\"Buffy vs. Dracula\"). A vampire tortured with a soul in return for horrific deeds committed in the past to many, including a young gypsy girl and her family, Angel (portrayed by David Boreanaz) is Buffy's love interest throughout the first three seasons. He leaves Buffy after realizing he will never be able to give her a normal life. He goes on to make amends for his sins and to search for redemption in his own spin-off television series, Angel. He makes several guest appearances in the remaining seasons, including the last episode.\n\nAt Sunnydale High, Buffy meets several other students besides Willow and Xander willing to join her fight for good, an informal group eventually tagged the \"Scooby Gang\" or \"Scoobies\". Cordelia Chase (Charisma Carpenter), the archetypal shallow cheerleader, reluctantly becomes involved. Daniel \"Oz\" Osbourne (Seth Green), a fellow student, rock guitarist and werewolf, joins the group through his relationship with Willow. Jenny Calendar (Robia LaMorte), Sunnydale's computer science teacher, joins the group after helping destroy a demon trapped in cyberspace during season 1. She later becomes Giles' love interest. Anya (Emma Caulfield), a former vengeance demon (Anyanka) who specialized in avenging scorned women, becomes Xander's lover after losing her powers and joins the group in season four.\n\nIn Buffy's senior year at high school, she meets Faith (Eliza Dushku), the other current Slayer, who was \"called\" forth when Slayer Kendra Young (Bianca Lawson) was killed by vampire Drusilla (Juliet Landau), in season two. Although Faith initially fights on the side of good with Buffy and the rest of the group, she comes to stand against them and sides with Mayor Richard Wilkins (Harry Groener) after accidentally killing a human in season three. She reappears briefly in the fourth season, looking for vengeance, and moves to Angel where she voluntarily goes to jail for her murders. Faith reappears in season seven of Buffy, after having helped Angel and his crew, and fights alongside Buffy against the First Evil.\n\nBuffy gathers other allies: Spike (James Marsters), a vampire, is an old companion of Angelus (Angel) and one of Buffy's major enemies in early seasons, although they later become allies and lovers. At the end of season six, Spike regains his soul. Spike is known for his Billy Idol-style peroxide blond hair and his black leather coat, stolen from a previous Slayer, Nikki Wood; her son, Robin Wood (D. B. Woodside), joins the group in the final season. Tara Maclay (Amber Benson) is a fellow member of Willow's Wicca group during season four, and their friendship eventually turns into a romantic relationship. Buffy becomes involved personally and professionally with Riley Finn (Marc Blucas), a military operative in \"the Initiative\", which hunts demons using science and technology. The final season sees geeky wannabe-villain Andrew Wells (Tom Lenk) come to side with the Scoobies after initially being their captive/hostage; they regard him more as a nuisance than an ally.\n\nBuffy featured dozens of recurring characters, both major and minor. For example, the \"Big Bad\" (villain) characters were featured for at least one season (for example, Glory is a character who appeared in 12 episodes, spanning much of season five). Similarly, characters who allied themselves to the group and characters who attended the same institutions were sometimes featured in multiple episodes.\n\nSetting and filming locations [ edit ]\n\nThe show is set in the fictional California town of Sunnydale, whose suburban Sunnydale High School sits on top of a \"Hellmouth\", a gateway to demon realms. The Hellmouth, located beneath the school library, is a source of mystical energies as well as a nexus for a wide variety of evil creatures and supernatural phenomena. In addition to being an open-ended plot device, Joss Whedon has cited the Hellmouth and \"high school as hell\" as one of the primary metaphors in creating the series.[26]\n\nMost of Buffy was shot on location in Los Angeles, California. The high school used in the first three seasons is actually Torrance High School, in Torrance, California, the same high school used for Beverly Hills, 90210.[27] The show was initially very dependent on location shooting, because the production budget allowed for few permanent sets to be built.[28] In Season One this was limited to the interior of Sunnydale High (the library, hallways, and classrooms), Buffy's bedroom, and the Master's underground lair. Starting in Season Two, more permanent sets were built, including the full interior of Buffy's house, Angel's mansion, and Giles's apartment, as well as extensions to the high school set (the addition of a dining hall and commons area).[28] A driveway area near the gated entrance to Fox Studios was transformed into a graveyard.[28] In Season Three the Sunnydale \"Main Street\" was constructed on the backlot, which would be a staple location for the rest of the series.[29] When the show transitioned to college in the fourth season, the hallway sets from Sunnydale High were remodeled to appear as the interior hallways of UC Sunnydale.[30]\n\nSome of the exterior shots of the college Buffy attends, UC Sunnydale, were filmed at UCLA. Several episodes include shots from the Oviatt Library at CSUN.[31][32] The exterior of the mansion where Angelus, Spike, and Drusilla lived was Frank Lloyd Wright's Ennis House.[33]\n\nFormat [ edit ]\n\nBuffy is told in a serialized format, with each episode involving a self-contained story while contributing to a larger storyline.[34] Each season's storyline is broken down into season-long narratives marked by the rise and defeat of a powerful antagonist, commonly referred to as the \"Big Bad\". While the show is mainly a drama with frequent comic relief, most episodes blend different genres, including horror, martial arts, romance, melodrama, farce, fantasy, supernatural, comedy, and even, in one episode, musical comedy.\n\nThe series' narrative revolves around Buffy and her friends, collectively dubbed the \"Scooby Gang\", who struggle to balance the fight against supernatural evils with their complicated social lives.[34] The show mixes complex, season-long storylines with a villain-of-the-week format; a typical episode contains one or more villains, or supernatural phenomena, that are thwarted or defeated by the end of the episode. Though elements and relationships are explored and ongoing subplots are included, the show focuses primarily on Buffy and her role as an archetypal heroine. Gellar described the show as \"the ultimate metaphor: horrors of adolescence manifesting through these actual monsters. It's the hardest time of life.\"[35]\n\nIn the first few seasons, the most prominent monsters in the Buffy bestiary are vampires, which are based on traditional myths, lore, and literary conventions. As the series continues, Buffy and her companions fight an increasing variety of demons, as well as ghosts, werewolves, zombies, and unscrupulous humans. They frequently save the world from annihilation by a combination of physical combat, magic, and detective-style investigation, and are guided by an extensive collection of ancient and mystical reference books.\n\nStorylines [ edit ]\n\nSeason one exemplifies the \"high school is hell\" concept. Buffy Summers has just moved to Sunnydale after burning down her old school's gym and hopes to escape her Slayer duties. Her plans are complicated by Rupert Giles, her new Watcher, who reminds her of the inescapable presence of evil. Sunnydale High is built atop a Hellmouth, a portal to demon dimensions that attracts supernatural phenomena to the area. Buffy befriends two schoolmates, Xander Harris and Willow Rosenberg, who help her fight evil throughout the series, but they must first prevent the Master, an ancient and especially threatening vampire, from opening the Hellmouth and taking over Sunnydale.\n\nThe emotional stakes are raised in season two. Vampires Spike and Drusilla (weakened from a mob in Prague, which, it is implied, caused her debilitating injury), come to town along with a new slayer, Kendra Young, who was activated as a result of Buffy's brief death in the season one finale. Xander becomes involved with Cordelia, while Willow becomes involved with witchcraft and Daniel \"Oz\" Osbourne, who is a werewolf. The romantic relationship between Buffy and the vampire Angel develops over the course of the season. But after they have sex, Angel experiences a moment of true happiness, breaking the gypsy curse that gave him his soul, thus reverting him to his evil alter ego, Angelus, infamously known as the most sadistic vampire in European history. Kendra is killed by a restored Drusilla. Angelus torments much of the \"Scooby Gang\" throughout the rest of the season and murders multiple innocents and Giles's new girlfriend Jenny Calendar, a gypsy who was sent to maintain Angel's curse. To avert an apocalypse, Buffy is forced to banish Angel to a demon dimension just moments after Willow has restored his soul. The ordeal leaves Buffy emotionally shattered, and she leaves Sunnydale.\n\nAfter attempting to start a new life in Los Angeles, Buffy returns to town in season three. Angel has mysteriously been released from the demon dimension but is close to insanity due to the torment he suffered there and is nearly driven to suicide by the First Evil. He and Buffy realize that a relationship between them can never happen; he eventually leaves Sunnydale at the end of the season. A new watcher named Wesley Wyndham-Price is put in Giles' place when Giles is fired from the Watchers' Council because he has developed a \"father's love\" for Buffy; and towards the end of the season, Buffy announces that she will no longer be working for the Council – they will be working for her. Early in the season, she meets Faith, the Slayer activated after Kendra's death. She also encounters the affable Mayor Richard Wilkins, who secretly has plans to \"ascend\" (become a \"pure\" demon) on Sunnydale High's graduation day. Although Faith initially works well with Buffy, she becomes increasingly unstable after accidentally killing a human and forms a relationship with the paternal yet manipulative Mayor, eventually landing in a coma after a fight with Buffy. At the end of the season, after the mayor becomes a huge snake-like demon, Buffy, Willow, Xander, Giles, Angel, Cordelia, Oz, and the entire graduating class destroy him by blowing up Sunnydale High. At the end of the season, Angel and Cordelia leave the series to star in the spin-off series, Angel.\n\nSeason four sees Buffy and Willow enroll at UC Sunnydale, while Xander joins the workforce and begins dating Anya, a former vengeance demon. Spike returns as a series regular and is abducted by the Initiative, a top-secret military installation based beneath the UC Sunnydale campus. They implant a microchip in his head that punishes him whenever he tries to harm a human. He makes a truce with the Scooby Gang and begins to fight on their side, purely for the joy of fighting, upon learning that he can still harm other demons. Oz leaves town after realizing that he is too dangerous as a werewolf, and Willow falls in love with Tara Maclay, another witch. Buffy begins dating Riley Finn, a graduate student and US Army Ranger seconded to The Initiative. Although appearing to be a well-meaning anti-demon operation, The Initiative's sinister plans are revealed when Adam, a monster secretly built from parts of humans, demons and machinery, escapes and begins to wreak havoc on the town. Adam is destroyed by a magical composite of Buffy and her three friends, and The Initiative is shut down.\n\nDuring season five, a younger sister, Dawn, suddenly appears in Buffy's life; although she is new to the series, to the characters it is as if she has always been there. Buffy is confronted by Glory, an exiled Hell God who is searching for a \"Key\" that will allow her to return to her Hell dimension and in the process blur the lines between dimensions and unleash Hell on Earth. It is later discovered that the Key's protectors have used Buffy's blood to turn the Key into human form – Dawn – concurrently implanting everybody with lifelong memories of her. The Watchers' Council aids in Buffy's research on Glory, and she and Giles are both reinstated on their own terms. Riley leaves early in the season after realizing that Buffy does not love him and joins a military demon-hunting operation. Spike, still implanted with the Initiative chip, realizes he is in love with Buffy and increasingly helps the Scoobies in their fight. Buffy's mother Joyce dies of a brain aneurysm, while at the end of the season, Xander proposes to Anya. Glory finally discovers that Dawn is the key and kidnaps her, using Dawn's blood to open a portal to the Hell dimension. To save Dawn, Buffy sacrifices her own life by diving into the portal and thus closes it with her death.\n\nAt the beginning of season six, Buffy has been dead for 147 days, but Buffy's friends resurrect her through a powerful spell, believing they have rescued her from a Hell dimension. Buffy returns in a deep depression, explaining (several episodes later) that she had been in heaven and is devastated to be pulled back to earth. Giles returns to England because he has concluded that Buffy has become too reliant on him, while Buffy takes up a fast-food job to support herself and Dawn, and develops a secret, mutually abusive sexual relationship with Spike. Dawn suffers from kleptomania and feelings of alienation, Xander leaves Anya at the altar (after which she once again becomes a vengeance demon), and Willow becomes addicted to magic, causing Tara to temporarily leave her. They also begin to deal with the Trio, a group of nerds led by Warren Mears who use their proficiency in technology and magic to attempt to kill Buffy and take over Sunnydale. Warren is shown to be the only competent villain of the group and, after Buffy thwarts his plans multiple times, the Trio breaks apart. Warren becomes unhinged and attacks Buffy with a gun, accidentally killing Tara in the process. This causes Willow to descend into nihilistic darkness and unleash all of her dark magical powers, killing Warren and attempting to kill his friends. Giles returns to face her in battle and infuses her with light magic, tapping into her remaining humanity. This overwhelms Willow with guilt and pain, whereupon she attempts to destroy the world to end everyone's suffering, although it eventually allows Xander to reach through her pain and end her rampage. Late in the season, after losing control and trying to rape Buffy, Spike leaves Sunnydale and travels to see a demon and asks him to \"return him to what he used to be\" so that he can \"give Buffy what she deserves\". After Spike passes a series of brutal tests, the demon restores his soul.\n\nDuring season seven, it is revealed that Buffy's second resurrection caused instability in the slayer line which also allowed the First Evil to begin tipping the balance between good and evil. It begins by hunting down and killing inactive Potential Slayers, and soon raises an army of ancient, powerful Turok-Han vampires. After the Watchers' Council is destroyed, a number of Potential Slayers (some brought by Giles) take refuge in Buffy's house. Faith returns to help fight the First Evil, and the new Sunnydale High School's principal, Robin Wood, also joins the cause. The Turok-Han vampires and a sinister, misogynistic preacher known as Caleb begin causing havoc for the Scoobies. As the Hellmouth becomes more active, nearly all of Sunnydale's population – humans and demons alike – flee. In the series finale, Buffy kills Caleb, and Angel returns to Sunnydale with an amulet, which Buffy gives to Spike; the Scoobies then surround the Hellmouth, and the Potential Slayers descend into its cavern while Willow casts a spell that activates their Slayer powers. Anya dies in the fight, as do some of the new Slayers. Spike's amulet channels the power of the sun to destroy the Hellmouth and all the vampires within it, including himself. The collapse of the cavern creates a crater that swallows all of Sunnydale, while the survivors of the battle escape in a school bus. In the final scene, as the survivors survey the crater, Dawn asks, \"What are we going to do now?\" Buffy slowly begins to enigmatically smile as she contemplates the future ahead of her, ending the series on a hopeful note.\n\nProduction [ edit ]\n\nOrigins [ edit ]\n\nBuffy creator Joss Whedon also served as executive producer, head writer, and director on the series. creator Joss Whedon also served as executive producer, head writer, and director on the series.\n\nWriter Joss Whedon says that \"Rhonda the Immortal Waitress\" was really the first incarnation of the Buffy concept, \"the idea of some woman who seems to be completely insignificant who turns out to be extraordinary\".[36] This early, unproduced idea evolved into Buffy, which Whedon developed to invert the Hollywood formula of \"the little blonde girl who goes into a dark alley and gets killed in every horror movie\".[37] Whedon wanted \"to subvert that idea and create someone who was a hero\".[37] He explained, \"The very first mission statement of the show was the joy of female power: having it, using it, sharing it.\"[38]\n\nThe idea was first visited through Whedon's script for the 1992 movie Buffy the Vampire Slayer, which featured Kristy Swanson in the title role. The director, Fran Rubel Kuzui, saw it as a \"pop culture comedy about what people think about vampires\".[39][40] Whedon disagreed: \"I had written this scary film about an empowered woman, and they turned it into a broad comedy. It was crushing.\"[41] The script was praised within the industry,[42] but the movie was not.[43]\n\nSeveral years later, Gail Berman (later a Fox executive, but at that time President and CEO of the production company Sandollar Television, who owned the TV rights to the movie) approached Whedon to develop his Buffy concept into a television series.[44] Whedon explained that \"They said, 'Do you want to do a show?' And I thought, 'High school as a horror movie.' And so the metaphor became the central concept behind Buffy, and that's how I sold it.\"[45] The supernatural elements in the series stood as metaphors for personal anxieties associated with adolescence and young adulthood.[34] Early in its development, the series was going to be simply titled Slayer.[46] Whedon went on to write and partly fund a 25-minute non-broadcast pilot[47] that was shown to networks and eventually sold to the WB Network. The latter promoted the premiere with a series of History of the Slayer clips,[48] and the first episode aired on March 10, 1997. Whedon has declared in June 2003 that the non-broadcast pilot would not be included with DVDs of the series \"while there is strength in these bones\", stating that it \"sucks on ass\".[49]\n\nExecutive producers [ edit ]\n\nJoss Whedon was credited as executive producer throughout the run of the series, and for the first five seasons (1997–2001) he was also the showrunner, supervising the writing and all aspects of production. Marti Noxon took on the role for seasons six and seven (2001–2003), but Whedon continued to be involved with writing and directing Buffy alongside projects such as Angel, Fray, and Firefly. Fran Rubel Kuzui and her husband, Kaz Kuzui, were credited as executive producers but were not involved in the show. Their credit, rights, and royalties over the franchise relate to their funding, producing, and directing of the original movie version of Buffy.[50]\n\nWriting [ edit ]\n\nScript-writing was done by Mutant Enemy, a production company created by Whedon in 1997. The writers with the most writing credits[51] are Joss Whedon, Steven S. DeKnight, Jane Espenson, David Fury, Drew Goddard, Drew Greenberg, David Greenwalt, Rebecca Rand Kirshner, Marti Noxon and Doug Petrie. Other authors with writing credits include Dean Batali, Carl Ellsworth, Tracey Forbes, Ashley Gable, Howard Gordon, Diego Gutierrez, Elin Hampton, Rob Des Hotel, Matt Kiene, Ty King, Thomas A. Swyden, Joe Reinkemeyer, Dana Reston and Dan Vebber.[52]\n\nJane Espenson has explained how scripts came together.[53] First, the writers talked about the emotional issues facing Buffy Summers and how she would confront them through her battle against evil supernatural forces. Then the episode's story was \"broken\" into acts and scenes. Act breaks were designed as key moments to intrigue viewers so that they would stay with the episode following the commercial break. The writers collectively filled in scenes surrounding these act breaks for a more fleshed-out story. A whiteboard marked their progress by mapping brief descriptions of each scene. Once \"breaking\" was done, the credited author wrote an outline for the episode, which was checked by Whedon or Noxon. The writer then wrote a full script, which went through a series of drafts, and finally a quick rewrite from the showrunner. The final article was used as the shooting script.\n\n\n\n\n\nMusic [ edit ]\n\nBuffy features a mix of original, indie, rock, and pop music. The composers spent around seven days scoring between fourteen and thirty minutes of music for each episode.[54] Christophe Beck revealed that the Buffy composers used computers and synthesizers and were limited to recording one or two \"real\" samples. Despite this, their goal was to produce \"dramatic\" orchestration that would stand up to film scores.[54]\n\nAlongside the score, most episodes featured indie rock music, usually at the characters' venue of choice, The Bronze. Buffy music supervisor John King explained that \"we like to use unsigned bands\" that \"you would believe would play in this place\".[54] For example, the fictional group Dingoes Ate My Baby were portrayed on screen by front group Four Star Mary.[55] Pop songs by famous artists were rarely featured prominently, but several episodes spotlighted the sounds of more famous artists such as Sarah McLachlan,[56][57] The Brian Jonestown Massacre, Blink-182,[58] Third Eye Blind,[59] Aimee Mann[60] (who also had a line of dialogue), The Dandy Warhols,[61] Cibo Matto,[62] Coldplay, Lisa Loeb, K's Choice, and Michelle Branch.[63] The popularity of music used in Buffy has led to the release of four soundtrack albums: Buffy the Vampire Slayer: The Album,[64] Radio Sunnydale,[65] the \"Once More, with Feeling\" Soundtrack,[66][67][68] and Buffy the Vampire Slayer: The Score.\n\nEpisodes [ edit ]\n\nSeason Episodes Originally aired First aired Last aired Network 1 12 March 10, 1997 ( ) June 2, 1997 ( 1997-06-02 ) The WB 2 22 September 15, 1997 ( ) May 19, 1998 ( 1998-05-19 ) 3 22 September 29, 1998 ( ) September 21, 1999 ( 1999-09-21 ) 4 22 October 5, 1999 ( ) May 23, 2000 ( 2000-05-23 ) 5 22 September 26, 2000 ( ) May 22, 2001 ( 2001-05-22 ) 6 22 October 2, 2001 ( ) May 21, 2002 ( 2002-05-21 ) UPN 7 22 September 24, 2002 ( ) May 20, 2003 ( 2003-05-20 )\n\nInspirations and metaphors [ edit ]\n\nDuring the first year of the series, Whedon described the show as \"My So-Called Life with The X-Files\".[69] My So-Called Life gave a sympathetic portrayal of teen anxieties; in contrast, The X-Files delivered a supernatural \"monster of the week\" story line. Alongside these series, Whedon has cited cult film Night of the Comet as a \"big influence\",[70] and credited the X-Men character Kitty Pryde as a significant influence on the character of Buffy.[71] The authors of the unofficial guidebook Dusted point out that the series was often a pastiche, borrowing elements from previous horror novels, movies, and short stories and from such common literary stock as folklore and mythology.[72] Nevitt and Smith describe Buffy's use of pastiche as \"postmodern Gothic\".[73] For example, the Adam character parallels the Frankenstein monster, the episode \"Bad Eggs\" parallels Invasion of the Body Snatchers, \"Out of Mind, Out of Sight\" parallels The Invisible Man, and so on.\n\nBuffy episodes often include a deeper meaning or metaphor as well. Whedon explained, \"We think very carefully about what we're trying to say emotionally, politically, and even philosophically while we're writing it... it really is, apart from being a pop-culture phenomenon, something that is deeply layered textually episode by episode.\"[74] Academics Wilcox and Lavery provide examples of how a few episodes deal with real life issues turned into supernatural metaphors:\n\nIn the world of Buffy the problems that teenagers face become literal monsters. A mother can take over her daughter's life (\"Witch\"); a strict stepfather-to-be really is a heartless machine (\"Ted\"); a young lesbian fears that her nature is demonic (\"Goodbye Iowa\" and \"Family\"); a girl who has sex with even the nicest-seeming guy may discover that he afterward becomes a monster (\"Innocence\").[34]\n\nThe love affair between the vampire Angel and Buffy was fraught with metaphors. For example, their night of passion cost the vampire his soul. Sarah Michelle Gellar said: \"That's the ultimate metaphor. You sleep with a guy and he turns bad on you.\"[75]\n\nBuffy struggles throughout the series with her calling as Slayer and the loss of freedom this entails, frequently sacrificing teenage experiences for her Slayer duties. Her difficulties and eventual empowering realizations are reflections of several dichotomies faced by modern women and echo feminist issues within society.[76]\n\nIn the episode \"Becoming (Part 2)\", when Joyce learns that Buffy is the Slayer, her reaction has strong echoes of a parent discovering her child is gay, including denial, suggesting that she tries \"not being a Slayer\", before ultimately kicking Buffy out of the house.[77]\n\nCasting [ edit ]\n\nIn 1996, Katie Holmes and Selma Blair were in the running for the role of Buffy. Holmes was too young for the role. Actresses who originally auditioned for the role of Buffy and got other roles in the show include Julie Benz (Darla), Elizabeth Anne Allen (Amy Madison), Julia Lee (Chantarelle/Lily Houston), Charisma Carpenter (Cordelia Chase), and Mercedes McNab (Harmony Kendall). Bianca Lawson, who played slayer Kendra Young in season 2 of the show, originally auditioned for the role of Cordelia before Carpenter was cast in the role.\n\nThe title role went to Sarah Michelle Gellar, who had appeared as Sydney Rutledge on Swans Crossing and Kendall Hart on All My Children. At age 18 in 1995, Gellar had already won a Daytime Emmy Award for Outstanding Younger Leading Actress in a Drama Series.[78] In 1996, she originally auditioned for the role of Cordelia. After watching her audition, Whedon asked her to come back in and audition for the lead role of Buffy.[79]\n\nThe character of Angel was only supposed to appear briefly in the pilot episode.[80] Nathan Fillion was one of the actors who originally auditioned for the role back in early 1996 for the unaired pilot, which did not end up featuring Angel. When the pilot was due to be reshot in September 1996, scouting for Angel began again, and by chance a talent agent spotted David Boreanaz on the sidewalk walking his dog.[80] He immediately contacted casting director Marcia Shulman, saying that he had found Angel.[80] Fillion would later portray Caleb in the show's seventh and final season, and would also work with Whedon on several other occasions, including Firefly.\n\nAnthony Stewart Head had already led a prolific acting and singing career,[81] but remained best known in the United States for a series of twelve coffee commercials with Sharon Maughan for Taster's Choice instant coffee.[82] He accepted the role of Rupert Giles.\n\nNicholas Brendon, unlike other Buffy regulars, had little acting experience, instead working various jobs—including production assistant, plumber's assistant, veterinary janitor, food delivery, script delivery, day care counselor, and waiter—before breaking into acting and overcoming his stutter.[83][84] He landed his Xander Harris role following only four days of auditioning.[85] Ryan Reynolds and Danny Strong also auditioned for the part. Strong later played the role of Jonathan Levinson, a recurring character for much of the series run.\n\nAlyson Hannigan was the last of the original six to be cast. Following her role in My Stepmother Is an Alien,[86] she appeared in commercials and supporting roles on television shows throughout the early 1990s.[86] In 1996, the role of Willow Rosenberg was originally played by Riff Regan for the unaired Buffy pilot, but Hannigan auditioned when the role was being recast for the series proper. Hannigan described her approach to the character through Willow's reaction to a particular moment: Willow sadly tells Buffy that her Barbie doll was taken from her as a child. Buffy asks her if she ever got it back. Willow's line was to reply \"most of it\". Hannigan decided on an upbeat and happy delivery of the line \"most of it\", as opposed to a sad, depressed delivery. Hannigan figured Willow would be happy and proud that she got \"most of it\" back. That indicated how she was going to play the rest of the scene, and the role, for that matter, and defined the character.[87] Her approach subsequently got her the role.\n\nOpening sequence [ edit ]\n\nThe Buffy opening sequence provides credits at the beginning of each episode, with the accompanying music performed by Californian rock band Nerf Herder. In the DVD commentary for the first Buffy episode, Whedon said his decision to go with Nerf Herder's theme was influenced by Hannigan, who had urged him to listen to the band's music.[88] Janet Halfyard, in her essay \"Music, Gender, and Identity in Buffy the Vampire Slayer and Angel\", describes the opening:\n\nFirstly ... we have the sound of an organ, accompanied by a wolf’s howl, with a visual image of a flickering night sky overlaid with unintelligible archaic script: the associations with both the silent era and films such as Nosferatu and with the conventions of the Hammer House of Horror and horror in general are unmistakable.[89]\n\nBut the theme quickly changes: \"It removes itself from the sphere of 1960s and 70s horror by replaying the same motif, the organ now supplanted by an aggressively strummed electric guitar, relocating itself in modern youth culture ...\"[89] Halfyard describes sequences, in which the action and turbulence of adolescence are depicted, as the visual content of the opening credits, and which provide a postmodern twist on the horror genre.[89]\n\nBroadcast history and syndication [ edit ]\n\nBuffy the Vampire Slayer first aired on March 10, 1997 (as a mid-season replacement for the series Savannah) on The WB, and played a key role in the growth of the Warner Bros. television network in its early years.[90][91] After five seasons, it transferred to the United Paramount Network (UPN) for its final two seasons. In 2001, the show went into syndication in the United States on local stations and on cable channel FX; the local airings ended in 2005, and the FX airings lasted until 2008 but returned to the network in 2013. Beginning in January 2010, it began to air in syndication in the United States on Logo.[92] Reruns also briefly aired on MTV. In March 2010, it began to air in Canada on MuchMusic and MuchMore.[93] On November 7, 2010, it began airing on Chiller with a 24-hour marathon; the series airs weekdays. Chiller also aired a 14-hour Thanksgiving Day marathon on November 25, 2010.[94] In 2011, it began airing on Oxygen and TeenNick. On June 22, 2015, it began airing on ABC Family.\n\nWhile the seventh season was still being broadcast, Sarah Michelle Gellar told Entertainment Weekly she was not going to sign on for an eighth year; \"When we started to have such a strong year this year, I thought: 'This is how I want to go out, on top, at our best.'\"[95] Whedon and UPN gave some considerations to production of a spin-off series that would not require Gellar, including a rumored Faith series, but nothing came of those plans.[96] The Buffy canon continued outside the television medium in the Dark Horse Comics series, Buffy Season Eight. This was produced starting March 2007 by Whedon, who also wrote the first story arc, \"The Long Way Home\".[97]\n\nIn the United Kingdom, the entire series aired on Sky One and BBC Two. After protests from fans about early episodes being edited for their pre-watershed time-slot, from the second run (mid-second season onwards), the BBC gave the show two time slots: the early-evening slot (typically Thursday at 6:45 pm) for a family-friendly version with violence, objectionable language and other stronger material cut out, and a late-night uncut version (initially late-night Sundays, but for most of the run, late-night Fridays; exact times varied).[98] Sky1 aired the show typically at 8:00 pm on Thursdays. From the fourth season onwards, the BBC aired the show in anamorphic 16:9 widescreen format. Whedon later said that Buffy was never intended to be viewed this way.[99] Despite his claims, Syfy now airs repeat showings in the widescreen format.\n\nIn August 2014, Pivot announced that, for the first time, episodes of Buffy would be broadcast in high-definition and in a widescreen 16:9 format authorized by the studio, but not by any of the series' principals.[100] The transfer was poorly received by some fans, owing to a number of technical and format changes that were viewed as detrimental to the show's presentation; various scenes were heavily cropped to fit the 16:9 format, and shots were altered to have a brighter look, often with color levels altered. Other problems included missing filters, editing errors, and poorly re-rendered CGI.[101] Series creator Joss Whedon and other members of the original team also expressed their displeasure.[102]\n\nBuffy has inspired a range of official works, including television shows, books, comics, games, and podcasts. This expansion of the series encouraged use of the term \"Buffyverse\" to describe the franchise and the fictional universe in which Buffy and related stories take place.[103][104]\n\nThe franchise has inspired Buffy action figures and merchandise such as official Buffy/Angel magazines and Buffy companion books. Eden Studios has published a Buffy role-playing game, while Score Entertainment has released a Buffy Collectible Card Game.\n\nContinuations [ edit ]\n\nThe story line was continued in a series of comic books produced by Joss Whedon and published by Dark Horse Comics, which serve as a canonical continuation of the television series. The series began in 2007 with Buffy the Vampire Slayer Season Eight and was followed by Buffy the Vampire Slayer Season Nine in 2011, Buffy the Vampire Slayer Season Ten in 2014, Buffy the Vampire Slayer Season Eleven in 2016, and Buffy the Vampire Slayer Season Twelve in 2018.[105]\n\nJoss Whedon was interested in a film continuation in 1998,[106] but such a film has yet to materialize.\n\nFuture series [ edit ]\n\nIn July 2018, 20th Century Fox Television reportedly began development on a television reboot of the series. Monica Owusu-Breen was to serve as showrunner and had been working on the script with Whedon, who was to be an executive producer.[107] News of Whedon's involvement was seen as reassuring by fans,[108] though the extent of his involvement was unclear; other executive producers reported to be involved included Gail Berman, Fran Kuzui, and Kaz Kuzui, who were all credited as executive producers for the original series.[109][110] According to anonymous sources who spoke with The Hollywood Reporter and Deadline Hollywood, the producers wanted the new series to be \"richly diverse ... [and] some aspects of the series could be seen as metaphors for issues facing society today\"[107][109] – similar to the way Gellar described the original series as the \"ultimate metaphor\" for coping with adolescence.[35] The producers intended \"for the new slayer to be African American\", an example of the diversity they wish to portray.[109] The report from Deadline Hollywood cautioned that \"the project is still in nascent stages with no script, and many details are still in flux\".[109]\n\nAt the time of Buffy's 20th anniversary in 2017, Whedon expressed fear of reboots, commenting that when \"something [is brought] back, and even if it's exactly as good as it was, the experience can't be. You've already experienced it, and part of what was great was going through it for the first time. You have to meet expectations and adjust it for the climate, which is not easily [done].\"[111] Similar concerns were expressed about the decision to reboot the series, rather than to revive it or further expand the Buffyverse.[108][112] Reports that the black lead actress was to assume the iconic role of Buffy,[107][110] rather than having a new character or slayer created, have been met with questions and concerns.[108][112][113] Vox noted that \"the original series already had multiple characters of color who could factor into an 'inclusive' reboot – including the black slayer Kendra and the 'First Slayer'\" – leaving fans wondering \"why a reboot has to racebend Buffy, when it could simply focus on a different character\".[113] A Twitter message posted by Owusu-Breen on July 26, 2018 was interpreted by media outlets as indicating that the new series would not recast the role of Buffy and instead would focus on a new Slayer.[114] In August 2022, executive producer Gail Berman announced that the series was put \"on pause\" indefinitely.[23]\n\nAngel [ edit ]\n\nThe spin-off Angel was introduced in October 1999, at the start of Buffy season four. The series was created by Buffy's creator Joss Whedon in collaboration with David Greenwalt. Like Buffy, it was produced by the production company Mutant Enemy. At times, it performed better in the Nielsen ratings than its parent series did.[14]\n\nThe series was given a darker tone, focusing on the ongoing trials of Angel in Los Angeles. His character is tormented by guilt following the return of his soul, punishment for more than a century of murder and torture. During the first four seasons of the show, he works as a private detective in a fictionalized version of Los Angeles, California, where he and his associates work to \"help the helpless\", to restore the faith and \"save the souls\" of those who have lost their way. Typically, this mission involves doing battle with demons or demonically allied humans (primarily the law firm Wolfram & Hart), while Angel must also contend with his own violent nature. In season five, the Senior Partners of Wolfram and Hart take a bold gamble in their campaign to corrupt Angel, giving him control of their Los Angeles office. Angel accepts the deal as an opportunity to fight evil from the inside.\n\nIn addition to Boreanaz, Angel inherited Buffy series cast regular Charisma Carpenter (Cordelia Chase). When Glenn Quinn (Doyle) left the series during its first season, Alexis Denisof (Wesley Wyndam-Pryce), who played a recurring character in the last nine episodes of season three of Buffy, took his place. Carpenter and Denisof were followed later by Mercedes McNab (Harmony Kendall) and James Marsters (Spike). Several actors and actresses who played Buffy characters made guest appearances on Angel, including Seth Green (Daniel \"Oz\" Osbourne), Sarah Michelle Gellar (Buffy Summers), Eliza Dushku (Faith), Tom Lenk (Andrew Wells), Alyson Hannigan (Willow Rosenberg), Julie Benz (Darla), Mark Metcalf (The Master), Julia Lee (Anne Steele) and Juliet Landau (Drusilla). Angel also continued to appear occasionally on Buffy.\n\nOther actors that appeared in both the Buffy the Vampire Slayer and Angel series but as different characters include: Bob Fimiani as Mr. Ward, a head of the Department of Defense in Buffy and Glith-roo, a Codger Demon in Angel; Carlos Jacott as a demon named Ken in Buffy and a different demon named Richard Straley in Angel; Jonathan M. Woodward as a vampire and former classmate in Buffy named Holden Webster and Knox, a Wolfram and Hart scientist in Angel; and Andy Umberger who played a demon name D'Hoffryn in Buffy and predator named Ronald Meltzer in Angel.\n\nThe storyline has been continued in the comic book series Angel: After the Fall published by IDW Publishing and later Angel and Faith published by Dark Horse Comics.\n\nExpanded universe [ edit ]\n\nOutside of the TV series, the Buffyverse has been officially expanded and elaborated on by authors and artists in the so-called \"Buffyverse Expanded Universe\". The creators of these works may or may not keep to established continuity. Similarly, writers for the TV series were under no obligation to use information which had been established by the Expanded Universe, and sometimes contradicted such continuity.\n\nDark Horse has published the Buffy comics since 1998.[115] In 2003, Whedon wrote an eight-issue miniseries for Dark Horse Comics titled Fray, about a Slayer in the future. Following the publication of Tales of the Vampires in 2004, Dark Horse Comics halted publication on Buffyverse-related comics and graphic novels. The company produced Whedon's Buffy the Vampire Slayer Season Eight with forty issues from March 2007 to January 2011, picking up where the television show left off—taking the place of an eighth canonical season.[97] The first story arc is also written by Whedon and is called \"The Long Way Home\", which has been widely well-received, with circulation rivaling industry leaders DC and Marvel's top-selling titles.[116] After \"The Long Way Home\" came other story arcs like Faith's return in \"No Future for You\" and a Fray crossover in \"Time of Your Life\". Dark Horse later followed Season Eight with Buffy the Vampire Slayer Season Nine, starting in 2011, and Buffy the Vampire Slayer Season Ten, which began in 2014. Dark Horse continued to publish Buffy comics continuing the story after the television show until September 2018, when it released the final issue of Buffy the Vampire Slayer Season Twelve, which intended to bring closure to the series. Following the end of Dark Horse's Buffy series, Boom! Studios acquired the license to publish Buffy comics. Taking a different approach from Dark Horse, Boom! Studios decided to publish a new rebooted Buffy series in 2019 with many elements updated to be more contemporary. Boom! Studio's approach to rebooting Buffy has been stylistically compared to the Ultimate Marvel series by the creators.[117] Joss Whedon is not as involved in the rebooted Buffy comic as he was in Dark Horse's continuation, however he did take part in the initial development stages for the series and gave his blessing to the creators.[118]\n\nSimon & Schuster holds the license to produce Buffy novels, of which they published more than sixty between 1998 and 2008, under their Pocket Books and Simon Pulse imprints. These sometimes flesh out background information on characters; for example, Go Ask Malice details the events that lead up to Faith arriving in Sunnydale. The most recent novels include Carnival of Souls, Blackout, Portal Through Time, Bad Bargain, The Deathless and One Thing or Your Mother. After a ten year hiatus, two additional novels were published in 2019 and 2020, following on from story threads in the comic book series.\n\nFive official Buffy video games have been released on portable and home consoles.[119] Most notably, Buffy the Vampire Slayer for Xbox in 2002 and Chaos Bleeds for GameCube, Xbox and PlayStation 2 in 2003.[120]\n\nUndeveloped spinoffs [ edit ]\n\nThe popularity of Buffy and Angel has led to attempts to develop more on-screen ventures in the fictional 'Buffyverse'. These projects remain undeveloped and may never be greenlit. In 2002, two potential spinoffs were in discussion: Buffy: The Animated Series and Ripper. Buffy: The Animated Series was a proposed animated TV show based on Buffy; Whedon and Jeph Loeb were to be executive producers for the show, and most of the cast from Buffy were to return to voice their characters. 20th Century Fox showed an interest in developing and selling the show to another network. A three-minute pilot was completed in 2004 but was never picked up. Whedon revealed to The Hollywood Reporter: \"We just could not find a home for it. We had six or seven hilarious scripts from our own staff – and nobody wanted it.\"[121] Writer Jane Espenson has teasingly revealed small extracts from some of her scripts for the show.[122]\n\nRipper was originally a proposed television show based upon the character of Rupert Giles portrayed by Anthony Stewart Head. More recent information has suggested that if Ripper were ever made, it would be a TV movie or a DVD movie.[123] There was little heard about the series until 2007 when Joss Whedon confirmed that talks were almost completed for a 90-minute Ripper special on the BBC[124] with both Head and the BBC completely on board.\n\nIn 2003, a year after the first public discussions on Buffy: The Animated Series and Ripper, Buffy was nearing its end. Espenson has said that during this time spinoffs were discussed, \"I think Marti talked with Joss about Slayer School and Tim Minear talked with him about Faith on a motorcycle. I assume there was some back-and-forth pitching.\"[125] Espenson has revealed that Slayer School might have used new slayers and potentially included Willow Rosenberg, but Whedon did not think that such a spinoff felt right.[126][127]\n\nDushku declined the pitch for a Buffyverse TV series based on Faith and instead agreed to a deal to produce Tru Calling. Dushku explained to IGN: \"It would have been a really hard thing to do, and not that I would not have been up for a challenge, but with it coming on immediately following Buffy, I think that those would have been really big boots to fill.\"[128] Tim Minear explained some of the ideas behind the aborted series: \"The show was basically going to be Faith meets Kung Fu. It would have been Faith, probably on a motorcycle, crossing the earth, trying to find her place in the world.\"[129]\n\nFinally, during the summer of 2004 after the end of Angel, a movie about Spike was proposed.[130] The movie would have been directed by Tim Minear and starred Marsters and Amy Acker and featured Alyson Hannigan.[131] Outside the 2006 Saturn Awards, Whedon announced that he had pitched the concept to various bodies but had yet to receive any feedback.[132]\n\nIn September 2008, Sci-Fi Wire ran an interview with Sarah Michelle Gellar in which she said she would not rule out returning to her most iconic role: \"Never say never\", she said. \"One of the reasons the original Buffy movie did not really work on the big screen–and people blamed Kristy, but that's not what it was–the story was better told over a long arc\", Gellar said. \"And I worry about Buffy as a 'beginning, middle and end' so quickly. ... You show me a script; you show me that it works, and you show me that [the] audience can accept that, [and] I'd probably be there. Those are what my hesitations are.\"[133]\n\nLegacy and cultural impact [ edit ]\n\nAcademia [ edit ]\n\nAnthony Stewart Head and Nicholas Brendon at the Oakland Super SlayerCon fan convention\n\nBuffy is notable for attracting the interest of scholars of popular culture, as a subset of popular culture studies, and some academic settings include the show as a topic of literary study and analysis.[134][135] National Public Radio describes Buffy as having a \"special following among academics, some of whom have staked a claim in what they call 'Buffy Studies.'\"[136] Though not widely recognized as a distinct discipline, the term \"Buffy studies\" is commonly used amongst the peer-reviewed academic Buffy-related writings.[137] The influence of Buffy on the depiction of vampires across popular culture has also been noted by anthropologists such as A. Asbjørn Jøn.[138][139] Popular media researcher Rob Cover argued that Buffy and Angel speak to contemporary attitudes to identity, inclusion, and diversity and that critiquing the characters' long-narrative stories lends insight into the complexity of identity in the current era and the landscape of social issues in which those identities are performed.[140][141]\n\nCritics have emerged in response to the academic attention the series has received. For example, Jes Battis, who authored Blood Relations in Buffy and Angel, admits that study of the Buffyverse \"invokes an uneasy combination of enthusiasm and ire\" and meets \"a certain amount of disdain from within the halls of the academy\".[142] Nonetheless, Buffy eventually led to the publication of around twenty books and hundreds of articles examining the themes of the show from a wide range of disciplinary perspectives, including sociology, Speech Communication, psychology, philosophy, and women's studies.[143] In a 2012 study by Slate, Buffy the Vampire Slayer was named the most studied pop culture work by academics, with more than 200 papers, essays, and books devoted to the series.[144]\n\nThe Whedon Studies Association produces the online academic journal Slayage and sponsors a biennial academic conference on the works of Whedon. The sixth \"Biennial Slayage Conference\", titled \"Much Ado About Whedon\", was held at California State University-Sacramento in late June 2014.[145]\n\nFandom and fan films [ edit ]\n\nThe popularity of Buffy has led to websites, online discussion forums, works of Buffy fan fiction and several unofficial fan-made productions.[146] Since the end of the series, Whedon has stated that his intention was to produce a \"cult\" television series and has acknowledged a \"rabid, almost insane fan base\" that the show has created.[145][104] In 2016, Jenny Owen Youngs and Kristin Russo began the Buffering the Vampire Slayer podcast, recognized as one of the top podcasts in production by Time and Esquire magazines.[147][148] In 2017 the 20th anniversary of the show attracted even more writers to create their own adventures of the series' characters.[149]\n\nBuffy in popular culture [ edit ]\n\nThe series, which employed pop culture references as a frequent humorous device, has itself become a frequent pop culture reference in video games, comics and television shows. The series has also been parodied and spoofed. Sarah Michelle Gellar has participated in several parody sketches, including a Saturday Night Live sketch in which the Slayer is relocated to the Seinfeld universe,[150] and adding her voice to an episode of Robot Chicken that parodied a would-be eighth season of Buffy.[151]\n\n\"Buffy\" was the code-name used for an early HTC mobile phone which integrated the social networking website Facebook.[152]\n\nIn March 2017, in honor of Buffy the Vampire Slayer's 20th anniversary, Entertainment Weekly reunited Joss Whedon and the whole cast for their first joint interview and photo shoot in over a decade.[153]\n\nU.S. television ratings [ edit ]\n\nViewership and ratings per season of Buffy the Vampire Slayer Season Timeslot (ET) Network Episodes First aired Last aired TV season Viewership\n\nrank Avg. viewers\n\n(millions) Date Viewers\n\n(millions) Date Viewers\n\n(millions) 1 Monday 9:00 pm The WB 12 March 10, 1997 ( ) 4.8[154] June 2, 1997 ( 1997-06-02 ) 4.0[155] 1996–97 144 3.7[156] 2 Monday 9:00 pm (1–13)\n\nTuesday 8:00 pm (14–22) 22 September 15, 1997 ( ) 4.4[157] May 19, 1998 ( 1998-05-19 ) 6.4[158] 1997–98 133 5.2[156] 3 Tuesday 8:00 pm 22 September 29, 1998 ( ) 7.1[159] September 21, 1999 ( 1999-09-21 ) N/A 1998–99 133 5.3[156] 4 22 October 5, 1999 ( ) N/A May 23, 2000 ( 2000-05-23 ) N/A 1999–2000 120 5.1[156] 5 22 September 26, 2000 ( ) 5.8[160] May 22, 2001 ( 2001-05-22 ) 5.2[161] 2000–01 120 4.6[162] 6 UPN 22 October 2, 2001 ( ) 7.7[163] May 21, 2002 ( 2002-05-21 ) 5.3[164] 2001–02 124 4.3[165] 7 22 September 24, 2002 ( ) 5.0[166] May 20, 2003 ( 2003-05-20 ) 4.9[167] 2002–03 140 3.9[168]\n\nBuffy helped put The WB on the ratings map, but by the time the series landed on UPN in 2001, viewing figures had fallen. The series' high came during the third season, with 5.3 million viewers (including repeats). This was probably due to the fact that both Gellar and Hannigan had hit movies out during the season (Cruel Intentions and American Pie respectively). The series' low was in season one at 3.7 million. The show's series finale \"Chosen\" pulled in a season high of 4.9 million viewers on the UPN network.[169]\n\nBuffy did not compete with shows on the main four networks (CBS, ABC, NBC, and Fox), but The WB was impressed with the young audience that the show was bringing in. Because of this, The WB ordered a full season of 22 episodes for the series' second season. Beginning with the episode \"Innocence\", which was watched by 8.2 million people, Buffy was moved from Monday at 9:00 pm to launch The WB's new night of programming on Tuesday. Due to its large success in that time slot, it remained on Tuesdays at 8:00 pm for the remainder of its original run. With its new timeslot on The WB, the show quickly climbed to the top of The WB ratings and became one of their highest-rated shows for the remainder of its time on the network. The show always placed in the top 3, usually only coming in behind 7th Heaven. Between seasons three and five, Buffy flip-flopped with Dawson's Creek and Charmed as the network's second highest-rated show.\n\nIn the 2001–2002 season, the show had moved to UPN after a negotiation dispute with The WB. While it was still one of the highest rated shows on their network, The WB felt that the show had already peaked and was not worth giving a salary increase to the cast and crew. UPN on the other hand had strong faith in the series and picked it up for a two-season renewal.[170] UPN dedicated a two-hour premiere to the series to help re-launch it. The relaunching had an effect, as the season premiere attracted the second highest rating of the series, with 7.7 million viewers.[171]\n\nImpact on television [ edit ]\n\nCommentators of the entertainment industry including The Village Voice, PopMatters, AllMovie, The Hollywood Reporter, The Washington Post have cited Buffy as \"influential\",[104] some citing it as the ascent of television into its golden age.[1][20][172] Stephanie Zacharek, in the Village Voice, wrote \"If we really are in a golden age of television, Buffy the Vampire Slayer was a harbinger.\"[173] Robert Moore of Popmatters also expressed these sentiments, writing \"TV was not art before Buffy, but it was afterwards\", suggesting that it was responsible for re-popularizing long story arcs on primetime television.[174][175]\n\n\"Buffy the Vampire Slayer showed the whole world, and an entire sprawling industry, that writing monsters and demons and end-of-the world is not hack-work, it can challenge the best. Joss Whedon raised the bar for every writer—not just genre/niche writers, but every single one of us.\" –Russell T Davies[176]\n\nIts effect on programming was quickly evident. Autumn 2003 saw several new shows going into production in the U.S. that featured strong females who are forced to come to terms with supernatural power or destiny while trying to maintain a normal life.[177] These post-Buffy shows include Dead Like Me, Joan of Arcadia, Tru Calling, Veronica Mars and Teen Wolf. Bryan Fuller, the creator of Dead Like Me, said that \"Buffy showed that young women could be in situations that were both fantastic and relatable, and instead of shunting women off to the side, it puts them at the center.\"[177] In the United Kingdom, the lessons learned from the impact of Buffy influenced the revived Doctor Who series (2005–present),[178] as well as its spinoff series Torchwood.[179]\n\nSeveral Buffy alumni have gone on to write for or create other shows. Such endeavors include Tru Calling (Douglas Petrie, Jane Espenson and lead actress Eliza Dushku), Wonderfalls (Tim Minear), Point Pleasant (Marti Noxon), Jake 2.0 (David Greenwalt), The Inside (Tim Minear), Smallville (Steven S. DeKnight), Once Upon a Time (Jane Espenson), Lost (Drew Goddard and David Fury), and Daredevil (Goddard, DeKnight, and Petrie).\n\nMeanwhile, the Parents Television Council complained of efforts to \"deluge their young viewing audiences with adult themes\".[180] The U.S. Federal Communications Commission (FCC), however, rejected the Council's indecency complaint concerning the violent sex scene between Buffy and Spike in \"Smashed\".[181] The BBC, however, chose to censor some of the more controversial sexual content when it was shown on the pre-watershed 6:45 pm slot.[182] In 2003, the show showed girlfriends Willow Rosenberg and Tara Maclay in bed together, which though not a sex scene was considered the first scene of its kind for a broadcast network series.[183] Later that year, the show featured the first lesbian sex scene in broadcast TV history.[184]\n\nAwards and nominations [ edit ]\n\nBuffy has gathered a number of awards and nominations which include an Emmy Award nomination for the 1999 episode \"Hush\", which featured an extended sequence with no character dialogue.[185][175] The 2001 episode \"The Body\" was filmed with no musical score, only diegetic music; it was nominated for a Nebula Award in 2002.[185][25] The 2001 musical episode \"Once More, with Feeling\" received plaudits, but was omitted from Emmy nomination ballots by \"accident\".[186] It since was featured on Channel 4's \"100 Greatest Musicals\".[187] In 2001, Sarah Michelle Gellar received a Golden Globe-nomination for Best Actress in a TV Series-Drama for her role in the show, as well nominations for the Teen Choice Awards and the Saturn Award for Best Genre TV Actress. The series won the Drama Category for Television's Most Memorable Moment at the 60th Primetime Emmy Awards for \"The Gift\" beating The X-Files, Grey's Anatomy, Brian's Song and Dallas, although the sequence for this award was not aired.\n\nIt was nominated for Emmy and Golden Globe awards, winning a total of three Emmys. However, snubs in lead Emmy categories resulted in outrage among TV critics and the decision by the academy to hold a tribute event in honor of the series after it had gone off the air in 2003.[188]\n\n\"Best of\" lists [ edit ]\n\nHome media [ edit ]\n\nBy 2004, before the release of the final season, the series earned $123.3 million in sales.[200]\n\nSee also [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Anthony_Stewart_Head_and_Nicholas_Brendon_Aug_2004.jpg/250px-Anthony_Stewart_Head_and_Nicholas_Brendon_Aug_2004.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Buffy_the_vampire_slayer.svg/250px-Buffy_the_vampire_slayer.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Buffy_the_vampire_slayer.svg/1200px-Buffy_the_vampire_slayer.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Torrance_High_School.jpg/250px-Torrance_High_School.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Joss_Whedon_by_Gage_Skidmore_8.jpg/200px-Joss_Whedon_by_Gage_Skidmore_8.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Buffy_the_vampire_slayer.svg/1200px-Buffy_the_vampire_slayer.svg.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Buffy_the_Vampire_Slayer", "title": "Buffy the Vampire Slayer", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Buffy_the_vampire_slayer.svg/640px-Buffy_the_vampire_slayer.svg.png", "width": 640, "height": 427}, "title": "Buffy the Vampire Slayer - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}