{"url": "https://www.bustle.com/articles/134004-did-full-houses-john-stamos-lori-loughlin-date-in-real-life-its-not-actually-clear", "text": "It is weirdly satisfying when your favorite TV couple ends up together off-screen. Real romance just elevates your OTP to a whole new level, so it is no surprise that many Full House fans have always wondered whether Aunt Becky and Uncle Jesse ever dated in real life. Or, in other words, whether Lori Loughlin and John Stamos ever dated in real life. It's a fair question to ask: Their chemistry has always been off the charts thanks to their wicked onscreen banter skills. Together, they gave Full House its one great romance. But, were Loughlin and Stamos ever as madly in love with each other as their characters were and will continue to be on Netflix's Fuller House?\n\nWell, the short answer is no. The stars never quite aligned for Loughlin and Stamos, but they may or may not have had a date at the most magical place on Earth — aka, Disneyland — depending on which one of them you ask.\n\nIn an interview with People magazine, Loughlin revealed Stamos invited her to see a band play in Disneyland way before their Full House days. At the time, they were both young actors just starting out in the business who also happened to be friends. Loughlin agreed to accompany Stamos to Disneyland, but she told People, she was never quite sure if their friendly outing counted as a true date. While she tends to think no, Stamos is firmly in the \"it was a real date\" camp, and they have been arguing over the semantics for years. \"We fight internally about that,\" Loughlin told People. \"I'm like, 'Was that a date?' He's like, 'Yeah!'\"\n\nWhat makes Stamos so sure it was a date? Well, there was definitely kissing involved, according to him. \"As I recall, we ended up kissing,\" Stamos said. \"That sounds like a date, right?\" Have mercy! That definitely sounds date like to me, but that could just be my inner Uncle Jesse and Aunt Becky shipper talking. Also, just take a moment to appreciate how these two bicker like an old married couple.\n\nAnyway, it looks like that one maybe-date in their teens will have to satisfy the cravings of Full House fans looking for a real life romance between the duo. By the time Loughlin joined Full House she was married to her first husband, Michael R. Burns — and by the time Loughlin and Burns were divorced, Stamos was married to Rebecca Romijn. Now Stamos is single, but Loughlin has been happily married to Mossimo Giannulli for 18 years, and the couple has two daughters.\n\nAs cool as a real life romance between Aunt Becky and Uncle Jesse would have been, it's even better knowing the actors are still friends. Plus, the love between their characters will live on in Fuller House and as a committed Aunt Becky/Uncle Jesse shipper there is no better news than that.\n\nImages: Warner Bros. Television; Giphy (2)", "images": ["https://imgix.bustle.com/uploads/image/2022/10/7/5d8f0698-b98b-460f-86bb-87733a815208-164650_6498_rv3.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/5/868481de-d85a-4ed6-918b-fd2d705b9aed-intern3.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/6/6/970833c6-ac2d-44b1-8808-6f216efbc190-jenna-ortega_gallery-single_0287r2c.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/9/30/d7b2162b-52fe-4d22-b787-dc312fe4dceb-28-melaniec-teaser.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/rehost/2016/9/13/9e69c59e-d378-4cc1-92f0-58c39e53db8c.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/rehost/2016/9/13/9e69c59e-d378-4cc1-92f0-58c39e53db8c.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg"], "top_img": "https://imgix.bustle.com/rehost/2016/9/13/9e69c59e-d378-4cc1-92f0-58c39e53db8c.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/articles/134004-did-full-houses-john-stamos-lori-loughlin-date-in-real-life-its-not-actually-clear", "title": "Did 'Full House's John Stamos & Lori Loughlin Date In Real Life? It's Not Actually Clear", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/articles/134004-did-full-houses-john-stamos-lori-loughlin-date-in-real-life-its-not-actually-clear", "type": "article", "title": "Did 'Full House's John Stamos & Lori Loughlin Date In Real Life? It's Not Actually Clear", "description": "It is weirdly satisfying when your favorite TV couple ends up together off-screen. Real romance just elevates your OTP to a whole new level, so it is no surprise that many Full House fans have always wondered whether Aunt Becky and Uncle Jesse ever…", "image": {"identifier": "https://imgix.bustle.com/rehost/2016/9/13/9e69c59e-d378-4cc1-92f0-58c39e53db8c.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "It is weirdly satisfying when your favorite TV couple ends up together off-screen. Real romance just elevates your OTP to a whole new level, so it is no surprise that many Full House fans have always wondered whether Aunt Becky and Uncle Jesse ever…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}