{"url": "https://en.wikipedia.org/wiki/Yolanda_Hadid", "text": "American television personality and model\n\nvan den Herik, not Herik. In this Dutch name , the surname is, not\n\nYolanda Hadid ( ; née van den Herik; formerly Foster; born (1964-01-11)11 January 1964)[1][2] is a Dutch-born American television personality and former model. She is best known as a star of the American reality-television show The Real Housewives of Beverly Hills. She is mother to IMG models Gigi, Bella, and Anwar Hadid.\n\nEarly life [ edit ]\n\nYolanda van den Herik was born and raised in Papendrecht, South Holland, to a family of Christian background. She has a brother named Leo.[3] When she was seven years old, her father died in a car accident, which left her mother, Ans van den Herik (1941–2019) to raise the two children.[2]\n\nCareer [ edit ]\n\nDutch designer Frans Molenaar asked Van den Herik to replace one of his models at a show, where she was discovered by Eileen Ford and signed a contract with Ford Models. Afterwards, Van den Herik modeled in Paris, Milan, Sydney, Cape Town, Tokyo, New York, Los Angeles, and Hamburg.[2] She modeled for 15 years before wanting to settle down and start a family. In 1994, Van den Herik moved to Los Angeles to start her family after meeting and marrying Mohamed Hadid.[4]\n\nOn 11 January 2018, her reality TV-show competition Making a Model with Yolanda Hadid premiered on Lifetime, which has been developed under the working title Model Moms.[5]\n\nPersonal life [ edit ]\n\nVan den Herik's first marriage was to Mohamed Hadid, a real estate developer, from 1994 until 2000.[6] The couple have three children together, Jelena \"Gigi\"[2] (born 23 April 1995), Isabella \"Bella\" (born 9 October 1996),[2] and Anwar (born 22 June 1999).[2]\n\nVan den Herik married musician, composer and producer David Foster in Beverly Hills, California on 11 November 2011, after becoming engaged on Christmas Eve, 2010.[7]\n\nOn 1 December 2015, Hadid announced she and David Foster planned to divorce.[8][6] The divorce was finalized in 16 October 2017.[9]\n\nShe was naturalized as a US citizen on 23 May 2013.[10]\n\nIn May 2020, Hadid announced she was in a relationship with the CEO of a construction and development company called Jingoli, Joseph ‘Joey’ Jingoli.[11]\n\nIn October 2021, Hadid's daughter Gigi's partner Zayn Malik filed a no contest plea to four charges of harassment against Hadid, and was sentenced to 360 days of probation.[12][13]\n\n\"Chronic Lyme disease\" diagnosis [ edit ]\n\nHadid has stated repeatedly on The Real Housewives of Beverly Hills and elsewhere that she has symptoms attributed to chronic Lyme disease, a discredited diagnosis that has no scientific backing.[14][15]\n\nIn December 2012, Hadid reported that she was having a port implanted in her arm to help treat what she has stated is chronic Lyme. In April 2013, she had the port removed.[16] In January 2015, she revealed that, as a consequence of the illness that Hadid believes she has, she had \"lost the ability to read, write, or even watch TV\".[17] These symptoms are not characteristic of acute Lyme disease, nor are they included on lists of symptoms of \"chronic Lyme disease\" by sources which advocate the existence of that condition. Despite the fact that acute Lyme disease is transmitted by the bite of infected Ixodes ticks and has no hereditary component, Hadid has claimed that two of her children also have chronic Lyme.[18]\n\nHadid's memoir Believe Me: My Battle with the Invisible Disability of Lyme Disease, was published in 2017.[19]\n\nFilmography [ edit ]\n\nMusic videos [ edit ]\n\nYear Title Artist Role 2014 \"G.U.Y.\" Lady Gaga The Real Housewives of Beverly Hills Band Member", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/AnnaSui-FW17RTW-Hadids-BW_%28cropped%29.jpg/170px-AnnaSui-FW17RTW-Hadids-BW_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/YolandaFosterHWOFMay2013.jpg/220px-YolandaFosterHWOFMay2013.jpg", "https://upload.wikimedia.org/wikipedia/commons/2/21/YolandaFosterHWOFMay2013.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/2/21/YolandaFosterHWOFMay2013.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Yolanda_Hadid", "title": "Yolanda Hadid", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/2/21/YolandaFosterHWOFMay2013.jpg", "width": 640, "height": 1131}, "title": "Yolanda Hadid - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}