{"url": "https://www.denofgeek.com/tv/29456/10-great-tv-shows-for-geek-parents-to-watch-with-their-kids", "text": "Ben & Holly’s Little Kingdom\n\nWhy kids love it: Ben & Holly’s Little Kingdom is, like many pre-school shows, based on friendship and getting into trouble, but here there’s added magic. Like a reception class version of The Hobbit, there are elves, one of whom is Ben, and fairies, one of whom is Princess Holly. The elves don’t like magic and blow trumpets every time they announce themselves while the fairies love magic, often with disastrous results that involve floods of jelly. Add to this their friendship with the human Lucy and vibrant characters such a Ben’s pet ladybird Gaston, who thinks he’s a dog, and it makes for a magical package.\n\nWhat’s in it for the grown ups? There are really two words to sum this up – Nanny Plum. Brilliantly voiced by Sarah Ann Kennedy, Nanny Plum is housekeeper to Princess Holly’s parents, King and Queen Thistle. Often sarcastic, often casting spells that invariable go wrong (to replace a priceless frozen bird sculpture she uses the spell “Make me a bird, ice thingy”) and frequently hilarious, Plum is the highlight of Ben & Holly. The writing in the show is so tight that there’s often some very funny, sitcom-style bantering going on between the adult characters and it’s never better than when Nanny Plum is involved. King Thistle probably adds the most entertainment next as the hapless and grumpy king who is happy as long as he can get his bath. The creators of Ben & Holly have produced a show that while enthralling for children, has all the hallmarks of a great British comedy. A delight for adult viewers too was this trailer, which ran ahead of recent episodes and paid tribute to Game of Thrones.\n\nCharlie & Lola\n\nWhy kids love it: Based on Lauren Child’s books, which she began writing in 2000, imagination and sibling love/frustration are the key themes of this great brother and sister show. As Charlie informs us at the beginning of every episode “I have this little sister Lola. She is small and very funny”. Lola then invariably gets up to something or has an idea about something she wants to do, and Charlie has to guide her. As Lola is four years old, she’s immediately identifiable for the kids watching the show as she’s discovering many of the same things as her audience. Like boys and girls her age too, she often doesn’t understand the consequences of her actions but learns through her imaginative adventures.\n\nWhat’s in it for the grown ups? Charlie and Lola is very funny. The good-natured battles between the two characters are highly amusing for anyone who has grown up with brothers and sisters. The episode in which Lola ruins Charlie’s Birthday party by opening all his presents is bound to stir some memories for many people. The show is so well-observed that you really do feel like you’re watching a genuine sibling relationship. It also delivers a great deal of humour from the perspective of a parent. A lot of the things Lola says, or can’t believe, are familiar to what our own children come out with, and being a parent can be the funniest thing in the world.", "images": ["https://secure.gravatar.com/avatar/?s=96&d=mm&r=g", "https://www.denofgeek.com/wp-content/uploads/2014/02/adventure_time_1.jpg?fit=640%2C380", "https://www.denofgeek.com/wp-content/uploads/2014/02/adventure_time_1.jpg?resize=640%2C380"], "top_img": "https://www.denofgeek.com/wp-content/uploads/2014/02/adventure_time_1.jpg?fit=640%2C380", "keywords": [], "authors": ["Glen Chapman", "James Stansfield", "Nick Harley", "Juliette Harrisson", "Kirsten Howard", "Billy Grifter", "Chris Longo", "Kayti Burt", "Louisa Mellor", "John Saavedra"], "canonical_link": "https://www.denofgeek.com/tv/10-great-tv-shows-for-geek-parents-to-watch-with-their-kids/", "title": "10 great TV shows to enjoy with your kids", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#d23226", "robots": "index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1", "p": {"domain_verify": "1893a020468964417f83c6a42b6791cf"}, "description": "From Adventure Time to Old Jack's Boat, James and Glen talk us through ten modern kids' TV shows that geek parents can enjoy too...", "og": {"locale": "en_US", "type": "article", "title": "10 great TV shows to enjoy with your kids", "description": "From Adventure Time to Old Jack's Boat, James and Glen talk us through ten modern kids' TV shows that geek parents can enjoy too...", "url": "https://www.denofgeek.com/tv/10-great-tv-shows-for-geek-parents-to-watch-with-their-kids/", "site_name": "Den of Geek", "image": {"identifier": "https://www.denofgeek.com/wp-content/uploads/2014/02/adventure_time_1.jpg?fit=640%2C380", "width": 640, "height": 380, "type": "image/jpeg"}}, "article": {"published_time": "2014-02-26T07:00:00+00:00"}, "author": "jbindeck2015", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "Glen Chapman, James Stansfield", "label2": "Est. reading time", "data2": "15 minutes"}, "parsely-title": "10 great TV shows to enjoy with your kids", "parsely-link": "http://www.denofgeek.com/tv/10-great-tv-shows-for-geek-parents-to-watch-with-their-kids/", "parsely-type": "post", "parsely-image-url": "https://www.denofgeek.com/wp-content/uploads/2014/02/adventure_time_1.jpg?resize=150%2C150", "parsely-pub-date": "2014-02-26T07:00:00Z", "parsely-section": "TV", "parsely-author": "James Stansfield", "msapplication-TileImage": "https://www.denofgeek.com/wp-content/uploads/2020/02/favicon.geek_.purple.swirl_-1.png?fit=270%2C270"}, "movies": [], "publish_date": 1393398000.0, "source": "https://www.denofgeek.com", "summary": ""}