{"url": "en.wikipedia.org/wiki/Tobey_Maguire", "text": "American actor and film producer (born 1975)\n\nTobias Vincent Maguire (born June 27, 1975) is an American actor and film producer. He is best known for playing the title character from Sam Raimi's Spider-Man trilogy (2002–2007), a role he later reprised in Spider-Man: No Way Home (2021).\n\nHe started his career in supporting roles in the films This Boys Life (1993), The Ice Storm, Deconstructing Harry (both 1997), and Fear and Loathing in Las Vegas (1998). His leading roles include Pleasantville (1998), Ride with the Devil (1999), The Cider House Rules (1999), Wonder Boys (2000), Seabiscuit (2003), The Good German (2006), Brothers (2009), The Great Gatsby (2013), and Pawn Sacrifice (2014).\n\nHe has received two Screen Actors Guild Award nominations for Outstanding Cast in a Motion Picture for Cider House Rules (1999) and Seabiscut (2003) as well as a Golden Globe Award nomination for Best Actor in a Motion Picture Drama for Brothers (2009). Maguire established his own production company in 2012 called Material Pictures, and co-produced Good People (2012), and Pawn Sacrifice (2014).[2][3]\n\nEarly life and family\n\nTobias Vincent Maguire was born on June 27, 1975, in Santa Monica, California, to Wendy Brown and Vincent Maguire.[1][4][5] His parents separated when he was two years old, and Maguire spent much of his childhood living with various family members.[6]\n\nDuring his childhood, Maguire entertained the idea of becoming a chef and wanted to enroll in a home economics class as a sixth grader. His mother offered him $100 to take a drama class instead, and he agreed.[7] The transient nature of his school years began to take a toll on Maguire emotionally, and after another relocation for his freshman year, he dropped out of high school and did not return. Instead, he pursued an acting career.[8] By 2000, he had obtained his General Educational Development, noting that during his school days, \"I was not doing school; I was showing up, but... not really giving myself.\"[9]\n\nActing career\n\n1989–1995: Early career\n\nMaguire's first appearance in a feature film was in 1989's The Wizard.[10] He plays one of Lucas Barton's goons (one of three competitors at a video game competition) and had no lines. He worked as a child actor in the early 1990s, often playing roles much younger than his chronological age, and as late as 2002 he was still playing teenagers while in his mid-20s. He appeared in a variety of commercials and TV and movie roles, working opposite such actors as Chuck Norris (Walker, Texas Ranger), Roseanne Barr (Roseanne), and Tracey Ullman (Tracey Takes On...). Eventually, he was cast as the lead in the FOX TV series Great Scott!, which was canceled nine weeks later.[11]\n\nDuring many of his auditions, Maguire found himself auditioning for roles opposite another rising actor, Leonardo DiCaprio. The pair quickly became friends and made an informal pact to help each other get parts in their movies/TV shows/other projects. For example, both auditioned for the same part in the 1990 TV series based on the 1989 comedy Parenthood. DiCaprio was cast, and Maguire later got a guest role at least partly on DiCaprio's recommendation. The same scenario played itself out during casting for the 1993 movie This Boy's Life (featuring Robert De Niro as the lead); DiCaprio got the main teen role of character Tobias \"Toby\" Wolff and Maguire got a part as one of his friends.[12]\n\n1995–2002: Acclaim\n\nBy the mid-1990s, he was working steadily but was also becoming involved in the hard-partying lifestyle of some of his fellow young actors. In 1995, he requested director Allan Moyle to release him from his part in the movie Empire Records. Moyle agreed, and all of Maguire's scenes were deleted from the final film.[13] Maguire then sought help for a drinking problem from Alcoholics Anonymous; he has been sober ever since.[14]\n\nAs part of his recovery from alcoholism and learning to deal with his self-described \"addictive and compulsive nature\",[14] Maguire changed his career path slightly to obtain roles where he and DiCaprio would not always be in competition for the same part, and the move paid off when given the role of Paul Hood, a teenage boarding school student whose narration anchors the action, in Ang Lee's 1997 film, The Ice Storm.[15] This led to a variety of lead roles in films such as Pleasantville, The Cider House Rules, and Wonder Boys.[16]\n\nIn the 1998 film Fear and Loathing in Las Vegas he portrayed a hitchhiker who meets Raoul Duke and Dr. Gonzo during their drive to Las Vegas.[17]\n\nIn Ride with the Devil (1999), Maguire portrayed Jakob Roedel, opposite Jewel Kilcher. Here he played the son of a unionist German immigrant who joins his southern friends in the Missouri riders, avenging the atrocities committed against Missourians by Kansas Jayhawkers and redleggers.[18]\n\nIn 2001, Maguire took a role that featured his youthful-sounding voice, a beagle puppy named Lou, in the family movie Cats & Dogs.[19]\n\n2002–2013: Stardom\n\nSpider-Man 3 premiere Maguire greets fans at apremiere\n\nIn 2002, Maguire starred in Spider-Man, based on the popular Marvel Comics superhero, Spider-Man. The film was a major success and made him a star. He reprised the role in the sequels Spider-Man 2 (2004) and Spider-Man 3 (2007), and also voiced Spider-Man for the video game adaptations of the films.\n\nHis performance as Spider-Man earned him glowing reviews. Mark Caro of the Chicago Tribune wrote that \"with his big, round, soulful eyes, Maguire always has been able to convey a sense of wonder, and his instinct for understatement also serves him well here.\"[20] Due to script and production complications, a proposed fourth Spider-Man movie did not materialize. Sony's Columbia Pictures decided to reboot the franchise.[21] The film, titled The Amazing Spider-Man, was released on July 3, 2012, with a different actor, Andrew Garfield, playing the lead.[22]\n\nMaguire had a lead role as the jockey John M. \"Red\" Pollard in Seabiscuit, about the famous racehorse Seabiscuit.[23] In 2006, he starred in his first villainous role as Corporal Patrick Tully opposite George Clooney and Cate Blanchett in Steven Soderbergh's The Good German, based on the Joseph Kanon novel of the same name.[24] He is also a producer whose production credits include 25th Hour (2002), Whatever We Do (2003), and Seabiscuit (2003), for which he served as executive producer.[25]\n\nIn 2008, he made a cameo appearance in the action comedy film Tropic Thunder as a gay 18th century[26] monk with his eye on Father O'Malley (Kirk Lazarus, the character played by Robert Downey, Jr. in Tropic Thunder) in the faux trailer for Satan's Alley. He was a last-minute replacement in the role, and due to previously-scheduled commitments was only available to be on set for two hours to film his scenes.[27] Near the end of Tropic Thunder, it is revealed that Maguire's character has been nominated for a Best Actor Oscar for Satan's Alley, which he loses to Tugg Speedman (Ben Stiller) for his role in Tropic Blunder, presented by Kirk Lazarus.[28]\n\nIn 2009, he starred alongside Jake Gyllenhaal and Natalie Portman in the Jim Sheridan-directed war drama Brothers as Sam Cahill, a prisoner of war who returns from Afghanistan and starts believing that his wife has become romantically involved with his brother. He received critical acclaim and a Golden Globe nomination for his performance in the film. Of the nomination, Maguire said, \"I had no expectation about getting a nomination, but I was watching nonetheless. My wife and my son got really excited. I was sort of surprised – I was like, 'Oh, wow.' And I couldn't hear the latter part of my name.\"[29] Maguire lost to Jeff Bridges for his role in Crazy Heart.[30] Maguire was also initially set to star as The Writer in The Life of Pi (2012) directed by Ang Lee but was cut from the film during production for being \"too recogniseable\" and was replaced as The Writer by Rafe Spall in the role during with Lee deciding to reshoot all the scenes he had shot with Maguire with Spall.[31]\n\n2013–present: Resurgence\n\nMaguire and DiCaprio once again performed together, in Baz Luhrmann's remake of The Great Gatsby (2013); DiCaprio played the title role, while Maguire played the story's narrator, Nick Carraway.[32][33]\n\nIn 2012, Maguire was a co-producer of Good People. That same year, he also established his own production company, Material Pictures, which secured independent financing in 2013 to help it produce more feature films.[34]\n\nHis next film, Pawn Sacrifice (2015), was also co-produced by Material Pictures. It was a Cold War thriller based on the true story of American chess prodigy Bobby Fischer, played by Maguire. The film details the events leading up to and including the world chess championship in 1972, when Fischer challenges Soviet chess grandmaster and world champion, Boris Spassky, acted by Liev Schreiber.[35] It received mostly positive reviews.[36] Maguire reunited with Alec Baldwin after Cats & Dogs (2001) in the animated movie The Boss Baby (2017), where he voiced the adult version of Tim Templeton.[37]\n\nMaguire reprised his role as Peter Parker / Spider-Man in the Marvel Cinematic Universe film Spider-Man: No Way Home (2021), alongside successors Tom Holland and Andrew Garfield.[38] He will appear in Damien Chazelle's ensemble film Babylon, where he will also serve as an executive producer.[39]\n\nPersonal life\n\nMaguire has been a vegetarian since 1992; in 2009, he became a vegan.[40][41][42] He has made changes in his diet to either gain or lose weight for film roles: he dramatically decreased his calorie intake for Seabiscuit, followed by a rapid increase to regain weight for Spider-Man 2.[43] Maguire has been sober since age 19, having experienced \"some difficulty\" with alcohol in his late teens.[44]\n\nMaguire met jewelry designer Jennifer Meyer in 2003 while he was shooting Seabiscuit at Universal Studios, and they became engaged in April 2006. Their daughter was born in November that year.[45][46] Meyer's father, Universal studios head Ronald Meyer, reportedly helped Maguire regain his job after being fired from Spider-Man 2 in 2003.[47] Maguire and Meyer married on September 3, 2007, in Kailua Kona, Hawaii.[48] Their second child, a son, was born in May 2009.[49] On October 18, 2016, the couple announced their separation after nine years of marriage.[50] In 2020, Meyer filed for divorce after four years of separation.[51]\n\nIn 2004, Maguire took up tournament poker. He has finished in the money in several events and has been tutored by poker professional Daniel Negreanu. Maguire was seen on ESPN's coverage of the 2005, 2006, and 2007 World Series of Poker Main Event Championship.[52][53] He was one of many celebrities, along with Leonardo DiCaprio and Ben Affleck, who participated in Molly Bloom's high-stake poker games at The Viper Room in the mid-2000s,[54] and received negative press coverage for allegedly demanding Bloom \"bark like a seal\" for a $1,000 poker chip after a tournament he won.[55] Maguire's actions at the game are portrayed by Michael Cera in the film Molly's Game through the character \"Player X\".[56]\n\nFilmography\n\nSelected work:\n\nAwards and nominations\n\n\n\n\n\nSee also\n\nMaguimithrax , a spider crab named after Maguire\n\n, a spider crab named after Maguire Filistata maguirei , a spider named after Maguire\n\n, a spider named after Maguire Bully Maguire", "images": ["http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Tobey_Maguire_2014.jpg/220px-Tobey_Maguire_2014.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Tobey_Maguire_2006.jpg/220px-Tobey_Maguire_2006.jpg", "https://upload.wikimedia.org/wikipedia/commons/c/c2/Tobey_Maguire_2014.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Tobey_Maguire_greets_fans_at_Spiderman_3_by_David_Shankbone.jpg/240px-Tobey_Maguire_greets_fans_at_Spiderman_3_by_David_Shankbone.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Tobey_Maguire_3%2C_2013.jpg/170px-Tobey_Maguire_3%2C_2013.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Tobey_Maguire_2014.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tobey_Maguire", "title": "Tobey Maguire", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Tobey_Maguire_2014.jpg/640px-Tobey_Maguire_2014.jpg", "width": 640, "height": 852}, "title": "Tobey Maguire - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}