{"url": "https://en.wikipedia.org/wiki/Jamie_Lynn_Spears", "text": "American actress and singer (born 1991)\n\nJamie Lynn Marie Spears[1] (born April 4, 1991)[1] is an American actress and singer. From 2005 to 2008, Spears played Zoey Brooks on the Nickelodeon teen sitcom Zoey 101 (2005–2008). She is the younger sister of singer Britney Spears.\n\nBeginning in December 2007, Spears was subject to significant media attention and controversy after announcing her pregnancy at age 16. A misconception emerged that this canceled Zoey 101. The final season wrapped filming in August 2007, but would not premiere until the following year. After giving birth in 2008, she stopped acting and making albums for five years.[2]\n\nSpears returned from her hiatus in 2013 and released her debut single \"How Could I Want More\" from her debut EP in country music, The Journey (2014). In 2015, Spears earned songwriting credits for Jana Kramer's certified Platinum single, \"I Got the Boy\", a song she wrote in 2011 during writing sessions in Nashville for her 2013 EP.[3] In 2016, Spears released a documentary Jamie Lynn Spears: When the Lights Go Out, reflecting on the controversy of her pregnancy, showcasing her country music career after \"realizing [her] true calling was music\" as well as her personal life as a wife and mother.[4] Despite this, Spears has not released a debut album. In 2019, it was announced Spears would instead return to acting and portray Noreen Fitzgibbons in the Netflix romantic drama series Sweet Magnolias (2020–present).\n\nEarly life [ edit ]\n\nSpears was born in McComb, Mississippi,[5] and raised in Kentwood, Louisiana,[1] to James and Lynne Spears. Her older siblings are Bryan and Britney.[6] She attended Parklane Academy in McComb, where she was a cheerleader, and point guard of the basketball team.[7] Spears studied with tutors while filming Zoey 101 in Los Angeles.[8] She finished her education via online correspondence[9] and received her GED in February 2008 through Tangipahoa Parish School System Adult Education Center.[10]\n\nCareer [ edit ]\n\n2002–2008: Career beginnings and success with Zoey 101 [ edit ]\n\nIn February 2002, Spears made her acting debut in the Paramount Pictures drama film Crossroads which starred her sister, who portrayed the central character Lucy Wagner. Spears made a cameo, playing the younger version of Britney's character.[11] Following Crossroads, Nickelodeon cast Spears as a regular performer in the eighth season of the sketch comedy series All That.[12] The season followed a two-year hiatus of the series. Spears portrayed various roles through the two seasons she appeared in as well as herself.[13] Spears's performance received positive reviews from critics with many complimenting her comedic timing and being a highlight of the show. Spears did not return for the series' tenth and final season to pursue other roles on the network. Spears made a guest appearance at Stars, Stripes and Skates skating gala at Madison Square Garden in September 2002.[citation needed]\n\nIn August 2004, Spears signed a development deal with Nickelodeon in which she would star as the protagonist in her own scripted television series that would air on the network. The series went on to be titled Zoey 101 and Spears portrayed the role of Zoey Brooks. The series centered on Zoey and her friends who attend a fictional boarding school, Pacific Coast Academy (PCA). Spears recorded the series theme song, titled \"Follow Me\", which was written by her sister Britney Spears. Filmed at Pepperdine University in Malibu, California, the series premiered on January 9, 2005, the network's highest-rated series premiere in over eight years. Spears won a Young Artist Award and a Nickelodeon Kids' Choice Awards for her performance.[14] Nickelodeon announced the fourth season would be the series' last season. The series finale, \"PCA Confidential\", aired on May 2, 2008. Nickelodeon issued a statement shortly after the announcement of Spears being pregnant at the age of 16, stating that the network respected Spears's decision to take responsibility and noting that its primary concern was for her well-being.[15][16]\n\nIn December 2007, Variety announced that Spears had signed on to guest-appear in the ABC comedy sitcom series Miss Guided, in which she played the role of the promiscuous high-school student Mandy Fener in the episode \"Hot Sub\" which aired on March 20, 2008. That same year, Spears voiced Goldilocks in the direct-to-DVD animation film Unstable Fables: Goldilocks & 3 Bears Show. The film is the third and final installment of the Unstable Fables trilogy.[citation needed]\n\n2011–2017: Country music debut and ATV incident [ edit ]\n\nSpears performing in 2014\n\nIn 2011, Spears moved to Nashville with her daughter Maddie and began working on a country music album with a number of local music producers.[13] On November 7, 2011, Spears held a small concert at the Rutledge in Nashville in which she performed a set of original songs.[17] On November 25, 2013, Spears released her first single \"How Could I Want More\" from her upcoming debut album.[18][19] The song debuted at number 29 on Billboard's Hot Country Songs, and at number 8 on the Country Digital Songs chart, for the week ending December 7, 2013.[20][21] Kevin Rutherford of Billboard described Spears' performance as \"sweet and innocent\" yet powerful, and suggested the song would fit right in at country radio.[22] Spears is featured on her older sister, Britney Spears's eighth studio album Britney Jean on the song \"Chillin' with You\".[23] On May 27, 2014, Spears released an EP called The Journey.[24] The EP peaked at number 5 on Billboard's Heatseekers Albums, and at number 24 on Top Country Albums. Jana Kramer recorded a song Spears co-wrote, \"I Got the Boy,\" which was released as the second single from Thirty One in 2015.[3] The song was certified Platinum by the Recording Industry Association of America (RIAA), and has sold 592,000 copies in the United States as of April 2016.\n\nOn March 15, 2016, Spears performed at the Grand Ole Opry in Nashville. She was introduced by her two older siblings, Britney and Bryan, who made surprise appearances at the show.[25] On June 24, 2016, Spears released her second single, \"Sleepover.\"[26] She described the song as \"young, flirty and empowering\".[27] Spears was a presenter and a performer at Radio Disney Music Awards in April 2017.[28][29]\n\nOn February 5, 2017, Spears and her eight-year-old daughter Maddie almost drowned in a Polaris ATV accident, after accidentally driving into the pond on her stepfather and mother's Louisiana property, with the ATV flipping over upon impact. She was later airlifted to Children's Hospital of New Orleans, where she remained unconscious in a coma for two days. She woke up and was released from care on February 10.[30] Police reported the incident as occurring before 3:00 p.m. on a Sunday afternoon, and the sheriff explained that she was steering \"100 yards from her parents\" when she took \"a hard right to avoid running over a nearby drainage ditch\". The police report stated, \"In doing so, she overcorrected causing the ATV to enter the pond. The ATV and child were instantly submerged in the water right before their eyes. Within seconds the child's mother, stepfather and other family members reached the pond, dove in and attempted to rescue the child to no avail. The child was trapped and secured by the seatbelt and the ATV's safety netting. Within two minutes, Acadian Ambulance Services arrived and assisted in freeing the child from the cold waters.\"[31]\n\nDouble Dare in 2018 Spears and her daughter Maddie on the game showin 2018\n\nIn 2020, Spears explained the situation further. She said Maddie drove the ATV \"with every safety measure that could be taken\" when she \"somehow or another, drove into the water.\" She elaborated that she and her husband Jamie Watson \"[...] dove in and [...] were able to rescue her,\" then the first responder took her away. The firefighter was able to get a pulse, but her case looked \"grim at the time\", leading to her being airlifted to the hospital. In a statement sharing private photographs of her daughter at the hospital, Spears said:\n\n\"It started like most Sundays, going to church, visiting family, to suddenly trying to save my daughter's life, to them taking her away, to us believing we had lost her forever, and it literally felt like the world stood still around me,\" she wrote. \"I have never spoken fully in detail about that day, and the events that followed, but what I will share is that God blessed us with a true miracle. Maddie not only stayed here with us, but she made a full recovery.\"[32]\n\nIn an episode that aired on July 13, 2018, Spears returned to Nickelodeon for the first time in over ten years as a contestant on the revived game show Double Dare with her daughter Maddie, competing against fellow All That alumnus Josh Server and his niece.[33] She and Maddie won over $15,000 to donate to the New Orleans hospital that treated Maddie following a near-fatal ATV accident in 2017.[34]\n\n2019–present: Return to television acting and autobiography [ edit ]\n\nIn July 2019, Netflix announced that Spears has been cast as a series regular in the upcoming romance drama series Sweet Magnolias, which is based on the novel series by Sherryl Woods.[35][36] She played young woman called Noreen Fitzgibbons, who works as a nurse and wants to build a new life after making bad choices.[37] In November 2019, Teen Vogue reported that Spears has joined the cast of a new Nickelodeon television series, which is uniting two of the channel's most iconic shows from the past: All That and Zoey 101.[38][39] In July 2020, the cast of Zoey 101 reunited in an episode of the eleventh season of All That.[40] Spears played herself and her old All That character Thelma Stump.[41] While working on a Zoey 101 reboot, Spears and Chantel Jeffries recorded a new version of the show's theme song \"Follow Me\".[13][42] The music video for the song featured appearances by JoJo Siwa, Dixie D'Amelio, Gigi Gorgeous, Eva Gutowski, Loren Gray, Lynne Spears and Spears' elder daughter Maddie.[43][44][45]\n\nIn July 2021, Worthy Publishing, an imprint of Hachette Book Group announced her plans to release a memoir, releasing a statement saying: \"Jamie Lynn's book has been in development over the past 12 months and will allow the world to hear her inspiring story in her own words, for the first time.\"[46][47] A portion of the book sales was planned to go to mental health organization This Is My Brave.[48] On October 19, 2021, the organization stated that they would decline the offer due to the negative reaction from the general public.[49] Her memoir entitled Things I Should Have Said was released on January 18, 2022.[50][51][52] Rolling Stone recommended the book but highlighted that Jamie Lynn ostensibly used her sister Britney Spears' highly-publicized struggles and conservatorship to promote her new book.[53]\n\nPublic image [ edit ]\n\nSpears has been featured in several fashion blogs and magazines such as Nylon,[13] Seventeen, Teen Vogue, CosmoGirl, Teen People, Teen, Girls' Life, Mizz and Nickelodeon Magazine.[54][55] Spears has appeared in commercials and print ads throughout her career. She appeared in television commercials for eKara, Pepsi and Clorox Bleach. In 2018, she appeared in an advertising campaign for Kraft with daughter Maddie.[56]\n\nSpears is popular on social media and endorses products such as beauty and wellness products on Instagram.[57] She has partnered with FabFitFun,[58] KiwiCo[59] and Teami Blends.[60]\n\nPersonal life [ edit ]\n\nSpears is Catholic since her conversion in early 2018, as are her daughters and her mother Lynne.[61][62]\n\nTeenage pregnancy [ edit ]\n\nOn December 20, 2007, in an interview with OK! Magazine, Spears announced that she was pregnant by her former boyfriend, Casey Aldridge.[63] She was 16 years old at the time. Aldridge, whom she had been dating for two years, was 18.[64] Spears in March 2008 confirmed her engagement to Aldridge.[65] In May 2008, the couple moved to Liberty, Mississippi, and purchased a house, with Spears stating they would raise their child there.[66] Spears gave birth to their daughter Maddie Briann Aldridge on June 19, 2008, in McComb, Mississippi.[67][68][69] Spears and Aldridge ended their engagement in March 2009,[70][71] and Spears moved out in December 2009.[72] Spears and Aldridge reconciled in August 2010,[73] but ended their relationship a second time in November 2010.[74][75]\n\nThe announcement of Spears' pregnancy generated controversy, with criticism centering on the story purportedly glamorizing teenage pregnancy.[76][77] Some teens were disappointed with the contrast between Spears' on-screen personality as a \"good\" girl and her real-life teen pregnancy.[78] On June 4, 2008, while in Amite County, Mississippi, the Spears family filed a complaint against Edwin Merrino, a paparazzo who, they believed, was stalking the couple. Merrino denied the allegation. He was released later in the day after posting bond.[79] After her daughter's birth, Spears disappeared from the public eye for five years, focusing on raising her child.[80]\n\nMarriage and family [ edit ]\n\nShe subsequently began a relationship with Jamie Watson, a businessman who owns communications service Advanced Media Partners. After two years of on-and-off dating, they announced their engagement in March 2013.[81][82] On March 14, 2014, she married Watson in New Orleans.[83] On April 11, 2018, Spears gave birth to her second daughter.[84][85]\n\nFeud with Britney Spears [ edit ]\n\nIn 2021, Jamie Lynn and her sister Britney were involved in a highly publicized feud via social media. Britney publicly accused Jamie Lynn of actively and knowingly being involved in her conservatorship, while not making any efforts to help her terminate it. Jamie Lynn has since denied the allegations and maintained that she was unaware of the details of the conservatorship. The sisters have not been in contact since, and Britney has threatened legal action against Jamie Lynn after the latter spoke extensively about Britney in both her book and the following promotional tour.[86]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nDiscography [ edit ]\n\nExtended plays [ edit ]\n\nSingles [ edit ]\n\nOther appearances [ edit ]\n\nMusic videos [ edit ]\n\nGuest Appearances [ edit ]\n\nYear Title Artist Notes 2013 \"Ooh La La\" Britney Spears Guest appearance\n\nAwards and nominations [ edit ]\n\nPublished works [ edit ]\n\nSpears, Jamie Lynn: Things I Should Have Said, Worthy Publishing, January 18, 2022.[48]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Jamie_Lynn_Spears.jpg/220px-Jamie_Lynn_Spears.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Jamie_Lynn_Spears_%26_daughter_on_Double_Dare.jpg/260px-Jamie_Lynn_Spears_%26_daughter_on_Double_Dare.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b7/Pending-protection-shackle.svg/20px-Pending-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/3/3d/Jamie_Lynn_Spears.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Jamie_Lynn_Spears_Live_at_The_Texas_Club_-_3.jpg/260px-Jamie_Lynn_Spears_Live_at_The_Texas_Club_-_3.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Jamie_Lynn_Spears.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jamie_Lynn_Spears", "title": "Jamie Lynn Spears", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Jamie_Lynn_Spears.jpg/640px-Jamie_Lynn_Spears.jpg", "width": 640, "height": 882}, "title": "Jamie Lynn Spears - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}