{"url": "https://www.marieclaire.com/celebrity/a23596751/kerry-washington-november-2018-cover/", "text": "Marie Claire newsletter Celebrity news, beauty, fashion advice, and fascinating features, delivered straight to your inbox! Contact me with news and offers from other Future brands Thank you for signing up to . You will receive a verification email shortly. There was a problem. Please refresh the page and try again. By submitting your information you agree to the Terms & Conditions (opens in new tab) and Privacy Policy (opens in new tab) and are aged 16 or over.\n\n(Image credit: Thomas Whitehead)\n\nThe Santa Monica Mountains are blurred by an impenetrable fog when I arrive for a hike along Mulholland Drive in Los Angeles. It’s 6:05 a.m., and Kerry Washington rolls down the window of her Audi compact SUV. “I’m soooo sorry. It apparently doesn't open until 6:30 a.m.,” she says, “but we can chat in the car. Come in!”\n\n(Image credit: Thomas Whiteside)\n\nAll I can think is, The woman has bested nature, as I slip into the passenger seat. My feet share space with a soccer ball, and she laughs. “I’m literally a soccer mom,” she says, noting that her husband, former NFL cornerback and actor-producer Nnamdi Asomugha, bought the car for their full house, including her stepdaughter; daughter Isabelle, four; and son Caleb, two.\n\nWhen I spy a basket of snacks and cleaning wipes in the back seat, I know that this is the closest I will ever get to the notoriously private celebrity’s off-camera life. She’s managed to be the star of a network series, invited into people’s homes every week on Scandal (the show ended earlier this year (opens in new tab)), yet maintain enough of a distance at the height of her fame to secretly marry in 2013 and have her first child in 2014 without the world getting access to a single detail. That’s some Olivia Pope shit.\n\nThe Washington who slays red carpets and spent seven seasons proving that the color white was created for her makes way for off-duty Washington in a visor, a pouf of curls adding a few inches to her doll-like stature. She sports a “Still With Her” shirt, gray sweatpants, and New Balance sneakers. The only hint of glamour are princess-cut diamond studs.\n\nI am drawn to stories that I feel allow us a window into worlds we normally don’t have access to and give voice to characters that we tend to look away from as a society.\n\nAs the gates to the park open, we park, she grabs a hoodie, and we head down the trail. “This sweatshirt was in the back of my car,” she explains of her baby-blue Los Angeles Gun Club hoodie. “I had to go to gun training on Scandal. I was terrified because I don’t like guns, but I wanted to be realistic in how I held it and used it, and I felt like Olivia would know those things. I was really proud of myself having done it. I was like, ‘I’m going to buy a sweatshirt,’ but I am not a card-carrying NRA member. I believe in gun control. But it was good for me to face my fear and learn how to shoot.\"\n\nProenza Schouler dress. (Image credit: Thomas Whiteside)\n\nWashington has a way of making the simplest thing—a hoodie—feel significant. Infusing her characters, who often exist at the margins, with meaning, humanity, and realness is what makes her such a powerful actor. I’ve watched in awe as she has brought to life women from all walks of life: a young mother in high school (Save the Last Dance); a transsexual sex worker (Life Is Hot in Cracktown); one of the wives of a dictator (The Last King of Scotland); a brutalized slave (Django Unchained); a law professor breaking her silence about sexual harassment (Confirmation); and a black woman fixing white people’s problems in the nation’s capital.\n\n“I am drawn to stories that I feel allow us a window into worlds we normally don’t have access to and give voice to characters that we tend to look away from as a society, stories that make us pause and consider the other and see ourselves in the other,” Washington says. “It’s my homework to three-dimensionalize a character, which often in my career hasn’t been fully three-dimensionalized in the writing. For a lot of people, my characters may be the very few black women that they spend time with. So for me to paint her in any way flat or stereotypical or within the framework of social norms or our habits of not fully taking in women of color and walking by them—I have a responsibility to do something different.”\n\nKerry is the real deal as a producer and as an actress. She simply makes everything so much better. Reese Witherspoon\n\nHer duty to do her homework remains at her core as she embarks on the next phase of her career as a producer. Though she “kind of fell into” producing, starting with the 2016 HBO film Confirmation, about Anita Hill’s experiences regarding the 1991 Clarence Thomas Supreme Court nomination hearings, she soon realized that it was “everything” to her. Her production company, Simpson Street (the Bronx block her mother grew up on), has a slew of television and film projects on its slate, including The Mothers, a Warner Brothers film adaptation of Brit Bennett’s acclaimed novel; Universal’s workplace comedy 24-7, costarring Eva Longoria; psychological thriller The Perfect Mother; and an adaptation of Celeste Ng’s best-selling novel Little Fires Everywhere for Hulu, in which she costars alongside fellow executive producer Reese Witherspoon.\n\nJill Sander top, Bulgari earrings. (Image credit: Thomas Whiteside)\n\n“I knew it was the perfect project for us to collaborate on,” Witherspoon says. “Kerry is the real deal as a producer and as an actress. She shows up for every meeting thoroughly prepared, she has incredible ideas about the economics of every project, and she is fully invested in the creative process. She simply makes everything so much better.”\n\nThe actresses first met at a read-through. “An actor was trying to decide if he wanted to star in this movie, and he wanted other actors to read the script out loud,” recalls Witherspoon. “Turns out Kerry and I were the only ones prepared. We both memorized our lines and brought a full performance. In that moment, I realized I had met a kindred spirit.”\n\nThe Bronx native and only child of a professor mother and businessman father began performing in safe-sex sketches as a teenager, and she attended New York City’s prestigious all-girls Spence School and George Washington University in Washington, D.C. The self-proclaimed “nerdy theater kid” is returning to the stage in the Broadway play American Son. The drama, which opens November 4, is set in a Florida police station and explores race relations in America. Washington plays a mother in a mixed-race couple grappling with the disappearance of their teenage son.\n\nThe last time I did theater, it completely transformed my life. That’s where I met my husband.\n\n“Theater is a big part of why I fell in love with storytelling and with acting,” she says, “and I hadn’t been able to do it for the whole life of Scandal (opens in new tab). I love being in the room with your audience. There’s something very meditative and monastic to me about theater because in TV, every single day is different. To commit yourself to going to the same place and saying the same words and walking the same path, it’s almost like a labyrinth in a monastery or a walking meditation, where the world around you changes but you don’t. You commit to the same task at hand, and in doing that, you learn so much.”\n\nProenza Schouler dress. (Image credit: Thomas Whiteside)\n\nThen, she shares something I don’t expect: “The last time I did theater, it completely transformed my life. That’s where I met my husband.” I let this revelation linger between us, salivating at the prospect of Washington possibly sharing more about love, marriage, and family—and she goes there. “I love being with my family. My days off look like homework, reading and watching stuff. Just hanging out, doing things we love to do.” I ask her what motherhood has taught her.\n\n“Everything. My children are my teachers. There’s a writer that I love, Dr. Shefali Tsabary. She writes about conscious parenting, and her paradigm is that we think about it all wrong. We think children come into the world and it’s our job to mold them and create them and teach them who to be so that they can be the best version of themselves, but it’s actually completely upside down. We get sent by God the kids we need so we can grow in order to be the parents they need us to be. The children I got sent came in perfect, and I have to figure out how to grow and evolve so that I can support the truth of them. I’m in a constant state of learning and challenging myself to make room for their perfection and beauty.”\n\nWe take in the sun rising over Coldwater Canyon Park and pass a lone power walker who nods at Washington. The actress offers a smile and a good morning. “The first time somebody recognized me on the street, they were like, ‘Kerry.’ And I was like, ‘Hey,’ because I assumed it was maybe somebody I went to college with. This was after Save the Last Dance. And I hugged them because I assumed I knew them, and they were like, ‘I’m such a huge fan.’ And I felt so unsafe. I was like, ‘Oh, I’m now in a situation where I have no boundaries with this person, and I have no idea who they are, and I can’t do this anymore.’ It was the beginning of me learning to hold the world at arm’s length just for my own sense of safety.”\n\nI didn’t feel like I had to twist myself into some other understanding of what black womanness is supposed to look like, because Shonda [Rhimes] got me. Just her existence and working with her so intimately changed the idea of what power looked like in this business.\n\nThere’s such power in being able to set those boundaries as women, no matter if you’re famous or not. It’s the ability to make abundantly clear that the world does not have immediate access to all of you and that some things, like family, love, your sacred spaces, are for you and not for everyone. It’s then that I ask her about how she defines power.\n\n“Honestly, I think about power as more of an internal phenomenon. I tend to think about empowerment for myself so that I have the courage and ability to act on the ideologies and priorities that resonate with me,” she says. “I’ve always wanted to cultivate a sense of empowerment within myself without seeking approval from outside sources, which is hard to do as an actor, which is part of why producing is so important and which is where some of my freedom, or learning, to take that sense of freedom and bring it to a larger audience and larger space has a lot to do with having my employer be a black woman. Right? I didn’t feel like I had to twist myself into some other understanding of what black womanness is supposed to look like, because Shonda [Rhimes, Scandal creator and showrunner] got me, and so I could get closer and closer to my truth because I wasn’t worried about going to work on Monday and somebody being like, ‘Why would you talk about that?’ Just her existence and working with her so intimately changed the idea of what power looked like in this business.”\n\nThe Row top, Gucci skirt, and Bulgari earrings. (Image credit: Thomas Whiteside)\n\nScandal didn’t only mark a career milestone for Washington. It transformed television and made room for heroines who had for so long been sidelined and invisibilized on network TV. “There was more pressure in the beginning because Olivia had been the first in 40 years [Teresa Graves was the very first black female TV lead, in 1974’s Get Christie Love!], and there was a sense that if our show wasn’t a success, it could be another 40 years before anybody took the ‘risk’ to put a black woman at the center of a one-hour drama,” Washington says. “By the time our show was going off the air, you had everything from Empire to Quantico to How to Get Away With Murder to more comedies like Fresh Off the Boat and Black-ish.”\n\nHollywood hasn’t changed just on-screen; behind the camera, it’s had to deal with major ills, from sexual harassment and assault to pay disparity and issues of race and gender. Washington joined forces with Time’s Up (opens in new tab), an initiative spearheaded by women in Hollywood to combat sexual assault, harassment, and inequality in the workplace. Now, she says, they’re continuing to fundraise for its Legal Defense Fund, create new revenue streams, and figure out how to support women across all industries.“Our priority has been to not reinvent the wheel, to not feel like, ‘Oh we’re going to come in and do what nobody has been able to do,’ but rather to acknowledge that there are so many communities of powerful women committed to advocacy, and our job is to leverage whatever power we have to support that work, grow that work, shed light on that work.”\n\nOur priority has been to not reinvent the wheel, to not feel like, ‘Oh we’re going to come in and do what nobody has been able to do,’ but rather to acknowledge that there are so many communities of powerful women committed to advocacy, and our job is to leverage whatever power we have to support that work.\n\nBut Washington is clear that disparities still exist in representation and action for women of color in the industry and beyond. “It’s complicated to be a woman of color doing this work because I remember the first time I talked about it in a meeting. I said to the white women in the room, ‘You all roll your eyes when they call it a witch hunt, but for black women in this country, we’ve had our men hung from trees for whistling at white women when they did no wrong. The false accusation of sexual assault is a very real danger for us in a way that doesn’t resonate for you, and so when you wonder why there aren’t more of us in the room, that might be part of it.’ It was in that meeting that we were talking about how one of our members got word that there was a powerful exposé being developed around R. Kelly and said, ‘Do we want to get ahead of this?’ It was like, ‘Of course we do.’ It can’t be only the Angelina Jolies and the Gwyneth Paltrows, that we prioritize their pain and ignore all of these underage black women who for decades have been saying, ‘Help me.’ We came forward for them in a statement about R. Kelly, and it was Time’s Up WOC’s first big public action.”\n\n“Kerry does a beautiful job of inexorably tying her activism to her career,” says Rashida Jones, who is directing an adaptation of graphic-novel series Goldie Vance that Washington is producing under Simpson Street. “She is so intent on not being just a mouthpiece, on knowing the real intricacies of whatever it is that she supports—whether it be a cause or a candidate or tackling inequality and representation in her own industry. And when Kerry decides that something is not right, that people are not being taken care of, you better believe she will dedicate herself to fixing it. Her poise and humor is deceptive because underlying all her charm is a deep sense of what’s right and the empathy and ferocity to keep fighting for it.”\n\nPrada belted top and skirt; Ring Washington's own. (Image credit: Thomas Whiteside)\n\nWe near the end of the trail loop and catch our breath at a bench near the parking lot, and I press her to define her legacy. “I reread The 7 Habits of Highly Effective People (opens in new tab), which I think I read when I was 21, wanting to be the best version of me, and that continues today,” she responds. “There’s this exercise where you write your eulogy and imagine four people speaking at your funeral, and you write what you would want them to say. It’s not from a legacy perspective. It’s a way to begin with the end in mind so that you’re not wasting behaviors, that you’re working toward your sense of mission and vision, so that your actions can be in alignment with your values.”\n\nI ask her what she wants those four people to say: “To be a person who really sees people, to be somebody who can walk through life with a sense of presence and an openness for other people, to let them in.” She hugs and thanks me, and as she walks away, I take in the blue cloudless sky blanketing southern California. The fog has lifted, just as the star departs in her mom car.\n\n(Image credit: Marie Claire)\n\nThis article originally appears in the November 'Power' issue of Marie Claire, on newsstands October 18.\n\nLead photo: Hermès dress, Van Cleef & Arpels earrings.", "images": ["https://www.facebook.com/tr?id=756449714459937&ev=PageView&noscript=1", "https://vanilla.futurecdn.net/marieclaireus/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/H66uieYGCL3uT4syTQPbYM-1200-80.jpg", "https://www.marieclaire.com/media/img/missing-image.svg"], "top_img": "https://cdn.mos.cms.futurecdn.net/H66uieYGCL3uT4syTQPbYM-1200-80.jpg", "keywords": [], "authors": ["Janet Mock", "Julia Marzovilla", "Gabrielle Ulubay", "Iris Goldsztajn", "Mehera Bonner", "The Editors", "Andrea Park", "Katherine J Igoe", "Bianca Rodriguez", "Window.Slicecomponents"], "canonical_link": "https://www.marieclaire.com/celebrity/a23596751/kerry-washington-november-2018-cover/", "title": "Kerry Washington on Life After Scandal, Motherhood, and Her Return to Theatre", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2018-10-08T08:00:43+00:00", "description": "Kerry Washington discusses life after seven season of 'Scandal,' including her return to theatre where she met her husband, working with her production company Simpson Street, and her continued activi", "robots": "max-image-preview:large,nofollow", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://cdn.mos.cms.futurecdn.net/flexiimages/l0uowirhzd1627591128.svg", "og": {"site_name": "Marie Claire Magazine", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/H66uieYGCL3uT4syTQPbYM-1200-80.jpg", "width": 1200}, "type": "article", "title": "Kerry Washington Is So Much More Than Olivia Pope", "url": "https://www.marieclaire.com/celebrity/a23596751/kerry-washington-november-2018-cover/", "description": "After seven seasons, Olivia Pope will go down as one of the most powerful female leads in TV history. But beyond the Beltway fixer, who is Kerry Washington?"}, "article": {"publisher": "https://www.facebook.com/MarieClaire", "published_time": "2018-10-08T08:00:43Z", "modified_time": "2021-10-01T12:51:22.134Z"}, "parsely-type": "post", "parsely-post-id": "HsxSS9krApS5zVFgnBayf6", "parsely-pub-date": "2018-10-08T08:00:43Z", "parsely-title": "Kerry Washington's Next Act", "parsely-link": "https://www.marieclaire.com/celebrity/a23596751/kerry-washington-november-2018-cover/", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/4gx3vRwWvUdv5y6QRSNVSK.jpg", "parsely-section": "Celebrity", "parsely-tags": "Category: Celebrity,Category: Feature,politics,tv,celebrity,longform-article,collection_marie-claire-cover-stars,collection_deep-dives,serversidehawk", "parsely-author": "Janet Mock", "twitter": {"card": "summary_large_image", "site": "@marieclaireus", "title": "Kerry Washington Is So Much More Than Olivia Pope", "description": "After seven seasons, Olivia Pope will go down as one of the most powerful female leads in TV history. But beyond the Beltway fixer, who is Kerry Washington?", "creator": "@marieclaireus", "image": "https://cdn.mos.cms.futurecdn.net/H66uieYGCL3uT4syTQPbYM-1200-80.jpg", "account_id": 15469402}, "google-site-verification": "G8uYPAX70T_vfdmDhxnUNSykxtjRTkSvHhloGBWT6R8", "taboola": {"url": "https://www.marieclaire.com/celebrity/a23596751/kerry-washington-november-2018-cover/"}, "botify-site-verification": "gEo2ltw4ZxjJkBcaADHlIGePpMrucY2w", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E"}, "movies": [], "publish_date": 1538985643.0, "source": "https://www.marieclaire.com", "summary": ""}