{"url": "https://www.etonline.com/married-at-first-sights-nick-pendergrast-and-girlfriend-heather-yerrid-introduce-twins-born-2", "text": "Married at First Sight star Nick Pendergrast and girlfriend Heather Yerrid are new parents!\n\nThe couple welcomed twins -- daughter Layla Rea and son Logan Joseph -- on Dec. 10, two months before Yerrid's February due date, ET can confirm. The newborn siblings had to stay in the Neonatal Intensive Care Unit for 47 days before they were able to be brought home.\n\nPendergrast released a statement to ET about what he's looking forward to sharing with his adorable babies, who were welcomed at Baptist Health Louisville in Louisville, Kentucky.\n\n\"Now that they are home I am most excited for them to start crawling and developing into little humans. I’ve already started catching up on Disney movies and cartoons and can’t wait to watch them with Layla and Logan,\" the excited new dad stated. \"Oh, and of course, I can’t wait to take them golfing!\"\n\nYerrid also reflected on her new role as a mom in a statement to ET, sharing, \"When you become a mother you lose yourself. Your life is no longer your own, it belongs to your children. It’s not about you, it’s about them and that has been refreshing for me.\"\n\nEXCLUSIVE: 'Married at First Sight' Season 3 Couples Explain Why They Wanted to Wed a Stranger This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. EXCLUSIVE: 'Married at First Sight' Season 3 Couples Explain Why They Wanted to Wed a Stranger\n\n\"When you know who you are and what you stand for, being a mother comes naturally,\" she added. \"I think this is something all women should think about before having children.\"\n\nNow that she's home with her cute kids and spending every minute with them, Yerrid said she's \"most excited to see how their looks will change!\"\n\n\"I was so excited to see who they looked like when they were born. Now that they are a little older, we can all see that Logan looks like Nick and Layla looks like me!\" she explained. \"If they end up with his good looks and my personality then I’d say we made perfection.\"\n\nYerrid also opened up about her hopes for her children's future, sharing, \"My dream for Layla and Logan is to go through life having total acceptance of who they are. I want them to be comfortable in their own skin and approach life with confidence knowing that at the end of the day, their parents want them to win.\"\n\nThe happy couple -- who first shared their baby news with People -- took to Instagram to post some adorable snapshots of their new bundles of joy.\n\n\"It was hard keeping this in the dark for so long. The birth of our twins was something we chose not to share with everyone until they came home from the NICU happy and healthy,\" Pendergrast wrote on Instagram. \"I appreciate my friends and family for supporting me through this experience. Our beautiful twins, Layla Rae and Logan Joseph arrived on December 10th and we couldn’t be more tired and happy!\"\n\nPendergrast, 33, was the star of the fourth season of Lifetime's hit reality series Married at First Sight, where he tied the knot with Sonia Granados. However, their relationship didn't work out and the pair split in March 2017.\n\nSoon afterward, Pendergrast found love with Yerrid, and the couple announced they were expecting twins in July. Congrats to the happy couple!\n\nInside the Vetting Process for 'Married at First Sight' This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page.\n\nRELATED CONTENT:\n\n'Married at First Sight' Alum Nick Pendergrast Expecting Twins With Girlfriend Heather Yerrid\n\n'Married at First Sight' Stars Jamie Otis and Doug Hehner Welcome First Child!\n\n'Married at First Sight' Stars Sonia Granados and Nick Pendergrast File for Divorce\n\nRelated Gallery\n\n\n\n", "images": ["https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-08/GettyImages-1240426139.jpg?h=05c564aa&itok=Dkqb34Us", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-10/GettyImages-1243560296.jpg?h=27af8da9&itok=n9B1yPno", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2018-10/patrick_adams_troian_bellisario_royal_wedding.jpg?h=c673cd1c&itok=rrya4V2E", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-02/heather_yerrid_nick_pendergrast_1280.jpg?h=c673cd1c&itok=H_ZMaGEf", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-02/heather_yerrid_nick_pendergrast_1280.jpg?h=c673cd1c&itok=5jr6SDuZ"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-02/heather_yerrid_nick_pendergrast_1280.jpg?h=c673cd1c&itok=5jr6SDuZ", "keywords": [], "authors": ["Zach Seemayer"], "canonical_link": "https://www.etonline.com/married-at-first-sights-nick-pendergrast-and-girlfriend-heather-yerrid-introduce-twins-born-2", "title": "'Married at First Sight''s Nick Pendergrast and Girlfriend Heather Yerrid Introduce Twins Born 2 Months Early", "meta_data": {"article": {"opinion": "false"}, "apple-mobile-web-app-capable": "yes", "robots": "index", "description": "The new parents welcomed their newborn son and daughter on Dec. 10, but had to wait 47 days to take them home from the NICU.", "keywords": "News, Married at First Sight, Babies & Kids", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/married-at-first-sights-nick-pendergrast-and-girlfriend-heather-yerrid-introduce-twins-born-2", "title": "'Married at First Sight''s Nick Pendergrast and Girlfriend Heather Yerrid Introduce Twins Born 2 Months Early", "description": "The new parents welcomed their newborn son and daughter on Dec. 10, but had to wait 47 days to take them home from the NICU.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-02/heather_yerrid_nick_pendergrast_1280.jpg?h=c673cd1c&itok=5jr6SDuZ", "width": 1280, "height": 720}}, "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "twitter": {"card": "summary_large_image", "description": "The new parents welcomed their newborn son and daughter on Dec. 10, but had to wait 47 days to take them home from the NICU.", "site": {"identifier": "@etnow", "id": 23603092}, "title": "'Married at First Sight''s Nick Pendergrast and Girlfriend Heather Yerrid Introduce Twins Born 2 Months Early", "creator": "Zach Seemayer‍", "url": "https://www.etonline.com/married-at-first-sights-nick-pendergrast-and-girlfriend-heather-yerrid-introduce-twins-born-2", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-02/heather_yerrid_nick_pendergrast_1280.jpg?h=c673cd1c&itok=5jr6SDuZ"}, "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}