{"url": "https://www.billboard.com/articles/news/bbma/7801257/billboard-music-awards-2017-what-you-didnt-see", "text": "With performances from legendary divas Celine Dion and Cher, to Drake blowing up the Bellagio Fountains, to Camila Cabello making her debut solo appearance, the 2017 Billboard Music Awards was one for the books simply thanks to the superstars who took the stage. Even when there wasn’t a performer on the stage, though, Las Vegas was brimming with star-studded moments — and Billboard was in the middle of all the action.\n\nWhether it was on the magenta carpet prior to the show, in the seats, or on the Winner’s Walk backstage, Billboard had T-Mobile Arena covered with eyes peeled for some of the night’s biggest moments that cameras didn’t capture. Take a look at the 26 moments you missed below (all times local):\n\nRelated Here Is the Complete List of Winners From the 2017 Billboard Music Awards\n\n3:15 p.m. PT: Camila Cabello makes her grand exit from the magenta carpet in a flowing red dress, turning around to ask a member of her posse, “Did I kill it?”\n\n4 p.m.: The Chainsmokers sneak past the magenta carpet madness and walk through the general admission line to get into T-Mobile Arena — but not without some eager fans noticing, shouting Drew Taggart’s name, to which he smiled and waved.\n\n4:13 p.m.: As DJ Khaled and Halsey record a Snapchat together, he tells her he wants to work together. (Fingers crossed for that request to come to life…)\n\n4:19 p.m.: Khaled and Diplo snap a selfie, then Halsey gets in, stalling her interview with Billboard. Upon her arrival to Billboard‘s setup, she explains her lateness: “Sorry, Diplo kept me captive!”\n\n4:22 p.m.: Josh Duhamel and Halsey’s manager realize they’re wearing the same outfit, a maroon suit with black accents, and exchange laughs over the accidental twinning.\n\n4:59 p.m: After gathering backstage and practicing their dance moves, Nicki Minaj’s dozens of dancers start out in the center of the T-Mobile Arena crowd before making their way to join Queen Nicki onstage for her epic opening medley. As the performance goes on, the heat from Nicki’s pyro can be felt all the way up in the T-Mobile nosebleeds.\n\n5:24 p.m.: Overheard in the crowd during Camila Cabello’s debut solo performance: “Wow, she can really sing.” Also, “Whoa, she got bangs.”\n\n5:46 p.m.: Julia Michaels lets out a huge scream of relief upon exiting the stage after delivering her performance of “Issues,” running into Noah Cyrus, who reassures her she had nothing to be nervous about. “You killed it, mama!” she says, which is followed by a comment from her dad, Billy Ray Cyrus: “Amazing, amazing!”\n\n5:49 p.m.: Even though he’s not here, Ed Sheeran’s “Castle on the Hill” performance beaming in from Santiago, Chile, becomes a Sheerio sing-along in the T-Mobile Arena.\n\n6:01 p.m.: The initial excitement of rainbow-colored balloons raining on the crowd during Miley Cyrus’ “Malibu” performance is replaced by the sound of dozens of popping balloons thundering through the crowd, drowning out Miley’s voice in the room. Once the telecast goes to commercial break, the announcer instructs the crowd to pop all remaining balloons to clear them out.\n\n6:15 p.m.: Following a bouncy performance of “Green Light,” Lorde makes a rather quiet exit from the stage with her head down and a slight smirk as she passes photographers.\n\n6:31 p.m.: Ashley Tisdale gives Lea Michele a “you got this!” hug before she goes onstage to introduce Celine Dion’s performance of “My Heart Will Go On.”\n\n6:36 p.m.: Diddy poses for a backstage photo with Biggie’s son Christopher Jordan Wallace after Diddy’s touching Biggie tribute. As Diddy continues his way to the Winner’s Walk, he acknowledges the group of people he passed along the way: “Hello, everyone, hello.”\n\n6:40 p.m.: The BTS team celebrates the K-pop group’s top social artist win backstage by hugging each other, with one saying, “Oh my God, I have chills!” and another adding, “Don’t hug me, I’m about to cry!” before running to congratulate the boys as they walked offstage.\n\nWatch BTS thank fans for their Top Social Artist win at the #BBMAs https://t.co/vPikiEV0Kb pic.twitter.com/yjFmxNiNPe — billboard (@billboard) May 22, 2017\n\n7:03 p.m.: Desiigner meets BTS on the Winner’s Walk backstage and tells them he’s a big fan.\n\n7:08 p.m.: Blake Shelton is all smiles after his win for top country artist, fittingly holding a celebratory drink as he heads backstage.\n\n7:10 p.m.: Celine Dion waits to do backstage interviews so she can watch Halsey’s performance on the monitor.\n\nCeline watching Halsey. #BBMAs A post shared by Billboard (@billboard) on May 21, 2017 at 7:18pm PDT\n\n7:18 p.m.: Before Cher leads a pre-performance pep talk with her dancers, Desiigner passes by and can’t help but do about three double-takes.\n\n7:19 p.m.: Ahead of John Legend and Florida Georgia Line hitting the stage for their unlikely collaboration, a stage manager instructs the crowd to turn their cell phone flashlights on for the performance, turning the arena into a lighters-up private concert.\n\n7:25 p.m.: The rowdy BBMAs crowd gladly obliges Imagine Dragons’ Dan Reynolds when he asks for a moment of silence for late Soundgarden and Audioslave frontman Chris Cornell.\n\n7:34 p.m.: Rachel Platten can’t help busting into a passionate lip-sync as Cher sings her hit “Believe.” Simultaneously, Celine Dion begins an impromptu sing-along to “Believe” with press on the Winner’s Walk as she watches Cher perform.\n\nCeline Dion was all of us during Cher’s performance? #BBMAs pic.twitter.com/0YxevFfJe5 — billboard (@billboard) May 22, 2017\n\n7:39 p.m.: Drake makes his way to the stage with his squad (including his purple-suit-clad dad), who were, of course, all holding his Virginia Black whiskey that they later used in celebration of his top artist win.\n\n7:45 p.m.: As Florida Georgia Line chats with Billboard backstage, they gush over their performance with John Legend and how it “felt like church.”\n\n7:57 p.m.: Nicki Minaj and Lil Wayne walk down the side-stage stairs holding hands after joining Drake onstage to accept his top artist award, with Nicki exclaiming, “That was fun!”\n\n8 p.m.: Prince Michael Jackson and Drake hug it out after Prince presented Drake with the top award of the night and before Drake poses with all 13 of his awards.\n\n8:23 p.m.: Drake rolls out of the T-Mobile Arena in the back of a pickup truck, leading a caravan of vehicles from the BBMAs scene and causing pandemonium — including women running into the street.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/uploads/media/celine-dion-drake-billboard-bbma-1548.jpg?w=1024", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif", "http://static.billboard.com/files/media/BB-Promo-bbmas.jpg"], "top_img": "https://www.billboard.com/wp-content/uploads/media/celine-dion-drake-billboard-bbma-1548.jpg?w=1024", "keywords": [], "authors": ["Taylor Weatherby"], "canonical_link": "https://www.billboard.com/music/awards/billboard-music-awards-2017-what-you-didnt-see-7801257/", "title": "The 26 Things You Didn’t See on TV at the 2017 Billboard Music Awards", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "Whether it was on the magenta carpet prior to the show, in the seats, or on the Winner's Walk backstage, Billboard had T-Mobile Arena covered with eyes peeled for some of the night's biggest moments that cameras didn't capture. Take a look at the 26 moments you missed here.", "news_keywords": "BBMA", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 7801257, "author": "Taylor Weatherby", "pmc-category": "Awards,Music", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-05-22T00:28:50"}, "pmc-tag": "BBMA", "title": "The 26 Things You Didn’t See on TV at the 2017 Billboard Music Awards", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Taylor Weatherby", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 7801257, "title": "The 26 Things You Didn't See on TV at the 2017 Billboard Music Awards", "published_at": "2017-05-22 00:28:50", "image": "https://www.billboard.com/wp-content/uploads/media/celine-dion-drake-billboard-bbma-1548.jpg?w=1024", "comment_count": 0, "tags": "BBMA", "topics": "Music", "body": "With performances from legendary divas Celine Dion and Cher, to Drake blowing up the Bellagio Fountains, to Camila Cabello making her debut solo appearance, the 2017 Billboard Music Awards was one for the books simply thanks to the superstars who took the stage. Even when there wasn't a performer on the stage, though, Las Vegas was brimming with star-studded moments -- and Billboard was in the middle of all the action.Whether it was on the magenta carpet prior to the show, in the seats, or on the Winner's Walk backstage, Billboard had T-Mobile Arena covered with eyes peeled for some of the night's biggest moments that cameras didn't capture. Take a look at the 26 moments you missed below (all times local):3:15 p.m. PT: Camila Cabello makes her grand exit from the magenta carpet in a flowing red dress, turning around to ask a member of her posse, \"Did I kill it?\"4 p.m.: The Chainsmokers sneak past the magenta carpet madness and walk through the general admission line to get into T-Mobile Arena -- but not without some eager fans noticing, shouting Drew Taggart's name, to which he smiled and waved.4:13 p.m.: As DJ Khaled and Halsey record a Snapchat together, he tells her he wants to work together. (Fingers crossed for that request to come to life...)4:19 p.m.: Khaled and Diplo snap a selfie, then Halsey gets in, stalling her interview with Billboard. Upon her arrival to Billboard's setup, she explains her lateness: \"Sorry, Diplo kept me captive!\"4:22 p.m.: Josh Duhamel and Halsey's manager realize they're wearing the same outfit, a maroon suit with black accents, and exchange laughs over the accidental twinning.4:59 p.m: After gathering backstage and practicing their dance moves, Nicki Minaj's dozens of dancers start out in the center of the T-Mobile Arena crowd before making their way to join Queen Nicki onstage for her epic opening medley. As the performance goes on, the heat from Nicki's pyro can be felt all the way up in the T-Mobile nosebleeds. 5:24 p.m.: Overheard in the crowd during Camila Cabello's debut solo performance: \"Wow, she can really sing.\" Also, \"Whoa, she got bangs.\"Watch Camila Cabello's stunning live solo debut at this year's #BBMAs https://t.co/af3GXmKxVe pic.twitter.com/nEoNuH2wr1— billboard (@billboard) May 22, 20175:46 p.m.: Julia Michaels lets out a huge scream of relief upon exiting the stage after delivering her performance of \"Issues,\" running into Noah Cyrus, who reassures her she had nothing to be nervous about. \"You killed it, mama!\" she says, which is followed by a comment from her dad, Billy Ray Cyrus: \"Amazing, amazing!\"5:49 p.m.: Even though he's not here, Ed Sheeran's \"Castle on the Hill\" performance beaming in from Santiago, Chile, becomes a Sheerio sing-along in the T-Mobile Arena.6:01 p.m.: The initial excitement of rainbow-colored balloons raining on the crowd during Miley Cyrus' \"Malibu\" performance is replaced by the sound of dozens of popping balloons thundering through the crowd, drowning out Miley's voice in the room. Once the telecast goes to commercial break, the announcer instructs the crowd to pop all remaining balloons to clear them out.6:15 p.m.: Following a bouncy performance of \"Green Light,\" Lorde makes a rather quiet exit from the stage with her head down and a slight smirk as she passes photographers.6:31 p.m.: Ashley Tisdale gives Lea Michele a \"you got this!\" hug before she goes onstage to introduce Celine Dion's performance of \"My Heart Will Go On.\"6:36 p.m.: Diddy poses for a backstage photo with Biggie's son Christopher Jordan Wallace after Diddy's touching Biggie tribute. As Diddy continues his way to the Winner's Walk, he acknowledges the group of people he passed along the way: \"Hello, everyone, hello.\"6:40 p.m.: The BTS team celebrates the K-pop group's top social artist win backstage by hugging each other, with one saying, \"Oh my God, I have chills!\" and another adding, \"Don't hug me, I'm about to cry!\" before running to congratulate the boys as they walked offstage.Watch BTS thank fans for their Top Social Artist win at the #BBMAs https://t.co/vPikiEV0Kb pic.twitter.com/yjFmxNiNPe— billboard (@billboard) May 22, 20177:03 p.m.: Desiigner meets BTS on the Winner's Walk backstage and tells them he's a big fan.7:08 p.m.: Blake Shelton is all smiles after his win for top country artist, fittingly holding a celebratory drink as he heads backstage.7:10 p.m.: Celine Dion waits to do backstage interviews so she can watch Halsey's performance on the monitor. Celine watching Halsey. #BBMAsA post shared by Billboard (@billboard) on May 21, 2017 at 7:18pm PDT7:18 p.m.: Before Cher leads a pre-performance pep talk with her dancers, Desiigner passes by and can't help but do about three double-takes.7:19 p.m.: Ahead of John Legend and Florida Georgia Line hitting the stage for their unlikely collaboration, a stage manager instructs the crowd to turn their cell phone flashlights on for the performance, turning the arena into a lighters-up private concert.7:25 p.m.: The rowdy BBMAs crowd gladly obliges Imagine Dragons' Dan Reynolds when he asks for a moment of silence for late Soundgarden and Audioslave frontman Chris Cornell. 7:34 p.m.: Rachel Platten can't help busting into a passionate lip-sync as Cher sings her hit \"Believe.\" Simultaneously, Celine Dion begins an impromptu sing-along to \"Believe\" with press on the Winner's Walk as she watches Cher perform.Celine Dion was all of us during Cher's performance? #BBMAs pic.twitter.com/0YxevFfJe5— billboard (@billboard) May 22, 20177:39 p.m.: Drake makes his way to the stage with his squad (including his purple-suit-clad dad), who were, of course, all holding his Virginia Black whiskey that they later used in celebration of his top artist win.7:45 p.m.: As Florida Georgia Line chats with Billboard backstage, they gush over their performance with John Legend and how it \"felt like church.\"7:57 p.m.: Nicki Minaj and Lil Wayne walk down the side-stage stairs holding hands after joining Drake onstage to accept his top artist award, with Nicki exclaiming, \"That was fun!\"8 p.m.: Prince Michael Jackson and Drake hug it out after Prince presented Drake with the top award of the night and before Drake poses with all 13 of his awards.Drake and Prince Jackson backstage ? #BBMAs pic.twitter.com/udnSg8PXRX— billboard (@billboard) May 22, 20178:23 p.m.: Drake rolls out of the T-Mobile Arena in the back of a pickup truck, leading a caravan of vehicles from the BBMAs scene and causing pandemonium -- including women running into the street.", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "The 26 Things You Didn’t See on TV at the 2017 Billboard Music Awards", "url": "https://www.billboard.com/music/awards/billboard-music-awards-2017-what-you-didnt-see-7801257/", "description": "Whether it was on the magenta carpet prior to the show, in the seats, or on the Winner’s Walk backstage, Billboard had T-Mobile Arena covered with eyes peeled for some of the night’s bi…", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/celine-dion-drake-billboard-bbma-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Drake, Celine Dion and Dennis Graham attend the 2017 Billboard Music Awards at T-Mobile Arena on May 21, 2017 in Las Vegas."}, "locale": "en_US"}, "article": {"published_time": "2017-05-22T04:28:50+00:00", "modified_time": "2017-05-22T06:28:50+00:00"}, "twitter": {"site": "@billboard", "card": "summary_large_image", "title": "The 26 Things You Didn’t See on TV at the 2017 Billboard Music Awards", "description": "Whether it was on the magenta carpet prior to the show, in the seats, or on the Winner's Walk backstage, Billboard had T-Mobile Arena covered with eyes peeled for some of the night's biggest moments that cameras didn't capture. Take a look at the 26 moments you missed here.", "image": "https://www.billboard.com/wp-content/uploads/media/celine-dion-drake-billboard-bbma-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1495427330.0, "source": "https://www.billboard.com", "summary": ""}