{"url": "en.wikipedia.org/wiki/Kylie_Jenner", "text": "American media personality (born 1997)\n\nKylie Kristen Jenner (born August 10, 1997)[2] is an American media personality, socialite, and businesswoman. She starred in the E! reality television series Keeping Up with the Kardashians from 2007 to 2021 and is the founder and owner of cosmetic company Kylie Cosmetics. She is the the second-most-followed person on Instagram.\n\nAt age 14 in 2012, Jenner collaborated with the clothing brand PacSun, along with her sister Kendall, and created a line of clothing, Kendall & Kylie. In 2015, she launched her own cosmetics line called Kylie Lip Kits, which was renamed to Kylie Cosmetics the following year.[3] They also released a mobile app that reached number one on the iTunes App Store called Kendall and Kylie.[4]\n\nIn 2014 and 2015, Time magazine listed the Jenner sisters on their list of the most influential teens in the world, citing their considerable influence among youth on social media.[5][6] In 2017, Jenner was placed on the Forbes Celebrity 100 list, making her the youngest person to be featured on the list.[7] Jenner starred on her own spin-off series, Life of Kylie, which premiered in 2017.[8] In November 2018, New York Post credited her for being the most influential celebrity in the fashion industry.[9]\n\nIn 2019, Forbes estimated Jenner's net worth at US$1 billion and called her the world's youngest self-made billionaire at age 21;[10][11] the notion of Jenner being self-made has been controversial.[12][13] In May 2020, Forbes released a statement accusing Jenner of forging tax documents so she would appear as a billionaire.[14]\n\nEarly life\n\nKylie Kristen Jenner was born on August 10, 1997, in Los Angeles, California. The youngest daughter of former Olympic decathlete champion Caitlyn Jenner (then known as Bruce Jenner)[a][16] and television personality and businesswoman Kris Jenner (née Houghton).[17] From both of her parents' side, she is of Dutch, English, Irish, and Scottish ancestry, with some extra Welsh ancestry from her father's side.[18] Jenner has an older sister, Kendall and eight older half-siblings. [19] From Caitlyn's side of the family, she has three older half-brothers―Burt, Brandon, and Brody Jenner―and one older half-sister Cassandra Marino.[20] From Kris' side of the family, Jenner has three older half-sisters―Kourtney, Kim, Khloé―and one older half-brother Rob Kardashian.[21] Her parents divorced in 2015[22], prior to her father's transitioning into trans woman.[23]\n\nJenner attended Sierra Canyon School, where she was also a member of the cheerleading team. Jenner claims to have performed in plays while attending school, along with community plays.[24] In 2012, she became homeschooled and enrolled in an at-home education program, from which she graduated with a high school diploma in July 2015 from Laurel Springs School in Ojai, California.[25][26]\n\nCareer\n\n2007–2012: Keeping Up with the Kardashians\n\nIn 2007, Jenner, along with her parents and siblings, Kendall, Kourtney, Kim, Khloé, and Rob, began appearing in the reality television series Keeping Up with the Kardashians, which chronicles the personal and professional lives of their family members.[27] The series was successful for its network, E!, and has resulted in the creation of numerous spin-offs including Kourtney and Kim Take Miami, Khloé & Lamar, Kourtney and Kim Take New York, and Kourtney and Khloé Take The Hamptons, in which Jenner has made multiple guest appearances.[28] The sisters hosted Glee: The 3D Concert Movie at the Regency Village Theater in Westwood, Los Angeles in August 2011,[29] In 2011, they were featured in Seventeen magazine's Style Stars of the Year,[30][31] and selected them as \"Style Ambassadors\" for the magazine.[32] The two hosted the premiere of The Vow in Hollywood in February 2012.[33] The Jenners also interviewed the cast of The Hunger Games premiere in the at The Nokia Theatre in Los Angeles in March 2012.[34] Later in 2012, she starred alongside her sister Kendall and mother Kris Jenner in an episode of American reality television series America's Next Top Model.\n\n2013–2014: Early ventures\n\nThe Jenner sisters co-hosted the 2014 Much Music Video Awards, where Kylie made her acting debut in a promo for the show in Toronto, Ontario, Canada, in June 2014.[35] In August 2014, the Jenner sisters appeared in singer PartyNextDoor's \"Recognize\" music video.[36] She also appeared in Jaden Smith's music video for his song \"Blue Ocean\".[37] Jenner and her sister Kendall co-authored the dystopian science fiction novel Rebels: City of Indra: The Story of Lex and Livia, which revolved around two twin girls, Lex and Livia, in a \"self-sustaining biosphere\" put together from the remains of Earth known as Indra.[38] The novel was criticized upon release as a ghostwritten work, which prompted its ghostwriter Maya Sloan to reveal that while the Jenner sisters wrote a two-page outline for what they wanted the novel to be like, Sloan was truly responsible for the writing of the book. However, the Jenners' creative director, Elizabeth Killmond-Roman, clarified that the two had numerous Skype and FaceTime calls with Sloan to discuss the content of the novel.[39] The novel was mostly panned by critics, and sold only 13,000 copies in its first four months on sale.[40] The book was also given a sequel, Time of the Twins, which was also co-authored by the Jenner sisters.\n\n2015–2018: Rise of Kylie Cosmetics\n\nKendall (left) and Kylie Jenner, 2016\n\nThe Jenner sisters were booed while introducing brother-in-law Kanye West's performance at the Billboard Music Awards in May 2015.[41] In May 2015, an episode of Keeping Up with the Kardashians premiered in which Jenner admitted to getting a lip augmentation.[42] Her enhanced lips from lip fillers created speculation and gained her publicity. Prior to the episode's debut, Jenner stated that she merely used lip liner and over lined her lips.[43] As a result, the practice of suctioning one's lips into a small glass in order to induce greater blood flow to swell the lips was called the \"Kylie Jenner Challenge\" (though there was no indication that Jenner herself employed this method).[44] Jenner responded to this by stating, \"I'm not here to try & encourage people/young girls to look like me or to think this is the way they should look.\"[45] In August 2015, Jenner announced that she would be launching her first lipstick line as a part of her self-titled lip kit under the name Kylie Lip Kit.[46] In November 2015, the Jenner sisters appeared in singer Justine Skye's \"I'm Yours\" music video.[47]\n\nIn February 2016, Jenner's cosmetic company was renamed to Kylie Cosmetics and the number of kits produced rose from an initial 15,000 to 500,000.[48] Jenner released a three-minute-long promotional video for a series of lip glosses in March 2016, directed by Colin Tilley and starring fellow models Karin Jinsui, Mara Teigen, and Jasmine Sanders.[49][50][51][52][53] The song in the video was revealed to be \"Three Strikes\" by Terror Jr, a band created on the same day as the release of the video; however, the lead singer, who was later revealed to be singer Lisa Vatale,[54] was heavily speculated to be Jenner herself.[55][56][57][58] However, Jenner subsequently denied any involvement with the band.[59][60] In May 2016, she made her musical debut rapping on producer Burberry Perry's song \"Beautiful Day\", with Lil Yachty, Jordyn Woods, and Justine Skye.[61] The next month, Jenner starred in another PartyNextDoor's music video for his song \"Come and See Me\".[62] In April 2017, she made a surprise appearance at the Rio Americano High School prom in Sacramento alongside junior Albert Ochoa after hearing that his date had turned him down.[63][64][65]\n\nIn June 2017, Jenner was placed at number 59 on the Forbes Celebrity 100, which calculates the 100 highest-paid celebrities of the previous 12 months, after earning approximately US$41,000,000, making her the youngest person on the list at 19 years old.[7]\n\nJenner starred in a reality show revolving around her life, Life of Kylie,[66] which premiered in August 2017. On mother's day 2018, Kylie Cosmetics launched makeup line called Kris Cosmetics, in collaboration with her mother Kris Jenner.[67] Jenner and her half-sister Kim Kardashian launched their second collaboration KKW x Kylie Cosmetics collection on Black Friday 2018 after previously launched the first collection in 2017.[68] The same month, she launched Kylie Cosmetics mobile app.[69]\n\n2019–present: Debut of Kylie Skin\n\nIn April 2019, Jenner and her half-sister Kim Kardashian's KKW Beauty teamed up to launch a new fragrance. This collaboration became Jenner's first foray into fragrance and it launched on April 26.[70] Jenner founded her own skincare brand Kylie Skin which was launched on May 22.[71][72] The brand began producing dermis products, including face washes, scrubs, moisturizers and makeup removing wipes. On June 14, 2019, Kylie Cosmetics launched their collaboration with her half-sister Khloé Kardashian called Kylie Cosmetics x Koko Kollection. This marked their third collaboration after previously launched special collection of lip products called Koko Kollection in 2016 and the second part in 2017.[73] In September, Jenner announced that she was serving as the makeup artistic director for Balmain's Spring 2020 runway show at Paris Fashion Week. To celebrate the new line, Kylie Cosmetics and Balmain launched a capsule makeup collection and available on September 27, the day of the show, on the Kylie Cosmetics website. This was the first time Jenner collaborated on a makeup collection with someone outside of her family's inner circle.[74]\n\nHowever, her appearance at Paris Fashion Week was canceled because she was too ill to travel to Paris for work. News surfaced she received treatment for flu-like symptoms in a hospital, which later in March 2020 she revealed in response to a post by Instagram fan account she never had it but had a horrible strep and staph infection in the throat (bleeding from the mouth and all).[75] In October 2019, Jenner filed to trademark the phrase \"rise and shine\", a line that became a meme when footage of Jenner singing the phrase to her daughter, Stormi, went viral.[76] The hashtag #RiseandShine reached one billion views on TikTok, making it the platform's fastest-growing hashtag trend.[77] In addition to the standard \"rise and shine\", Jenner also filed to trademark \"riiise and shiiinnee\".[78] The latter trademark would cover clothing while the former would also apply to cosmetics.[79][80] The next month, Jenner sold a 51 percent stake in Kylie Cosmetics to Coty, which owns other beauty brands including Covergirl, OPI, Rimmel, GHD and Clairol for $600 million.[81]\n\nIn January 2020, Jenner announced she had trademarked Kylie Con, Kylie Kon, and Kylie Museum.[82] In the same month, her sister Kendall confirmed that a cosmetics line in collaboration with Jenner's Kylie Cosmetics was in the process. Kylie Cosmetics launched Kylie Cosmetics x Kendall Jenner on June 26, 2020.[83] Still in the same month, Jenner announced that Kylie Cosmetics will launch a Valentine's Day Collection named after Jenner's daughter, Stormi. The Stormi Collection was launched in February 1, the same day as her daughter's birthday.[84] Jenner made a cameo appearance in singers Ariana Grande and Justin Bieber's \"Stuck with U\" music video in May 2020. The following month, the Jenners sisters addressed reports that their fashion brand Kendall + Kylie has failed to pay factory workers in Bangladesh as a result of the COVID-19 pandemic. It was reported that Global Brands Group (GBG) previously listed the Kendall + Kylie brand on its website. As a result, the Jenners stated that their company is owned by a separate entity known as 3072541 Canada Inc. even though they say that their brand \"has worked with CAA-GBG in the past, in a sales and business development capacity only\" and that they \"do not currently have any relationship at all with GBG\".[85] In August 2020, Kylie Cosmetics launched Summer Sailor collection which marked the launch of Jenner's first-ever false lashes.[86] In the same month, she made a cameo in Cardi B and Megan Thee Stallion's \"WAP\" music video, alongside singers Normani and Rosalía; a petition asking that Jenner's cameo be edited out of the video reached over 65,000 signatures.[87]\n\nJenner topped the Forbes list of highest paid celebrities for 2020.[88]\n\nIn August 2021, Jenner teased Kylie Swim, a new swimwear line that includes sizes for all women.[89] On September 17, it was officially launched on Kylie Jenner's website.[90] On September 21, she announced a new skincare and hair product line for babies, called Kylie Baby.[91]\n\nIn January 2022, Jenner became the first woman to gain 300 million followers on the social network service Instagram, surpassing the previous recordholder, singer Ariana Grande.[92]\n\nPersonal life\n\nRelationships\n\nIn August 2014, Tyga was seen getting close with Jenner at her 17th birthday party. Days later, Tyga ended his relationship with Blac Chyna, his fiancée and the mother of his son.[93][94] In 2015, when she turned 18, Jenner and Tyga made their relationship official.[95][96] Jenner subsequently made appearances in two of Tyga's music videos, \"Stimulated\" and \"Dope'd Up\".[97] In April 2017, Jenner and Tyga broke up.[98]\n\nIn April 2017, Jenner was first seen with Travis Scott at Coachella.[99] On February 1, 2018, Jenner gave birth to their daughter, Stormi Webster.[100][101] Jenner appeared in the music video for \"Stop Trying to Be God\", from Scott's third studio album Astroworld.[102] They broke up in September 2019,[103][104] but quarantined together during the COVID-19 pandemic for the sake of their daughter and ended up rekindling their relationship.[105][106] On September 7, 2021, after weeks of speculation, Jenner revealed that she and Scott were expecting their second child.[107][108] Jenner gave birth to their son, Wolf Webster, on February 2, 2022.[109][110]\n\nFriendship with Jordyn Woods\n\nIn 2012, Jenner and Jordyn Woods met through their mutual friend, Jaden Smith, son of Hollywood actor Will Smith and actress Jada Pinkett Smith.[111] They were close friends for many years, with Woods appearing in Jenner's 2017 reality TV show, Life of Kylie,[112] and Jenner's 2018 pregnancy video. In September 2018, Kylie Cosmetics launched the Kylie x Jordyn collection, a collaboration between the two friends.[113] Their friendship ended in 2019 as a result of Woods cheating with Tristan Thompson, who was the fiancé of Jenner's half-sister Khloé Kardashian.[114] Jenner discontinued her Woods-named lip kit, cutting the price to eliminate remaining inventory.[115]\n\nControversies\n\nKendall + Kylie \"Rock vs. Rap\" collection\n\nOn June 28, 2017, the Jenner sisters announced that they would be releasing a line of vintage T-shirts for their Kendall + Kylie line of clothing called Rock vs. Rap,[116][117] featuring the likenesses of various rock and rap artists[118] including The Notorious B.I.G., Tupac Shakur, Metallica, Pink Floyd, The Doors, Ozzy Osbourne, and Led Zeppelin, with pictures of the Jenner sisters superimposed over them.[116] The announcement of this line of products was met with swift backlash from relatives and representatives of the figures depicted on the shirts themselves, including Sharon Osbourne,[119] Jim Jampol,[120] and Voletta Wallace, mother of Biggie Smalls.[121] They were also criticized on social media and were called \"insensitive.\"[122] Wallace, The Doors' manager and the estate of Jim Morrison issued a cease-and-desist letter to the Jenner sisters, writing that they did not authorize the sisters' use of the likenesses of these musical icons.[123][124] The Jenners apologized for the shirts, and pulled them from retail.[116]\n\nForbes cover\n\nJenner appeared on the cover of the August 2018 issue of Forbes. The magazine claimed she had a net worth of $900 million and that she was on the verge of becoming the youngest \"self-made\" billionaire.[125] This would beat Mark Zuckerberg, who became a billionaire at age 23.[126] However, the publication's use of the term \"self-made\" sparked widespread criticism and jokes online.[127] Critics argued that Jenner was already born into fame and fortune.[128] Some discussions took a more serious tone, with journalists writing pieces on wealth distribution, inequality and inheritance, as well as upward mobility in society.[129][130][131] However, celebrities such as Jenner's half-sister Kim Kardashian and socialite Paris Hilton have come out and defended Jenner, legitimizing assertions that she is indeed self-made, while Hilton who was born into the Hilton family also described herself as self-made.[132][133]\n\nIn May 2020, Forbes released a statement accusing Jenner of forging tax documents so she would appear as a billionaire.[14] The publication also accused her of fabricating revenue figures for Kylie Cosmetics.[14] The same day, Jenner responded in a series of tweets, writing: \"What am I even waking up to? I thought this was a reputable site... All I see are a number of inaccurate statements and unproven assumptions lol. I've never asked for any title or tried to lie my way there EVER. Period\". Jenner's attorney also demanded that Forbes retract the statements, calling the magazine's accusations \"unequivocally false\". Forbes reacted, stating that they spent months uncovering the facts and concluded that their \"extensively-reported investigation was triggered by newly-filed documents that revealed glaring discrepancies between information privately supplied to journalists and information publicly supplied to shareholders\".[134] However, Jenner became the youngest person on Forbes's list of 100 Richest Self-Made Women in October 2020. She is the only person on the list in her 20s, and is worth $700 million.[135]\n\nCultural appropriation\n\nJenner has been accused of appropriating African-American culture and style.[136] In 2016, Jenner was criticized for posting a photograph of herself wearing cornrows on Instagram.[137] In June 2017, urban streetwear brand PluggedNYC accused Jenner of stealing their designs for her collection of camouflage swimwear.[138]\n\nUnderpaying factory workers\n\nRemake, a non-profit labeled Global Brands Group as the manufacturer for the Kendall + Kylie clothing line.[139] The organization claimed that money was being withheld from workers in the factories despite having finishing their work. The organization also reported them firing workers in Los Angeles, affecting over fifty-thousand works.[140] She received criticism for this on multiple platforms, with fans asking her to pay her workers.[141] In response to this, the clothing line said that Kendall + Kylie was not owned by Global Brands Group.[142]\n\nEndorsements\n\nJenner being interviewed for Nip + Fab in 2015\n\nJenner has two nail lacquers from the Nicole by OPI nail polish brand called Wear Something Spar-kylie and Rainbow in the S-kylie.[143] Jenner and her sister Kendall earned $100,000 each for their OPI endorsements in 2013.[144] On November 15, 2013, the Jenner sisters announced that they would launch The Kendall & Kylie Collection with PacSun[145] which launched in February 2013. Since its conception, the sisters have released several collections for this line. In July 2013, the Jenner sisters launched a jewelry line with Pascal Mouawad's Glamhouse[146][147] to create the Metal Haven by Kendall & Kylie jewelry collection.\n\nIn February 2014, she and Kendall launched a shoe and handbag line for Steve Madden's Madden Girl line.[148][149] Jenner launched a line of hair extensions through a partnership with Bellami Hair, called Kylie Hair Kouture, in October 2014.[150][151][152] She became skincare brand Nip + Fab's second-ever ambassador in March 2015.[153] In June 2015, the Jenner sisters launched their clothing line Kendall + Kylie with British fashion retailer Topshop.[154] This Topshop clothing line also featured swimsuits.[155] In September 2015, the Jenner sisters launched their personalized website and mobile app, called Kendall and Kylie.[156]\n\nJenner partnered with nail polish brand Sinful Colors and launched 20 pieces nail polish collection in 2016. In fall the same year, Jenner was announced to be the new face of PUMA along with Rae Sremmurd.[157] In 2017, Jenner became the face of Beats Headphones special edition collection in collaboration between Apple and Balmain.[158] Jenner collaborated with Melbourne-based sunglasses brand Quay Australia[159][160] to release a line of sunglasses, Quay x Kylie. This collaboration was launched in June 2017.[161][162][163] She endorsed Calvin Klein along with her sisters in 2018. In the same year she signed a deal with Adidas to become their ambassador. Jenner also had endorsed hair vitamin SugarBearHair, Waist Gang Society waist trainer, monthly beauty subscription service Boxycharm, detox tea Fit Tea and Fashion Nova.[164] In 2018, Jenner reportedly made $1 million per sponsored Instagram post, making her the highest paid individuals on Instagram in 2018. The next year Jenner reportedly made $1.2 million per sponsored Instagram post, remaining her as the highest paid individuals on Instagram for the second year in a row.[165]\n\nLawsuits and civil disputes\n\nVlada Haggarty\n\nIn January 2017, make-up artist Vlada Haggarty claimed that Jenner had stolen the creative style and aesthetic of her own work, such as the dripping gloss lip and golden finger tips, for her own products, and that Jenner had a history of taking Haggerty's original dripping lip art and passing it off as her own. Jenner later credited Vlada on social media and her work on the creation of the logo and an undisclosed settlement was paid to avoid any future legal issues.[166][167][168]\n\n\"Kylie\" trademark\n\nIn February 2017, Australian singer Kylie Minogue won a legal battle against Jenner for name trademark \"Kylie\". Jenner had filed a U.S. trademark application for use of the name \"Kylie\" for \"advertising services\" and \"endorsement services\" in 2015.[169]\n\nNeon lip logo\n\nSara Pope, a British painter whose work has been featured in art galleries in several cities across the globe, filed a lawsuit against Jenner and NBC Universal for the use of a neon lip logo. Pope stated that Jenner posted to her social media accounts an image that was remarkably similar to Pope's most famous piece, \"Temptation Neon\" and used it to promote Jenner's TV series Life of Kylie. TMZ reported that the production art created for the series, including the lip design, was created by a third party designer.[170]\n\nSeed Beauty\n\nSeed Beauty filed a lawsuit against Coty and Kylie Cosmetics, alleging that Coty has purchased $600 million in Kylie Cosmetics stock from Jenner as a subterfuge to learn trade secrets.[171]\n\nPhilanthropy\n\nJenner in 2017\n\nJenner set up an eBay account where she auctions old clothing to raise money for the Children's Hospital Los Angeles.[172] She joined her sisters Khloé and Kendall, along with Lil Twist, and The Game at PINZ bowling alley in Studio City, California for a charity bowling game on January 19, 2014. The event was held to raise money for The Robin Hood Foundation, a nonprofit for which The Game pledged to raise $1 million in donations.[173] The Jenner sisters participated in singer Chris Brown's two Kick'n It For Charity Celebrity Kickball games in Glendale, California on July 19, 2014[174] and on August 16, 2014.[175] At the first game, she competed on actor/singer Quincy Brown's team.\n\nIn December 2015, Jenner made a donation of Christmas gifts to the Los Angeles LGBT Teen Center.[176] In January 2017, Jenner donated $10,000 to her then-friend Jordyn Woods to help cover memorial costs for Woods's father after he died from cancer.[177] On her birthday in the same year, Jenner announced on her Instagram she donated $500,000 from sales of her Birthday Collection to Teen Cancer America, an organization to help hospital and outpatient facilities develop special units for teens with cancer.[178] Jenner is an ambassador for Smile Train, a charity that funds surgery for children with cleft lips and palates. She became one of the organization's youngest ambassadors. Jenner visited Peru with Smile Train on an episode of Life of Kylie. In 2016, Jenner launched a special-edition lip kit called \"Smile\", and donated $159,500 to Smile Train to fund cleft lip and palate surgeries for 638 deserving children.[179] In September 2019, during her appearance on The Ellen DeGeneres Show, Jenner donated $750,000 to the founder and members of a feminist organization in Florida called Nest of Love, which is dedicated to mentoring young women, helping low-income kids in the community, and promoting female empowerment.[180]\n\nIn January 2020, Jenner gave a total of $1 million to five organisations in Australia to help tackle the bushfires.[181] In March 2020, Jenner, her mother Kris, along with beauty company Coty donated over 6,000 pounds of hand sanitizers to Southern California hospitals to help health care workers fighting the COVID-19 pandemic. Jenner also donated $1 million to buy face masks, face shields, and other protective gear for health-care professionals who work on the front lines.[182]\n\nFilmography\n\nTelevision\n\nMusic videos\n\nFilm\n\nAs an actress Year Title Role Notes Ref. 2018 Ocean's 8 Herself Cameo [200]\n\nAwards and nominations\n\nSee also\n\nNotes\n\n^ [15] Kris is Kylie's cisgendered mother. Caitlyn transitioned from male to female in 2015.", "images": ["http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Kendall_%26_Kylie_Jenner_interview.png/260px-Kendall_%26_Kylie_Jenner_interview.png", "https://upload.wikimedia.org/wikipedia/commons/6/65/Kylie_Jenner_in_2021.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Kylie_Jenner_Vogue.png/170px-Kylie_Jenner_Vogue.png", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Kylie_Jenner1_%28cropped%29.png/220px-Kylie_Jenner1_%28cropped%29.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Kylie-Jenner-autograph.png/150px-Kylie-Jenner-autograph.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Kylie_Jenner_in_2021.jpg/220px-Kylie_Jenner_in_2021.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Kylie_Jenner_for_Nip_%2B_Fab.jpg/220px-Kylie_Jenner_for_Nip_%2B_Fab.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Wikibooks-logo-en-noslogan.svg/16px-Wikibooks-logo-en-noslogan.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/6/65/Kylie_Jenner_in_2021.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Kylie_Jenner", "title": "Kylie Jenner", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/6/65/Kylie_Jenner_in_2021.jpg", "width": 640, "height": 799}, "title": "Kylie Jenner - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}