{"url": "https://www.usatoday.com/story/news/politics/2018/09/05/kim-kardashian-visits-white-house-prison-reform-meeting/1201179002/", "text": "Kim Kardashian visits Donald Trump's White House for prison reform meeting\n\nWASHINGTON – Celebrity sighting at the White House: Kim Kardashian arrived Wednesday for a meeting on prison reform.\n\nThe reality television star had also planned to lobby President Donald Trump about a pardon or clemency for a Tennessee man serving a lifetime prison sentence on drug charges.\n\nThe administration hosted \"a listening session about the clemency process,\" Trump spokesman Hogan Gidley said, with the discussion \"mainly focused on ways to improve that process to ensure deserving cases receive a fair review.\"\n\nAfter her meetings, Kardashian tweeted that \"it's time for REAL systemic change\" in way prisoners are sentenced and treated.\n\nTrump frees Alice Johnson after Kim Kardashian West plea President Trump granted clemency to Alice Marie Johnson, a 63-year-old woman sentenced to life in prison. The move comes a week after Trump met with Kim Kardashian West, who became involved in Johnson’s case after viewing a viral video last year. Just the FAQs\n\nKardashian has attended at least one other prison reform meeting at the Trump White House. She spoke last year with senior adviser and presidential son-in-law Jared Kushner, who also hosted Wednesday's session.\n\nThe White House guest list included Kim Kardashian West; she is married to rap singer and record producer Kanye West.\n\nMark Osler, a University of St. Thomas law professor and an expert on sentencing and clemency who also attended the meeting, called it “a serious, engaged discussion of the clemency process involving people from very different perspectives.”\n\n“I am encouraged about real work being done to fix something that is broken and important,” he said.\n\nJessica Sloan Jackson, co-founder of the criminal justice reform group Cut 50, said the agenda for the meeting was to work on improving the slow, bureaucratic and opaque system for vetting clemency cases, Jackson said.\n\nKardashian made important contributions to the discussion among the law professors, advocates and White House officials, Jackson said.\n\n“Kim is an incredible advocate in this space,” she said. “I’ve never seen somebody immerse themselves in an issue the way she has,” she said.\n\nKardashian, the daughter of famed defense attorney Robert Kardashian, championed the case of Alice Marie Johnson, a 62-year-old grandmother whom Trump freed earlier this year. Since then, Jackson said, she’s stayed involved in the issue and has visited prisons to learn more.\n\nIn her tweet, Kardashian said, \"it started with Ms. Alice, but looking at her and seeing the faces and learning the stories of the men and women I’ve met inside prisons I knew I couldn’t stop at just one.\"\n\nIt started with Ms. Alice, but looking at her and seeing the faces and learning the stories of the men and women I’ve met inside prisons I knew I couldn’t stop at just one. It’s time for REAL systemic change pic.twitter.com/kdKr8s6lJW — Kim Kardashian West (@KimKardashian) September 5, 2018\n\nAlso attending the meeting: Presidential adviser and first daughter Ivanka Trump, whose focus in the White House has been on building job skills.\n\n“I think this is one thing that set today's conversation apart,” Jackson said. “They’re interested in not just granting clemency, but making sure those who are granted clemency succeed when they come home.”\n\nEarlier this year, Kardashian went to the White House to lobby for a pardon for Alice Marie Johnson; Trump eventually granted clemency to Johnson, a 63-year-old woman who spent more than two decades in prison on drug charges.\n\nMore: 'It’s so unfair': Kim Kardashian working to free another convicted felon serving life\n\nTMZ, which first reported Kardashian's latest White House trip, said she is seeking a pardon or clemency for Chris Young, who is serving life in a Tennessee prison for cocaine and marijuana possession.", "images": ["https://www.gannett-cdn.com/presto/2018/09/05/USAT/3ad0fd87-cbd0-47e8-95a5-1c7265968f31-AP_-Trump-Kardashian.JPG?crop=2820,2104,x59,y0?width=320&height=240", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/presto/2018/09/05/USAT/3ad0fd87-cbd0-47e8-95a5-1c7265968f31-AP_-Trump-Kardashian.JPG?auto=webp&crop=2999,1683,x0,y0&format=pjpg&width=1200", "http://www.gannett-cdn.com/-mm-/1ce5a4e3b8df141f9aca9646638c4d6e3f1b6839/c=0-0-2999-1694&r=1280x720/local/-/media/2018/05/30/USATODAY/USATODAY/636632995724309155-AP--Trump-Kardashian-100251753.JPG", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/presto/2018/09/05/USAT/3ad0fd87-cbd0-47e8-95a5-1c7265968f31-AP_-Trump-Kardashian.JPG?auto=webp&crop=2999,1683,x0,y0&format=pjpg&width=1200", "keywords": [], "authors": ["David Jackson", "Gregory Korte"], "canonical_link": "https://www.usatoday.com/story/news/politics/2018/09/05/kim-kardashian-visits-white-house-prison-reform-meeting/1201179002/", "title": "Kim Kardashian visits Donald Trump's White House for prison reform meeting", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/news/politics/2018/09/05/kim-kardashian-visits-white-house-prison-reform-meeting/1201179002/news/politics", "theme-color": "#ffffff", "og": {"type": "article", "title": "Kim Kardashian visits Donald Trump's White House for prison reform meeting", "description": "Reality television star Kim Kardashian shows up at the White House for a meeting on prison reform. The reality television star is also hoping to speak with President Donald Trump about a pardon or clemency for a Tennessee man serving a lifetime prison sentence on drug charges.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/09/05/USAT/3ad0fd87-cbd0-47e8-95a5-1c7265968f31-AP_-Trump-Kardashian.JPG?auto=webp&crop=2999,1683,x0,y0&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Reality television star Kim Kardashian shows up at the White House for a meeting on prison reform. The reality television star is also hoping to speak with President Donald Trump about a pardon or clemency for a Tennessee man serving a lifetime prison sentence on drug charges.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1536102000.0, "source": "https://www.usatoday.com", "summary": ""}