{"url": "en.wikipedia.org/wiki/Margot_Robbie", "text": "Australian actress and producer (born 1990)\n\nMargot Elise Robbie ( ; born 2 July 1990) is an Australian actress and producer. Known for her roles in both blockbusters and independent films, she has received several accolades, including nominations for two Academy Awards, three Golden Globe Awards, and five British Academy Film Awards. Time magazine named her one of the 100 most influential people in the world in 2017 and she was ranked as one of the world's highest-paid actresses by Forbes in 2019.\n\nBorn and raised in Queensland, Robbie began her career on the television series Neighbours (2008–2011, 2022) and Pan Am (2011–2012). Her breakthrough came in 2013 with the black comedy film The Wolf of Wall Street. She achieved wider recognition with starring roles as Jane Porter in The Legend of Tarzan (2016) and Harley Quinn in the DC superhero films Suicide Squad (2016), Birds of Prey (2020) and The Suicide Squad (2021).\n\nRobbie received critical acclaim and a nomination for the Academy Award for Best Actress for her portrayal of disgraced figure skater Tonya Harding in the biopic I, Tonya (2017). This acclaim continued with her roles as Queen Elizabeth I in the period drama Mary Queen of Scots (2018), Sharon Tate in the comedy-drama Once Upon a Time in Hollywood (2019), and a fictional Fox News employee in the drama Bombshell (2019); she received BAFTA Award nominations for all three and a nomination for the Academy Award for Best Supporting Actress for the lattermost.\n\nRobbie is married to filmmaker Tom Ackerley. They are co-founders of the production company LuckyChap Entertainment, under which they have produced several films, including Promising Young Woman (2020), as well as the television series Dollface (2019–2022) and the miniseries Maid (2021).\n\nEarly life and education\n\nMargot Elise Robbie was born on 2 July 1990 in Dalby, Queensland, to Doug Robbie, a former farm-owner and sugarcane tycoon, and Sarie Kessler, a physiotherapist.[1] She is the second youngest of four; older siblings Anya and Lachlan and younger brother Cameron.[2] Her parents separated when she was five.[3] Robbie and her siblings were raised by their single mother and had minimal contact with their father. The family lived on a farm belonging to her grandparents in the Gold Coast hinterland.[4] An energetic child, Robbie often put on shows in her house.[5]\n\nShe was enrolled in a circus school by her mother, where she excelled in trapeze, in which she received a certificate at age eight.[6] In high school, Robbie studied drama at Somerset College.[7] As a teenager, she worked three jobs simultaneously: she tended a bar, cleaned houses, and worked at Subway.[8][9] After graduation, with only a few commercials and independent thriller films on her résumé, Robbie relocated to Melbourne to begin acting professionally.[10]\n\nCareer\n\n2008–2015: Early work and breakthrough\n\nRobbie's first acting roles came during high school, when she starred in two low-budget independent thriller films, called Vigilante and I.C.U., both released years later. She described the experience of being on a film set as \"a dream come true\".[11] She made her television debut in a 2008 guest role as Caitlin Brentford in the drama series City Homicide and followed this with a two-episode arc in the children's television series The Elephant Princess, in which she starred alongside Liam Hemsworth.[12]\n\nWith the encouragement from her agent at the time, Robbie auditioned for the television soap opera Neighbours. In June 2008, she began playing Donna Freedman, a role that was meant to be a guest character, but Robbie was promoted to the regular cast after she made her debut.[13] In her three-year stint on the soap, she received two Logie Award nominations.[14] Shortly after arriving in America, Robbie landed the role of Laura Cameron, a newly trained flight attendant in the period drama series Pan Am (2011). The series premiered to high ratings and positive reviews but was cancelled after one season due to falling ratings.[15][16]\n\nRobbie made her feature film debut in Richard Curtis' romantic comedy About Time (2013), co-starring Domhnall Gleeson and Rachel McAdams. It tells the story of a young man with the ability to time travel who tries to change his past in hopes of improving his future. To play Gleeson's unattainable teenage love interest, she adopted a British accent.[17] The film was a modest critical and commercial success, with a reviewer for Variety praising the cast, while also criticising the stock characters as being too familiar.[18][19]\n\nRobbie's breakthrough came the same year with the role of Naomi Lapaglia, the wife of protagonist Jordan Belfort in Martin Scorsese's biographical black comedy The Wolf of Wall Street. Co-starring Leonardo DiCaprio as Belfort, the film recounts his perspective on his career as a stockbroker in New York City and how his firm engaged in rampant corruption and fraud on Wall Street, which led to his downfall. In her audition for the role, Robbie improvised a slap on DiCaprio during a fight scene which ultimately won her the part.[20] The film and her performance received positive reviews; she was particularly praised for her on-screen Brooklyn accent.[21] Critic Sasha Stone wrote of Robbie's performance, \"She's Scorsese's best blonde bombshell discovery since Cathy Moriarty in Raging Bull. Robbie is funny, hard and kills every scene she's in.\"[22] The Wolf of Wall Street was a box office success, grossing $392 million worldwide, making it Scorsese's highest-grossing film to date.[23] Robbie was nominated for the MTV Movie Award for Best Breakthrough Performance and won the Empire Award for Best Newcomer.[24] With the aim to produce more female-driven projects, Robbie and her future husband Tom Ackerley and their respective longtime friends, Sophia Kerr and Josey McNamara, started their own production company LuckyChap Entertainment. The company was founded in 2014 and its name was inspired by Charlie Chaplin.[3]\n\nRobbie appeared in four films released in 2015. The first of these was opposite Will Smith in Glenn Ficarra and John Requa's $158.8 million-grossing romantic comedy-drama film Focus. In the film, she played an inexperienced grifter learning the craft from Smith's character; she learned how to pickpocket from Apollo Robbins for the role.[25][26] Reviews of the film were generally mixed, but Robbie's performance was praised; Peter Travers of Rolling Stone wrote, \"Robbie is wow and then some. Even when Focus fumbles, [she] deals a winning hand.\"[27] She was nominated for the Rising Star Award at the 68th British Academy Film Awards.[28] Her next appearance was alongside Michelle Williams and Kristin Scott Thomas in Saul Dibb's war romantic drama Suite Française, a film based on the second part of Irène Némirovsky's 2004 novel of the same name. In the film, she played a woman falling for a German soldier during the German occupation of France during World War II, a role which Leslie Felperin of The Hollywood Reporter found \"underwritten\".[29]\n\nShe followed this with Craig Zobel's post-apocalyptic drama Z for Zachariah opposite Chris Pine and Chiwetel Ejiofor, in her first leading role. Partially based on Robert C. O'Brien's book of the same name, the film follows Ann Burden (Robbie) as she finds herself in an emotionally charged love triangle with the last known survivors of a disaster that wipes out most of civilization. In preparation for the film, Robbie dyed her hair brown and learned to speak in an Appalachian accent.[30] The film received positive reviews, and Robbie's performance was widely praised, with Drew McWeeny of HitFix asserting that \"Robbie's work here establishes her as one of the very best actresses in her age range today.\"[31][32] Her fourth release of 2015 was a cameo appearance in Adam McKay's comedy-drama The Big Short, in which she breaks the fourth wall to explain subprime mortgages while in a bathtub. The Big Short was a commercial and critical success and Robbie's cameo became a trending topic six years later, in the wake of the GameStop short squeeze, as her explanation provided reference points for what was happening with the GameStop and related stocks.[33]\n\n2016–2018: Worldwide recognition\n\nIn 2016, Robbie reunited with Ficarra and Requa, playing a British war correspondent in the film adaptation of The Taliban Shuffle called Whiskey Tango Foxtrot, co-starring Tina Fey and Martin Freeman. The comedy-drama was a commercial failure, though it was a modest critical success.[34][35] Later that year, Robbie took on the part of Jane Porter in David Yates's adventure film The Legend of Tarzan. She was adamant about not losing weight and ensuring the role was not a damsel in distress like in previous Tarzan adaptations: \"I definitely didn't want her to be a damsel in distress, and I just wanted her to be actively finding a way out of the situation. I didn't want her to be sitting around waiting for someone to come save her but also to be, in the meantime, fixing the problem herself.\"[36] Reviews of the film were generally unfavourable,[37] but Manohla Dargis of The New York Times credited Robbie for \"holding her own\" in her supporting role alongside the all-male cast with Alexander Skarsgård and Samuel L. Jackson. Dargis further praised the film by writing, \"What makes it more enjoyable than a lot of recycled stories of this type is that the filmmakers have given Tarzan a thoughtful, imperfect makeover.\"[38]\n\nRobbie became the first person to portray DC Comics villain Harley Quinn in live-action when she signed on to David Ayer's 2016 superhero film Suicide Squad alongside an ensemble cast that included Will Smith, Jared Leto and Viola Davis. She admitted to having never read the comics, but felt a huge responsibility to do the character justice and satisfy the fans.[39] Robbie began preparing for the role of the supervillainess six months prior to the film shoot; her schedule consisted of gymnastics, boxing, aerial silk training and learning how to hold her breath underwater for five minutes. She performed the majority of her own stunts in the film.[40] Suicide Squad was a commercial success and was tenth-highest-grossing film of 2016 with global revenues of $746.8 million, and Robbie's performance was considered its prime asset.[41] Writing for Time, Stephanie Zacharek found Robbie to be \"a criminally appealing actress, likable in just about every way\" despite finding flaws in the character[42] and Christopher Orr of The Atlantic called her performance \"genuinely terrific\".[43] At the annual People's Choice Awards ceremony, she won the Favorite Action Movie Actress award and was also awarded the Critics' Choice Movie Award for Best Actress in an Action Movie.[44][45] In October 2016, Robbie hosted the season 42 premiere of NBC's late-night sketch comedy Saturday Night Live; her appearances included a parody of Ivanka Trump.[46] The series logged its strongest season premiere ratings in eight years.[47] Robbie collaborated with Domhnall Gleeson in Simon Curtis' Goodbye Christopher Robin (2017), a biographical drama about the lives of Winnie-the-Pooh creator A. A. Milne and his family. The film, and her performance, received modest reviews and was a commercial failure.[48][49]\n\nI, Tonya in 2018 Robbie at the Australian premiere ofin 2018\n\nHer final release of 2017 and LuckyChap Entertainment's first release was Craig Gillespie's sports black comedy I, Tonya, based on the life of American figure skater Tonya Harding (Robbie) and her connection to the 1994 assault on rival Nancy Kerrigan. In preparation, Robbie met with Harding, watched old footage and interviews of her, worked with a voice coach to speak in Harding's Pacific Northwest accent and vocal timbre at different ages, and underwent several months of rigorous skating instruction with choreographer Sarah Kawahara.[50][51] I, Tonya premiered at the 2017 Toronto International Film Festival to critical acclaim.[52] James Luxford of Metro deemed it Robbie's best performance to date, and Mark Kermode of The Observer wrote, \"Like the jaw-dropping triple-axel jump that made champion figure skater Tonya Harding famous, Margot Robbie's performance in this satirical, postmodern tale of the disgraced star is a tour-de-force tornado that balances finely nuanced character development with impressively punchy physicality. [...] Robbie never puts a foot wrong as the proud Portland outsider\".[53][54] She received numerous accolades for her performance, including nominations for an Academy Award, a BAFTA Award, a Golden Globe Award, a Screen Actors Guild Award and a Critics' Choice Movie Award, all for Best Actress.[55] She became the first actress to receive an Oscar nomination for portraying a real-life Olympic athlete.[56]\n\nRobbie began 2018 with the voice role of Flopsy Rabbit in Peter Rabbit, a computer-animated comedy from director Will Gluck, which is based on the Beatrix Potter book series. The animated feature was a box office success, grossing $351.3 million worldwide against a production budget of $50 million.[57] Her next two 2018 films—the neo-noir thriller Terminal and comedy-horror Slaughterhouse Rulez—were critical and commercial failures, but Robbie's performance in the former was praised, with Jeffrey M. Anderson of The San Francisco Examiner writing, \"Robbie is a bright one, and even though Terminal isn't much, it offers a chance to watch her shine.\"[58]\n\nThe historical drama Mary Queen of Scots, directed by Josie Rourke, was her final release of 2018. The film featured Saoirse Ronan as the titular character and Robbie as her cousin Queen Elizabeth I, and it chronicles the 1569 conflict between their two countries. Robbie had initially turned down the role for being \"terrified\" of not living up to the history of portrayals of the Queen.[59] Before each day of shooting, she spent three hours in the make-up chair while a prosthetic nose, painted on boils and blisters were applied.[60] The film premiered at the annual AFI Fest, to mostly mixed reviews; critics dismissed the film for its screenplay and several historical inaccuracies, but praised the performances of Robbie and Ronan and their chemistry.[61] Yolanda Machado of TheWrap wrote, \"[B]ow down to Ronan and Robbie for taking two legendarily complex characters, [...] and completely owning both roles. Ronan's fiery Mary and Robbie's emotionally complex Elizabeth truly reign divine on screen.\"[62] For her portrayal, Robbie received nominations for a BAFTA Award and for a Screen Actors Guild Award.[63]\n\n2019–present: Established actress\n\nRobbie's first release of 2019 was the LuckyChap Entertainment production Dreamland, a poorly received period crime thriller set during the 1930s Dust Bowl.[64] In the same year, she starred as Sharon Tate alongside Leonardo DiCaprio and Brad Pitt in Quentin Tarantino's comedy-drama Once Upon a Time in Hollywood, with Robbie being Tarantino's only choice to play the late actress.[65] With the Tate-LaBianca Murders serving as a backdrop, the film tells the story of a fading character actor (DiCaprio) and his stunt double (Pitt) as they navigate New Hollywood in 1969 Los Angeles.[66] Feeling \"an enormous sense of responsibility\", Robbie prepared for the role by meeting Tate's family members and friends, watching all of her films and reading the autobiography by Tate's then-husband, Roman Polanski.[67] Once Upon a Time in Hollywood premiered at the 2019 Cannes Film Festival to critical acclaim, and was a commercial success with a worldwide gross of $374.3 million.[68] Despite many criticising Robbie's lack of lines in the film,[69] Robbie Collin of The Daily Telegraph highlighted a scene with Robbie in the cinema, which he found to be the film's \"most delightful\" scene.[70]\n\nAlso in 2019, she starred as Kayla Pospisil, a composite character based on several Fox News employees, in Jay Roach's drama Bombshell. Co-starring Charlize Theron and Nicole Kidman, the film recounts stories of various female personnel at the news network and their reports of sexual harassment by the network's chairman Roger Ailes.[71] Robbie based her character's accent on Katherine Harris.[72] The film received positive reviews;[73] Kenneth Turan of the Los Angeles Times wrote, \"Robbie [is] at her best, the arc of her story is so crushing that it stays with you the longest.\"[74] For her performances in Once Upon a Time in Hollywood and Bombshell, she received double nominations for the BAFTA Award for Best Actress in a Supporting Role and the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture, and for the latter she received nominations for an Academy Award, a Golden Globe and a Screen Actors Guild Award; all in the Best Supporting Actress category.[75]\n\nRobbie began the new decade by reprising the role of Harley Quinn in Cathy Yan's Birds of Prey. Determined to make a female ensemble action film, she pitched the idea for the film to Warner Bros. in 2015. Robbie spent the subsequent three years developing the project under her production company, making a concerted effort to hire a female director and screenwriter.[76] Birds of Prey, along with Robbie's performance, gained generally positive reviews;[77][78][79] Ian Freer of Empire wrote that \"the MVP is Robbie, who lends Harley charming quirk and believable menace, hinting at Harley's inner life without reams of dialogue.\"[80] She received two nominations at the 46th People's Choice Awards.[81]\n\nRobbie served as a producer on Promising Young Woman (2020), a comedy thriller by writer-director Emerald Fennell. It starred Carey Mulligan as a woman who seeks to avenge the death of her best friend, who was a victim of rape. The film premiered at the 2020 Sundance Film Festival to critical acclaim,[82][83] later receiving a nomination for the Academy Award for Best Picture.[84] In 2021, Robbie reprised her voice role as Flopsy Rabbit in Will Gluck's Peter Rabbit 2: The Runaway, released a year later due to the COVID-19 pandemic. The film received mixed reviews and grossed $153.8 million worldwide.[85][86] She also made her third outing as Harley Quinn in the standalone sequel to Suicide Squad, called The Suicide Squad, written and directed by James Gunn. Due to the COVID-19 pandemic, the film was simultaneously released theatrically and on the streaming service HBO Max. Owen Gleiberman praised Robbie's \"delectable performance\" in it.[87] In 2022, Robbie reprised her role as Donna Freedman for the final episode of Neighbours.[88]\n\nUpcoming projects\n\nRobbie will next star in David O. Russell's ensemble period comedy Amsterdam and play a silent film actress in Damien Chazelle's drama Babylon, co-starring Brad Pitt.[89] Both films are scheduled for 2022 releases.[90][91] She will portray the titular fashion doll in Greta Gerwig's 2023 romantic comedy Barbie opposite Ryan Gosling.[92] Robbie has committed to join the ensemble cast of Wes Anderson's film Asteroid City; produce and star in Bad Monkeys, an adaptation of Matt Ruff's thriller novel of the same name; and portray Maid Marian in an upcoming Robin Hood-inspired biographical film.[93][94][95] She will feature in Justin Kurzel's war thriller Ruin opposite Matthias Schoenaerts and take on a leading role in a female-led reboot of the Pirates of the Caribbean franchise.[96][97] Robbie is re-uniting with Bombshell’s Jay Roach and Ryan Gosling for a new film in the Ocean's franchise, which she will star in and also produce.[98][99]\n\nPersonal life\n\nRobbie moved from Melbourne to Williamsburg, Brooklyn in the early 2010s.[100] During that period, she became an avid ice hockey fan, supporting the New York Rangers, and played right wing in an amateur ice hockey league.[101][102] Despite significant media attention, Robbie rarely discusses her personal life.[103][104]\n\nRobbie met British assistant director Tom Ackerley on the set of Suite Française in 2013.[105] In 2014, she moved to London with Ackerley and LuckyChap Entertainment co-founders Sophia Kerr and Josey McNamara. Later that year, Robbie and Ackerley began a romantic relationship.[3][106] They married in December 2016 in Australia,[107] and reside in Venice Beach, California.[105]\n\nOther work\n\nRobbie has been a vocal supporter of human rights, women's rights, gender equality and LGBT rights. Through LuckyChap Entertainment, she and her co-founders focus on promoting female stories from female storytellers, whether it would be writers, directors, producers or all the above.[108] In 2014, she was part of a fundraising event in support of the Motion Picture & Television Fund, which helps people in the film and television industries with limited or no resources; she joined the same event on two other occasions, in 2018 and 2020.[109] In 2015, she helped raise $12 million through the BGC Global Charity Day fundraising event, which donates money to different charities around the world.[110] In 2016, Robbie joined other celebrities and UN Refugee Agency staff in a petition aiming to gather public support for the growing number of families forced to flee conflict and persecution worldwide.[111] Later in the year, she joined Oxfam's \"I Hear You\" project, which was designed to amplify the personal stories of the world's most vulnerable refugees and donated more than $50.000 to UNICEF's \"Children First\" campaign, in support of refugee children.[112]\n\nIn October 2016, while hosting Saturday Night Live, Robbie made a stand for same-sex marriage in her native Australia wearing a T-shirt that read \"Say 'I Do' Down Under\", with a map of the country in rainbow colours. A year later, she joined fellow actor Chris Hemsworth in advocating for the same purpose.[113] In 2018, she pledged to support the Time's Up initiative to protect women from harassment and discrimination.[114] In April 2021, Robbie was announced as the recipient of the inaugural RAD Impact Award, for inspiring purpose with her philanthropy. She chose to share the prize with Youngcare, a charity she had previously worked with, and therefore an impact donation was made to fund a project benefiting young people with extensive care needs.[115]\n\nPublic image\n\nRobbie in 2019\n\nRobbie is known for starring in both high-profile, mainstream productions and low-budget independent films, in which she has been able to display both her dramatic and comedic range.[116][117][118][119][120]\n\nFor her role in The Wolf of Wall Street, Vanity Fair named her one of its breakthrough actors of 2013.[121] In 2017, she appeared on the annual Forbes 30 Under 30 list, a compilation of the brightest young entrepreneurs, innovators and game changers in the world and was included on a similar list compiled by The Hollywood Reporter.[122][123] That same year, Time named her one of the 100 most influential people in the world; her The Wolf of Wall Street director Martin Scorsese penned the article in the magazine, referring to Robbie as having \"a unique audacity that surprises and challenges and just burns like a brand into every character she plays. [...] Margot is stunning in all she is and all she does, and she will astonish us forever.\"[124] In 2019, Forbes ranked her among the world's highest-paid actresses, with annual earnings of $23.5 million, and The Hollywood Reporter listed her among the 100 most powerful people in entertainment.[125][126] In 2021, she was named one of the 100 most influential women in entertainment by The Hollywood Reporter.[127]\n\nVogue has named her \"one of the most glamorous starlets\" and she was ranked as one of the best-dressed women in 2018 and 2019 by luxury fashion retailer Net-a-Porter.[128][129] In 2014 and 2016, she featured on AskMen's Top 99 Women, ranking among the top ten each year.[130][131] Also in 2016, Robbie was placed at number one on FHM's \"100 Sexiest Women in the World\" list.[132] Since 2016, she has been chosen as the ambassador for brands such as Calvin Klein, Nissan and Chanel.[133] She was the last brand ambassador picked by Karl Lagerfeld before his death in February 2019.[134]\n\nFilmography and awards\n\nAccording to the review aggregator site Rotten Tomatoes, Robbie's most critically acclaimed films are About Time (2013), The Wolf of Wall Street (2013), Z for Zachariah (2015), Suite Française (2015), Whiskey Tango Foxtrot (2016), I, Tonya (2017), Mary Queen of Scots (2019), Bombshell (2019), Once Upon a Time in Hollywood (2019), Birds of Prey (2020), and The Suicide Squad (2021).[135]\n\nRobbie has received two Academy Award nominations: Best Actress for I, Tonya (2018) and Best Supporting Actress for Bombshell (2019).[136][137] She has also been nominated for five British Academy Film Awards, four Golden Globes and five Screen Actors Guild Awards.[138][139][140] Robbie has won two AACTA Awards: Best International Lead Actress for I, Tonya and Best International Supporting Actress for Mary, Queen of Scots (2019).\n\nReferences\n\nFurther reading", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Margot_Robbie_%28cropped%29.jpg/170px-Margot_Robbie_%28cropped%29.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Margot_Robbie_by_Gage_Skidmore.jpg/170px-Margot_Robbie_by_Gage_Skidmore.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Margot_Robbie_at_%22Once_Upon_A_Time_In..._Hollywood%22_Photocall_in_Berlin_2019_%28cropped%29.jpg/170px-Margot_Robbie_at_%22Once_Upon_A_Time_In..._Hollywood%22_Photocall_in_Berlin_2019_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg/1200px-Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/13px-Wikiquote-logo.svg.png", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Margot_Robbie_2019_by_Glenn_Francis_%28cropped%29.jpg/170px-Margot_Robbie_2019_by_Glenn_Francis_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/29/SYDNEY%2C_AUSTRALIA_-_JANUARY_23_Margot_Robbie_arrives_at_the_Australian_Premiere_of_%27I%2C_Tonya%27_on_January_23%2C_2018_in_Sydney%2C_Australia_%2825980751148%29_%28cropped%29.jpg/170px-thumbnail.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg/220px-Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg/1200px-Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Margot_Robbie", "title": "Margot Robbie", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg/640px-Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg", "width": 640, "height": 958}, "title": "Margot Robbie - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}