{"url": "https://en.wikipedia.org/wiki/The_Assassination_of_Gianni_Versace:_American_Crime_Story", "text": "Second season of American Crime Story\n\nSeason of television series\n\nThe Assassination of Gianni Versace: American Crime Story is the second season of the FX true crime anthology television series American Crime Story. The season premiered on January 17, 2018,[1][2] and concluded on March 21, 2018. In 9 episodes,[3] the series explores the murder of designer Gianni Versace by spree killer Andrew Cunanan, based on Maureen Orth's book Vulgar Favors: Andrew Cunanan, Gianni Versace, and the Largest Failed Manhunt in U.S. History.[2][4] The series stars Édgar Ramírez, Darren Criss, Ricky Martin, and Penélope Cruz.\n\nThe season received positive reviews from critics, with praise for most of the performances. At the 70th Primetime Emmy Awards, it received the most nominations with nine, and won three awards, including Outstanding Limited Series and Outstanding Lead Actor in a Limited Series or Movie for Criss.[5]\n\nCast [ edit ]\n\nMain [ edit ]\n\nSpecial guest stars [ edit ]\n\nRecurring [ edit ]\n\nGuest [ edit ]\n\nEpisodes [ edit ]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nThe Assassination of Gianni Versace: American Crime Story was picked up on October 18, 2016, and was announced as the third season of the series, following the season about Katrina.[2] The announcement also revealed that English author Tom Rob Smith would be the writer of multiple episodes of the season, including the first two,[2] while executive producer Ryan Murphy would be directing the season premiere.[6] Following the airing of the first season's finale in April 2016, it was revealed that series creators Scott Alexander and Larry Karaszewski would not be returning for the second season.[16]\n\nIn June 2017, it was announced that Katrina would not begin production until early 2018 and that Versace would air in early 2018, replacing Katrina as the show's official second installment.[17]\n\nOn October 2, 2017, American Horror Story actor Matt Bomer was announced as the director of the eighth episode, making it his directorial debut.[18] During its production, the working title of the season was American Crime Story: Versace/Cunanan.[19][20]\n\nIn December 2017, after the first public screening, it was revealed that Versace would have nine episodes,[3] despite being originally reported to consist of ten episodes.[2]\n\nCasting [ edit ]\n\nIn February 2017, Édgar Ramírez and Darren Criss joined the cast of The Assassination of Gianni Versace as Gianni Versace and Andrew Cunanan, respectively.[21] Murphy confirmed the reports announcing Lady Gaga would portray Donatella Versace in The Assassination of Gianni Versace were false;[22][23] Penélope Cruz was later cast in the role.[24] In April 2017, it was announced that Ricky Martin was joining the cast of The Assassination of Gianni Versace as Antonio D'Amico, Versace's longtime partner.[25] On April 28, 2017, Annaleigh Ashford was seen filming on the set of The Assassination of Gianni Versace with Criss.[26] On June 21, 2017, it was announced through Entertainment Weekly that Ashford's role in the series would be as Elizabeth Cote, a friend of Cunanan's since high school, while Nico Evers-Swindell would play her husband, Philip Merrill.[27]\n\nOn May 5, 2017, Murphy announced via his Instagram account that Max Greenfield joined the casting, by publishing a photo of Greenfield and Criss on the set.[28] On June 21, 2017, it was announced that Finn Wittrock will star in The Assassination of Gianni Versace, playing Jeffrey Trail, Cunanan's first victim.[29]\n\nIn November 2017, the official Twitter account for the series revealed that Judith Light and Dascha Polanco are part of the cast.[30][31] In December 2017, the official webpage for the series released cast and character bios revealing that Max Greenfield would play Ronnie, whilst confirming the casting of Judith Light as Marilyn Miglin, Dascha Polanco as Detective Lori Wieder, Jon Jon Briones as Modesto Cunanan, Cody Fern as David Madson, and Mike Farrell as Lee Miglin.[32]\n\nFilming [ edit ]\n\nAccording to multiple set reports and photos, principal photography of season 2 took place at the beginning of May 2017, in Miami and Reggio Calabria.[33] As revealed by Darren Criss via his Twitter account, shooting ended during the week of November 13.[34]\n\nPromotion [ edit ]\n\nIn September 2017, FX released the first promotional teaser for The Assassination of Gianni Versace, showing doves sitting outside Versace's former mansion and flying away when two gunshots ring out.[35] A second teaser was released that same month, depicting Versace's sister Donatella placing flowers on a casket.[36] In October, a third teaser was released, depicting some police radio communications as a black clothes cover, with the name Versace on it, is being closed.[37] The same month, a fourth teaser was released, showing Donatella kissing the stairs where Gianni was murdered, before entering in his mansion.[38] On Halloween day, FX aired a new promotional video during a commercial break of the ninth episode of American Horror Story: Cult, which announced that the season would premiere on January 17, 2018.[1]\n\nIn November 2017, four new teasers were released. The first showed Versace relaxing next to his pool, as Cunanan comes out of it.[39] The second depicts D'Amico leaving Gianni's house, as he hears two gunshots (the unseen murder) and runs to see what happened; while a voice-over by Ricky Martin as D'Amico says that he was Gianni's partner and lover.[40] The third shows Donatella and Gianni hugging and watching themselves in front of a mirror, as the latter tells his sister that she would be Versace without him.[41] The fourth depicts a running sewing machine, which ends up having some issues and not being able to finish its work.[42]\n\nOn November 15, 2017, the first full trailer for the season was released via the Twitter account of the series. It shows moments from Cunanan's unstable past and the first aftermaths of Versace's assassination.[43] The same day, it was announced that the first episode of the season would be available five days before the official premiere for FX+ subscribers.[6] On November 28, 2017, FX released a new short trailer depicting the main cast of the season: Cruz, Ramírez, Martin and Criss; while a voice-over by Criss as Cunanan reveals how he feels the same as Versace.[44]\n\nIn December 2017, more teasers were released. The first opposed Versace and Cunanan as they speak about themselves and their pasts.[45] The second featured a Versace fashion show where models start crying, as news reports about the designer's death are heard.[46] The third showed Cunanan trying to convince someone that he really has a date with Versace, while the scene is being cut by shots of the assassination and its aftermaths.[47] The fourth one features Donatella Versace in a black dress for her brother's funeral;[48] the fifth showed different rooms of Versace's mansion, with multiple voice-overs by different characters;[49] and the sixth featured a showering Cunanan, surrounding his face with duct tape, as Max Greenfield's Ronnie asks him what he is doing.[50] On December 28, a first look at the series was released, with interviews from the crew and the cast.[51] That same day, a new teaser was also released, depicting Criss-as-Cunanan about to kill his sexual partner and then Versace.[52]\n\nAt the start of January 2018, a new teaser was released. It featured Criss-as-Cunanan changing the license plate of his car and greeting a young girl, while a voice-over is saying that the police are looking for him and that he is very dangerous.[53] On January 16, 2018, the full red band trailer was released,[54] and a short version premiered the next day.[55]\n\nReception [ edit ]\n\nReviews [ edit ]\n\nThe second season of American Crime Story received generally positive reviews from critics. The review aggregator Rotten Tomatoes gave the season an approval rating of 89% based on 97 reviews, with an average rating of 7.09/10. The site's critical consensus reads, \"The Assassination of Versace starts with a bang and unfurls slowly, moving backward through an intricate (and occasionally convoluted) murder mystery anchored by a career-defining performance from Darren Criss.\"[56] On Metacritic, the season has a score of 74 out of 100, based on 35 critics, indicating \"generally favorable reviews.\"[57]\n\nReaction from individuals involved [ edit ]\n\nIn January 2018, the Versace family released a statement criticizing the series. They explained they have \"neither authorized nor had any involvement whatsoever\" in the production of the season, before adding that it \"should only be considered as a work of fiction.\"[58] Executive producer Ryan Murphy answered that the series was \"not a work of fiction\" as it is based on a non-fiction book, Maureen Orth's Vulgar Favors, and that the production team and FX stand by the author and her work. Comparing it to The People v. O. J. Simpson, Murphy added that the season is \"a work of non-fiction obviously with docudrama elements,\" and not a documentary.[58] Following this answer, the Versace family released a second statement, still slamming the series as \"a work of fiction\" because \"the Orth book itself is full of gossip and speculation.\" They also heavily criticized Orth's work, calling it an \"effort to create a sensational story\" with \"second-hand hearsay that is full of contradictions.\" They gave the example of Gianni Versace's medical condition, as Orth claims that Versace was HIV positive at the time of his death.[59]\n\nAntonio D'Amico also criticized the series, deeming some scenes as \"ridiculous\" and insisting that \"so much has been fictionalized\". He also revealed that he does not plan to watch it, but that he would have been happy if Ricky Martin, who plays his role, got in contact to get some insight into his relationship with Versace.[60]\n\nAccording to Ryan Murphy, Donatella Versace was very supportive that Penélope Cruz played her role. As Cruz and Versace are friends, Murphy explained that, when he offered her the role, Cruz asked the permission of Versace before agreeing to do it. He also revealed that, while Cruz was representing the series at the 75th Golden Globe Awards, Versace \"very graciously sent [her] a lovely and huge flower arrangement saying 'good luck.'\"[58]\n\nRatings [ edit ]\n\nAccolades [ edit ]\n\nNotes [ edit ]\n\n^ [6] This episode was available five days before the official premiere for FX+ subscribers.", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/4/46/American_Crime_Story_season_2_poster.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/4/46/American_Crime_Story_season_2_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Assassination_of_Gianni_Versace:_American_Crime_Story", "title": "The Assassination of Gianni Versace: American Crime Story", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/4/46/American_Crime_Story_season_2_poster.jpg", "width": 640, "height": 960}, "title": "The Assassination of Gianni Versace: American Crime Story - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}