{"url": "https://www.hollywoodreporter.com/live-feed/timeless-canceled-again-at-nbc-1112294", "text": "Timeless has been canceled a second time at NBC.\n\nThe network has decided to cancel the beloved time-travel drama from producers Sony Pictures Television Studios. Sources say the studio and NBC are continuing talks for a potential two-hour movie to wrap up the finale cliffhanger. The series, which saw the network stunningly reverse its cancellation after its freshman run, had been in negotiations between Sony TV and NBC.\n\nWhile not a ratings breakout, Timeless averages a 1.2 in the key adults 18-49 demo and nearly 5 million total viewers with seven days of delayed viewing; the May 13 season two finale ticked up slightly (though it did not best its season average). The Shawn Ryan and Eric Kripke drama has maintained a loyal — and vocal — fanbase. Ryan tweeted July 2 that Sony informed producers that efforts to find a new home for Timeless have failed.\n\n“@SPTV has notified @TheRealKripke and me that efforts to land #Timeless at another network have sadly failed. While Sony will continue to look at any and all options, actor deals have expired and it appears there will be no season three or beyond,” he wrote. “Discussions still take place between @SPTV and @NBC about a possible two-hour movie to conclude the #Timeless story, but there are considerable economic obstacles that make it an uncertainty. We will update you when we know more. @TheRealKripke, me, the cast, writers & crew of #Timeless want to send our immense thanks and gratitude to all the #ClockBlockers who fought so hard for this show. You made a second season possible and gave us hope for a season three. We wish the news was better. We love you all.”\n\nThe news comes after the options on the show’s cast expired. Should NBC and Sony TV agree to a movie, the indie studio would have to ink its stars to new deals — again. The cast all had to renegotate their contracts after season one was canceled to address the short-order renewal for season two.\n\nLast year, Timeless was saved from cancellation after Sony TV gave up 50 percent of the show’s ownership stake to NBC’s Universal Television. With the drama starring Abigail Spencer and Matt Lanter already a co-production, a new pact had to be hammered out.\n\nThe decision comes after Timeless — like a handful of other bubble shows — opted to end its season with a massive cliffhanger.\n\nRyan took to Twitter on Friday to share his thoughts on the cancellation and hope for a wrap-up movie. “This is a sad day for the writers, actors, crew and especially the viewers of Timeless. We are all extremely proud of what we made and know that it was more than just a show for so many of our fans. It became a passion and a cause for many of them,” he wrote in the first of a series of tweets. “We’re proud of the impact @NBCTImeless had on so many people — the students who embraced history as a result of our show, the people who were inspired by our stories of inclusion and acceptance. We saw your tweets and were inspired by you. If NBC is sincere in wanting a two-hour movie to give much needed closure to our amazing @NBCTimeless fans, we are ready to make it. We don’t want the journeys of Lucy, Wyatt, Rufus and the others to end yet.”\n\nThe cancellation comes as yet another blow for Sony TV. While known for fighting to land new homes for its programming, the indie studio is fresh off a disappointing upfront season in which the studio landed only one new series on the broadcast networks: ABC’s The Goldbergs spinoff, Schooled. The season’s slam-dunk pickup was considered to be the Sony TV drama L.A.’s Finest, a Bad Boys spinoff starring Gabrielle Union and Jessica Alba. NBC passed on that and the studio’s Norman Lear comedy. L.A.’s Finest is now being eyed as the first scripted series at cable unit Charter Communications.\n\nIn a May 18 interview with The Hollywood Reporter, Sony TV topper Jeff Frost said the studio had begun preliminary discussions about finding a potential new home for Timeless should NBC pass on a third-season pickup. “In the event that it doesn’t go forward, we have a number of conversations going on with a number of interested parties,” he said. “We really hope that NBC sees the light. If they don’t, we are very anxious to try set it up some place else.”\n\nKripke on Friday addressed Sony TV’s efforts to find a new home for the drama. “Behind the scenes, Sony has been trying hard to set it up elsewhere, but no luck so far. I think this two-hour movie is our best shot. We’re ready to make it if @nbc really wants it. Let ’em know how you feel,” he wrote, adding in a subsequent tweet that he will keep his “personal thoughts about network TV private until we get this movie made.” Kripke, who like Ryan has an overall deal at Sony TV, next has Amazon Studios’ comic book drama The Boys in the works.\n\nNBC has a 2018-19 roster of dramas including returning shows The Blacklist, Blindspot, Law & Order: SVU, all three Chicago shows, This Is Us, Good Girls and Midnight, Texas and new hourlongs The InBetween, Manifest and The Village.\n\nKeep track of all the renewals, cancellations and new show orders with THR‘s scorecards for ABC, CBS, Fox, NBC and The CW and of all the latest pilot pickups and passes with our handy guide. For complete coverage, bookmark THR.com/upfronts.\n\nUpdate, July 2: This story has been updated to reflect Ryan’s tweets that Sony could not find a new home for the show.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "http://www.hollywoodreporter.com/sites/default/files/custom2/Banners/THR_upfronts-embeds2x.png", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/nup_182363_0408_-_h_2018.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/nup_182363_0408_-_h_2018.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/timeless-canceled-again-at-nbc-1112294/", "title": "‘Timeless’ Canceled (Again) at NBC", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "'Timeless' canceled again at NBC, may get a two-hour movie.", "news_keywords": "NBC, Timeless, Upfronts", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1112294, "title": "'Timeless' Canceled (Again) at NBC", "published_at": "2018-06-22 08:07:22", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/nup_182363_0408_-_h_2018.jpg?w=1024", "comment_count": 0, "tags": "Upfronts", "topics": "TV News", "body": "Timeless has been canceled a second time at NBC.\r\nThe network has decided to cancel the beloved time-travel drama from producers Sony Pictures Television Studios. Sources say the studio and NBC are continuing talks for a potential two-hour movie to wrap up the finale cliffhanger. The series, which saw the network stunningly reverse its cancellation after its freshman run, had been in negotiations between Sony TV and NBC. \r\nWhile not a ratings breakout, Timeless averages a 1.2 in the key adults 18-49 demo and nearly 5 million total viewers with seven days of delayed viewing; the May 13 season two finale ticked up slightly (though it did not best its season average). The Shawn Ryan and Eric Kripke drama has maintained a loyal — and vocal — fanbase. Ryan tweeted July 2 that Sony informed producers that efforts to find a new home for Timeless have failed. \r\n\"@SPTV has notified @TheRealKripke and me that efforts to land #Timeless at another network have sadly failed. While Sony will continue to look at any and all options, actor deals have expired and it appears there will be no season three or beyond,\" he wrote. \"Discussions still take place between @SPTV and @NBC about a possible two-hour movie to conclude the #Timeless story, but there are considerable economic obstacles that make it an uncertainty. We will update you when we know more. @TheRealKripke, me, the cast, writers & crew of #Timeless want to send our immense thanks and gratitude to all the #ClockBlockers who fought so hard for this show. You made a second season possible and gave us hope for a season three. We wish the news was better. We love you all.\"\r\nThe news comes after the options on the show's cast expired. Should NBC and Sony TV agree to a movie, the indie studio would have to ink its stars to new deals — again. The cast all had to renegotate their contracts after season one was canceled to address the short-order renewal for season two. \r\nLast year, Timeless was saved from cancellation after Sony TV gave up 50 percent of the show's ownership stake to NBC's Universal Television. With the drama starring Abigail Spencer and Matt Lanter already a co-production, a new pact had to be hammered out.\r\n\r\nThe decision comes after Timeless — like a handful of other bubble shows — opted to end its season with a massive cliffhanger. \r\nRyan took to Twitter on Friday to share his thoughts on the cancellation and hope for a wrap-up movie. \"This is a sad day for the writers, actors, crew and especially the viewers of Timeless. We are all extremely proud of what we made and know that it was more than just a show for so many of our fans. It became a passion and a cause for many of them,\" he wrote in the first of a series of tweets. \"We’re proud of the impact @NBCTImeless had on so many people — the students who embraced history as a result of our show, the people who were inspired by our stories of inclusion and acceptance. We saw your tweets and were inspired by you. If NBC is sincere in wanting a two-hour movie to give much needed closure to our amazing @NBCTimeless fans, we are ready to make it. We don't want the journeys of Lucy, Wyatt, Rufus and the others to end yet.\"\r\nThe cancellation comes as yet another blow for Sony TV. While known for fighting to land new homes for its programming, the indie studio is fresh off a disappointing upfront season in which the studio landed only one new series on the broadcast networks: ABC's The Goldbergs spinoff, Schooled. The season's slam-dunk pickup was considered to be the Sony TV drama L.A.'s Finest, a Bad Boys spinoff starring Gabrielle Union and Jessica Alba. NBC passed on that and the studio's Norman Lear comedy. L.A.'s Finest is now being eyed as the first scripted series at cable unit Charter Communications. \r\n\r\nIn a May 18 interview with The Hollywood Reporter, Sony TV topper Jeff Frost said the studio had begun preliminary discussions about finding a potential new home for Timeless should NBC pass on a third-season pickup. \"In the event that it doesn't go forward, we have a number of conversations going on with a number of interested parties,\" he said. \"We really hope that NBC sees the light. If they don't, we are very anxious to try set it up some place else.\"\r\nKripke on Friday addressed Sony TV's efforts to find a new home for the drama. \"Behind the scenes, Sony has been trying hard to set it up elsewhere, but no luck so far. I think this two-hour movie is our best shot. We're ready to make it if @nbc really wants it. Let 'em know how you feel,\" he wrote, adding in a subsequent tweet that he will keep his \"personal thoughts about network TV private until we get this movie made.\" Kripke, who like Ryan has an overall deal at Sony TV, next has Amazon Studios' comic book drama The Boys in the works.\r\nNBC has a 2018-19 roster of dramas including returning shows The Blacklist, Blindspot, Law & Order: SVU, all three Chicago shows, This Is Us, Good Girls and Midnight, Texas and new hourlongs The InBetween, Manifest and The Village.\r\nKeep track of all the renewals, cancellations and new show orders with THR's scorecards for ABC, CBS, Fox, NBC and The CW and of all the latest pilot pickups and passes with our handy guide. For complete coverage, bookmark THR.com/upfronts.\r\nUpdate, July 2: This story has been updated to reflect Ryan's tweets that Sony could not find a new home for the show.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Timeless’ Canceled (Again) at NBC", "url": "https://www.hollywoodreporter.com/tv/tv-news/timeless-canceled-again-at-nbc-1112294/", "description": "‘Timeless’ canceled again at NBC, may get a two-hour movie.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/nup_182363_0408_-_h_2018.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-06-22T08:07:22+00:00", "modified_time": "2018-07-02T12:26:07+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Timeless’ Canceled (Again) at NBC", "description": "‘Timeless’ canceled again at NBC, may get a two-hour movie.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/nup_182363_0408_-_h_2018.jpg?w=1280"}}, "movies": [], "publish_date": 1529654842.0, "source": "https://www.hollywoodreporter.com", "summary": ""}