{"url": "https://www.cnn.com/2018/02/13/entertainment/miss-america-cara-mund-email-scandal/index.html", "text": "CNN —\n\nA little over three months after Cara Mund was crowned Miss America, a scandal rocked the organization.\n\nEmails were leaked from the organization’s CEO, Sam Haskell, in which he commented on the weight and sexual activity of former winners of the pageant. Haskell resigned, along with two more high level executives.\n\nMund is speaking out about the controversy for the first time in an interview to CNN. She also discussed the organization’s future with former Miss America Gretchen Carlson now at the helm, her support for the #MeToo movement and her political aspirations.\n\nWhat went through your mind when you read the leaked emails?\n\n“It’s unfortunate and I kept thinking, what was said about me? That shouldn’t be the first thing I have to worry about, but then I knew at the same time there are all these young girls looking up [to me], and I’m there to uphold morale, and I’m there to let them know that the future of Miss America, we’ve got another 100 years after this. It’s difficult, you never want to have that said about yourself, about your fellow sisters but you can just get stronger from it.”\n\nGretchen Carlson, former Miss America 1989, has been tapped to run the organization and essentially turn things around. What are your thoughts on her as the new leader?\n\n“Growing up, I was always admiring different Miss Americas but I think Gretchen Carlson has always been one of my favorites because she is a well-educated woman. She went to Stanford. She was from the Midwest, just like me. I think it’s great to have a female in the role leading a women’s empowerment organization. I think she is highly qualified for the job. She’s going to be able to push us further on, and I can’t wait to see where Miss America is going to go next.”\n\nHow do you make sure things like that don’t happen again within an organization like Miss America?\n\n“I think accountability. What’s amazing is that this organization is there to empower women. At the end of the day, it was the Miss Americas who had the courage to stand up and say this wasn’t right, we need to change this. The mission of the organization … came full circle and we are giving women that power to take back what’s theirs.”\n\nYou are at a pivotal time, representing the country as a strong female leader in the midst of a national reckoning. Have you thought about how you’ll use your platform to support the #MeToo movement?\n\n“This is so important as Miss America that I serve as a voice for those that may not be heard … I’m here to say we need to stand in solidarity. We need to support these women. There’s other women out there that haven’t had the opportunity to be heard, but we are going to make sure we do something to change what’s going on … I’m not just here to wear a crown and sash and smile and wave, but I’m here to make an impact. I’m going to do what I can – if that’s lobbying on Congress, if that’s testifying, whatever it is that I need to do.”\n\nYou’ve said you’d like to run for political office one day?\n\n“I would love to be the first female governor of North Dakota. I would just love to see equal representation between men and women in Congress. Issues that are going on right now are things that are affecting both genders and when I sat at the State of the Union, I remember looking out and I was having a hard time finding the women. Women only represent about 20 percent [of Congress] and we are equal in population. So, I don’t know why we aren’t having our voice heard at an equal level.”\n\nYou’re from a state that nearly all voted for Donald Trump, is there a misconception in the media of ‘Trump Country’?\n\n“I think at the end of the day, we are all similar more than we are different. Before we are Republicans or Democrats, we are Americans. We all have this goal of making our country the best that we can.”\n\nWhat are your thoughts on Donald Trump’s proposal to build a wall?\n\n“I don’t think the issue of immigration is necessarily a structural one. I think it’s a political one, and I think it would be a waste of funding. There are so many other issues in the United States that could use that funding, and I don’t think that’s going to solve the problem by just building a wall.”\n\nWhat are your thoughts on same sex marriage?\n\n“I don’t think who you love can be determined by a piece of legislation. It’s not a legislative issue. It’s a personal issue, and I don’t think it’s right for a governing body to tell you who you can and cannot love.”\n\nWould you like to add or take away a portion of the Miss America pageant?\n\n“I would like to see is more of the interview portion featured on the telecast.”\n\nThis interview has been edited and condensed for clarity.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/170126173139-chloe-melas.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/170911144321-miss-america.jpg?q=x_0,y_235,h_1688,w_3000,c_crop/w_800"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/170911144321-miss-america.jpg?q=x_0,y_235,h_1688,w_3000,c_crop/w_800", "keywords": [], "authors": ["Chloe Melas"], "canonical_link": "https://www.cnn.com/2018/02/13/entertainment/miss-america-cara-mund-email-scandal/index.html", "title": "Miss America Cara Mund on the organization's recent email controversy", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Reigning Miss America Cara Mund addresses the organization's recent email controversy | CNN", "description": "A little over three months after Cara Mund was crowned Miss America, a scandal rocked the organization.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170911144321-miss-america.jpg?q=x_0,y_235,h_1688,w_3000,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2018/02/13/entertainment/miss-america-cara-mund-email-scandal/index.html", "site_name": "CNN"}, "twitter": {"title": "Reigning Miss America Cara Mund addresses the organization's recent email controversy | CNN", "description": "A little over three months after Cara Mund was crowned Miss America, a scandal rocked the organization.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170911144321-miss-america.jpg?q=x_0,y_235,h_1688,w_3000,c_crop/w_800", "card": "summary_large_image", "site": "@CNNent"}, "description": "A little over three months after Cara Mund was crowned Miss America, a scandal rocked the organization.", "template_type": "article_leaf", "type": "article", "meta-section": "entertainment", "theme": "entertainment", "article": {"published_time": "2018-02-13T17:34:47Z", "modified_time": "2018-02-13T18:53:55Z", "tag": "contests and competitions, donald trump, females (demographic group), feminism, gender equality, miss america, pageants, political figures - us, population and demographics, scandals, sex and gender issues, society", "publisher": "https://www.facebook.com/CNN"}, "keywords": "contests and competitions, donald trump, females (demographic group), feminism, gender equality, miss america, pageants, political figures - us, population and demographics, scandals, sex and gender issues, society", "author": "Chloe Melas", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1518480000.0, "source": "https://www.cnn.com", "summary": ""}