{"url": "https://www.elle.com/beauty/a13981756/aja-naomi-king-loreal-paris-spokesperson/", "text": "A beauty guru, murderer, and law student walk into a bar. The punchline is that it’s just one person: Aja Naomi King, who plays Michaela Pratt on ABC's How To Get Away With Murder. Yes, she’s an actress who makes up one fraction of the fictitious law student group that seems to keep accidentally committing those doggone murders with the help of Viola Davis’ character Annalise Keating, but she also knows a thing or two about beauty. To put it in 2017 terms, if she decided to give up acting and start a YouTube channel, we would all be scrolling down to like and subscribe. “I’ve loved makeup for such a long time,” explains King. “I really got into it because it’s that quiet time you sit with yourself and make yourself your own work of art. It’s really beautiful.”\n\nNow, ELLE.com can exclusively announce, Aja Naomi King is the newest spokesperson for L'Oreal Paris. The talented actress will join fellow L'Oreal ladies Elle Fanning, Blake Lively, Maria Borges, and Susan Sarandon.\n\nAhead of the first kickoff campaign with Aja for the True Match Lumi Collection, we jumped on the phone to talk beauty, Viola Davis and Shonda Rhimes, being seen, and beauty secrets from the set of How To Get Away With Murder. Read on to learn about the new beautiful talented #lorealista.\n\nCongrats on the new L’Oreal Paris spokesperson role! What’s it like to join the ranks of Julianne Moore, Susan Sarandon, Naomi Watt, Camila Cabello, Blake Lively, and Maria Borges?\n\nOh, my gosh, it’s amazing. I'm so honored. All of those women evoke such elegance and style and they all have qualities of effortless beauty around them. To be put in that group of women and be thought of in that way, I'm just so immensely, overwhelmingly happy and honored to be counted amongst them.\n\nYou’re on a series that allows black girls and women to see themselves represented and seen on TV, do you think that this is a valuable extension to that?\n\nYes, immensely valuable. Awhile ago Shonda Rhimes was inducted in the TV Hall of Fame and she said something that was so—it just hit me in such a way, thinking about how L'Oreal was allowing me to join the ranks of these incredible women. What she said was: \"You cannot be what you cannot see.\" It's so true. When you look at a global brand like L'Oreal, to be a part of that vision, and to be put out there in the world for other young women to see me and see a reflection of themselves promoted in that way. It's so powerful because it really sends the message of look at all the wonderful things we can do.\n\nWhat other valuable lessons have you learned from Shonda? How did Viola react to the news of your spokesperson role?\n\nWhen it comes to Viola, she always makes me so happy, because any little thing that happens to me, she is just the biggest supporter and cheerleader. It's really wonderful. She’s so supportive of me getting any kind of attention or recognition for anything. What's so great about her she is always is able to make it so clear, in a really impactful way, that these opportunities, they are rare things, and they don't always come around. To be able to be granted one and chosen in that way, just the value in that. She said these aren't the things that were possible when she was younger. When she looks at me, she is like, \"Look what you can do and what you are showing other people and be grateful for that because it's an immense responsibility.\" I do take it so seriously because someone else is going to see it and they are going to say to themselves, “Wow, that's me.” I see myself in that person and now I see exactly what I'm capable of and there are no limits.\n\nTo me that's the most powerful thing, growing up and seeing all the things that Shonda Rhimes has done. We've all been taught there are no limits. The stories you can tell and the impact you can tell and the way you affect people's lives on a daily basis and create empathy and make them feel beautiful. When you put a women like Viola Davis on the screen and say, “This is our beauty icon, this is beautiful.” The world stops and says, “Yes, we've been waiting for this.”\n\nYou gave a wonderful speech at Essence Women in Hollywood about your personal struggle with self doubt. “My inner critic is strong, but I know that I am stronger.” Does this do anything to quiet those doubts?\n\nI definitely think this does that. There is a voice inside of my head that is trying to convince me that I'm not good enough and that I don't deserve to be here. So courage is required. The courage to decide that I have a voice and need to do what I love. To believe that this opportunity is not wasted on me. To own the fact that I am worthy.\n\nWho are some of your beauty icons that inspire you?\n\nI always think of when I was younger my mother showed me the movie Lady Sings the Blues with Diana Ross. You should see that movie. She plays Billie Holiday in the film. Growing up I loved listening to Billie Holiday because her work is amazing and she was a black woman coming up in a time when it was difficult to amass that kind of opportunity. Diana Ross's portrayal of her really gave insights into both of these women.\n\nI've always kind of leaned more into looking at those older beauty icons, who really had to break all the boundaries to prove that they were beautiful. To have dark skin and curly hair was beautiful too. I look to them and still look to women like Eartha Kitt and Dorothy Dandridge who were so groundbreaking in their beauty.\n\nYour first collaboration with L'Oreal is the True Match Lumi Collection! What are some of your favorite products? What’s in your beauty bag right now?\n\nTrue Match Lumi Glotion. It's my super go-to for my face. It is so perfect, especially on days off when I want to try and take care of my skin a bit better and not put too much on. I put that on and I’m just illuminated.\n\nCourtesy of L'Oreal\n\nL'Oreal True Match Lumi Glotion Natural Glow Enhancer, $14.99, ulta.com\n\n\n\n\n\nOf course, I have to have my L'Oreal Paris Voluminous Original Mascara as well. It just layers on so great. I feel like it can fit with everything, whether you're going for a little or a lot, depending on how you apply the mascara, it can go a long way.\n\nCourtesy of L'Oreal\n\nL'Oreal Paris Voluminous Original Mascara, $7.99, ulta.com\n\n\n\nLet’s talk about HTGAWM. Are you similar to your character Michaela Pratt? How does her beauty look differ from your everyday look?\n\nI’m very similar to my character at this point, other than the whole murdering stuff. One of the things I really love about my character is that a little murder has never stopped Michaela from putting on makeup. Michaela wears makeup like she's about to walk on a red carpet. I love, love, love that. I’ve been fighting for years now for my character to wear a lip color and finally this year they conceded and allowed it happen.\n\nIt seems like the law students get into some weird situations. What’s the most dramatic look you did on the show, how was that done?\n\nThe weirdest makeup was a no makeup but a lot of blood scene. I actually posted a video of this on Instagram. The crew were just flinging blood on my face. I mean, fake blood.\n\nWhen we were shooting the scene, the crew had this catapult and a man sat there with a bowl of fake blood. When the gunshot went off in the scene, he let it go flying at me. It gets pretty insane over here.\n\nCan you any beauty secrets from HTGAWM that will give us hints about what’s to come?\n\nHints are so dangerous. We are still filming so I need to remember the last thing that happened because I am not getting into trouble today. I’ll say this much, Michaela is going to get her glow back. Nothing can hold her back and she cares about how she presents herself to the world.", "images": ["https://hips.hearstapps.com/rover/profile_photos/a0bad052-f876-435f-8e93-48cef17d9bf7_1579627521.png?fill=1:1&resize=80:*", "https://hips.hearstapps.com/hmg-prod/images/loreal-voluminous-volume-building-mascara-1512048002.jpg?crop=1xw:1xh;center,top&resize=320:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1339152005a-1633719831.jpg?crop=1.00xw:0.771xh;0,0&resize=180:*", "https://www.elle.com/_assets/design-tokens/elle/static/images/logos/network-logo.a5366f4.svg", "https://hips.hearstapps.com/hmg-prod/images/elm100122btywellness-001-preview-1663875335.jpg?crop=0.713xw:0.476xh;0.103xw,0.241xh&resize=180:*", "https://hips.hearstapps.com/vidthumb/a367a8aa-699f-41ea-accd-67bcdf3ce796/a367a8aa-699f-41ea-accd-67bcdf3ce796_image.jpg?crop=1xw:1.0xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/elle-loves-sisley-exfoliating-enzyme-mask-index-1664911453.jpg?crop=0.502xw:1.00xh;0.250xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1211390582a-1631301889.jpg?crop=1.00xw:0.670xh;0,0.0597xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/model-poses-at-backstage-for-the-digital-generation-news-photo-1664823517.jpg?crop=1.00xw:0.668xh;0,0.0139xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/file-10-1665155138.jpg?crop=1.00xw:0.668xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/chanel-whitney-peak-collagecomp-1664915284.jpg?crop=0.502xw:1.00xh;0.495xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/lips-beauty-close-up-natural-beauty-portrait-royalty-free-image-1665075786.jpg?crop=1.00xw:0.668xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-513094960a-1644432314.jpg?crop=1.00xw:0.668xh;0,0.228xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1204936130b-1635189193.jpg?crop=0.774xw:1.00xh;0.0737xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/lop-cosmetics-face-true-match-lumi-glotion-902-light-primary-071249363119.jpg?crop=1xw:1xh;center,top&resize=320:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1273552861a-1606770969.jpg?crop=0.877xw:1.00xh;0.0641xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/elle-aja-naomi-king-new-loreal-1512061216.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/take-care-of-it-royalty-free-image-1650554810.jpg?crop=0.668xw:1.00xh;0.0753xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/elle-aja-naomi-king-new-loreal-1512061216.jpg?crop=0.502xw:1.00xh;0.143xw,0&resize=640:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/elle-aja-naomi-king-new-loreal-1512061216.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.elle.com/beauty/a13981756/aja-naomi-king-loreal-paris-spokesperson/", "title": "Exclusive: Aja Naomi King Is a New L'Oreal Paris Spokesperson", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Exclusive: Aja Naomi King Is a New L'Oreal Paris Spokesperson", "description": "Aja Naomi King is the newest spokesperson for L'Oreal Paris. The talented actress will join the ranks of Elle Fanning, Blake Lively, Maria Borges, and Susan Sarandon.", "keywords": "Aja Naomi King, L'Oreal, True Match Lumi, How To Get Away With Murder, Shonda Rhimes, Viola Davis", "theme-color": "#000000", "og": {"site_name": "ELLE", "title": "Exclusive: Aja Naomi King Is a New L'Oreal Paris Spokesperson", "description": "Viola Davis and Shonda Rhimes had the best reaction to the news.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/elle-aja-naomi-king-new-loreal-1512061216.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.elle.com/beauty/a13981756/aja-naomi-king-loreal-paris-spokesperson/", "type": "article"}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "section": "Beauty", "modified_time": "2022-08-24T20:17:13Z", "published_time": "2017-11-30T15:58:00Z"}, "twitter": {"site": "@ELLEmagazine", "image": "https://hips.hearstapps.com/hmg-prod/images/elle-aja-naomi-king-new-loreal-1512061216.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*", "card": "summary_large_image"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/elle-aja-naomi-king-new-loreal-1512061216.jpg?crop=0.502xw:1.00xh;0.143xw,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/elle-aja-naomi-king-new-loreal-1512061216.jpg?crop=0.502xw:1.00xh;0.143xw,0&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/elle-aja-naomi-king-new-loreal-1512061216.jpg?crop=0.502xw:1.00xh;0.143xw,0", "auto-publish": "timely", "sailthru.excerpt": "A beauty guru, murderer, and law student walk into a bar. The punchline is that it’s just one person: Aja Naomi King, who plays Michaela Pratt on ABC's How To Get Away With Murder. Yes, she’s an actress who makes up one fraction of the fictitious law student group that", "sailthru.tags": "beauty,Beauty", "sailthru.date": "2017-11-30 15:58:00", "sailthru.socialtitle": "Exclusive: Aja Naomi King Is a New L'Oreal Paris Spokesperson", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 47}, "movies": [], "publish_date": 1512057480.0, "source": "https://www.elle.com", "summary": ""}