{"url": "https://en.wikipedia.org/wiki/Chris_Pratt", "text": "American actor (born 1979)\n\nFor other people with the same name, see Christopher Pratt (disambiguation)\n\nChristopher Michael Pratt (born June 21, 1979[1]) is an American actor. He rose to prominence for playing Andy Dwyer in the NBC sitcom Parks and Recreation (2009–2015). He also appeared in The WB drama series Everwood (2002–2006) and had supporting roles in the films Wanted (2008), Jennifer's Body (2009), Moneyball (2011), Zero Dark Thirty (2012), and Her (2013).\n\nPratt established himself as a Hollywood leading man by starring in two lucrative film series. He played Star-Lord in superhero films set in the Marvel Cinematic Universe, including Guardians of the Galaxy (2014), Guardians of the Galaxy Vol. 2 (2017), Avengers: Infinity War (2018), Avengers: Endgame (2019), and Thor: Love and Thunder (2022).[2] He has also starred as Owen Grady in the action adventure film Jurassic World (2015), and its sequels Jurassic World: Fallen Kingdom (2018) and Jurassic World Dominion (2022).\n\nPratt's other starring roles were in The Magnificent Seven (2016), Passengers (2016), and The Tomorrow War (2021), and the action thriller television series The Terminal List (2022). In 2015, Time magazine named him one of the 100 most influential people in the world.[3]\n\nEarly life\n\nChristopher Michael Pratt was born on June 21, 1979, in Virginia, Minnesota.[4] His mother worked at a Safeway supermarket, and his father worked in mining and later remodeling houses.[5][6][7] Pratt's father died in 2014 from multiple sclerosis.[8] His mother is of Norwegian descent.[9] When Pratt was seven years old, the family moved to Lake Stevens, Washington.[10] Pratt placed fifth in a high school state wrestling tournament.[5][11] He also was a shot putter for his high school's track team.[12] He later recalled that when his wrestling coach asked him what he wished to do with his life, he said \"'I don't know, but I know I'll be famous and I know I'll make a shit ton of money.' I had no idea how. I'd done nothing proactive.\"[5] He graduated from Lake Stevens High School in 1997.[13]\n\nPratt dropped out of community college halfway through the first semester and, after working as a discount ticket salesman and daytime stripper, he ended up homeless in Maui, Hawaii, sleeping in a van and a tent on the beach. He told The Independent, \"It's a pretty awesome place to be homeless. We just drank and smoked weed and worked minimal hours, just enough to cover gas, food, and fishing supplies.\"[5][14] He recalled listening to the Dr. Dre album 2001 daily, to the point where he knew every lyric; years later, he rapped Eminem's verses from the song \"Forgot About Dre\" extemporaneously during an interview.[15] During his time in Maui, he worked for Christian missionary organization Jews for Jesus.[16]\n\nCareer\n\n2000–2013: Early work and breakthrough\n\nWhen Pratt was age 19, he waited tables at the Bubba Gump Shrimp Company restaurant in Maui when he was discovered by actress and director Rae Dawn Chong. She cast him in her directorial debut, the short horror film Cursed Part 3, which was filmed in Los Angeles.[4][5][17] Pratt's first regular television role was as Harold Brighton \"Bright\" Abbott on the series Everwood.[5][18] After Everwood's cancellation, he joined the cast of The O.C. for its fourth season, playing activist Winchester \"Ché\" Cook.[5] He also had an appearance in the 2008 action film Wanted, where James McAvoy hits him with a keyboard.[19]\n\nParks and Recreation in April 2009 Pratt at the premiere ofin April 2009\n\nIn 2009, Pratt began playing Andy Dwyer on the NBC comedy series Parks and Recreation. Originally meant to be a temporary character, producers liked Pratt so much they asked him to become a series regular.[5][20] This proved to be his breakthrough role.[21]\n\nPratt portrayed Oakland Athletics first baseman/catcher Scott Hatteberg in the 2011 film Moneyball. He was initially told that he was too fat to play Hatteberg, as he had gained 40 pounds (18 kg), which Pratt attributed to the cooking of his then-girlfriend, actress Anna Faris. Deciding to lose weight, he worked out continuously, regularly checking to see if the part was cast, losing a total of 30 pounds (14 kg). When he felt he had lost enough, he sent a photo of himself to the casting director and won the part. Before the release of Moneyball, Pratt was typecast as youthful and somewhat immature characters. In Moneyball, he played a dramatic role as a father and dejected baseball player who once feared his career was over and who had the difficult task of learning a new defensive position.[5][22]\n\nHe gained back the weight he had lost to appear in the film 10 Years (2011), then lost it again to portray a Navy SEAL in the film Zero Dark Thirty (2012).[5] He played the co-worker of Joaquin Phoenix character in Spike Jonze's sci-fi romance Her in December 2013.[23]\n\n2014–present: Franchise work and worldwide recognition\n\nWhile Pratt had been known to this point for playing supporting characters[5] and he was best known for his portly character on Parks and Recreation, 2014 marked a turning point in his career when he headlined two major studio films: Emmet Brickowski in The Lego Movie,[5][14] which grossed $469.1 million;[24] and Peter Quill / Star-Lord in Marvel Studios' Guardians of the Galaxy, which grossed $773.3 million.[25] Pratt had initially turned down the role of Peter Quill, explaining he did not \"want another Captain Kirk or Avatar moment\" (after humbling auditions for both).[26] The film's casting director, Sarah Finn, suggested Pratt to the director James Gunn, who had struggled to cast that role and dismissed the idea. In spite of this, Finn arranged for a meeting between the two, at which point Gunn was convinced that Pratt was perfect for the role. Pratt also won over Marvel Studios President Kevin Feige, despite having gained weight again for the comedy film Delivery Man.[5][27] The role was part of a multi-film deal that Pratt signed with Marvel.[28] Bruce Diones of The New Yorker noted, \"Pratt, overflowing with charisma, plays the leader of the pack of misfits, and his blissed-out space cowboy (with a love for seventies music) is so full of good will that he buoys the film and its requisite whizbang special effects.\"[29]\n\nIn November 2013, Pratt, an avid fan of Jurassic Park (1993) who has referred to the film as \"my Star Wars\",[5] replaced Josh Brolin as the lead in Jurassic World (2015). He played Owen Grady, who works training Velociraptors.[30][31][32][33] Jurassic World grossed $652.3 million in North America and $1.018 billion overseas for a worldwide total of $1.670 billion.[34] His performance was praised, with Peter Travers of Rolling Stone stating that Pratt \"ace[d] it as an action hero and invests his sexual banter with a comic flair the movie could have used more of.\"[35] He reprised the role in the sequel, Jurassic World: Fallen Kingdom, which was released on June 22, 2018.[36] Although a commercial success,[37] the sequel received mixed reviews, with Brian Lowry of CNN criticizing the film for \"largely neutralizing [...] Pratt's charm and comedic skills.\"[38]\n\nHis next film role was as Josh Faraday, a gambler, in The Magnificent Seven, a remake of the 1960 Western with the same name, in which he starred alongside Denzel Washington. The film was released on September 23, 2016.[39] Pratt's second 2016 release was Passengers, a science fiction film which opened in December, co-starring Jennifer Lawrence. Pratt played Jim Preston, \"a mechanic, who wants to get off an Earth that no longer seems to value a guy who works with his hands\".[40]\n\nPratt reprised his role as Peter Quill / Star-Lord in the Guardians of the Galaxy sequel Guardians of the Galaxy Vol. 2, which was released in May 2017. The film focuses on Quill's and his team's search for his father.[41] Pratt also reprised the character in Avengers: Infinity War, which was released in April 2018,[42] and in Avengers: Endgame, which was released on April 26, 2019.[43]\n\nAdditionally, Pratt reprised the voice role of Emmet in The Lego Movie 2: The Second Part along with another character Rex Dangervest. In August 2017, Pratt was confirmed to star in the western drama The Kid.[44] He is also set to appear as Duncan in the action film Cowboy Ninja Viking alongside Priyanka Chopra.[45] Initially the movie was decided to be released in June 2019, however, on August 7, 2018, the film was pulled from the release list, nullifying the previous release date.[46] In March 2020, Pratt had a lead voice role in the Disney/Pixar animated feature film Onward, alongside his Avengers co-star Tom Holland.[47]\n\nIn May 2021, Pratt and Parks and Recreation announced the upcoming release of a new album based on Pratt's character Andy Dwyer.[48] In June 2021, they officially released a pair of singles, \"The Pit\" and \"Two Birds Holding Hands\". The album, which is called Mouse Rat: The Awesome Album, was released in August 2021.[49][50] In September 2021, it was announced that Pratt would be voicing the Nintendo mascot Mario in The Super Mario Bros. Movie based on the video game series of the same name.[51] In November 2021, it was announced that he would be voicing the titular cat of the upcoming animated film Garfield, being directed by Mark Dindal from a script by David Reynolds.[52] In June 2022, he was announced to star in The Electric State alongside Millie Bobby Brown.[53]\n\nPublic image\n\nIn March 2014, Pratt was awarded the CinemaCon Award for Breakthrough Performer.[54][55] In 2014, he was ranked at number two on People magazine's annual list of Sexiest Men Alive.[56] Pratt was the featured cover story of the July 18 issue of Entertainment Weekly, which documented the evolution of his physique over the course of the previous twelve years, going from 220 pounds (100 kg) for his role on Everwood to 295 pounds (134 kg) for Delivery Man, to 225–230 pounds (102–104 kg) for his roles in Zero Dark Thirty and Guardians of the Galaxy.[5] Pratt poked fun at his fluctuating physique in a musical number he performed during his monologue when he hosted the September 27, 2014 episode of Saturday Night Live.[57] On April 21, 2017, Pratt received a star on the Hollywood Walk of Fame for his contributions to the motion picture industry, located at 6834 Hollywood Boulevard.[58][59]\n\nPersonal life\n\nIn 2007, on the set of Take Me Home Tonight, Pratt met actress Anna Faris, who played his love interest in the film.[5][60] They were engaged in late 2008[61] and married in Bali, Indonesia, on July 9, 2009,[62] eloping on a whim after a friend's wedding.[63] They lived in the Hollywood Hills neighborhood of Los Angeles.[64][65] Their son was born in 2012,[66] nine weeks premature and weighing only 3 pounds 12 ounces (1.7 kg).[67] Pratt stated that the birth of his preterm son \"really defined\" his faith in God, after both he and his wife \"prayed a lot\" as they were initially afraid of the baby's prognosis.[68] The couple split in 2017[69][70] and finalized their divorce the following year.[71]\n\nPratt began a relationship with author Katherine Schwarzenegger in June 2018.[72] On January 13, 2019, Pratt announced that he and Schwarzenegger were engaged.[73][74] They were married on June 8, 2019, in Montecito, California.[75] In 2020 their first child was born.[76] Through his marriage to Schwarzenegger, he is a member of the Kennedy family.[77] In May 2022, their second daughter was born.[78]\n\nPratt was raised Lutheran and later worked for Jews for Jesus, eventually becoming a non-denominational Christian.[79] Pratt reportedly attends the Zoe Church in Los Angeles, which is affiliated with the Hillsong Church and has been criticized by some as anti-LGBTQ.[80] He responded by saying, \"It has recently been suggested that I belong to a church which 'hates a certain group of people' and is 'infamously anti-LGBTQ.' Nothing could be further from the truth. I go to a church that opens its doors to absolutely everyone.\"[81] Brian Houston of Hillsong has denied that Pratt was ever a member of his church.[82] Guardians of the Galaxy director James Gunn also defended Pratt, stating that he \"know[s] the church he currently goes to\" and scolded those wishing to have him recast as Star-Lord.[83][84] Pratt addressed the controversy in a 2022 Men's Health interview, stating, \"Maybe it was hubris. For me to stand up on the stage and say the things that I said, I'm not sure I touched anybody... Religion has been oppressive as fuck for a long time... I didn’t know that I would kind of become the face of religion when really I'm not a religious person.\" He said that he still had a strong belief in God but was never a member of Hillsong, having chosen not to denounce them at the time so as not to \"throw a church under the bus\".[85]\n\nPolitically, Pratt has stated he does not feel represented by either side of the political spectrum and has expressed a desire to find common ground.[86] He donated over $1,000 to Barack Obama's 2012 campaign.[87]\n\nPhilanthropy\n\nIn 2015, Pratt and Anna Faris donated $1 million to a charity which provided eyeglasses to underprivileged children. The donation was allegedly inspired by Pratt's son who was born premature and visually impaired. They also donated to neonatal intensive care unit of the Cedars-Sinai Medical Center in Los Angeles and also supported March of Dimes which works to end premature births, birth defects and infant mortality.[88]\n\nIn December 2016, Pratt donated $500,000 to a teen center in his hometown of Lake Stevens. The teen center was named in memory of his father.[89]\n\nIn February 2021, Pratt donated $20,000 to fight hunger in South Carolina. The donation was part of a fundraiser by Pratt and an organization to raise $650,000 in order to fight food insecurity amidst the COVID-19 pandemic in the United States. Pratt also helped create the charity Feed Thy Neighbor to which he donated $100,000.[90] Also in February 2021, he donated $10,000 to the Edmonds Food Bank as part of his organization and also donated to the Edmonds Chamber of Commerce and Edmonds Waterfront Center in Washington state.[91]\n\nFilmography\n\nKey Denotes productions that have not yet been released\n\nFilm\n\nTelevision\n\nVideo games\n\nTheme park attractions\n\nAwards and nominations", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Chris_Pratt_by_Gage_Skidmore_2.jpg/170px-Chris_Pratt_by_Gage_Skidmore_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Coat_of_Arms_of_John_F._Kennedy.svg/75px-Coat_of_Arms_of_John_F._Kennedy.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Chris_Pratt_and_Anna_Faris.jpg/170px-Chris_Pratt_and_Anna_Faris.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Signature_of_Chris_Pratt.svg/150px-Signature_of_Chris_Pratt.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Chris_Pratt_2018.jpg/1200px-Chris_Pratt_2018.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Chris_Pratt_2018.jpg/220px-Chris_Pratt_2018.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Chris_Pratt_2009.jpg/170px-Chris_Pratt_2009.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Chris_Pratt_2018.jpg/1200px-Chris_Pratt_2018.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Chris_Pratt", "title": "Chris Pratt", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Chris_Pratt_2018.jpg/640px-Chris_Pratt_2018.jpg", "width": 640, "height": 960}, "title": "Chris Pratt - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}