{"url": "http://www.cnn.com/2017/01/05/politics/border-wall-house-republicans-donald-trump-taxpayers/", "text": "Story highlights The Trump transition team says his preference is to fund the border wall through the appropriations process The move would break a key campaign promise when Trump promised to force Mexico to pay for the wall\n\nWashington CNN —\n\nPresident-elect Donald Trump’s transition team has signaled to congressional Republican leaders that his preference is to fund the border wall through the appropriations process as soon as April, according to House Republican officials.\n\nThe move would break a key campaign promise when Trump repeatedly said he would force Mexico to pay for the construction of the wall along the border, though in October, Trump suggested for the first time that Mexico would reimburse the US for the cost of the wall.\n\nTrump defended that proposal Friday morning in a tweet, saying the move to use congressional appropriations was because of speed.\n\n“The dishonest media does not report that any money spent on building the Great Wall (for sake of speed), will be paid back by Mexico later!” Trump tweeted Friday.\n\nNew York Rep. Chris Collins said Friday that American taxpayers would front the cost for the wall but that he was confident Trump could negotiate getting the money back from Mexico.\n\n“When you understand that Mexico’s economy is dependent upon US consumers, Donald Trump has all the cards he needs to play,” Collins, congressional liaison for the Trump transition team, told CNN’s Alisyn Camerota on “New Day.” “On the trade negotiation side, I don’t think it’s that difficult for Donald Trump to convince Mexico that it’s in their best interest to reimburse us for building the wall.”\n\nThe Trump team argues it will have the authority through a Bush-era 2006 law to build the wall, lawmakers say, but it lacks the money to do so. Transition officials have told House GOP leaders in private meetings they’d like to pay for the wall in the funding bill, a senior House GOP source said.\n\nIntel report says US identifies go-betweens who gave emails to WikiLeaks\n\n“It was not done in the Obama administration, so by funding the authorization that’s already happened a decade ago, we could start the process of meeting Mr. Trump’s campaign pledge to secure the border,” Indiana Republican Rep. Luke Messer said on Thursday.\n\nMesser admitted it’s “big dollars, but it’s a question of priorities.” He pointed to a border security bill that Homeland Security Chairman Mike McCaul proposed last year that cost roughly $10 billion.\n\n“Democrats may well find themselves in the position to shut down all of government to stop the buildout of a wall, or of a barrier, or of a fence,” Messer said.\n\nMexican leaders have repeatedly said they will not pay for the wall.\n\nThe Associated Press and Politico first reported elements of the talks earlier Thursday.\n\nIf Mexico refuses to pay for the wall, the GOP could add billions of dollars into the spending bill that needs to pass by April 28 to keep the government open. But doing so would force a showdown with Senate Democrats and potentially threaten a government shutdown.\n\nNo decisions have been made, GOP sources said.\n\nRepublicans point out that then-Sen. Barack Obama, Sen. Chuck Schumer and then-Sen. Hillary Clinton voted for the 2006 bill and argued that since Democrats backed that bill, they should support efforts to fund the current effort.\n\nThe thinking behind the strategy is that it is harder for Democrats to filibuster spending bills because of the high stakes involved if they fail to pass in time.\n\nBlack Caucus launches longshot effort to derail Sessions’ nomination as attorney general\n\nRep. Steve Scalise of Louisiana, the No. 3 Republican in the House leadership, declined to say Thursday if Congress would pay for the wall.\n\n“We want President Trump to have all the tools he needs to build the wall,” Scalise said. “We’re in talks with him on the details of it as they’re still putting together their team. We still got a few months before there’s another funding bill that’s going to move. We’re going to work with him to make sure we can get it done. We want to build a wall. He wants to build a wall.”\n\nCould Mexico pay for the border wall?\n\nTrump himself has estimated his border wall would cost $8 billion, though other analysts have estimated the price would be as much as $10 billion. And the proposals Trump has outlined to coerce Mexico into paying for the wall involve controversial measures that would still likely fail to cover the wall’s full cost.\n\nAccording to Trump’s website, those steps could include: remittance seizure, potential tariffs and foreign aids cuts, increasing fees on temporary visas issued to Mexican CEOs and diplomats, increasing fees on border crossing cards, increasing fees on NAFTA worker visas; and increasing fees at ports of entry to the US from Mexico.\n\nA major challenge for judging Trump’s proposal is that most of those steps amount to a drop in the bucket – less than $1 billion – compared to the proposed cost of the wall. And the one step that could provide the required amount of money – remittance seizure – would face major legal obstacles, in addition to the likelihood of severe domestic and international backlash.\n\nTotal US foreign aid to Mexico is less than $200 million a year ($186,000,000 in the 2014 fiscal year), so redirecting all of that money to a border wall would only put a mild dent in the $8 billion bill. And it’s difficult to know the amount of revenue generated from a tariff on Mexican exports – or to account for potential losses from a retaliatory tariff – without the specifics of the tax.\n\nMoving next to fee increases, Trump says on his website that “even a small increase in visa fees would pay for the wall. This includes fees on border crossing cards, of which more than 1 million are issued a year.” But the fees for visas and border crossing cards range from around $150 to $200 each, according to State Department data. Accounting for all the fees on over a million border crossing cards and visas in a year year – and even accounting for a twofold increase in those fees – that would still only generate about half a billion dollars, well short of an $8 billion price tag.\n\nThe biggest potential source of money for the wall would come from remittance seizure: remittance payments are money that immigrants, legal and illegal, earn in their country of residence and send back to their families in their native country.\n\nAccording to the bank of Mexico, Mexico received $24.8 billion in remittance payments in 2015. A Fox News Latino report calculated that 97% of remittance payments received by Mexico in the first three months of 2015 came from the US, and the Pew Research Center similarly reported that “nearly all” of Mexico’s remittance payment revenue comes from the U.S.” Seizing all of that money would probably be more than enough to pay for the border wall.\n\nTrump says on his website that he would use the Patriot Act to require legal identification for money transfer transactions, according to his website. But CNN legal analyst Paul Callan says Trump’s plan would likely face multiple legal battles.\n\n“The Mexican immigrants Trump seeks to target are clearly not the ‘Radical Islamic Terrorists’ that the Patriot Act was designed to fight,” says Callan. “The courts are likely to view Mr. Trump’s use of the always controversial Patriot Act as an improper and illegal use. The proposal may also fail to place pressure on the Mexican government as money can be smuggled back to Mexico in many other creative ways if wire transfers are cut.”\n\nThe size of Mexico’s remittance revenue far surpasses any other revenue-raising proposal from Trump, and would probably be the most effective way to pay for the border wall. But looking at the obstacles that such an action would face, it’s difficult to envision a path to impounding those payments to pay for the wall.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/160314164813-manu-raju-profile.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/150123130119-deirdre-walsh.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/160314170919-david-wright.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/170104203331-trump-palm-beach.jpg?q=x_3,y_121,h_1303,w_2317,c_crop/w_800"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/170104203331-trump-palm-beach.jpg?q=x_3,y_121,h_1303,w_2317,c_crop/w_800", "keywords": [], "authors": ["Manu Raju Deirdre Walsh David Wright", "Manu Raju", "Deirdre Walsh", "David Wright"], "canonical_link": "https://www.cnn.com/2017/01/05/politics/border-wall-house-republicans-donald-trump-taxpayers/index.html", "title": "Trump asking Congress, not Mexico, to pay for border wall", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Trump asking Congress, not Mexico, to pay for border wall | CNN Politics", "description": "President-elect Donald Trump's transition team has signaled to congressional Republican leaders that his preference is to fund the border wall through the appropriations process as soon as April, according to House Republican officials.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170104203331-trump-palm-beach.jpg?q=x_3,y_121,h_1303,w_2317,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2017/01/05/politics/border-wall-house-republicans-donald-trump-taxpayers/index.html", "site_name": "CNN"}, "twitter": {"title": "Trump asking Congress, not Mexico, to pay for border wall | CNN Politics", "description": "President-elect Donald Trump's transition team has signaled to congressional Republican leaders that his preference is to fund the border wall through the appropriations process as soon as April, according to House Republican officials.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170104203331-trump-palm-beach.jpg?q=x_3,y_121,h_1303,w_2317,c_crop/w_800", "card": "summary_large_image", "site": "@cnnpolitics"}, "description": "President-elect Donald Trump's transition team has signaled to congressional Republican leaders that his preference is to fund the border wall through the appropriations process as soon as April, according to House Republican officials.", "template_type": "article_leaf", "type": "article", "meta-section": "politics", "theme": "politics", "article": {"published_time": "2017-01-06T01:43:31Z", "modified_time": "2017-01-06T19:11:53Z", "tag": "border control, donald trump, government and public administration, government bodies and offices, international relations, international relations and national security, legislation, national security, political figures - us, politics, territorial and national borders, us congress, us democratic party, us federal government, us house of representatives, us political parties, us republican party, white house, latin america, mexico, north america, appropriations, 2016 presidential election, elections and campaigns, political candidates, united states, us federal elections, us presidential elections, business, economy and trade, economic migration, employment and income status, globalization, immigration, immigration, citizenship and displacement, labor and employment, migrant workers, social and economic status, society, trade and development", "publisher": "https://www.facebook.com/CNN"}, "keywords": "border control, donald trump, government and public administration, government bodies and offices, international relations, international relations and national security, legislation, national security, political figures - us, politics, territorial and national borders, us congress, us democratic party, us federal government, us house of representatives, us political parties, us republican party, white house, latin america, mexico, north america, appropriations, 2016 presidential election, elections and campaigns, political candidates, united states, us federal elections, us presidential elections, business, economy and trade, economic migration, employment and income status, globalization, immigration, immigration, citizenship and displacement, labor and employment, migrant workers, social and economic status, society, trade and development", "author": "Manu Raju,Deirdre Walsh,David Wright", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1483574400.0, "source": "http://www.cnn.com", "summary": ""}