{"url": "https://www.tvguide.com/news/roswell-new-mexico-reboot-premiere-the-cw-nycc/", "text": "Fans of the original Roswellseries have been waiting months to find out how The CW's reboot, titled Roswell, New Mexico, compares to the teen-centered sci-fi series they first fell in love with nearly 20 years ago. On Saturday, the cast joined executive producer Carina MacKenzie (The Originals), at New York Comic Con to screen the series premiere months before the show debuts on The CW at midseason.\n\nWhen the show begins, Jeanine Mason's Liz Ortecho is a biomedical researcher who has returned to her hometown of Roswell, New Mexico, after 10 years away. She left following the death of her older sister Rosa, but returns home after the funding was cut for her research project. Upon her return, Liz comes face to face with her old friend Max Evans (Nathan Dean Parsons), now a police officer, who still has feelings for her and is not-so-obviously also an alien. We're here to give you our (spoiler free!) first impressions.\n\nEverything You Need to Know About The CW's Roswell Reboot\n\nSetting up pilots, especially pilots you want to establish as different from a beloved previous iteration, is difficult. Roswell, New Mexico is a little heavy-handed in its political commentary on immigration during its opening scene in which Liz delivers an impassioned lecture after being stopped at check point by Max before the pair recognize each other.\n\nOnce Liz and Max realize who one another are, the chemistry is instant. We'd go as far to say that the series doesn't need as many flashbacks to their high school days to establish they have history. The palpable tension between Mason and Parsons is enough for anyone with a pulse to get the point, and there's no hoodie big enough or baseball cap ratty enough to make Parsons pass for a teenager, so we're hoping the series ditches the flashbacks as the show moves forward.\n\nAll in all, MacKenzie was able to balance nostalgic throwbacks to the original series and the book series Roswell, New Mexico is inspired by -- the introduction Maria and Alex in particular drew big reactions from the crowd -- while also making the series feel very 2018. The characters have been aged up so we won't get distracted with things like cheerleading try-outs or SATs in the middle of big story arcs. The series also won't have to juggle awkward college years come Season 3, something MacKenzie probably learned from her mentor and fellow executive producer Julie Plec.\n\nWatch the Trailer for The CW's Roswell, New Mexico\n\nThere are two major twists in the first episode that both bring surprising intrigue to the reboot. The first received raucous applause from the NYCC crowd and even had us going, \"I'll take more of that, please.\" The second presents an interesting obstacle between our star-crossed (literally) lovers as we find out there's more to Liz's sister's death than we know. That mystery will unfold throughout the season and by weaving our alien trio into it, MacKenzie has found a way to add a new element to the reboot that should also help establish a central mythology.\n\nRoswell, New Mexico has a couple of pilot problems that befall the majority of new shows, but they are not unforgivable and can easily be corrected as the show finds its footing. Our advice is that the show trust what it's established in the forefront and don't rely on the past unless it reveals crucial plot information. The exception to this is, of course, the music (Edwin McCain's \"I'll Be\" is the first song heard playing at the Crashdown and is a delightful throwback for those of us that grew up the WB romances of the late '90s.)\n\nMany people had justified reservations when Roswell, New Mexico was announced, but this show isn't a mere knockoff of the WB series. And if it learns to trust itself, it could say something valuable in 2018. At the very least, there are very hot aliens making out with very hot humans and that's very enjoyable to watch.\n\nLily Cowles, Nathan Parsons, Jeanine Mason and Michael Vlamis, Roswell, New Mexico John P. Filo/The CW\n\n\n\nRoswell, New Mexico premieres at midseason on The CW.\n\n\n\n(Full disclosure: TV Guide is owned by CBS, one of The CW's parent companies.)", "images": ["https://www.tvguide.com/a/img/resize/ff98460ea52ff93d461aa94ccbe2b5b622585e33/hub/2015/11/12/7757667f-a65f-4449-be9c-02197213cf71/93407049313130463381390783152n.jpg?auto=webp&height=84&width=84", "https://www.tvguide.com/a/img/hub/2018/10/03/ea479058-3428-4266-8f42-52726225bfd9/181003-roswell.jpg", "https://www.tvguide.com/a/img/resize/a00f5ded39950ed672d05606344199a19cc34cef/hub/2018/10/03/ea479058-3428-4266-8f42-52726225bfd9/181003-roswell.jpg?auto=webp&fit=crop&height=1080&width=1920"], "top_img": "https://www.tvguide.com/a/img/hub/2018/10/03/ea479058-3428-4266-8f42-52726225bfd9/181003-roswell.jpg", "keywords": [], "authors": ["Megan Vick", "Oct.", "P.M. Pt"], "canonical_link": "https://www.tvguide.com/news/roswell-new-mexico-reboot-premiere-the-cw-nycc/", "title": "Roswell New Mexico: First Impressions of The CW Reboot", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 63084645929}, "google-site-verification": "Od29UEFliEmsUY2XH0kfXxkTNucL0cv_rc0J_RPWXU4", "og": {"site_name": "TVGuide.com", "image": {"identifier": "https://www.tvguide.com/a/img/hub/2018/10/03/ea479058-3428-4266-8f42-52726225bfd9/181003-roswell.jpg", "height": 850, "width": 850}, "type": "article", "description": "Hello hot aliens!", "title": "Roswell New Mexico: First Impressions of The CW Reboot", "url": "https://www.tvguide.com/news/roswell-new-mexico-reboot-premiere-the-cw-nycc/"}, "twitter": {"card": "summary_large_image", "site": "@TVGuide", "image": "https://www.tvguide.com/a/img/hub/2018/10/03/ea479058-3428-4266-8f42-52726225bfd9/181003-roswell.jpg", "description": "The cast and executive producers debuted The CW's new Roswell series at New York Comic Con.", "title": "Roswell New Mexico: First Impressions of The CW Reboot", "url": "https://www.tvguide.com/news/roswell-new-mexico-reboot-premiere-the-cw-nycc/"}, "nuxtstatus": "loaded", "description": "The cast and executive producers debuted The CW's new Roswell series at New York Comic Con."}, "movies": [], "publish_date": null, "source": "https://www.tvguide.com", "summary": ""}