{"url": "https://variety.com/2018/tv/news/bye-bye-birdie-jennifer-lopez-live-staging-nbc-1202714761/", "text": "“Bye Bye Birdie Live” won’t be taking flight on NBC until 2019 at the earliest.\n\nNBC’s planned live event production of the classic musical with Jennifer Lopez in the lead role has been delayed for a second time due to the difficulty of coordinating with Lopez’s busy schedule, Variety has learned exclusively. The project was originally slated to be NBC’s holiday musical event for winter 2017 but was pushed to 2018 last May because of Lopez’s schedule.\n\nLopez is shooting two movies later this year, plus she has a host of other commitments to NBC. She’s the exec producer and a judge on the Peacock’s summer unscripted series “World of Dance,” and she stars in the police drama “Shades of Blue.” On top of her film and TV work, Lopez is committed to finishing the last lap of her Las Vegas residency at Planet Hollywood Resort and Casino in September.\n\nNBC is gearing up for the ambitious April 1 live staging of “Jesus Christ Superstar Live in Concert” with the hope of drawing a big crowd on Easter Sunday. That production has also complicated planning for “Bye Bye Birdie” because it is being shepherded by Craig Zadan and Neil Meron, the executive producers behind all of NBC’s live musicals to date. By the time the work on “Superstar” is finished, the producers would have less than six months to get “Birdie” on its feet if the show were to stick with its targeted December airdate.\n\nMoreover, NBC’s live musicals are a big investment for the Peacock. The elaborate staging plan for “Superstar” involves a company of 70-plus actors and musicians and an audience of 1,300 at Brooklyn’s Marcy Armory. Pulling off two large-scale legit live events in the same year would probably be a budget-buster for the network.\n\nBut with “Birdie” moving again, it’s understood that there is an effort under way to come up with a project to fill the void rather than have NBC go two years in a row without a live holiday event. But it’s unclear whether the projects under consideration would have the same scope as NBC’s past productions.\n\nNBC’s four previous live events — 2013’s “The Sound of Music Live,” 2014’s “Peter Pan Live,” 2015’s “The Wiz Live,” and 2016’s “Hairspray Live” — all aired in early December. This past December, Fox moved into the void with a tuner production of “A Christmas Story” that drew mixed reviews and modest ratings.\n\nNBC has also been working on plans for a live staging of the Aaron Sorkin play “A Few Good Men.” That project, also exec produced by Zadan and Meron, is unlikely to surface before 2019. Sorkin’s awards-season schedule with the film “Molly’s Game,” which marked his feature directorial debut, made it hard for the multi-hyphenate to focus on his teleplay adaptation of the courtroom drama that put him on the map as a scribe in 1989.", "images": ["https://variety.com/wp-content/themes/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://variety.com/wp-content/uploads/2017/06/jennifer-lopez.png?w=681&h=383&crop=1", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://variety.com/wp-content/uploads/2017/06/jennifer-lopez.png?w=1000"], "top_img": "https://variety.com/wp-content/uploads/2017/06/jennifer-lopez.png?w=1000", "keywords": [], "authors": ["Cynthia Littleton"], "canonical_link": "https://variety.com/2018/tv/news/bye-bye-birdie-jennifer-lopez-live-staging-nbc-1202714761/", "title": "NBC’s Production of ‘Bye Bye Birdie Live’ With Jennifer Lopez Pushed Again (EXCLUSIVE)", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://variety.com/wp-content/themes/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "NBC's plans for a live event production of \"Bye Bye Birdie\" with Jennifer Lopez in the lead role have been delayed for a second time.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199, "pages": 12616252196}, "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202714761, "author": "Cynthia Littleton", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-03-02T09:30:52"}, "pmc-tag": "Bye Bye Birdie Live!,Jennifer Lopez,NBC", "title": "NBC’s Production of ‘Bye Bye Birdie Live’ With Jennifer Lopez Pushed Again (EXCLUSIVE)", "pageclass": "article", "pmc-vertical": "tv", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress 6.0.2", "author": "Cynthia Littleton", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Variety", "application-name": "Variety", "ia": {"markup_url_dev": "https://variety.com/2018/tv/news/bye-bye-birdie-jennifer-lopez-live-staging-nbc-1202714761/?ia_markup=1"}, "content_type": "Article", "post_id": 1202714761, "title": "NBC's Production of 'Bye Bye Birdie Live' With Jennifer Lopez Pushed Again (EXCLUSIVE)", "published_at": "2018-03-02 09:30:52", "image": "https://variety.com/wp-content/uploads/2017/06/jennifer-lopez.png?w=1000", "comment_count": 7, "tags": "NBC", "topics": "News", "appeared_in_print": "No", "body": "\"Bye Bye Birdie Live\" won't be taking flight on NBC until 2019 at the earliest.\r\n\r\nNBC's planned live event production of the classic musical with Jennifer Lopez in the lead role has been delayed for a second time due to the difficulty of coordinating with Lopez's busy schedule, Variety has learned exclusively. The project was originally slated to be NBC's holiday musical event for winter 2017 but was pushed to 2018 last May because of Lopez's schedule.\r\n\r\nLopez is shooting two movies later this year, plus she has a host of other commitments to NBC. She's the exec producer and a judge on the Peacock's summer unscripted series \"World of Dance,\" and she stars in the police drama \"Shades of Blue.\" On top of her film and TV work, Lopez is committed to finishing the last lap of her Las Vegas residency at Planet Hollywood Resort and Casino in September.\r\n\r\nNBC is gearing up for the ambitious April 1 live staging of \"Jesus Christ Superstar Live in Concert\" with the hope of drawing a big crowd on Easter Sunday. That production has also complicated planning for \"Bye Bye Birdie\" because it is being shepherded by Craig Zadan and Neil Meron, the executive producers behind all of NBC's live musicals to date. By the time the work on \"Superstar\" is finished, the producers would have less than six months to get \"Birdie\" on its feet if the show were to stick with its targeted December airdate.\r\n\r\nMoreover, NBC's live musicals are a big investment for the Peacock. The elaborate staging plan for \"Superstar\" involves a company of 70-plus actors and musicians and an audience of 1,300 at Brooklyn's Marcy Armory. Pulling off two large-scale legit live events in the same year would probably be a budget-buster for the network.\r\n\r\nBut with \"Birdie\" moving again, it's understood that there is an effort under way to come up with a project to fill the void rather than have NBC go two years in a row without a live holiday event. But it's unclear whether the projects under consideration would have the same scope as NBC's past productions.\r\n\r\nNBC's four previous live events -- 2013's \"The Sound of Music Live,\" 2014's \"Peter Pan Live,\" 2015's \"The Wiz Live,\" and 2016's \"Hairspray Live\" -- all aired in early December. This past December, Fox moved into the void with a tuner production of \"A Christmas Story\" that drew mixed reviews and modest ratings.\r\n\r\nNBC has also been working on plans for a live staging of the Aaron Sorkin play \"A Few Good Men.\" That project, also exec produced by Zadan and Meron, is unlikely to surface before 2019. Sorkin's awards-season schedule with the film \"Molly's Game,\" which marked his feature directorial debut, made it hard for the multi-hyphenate to focus on his teleplay adaptation of the courtroom drama that put him on the map as a scribe in 1989.", "fragment": "!", "og": {"type": "article", "title": "NBC’s Production of ‘Bye Bye Birdie Live’ With Jennifer Lopez Pushed Again (EXCLUSIVE)", "url": "https://variety.com/2018/tv/news/bye-bye-birdie-jennifer-lopez-live-staging-nbc-1202714761/", "description": "“Bye Bye Birdie Live” won’t be taking flight on NBC until 2019 at the earliest. NBC’s planned live event production of the classic musical with Jennifer Lopez in the lead ro…", "site_name": "Variety", "image": {"identifier": "https://variety.com/wp-content/uploads/2017/06/jennifer-lopez.png?w=1000", "width": 1000, "height": 561, "alt": "Jennifer Lopez"}, "locale": "en_US"}, "article": {"published_time": "2018-03-02T17:30:52+00:00", "modified_time": "2018-03-02T18:13:26+00:00"}, "twitter": {"site": "@variety", "creator": "@Variety_Cynthia", "card": "summary_large_image", "title": "NBC’s Production of ‘Bye Bye Birdie Live’ With Jennifer Lopez Pushed Again (EXCLUSIVE)", "description": "NBC's plans for a live event production of \"Bye Bye Birdie\" with Jennifer Lopez in the lead role have been delayed for a second time.", "image": "https://variety.com/wp-content/uploads/2017/06/jennifer-lopez.png?w=1000"}}, "movies": [], "publish_date": 1520011852.0, "source": "https://variety.com", "summary": ""}