{"url": "https://www.celebritynetworth.com/richest-celebrities/models/luann-de-lesseps-net-worth/", "text": "What is LuAnn de Lesseps' Net Worth and Salary?\n\nLuAnn de Lesseps is a former nurse, model, author, and well-known television personality who has a net worth of $25 million. Before her days as a professional model and television star, de Lesseps was a licensed vocational nurse who worked with the elderly in a nursing home.\n\nPersonal Life\n\nLuAnn Nadeau, better known as LuAnn de Lesseps, was born on May 17, 1965. She was raised in Berlin, Connecticut, where her father owned a construction company. The company is still owned by two of her brother. In total, she has six siblings. In 1993, she married Count Alexandre de Lesseps, and they divorced in 2009 on the grounds of infidelity. Thanks to her marriage to the Count, she is also sometimes known as \"The Countess\". Together, they have two children, Noel and Victoria. On December 31, 2016, she married Tom D'Agostino Jr., before announcing their divorce less than a year later in August 2017.\n\nCareer\n\nBefore her days as a professional model, de Lesseps was a licensed practical nurse in Connecticut who worked with the elderly in a nursing home. In recent years, she has credited her time as a nurse for helping her develop people skills. She was also formerly a Wilhelmina model. What de Lesseps is best known for, though, is her role as a main cast member on the Bravo reality series \"The Real Housewives of New York City\" (RHONY). She has been part of the main cast in every season since the show's premier on March 4, 2008, with the exception of season 6. In season 6 of RHONY, de Lesseps was classified as a \"Friend of the Housewives\" because at the time of filming, she was not living in New York City. She returned as a full-time cast member in season 7.\n\nIn addition to her reality television career, de Lesseps has also dabbled in acting. She guest starred on a February 2011 episode of \"Law & Order: Special Victims Unit\" titled \"Bully\", playing a socialite. She also had a role in the movie \"Movie of All Secrets\" (2020), which was filmed in Bermuda. Additionally, de Lesseps headlined her own cabaret show, \"#CountessAndFriends\", in February 2018. It ran at Feinstein's/54 Below in Midtown Manhattan, and featured de Lesseps singing songs that allude to her life as a countess and reality-tv star. The show also featured appearances from her celebrity friends, such as Rachel Dratch and RHONY co-star Sonja Morgan. She announced she was taking the show on tour in August 2018, with shows scheduled in Long Island and New Jersey.\n\nFurthermore, de Lesseps has also ventured into music, releasing her first record \"Money Can't Buy You Class\" through Ultra Records on May 25, 2010. Her second single, \"Chic, C'est la Vie\" was released in June 2011, and her third single \"Girl Code\" was released in July 2015. She also wrote a book, titled \"Class with the Countess: How to Live with Elegance and Flair\". It was published by Gotham Books on April 16, 2009.\n\nLegal Problems\n\nDe Lesseps was arrested in Palm Beach, Florida, in December 2017, on charges of disorderly intoxication, resisting arrest, battery of an officer ,and making threats against a public servant. She was later released, but was ultimately charged with a third-degree felony on January 25, 2018. After her release, she entered an alcohol treatment program.\n\nHer RHONY co-star Bethenny Frankel confirmed on July 16, 2018, that de Lesseps had skipped the filming of the show's reunion to re-enter an alcohol treatment program, although she left after spending just three weeks in the facility. Also in July 2018, de Lesseps settled the charges from her Palm Beach arrest by agreeing to plead guilty to the misdemeanor charges of battery, disorderly intoxication, and trespassing. In exchange for her guilty plea to the misdemeanor charges, the felony charge of resisting an officer with violence was dropped. She was sentenced to 50 hours of community service, and also had to attend two Alcoholics Anonymous meetings and abstain from drinking alcohol for one year.\n\nIn May 2019, de Lesseps was taken back into custody, this time over alleged probation violations. She was later released, and completed her probation in August 2019.\n\nReal Estate\n\nIn 2013, Luann de Lesseps paid $3.1 million for a home in Sag Harbor, New York. She listed the home for sale in 2018 for $6.25 million but did not get any takers and ultimately removed the listing from the market. In the meantime, when Luann is not using the home herself she offers it for rent. In summer months she rents the home for $90 – $100,000 per month.", "images": ["https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2009/10/LuAnn-de-Lesseps-1.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/wp-content/uploads/2009/10/LuAnn-de-Lesseps.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2009/10/LuAnn-de-Lesseps.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/models/luann-de-lesseps-net-worth/", "title": "LuAnn de Lesseps Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "LuAnn de Lesseps is a former nurse, model, author, and well-known television personality who has a net worth of $25 million. Before her days as a professional model and television star, de Lesseps was a licensed vocational nurse who worked with the elderly ...", "cnw_share_fb_count": 149, "cnw_share_tw_count": 18, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "LuAnn de Lesseps Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/models/luann-de-lesseps-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/10/LuAnn-de-Lesseps.jpg", "site_name": "Celebrity Net Worth", "description": "LuAnn de Lesseps is a former nurse, model, author, and well-known television personality who has a net worth of $25 million. Before her days as a professional model and television star, de Lesseps was a licensed vocational nurse who worked with the elderly ..."}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-05-31T21:55:03+00:00", "published_time": "2020-05-12T00:31:04+00:00", "section": "Models", "tag": "real housewives net worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/10/LuAnn-de-Lesseps.jpg", "title": "LuAnn de Lesseps Net Worth", "description": "LuAnn de Lesseps is a former nurse, model, author, and well-known television personality who has a net worth of $25 million. Before her days as a professional model and television star, de Lesseps ..."}}, "movies": [], "publish_date": 1589243464.0, "source": "https://www.celebritynetworth.com", "summary": ""}