{"url": "https://en.wikipedia.org/wiki/Maluma_(singer)", "text": "Colombian singer, songwriter, actor\n\nLondoño and the second or maternal family name is Arias. In this Spanish name , the first or paternal surname isand the second or maternal family name is\n\nMusical artist\n\nJuan Luis Londoño Arias (born 28 January 1994), known professionally as Maluma, is a Colombian singer, songwriter and actor.\n\nBorn and raised in Medellín, he developed an interest in music at a young age, and began recording songs at age sixteen. He released his debut album, Magia, a year later in 2012. However, his breakthrough album was 2015's Pretty Boy, Dirty Boy, which led to successful collaborations with several artists. He released F.A.M.E. in 2018, to further commercial success. He followed it up with 11:11 in 2019, and Papi Juancho, released without further announcement in 2020. His single \"Hawái\" reached number three on the Billboard Global 200, and became the first number one single on the Billboard Global Excl. U.S. chart. With sales of over 18 million records (albums and singles), Maluma is one of the best-selling Latin music artists.[2] Musically, Maluma's songs have been described as reggaeton, Latin trap, and pop.\n\nMaluma has a number of singles that have charted within the top ten on Billboard Hot Latin Songs, including \"Felices los 4\", \"Borró Cassette\", and \"Corazón\". His collaborative efforts \"Chantaje\" with Shakira and \"Medellín\" with Madonna have reached the top of the Hot Latin Songs and the Dance Club Songs chart, respectively. He has worked with other international artists, such as Ricky Martin, J Balvin, and The Weeknd. Maluma has won a Latin Grammy Award, an MTV Video Music Award, two Latin American Music Awards, and been nominated for a Grammy Award for Best Latin Pop Album.\n\nEarly life [ edit ]\n\nMaluma was born to Marlli Arias and Luis Londoño and grew up with an older sister, Manuela. He took an early interest in football which he started playing as a toddler through middle school, competing in the lower divisions in the teams Atletico Nacional and Equidad Sports Club. Additionally, he developed a keen interest in music during his early teenage years and was famed as a good singer in his high school. He graduated from Hontanares School in El Retiro where he was encouraged by many of his friends to enter local singing competitions.[3]\n\nHe got his first musical break when he was fifteen after he composed, together with a close friend, a song titled \"No quiero\"; a year later Juan Parra, his uncle, offered him the opportunity to record it in a studio as his birthday present.[3] After impressing a group of music producers, he was asked to choose a name that would be easy to remember and be accepted by followers of the urban genre. He chose the stage name Maluma, which is a combination of the first syllable of the names of his mother Marlli, his father Luis and his sister Manuela.[3]\n\nCareer [ edit ]\n\n2010–2013: Beginnings and Magia [ edit ]\n\nMaluma began his musical career in 2010, recording singles. After \"Farandulera\" became a radio hit, Sony Music and its subsidiary label Sony Music Colombia decided to sign the singer to record his first studio album.[4] The label then launched the next single, \"Loco\", which was inspired by \"rampant and uncontrolled love\".\n\nIn 2012, Maluma released his first studio album, titled Magia.[5] The video for the single \"Obsesión\" was filmed at the Antioquia Department Railway Station and featured Colombian model Lina Posada, who had previously appeared in the music video for the song \"Taboo\" (2011) by Don Omar. So far the video has more than 185 million views on YouTube. Other singles released from the album include \"Miss Independent\" and \"Pasarla Bien\", with \"Miss Independent\" reaching number two on the Colombian National-Report songs chart, becoming his first top five song on the chart.[6][7] Maluma was also nominated for a 2012 Shock Award as \"Best New Artist\".[1][8] The final two singles from his debut album, \"Primer Amor\" and \"Miss Independent\"; the latter was accompanied with a music video, recorded in Medellín, gathering 48 million views on YouTube.[9]\n\nMaluma performing in Bogotá , Colombia in 2014\n\nIn 2013, \"La Temperatura\", featuring Puerto Rican singer Eli Palacios, was released as the first single from his upcoming mixtape, PB.DB The Mixtape; the song reached number seven on the National-Report charts. It also became his first single to enter the US charts for the Latin audience by Billboard; it reached number 25 on the Tropical Songs chart, number 8 on the Latin Pop Airplay songs chart, number 24 on the Billboard Hot Latin Songs chart and number 4 on the Latin Rhythm Airplay songs chart.[10][11]\n\n2014–2018: Pretty Boy, Dirty Boy and F.A.M.E. [ edit ]\n\nMaluma's song \"Marinero\" is similar \"GOT7's song \"Thank You\".[12][13]In 2014, he released the music videos for the singles \"La Curiosidad\", \"Carnaval\" and \"Addicted\".[14][15][16] He also collaborated with singer Elvis Crespo, on the theme song \"Olé Brazil\" recorded for the 2014 FIFA World Cup. On 16 July 2014, Maluma appeared at the 2014 Premios Juventud, where he performed \"La Temperatura\". That same month, the singer was confirmed as a judge/coach on Caracol Television's The Voice Kids, alongside Fanny Lu and Andrés Cepeda. In August, he made his debut as a host at the inaugural awards Kids' Choice Awards Colombia of 2014.\n\nMaluma performing during the Festival de Viña del Mar 2017 in Chile\n\nIn early 2015, Maluma released the mixtape PB.DB The Mixtape, a compilation of various singles.[17] His second album Pretty Boy, Dirty Boy was released in late 2015, containing elements of reggaeton, pop and urban music.[18] The singles \"Borró Cassette\", \"El Perdedor\" and \"Sin Contrato\" entered the top 10 on Billboard Hot Latin Songs.[19]\n\nIn April of that year he performed at the newly named Riccardo Silva Stadium for the inaugural match of the new NASL soccer team The Miami FC.[20][21] He then embarked on The Pretty Boy, Dirty Boy World Tour in May 2016.[22]\n\nIn 2017, his hit single \"Felices los 4\" became his fifth top 5 on the Hot Latin Songs chart,[23] followed by \"Corazón\", which also reached the top 5 on the chart. The music videos for both singles have over 1 billion views on YouTube. He also released the short film X, which featured his songs \"GPS\" featuring French Montana, \"Vitamina\" featuring Arcángel and \"23\".[24]\n\nMaluma recorded the Spanish version of \"Colors\", one of the theme songs of the 2018 FIFA World Cup, and performed in English by Jason Derulo.[25] Maluma returned to the Riccardo Silva Stadium in Miami to record the video,[26] one of a growing number of artists using the city to shoot music videos.[27] Maluma's third studio album F.A.M.E. was released on 18 May 2018. In an interview he expressed its name means \"Faith, Alma [Soul in Spanish], Music & Essence\". He worked with producers Jay Cash, Vinylz and collaborators Daddy Yankee, Prince Royce and Jason Derulo on the album.[28][29] He performed \"Felices los 4\" at the 2018 MTV Video Music Awards.[30] With \"Mala Mia\", he topped the Latin Airplay, Latin Pop Songs and Latin Rhythm Airplay charts for the second time in the year, following \"Clandestino\".[31]\n\n2019–present: 11:11 and Papi Juancho [ edit ]\n\nMaluma during the world premiere of music video \" Medellín \" on MTV in April 2019\n\nIn 2019, Maluma collaborated with American singer-songwriter Madonna, appearing on the songs \"Medellín\" and \"Bitch I'm Loca\" from her album Madame X.[32] In April it was announced that Maluma will star in Marry Me alongside Jennifer Lopez.[33] He also featured as a voice actor in Walt Disney Animation Studios film Encanto as Mariano.\n\nOn 17 May 2019, Maluma released his fourth studio album 11:11, supported by the singles \"HP\", \"11 PM\", \"Instinto Natural\" with Sech and \"No Se Me Quita\" with Ricky Martin.[34] Another collaboration with Madonna, \"Soltera\", appeared on the album.[32] To promote the album, Maluma embarked on the 11:11 World Tour, with concerts around the world between May 2019 and September 2020.\n\nOn 26 September 2019, he collaborated with Colombian singer J Balvin on his single \"Qué Pena\".\n\nMaluma surprise-released his fifth studio album, Papi Juancho, on 21 August 2020.[35] The second single from Papi Juancho, \"Hawái\", became a commercial success. It reached number one in multiple countries and topped the Hot Latin Songs chart for nine consecutive weeks, becoming his second number-one hit on the chart. He also released a remix featuring The Weeknd. The remix peaked at number 12 on the Billboard Hot 100 and became Maluma's highest peak on the chart.\n\nOn 29 January 2021, Maluma released an EP titled #7DJ (7 Días en Jamaica) featuring seven songs along with their music videos on his YouTube channel.[36]\n\nArtistry [ edit ]\n\nMaluma performing in 2020\n\nMaluma possesses the vocal range of a tenor.[37][38][39][40][41] Maluma defines his music as \"urban pop\".[42][43] A Billboard editor wrote, \"Maluma's brand of reggaetón syncs nicely with his image, managing to be both romantic and raw. His sound represents an evolution of the genre.\"[4] In a 2016 interview, he stated: \"I grew up with this genre [reggaeton] that literally became life. It is one of the genres that I sing... I am an urban performer, I sing reggaeton. If you listen to my last album [Pretty Boy, Dirty Boy] there are ballads, mambo, merengue and reggaeton and underground stuff. I like to show the versatility that I have to perform.\"[44]\n\nHe has cited Héctor Lavoe, Justin Timberlake and Michael Jackson as his main musical influences.[4][45] While talking about them, Maluma said: \"Justin Timberlake has been a great reference for modern music. But as for music as a sauce, Héctor Lavoe was always the number one artist I admired. I know all his songs, I listen to them every day and there is not one that bores me. He is my great musical inspiration.\"[46] He considers the folkloric elements Shakira incorporated into her music an important influence on his career.[47] He has also said that Ricky Martin \"is one of the artists I wanted to be growing up, He's my idol in the industry\".[48]\n\nPersonal life [ edit ]\n\nMaluma is Catholic but has said he appreciates aspects of other religions.[49]\n\nMaluma's romantic life has been the subject of much speculation, which he has kept private for the most part. However, in an interview in January 2018 he admitted to being in a relationship with Cuban-Croatian model Natalia Barulich.[50] He said of the relationship: \"We have a great time together, we have fun, we love each other, and we also support each other...I think those are the fundamentals. It's the most important thing. Right now, we're dating. We like what we have, I like her company, and she supports me and loves me, so you're all seeing me like never before.\"[51] Maluma and Barulich broke up in 2019.\n\nPublic image [ edit ]\n\nIn 2019, Vogue called Maluma \"Menswear Icon in the Making\", saying \"Maluma has attitude, Maluma has style. He likes his clothes brights and bold, which goes quite nicely with his bright and bold music, personality, and overall demeanor.\"[52] In 2021, he collaborated with Balmain on a Miami-Inspired Capsule Collection.[53] In March, 2022, he launched a clothing line titled Royalty by Maluma, which is a collaboration with Reunited Clothing and Macy's.[54]\n\nThrough his music, he has also carried out social activism, such as the music video for \"El Perdedor\", where showcased the racism and discrimination by the US police to people of Latin descent living in the country.[55][56] Maluma has publicly declared his support for the LGBT community.[57]\n\nIn October 2016, the song \"Cuatro Babys\" featuring Noriel, Bryant Myers, and Juhn received controversy over its lyrics, as some considered them to objectify women. A petition was posted on Change.org demanding the removal of the song from digital platforms.[58] Despite this controversy, the popularity of \"Cuatro Babys\" earned it a 12× Latin Platinum certification by the RIAA.[59]\n\nMaluma has done a number of venture capital investments, including Colombian proptech company La Haus.[60]\n\nAwards and nominations [ edit ]\n\nIn 2013, Maluma was nominated for several awards, including for Best Latin America Central Act at the MTV Europe Music Awards,[61] and the Best New Artist at the Latin Grammy Awards,[62] as well as a win for Best Radio Song at the Shock Awards for \"La Temperatura\".[63] In 2017, Maluma was nominated for two categories at the Billboard Music Awards, including Top Latin Artist.[64] In 2019 he was awarded El Premio ASCAP for Songwriter of the Year.[65] He won a MTV Video Music Award for Best Latin in 2020.\n\nDiscography [ edit ]\n\nStudio albums\n\nTours [ edit ]\n\nFilmography [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Maluma_at_Coca-Cola_Arena.jpg/180px-Maluma_at_Coca-Cola_Arena.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Maluma_and_Madonna_%28cropped%29.PNG/220px-Maluma_and_Madonna_%28cropped%29.PNG", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg/220px-Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Flag_of_Colombia.svg/21px-Flag_of_Colombia.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/19px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Maluma_en_vivo..JPG/200px-Maluma_en_vivo..JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Maluma_-_Sin_contrato_-_Festival_de_Vi%C3%B1a_del_Mar_2017.jpg/170px-Maluma_-_Sin_contrato_-_Festival_de_Vi%C3%B1a_del_Mar_2017.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Maluma_in_2018.jpg/170px-Maluma_in_2018.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Conga.svg/15px-Conga.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg/1200px-Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg/1200px-Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Maluma", "title": "Wikipedia", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg/640px-Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg", "width": 640, "height": 848}, "title": "Maluma - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}