{"url": "https://www.app.com/story/entertainment/television/2018/08/03/mtv-jersey-shore-family-vacation-theyre-here-and-theyre-filming/903031002/", "text": "MTV Jersey Shore Family Vacation: They're here and they're filming\n\nShow Caption Hide Caption MTV Jersey Shore Family Vacation films at Shore MTV Jersey Shore films at the Jenk's and the Headliner Chris Jordan, Asbury Park Press\n\nThey’re here and they’re filming.\n\nThe cast and crew of MTV’s “Jersey Shore Family Vacation,” the hit sequel to “Jersey Shore,” spent the weekend of July 27 filming at nightclubs in Monmouth and Ocean counties.\n\nThe guys hit the Headliner in Neptune on Saturday, July 28 and Monday, July 30 and Jenk’s Club in Point Pleasant Beach on Sunday, July 29, all three times with camera crews in tow.\n\nMore: MTV's 'Jersey Shore Family Vacation' denied permit to shoot in Brick UPDATE\n\nIndications are they’re not done. “Jersey Shore Family Vacation” is hosting a dance-a-thon and auction benefiting the Be The Match: The National Marrow Donor Program on Friday, Aug. 3 at Jenk’s, according to the club. Cast member DJ Pauly D is the guest DJ and the event starts at 8 p.m.\n\nAttempts to reach Jenk’s for comment were unsuccessful.\n\n“I’m not a fan of ‘Jersey Shore’ but I did hear they were here at the boardwalk at Jenk’s during the day (on Sunday),” said Point Pleasant Beach Mayor Stephen Reid.\n\nFilming at Jenk’s would not require a permit from the borough, Reid said.\n\n“As long as it’s on private property, that’s fine,” Reid said. “I don’t get it but I know they have lot loyal viewers all these years later. They’re more mellow because they’re married and have children.”\n\n“Jersey Shore,” originally based in Seaside Heights and produced by 495 Productions, ran on MTV from 2009 to 2012. Most of the cast filmed the 2017 “Reunion Road Trip: Return to the Jersey Shore,” which aired on E!, at Jenkinson’s Pavilion Restaurant.\n\nOn Sunday, cast members cavorted with members of the band Daddy Pop, who were performing at Jenk’s while they were there in the late afternoon.\n\n“Snooki fell over the drums,” said Guy Buonocore Jr. of Neptune, who was there for Daddy Pop. “Her and the other girls went up on stage and were dancing.”\n\n“I don’t think she was drunk but she fell because she had high heels on.”\n\nMTV Jersey Shore at Headliner MTV Jersey Shore Family Vacation films at the Headliner Chris Jordan, Asbury Park Press\n\nNicole “Snooki” Polizzi, Pauly DelVecchio, Jenni “JWoww” Farley, Mike “The Situation” Sorrentino, Vinny Guadagnino, Angelina Pivarnick and unidentified companions were spotted entering the pool area in the back of the Headliner upon exiting two minivan taxis with New York license plates at 3:45 p.m. on Monday.\n\nMore: MTV 'Jersey Shore' returns to Seaside Heights: Who was on the boardwalk?\n\nFilming took place Monday afternoon and Monday night when the cast returned. Jenni, Mike, Pauly D and Vinny played beer pong, without the beer but with garbage cans and volleyballs instead of ping-pong balls and cups.\n\nRonnie had a couch talk time with Snooki and Angelina while the rest of the guys played ball. Drinks and food were enjoyed, and the shoot lasted until 2 a.m. Tuesday morning.\n\n“I think it’s nice exposure for the Jersey Shore,” said Matt Haymond of Hamilton, who was at the Headliner while filming was taking place on Monday. “They come in, do their thing and enjoy the place.”\n\nThe “Shore house” is a bit inland — at 18 Kinney Road in Manalapan. Crew members were seen from the street at 18 Kinney on Saturday, Aug. 4 while about a dozen vans and cars, many with New York license plates, were parked outside. Producers declined to comment for this story.\n\nMichael is a former resident of Manalapan.\n\nSo far, Season 2 of “Jersey Shore Family Vacation” was filmed in Seaside Heights in a two-day shoot, Las Vegas and Atlantic City, according to Press and other reports. The cast was going to film at a home on Rochester Drive in Brick, but officials there denied a permit.\n\nIt’s unclear if filming commenced in Wildwood, as was reported. What is clear is the officials there did not want them.\n\nDeena announces that she’s pregnant and Mike gets married to Lauren Pesce during Season 2, according to trailers. Season 2 debuts Aug. 23.\n\nAttempts to reach MTV representatives for comment were unsuccessful.\n\nChris Jordan: cjordan@app.com. Twitter: @chrisfhjordan", "images": ["https://media.gannett-cdn.com/28911775001/28911775001_5817798371001_5817795950001-vs.jpg?pubId=28911775001", "https://www.gannett-cdn.com/-mm-/4348e298e876523f899a61f6138320f69efe9873/c=0-228-2014-1366/local/-/media/2018/08/03/NJGroup/AsburyPark/636689195046445244-JerseyShoreHeadliner2.JPG?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "http://www.gannett-cdn.com/media/2018/07/30/NJGroup/AsburyPark/636685684267249031-JerseyShoreHeadliner.JPG"], "top_img": "https://www.gannett-cdn.com/-mm-/4348e298e876523f899a61f6138320f69efe9873/c=0-228-2014-1366/local/-/media/2018/08/03/NJGroup/AsburyPark/636689195046445244-JerseyShoreHeadliner2.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Chris Jordan"], "canonical_link": "https://www.app.com/story/entertainment/television/2018/08/03/mtv-jersey-shore-family-vacation-theyre-here-and-theyre-filming/903031002/", "title": "MTV Jersey Shore Family Vacation: They're here and they're filming", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=514649656, app-argument=https://www.app.com/story/entertainment/television/2018/08/03/mtv-jersey-shore-family-vacation-theyre-here-and-theyre-filming/903031002/entertainment/television", "theme-color": "#ffffff", "og": {"title": "MTV Jersey Shore Family Vacation: They're here and they're filming", "description": "Filming has taken place at the  Headliner in Neptune and Jenk’s Club in Point Pleasant Beach; the Jersey Shore house is in Manalapan", "site_name": "Asbury Park Press", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/4348e298e876523f899a61f6138320f69efe9873/c=0-228-2014-1366/local/-/media/2018/08/03/NJGroup/AsburyPark/636689195046445244-JerseyShoreHeadliner2.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "description": "Filming has taken place at the  Headliner in Neptune and Jenk’s Club in Point Pleasant Beach; the Jersey Shore house is in Manalapan", "twitter": {"site": "@asburyparkpress", "creator": "@asburyparkpress", "card": "summary_large_image"}}, "movies": [], "publish_date": 1533250800.0, "source": "https://www.app.com", "summary": ""}