{"url": "www.celebritynetworth.com/richest-celebrities/actors/dean-mcdermott-net-worth/", "text": "What is Dean McDermott's Net Worth and Salary?\n\nDean McDermott is a Canadian-American actor, reality television personality, and producer who has a net worth of $1.5 million. McDermott earned his net worth through his many roles in movies and TV. He is also known for being the husband of Tori Spelling.\n\nDean has more than 80 acting credits to his name, including the films \"A Cool, Dry Place\" (1998) and \"Against the Ropes\" (2004) and the television series \"Due South\" (1995), \"Power Play\" (1998), and \"1-800-Missing\" (2003). McDermott and Spelling have starred in the reality TV series \"Tori & Dean: Inn Love\"/\"Tori & Dean: Home Sweet Hollywood\" (2007–2012), \"Tori & Dean: sTORIbook Weddings\" (2010), \"Tori & Dean: Cabin Fever\" (2014), and \"True Tori\" (2014), and Dean served as an executive producer on all of those shows except \"Tori & Dean: Cabin Fever.\" A professionally trained chef, McDermott hosted \"Chopped Canada\" (2014) and appeared on \"Rachael vs. Guy: Celebrity Cook-Off\" (2013) and \"Top Chef Canada\" (2014), and he published the cookbook \"The Gourmet Dad: Easy and Delicious Meals the Whole Family Will Love\" in 2015.\n\nEarly Life\n\nDean McDermott was born on November 16, 1966, in Toronto, Ontario, Canada. He grew up with mother Doreen, father David, and sisters Dawn, Dana, and Dale.\n\nCareer\n\nMcDermott made both his film and television debut in 1988, appearing in \"Graveyard Shift II\" and guest-starring on an episode of \"T and T.\" He soon appeared in the films \"Straight Line\" (1990) and \"Stepping Out\" (1991), the TV shows \"My Secret Identity\" (1989), \"C.B.C.'s Magic Hour\" (1989), \"Friday's Curse\" (1989), \"Top Cops\" (1992), the miniseries \"Conspiracy of Silence\" (1991), and the television films \"Final Judgment\" (1991), \"Wild C.A.T.s\" (1994), and \"Sodbusters\" (1994). In 1995, Dean played Major Miles Pierce in the film \"Iron Eagle IV\" and landed a recurring role as Constable Turnbull/Bubba Dean/Laurier on the Canadian series \"Due South,\" appearing in 18 episodes. In 1998, he played Mark Simpson on all 26 episodes of the CTV series \"Power Play,\" appeared in the crime thriller \"Bone Daddy,\" and co-starred with Vince Vaughn, Monica Potter, and Joey Lauren Adams in the film \"A Cool, Dry Place. In 2001, McDermott appeared in 11 projects, including the film \"Picture Claire,\" the TV movies \"Brian's Song,\" \"Loves Music, Loves to Dance,\" and \"Hysteria – The Def Leppard Story,\" and the television series \"Tracker\" and \"Relic Hunter.\"\n\nIn 2003, Dean played Alan Coyle on the Canadian crime drama \"1-800-Missing\" and co-starred with Robert Duvall, Kevin Costner, and Annette Bening in the Western \"Open Range.\" He then appeared in the films \"The Skulls III\" (2004), \"Touch of Pink\" (2004), \"Kiss the Bride\" (2007), and \"Saving God\" (2008) and co-starred with Meg Ryan and Omar Epps in the 2004 boxing drama \"Against the Ropes.\" He guest-starred on \"Without a Trace\" (2005), \"The Closer\" (2005), \"NCIS\" (2005), and \"Head Case\" (2009), then appeared in the films \"Irvine Welsh's Ecstasy\" (2011), \"Garlic & Gunpowder\" (2017), and \"Dead Again in Tombstone\" (2017). Dean played Chief Iain Vaughn on the horror series \"Slasher: The Executioner\" (2016), followed by Alan Hayes on \"Slasher: Guilty Party\" (2017), and Dan Olensky on \"Slasher: Solstice\" (2019). In 2018, he appeared in \"The Last Sharknado: It's About Time\" alongside his wife's \"Beverly Hills, 90210\" co-star Ian Ziering, and in 2021, he began playing Det. Barry Hamm on the CBC Television series \"Pretty Hard Cases.\"\n\nPersonal Life\n\nDean married actress Mary Jo Eustace on July 24, 1993, and they welcomed son Jack (born October 10, 1998) before divorcing in 2006 due to McDermott's affair with his \"Mind Over Murder\" co-star Tori Spelling, which began in July 2005. Prior to the split, Dean and Mary Jo had been in the process of adopting a baby, so Eustace adopted the child on her own, and Dean was granted joint custody of Jack. McDermott and Spelling married on May 7, 2006, and they renewed their vows on May 8, 2010. Dean and Tori have five children together: daughters Stella (born June 9, 2008) and Hattie (born October 10, 2011) and sons Liam (born March 13, 2007), Finn (born August 30, 2012), and Beau (born March 2, 2017). In late 2013, it was reported that McDermott had cheated on Spelling, and a month later, he went to rehab to work on \"some health and personal issues.\" Dean and Tori documented the affair's aftermath on the Lifetime series \"True Tori.\"\n\nIn July 2010, McDermott was hospitalized after a dirt bike accident; he suffered a punctured and collapsed lung and spent five days in the hospital. In August 2010, he became an American citizen. In October 2017, court documents filed by Dean's ex-wife alleged that months after she had taken him to court for his failure to pay alimony, he had stopped paying child support. Eustace stated, \"In the last six weeks he has been on two luxurious vacations, Iceland & the four seasons in Punta Mita. He resides in a $2 million estate paid by his mother-in-law, Candy Spelling, and has no impetus to work. He owes over $100,000 moving forward, and I believe he has no intention of paying. He bounces my son's university rent/tuition and is delinquent in paying therapist bills, while he shops visibly and throws lavish parties for his other five children.\"\n\nFinancial Situation\n\nIn October 2013, Tori made the shocking announcement that she was broke and had squandered away every penny she had ever made to the point where she was borrowing money from her mother to pay rent and could not afford a simple medical procedure for her husband. Spelling claimed to have blown through every dollar she ever made acting or inherited from her late father (an estimated $15 – $20 million) on failed real estate investments and lavish purchases for her family. When asked about her exact net worth, Tori replied:\n\n\"I don't have one million dollars. We had some income here and there, but no savings apart from our retirement accounts.\"\n\nMcDermott clarified her statements the next day by telling \"US Weekly\":\n\n\"Right now things are going well. Tori and I are doing just fine financially.\"\n\nIn March 2017, City National Bank filed a lawsuit against Tori and Dean after they failed to pay off $200,000 out of a $400,000 loan. City National also claims that Tori overdrew $17,000 from her checking account. A few months earlier the couple was sued by American Express for $87,000 in credit card debt and $260,000 in unpaid taxes.\n\nReal Estate\n\nIn 2020, Tori and Dean paid $3.7 million for a 5,980 square foot home in the Santa Monica Mountains. The mansion includes five bedrooms, eight bathrooms, a gourmet kitchen, a playroom, and a wet bar, and the property features a swimming pool and a spa with a rock waterfall. The couple previously owned a 6,700 square foot Encino estate, which they sold for $2.5 million in 2011.", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/wp-content/uploads/2010/07/GettyImages-150882727.jpg", "https://vz.cnwimg.com/wp-content/uploads/2010/07/dean.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/07/dean.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/dean-mcdermott-net-worth/", "title": "Dean McDermott Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Dean McDermott is a Canadian-American actor, reality television personality, and producer who has a net worth of $1.5 million. McDermott earned his net worth through his many roles in movies and TV.", "cnw_share_fb_count": 59, "cnw_share_tw_count": 64, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Dean McDermott Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/dean-mcdermott-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/07/dean.jpg", "site_name": "Celebrity Net Worth", "description": "Dean McDermott is a Canadian-American actor, reality television personality, and producer who has a net worth of $1.5 million. McDermott earned his net worth through his many roles in movies and TV."}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-02-19T15:56:35+00:00", "published_time": "2021-06-02T01:15:39+00:00", "section": "Actors", "tag": "tori spelling net worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/07/dean.jpg", "title": "Dean McDermott Net Worth", "description": "Dean McDermott is a Canadian-American actor, reality television personality, and producer who has a net worth of $1.5 million. McDermott earned his net worth through his many roles in movies and TV."}}, "movies": [], "publish_date": 1622596539.0, "source": "http://www.celebritynetworth.com", "summary": ""}