{"url": "https://www.vulture.com/2017/12/best-tv-shows-of-2017.html", "text": "In January, I taped a three-by-five card next to my workstation at home and wrote “Best Shows” at the top of it, like I do every January. Whenever I saw a show that I really liked, I’d add the title to the card. In 1997, the first year in which I wrote about TV full time, I had ten titles on the card by Thanksgiving. A decade later, I’d routinely find myself culling a list of 15 titles when list-making time arrived. By the end of 2016, there were 20 titles on the card. This year, there were 23 strong contenders with another dozen possibles. That’s a reflection not just of how many shows are in production, but also how diverse they are in terms of style, structure, subject matter, and worldview.\n\nnumber 10\n\nThe Carmichael Show (NBC)\n\nJerrod Carmichael’s old-school, social-issues-driven, three-camera-plus-a-live-audience sitcom is one of many quirky outliers to get canceled this year just when it was really getting warmed up. Too bad: This latest batch of episodes could’ve gone toe-to-toe with the best installments of Norman Lear’s Good Times. Many of the episodes, including the one built around David Alan Grier’s character’s confrontation with his mother’s mortality, were ripped directly from the actors’ own lives.\n\nnumber 9\n\nCrazy Ex-Girlfriend (The CW)\n\nRachel Bloom and Aline Brosh-McKenna’s musical-psychological comedy-drama continues to take risks. The back half of season two and the first half of season three were stunning.\n\nnumber 8\n\nSamurai Jack (Adult Swim)\n\nGenndy Tartakovsky caps his series about a stoic samurai’s pursuit of a demon with his career-best work as an animator.\n\nnumber 7\n\nThe Young Pope (HBO)\n\nOf all the current TV series that owe an obvious debt to David Lynch, this quirky yet often visionary religious drama from Paolo Sorrentino is the most original. The deadpan humor sometimes obscured the fact that, when the show talked about spirituality, it wasn’t kidding. The season finale has a cosmic sense of wonder.\n\nnumber 6\n\nThe Deuce (HBO)\n\nFrom The Wire collaborators George Pelecanos and David Simon comes a worthy successor, a period piece about the sex trade in 1970s Times Square that doubles as a corrosive satire on capitalism.\n\nnumber 5\n\nBoJack Horseman (Netflix)\n\nThe fourth season of Raphael Bob-Waksberg’s animated comedy-drama was a series of perfectly executed tales of confrontation, denial, selfishness, and healing.\n\nnumber 4\n\nThe Get Down (Netflix)\n\nBaz Luhrmann and Stephen Adly Guirgis’s musical drama about the birth of hip-hop starts in 1977, set just a few years after another great New York drama, Mad Men, ended. Demographically, narratively, and stylistically, it’s a worthy companion piece, one of a handful of series that can be said to have devised its own language.\n\nnumber 3\n\nBetter Things (FX)\n\nPamela Adlon’s series about single motherhood took more stylistic and tonal risks than last year, and they all paid off. Anyone who’s been a parent or a child will appreciate the truths this show contains.\n\nnumber 2\n\nThe Leftovers (HBO)\n\nDamon Lindelof and Tom Perrotta’s post-Rapture drama finished its three-year run with eight episodes of alternately wrenching, surreal, and bleakly funny storytelling about the psychological aftermath of loss and the quest to superimpose narrative on a seemingly chaotic world. I should admit this pick comes with an asterisk: Lindelof told me that certain themes and images, and the totality of episode five, were inspired by my personal writing about the death of my first wife. I loved the season before I knew that, so I’m leaving The Leftovers where I think it would’ve gone otherwise; however, if you consider the personal aspect disqualifying, go ahead and bump The Leftovers off the list and move everything up a notch. (In that case, AMC’s Better Call Saul would land at No. 10.)\n\nnumber 1\n\nTwin Peaks: The Return (Showtime)\n\nA weekly mind-effing event the likes of which hasn’t been seen since the first year of Lost. This 18-hour series from Twin Peaks co-creators David Lynch and Mark Frost wasn’t a straightforward continuation of the story, but something more like a series of variations or improvisations on familiar characters and situations. It took a while to grasp that it was a largely non-narrative experience, conceived in terms of light and shadow, rhythm and visual rhyme, color and music (most hours ended with a full-length musical performance). Episode eight, which reconceived the postwar history of the United States in mythological terms starting with the first atom bomb test, is a masterpiece; at least five other episodes are nearly as good.\n\n*A version of this article appears in the December 11, 2017, issue of New York Magazine.", "images": ["https://pyxis.nymag.com/v1/imgs/352/929/491f1e3368625cb9152108bdba8f35364b-01-yic-tv.1x.rsocial.w1200.jpg", "https://pyxis.nymag.com/v1/imgs/e33/6e7/aed044d06bd5c293490430f400dc112e41-2022Cov4x5-AsianAmericaPkg.w240.jpg", "https://pyxis.nymag.com/v1/imgs/352/929/491f1e3368625cb9152108bdba8f35364b-01-yic-tv.w1600.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/352/929/491f1e3368625cb9152108bdba8f35364b-01-yic-tv.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Matt Zoller Seitz"], "canonical_link": "https://www.vulture.com/2017/12/best-tv-shows-of-2017.html", "title": "The 10 Best TV Shows of 2017", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "parsely-tags": "vulture homepage lede, vulture section lede, tv, year in culture 2017, best of 2017, the carmichael show, crazy ex girlfriend, samurai jack, the young pope, the deuce, bojack horseman, the get down, better things, the leftovers, twin peaks the return, new york magazine, featuretype:column, featuretype:feature, featuretype:list or roundup, featuretype:new york magazine story", "og": {"title": "The 10 Best TV Shows of 2017", "url": "https://www.vulture.com/2017/12/best-tv-shows-of-2017.html", "description": "Matt Zoller Seitz chooses his favorite TV shows of the year.", "image": "https://pyxis.nymag.com/v1/imgs/352/929/491f1e3368625cb9152108bdba8f35364b-01-yic-tv.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "The 10 Best TV Shows of 2017", "description": "Matt Zoller Seitz chooses his favorite TV shows of the year.", "image": "https://pyxis.nymag.com/v1/imgs/352/929/491f1e3368625cb9152108bdba8f35364b-01-yic-tv.2x.rsocial.w600.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2017-12-04T09:00:00.694-05:00", "tag": "vulture homepage lede, vulture section lede, tv, year in culture 2017, best of 2017, the carmichael show, crazy ex girlfriend, samurai jack, the young pope, the deuce, bojack horseman, the get down, better things, the leftovers, twin peaks the return, new york magazine", "publisher": "https://www.facebook.com/Vulture"}, "description": "Matt Zoller Seitz picks his favorite TV shows of the year, including Twin Peaks: The Return, The Leftovers, BoJack Horseman, Better Things, and more.", "robots": "max-image-preview:large", "sailthru.tags": "vulture homepage lede, vulture section lede, tv, year in culture 2017, best of 2017, the carmichael show, crazy ex girlfriend, samurai jack, the young pope, the deuce, bojack horseman, the get down, better things, the leftovers, twin peaks the return, new york magazine", "author": "Matt Zoller Seitz", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://assets.nymag.com/media/sites/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1512396000.694, "source": "https://www.vulture.com", "summary": ""}