{"url": "https://www.vox.com/culture/2017/9/18/16324442/emmys-2017-winners-losers-handmaids-tale-snl-this-is-us-veep", "text": "The 2017 Primetime Emmy Awards weren’t bad!\n\nRelated All the 2017 Emmy winners\n\nThat might sound like damning with faint praise, but when you consider that the Emmys are pretty regularly the most boring awards show of them all (yes, even more boring than the Oscars), it’s a real treat to be able to say, “Emmys, you were probably more interesting than the 2017 Tony Awards.”\n\nThe speeches were generally pretty good, Stephen Colbert brought plenty of laughs as host, and the show only ran about three minutes over time — which is remarkable considering how few awards had been handed out an hour in.\n\nTo be sure, there were some repeat winners who grated, and the absence of Emmy behemoth Game of Thrones probably made the drama winners artificially interesting. But records were broken, new benchmarks were set, and a streaming service won a major series prize for the first time ever.\n\nSo let’s break the night down, with eight winners and five losers from the 2017 Emmy Awards. (And if you just want a straight list of the winners, we’ve got you covered there, too.)\n\nWinner: The Handmaid’s Tale, for being an Emmy breakthrough\n\nEver since streaming services first started receiving Emmy nominations in 2013 (when Netflix broke through with House of Cards), one question has hung over the proceedings: Would Netflix or Amazon be the first to win the Comedy or Drama Series category?\n\nBoth came close! Netflix had House of Cards and Orange Is the New Black flirt with major prizes at various points throughout their runs. And Amazon was probably very close a couple of years ago for Transparent. But neither had managed to break through in one of the Emmys’ two biggest categories.\n\nBut guess what? The first streaming service to win a series trophy was Hulu! Yes, previous Emmy afterthought Hulu (which had never received a major nomination before this year, much less a win) perfectly executed a release and campaign strategy for its Margaret Atwood adaptation, The Handmaid’s Tale, launching it in April to the tune of massive critical acclaim and a vague sense that the series spoke to right now, when the specter of the Donald Trump administration made an anti-woman dystopia feel more timely than it might have had the 2016 election gone another way.\n\nThe timeliness probably pushed Handmaid’s to its eight Emmy wins, across a host of categories, including all three acting trophies awarded to women (for stars Elisabeth Moss, who won an acting award for the first time after seven previous nominations; Ann Dowd; and Alexis Bledel), the writing and directing prizes, and (of course) Drama Series.\n\nBut it’s worth remembering just how good Handmaid’s Tale — and especially its pilot, for which it won most of its awards — is. Its nightmarish, claustrophobic vision instantly marked it as one of TV’s best shows, and now it has the hardware to prove it (for whatever an Emmy is worth nowadays).\n\nWhat’s more, The Handmaid’s Tale, which is probably not all that well-watched, if a recent survey is any indication, got the ineffable boost a show gets from an Emmy ceremony where it was at the center of everything — right down to the kickline of dancing Handmaids who accompanied Colbert at the end of his opening song.\n\nBut if Handmaid’s Tale and Hulu are winners, then somebody else has to be a loser. And that means...\n\nLoser: Netflix, for continuing to struggle when it comes to pulling in wins\n\nNetflix pulls in lots of nominations every single year — with 91 this year, its biggest total ever — but it continues to struggle to win the biggest prizes available (though it has a mini-streak going in Supporting Actor in a Drama Series, thanks to Bloodline’s Ben Mendelsohn in 2016 and The Crown’s John Lithgow this year). It has yet to win a lead acting prize (which both Amazon and Hulu have) or a series trophy (which Hulu now has).\n\nAnd, look, Netflix still won a pretty significant prize when it won Outstanding Television Movie for the “San Junipero” episode of Black Mirror (which just barely qualified for the prize by being one minute longer than the 60-minute cutoff). But it was obviously hoping for more from its drama contender Stranger Things, which won none of the five awards it was up for at the main ceremony.\n\nNetflix is obviously going to win a big prize someday, but it’s not hard to imagine a world where Stranger Things pulled off the same sort of streak that Handmaid’s Tale did, and that world just didn’t materialize. For now, Netflix remains a major nominations player, but a player that struggles to land major wins.\n\nWinner: Big Little Lies (and, by proxy, HBO)\n\nIt was never really in doubt that Big Little Lies would win big; that it ended up taking home five awards (and three additional awards at the earlier Creative Arts Emmys) still came as something of a surprise.\n\nThe moment when it became clear just how well Big Little Lies was about to do wasn’t Laura Dern winning in her supporting category — though it was a decent sign — but Alexander Skarsgård pulling out an upset in his. And once director Jean-Marc Vallée won, too, Big Little Lies’ eventual Limited Series win was all but a done deal.\n\nNicole Kidman ended up triumphing to win Outstanding Actress amongst particularly tough competition like Feud’s Jessica Lange and Susan Sarandon, and then the Emmys finally let producer and star Reese Witherspoon speak when it awarded the show the Emmy for Outstanding Limited Series overall.\n\nBig Little Lies had the most momentum of any Limited Series going into Sunday’s awards, but the degree to which it ended up dominating is a bigger victory than even HBO might have expected. It also helped spike HBO’s awards totals after the network had earned the most nominations of any network — and made it even more plain just how few Netflix, which had received 91 nominations overall, got by comparison.\n\n(It also didn’t hurt that HBO was able to dominate elsewhere, winning two prizes for Last Week Tonight with John Oliver and two more for Veep. Which brings us to...)\n\nWinner: Julia Louis-Dreyfus, the Emmys’ reigning queen\n\nOnly two actors have won eight primetime Emmy awards for their acting — legend Cloris Leachman and now Julia Louis-Dreyfus, whose sixth consecutive award for her work on Veep marks an Emmy record that seems unlikely to ever be bested.\n\nAnd considering that Veep is ending next year, with its seventh season, it seems incredibly likely she’ll go seven-for-seven and set yet another benchmark, surpassing Leachman in the process.\n\nBut Louis-Dreyfus also set a completely different record with her win, then built upon that record a few moments later. Entering the awards, she was tied with Carl Reiner for the winningest Emmy champ who had won at least one of those awards for performing, thanks to her seven acting prizes and two prizes for producing Veep. (Reiner won three awards for acting, then most of his others for writing and creating The Dick Van Dyke Show.) Her acting win pushed her one ahead of Reiner, and then when Veep won the series trophy shortly thereafter, she went two ahead of him.\n\nThere just aren’t many performers who are even all that close to Louis-Dreyfus at this point. Allison Janney has seven awards, but her work on Mom lost to Louis-Dreyfus. Similarly, John Lithgow leapt up to six prizes tonight with his win for The Crown, but he’s not going to be on that show any longer, so it’s not clear where he would tack on any others.\n\nLike it or not, Julia Louis-Dreyfus is the Emmy queen — unless Cloris Leachman and Carl Reiner can stage an unlikely comeback. Give it some thought, Cloris and Carl! You know Netflix would pick up at least 10 episodes of Cloris and Carl.\n\nWinner: Sterling K. Brown, for repping broadcast television\n\nThe last time a black actor won the Lead Actor in a Drama Series trophy, it was Andre Braugher, for Homicide, back in 1998. And the last time an actor in a broadcast series won this prize, it was James Spader for ABC’s Boston Legal in 2007. Sterling K. Brown’s highly deserved win for This Is Us, then, stood out as a big win in multiple ways. (Broadcast dramas, in particular, have struggled mightily in the 2010s, with This Is Us being the first nominated for Drama Series since The Good Wife in 2011.)\n\nBut Brown’s win is here for more than just its historic qualities. It’s also here because his speech was probably the best of the night, with a stirring tribute to performances that had won in his category before (including Breaking Bad’s Bryan Cranston and Mad Men’s Jon Hamm) and a terrific nod toward Braugher himself.\n\n“I just want to say Mr. Braugher, whether at Stanford university or on this Emmy stage it is my supreme honor to follow in your steps,” Brown said, before pivoting to thanking his TV family. “Milo, Mandy, Justin, Chrissy — you are the best white TV family that a brother has ever had. Better than Mr. Drummond, better than them white folks at Webster.”\n\nLoser: The Reality Competition category, for being stuck in its ways\n\nEver since 2003 when this category first came into existence, the Television Academy has awarded exactly three reality competition shows: The Voice (2013, 2015 to 2017), The Amazing Race (2003 to 2009, 2011 to 2012, 2014), and Top Chef (interrupting The Amazing Race’s hot streak for exactly one year in 2010).\n\nMore than most any other category, voters seem content to go on autopilot here, and it’s a shame, especially when it means shutting out worthy contenders like So You Think You Can Dance and RuPaul’s Drag Race, the latter of which was (finally!) nominated for the first time this year. Time to sashay away, Emmy voters, and come back next year with some new ideas for a category that could be full of better ones.\n\nWinner: Donald Glover\n\nWhile FX’s surreal Atlanta didn’t get to upset perennial favorite Veep in the Outstanding Comedy Series category, its creator and star, Donald Glover, did manage to make history with two historic wins.\n\nNot only did Glover’s win for Outstanding Actor in a Comedy Series mark the first time a black man won that category since Robert Guillaume won for Benson in 1985, but his triumph in comedy directing — which he insisted on sharing in spirit with Atlanta auteur Hiro Murai — made him the first black man to win that category, ever.\n\nIt was a huge night for Glover, not to mention a great vote of confidence for a purposefully strange show that delights in smashing TV norms into pieces. And by the end of the night, it must’ve also been a relief for FX to have these wins at all…\n\nLoser: FX, which stumbled a bit\n\nYou have to imagine when FX cast Ewan McGregor in season three of Fargo, it wasn’t thinking, “We’ll bet he’s going to lose to Riz Ahmed at the Emmys!”\n\nAhmed — who gave a searing, soulful performance in The Night Of — was absolutely the right pick, but that FX couldn’t win a single award in the limited series categories it’s had such success in over the past few years had to hurt. Even its Emmy good luck charm, Jessica Lange (who won two separate Emmys for her work on FX’s American Horror Story) couldn’t win for Feud. Most likely, nobody at FX went into the night thinking the network would win just two prizes — both of Glover’s awards.\n\nTo be sure, the series that FX lost most of its Emmys to — HBO’s Big Little Lies — isn’t going to be back next year, while FX will have most of its major Emmy limited series players (including a new season of 2016 Emmy king American Crime Story). For whatever reason, the old Hollywood glitz and glamour of Feud just never caught on with the Academy — or (probably more accurately) Big Little Lies just stole all the buzz available.\n\nBut where FX has made real Emmy headway over the past several years, it felt like 2017 took it back just a bit, from The Americans’ failure to hold on in the drama series category (after receiving its first nomination there in 2016) to its stumbles at the actual ceremony.\n\nFX is in no danger of being forgotten by the Academy — at least not so long as it continues to employ Emmy-friendly talents like Ryan Murphy and Glover — but the 2017 ceremony had to sting just a bit.\n\nWinner: Saturday Night Live for riding its political surge to serious Emmy victory\n\nSaturday Night Live — which had tied Westworld for the most nominations this year at 22 nods — is a perennial Emmy presence, and likely will be until creator Lorne Michaels dies in his desk chair. But its nine wins — including the ultimate Variety Sketch Series prize — were still particularly striking this year, especially when it came down to the acting categories.\n\nHosts Melissa McCarthy and Dave Chappelle both won in the Guest Actor in a Comedy Series categories. Alec Baldwin nabbed his third Emmy for Supporting Actor in a Comedy Series for his pouting portrayal of President Trump. Kate McKinnon took home her second Emmy for Supporting Actress — beating not one, but two of her nominated castmates — for her portrayals of several thousand wide-eyed weirdos.\n\nIn other words, SNL absolutely dominated the comedy acting categories. This would be a surprise given the kinds of scripted comedies, like Atlanta and Veep, that were otherwise nominated in that category, if it weren’t for the unavoidable fact that SNL’s place as TV’s most prominent source of political sketch comedy also made it hard for voters to resist this year in particular. It’ll be interesting to see if this — and/or Baldwin’s rapidly unenthused Trump impression — bears out next year, too.\n\nLoser: Westworld, which couldn’t keep the HBO momentum going\n\nWestworld had 22 nominations, including seven nominations just at the main ceremony. (The other 15 were awarded at the Creative Arts Emmys earlier in September.) It also had the Emmy-dominant HBO — which won series prizes for Variety Talk, Comedy, and Limited Series, remember — backing it.\n\nBut it lost all of those awards, and the five it won at the Creative Arts Emmys were in far less competitive categories. The Handmaid’s Tale sucked all of the momentum out of the drama race, leaving Westworld grasping at straws.\n\n(That said, it was the center of a very funny skit featuring Colbert early in the ceremony, so not all is lost. See you in 2018, Westworld!)\n\nWinner: Stephen Colbert, host with the most (usually)\n\nIt is no surprise that Stephen Colbert proved a constantly capable and engaging host, always ready with a quip at just the right moment and a fusillade of political jokes. But Colbert also had just the right amount of snark ready to tweak Hollywood’s casual liberalism and the industry’s self-image.\n\nHe made fun of Donald Trump’s desperation to win an Emmy. He gamely played a robot on the fritz in the aforementioned Westworld skit. He commiserated with Jimmy Kimmel over cocktails after both lost to John Oliver. He even sang and danced. It was, all around, a really great performance for an Emmy host, and he managed to keep from completely disappearing from the show when things started to run behind, which is tough to do.\n\nBut it wasn’t all chuckles and fun for Colbert. One bit, in particular, fell flat.\n\nLoser: Stephen Colbert, for allowing Sean Spicer to upstage him\n\nTo be fair, Colbert welcoming former press secretary Sean Spicer to the stage to exaggerate the ceremony’s ratings didn’t exactly flatline in the theater itself. In fact, the second Spicer rolled out on that podium a la McCarthy on SNL, the audience gasped and clapped like it couldn’t quite believe what it was seeing (shoutout to Veep’s Anna Chlumsky for a particularly fun jaw-drop, which was so severe it looked like she was about to unhinge her jaw and swallow the stage whole).\n\nBut taking a step back from the immediate shock and awe of enlisting Spicer to send up his own time in the White House made the whole bit feel … well, icky. Colbert spends night after night tearing down the lies coming out of the Trump administration, so for him to turn around and welcome their former defender felt off, to say the least. And if you’re sitting there thinking that maybe getting Spicer to acknowledge he stretched the truth was the point and everyone knew it, Spicer’s reception backstage was reportedly pretty glowing.\n\nSo, we’re honestly not sure what Colbert intended with this bit. But it was an undeniably very strange move — and one that ended up eclipsing a solid performance, besides.\n\nWinner, tentatively: diversity\n\nOn the one hand, hearing the Emmy broadcast constantly tout this year’s record-breaking Diversity-with-a-capital-D was at times, dangerously close to becoming self-congratulatory in a way that covers up the fact that breaking down systemic inequality is much harder than spotlighting a handful of non-white people once in a while.\n\nOn the other, this year’s Emmys really did end up awarding non-white people in a way that represents some real breakthroughs. In addition to Glover and Brown’s victories, Master of None’s Lena Waithe also became the first black woman to win for comedy writing, and Ahmed became the first man of Asian descent to win an acting Emmy ever.\n\nThese are all great and worthy wins — but yes, the fact that it took this long for some of these milestones to come about is a depressing one. The real litmus test for whether TV and the Academy means what it says about encouraging diversity will be if wins like Waithe and Ahmed’s end up representing a sea change for representation in more categories in general, or remain frustrating anomalies.\n\nCorrection: The reality competition category began in 2003, not 2000.", "images": ["https://cdn.vox-cdn.com/thumbor/AETVPnZ0B0eTzOXyfJpggDYGGg4=/0x0:3485x2316/1200x0/filters:focal(0x0:3485x2316):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9269327/848685448.jpg", "https://cdn.vox-cdn.com/thumbor/uhj_tLZ1enw6ges28wzy_aPv7_U=/0x0:3000x2371/1200x0/filters:focal(0x0:3000x2371):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9269325/848681170.jpg", "https://cdn.vox-cdn.com/thumbor/n3CAei48zpVfcd6rhFa9middrfk=/0x0:3000x2103/1200x800/filters:focal(1260x812:1740x1292)/cdn.vox-cdn.com/uploads/chorus_image/image/56725435/848685914.0.jpg", "https://cdn.vox-cdn.com/thumbor/LhVSG9LdIIcC66JTf9XzcTunBc8=/0x0:3561x2366/1200x0/filters:focal(0x0:3561x2366):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9269349/848645632.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs", "https://cdn.vox-cdn.com/uploads/chorus_image/image/71466750/GettyImages_1243654244.0.jpeg", "https://cdn.vox-cdn.com/thumbor/fdZ3sw78cLVpsnTU550ClGxgDFg=/0x0:3000x2036/1200x0/filters:focal(0x0:3000x2036):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9269321/848697430.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/71468545/1243767428.0.jpg", "https://cdn.vox-cdn.com/thumbor/8ICtkcpe80EvNV-GBAZDfUPYrXM=/0x0:3000x2093/1200x0/filters:focal(0x0:3000x2093):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9269335/848697302.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/71467244/VDC_VBD_012_THUMB_SYN.0.jpeg", "https://cdn.vox-cdn.com/thumbor/fa_hi-mYb7SNx-jF3PZUTGx6PL0=/0x0:3000x1975/1200x0/filters:focal(0x0:3000x1975):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9269333/848660228.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/71469964/GettyImages_1055017430a.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/71466958/GettyImages_1241762727.0.jpg", "https://cdn.vox-cdn.com/thumbor/V3mo1lKKr2USmkVc32Z4_X4qbA4=/0x0:4802x3202/1200x0/filters:focal(0x0:4802x3202):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9269355/848656286.jpg", "https://cdn.vox-cdn.com/thumbor/vHsdUa0S8iq-Iboqi88qsiH6RgA=/0x0:3113x2657/1200x0/filters:focal(0x0:3113x2657):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9269341/848626658.jpg", "https://cdn0.vox-cdn.com/thumbor/_q-TiGNHXrcs4AcMOWUhYIIPi64=/0x246:3485x2071/fit-in/1200x630/cdn3.vox-cdn.com/uploads/chorus_asset/file/9269373/848685448.jpg", "https://cdn.vox-cdn.com/thumbor/XqgK6uM5f-sVFebdORPgdIdNn-g=/0x0:3000x2331/1200x0/filters:focal(0x0:3000x2331):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9269323/848629974.jpg", "https://cdn.vox-cdn.com/thumbor/G8tuGAVEmSBqG4tqnskdlV4sn_c=/0x0:3000x1994/1200x0/filters:focal(0x0:3000x1994):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/9269369/848704244.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/71466194/1241919618.0.jpg"], "top_img": "https://cdn0.vox-cdn.com/thumbor/_q-TiGNHXrcs4AcMOWUhYIIPi64=/0x246:3485x2071/fit-in/1200x630/cdn3.vox-cdn.com/uploads/chorus_asset/file/9269373/848685448.jpg", "keywords": [], "authors": ["Emily St. James", "Caroline Framke", "Rebecca Leber", "Jonathan Guyer", "Christophe Haubursin", "Andrew Prokop", "Umair Irfan", "Sep"], "canonical_link": "https://www.vox.com/culture/2017/9/18/16324442/emmys-2017-winners-losers-handmaids-tale-snl-this-is-us-veep", "title": "8 winners and 5 losers from the 2017 Emmy Awards", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Vox", "article": {"publisher": "https://www.facebook.com/Vox", "published_time": "2017-09-18T00:37:49-04:00", "modified_time": "2017-09-18T09:06:54-04:00"}, "author": "Emily St. James", "style-tools": "https://www.vox.com/style/community/441/ff4dfa009ef17ae1c4f5b58aee1eab98/tools.css", "p": {"domain_verify": "d4410485bd6277c2bf2ce0f277819dc6"}, "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "ahrefs-site-verification": "1e57a609922037a3fbdc1c22efd7334113f174f15608f37e1b8538a7b4ce64c3", "description": "Winners: The Handmaid’s Tale, Saturday Night Live, and Sterling K. Brown. Losers: Netflix and FX.", "og": {"description": "Winners: The Handmaid’s Tale, Saturday Night Live, and Sterling K. Brown. Losers: Netflix and FX.", "image": {"identifier": "https://cdn0.vox-cdn.com/thumbor/_q-TiGNHXrcs4AcMOWUhYIIPi64=/0x246:3485x2071/fit-in/1200x630/cdn3.vox-cdn.com/uploads/chorus_asset/file/9269373/848685448.jpg", "alt": "69th Annual Primetime Emmy Awards - Press Room", "height": 630, "width": 1200}, "site_name": "Vox", "title": "8 winners and 5 losers from the 2017 Emmy Awards", "type": "article", "url": "https://www.vox.com/culture/2017/9/18/16324442/emmys-2017-winners-losers-handmaids-tale-snl-this-is-us-veep"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.vox.com/culture/2017/9/18/16324442/emmys-2017-winners-losers-handmaids-tale-snl-this-is-us-veep", "title": "8 winners and 5 losers from the 2017 Emmy Awards", "description": "Winners: The Handmaid’s Tale, Saturday Night Live, and Sterling K. Brown. Losers: Netflix and FX.", "image": {"identifier": "https://cdn0.vox-cdn.com/thumbor/_q-TiGNHXrcs4AcMOWUhYIIPi64=/0x246:3485x2071/fit-in/1200x630/cdn3.vox-cdn.com/uploads/chorus_asset/file/9269373/848685448.jpg", "alt": "69th Annual Primetime Emmy Awards - Press Room"}, "site": "voxdotcom"}, "robots": "max-image-preview:large", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/hub/sbnu_logo_minimal/441/touch_icon_ipad_retina_1000_yellow.755.png", "msapplication-TileColor": "#4f7177", "outbrainsection": "latest-news"}, "movies": [], "publish_date": 1505689200.0, "source": "https://www.vox.com", "summary": ""}