{"url": "www.wmagazine.com/story/miley-cyrus-liam-hemsworth-more-private-breakup", "text": "Miley Cyrus and Liam Hemsworth are still very much an item, despite a recent report speculating that the couple had broken up. But don’t expect them to make any grand public appearances soon. Instead, the pair are going to be laying low for a while so they can have as much privacy as possible. Which means you might not see any cute couple antics on Instagram stories for a while.\n\nAccording to the latest update on their relationship, Cyrus and Hemsworth are “very much still together and have just been trying to be more private about their relationship,” a source told E! News, adding, “They have been spending a lot of their time being low-key in Nashville lately, and come home to Malibu often to spend time with family.”\n\nAs it turns out, the reason Cyrus deleted all her Instagram posts—including ones with Hemsworth—is that she’s shifting how she presents herself to the world in anticipation of her next album, the followup to 2015’s Miley Cyrus & Her Dead Petz and 2017’s Younger Now. “Miley is working on new music and rebranding herself, hence why she deleted her Instagram photos,” the source says, “She is starting the process of a new music project and wants a clean slate.”\n\nThat clean slate may also include wedding plans, although as of now no date has been set. “Wedding planning has been a continuous conversation over the years but they have not locked in any set plans,” the source says. “Their family would love for them to finally tie the knot, and are very excited about it, but no one is pushing them. Miley is very simplistic when it comes to her ideas and does not want things to be an ordeal. Both Miley and Liam want to have children and they both want to be married but aren’t trying to rush the process.”\n\nThe last time Cyrus opened up about marriage, though, she said it wasn’t something she was necessarily interested in. “I’m just riding this out,” she said last fall. “I don’t envision marriage. I’m 24. I hope I get to live a little bit more. I have too much living to do.” This time, however, she’ll be doing much of that living behind closed doors.\n\nRelated: Miley Cyrus Says Playing Hannah Montana Did “Extreme Damage in My Psyche”", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/wmag/2018/07/20/5b51fd3919a1593a76295694_Miley-Cyrus-and-Liam-Hemsworth-wedding-plans.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2022/10/5/47b5fa0f-fc48-4cb1-9604-6f5821fa832d-getty-1430611960.jpg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5093&fp-y=0.3502", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/wmag/2018/07/20/5b51fd3919a1593a76295694_Miley-Cyrus-and-Liam-Hemsworth-wedding-plans.jpg?w=414&h=276&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/8/29/9f122c0b-8ad0-4d04-b2cf-3379547870db-tswifty.jpeg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.532&fp-y=0.228"], "top_img": "https://imgix.bustle.com/wmag/2018/07/20/5b51fd3919a1593a76295694_Miley-Cyrus-and-Liam-Hemsworth-wedding-plans.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wmagazine.com/story/miley-cyrus-liam-hemsworth-more-private-breakup", "title": "Miley Cyrus and Liam Hemsworth Are Going to Be More Private After Breakup Rumors", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@wmag", "card": "summary_large_image", "creator": "@marissagmuller"}, "article": {"publisher": "https://www.facebook.com/wmagazine"}, "og": {"site_name": "W Magazine", "url": "https://www.wmagazine.com/story/miley-cyrus-liam-hemsworth-more-private-breakup", "type": "article", "title": "Here's Why You'll See Less of Miley Cyrus and Liam Hemsworth Together", "description": "They're still going strong despite breakup rumors.", "image": {"identifier": "https://imgix.bustle.com/wmag/2018/07/20/5b51fd3919a1593a76295694_Miley-Cyrus-and-Liam-Hemsworth-wedding-plans.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "They're still going strong despite breakup rumors."}, "movies": [], "publish_date": null, "source": "http://www.wmagazine.com", "summary": ""}