{"url": "https://www.notablebiographies.com/Sc-St/Selena.html", "text": "Selena Biography\n\nBorn: April 16, 1971\n\nLake Jackson, Texas\n\nDied: March 31, 1995\n\nCorpus Christi, Texas\n\nHispanic American singer\n\nOften called the \"Mexican Madonna,\" Selena used her talent and voice to become one of popular music's fastest rising stars. Although she was murdered very early in her career, she brought great exposure to Tejano, or Tex-Mex, music.\n\nA musical family Selena Quintanilla-Perez was born on April 16, 1971, in Lake Jackson, Texas. Her parents were Abraham Jr. and Marcella Quintanilla. Her father had led a band in the 1950s and 1960s that played early rock and roll songs mixed with traditional Mexican music. This music, later called Tejano music, would become very popular throughout the southwest United States and Mexico. Abraham eventually gave up his music career to start a family. Selena was the youngest of the three Quintanilla children. She attended elementary school in Lake Jackson, a small town about fifty-five miles south of Houston, Texas. When she was six years old, her father saw her talent. He was teaching her older brother, Abraham III, to play guitar when Selena began to sing. The children formed a family band. They practiced almost every day.\n\n\"Selena and the Boys\" In 1980 Selena's father opened a restaurant. The family band, called Selena y Los Dinos, would play there on weekends and at weddings and parties. Her father began to write original Spanish-language songs for the band to perform. Since Selena's first language was English, she had to learn the words to the Spanish-language songs syllable by syllable. They had many local fans, but the family restaurant failed and closed down. Her father moved the family to his hometown of Corpus Christi, Texas, to start over again. Traveling all over the state, the band continued to perform their music. The concert touring paid off when the band opened for a popular Tejano act called Mazz. At age eleven, Selena took the stage by storm and the crowd loved her. At this time, Selena focused on her music but often missed classes and stopped going to school for good when she was in the eighth grade. To keep up with her schooling, she took courses through the American School in Chicago. She eventually earned her General Education Diploma (GED) in 1989, which is the same as earning a high school diploma.\n\nEarly recordings Selena took some time out from touring to record music. For Corpus Christi's Freddie label, Selena recorded Mis Primeras Grabaciones in 1984. Freddie was one of the oldest and most established Spanish-language record companies in Texas. The album and its only single, \"Ya Se Va,\" did not sell well. Switching to Cara and Manny record labels, Selena's albums did not sell much better. Living in a van, the band continued to tour by opening for larger Tejano acts in the southwest United States. For larger and larger audiences, the band learned to play many different styles of music. They played rhythm-and-blues-based music in larger cities. They played more traditional Tejano music in small Texas towns. In 1988 Selena was popular enough that she was voted the female artist of the year at the Tejano Music Awards. She would win this award again for the next seven years. Her popularity increased every year.\n\nGrowing success In 1989 Selena joined EMI Records. She suddenly had a major record company supporting her. José Behar, the head of the company's new Latin music division, knew that she could appeal to a very wide audience, not just Tejano fans. In 1991 her song with Alvaro Torres, called \"Buenos Amigos,\" became a hit. The song went to number one on Billboard 's Latin chart and introduced her to audiences throughout the United States. With her next hit song, \"Donde Quiero Que Estes,\" Selena continued to grow in popularity and reach wider and wider markets for her music. The early 1990s included many bright spots in Selena's music and personal life. On April 2, 1992, Selena married twenty-two-year-old Christopher Perez. He was the lead guitarist in her band. Together they shared in the success and in Selena's growing popularity, particularly in Mexico. Her father was now writing more international-sounding songs for her. These new songs were not only popular in Mexico but also began to be heard throughout the United States and in South and Central America. The size of the audiences at her shows swelled. In February 1994 more than sixty thousand people saw her perform in Houston. In March 1994 her album Selena Live won a Grammy Award for the best Mexican American album. Selena's growing fame also increased record sales. In July 1994 Selena released Amor Prohibido. The album would sell more than one million copies. It was the top selling Latin album of that year. It also was named the Tejano Music Award's album of the year.\n\nEnglish-language success Selena was often compared with other English-language artists such as Madonna (1958–), Janet Jackson (1966–), and Mariah Carey (1969–). She was eager to make an album in her first language so that she could have the same kind of success that these artists had. In December 1993 Selena was moved to a record company that made mostly English-language records. She began recording English-language songs for a new album and continued performing. On March 31, 1995, Selena was shot and killed by the president of her fan club, Yolanda Saldívar (1960–). Millions mourned her death and with this attention she became even more famous. Dreaming of You, the album released after her death in 1996, contained five songs sung in English. It also contained a number of traditional Tejano songs. The album was a huge hit and sold more than a million copies. It was the wide success that Selena had always hoped for. The album also introduced Tejano music to millions of new fans. At the Houston Astrodome, a place she often performed, she was honored with a memorial concert. A movie was made about her life, starring Jennifer Lopez (1970–), a year later.", "images": ["https://www.notablebiographies.com/images/uewb_09_img0638.jpg", "https://www.notablebiographies.com/bs/i/biography.png", "https://www.notablebiographies.com/images/comment.moderate.gif", "https://www.notablebiographies.com/bs/i/biography-sm.png"], "top_img": "https://www.notablebiographies.com/images/uewb_09_img0638.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "life, family, children, parents, story, death, school, old, information, born, movie", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow"}, "movies": [], "publish_date": null, "source": "https://www.notablebiographies.com", "summary": ""}