{"url": "www.billboard.com/articles/columns/pop/8459823/beyonce-jay-z-on-the-run-ii-tour-live-review", "text": "There’s a point where Beyoncé has had enough, and we know she’s close to breaking because we do not hear her make a sound.\n\nAfter belting through a mash-up of “Sorry” and “Me, Myself And I” at the On The Run II Tour kick-off on Wednesday night (June 6), she sauntered offstage, bathed in darkness as the titanic screens behind her unpacked the Carters’ catastrophe. Suddenly, we’re watching her and JAY-Z seethe at home as a staring contest rolls into the boil of an argument. As the scene unfurls moments after “He better call Becky with the good hair” echoed throughout Cardiff’s Principality Stadium, the subject of the fraught conversation is clear. Images of their growing family and the frame of a house engulfed in flames followed, with Beyoncé kneeling before the inferno and Jay standing, stunned, as the bones of his home disintegrate.\n\nThey say nothing, but they don’t have to. We know who lit the match. Those who were hoping for generous glimpses into Beyoncé and JAY-Z’s evolution as husband, wife and parents since the last On The Run tour in 2014 should be careful what they wish for, because On The Run II delivers on that front without compromise to exquisite and devastating degrees.\n\nExplore See latest videos, charts and news Beyoncé Jay-Z See latest videos, charts and news\n\n“Sorry” is one of the many songs indicting JAY-Z’s infidelity on Lemonade, Beyoncé’s 2016 visual album, which he would address in his own way on 2017’s 4:44. Both records are rife with pain and the complications of commitment, as it’s clear the couple was — is — intent on working through the brutality of his betrayal and its excruciating aftermath, both at home and in their respective recording studios. They made it through the blaze and rebuilt what was destroyed, but On The Run II doesn’t discard the smoldering embers of indiscretion in favor of the shiny next chapter of a shared life and love renewed.\n\nBeyoncé and JAY-Z are human and have their limits like everyone else, and they’ve mounted a production that pushes them to theirs in order for us to understand how deeply earned and hard won this catharsis was — and how superhuman they were to channel this anguish into such profound work.\n\nThat extends beyond On The Run II’s emotional anchor. Both are coming to their latest joint venture with an impressive set of wins collected since On The Run’s first outing nearly four years ago — a feat itself, as it grossed over $100 million by the time it wrapped. 4:44 and its subsequent trek gave Jay his highest-grossing solo tour to date and his fourteenth No. 1 album, while Lemonade, her sixth No. 1 album, went on to make Hot 100 history when every one of its songs charted simultaneously.\n\nThe most recent of these accolades is Beyoncé’s staggering (and historic) Coachella set, which redefined what a headliner can achieve and imbued Lemonade and the rest of her hit-laden discography with an even bolder bombast thanks to the might of an HBCU-inspired marching band and dance corps.\n\nA post shared by Beyoncé (@beyonce) on Jun 6, 2018 at 1:47pm PDT\n\nBeychella posed a challenge in and of itself — how was Beyoncé going to top herself after that, and so soon after the fact? — but On The Run II succeeds in condensing the vibrant brass and percussive step team choreography of her Coachella performance into a formidable package streamlined for the road. The incredible On The Run II band boasts not one but two tubas, two bassists (with Lauren Robinson’s “Deja Vu” feature standing out as a highlight), two guitars (Ariel O’Neal’s “I Don’t Care” solo was a showstopper, too) and ample strings, among other talented singers and players.\n\nAn innovative stage setup kicked the production value up with the addition of Club Carter, a 700-person nightclub taking over the area between the catwalks, and a platform that moved Bey, Jay and their dancers deep into the heart of the arena at various points throughout the night. The show leaned on their shared affinity for film as well, as the visual interludes were crucial for picking up the story the Carters left off.\n\nThe selection of Lemonade and 4:44 tracks on the setlist was surprisingly modest, which made the vignettes — especially the ones throwing to the conflict that shaped their most recent creative output — all the more potent. Burning houses, tropical baptisms, voyeuristic visions of a harness-clad Beyoncé and JAY-Z in a cash-covered motel room, family footage of Blue, Sir and Rumi with their doting parents, the cartoon for “The Story of O.J.” — no image was gratuitous, each one a metaphor that packed the same punch as Jay’s bars or Bey’s verses.\n\nA post shared by Beyoncé (@beyonce) on Jun 6, 2018 at 2:38pm PDT\n\nConsidering the mammoth visuals of the 4:44 tour and the technical and musical prowess of Beychella and the Formation tour before it, On The Run II was the sum of exceptional parts — and one that elevated Beyoncé and JAY-Z’s happiest and most harrowing memories in their most challenging performance yet. They spent about a quarter of the show on their collection of duets, opening with the explosive “Magna Carta Holy Grail” and delighting in throwbacks “Upgrade U” and “Deja Vu.” Old favorites got new makeovers, with “Baby Boy” seguing into a reggae-inflected meditation and “Naughty Girl” invoking Bob Fosse’s iconic Sweet Charity choreography to a bellydance-ready beat. Noticeably absent were lighthearted standards like “Single Ladies (Put A Ring On It),” “Love On Top” and other chart-toppers of Beyoncé’s, though the heavier cuts — like “Resentment” off 2006’s B’Day, or 4‘s stadium shredder “I Care” — flowed with the thematic undercurrent of the evening.\n\nTheir commitment to social justice shone through at various points: JAY-Z hit the stage in a bulletproof vest to perform “99 Problems” as mug shots of numerous celebrities — Meek Mill, David Bowie, civil rights activist Angela Davis, Lisa “Left Eye” Lopez and more — towered above him, and the clip of Nigerian author Chimamanda Ngozi Adichie speaking on feminism in Beyoncé’s “Flawless” found a new, fitting home in the final measure of “Run the World (Girls).”\n\nStill, the moments when they were singing solely for each other brought it all back to why On The Run II was happening in the first place: JAY-Z was at his happiest and most relaxed in Beyoncé’s orbit, and the sheer joy emanating from them both when they came together for “Young Forever” was intense, especially at the conclusion of this multi-sensory, two-hour journey. As Beyoncé soared through her take on Ed Sheeran’s “Perfect” before “Young Forever,” tape of a vow renewal ceremony — featuring Blue, Sir, Rumi, JAY-Z and Beyoncé in white — rolled behind them. With On The Run II, Beyoncé and JAY-Z didn’t shy away from the pain that nearly broke them. They celebrated it, as it proved that breaking points forge new beginnings.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif", "https://www.billboard.com/wp-content/uploads/media/beyonce-jay-z-on-the-run-2-tour-official-press-2018-billboard-1548.jpg?w=1024"], "top_img": "https://www.billboard.com/wp-content/uploads/media/beyonce-jay-z-on-the-run-2-tour-official-press-2018-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Hilary Hughes"], "canonical_link": "https://www.billboard.com/music/pop/beyonce-jay-z-on-the-run-ii-tour-live-review-8459823/", "title": "Beyonce & JAY-Z Show Strength In Vulnerability At Sensational On The Run II Tour Kick-Off", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "The superstar couple didn't shy away from the controversy during their tour launch at Cardiff's Principality Stadium, or from raining down a parade of their biggest hits.", "news_keywords": "bbnews, beyonce, live music", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 8459823, "author": "Hilary Hughes", "pmc-category": "Music,Pop", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-06-07T08:29:27"}, "pmc-tag": "bbnews,beyonce,live music", "title": "Beyonce & JAY-Z Show Strength In Vulnerability At Sensational On The Run II Tour Kick-Off", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Hilary Hughes", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 8459823, "title": "Beyonce & JAY-Z Show Strength In Vulnerability At Sensational On The Run II Tour Kick-Off", "published_at": "2018-06-07 08:29:27", "image": "https://www.billboard.com/wp-content/uploads/media/beyonce-jay-z-on-the-run-2-tour-official-press-2018-billboard-1548.jpg?w=1024", "comment_count": 0, "tags": "live music", "topics": "Pop", "body": "There’s a point where Beyoncé has had enough, and we know she’s close to breaking because we do not hear her make a sound.After belting through a mash-up of “Sorry” and “Me, Myself And I” at the On The Run II Tour kick-off on Wednesday night (June 6), she sauntered offstage, bathed in darkness as the titanic screens behind her unpacked the Carters’ catastrophe. Suddenly, we’re watching her and JAY-Z seethe at home as a staring contest rolls into the boil of an argument. As the scene unfurls moments after “He better call Becky with the good hair” echoed throughout Cardiff’s Principality Stadium, the subject of the fraught conversation is clear. Images of their growing family and the frame of a house engulfed in flames followed, with Beyoncé kneeling before the inferno and Jay standing, stunned, as the bones of his home disintegrate.They say nothing, but they don’t have to. We know who lit the match. Those who were hoping for generous glimpses into Beyoncé and JAY-Z’s evolution as husband, wife and parents since the last On The Run tour in 2014 should be careful what they wish for, because On The Run II delivers on that front without compromise to exquisite and devastating degrees.“Sorry” is one of the many songs indicting JAY-Z’s infidelity on Lemonade, Beyoncé’s 2016 visual album, which he would address in his own way on 2017's 4:44. Both records are rife with pain and the complications of commitment, as it’s clear the couple was -- is -- intent on working through the brutality of his betrayal and its excruciating aftermath, both at home and in their respective recording studios. They made it through the blaze and rebuilt what was destroyed, but On The Run II doesn’t discard the smoldering embers of indiscretion in favor of the shiny next chapter of a shared life and love renewed.Beyoncé and JAY-Z are human and have their limits like everyone else, and they’ve mounted a production that pushes them to theirs in order for us to understand how deeply earned and hard won this catharsis was -- and how superhuman they were to channel this anguish into such profound work.That extends beyond On The Run II’s emotional anchor. Both are coming to their latest joint venture with an impressive set of wins collected since On The Run’s first outing nearly four years ago -- a feat itself, as it grossed over $100 million by the time it wrapped. 4:44 and its subsequent trek gave Jay his highest-grossing solo tour to date and his fourteenth No. 1 album, while Lemonade, her sixth No. 1 album, went on to make Hot 100 history when every one of its songs charted simultaneously.The most recent of these accolades is Beyoncé’s staggering (and historic) Coachella set, which redefined what a headliner can achieve and imbued Lemonade and the rest of her hit-laden discography with an even bolder bombast thanks to the might of an HBCU-inspired marching band and dance corps. A post shared by Beyoncé (@beyonce) on Jun 6, 2018 at 1:47pm PDTBeychella posed a challenge in and of itself -- how was Beyoncé going to top herself after that, and so soon after the fact? -- but On The Run II succeeds in condensing the vibrant brass and percussive step team choreography of her Coachella performance into a formidable package streamlined for the road. The incredible On The Run II band boasts not one but two tubas, two bassists (with Lauren Robinson’s “Deja Vu” feature standing out as a highlight), two guitars (Ariel O’Neal’s “I Don’t Care” solo was a showstopper, too) and ample strings, among other talented singers and players.An innovative stage setup kicked the production value up with the addition of Club Carter, a 700-person nightclub taking over the area between the catwalks, and a platform that moved Bey, Jay and their dancers deep into the heart of the arena at various points throughout the night. The show leaned on their shared affinity for film as well, as the visual interludes were crucial for picking up the story the Carters left off.The selection of Lemonade and 4:44 tracks on the setlist was surprisingly modest, which made the vignettes -- especially the ones throwing to the conflict that shaped their most recent creative output -- all the more potent. Burning houses, tropical baptisms, voyeuristic visions of a harness-clad Beyoncé and JAY-Z in a cash-covered motel room, family footage of Blue, Sir and Rumi with their doting parents, the cartoon for “The Story of O.J.” -- no image was gratuitous, each one a metaphor that packed the same punch as Jay’s bars or Bey’s verses. A post shared by Beyoncé (@beyonce) on Jun 6, 2018 at 2:38pm PDTConsidering the mammoth visuals of the 4:44 tour and the technical and musical prowess of Beychella and the Formation tour before it, On The Run II was the sum of exceptional parts -- and one that elevated Beyoncé and JAY-Z's happiest and most harrowing memories in their most challenging performance yet. They spent about a quarter of the show on their collection of duets, opening with the explosive “Magna Carta Holy Grail” and delighting in throwbacks “Upgrade U” and “Deja Vu.” Old favorites got new makeovers, with \"Baby Boy\" seguing into a reggae-inflected meditation and \"Naughty Girl\" invoking Bob Fosse's iconic Sweet Charity choreography to a bellydance-ready beat. Noticeably absent were lighthearted standards like \"Single Ladies (Put A Ring On It),\" \"Love On Top\" and other chart-toppers of Beyoncé's, though the heavier cuts -- like \"Resentment\" off 2006's B'Day, or 4's stadium shredder \"I Care\" -- flowed with the thematic undercurrent of the evening.Their commitment to social justice shone through at various points: JAY-Z hit the stage in a bulletproof vest to perform “99 Problems” as mug shots of numerous celebrities -- Meek Mill, David Bowie, civil rights activist Angela Davis, Lisa “Left Eye” Lopez and more -- towered above him, and the clip of Nigerian author Chimamanda Ngozi Adichie speaking on feminism in Beyoncé’s “Flawless” found a new, fitting home in the final measure of “Run the World (Girls).”Still, the moments when they were singing solely for each other brought it all back to why On The Run II was happening in the first place: JAY-Z was at his happiest and most relaxed in Beyoncé’s orbit, and the sheer joy emanating from them both when they came together for “Young Forever” was intense, especially at the conclusion of this multi-sensory, two-hour journey. As Beyoncé soared through her take on Ed Sheeran’s “Perfect” before “Young Forever,” tape of a vow renewal ceremony -- featuring Blue, Sir, Rumi, JAY-Z and Beyoncé in white -- rolled behind them. With On The Run II, Beyoncé and JAY-Z didn’t shy away from the pain that nearly broke them. They celebrated it, as it proved that breaking points forge new beginnings.", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "Beyonce & JAY-Z Show Strength In Vulnerability At Sensational On The Run II Tour Kick-Off", "url": "https://www.billboard.com/music/pop/beyonce-jay-z-on-the-run-ii-tour-live-review-8459823/", "description": "The superstar couple didn’t shy away from the controversy during their tour launch at Cardiff’s Principality Stadium, or from raining down a parade of their biggest hits.", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/beyonce-jay-z-on-the-run-2-tour-official-press-2018-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Beyoncé & Jay-Z"}, "locale": "en_US"}, "article": {"published_time": "2018-06-07T12:29:27+00:00", "modified_time": "2018-06-07T13:09:11+00:00"}, "twitter": {"site": "@billboard", "card": "summary_large_image", "title": "Beyonce & JAY-Z Show Strength In Vulnerability At Sensational On The Run II Tour Kick-Off", "description": "The superstar couple didn't shy away from the controversy during their tour launch at Cardiff's Principality Stadium, or from raining down a parade of their biggest hits.", "image": "https://www.billboard.com/wp-content/uploads/media/beyonce-jay-z-on-the-run-2-tour-official-press-2018-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1528374567.0, "source": "http://www.billboard.com", "summary": ""}