{"url": "https://www.hollywoodreporter.com/news/kerry-washington-reveals-secrets-her-scandal-power-wardrobe-1084023", "text": "Now in its seventh and final season, ABC’s Scandal redefined the look of female power dressing in Washington, D.C., with Olivia Pope’s powdery pastel pantsuits, statement coats and designer handbags inspiring fashion fans every week. So it’s only fitting that the show’s star, Kerry Washington, be honored with the Costume Designers Guild’s Spotlight Award. Ahead of the 20th ceremony celebrating costume design in film and television (hosted by Gina Rodriguez), Washington talked about her collaboration with Scandal costume designer Lyn Elizabeth Paolo and how it felt to suit up in Anita Hill’s iconic turquoise ensemble for HBO’s Confirmation.\n\nHow does costume design help you as an actor?\n\nIt’s such a vital part of the actor’s toolbox. Your job is to create a complete person, and you can’t do that without thinking about how that person walks in the world in terms of their appearance.\n\nHow did you work with Lyn Elizabeth Paolo to develop the Olivia Pope character?\n\nFor the most part, up until that moment in time in Washington, D.C., to be a powerful woman meant dressing like a man. We were conscious of not having Olivia do that, of having her not be afraid to bring her whole self into the room. That meant bringing her identity as a woman and her femininity and believing if she brought her full agency into the room, that it didn’t disempower her. So we looked for clothes that had a waist, that didn’t take away from my female form. And there were women in Washington at the time — like Michelle Obama and Desiree Rogers — who were developing this identity, women who were saying, “I can be smart and fashion-forward, I can be brilliant and fabulous, and I’m not going to leave any part of myself outside the room for your comfort.”\n\nWhat was the thinking behind her color palette?\n\nA lot of people in Washington at the time were dressing in navy and black, again in order to fit into the male fashion aesthetic. We decided we’re going to traffic in pastels and neutrals, not only because Olivia Pope is not afraid to stand out and write her own rules as an entrepreneur, but also because as a woman of color, I could pull off some of those colors in a different way that we hadn’t seen on television, and we wanted to take advantage of that as well.\n\nYou’ve said you trust Lyn. How has she helped you?\n\nI remember in season one, episode six, it was an episode called “The Trail” — it’s a defining episode in the series — and I remember being in a fitting, and I had something like 19 costume changes. I had never done anything like that. Being on a one-hour drama is a very athletic commitment, and even though I came to the show off of doing a Broadway show, so I was prepared for physicality, I wasn’t prepared for the volume of material. I remember crying in the fitting with her, and she was also very emotional, and we just kind of looked at each other and said, we’re gonna get through it and figure it out because we love this show and love this world. I really leaned into her belief that we could do it, and she was right.\n\nWhat’s your favorite Olivia Pope outfit of all time?\n\nThere are so many. I do often think about the very first state dinner we did on the show, which was that beautiful Calvin Klein sleek silhouette. I remember I had called the house to say we need that dress and they sent it right off the runway. Two things I’ll never forget about doing the show with Lyn — one of them is that extra 15 minutes, which is when you’re in the fitting and put the look together and you go, “That’s OK.” And I’m so grateful to Lyn because what Lyn and I share is we look at each other and say, “OK is not good enough.” You push for the extra 15 minutes in fitting where it’s a different shoe or sweater, or if we take in the waist just a bit, it’s just that extra 15 minutes where you say “OK is not good enough” and you push for right. Even seven seasons later, we’ll look in the mirror and say, “That works but it’s not there yet.” I’m so grateful for that; that’s what takes you from good to extraordinary. And then I remember between seasons two and three, Lyn and I went to New York during hiatus to meet with all the houses because of the volume of all the costume changes — we shoot before we air, so we wanted to make sure we were both utilizing all our relationships in fashion to get stuff early and fast and ahead of the curve. And so I was introducing her to my contacts and she was introducing me to hers and we were just sitting down with designers to say we know how important your work is to the life of the show.\n\nIs there something about her work that brought into focus for you the demands of being a costume designer?\n\nAbsolutely. I’m always exhausted after my fittings with her, and then she also has to dress 10 other characters; that always astounds me. And she treats every guest star as the lead of their own arc, and I always learn something about the character when the actor comes to set in whatever Lyn put them in because she has worked to help tell the story. And I remember season two or three, one of my husband’s favorite shows is Shameless, and I said “She does that, too,” and he couldn’t believe it! Because you couldn’t have two shows with a more different aesthetic, and she flawlessly lives in both those worlds.\n\nIn Django Unchained — how did the costumes help you get into that character?\n\nThe thing that costume does in that time period, especially — and I would argue the same is true today, but it was heightened in that period — is that it tells you everything about class. And class for a black woman in that period tells you everything about independence and agency. So it tells you a lot about what it’s like to dress when you are property — the clothes that allow for freedom, and the clothes that allow you to be kept. And all women at the time, when you talk about corsets, were kept. I remember being in college, doing A Little Night Music, trying to sing in those corsets. Women fainted all the time because you can barely breathe. And so the systematic silencing and limiting of women was coming from the clothes. It wasn’t just that women didn’t have the vote, they literally weren’t allowed to breathe to the same extent as men were. That’s of course multiplied exponentially for a black woman. What we think of as beauty equals constraint, and to think about that through the ages is interesting.\n\nIn HBO’s Confirmation, which depicted a woman in D.C. three decades before Olivia Pope, what was it like to wear a turquoise suit that was a replica of the one worn by Anita Hill?\n\nI remember my breath leaving me — like gasping for breath when I saw it. Because I had watched hours and hours of footage of her in that suit and had spent so much time poring over pictures and video and audio recordings of that day. The suit really felt like armor. We even re-created the exact earrings and the exact necklace Anita had, and it all helped me to step into the truth of the moment.\n\nA version of this story first appeared in the Feb. 14 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/02/scandal_kerry_washington_dress.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/scandal_kerry_washington_dress.jpg?w=1296&h=730&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/scandal_kerry_washington_dress.jpg?w=1024", "keywords": [], "authors": ["Booth Moore"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/kerry-washington-reveals-secrets-her-scandal-power-wardrobe-1084023/", "title": "Kerry Washington Reveals Secrets of Her ‘Scandal’ Power Wardrobe", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The actress, who will be honored at Tuesday's Costume Designer Guild Awards, talks about Olivia Pope's look and what it was like to wear Anita Hill's turquoise suit in 'Confirmation': It \"really felt like armor.\"", "news_keywords": "Kerry Washington", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Booth Moore", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1084023, "title": "Kerry Washington Reveals Secrets of Her 'Scandal' Power Wardrobe", "published_at": "2018-02-20 08:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/scandal_kerry_washington_dress.jpg?w=1024", "comment_count": 0, "tags": "Kerry Washington", "topics": "News", "body": "Now in its seventh and final season, ABC's Scandal redefined the look of female power dressing in Washington, D.C., with Olivia Pope's powdery pastel pantsuits, statement coats and designer handbags inspiring fashion fans every week. So it's only fitting that the show's star, Kerry Washington, be honored with the Costume Designers Guild's Spotlight Award. Ahead of the 20th ceremony celebrating costume design in film and television (hosted by Gina Rodriguez), Washington talked about her collaboration with Scandal costume designer Lyn Elizabeth Paolo and how it felt to suit up in Anita Hill's iconic turquoise ensemble for HBO's Confirmation.\r\nHow does costume design help you as an actor?\r\nIt's such a vital part of the actor's toolbox. Your job is to create a complete person, and you can't do that without thinking about how that person walks in the world in terms of their appearance.\r\nHow did you work with Lyn Elizabeth Paolo to develop the Olivia Pope character?\r\nFor the most part, up until that moment in time in Washington, D.C., to be a powerful woman meant dressing like a man. We were conscious of not having Olivia do that, of having her not be afraid to bring her whole self into the room. That meant bringing her identity as a woman and her femininity and believing if she brought her full agency into the room, that it didn't disempower her. So we looked for clothes that had a waist, that didn't take away from my female form. And there were women in Washington at the time — like Michelle Obama and Desiree Rogers — who were developing this identity, women who were saying, \"I can be smart and fashion-forward, I can be brilliant and fabulous, and I'm not going to leave any part of myself outside the room for your comfort.\"\r\nWhat was the thinking behind her color palette?\r\nA lot of people in Washington at the time were dressing in navy and black, again in order to fit into the male fashion aesthetic. We decided we're going to traffic in pastels and neutrals, not only because Olivia Pope is not afraid to stand out and write her own rules as an entrepreneur, but also because as a woman of color, I could pull off some of those colors in a different way that we hadn't seen on television, and we wanted to take advantage of that as well.\r\nYou’ve said you trust Lyn. How has she helped you?\r\nI remember in season one, episode six, it was an episode called “The Trail” — it’s a defining episode in the series — and I remember being in a fitting, and I had something like 19 costume changes. I had never done anything like that. Being on a one-hour drama is a very athletic commitment, and even though I came to the show off of doing a Broadway show, so I was prepared for physicality, I wasn’t prepared for the volume of material. I remember crying in the fitting with her, and she was also very emotional, and we just kind of looked at each other and said, we’re gonna get through it and figure it out because we love this show and love this world. I really leaned into her belief that we could do it, and she was right.\r\nWhat’s your favorite Olivia Pope outfit of all time?\r\nThere are so many. I do often think about the very first state dinner we did on the show, which was that beautiful Calvin Klein sleek silhouette. I remember I had called the house to say we need that dress and they sent it right off the runway. Two things I’ll never forget about doing the show with Lyn — one of them is that extra 15 minutes, which is when you’re in the fitting and put the look together and you go, \"That’s OK.\" And I’m so grateful to Lyn because what Lyn and I share is we look at each other and say, \"OK is not good enough.\" You push for the extra 15 minutes in fitting where it’s a different shoe or sweater, or if we take in the waist just a bit, it’s just that extra 15 minutes where you say \"OK is not good enough\" and you push for right. Even seven seasons later, we'll look in the mirror and say, \"That works but it’s not there yet.\" I’m so grateful for that; that’s what takes you from good to extraordinary. And then I remember between seasons two and three, Lyn and I went to New York during hiatus to meet with all the houses because of the volume of all the costume changes — we shoot before we air, so we wanted to make sure we were both utilizing all our relationships in fashion to get stuff early and fast and ahead of the curve. And so I was introducing her to my contacts and she was introducing me to hers and we were just sitting down with designers to say we know how important your work is to the life of the show.\r\nIs there something about her work that brought into focus for you the demands of being a costume designer?\r\nAbsolutely. I’m always exhausted after my fittings with her, and then she also has to dress 10 other characters; that always astounds me. And she treats every guest star as the lead of their own arc, and I always learn something about the character when the actor comes to set in whatever Lyn put them in because she has worked to help tell the story. And I remember season two or three, one of my husband’s favorite shows is Shameless, and I said \"She does that, too,\" and he couldn’t believe it! Because you couldn’t have two shows with a more different aesthetic, and she flawlessly lives in both those worlds.\r\nIn Django Unchained — how did the costumes help you get into that character?\r\nThe thing that costume does in that time period, especially — and I would argue the same is true today, but it was heightened in that period — is that it tells you everything about class. And class for a black woman in that period tells you everything about independence and agency. So it tells you a lot about what it’s like to dress when you are property — the clothes that allow for freedom, and the clothes that allow you to be kept. And all women at the time, when you talk about corsets, were kept. I remember being in college, doing A Little Night Music, trying to sing in those corsets. Women fainted all the time because you can barely breathe. And so the systematic silencing and limiting of women was coming from the clothes. It wasn’t just that women didn’t have the vote, they literally weren’t allowed to breathe to the same extent as men were. That’s of course multiplied exponentially for a black woman. What we think of as beauty equals constraint, and to think about that through the ages is interesting.\r\nIn HBO's Confirmation, which depicted a woman in D.C. three decades before Olivia Pope, what was it like to wear a turquoise suit that was a replica of the one worn by Anita Hill?\r\nI remember my breath leaving me — like gasping for breath when I saw it. Because I had watched hours and hours of footage of her in that suit and had spent so much time poring over pictures and video and audio recordings of that day. The suit really felt like armor. We even re-created the exact earrings and the exact necklace Anita had, and it all helped me to step into the truth of the moment.\r\nA version of this story first appeared in the Feb. 14 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Kerry Washington Reveals Secrets of Her ‘Scandal’ Power Wardrobe", "url": "https://www.hollywoodreporter.com/news/general-news/kerry-washington-reveals-secrets-her-scandal-power-wardrobe-1084023/", "description": "The actress, who will be honored at Tuesday’s Costume Designer Guild Awards, talks about Olivia Pope’s look and what it was like to wear Anita Hill’s turquoise suit in ‘Conf…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/scandal_kerry_washington_dress.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-02-20T08:00:00+00:00", "modified_time": "2018-02-20T08:00:06+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Kerry Washington Reveals Secrets of Her ‘Scandal’ Power Wardrobe", "description": "The actress, who will be honored at Tuesday’s Costume Designer Guild Awards, talks about Olivia Pope’s look and what it was like to wear Anita Hill’s turquoise suit in ‘Conf…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/scandal_kerry_washington_dress.jpg?w=1296"}}, "movies": [], "publish_date": 1519113600.0, "source": "https://www.hollywoodreporter.com", "summary": ""}