{"url": "https://money.usnews.com/money/blogs/my-money/articles/2018-05-24/13-best-memorial-day-sales-for-2018", "text": "Memorial Day looks different in 2020. Large backyard barbecues, pool parties and the traditional long-weekend trip may not be possible. However, shopping Memorial Day sales is weekend tradition that perseveres.\n\nDepending on your state, in-store shopping sprees may not be possible (or advisable). Luckily, there are plenty of online sales taking place during the long weekend. Many of them are already live. These are the Memorial Day sales to shop if you want to save on furniture, mattresses, appliances, clothing and more:\n\nAcademy Sports + Outdoors.\n\nAshley Furniture.\n\nBear Mattress.\n\nBig Lots.\n\nBrooklyn Bedding.\n\nDick's Sporting Goods.\n\nDiscountGlasses.com.\n\nGodiva.\n\nLenovo.\n\nLowe's.\n\nMacy's.\n\nNest Bedding.\n\nPlushBeds.\n\nOverstock.\n\nUlta Beauty.\n\nRead on for more information on the best Memorial Day sales for 2020.\n\nAcademy Sports + Outdoors\n\nThe retailer is offering sales on summer necessities through May 25. Highlights include up to 25% off Nike, Under Armour and Adidas apparel and shoes, up to 25% off athletic shoes from Asics, New Balance and Puma, and up to 50% off swimwear.\n\nMeanwhile, military veterans, first responders and front-line health care professionals get 10% off an entire purchase through May 25 in stores and online. To get this extra discount, you'll need to present a military ID if shopping in a store, or verify your identity when shopping online.\n\nAshley Furniture\n\nThe Memorial Day sale is already live and features up to 50% off select mattresses and bedroom furniture.\n\nBear Mattress\n\nGet 20% off across the entire site, plus two free Cloud pillows with every mattress or bundle purchase, through May 26. Use code MDW20 at checkout. Members of the military and first responders can get 25% off by verifying their identity with identification-checking service ID.me and shopping via Bear's site.\n\nBig Lots\n\nMemorial Day deals are already live on the retailer's site and include 20% off select pools and backyard water playscapes, 25% off beach towels, 20% off home gardening tools, 30% off patio cushions and toss pillows and more. Plus, first responders, medical professionals, active military personnel, veterans and commercial drivers get 15% off in stores and online. This discount can be used on top of Memorial Day deals.\n\nBrooklyn Bedding\n\nGet 25% off across the entire site, which sells mattresses and bedding, from May 21 to May 25.\n\nDick's Sporting Goods\n\nThe Memorial Day sale includes up to 30% off select bikes, up to 40% off fishing equipment, up to 25% off Yeti drinkware and a slew of discounts on apparel from Crocs, Oakley, Nike, The North Face and more.\n\nDiscountGlasses.com\n\nNeed new frames or prescription lenses? Use code MEMORIALDAY30 from May 22 to May 29 to get 30% off.\n\nGodiva\n\nMay 22 to May 25, get 20% off orders over $50 and 25% off orders over $100. All orders over $15 get free shipping.\n\nLenovo\n\nMemorial Day Sneak Peek deals are live and include savings on an array of traditional and convertible two-in-one laptops. Individual deals have different promo codes, so be sure to make note of those before you check out. Savings include $600 off the Yoga C930 14-inch laptop and $1,710 off the 14-inch ThinkPad X1 Yoga Gen 3 laptop.\n\nLowe's\n\nThrough June 3, get up to 40% off select major appliances. The sale includes washers, dryers, dishwashers, fridges and ranges.\n\nMacy's\n\nThe department store has launched some online Memorial Day deals early. The early deals span rugs, furniture and mattresses, with discounts of 20% to 60%. Based on past years, Macy's can be expected to offer even broader deals across the store closer to the holiday weekend.\n\nNest Bedding\n\nThe online mattress and bedding retailer is offering 25% off your entire cart May 14 to May 31. No promo code is required.\n\nPlushBeds\n\nThe organic mattress company is offering up to $600 off memory foam mattresses and up to $1,250 off organic latex mattresses May 19 to June 22.\n\nOverstock\n\nOverstock's Memorial Day sale is already live and runs until June 1. It features up to 70% off thousands of items and has some particularly strong deals in the home decor category, including patio furniture starting at $99, rugs starting at $49 and an extra 15% off bedroom and living room furniture.\n\nUlta Beauty\n\nThe Gorgeous Hair event runs the entire month of May with daily deals. Memorial Day weekend's lineup includes 50% off the Elchim 3900 Healthy Ionic Dryer on May 23, 50% off the Hot Tools Professional Turbo Ionic Dryer in pink on May 24 and 50% off Alterna My Hair My Canvas New Beginnings Exfoliating Cleanser on May 25.", "images": ["https://www.usnews.com/object/image/00000183-ae5a-d350-ad83-bfdb53a40000/10-06-22-pd2-sec-cam-deals.png?update-time=1665077551774&size=responsiveSquare150", "https://www.usnews.com/object/image/00000183-a8b7-d479-a3c3-fbbfaf400000/10-05-22-pd2-airpods-deals.png?update-time=1664983000430&size=responsiveSquare150", "https://www.usnews.com/dims4/USNEWS/bf3de12/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F0a%2Ff4%2F05d0047e4aeabc470a4058ffe2e8%2F200319retailtherapy-stock.jpg", "https://www.usnews.com/static/img/usn-logo-large.svg", "https://www.usnews.com/object/image/00000170-f309-d298-a779-f71b9e6d0000/200319retailtherapy-stock.jpg?update-time=1584636056569&size=responsive640", "https://www.usnews.com/object/image/00000183-a8b6-d350-ad83-bfb74eb40000/10-05-22-pd2-vacuum-deals.png?update-time=1664982906822&size=responsiveSquare150"], "top_img": "https://www.usnews.com/dims4/USNEWS/bf3de12/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F0a%2Ff4%2F05d0047e4aeabc470a4058ffe2e8%2F200319retailtherapy-stock.jpg", "keywords": [], "authors": ["Kristin Mcgrath", "May", "At A.M."], "canonical_link": "https://deals.usnews.com/articles/best-memorial-day-sales", "title": "Best Memorial Day Sales for 2020", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "description": "These best Memorial Day sales from Macy's, Overstock and other stores are offering top deals on mattresses, appliances, furniture, clothing and other goods.", "keywords": "Kristin McGrath ,personal finance,personal budgets,shopping,money,U.S. News 360 Deals,Advice", "zone": "home", "robots": "max-image-preview:large", "fb": {"pages": 5834919267, "app_id": 130063997038366}, "brightspot.contentId": "0000016a-c290-d0da-a76a-fadbf6810000", "og": {"site_name": "US News & World Report", "title": "Best Memorial Day Sales for 2020", "description": "While some Memorial Day traditions won't be possible this year, online shopping remains strong.", "url": "https://deals.usnews.com/articles/best-memorial-day-sales", "image": {"identifier": "https://www.usnews.com/dims4/USNEWS/bf3de12/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F0a%2Ff4%2F05d0047e4aeabc470a4058ffe2e8%2F200319retailtherapy-stock.jpg", "secure_url": "https://www.usnews.com/dims4/USNEWS/bf3de12/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F0a%2Ff4%2F05d0047e4aeabc470a4058ffe2e8%2F200319retailtherapy-stock.jpg"}, "type": "article"}, "twitter": {"image": "https://www.usnews.com/dims4/USNEWS/bf3de12/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2F0a%2Ff4%2F05d0047e4aeabc470a4058ffe2e8%2F200319retailtherapy-stock.jpg", "card": "summary_large_image", "site": "@USNews", "title": "Best Memorial Day Sales for 2020", "description": "While some Memorial Day traditions won't be possible this year, online shopping remains strong."}, "google-site-verification": "owJBuFHD3VHcTSsnPSOYizmUcs3GSBjbx09vBbBi1MM", "msvalidate.01": "A8E47FA91124063A4A9C78AD5273DC0F", "sailthru.date": "2020-05-18T11:53Z", "sailthru.author": "Kristin McGrath", "vertical": "Deals", "preview": "Memorial Day looks different in 2020. Large backyard barbecues, pool parties and the traditional long-weekend trip may not be possible. However, shopping Memorial Day sales is weekend tradition that perseveres. Depending on your state, in-store shopping sprees may not be possible (or advisable).", "optimizely": "Optimizely is supported by this application but is not enabled for this page."}, "movies": [], "publish_date": 1527116400.0, "source": "https://money.usnews.com", "summary": ""}