{"url": "www.courts.ca.gov/selfhelp-conservatorship.htm", "text": "Help for someone with an impairment or disability\n\nThere's a range of options to help someone\n\nEveryone needs help sometimes. Some people, including people with disabilities or impairments, may need more help than others. Sometimes a person has trouble\n\nProviding for their personal needs\n\nManaging their money\n\nMaking important decisions by themselves\n\nThere are many ways that a person, or others who love and support the person, can get the help they need. Most of them don’t require asking a court to appoint another person to act or make decisions for the person who needs help (called a conservatorship).\n\nDefinitions you need to know to understand options\n\nThese terms can help you understand the type of help that may be best for the person's needs.\n\nFunction: a specific act or activity that a person does or cannot do.\n\nImpairment: a loss of function; any disorder or condition affecting one or more mind or body systems.\n\nDisability: a physical or mental impairment that substantially limits one more major life activities.\n\nA person can have an impairment without having a disability. A person with a disability can have a wide range of impairments going from minor impairments to more severe ones. Additionally, a person with an impairment or disability will have some functions that they can perform and some they cannot. This is important when considering what type of help is appropriate. Because of the range of needs, there are as many ways to help as there are people that need that help.\n\nYou must explore all the options to help before going to court\n\nAlthough this Guide deals with conservatorships primarily, a judge will only grant a conservatorship if no less restrictive alternative is appropriate. It is important to remember that there may be other less restrictive options for you or your loved one that should be considered first.", "images": ["http://www.courts.ca.gov/themes/custom/atrium/images/logo/jcc-logo--selfhelp__white.png", "http://www.courts.ca.gov/themes/custom/atrium/favicon.ico", "http://www.courts.ca.gov/libraries/courtyard-artifact/1.x/public/images/logos/jcc-logo-branch-text-white.svg"], "top_img": "http://www.courts.ca.gov/themes/custom/atrium/favicon.ico", "keywords": [], "authors": [], "canonical_link": "https://selfhelp.courts.ca.gov/helping-person-impairment-or-disability", "title": "Helping a person with an impairment or disability", "meta_data": {"description": "Help for someone with an impairment or disability  There's a range of options to help someone  Everyone needs help sometimes. Some people, including people with disabilities or impairments, may need more help than others. Sometimes a person has trouble", "Generator": "Drupal 9 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": null, "source": "http://www.courts.ca.gov", "summary": ""}