{"url": "https://www.bustle.com/articles/52644-8-common-mascara-mistakes-you-might-be-making-and-how-to-fix-them-because-nobody-wants", "text": "While there are certain steps in a beauty routine that can require more patience and practice like a smoky eye or an ombré lip, knowing how to apply mascara seems more on the \"no-brainer\" end of the spectrum. For something that you'd assume is relatively foolproof, there are actually a number of common mistakes that can be made before, during, and after application. And really, who knew there were so many intricacies to a product that takes only seconds to use?\n\nBut these mistakes are totally worth fixing because mascara is one of the holy makeup trinity. As in, one of the three makeup game-changers. Brow pencils (or powders or gels, whatever you prefer) help frame the face. Lipstick (especially in a brighter hue) can help you look instantly polished. And mascara helps open your peepers, making you look more bright-eyed and awake.\n\nSo if you've made any of these common mascara mistakes, you're not alone. We spoke to a few expert on how to fix these slip-ups and they'll change the way you use mascara for the better.\n\n1. You're Not Starting With A Waterproof Formula\n\nIf you're concerned about the curl-factor of your lashes, make your first coat of mascara a waterproof one. Waterproof formulas help hold the curl that regular formulas can cause to fall.\n\n2. You're Not Separating Your Lashes\n\nStill, sometimes no matter how hard we try to prevent it, mascara can make lashes clump together. Just make sure to comb through them with a spoolie after application to ensure your lashes aren't sticking together.\n\nTo avoid smudging and clumping on your bottom lashes, and for a more natural and cleaner finish, NYC makeup artist and beauty expert, Neil Scibelli suggests using whatever formula is already left on the brush to do your bottom lashes.\n\n3. You're Pumping Your Mascara Wand\n\nPumping the wand only pumps air into the product, making it dry out faster than necessary. And you really don't need that much product on the wand anyway.\n\n\"I’ve seen a lot of people pump their mascara to get more out,\" Scibelli tells Bustle. \"But that actually just pumps more air into the tube and can start to dry out the formula. To grab more formula on your wand, try wiggling the brush to reach the sides of the tube to reach more product.\"\n\n4. You're Not Wiping Off Your Mascara Wand\n\nMore product than you actually need is on the wand when you pull it from the tube. By wiping it off before application, you can prevent your lashes from clumping and sticking together.\n\nScibelli suggests always removing the excess product off of the wand before applying. \"This helps to avoid clumping, smudging and overall too much product on the lashes. You can remove the excess product off right at the opening of the mascara so it ideally will just go back into the tube,\" he says.\n\n5. You Don't Wiggle Your Wand\n\nIf you just pull the mascara wand straight through your lashes, you won't properly coat them. Give them the volume and length they deserve by wiggling the wand horizontally through your lashes as you pull it up. (You should be making little \"Z\" shapes.)\n\nIn addition to the wiggly strokes, Scibelli explains that brushes work best when you start your application process at the base of the lash and then comb upwards. You’ll also see more of a lifting effect when you start applying from the base of the lash.\n\n6. You're Not Applying Enough Coats Or Applying Too Many\n\nMost people apply only one or two coats of mascara because applying more seems like it only makes lashes clump and the curl fall. But you can actually achieve greater volume and length if you add three to five coats.\n\nLash expert and founder of Camara AUnique Beauty, Camara Aunique suggests applying a coat on your first eye then heading to the next eye while the top lashes are drying to apply a coat on the bottom lashes; repeat the steps in that order for fuller and longer lashes.\n\nPiling on too many coats of mascara can weigh your lashes down and even cause them to fall out. If you find you're not getting the fullest lashes you want, try falsies. Aunique tells her clients to apply mascara before their false lash application. \"This allows you to be able to wear your lashes multiple times and prevents any bacteria from growing on the lash itself,\" she tells Bustle.\n\n7. You Don't Wait To Clean Mistakes\n\nIf you get a little mascara on your skin, don't rub away at it; you'll just smear it and have a bigger mess to deal with. Instead use a small concealer or eyeliner brush or Q-tip dipped in micellar water and gently remove the smudge.\n\n8. You're Not Throwing It Away\n\nThree months is premature, but don't hold on to open mascaras for longer than six months. And if you're not sure how long it's been, just trust your nose.", "images": ["https://imgix.bustle.com/uploads/getty/2022/10/5/ed729d1a-b742-4b51-9ed0-a71338410764-getty-1430365606.jpg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.476&fp-y=0.1449", "https://imgix.bustle.com/uploads/getty/2022/10/4/cfb24b9f-f575-4f25-aecc-7e68f3f1400e-getty-1428720253.jpg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.572&fp-y=0.1947", "https://imgix.bustle.com/uploads/image/2021/1/29/aae7841c-f714-47d3-b48b-efb2746600b6-acda16b1-749a-45c4-ac00-cffca9e568b3-shutterstock-1550090087.jpeg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2020/12/29/daeeadbe-bc76-49dd-aaa6-aca61891cdcf-51wuqonumyl_sl1024_.jpg?w=330&h=330&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2020/4/16/3d6f4b43-460e-4dba-ad26-8e2c62ab9002-guest_f2bc621a-543f-4079-9e58-e93fc006d5d5.jpg?w=330&h=330&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2021/1/29/aae7841c-f714-47d3-b48b-efb2746600b6-acda16b1-749a-45c4-ac00-cffca9e568b3-shutterstock-1550090087.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2022/10/4/94f66790-890b-48dc-a26d-35e7ec667788-9_393_rvb_game-of-thrones_jul2211576-copy-2-1080x1080-3b82fcac-ce8a-41f1-9905-1d24bf06fbb8.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/9/23/f3700482-43b4-4bfc-b7e9-e02cc2eb7388-danessa-2001.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2021/1/26/2c36a625-450a-43a8-834f-e6c3ed6fd7ef-maybelline-lash-sensational-sky-high-wtp-803-brownish-black-o.jpg?w=330&h=491&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2021/1/29/b0f8c455-aeee-4efb-9e71-1659cc6e60f4-mary.jpg?w=330&h=330&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/zoe-report/2017/06/kiss-me-mascara-300.jpg?w=330&h=330&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/uploads/image/2021/1/29/aae7841c-f714-47d3-b48b-efb2746600b6-acda16b1-749a-45c4-ac00-cffca9e568b3-shutterstock-1550090087.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/style/52644-8-common-mascara-mistakes-you-might-be-making-and-how-to-fix-them-because-nobody-wants", "title": "8 Mascara Mistakes You Probably Didn't Know You Were Making", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/style/52644-8-common-mascara-mistakes-you-might-be-making-and-how-to-fix-them-because-nobody-wants", "type": "article", "title": "8 Mascara Mistakes You Probably Didn't Know You Were Making", "description": "Beauty experts weigh in on how to fix common mascara mistakes you probably don't even know you're making", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2021/1/29/aae7841c-f714-47d3-b48b-efb2746600b6-acda16b1-749a-45c4-ac00-cffca9e568b3-shutterstock-1550090087.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Beauty experts weigh in on how to fix common mascara mistakes you probably don't even know you're making"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}