{"url": "https://www.hollywoodreporter.com/features/billy-bush-breaks-his-silence-trump-access-hollywood-tape-nbc-a-comeback-plan-1005744", "text": "Billy Bush was on the tarmac at New York’s JFK International Airport waiting to take off for Los Angeles when his world imploded. It was Friday, Oct. 7, 2016, and an 11-year-old tape of a lewd conversation with Donald Trump — in which the then-Apprentice star could be heard bragging about sexually assaulting women with a chortling Bush egging him on — was leaked to The Washington Post. The tape was supposed to end Trump’s improbable presidential run. Instead, it torpedoed Bush’s job at NBC’s Today, turning the former Access Hollywood host into a late-night punch line and media pariah. “I could not put two thoughts together,” Bush, 45, tells The Hollywood Reporter in an extended interview, his first since the scandal erupted more than seven months ago. “Things were happening way too fast.”\n\nCaptive on that airplane for nearly six Wi-Fi-enabled hours, Bush read news reports in disbelief as a real-time train wreck engulfed his career. By the time he arrived in Los Angeles, a horde of paparazzi had materialized at LAX and, later, at his L.A. home, where they remained for more than a week. Ducking out only through a back path, Bush spent the remainder of that October weekend desperately trying to save his job, then just a few months old and already off to a shaky start after a much-criticized interview with embattled Olympic swimmer Ryan Lochte. Though Today long had been among Bush’s ambitions, his hiring as the co-host of the 9 a.m. hour was somewhat controversial given his lack of hard-news experience and a snarky red-carpet presence. Initially, NBC News signaled Bush would return that Monday to apologize on-air. “I would have welcomed addressing the audience,” he says pointedly.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/thr_billy_bush_hr_bb_shot3_02190.jpg?w=1500&h=844&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/thr_billy_bush_hr_bb_shot3_02190.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/thr_billy_bush_hr_bb_shot3_02190.jpg?w=1024", "keywords": [], "authors": ["Marisa Guthrie Lacey Rose", "Marisa Guthrie", "Lacey Rose"], "canonical_link": "https://www.hollywoodreporter.com/movies/movie-features/billy-bush-breaks-his-silence-trump-access-hollywood-tape-nbc-a-comeback-plan-1005744/", "title": "Billy Bush Breaks His Silence on Trump, the ‘Access Hollywood’ Tape, NBC and a Comeback Plan (Exclusive)", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Seven months after the infamous \"grab them by the pussy\" recording got Bush fired (and nearly toppled Trump's White House run), the former 'Today' host goes public with what happened on that bus, the people who knew about the tape, how he broke the \"awful\" news to his daughters and his bold comeback move: \"I plan to return to the job that I love.\"", "news_keywords": "autoplay, Billy Bush, donald trump, Longform 2017, THR Cover Story", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lacey Rose", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1005744, "title": "Billy Bush Breaks His Silence on Trump, the 'Access Hollywood' Tape, NBC and a Comeback Plan (Exclusive)", "published_at": "2017-05-21 16:30:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/thr_billy_bush_hr_bb_shot3_02190.jpg?w=1024", "comment_count": 0, "tags": "THR Cover Story", "topics": "Movies", "body": "Billy Bush was on the tarmac at New York's JFK International Airport waiting to take off for Los Angeles when his world imploded. It was Friday, Oct. 7, 2016, and an 11-year-old tape of a lewd conversation with Donald Trump — in which the then-Apprentice star could be heard bragging about sexually assaulting women with a chortling Bush egging him on — was leaked to The Washington Post. The tape was supposed to end Trump's improbable presidential run. Instead, it torpedoed Bush's job at NBC's Today, turning the former Access Hollywood host into a late-night punch line and media pariah. \"I could not put two thoughts together,\" Bush, 45, tells The Hollywood Reporter in an extended interview, his first since the scandal erupted more than seven months ago. \"Things were happening way too fast.\"\r\nCaptive on that airplane for nearly six Wi-Fi-enabled hours, Bush read news reports in disbelief as a real-time train wreck engulfed his career. By the time he arrived in Los Angeles, a horde of paparazzi had materialized at LAX and, later, at his L.A. home, where they remained for more than a week. Ducking out only through a back path, Bush spent the remainder of that October weekend desperately trying to save his job, then just a few months old and already off to a shaky start after a much-criticized interview with embattled Olympic swimmer Ryan Lochte. Though Today long had been among Bush's ambitions, his hiring as the co-host of the 9 a.m. hour was somewhat controversial given his lack of hard-news experience and a snarky red-carpet presence. Initially, NBC News signaled Bush would return that Monday to apologize on-air. \"I would have welcomed addressing the audience,\" he says pointedly.", "fb": {"pages": 14425952749}, "ia": {"markup_url": "https://www.hollywoodreporter.com/movies/movie-features/billy-bush-breaks-his-silence-trump-access-hollywood-tape-nbc-a-comeback-plan-1005744/?ia_markup=1"}, "fragment": "!", "og": {"type": "article", "title": "Billy Bush Breaks His Silence on Trump, the ‘Access Hollywood’ Tape, NBC and a Comeback Plan (Exclusive)", "url": "https://www.hollywoodreporter.com/movies/movie-features/billy-bush-breaks-his-silence-trump-access-hollywood-tape-nbc-a-comeback-plan-1005744/", "description": "Seven months after the infamous “grab them by the pussy” recording got Bush fired (and nearly toppled Trump’s White House run), the former ‘Today’ host goes public wit…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/thr_billy_bush_hr_bb_shot3_02190.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2017-05-21T16:30:00+00:00", "modified_time": "2017-12-21T10:16:26+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Billy Bush Breaks His Silence on Trump, the ‘Access Hollywood’ Tape, NBC and a Comeback Plan (Exclusive)", "description": "Seven months after the infamous “grab them by the pussy” recording got Bush fired (and nearly toppled Trump’s White House run), the former ‘Today’ host goes public wit…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/thr_billy_bush_hr_bb_shot3_02190.jpg?w=1500"}}, "movies": [], "publish_date": 1495384200.0, "source": "https://www.hollywoodreporter.com", "summary": ""}