{"url": "https://www.nomadicmatt.com/travel-blogs/the-ultimate-list-of-travel-movies/", "text": "\n\nLast Updated: 5/10/21 | May 10th, 2021\n\nWay back in 2008, I created a list of ten of the best travel movies ever. It was a great list. But 2008 was a long time ago. Since I watch a lot of movies on flights and there have been many wonderful and breathtaking travel movies made since then, watching The Way a few days ago made me realize that we’re long overdue for a list of my all-time favorite best travel movies that will inspire you to get off the couch, pack your bag, and head to unknown lands:\n\n\n\n\n\nBesides being an all-around incredible movie, it takes you into the heart of chaotic Tokyo. Bill Murray and Scarlett Johansson play two characters adrift in their hotel…at least until they cut loose and explore Tokyo. They are suffering from a self-imposed confinement, and that bonds them together. Together, they escape into Tokyo with its nonstop energy. The sights, sounds, and energy overwhelm you and will have you booking a flight to Japan. It’s one of my favorite movies of all time.\n\n\n\n\n\nI remember seeing this movie when it came out. It blew me away. The story follows a little girl in a Maori village and her struggle to get her grandfather’s acceptance. But the real star here is Maori culture. The modern world of a Maori is spotlighted in an accurate portrayal that invokes wonder and sympathy. I met a member of the featured tribe while in New Zealand, who said the film benefited his people greatly. This movie sparked a fascination with Maori culture that is part of the reason why I went to New Zealand.\n\n\n\n\n\nAnother New Zealand–based movie, Peter Jackson’s award-winning epic will leave you stunned by the diverse and beautiful landscape of New Zealand. From glaciers to rivers, mountains, and forests, New Zealand’s beauty was the star of this movie. It launched the country’s modern tourist industry and made it one of the premier destinations for adventure seekers. Die-hard fans can take part in Lord of the Rings tours.\n\n\n\n\n\nBased on a true story, this movie follows Christopher McCandless as he tries to shed his material life and get in touch with real life and nature. After graduating from college, Christopher sets out on a road trip through the USA before ending up in Alaska. Much of the story is based on second-hand accounts, yet the movie is a poignant reminder that we all could simplify our lives a little bit and just enjoy living. It reminds us that travel is not about what we carry with us but about what we carry inside.\n\n\n\n\n\nColin Farrell may have thought life in Bruges was hell, but the city provides a beautiful backdrop for this comedy. And I have to admit, until I saw this movie, I really didn’t know much about Bruges. Sure, I knew where it was and that it was famous, but I’d never given much thought to it. After this movie, I wanted to go to Bruges! It looked beautiful. (And, having been there now, I can confirm it is.) Bruges is a great destination for travelers who want to step back in time. This movie will have you including it in your next European adventure.\n\n\n\n\n\nI don’t like Diane Lane romance movies, and this movie is totally one of them. Girl feels lost in life, starts fresh, meets guy, everything works out. This movie could star any actress because the real movie star here is Tuscany. Tuscany provides a stunning backdrop for this otherwise mediocre movie. This place lives up to all the hype that surrounds it and will make you want to leave home and buy a vineyard in some small Italian village.\n\n\n\n\n\nA German movie that follows the true-life story of a Jewish family that escapes the Nazis to run a farm in Kenya. The movie deals with how they adjust to their new life and cope with the life they left behind. Anyone who has ever adapted to a new culture will be able to relate. It’s not always easy, but as this movie shows, it’s possible once you open yourself up. The movie is in German but subtitled in English. Besides being an inspiring travel movie, it’s one of my favorite foreign-language movies.\n\n\n\n\n\nNot only did these movies launch the short career of Paul Hogan but they made everyone want to be an Aussie. Dundee was the MacGyver of the outback. While the movies gave a generation of people clichéd notions of Australia, they also gave Americans a connection to the country. Like us, Aussies were free-spirited pioneers with a love for the wilderness. While it’s cliché and exaggerated, Australians do share a love for nature, and the movie inspired people to visit Oz.\n\n\n\n\n\nI live in an airport world. Maybe not as much as Ryan Bingham, George Clooney’s character, but when I saw this movie, I found myself relating too much to Ryan’s character. Though in some ways it has a happy ending, I found the movie to be a downer. I was depressed for hours afterward, because I see myself in Ryan’s lifestyle. He’s a man who feels at home in airports and planes and is constantly on the move. As he says, moving is living. The movie is a must-watch for long-term travelers, as it brings up the sometimes mixed emotions we have about living in constant motion.\n\n\n\n\n\nReleased in 2000, the movie follows Alex Garland’s novel about young backpackers who set out to find paradise but end up destroying it, and it had me drooling over Thailand. Those beaches, those parties, those people. It seemed wonderful. Backpackers in Asia are always reading the book, and the movie plays in all the guesthouses. It says something about our hopes for the road: we want to find our own idyllic, romantic paradise. The one we all think won’t be destroyed, but will. The movie has a different ending, characters, and storyline than the book, but the theme is the same. It is a great reflection on the hopes and realities of travel.\n\n\n\n\n\nSet in South America, this movie follows the life of Che Guevara from doctor to revolutionary. Starring Gael García Bernal, this poignant tale features amazing images of South America, from the deserts to the rainforest. It shows the heartbreaking poverty of the time period, too. Beautifully cast and directed, this movie will make you want to jump on a motorcycle and explore the continent. Even if you do not agree with the politics of the movie, its acting is first-rate, and this movie transcends the politics of the man it follows. It was critically acclaimed for a reason.\n\n\n\n\n\nIndy made everyone an archaeologist and an adventure seeker. From Egypt to India, Indy showed us the world and the mythology of ancient cultures. The movie brought out the adventurer in me and helped foster a love for history. It also did wonders for Petra, Jordan. Who didn’t want to see the city after watching The Last Crusade!? Despite the lackluster fourth installment, these movies not only remain some of the best in travel but some of the best of all time.\n\n\n\n\n\nReleased in 1991, this tragic story stars Susan Sarandon and Geena Davis as two women driving across the American Southwest in search of adventure and friendship while escaping the law. The movie is stunningly acted, winning many accolades, and also features breathtaking shots of the American West that will make you want to get in your car and see the country.\n\n\n\n\n\nReleased in 1962, this Peter O’Toole classic is set during World War I and follows a British soldier’s interaction with nomadic tribes. O’Toole is T.E. Lawrence, who unites Arabian tribes against the Turks. With stunning images of the desert, you’ll soon be wanting to lead your own expedition through the desert, though probably not for war. Lawrence may remain a controversial figure, but there’s no controversy that this is a great film set in an amazing place.\n\n\n\n\n\nA movie about Australian drag queens that take a road trip across the desert in order to perform at a lip-synching show. It’s funny, it’s heartwarming, it won a bunch of awards. The stars get shocking reactions as they wander across the Outback toward their show, stopping often along the way. Most importantly, it highlights two of the best things about Australia: the Outback and awesome accents.\n\n\n\n\n\nMade in 2006 and starring Russell Crowe, this movie features him as an uptight banker who finds his soul again when returns to his uncle’s vineyard. All he wants to do is sell it and make some money, but soon the countryside and a pretty French girl have him changing his tune. (French girls always have you changing your tune!) It’s a movie for the wine lover, and along with Under The Tuscan Sun, will have you heading off to the nearest vineyard before the credits finish.\n\n\n\n\n\nA silly movie about backpacking in Europe, this movie will nonetheless have you wanting to see all the places they filmed. The movie takes you across Europe in a whirlwind of stereotypes, but it’s pretty funny, and anyone who has roamed Europe can probably relate to a few of the situations. The script isn’t deep, and some of the situations are goofy, but it does a good job of sending you across Europe and features a very memorable appearance by Matt Damon.\n\n\n\n\n\nThis movie is about a German mountaineer Heinrich Harrer and his time with the Dalai Lama. Released in 1997 and starring Brad Pitt, it takes an interesting look at Tibetan culture on the eve of the Chinese invasion. You get an outsider’s perspective on this remote nation and of the ruler who now lives in exile in India. It is an interesting movie, even if it’s not 100% historically accurate.\n\n\n\n\n\nA year after their father’s funeral, three brothers travel across India by train in an attempt to grieve, bond, and get closer. As the brothers try to find meaning in their loss, they fight, resent each other, overcome barriers, and learn to love India. While not my favorite Wes Anderson movie, I loved the cinematography and scenery of this movie. I felt it did a good job of making you want to jump on a plane to India.\n\n\n\n\n\nI pretty much love every movie about Paris, but this is one of my all-time favorites, not least because it is set mostly set 1920s Jazz Age Paris — the one time period I would live in above all others. The movie follows Gil, a writer on vacation with his fiancée and her family. At night, he wanders the streets of Paris before stumbling into a time warp that sends him back to the ’20s to meet some of the most famous people of the age. With its lighting, story, and incredible acting, this movie will make your heart swoon for the City of Lights. Even though it plays to all the clichés of Paris, I eat it up!\n\n\n\n\n\nThis Indian independent film tells the story of an arranged marriage and the modern pushback against this tradition by the bride as the family prepares to host a four-day wedding. Artfully shot with intriguing characters and beautiful scenery, this is not only one of my favorite travel movies (and a phenomenal look at Indian culture) but one of my all-time favorite movies ever. I highly recommend you watch this movie.\n\n\n\n\n\nThis movie was better than I thought (and helped create a boom in Icelandic tourism). Walter Mitty, a guy who hates his job and dreams of a more exciting and adventurous life, is the liaison between Life magazine and the mysterious photographer Sean O’Connell. When the magazine wants to use one of Sean’s photographs for the last issue, Walter realizes he lost it and goes in search of Sean. Along the way, he breaks out of his shell, becomes more confident, and starts to turn his daydreams into reality. It’s a story most people can relate to! The breathtaking scenes they shoot around the world only add to the incredible story.\n\n\n\n\n\nSomeone who knows me well told me to watch it, and when I did, I was blown away. It was such an emotional movie. I cried a bit. The Way follows Tom, an American doctor who travels to France to pick up the ashes of his dead son. His son died on the Camino and he walks it to finish what his son started. Along the way, he makes friends with some other pilgrims and begins to see why his son loved traveling so much. Martin Sheen is incredible in this film, and the movie totally made me decide to hike the Camino this year.\n\n\n\n\n\nA Woody Allen movie, this movie follows two girlfriends on a summer holiday in Spain who become enamored with the same painter as they spend a holiday in Barcelona. When his crazy ex comes onto the scene, all hell breaks loose. This movie not only tells an amazing story but shows off the beauty, excitement, and magic of Barcelona (Woody Allen, what’s with you getting places right?).\n\n\n\n\n\nSet in Mexico, this movie follows two teenage boys and an attractive older woman who embark on a road trip and learn a thing or two about life, friendship, and each other. This movie won countless awards and helped make Gael García Bernal a star.\n\n\n\n\n\nBased on the novel of the same name, this movie follows Cheryl Strayed as she hikes the Pacific Crest Trail as a way to restart her life, end her drug addiction, and finally cope with the death of her mother. While I loved the book more (I mean, the book is always better), I thought Reese Witherspoon gave a really strong performance, and the movie still conveys the emotional impact of the book.\n\n\n\n\n\nThis classic Gen X movie about a young man and the woman he meets on a train in Europe says a lot about the shortness of travel relationships. They only have one night together, but it seems to stretch on forever. I like this movie because it plays with that sense of “travel time.” On the road, days feel like months, and when you meet someone special, one day can feel like a lifetime.\n\n\n\n\n\nWith this movie, I save the best for last. This documentary follows Brook Silva Braga as he prepares for his year-long trip around the world. He films the entire trip and it is the best — THE BEST — movie about long-term travel. It captures the anxiety before your trip, the worry of your friends and family, the ups and downs, the fleeting romances, deep friendships, and stresses of the road like no other movie ever has. Out of all the movies on this list, if you only watch one, watch this movie. Seriously, this is my favorite travel movie. I watched it the day before I came home and “settled” down in NYC and it stirred a lot of emotions. (I did an interview with Brook many, many years ago.)\n\n\n\n\n\nBased on the true story of Robyn Davidson, this 2013 film stars Mia Wasikowska and Adam Driver. It follows Robyn as she attempts to travel solo across the Australian outback with her camels in 1980 — a distance of over 2,000 miles. Much like the book (which is worth a read!), the film captures the grandness of Robyn’s adventure and explores what drives us to takes risks. As someone who has visited some of the places she went, I found it to be a super interesting account of what they looked like long before I came through.\n\n\n\n\n\nThis 1950’s black and white rom-com earned Audrey Hepburn an Academy Award for her performance. In the film, Hepburn portrays a European princess who escapes her strict royal schedule while visiting Rome to explore the city by herself. She, of course, meets a love interest and the two wander Rome together. The movie was actually filmed in Rome so you can really get a glimpse of what traveling to the Eternal City was like 70+ years ago. It’s a classic movie that still makes you fall in love with Rome!\n\n\n\n\n\nQueen of Katwe is based on the life of Phiona Mutesi, a young Ugandan girl who stumbled into learning chess. She developed a love for the game, using it to transform her life and rise above her impoverished roots. The film doesn’t shy away from the hard realities of life in Uganda, but it’s a Disney film so things don’t get too grim or dark. Overall, it’s an upbeat, inspirational story and a solid “feel good” travel film. Sort of like a real-life version of The Queen’s Gambit.\n\n\n\n\n\nThis documentary is about 85-year-old sushi master Jiro Ono. He was the first sushi chef to be given three Michelin stars and is considered the greatest sushi chef in the world. This documentary explores his life, his sushi, and his complicated relationship with his son — who has followed in his footsteps and is the heir to Jiro’s world-famous restaurant. As a sushi lover, I absolutely loved this movie. If you love Japan and Japanese culture, this is one not to miss!\n\n***\n\nThere are many travel movies out there — most of them horrible — but out of the countless movies I’ve seen, these are my favorite. What are yours?\n\n\n\n", "images": ["https://media.nomadicmatt.com/moremovies9.jpg", "https://media.nomadicmatt.com/movietravel07.jpg", "https://www.nomadicmatt.com/wp-content/uploads/2017/05/brookinterview4-380x220.jpg", "https://media.nomadicmatt.com/siteimages/Travel_Hacking-sb.jpg", "https://media.nomadicmatt.com/siteimages/2020/sidebar-make-money.jpg", "https://www.nomadicmatt.com/wp-content/uploads/2017/10/cinema-380x220.jpg", "https://media.nomadicmatt.com/movielordoftherings.jpg", "https://media.nomadicmatt.com/2021/tracks1.jpg", "https://media.nomadicmatt.com/movieamapforsaturday.jpg", "https://media.nomadicmatt.com/moviecrocodiledundee.jpg", "https://media.nomadicmatt.com/movieintothewild.jpg", "https://media.nomadicmatt.com/movietravel03.jpg", "https://media.nomadicmatt.com/movietravel06.jpg", "https://media.nomadicmatt.com/movietheway.jpg", "https://media.nomadicmatt.com/movieytumama.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20340%20194'%3E%3C/svg%3E", "https://media.nomadicmatt.com/movievickycristinabarcelona.jpg", "https://media.nomadicmatt.com/movietravel05.jpg", "https://media.nomadicmatt.com/2021/katwe1.jpg", "https://media.nomadicmatt.com/2021/roman1.jpg", "https://media.nomadicmatt.com/movienowhereinafrica.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20340%20193'%3E%3C/svg%3E", "https://media.nomadicmatt.com/movietravel08.jpg", "https://media.nomadicmatt.com/movietravel04.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20674%20395'%3E%3C/svg%3E", "https://media.nomadicmatt.com/moviescreen.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20675%20320'%3E%3C/svg%3E", "https://media.nomadicmatt.com/movieunderthetuscansun.jpg", "https://media.nomadicmatt.com/moremovies2.jpg", "https://media.nomadicmatt.com/movietravel01.jpg", "https://media.nomadicmatt.com/moviemidnightinparis.jpg", "https://www.nomadicmatt.com/wp-content/uploads/2018/01/tokyofood.jpg", "https://media.nomadicmatt.com/movietravel02.jpg", "https://media.nomadicmatt.com/moviewild.jpg", "https://media.nomadicmatt.com/siteimages/Favorite-Companies.jpeg", "https://media.nomadicmatt.com/moviemonsoonwedding.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20675%20395'%3E%3C/svg%3E", "https://media.nomadicmatt.com/movietravel09.jpg", "https://media.nomadicmatt.com/movielostintranslation.jpg", "https://media.nomadicmatt.com/movieinbruges.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20340%20198'%3E%3C/svg%3E", "https://media.nomadicmatt.com/moviesecretlifeofwaltermitty.jpg", "https://media.nomadicmatt.com/2021/jiro1.jpg", "https://www.nomadicmatt.com/wp-content/uploads/2016/01/moviescreen-12.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20380%20220'%3E%3C/svg%3E", "https://media.nomadicmatt.com/moviethedarjeelinglimited.jpg", "https://media.nomadicmatt.com/moviebeforesunrise.jpg"], "top_img": "https://www.nomadicmatt.com/wp-content/uploads/2016/01/moviescreen-12.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.nomadicmatt.com/travel-blogs/the-ultimate-list-of-travel-movies/", "title": "Best Travel Movies: My Current List of Favorites", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "These 32 awesome travel movies will keep you dreaming about the road, paradise and getting away from it all! Get inspired while watching.", "og": {"locale": "en_US", "type": "article", "title": "Best Travel Movies: My Current List of Favorites", "description": "These 32 awesome travel movies will keep you dreaming about the road, paradise and getting away from it all! Get inspired while watching.", "url": "https://www.nomadicmatt.com/travel-blogs/the-ultimate-list-of-travel-movies/", "site_name": "Nomadic Matt's Travel Site", "image": {"identifier": "https://www.nomadicmatt.com/wp-content/uploads/2016/01/moviescreen-12.jpg", "width": 675, "height": 395, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/nomadicmatt", "author": "https://www.facebook.com/nomadicmatt", "published_time": "2016-01-26T13:41:34+00:00", "modified_time": "2022-06-26T21:36:50+00:00"}, "author": "NomadicMatt", "twitter": {"card": "summary_large_image", "creator": "@mattkzbt", "site": "@nomadicmatt", "label1": "Written by", "data1": "NomadicMatt", "label2": "Est. reading time", "data2": "15 minutes"}, "generator": "WooCommerce 6.8.2", "p": {"domain_verify": "c517d63e1a340e61a859f03a8067b18b"}, "fb": {"admins": 17907271}, "google-site-verification": "JnEof-UInYjGaDZCb-ZnJzC4VT8bsCHcQABc9mkLiks", "msapplication-TileColor": "#262626", "msapplication-TileImage": "/mstile-144x144.png", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1453815694.0, "source": "https://www.nomadicmatt.com", "summary": ""}