{"url": "https://entertainment.ie/cinema/movie-news/the-first-spoiler-free-reactions-and-reviews-are-in-for-avengers-infinity-war-227109/", "text": "Avengers: Infinity War, as you all likely know by now, hits cinemas this Thursday. After its premiere last night, the first responses to the film have been unveiled on social media.\n\nThe general consensus is that it is a hugely emotional experience, with Tweeters referring to the film as ‘breathtaking’ and ‘epic beyond compare’ with praise for its action sequences and drama.\n\nThere’s a lot of acclaim for the ending (and its post credits scene) too, which has us very intrigued. Many are saying they’d go see it again, so we’re expecting – as if we didn’t before… - that it’s going to make a fortune in the box office.\n\n#InfinityWar is everything you want, nothing you expect. It’s funny, surprising, dark, filled with delightful interplay between characters never seen on screen before. I know many filmmakers say they are trying to make a sequel in the vein of Empire Strikes Back, this succeeds. — Peter Sciretta (@slashfilm) April 24, 2018\n\nI am overwhelmed. The movie is epic beyond compare. LOVED it. My legs are still shaking. It’s a gigantic @Marvel masterpiece. So much to say but I’ll stay Silent Bob til Monday so as not to slip in spoilers. Suffice to say it’s gonna be a looooong year until @Avengers 4... pic.twitter.com/aHnsgj5MK0 — KevinSmith (@ThatKevinSmith) April 24, 2018\n\n#InfinityWar was an impossibly huge, breathtaking blockbuster. Amazing action, more laughs than you'd expect, and A WHOLE LOT that you won't see coming. Marvel fans, rest assured, you're gonna have fun. — Tom Jorgensen (@Tom_Jorgensen) April 24, 2018\n\n\"Avengers: Infinity War\" is the culmination of the last 10 years in the MCU, coming to a point of flawless action, dramatic effect, and a breathtaking appeal for its fans. It is an impeccable achievement in both direction and visuals. (1 of 2) #Avengers #InfinityWar pic.twitter.com/DVcxtI3Scs — Clayton Davis (@AwardsCircuit) April 24, 2018\n\nLaughter. Fights. Tough decisions. Triumph and emptiness. @Avengers has it all. I feel the weight of what I just saw and the journey of the last ten years bearing down. Mama needs a drink. Wow. #infinitywar #ThanosDemandsYourSilence — Grae Drake (@graedrake) April 24, 2018\n\n#InfinityWar is mostly great, somehow managing to mix all the elements of the MCU into one big mix-tape of fun, thrills, emotion... and despair. The ending is brilliant. — Scott Collura (@ScottCollura) April 24, 2018\n\nMy God. #AvengersInfinityWar was Incredible. Incredible. Incredible. The visuals, the story, the GUTS. The action is non stop, the movie grips you and never lets you go. EVERYONE gets a moment to shine. And that ending...My God that ending...Best film the MCU has ever done! — John Steven Rocha (@TheRochaSays) April 24, 2018\n\nAvengers #InfinityWar is epic, emotional and most of all, shocking. Marvel just raised the stakes higher than you can believe. pic.twitter.com/KnqJICe7fC — Inverse (@inversedotcom) April 24, 2018\n\n#InfinityWar is a whole lot to process. I liked it a lot, and there’s so much that works, but it definitely is “Part 1.” The ending is amazing and worth the journey, but there is a LOT crammed into its run time. Overall really liked it but need a rewatch already. pic.twitter.com/3P3rd3ojHJ — Terri Schwartz (@Terri_Schwartz) April 24, 2018\n\n#AvengersInfinityWar is my second fave @Marvel movie after #BlackPanther. The superhero interplay is hilarious and surprising at every turn. The action is monumental. And there are actual stakes this time around. Kevin Feige is not f-cking around with this one. — Nigel M. Smith (@nigelmfs) April 24, 2018\n\nAVENGERS: INFINITY WAR is very weighty and juggles most of its characters with consideration. It’s the closest thing to a Paul Thomas Anderson movie you’ll find in the Marvel Cinematic Universe. I Am Shook! #Marvel #AvengersInfinityWar pic.twitter.com/YgntkXFIkv — Rudie Obias (@RudieObias) April 24, 2018\n\nInfinity WOW! #InfinityWar. Lots of payoffs. Stay till the very END. That’s all I’m saying. pic.twitter.com/ch7adyFK21 — Brian Tong (@briantong) April 24, 2018\n\nI liked #Avengers #InfinityWar more than a lfew other folks I’m talking to after the premiere. It’s hugely emotional and very funny but some might find it ... I need to sleep on this. — Jim Vejvoda (@JimVejvoda) April 24, 2018\n\nIf you deem yourself a true Marvel fan, see how well you do on our Ultimate MCU quiz and see how well you can list all the Marvel movies in order of their release. Plus find out what a marvel the studio really is as we look at the MCU in numbers.\n\nVia Twitter", "images": ["https://entertainment.ie/images/entertainment-ie-25y-logo2x.png", "https://entertainment.ie/images/entertainment-logo-25years-icon2x.png", "https://images.entertainment.ie/storage/images_content/rectangle/620x372/Untitled20171101128705.jpg?w=1280&h=768&q=high"], "top_img": "https://images.entertainment.ie/storage/images_content/rectangle/620x372/Untitled20171101128705.jpg?w=1280&h=768&q=high", "keywords": [], "authors": ["Deirdre Molumby"], "canonical_link": "https://entertainment.ie/movies/movie-news/the-first-spoiler-free-reactions-and-reviews-are-in-for-avengers-infinity-war-227109/", "title": "The first (spoiler free) reactions and reviews are in for Avengers: Infinity War", "meta_data": {"description": "Avengers: Infinity War, as you all likely know by now, hits cinemas this Thursday. After its premiere last night, the first responses to the film have been unve...", "keywords": "Avengers: Infinity War, Infinity War, Marvel,Avengers Infinity War,Infinity War,Marvel", "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "theme-color": "#FF5700", "author": "Deirdre Molumby", "dfp": "4844766/Entertainment.ie_New", "revised": "08/10/2022 18:20:57", "article": {"published_time": "2018-04-24T10:52:53+01:00"}, "dfpSection": "Movies", "robots": "index, follow", "fb": {"app_id": 2788711801154650}, "powered-by": "Packed.House (https://www.packed.house/)", "og": {"title": "The first (spoiler free) reactions and reviews are in for Avengers: Infinity War", "description": "Avengers: Infinity War, as you all likely know by now, hits cinemas this Thursday. After its premiere last night, the first responses to the film have been unve...", "type": "article", "url": "https://entertainment.ie/movies/movie-news/the-first-spoiler-free-reactions-and-reviews-are-in-for-avengers-infinity-war-227109/", "site_name": "Entertainment.ie", "image": {"identifier": "https://images.entertainment.ie/storage/images_content/rectangle/620x372/Untitled20171101128705.jpg?w=1280&h=768&q=high", "width": 1280, "height": 768, "type": "image/jpeg"}}, "twitter": {"card": "summary_large_image", "site": "@entertainmentIE", "url": "https://entertainment.ie/movies/movie-news/the-first-spoiler-free-reactions-and-reviews-are-in-for-avengers-infinity-war-227109", "title": "The first (spoiler free) reactions and reviews are in for Avengers: Infinity War", "description": "Avengers: Infinity War, as you all likely know by now, hits cinemas this Thursday. After its premiere last night, the first responses to the film have been unve...", "image": "https://images.entertainment.ie/storage/images_content/rectangle/620x372/Untitled20171101128705.jpg?w=1280&h=768&q=high"}, "numberOfItems": 4, "itemListOrder": "Ascending"}, "movies": [], "publish_date": 1524563573.0, "source": "https://entertainment.ie", "summary": ""}