{"url": "https://metro.co.uk/2017/09/26/defensive-kris-jenner-declares-kylie-is-not-confirming-anything-over-pregnancy-as-ryan-seacrest-probes-her-live-on-air-6955695/", "text": "Kris Jenner says her daughter Kylie will not be addressing the pregnancy rumours (Picture: Getty)\n\nKris Jenner has declared that daughter Kylie will be keeping schtum on the pregnancy rumours for a while yet.\n\nRafael Nadal 'becomes father for first time' as wife Mery Perelló ‘gives birth'\n\nThe youngest of the Kardashian sisters is rumoured to be pregnant with boyfriend-of-five-months Travis’ baby.\n\nAnd when Keeping Up With The Kardashians producer Ryan Seacrest decided to probe the momager live on TV during an episode of Live With Kelly And Ryan, he got shut down.\n\nAs Ryan and co-host Kelly Ripa were discussing the topic of Kylie’s alleged baby bump when he picked up his phone and sent Kris a text as he ‘had not spoken with the family over the weekend’.\n\nSorry, this video isn't available any more.\n\nAnd moments later, he heard back from 61-year-old Kris, who was giving nothing away.\n\n‘Kris says Kylie’s not confirming anything,’ he told the audience. ‘That’s the news from the family this morning. Kylie is not confirming anything.’\n\nRyan Seacrest has given an update from the Kardashian household (Picture: YouTube)\n\nThe head of the Kardashian household had been quizzed on her daughter’s pregnancy rumours at the weekend during Milan fashion week.\n\nShe had said at the time that she was ‘surprised to wake up to the rumours’, adding: ‘It wouldn’t be the family if something didn’t happen every single day.’\n\nA source close to Kris had also claimed that while Kris was surprise, she will support her youngest daughter ‘no matter what’.\n\nKris was at Milan Fashion Week when news broke that Kylie is apparently pregnant (Picture: Pixelformula/SIPA/REX/Shutterstock)\n\nRyan’s investigative work comes as the news emerges that Kylie is reportedly desperate for Travis to ‘put a ring on it’ as soon as she’s given birth.\n\nWhile Kylie, 20, has kept tight lipped about it all so far – apart from a few teasing Instagram pictures and sources close to her family speaking out – it’s believed that she’s around five months pregnant and is due to pop in January.\n\nAnd it looks like she’s getting her life in order quickly as, according to US reports, she’s already planning an ‘amazing’ wedding to take place as soon as she’s lost her baby weight.\n\n‘Kylie wants an amazing wedding and wants to be married as soon as she loses all of her baby weight,’ a source told Hollywood Life.\n\nKylie wore a very baggy tee to support boyfriend Travis Scott at the iHeartRadio gig (Picture: Buckner/Variety/REX/Shutterstock)\n\nIt’s claimed she want her baby to have a settled family life and is keen to avoid her first born growing up in a ‘broken home’, hence why she’s so keen to walk up the aisle with her rapper beau.\n\n‘She wants her child to have a father that is always there and someone that will make their relationship forever,’ the source continued.\n\nTravis Scott and Kylie Jenner (Picture: Getty)\n\n‘She has seen her family and her exes deal with heartache and broken homes and she wants to have the family life that is a success. So to be married is something she wants very soon and she will be very excited for Travis put a ring on it.’\n\nHowever, other members of the Kardashians apparently think Kylie might be a bit too ‘naive’ to have a baby at just 20.\n\n‘Kylie is very naive,’ a source told People. ‘Spending time with other people’s kids is obviously completely different than being a mom 24/7. Kylie of course has no idea about all the hard work and sleepless nights.’\n\nTravis Scott performs in April this year (Picture: Bob Levey/Getty Images)\n\nKylie’s dad Caitlyn was also apparently ‘shocked and disappointed’ at the news.\n\n‘Caitlyn was really shocked and disappointed to learn that Kylie is pregnant,’ source close to Caitlyn told Hollywood Life.\n\n‘She thinks Kylie is way too young to have a baby, and that she should have waited until she was in a long term committed relationship.’\n\nCaitlyn Jenner was ‘shocked’ by Kylie’s news (Picture: Getty)\n\nAnd while Kylie and Travis have not yet confirmed they are expecting, Caitlyn appeared to do it for them on Monday.\n\nWhile representatives for Caitlyn denied that she found out on the internet, as had been reported, they told The Sun that all they could say is that she was told ‘some time ago’.\n\nKylie and Travis, 25. met in April, just weeks after she split from long-term partner Tyga, and later that night Tyga claimed that he was the baby’s father, in a now-deleted Snapchat which featured an image of Kylie and the headline ‘Kylie is pregnant’, but Tyga had written over the top of the image ‘Hell nah that’s my kid,’ with four purple devil emojis.\n\nWhile neither of them have addressed the pregnancy rumours on their social media accounts, the pair have been spotted together in Las Vegas, following Travis’ iHeartRadio gig.\n\nKylie was noticeably in a baggy grey T-shirt, hiding her stomach. But the question remains: is there a baby bump underneath?\n\nMORE : Kris Jenner ‘doesn’t want to see Kylie Jenner’s pregnancy affect’ her multi-million dollar business\n\nMORE : Caitlyn Jenner ‘confirms’ daughter Kylie Jenner’s pregnancy, has known for ‘some time’", "images": ["https://metro.co.uk/wp-content/uploads/2017/09/prc_54474121.jpg?quality=90&strip=all&zoom=1&resize=644%2C338", "https://metro.co.uk/wp-content/themes/metro-parent/img/ipso-logo.jpg", "https://metro.co.uk/wp-content/uploads/2022/09/Metro-56e2.png", "https://metro.co.uk/wp-content/uploads/2022/09/Michaels-Bar-6a30.png", "https://metro.co.uk/wp-content/uploads/2017/09/prc_54474121.jpg?quality=90&strip=all&crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630", "https://metro.co.uk/wp-content/uploads/2022/09/BHM-0569.png", "https://metro.co.uk/wp-content/themes/metro-parent/img/fallback.png"], "top_img": "https://metro.co.uk/wp-content/uploads/2017/09/prc_54474121.jpg?quality=90&strip=all&crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630", "keywords": [], "authors": ["Amy Duncan"], "canonical_link": "https://metro.co.uk/2017/09/26/defensive-kris-jenner-declares-kylie-is-not-confirming-anything-over-pregnancy-as-ryan-seacrest-probes-her-live-on-air-6955695/", "title": "Kylie Jenner 'is not confirming anything' over pregnancy, says Kris", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "format-detection": "telephone=no", "google-site-verification": "NRfCb8mBNAy5_f17NpvLZYoY38EzM2dgpcOh_Am9yps", "twitter": {"widgets": {"csp": "on"}, "image": {"src": "https://metro.co.uk/wp-content/uploads/2017/09/prc_54474121.jpg?quality=90&strip=all&crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630"}, "title": "Defensive Kris Jenner declares Kylie 'is not confirming anything' over pregnancy", "description": "Ryan Seacrest asks the questions we all want to know the answers to.", "card": "summary_large_image", "site": "@MetroUK", "account_id": 138749160}, "ir-site-verification-token": 422605026, "description": "Kris Jenner has declared that daughter Kylie will be keeping schtum on the pregnancy rumours for a while yet. The youngest of the Kardashian sisters is rumoured to be pregnant...", "news_keywords": "Kris Jenner, Kylie Jenner, Kylie Jenner pregnancy, Kylie Jenner baby, Kylie Jenner pregnancy pictures, Kylie Jenner instagram, Kylie Jenner twitter", "msvalidate.01": "11110DC8D42E74E13F24B3A18E7CFB8A", "pocket-site-verification": "8aec208948f7b2f9092ac4ce91dac7", "robots": "max-image-preview:large", "ia": {"markup_url": "https://metro.co.uk/2017/09/26/defensive-kris-jenner-declares-kylie-is-not-confirming-anything-over-pregnancy-as-ryan-seacrest-probes-her-live-on-air-6955695/?ia_markup=1"}, "generator": "WordPress 6.0.2", "fb": {"pages": 117118184990145, "app_id": 176908729004638}, "theme-color": "#000000", "apple-mobile-web-app-title": "Metro", "sailthru.date": "2017-09-26 07:25:03", "sailthru.title": "Defensive Kris Jenner declares Kylie ‘is not confirming anything’ over pregnancy as Ryan Seacrest probes her live on air", "sailthru.tags": "kris jenner, kylie jenner, ryan seacrest, social media", "sailthru.description": "Ryan Seacrest asks the questions we all want to know the answers to.", "sailthru.image.full": "https://metro.co.uk/wp-content/uploads/2017/09/prc_54474121.jpg?quality=90&strip=all&crop=286px%2C0px%2C630px%2C630px&resize=150%2C150", "sailthru.image.thumb": "https://metro.co.uk/wp-content/uploads/2017/09/prc_54474121.jpg?quality=90&strip=all&crop=286px%2C0px%2C630px%2C630px&resize=150%2C150&w=50", "og": {"locale": "en_GB", "title": "Defensive Kris Jenner declares Kylie 'is not confirming anything' over pregnancy", "type": "article", "url": "https://metro.co.uk/2017/09/26/defensive-kris-jenner-declares-kylie-is-not-confirming-anything-over-pregnancy-as-ryan-seacrest-probes-her-live-on-air-6955695/", "description": "Ryan Seacrest asks the questions we all want to know the answers to.", "site_name": "Metro", "image": {"identifier": "https://metro.co.uk/wp-content/uploads/2017/09/prc_54474121.jpg?quality=90&strip=all&crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630", "secure_url": "https://metro.co.uk/wp-content/uploads/2017/09/prc_54474121.jpg?quality=90&strip=all&crop=0px%2C0px%2C1200px%2C630px&resize=1200%2C630", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/MetroUK", "section": "Entertainment", "tag": "Social Media", "published_time": "2017-09-26T07:25:03+0000", "modified_time": "2019-12-12T11:44:05+0000"}, "msapplication-TileImage": "https://metro.co.uk/wp-content/uploads/2020/03/cropped-m-icon-black-9693.png?w=270"}, "movies": [], "publish_date": 1506380400.0, "source": "https://metro.co.uk", "summary": ""}