{"url": "https://www.cnn.com/2018/03/02/us/aly-raisman-files-lawsuit-against-usoc-usa-gymnastics/index.html", "text": "Story highlights Raisman says she was sexually abused by Nassar, including at the London Olympics Separately, Jacob Moore is the first male gymnast to join a federal suit against Nassar\n\nCNN —\n\nOlympic gold-winning gymnast Aly Raisman has filed a lawsuit against the US Olympic Committee, USA Gymnastics, disgraced doctor Larry Nassar and others, alleging the committee at its highest levels was aware that Nassar had molested gymnasts who participated with USA Gymnastics.\n\nThe suit was filed Wednesday in Santa Clara County Superior Court in California.\n\nAccording to the complaint, Nassar, the former doctor for Michigan State University athletics and the national gymnastics team, sexually abused Raisman at the Karolyi Ranch in Texas, national and international competitions and the 2012 London Olympics.\n\nRaisman is a two-time Olympian who won medals in London and Rio de Janeiro, including team gold in each of those Games.\n\n“My highest priority has been to push for change, so future generations of athletes will be safer,” Raisman said in a statement. “It has become painfully clear that these organizations have no intention of properly addressing this problem. After all this time, they remain unwilling to conduct a full investigation, and without a solid understanding of how this happened, it is delusional to think sufficient changes can be implemented.\n\n“Meanwhile, thousands of young athletes continue to train and compete every day in this same broken system. I refuse to wait any longer for these organizations to do the right thing. It is my hope that the legal process will hold them accountable and enable the change that is so desperately needed.”\n\nIn a statement, Raisman’s attorney, John Manly, accused the USOC and USA Gymnastics of “a conspiracy to silence victims and cover up the largest child sex abuse scandal in history.”\n\n“A simple fact is this: If USA Gymnastics and the US Olympic Committee had followed their own bylaws, policies and procedures designed to protect children from sexual abuse, Ms. Raisman never would have met him, never would have been ‘treated’ by him and never would have been molested by him,” Manly said.\n\n“Instead they conspired to hide their knowledge of Nassar’s horrible crimes from the public and attempted to frighten Ms. Raisman and other victims into keeping quiet. USOC and USAG can and will be made accountable by our justice system.”\n\nUSA Gymnastics declined to comment on Raisman’s lawsuit Friday but offered support to athletes who have been abused by Nassar. “USA Gymnastics is committed to doing everything we can to prevent this from happening again by making bold decisions and holding ourselves to the highest standards of care,” it said in a statement.\n\nCNN also reached out to the US Olympic Committee for comment. Previously, USA Gymnastics, the Olympic Committee and Michigan State have denied wrongdoing in the Nassar scandal.\n\nThe US Olympic Committee announced Wednesday that CEO Scott Blackmun is stepping down for health reasons. In late January, the entire membership of the USA Gymnastics board of directors resigned, as required by the USOC in a move to improve the organization and provide a safe environment for gymnasts.\n\nUSA Gymnastics terminated its agreement with the Karolyi Ranch in January. Marta and Bela Karolyi, longtime gymnastics coaches for Team USA, are retired.\n\nNassar, 54, pleaded guilty to federal child pornography charges and 10 counts of criminal sexual conduct in two state court cases in Michigan. He’s in prison in Tucson, Arizona, serving a 60-year sentence for the federal charges.\n\nIf he’s still alive when he finishes his federal sentence, Nassar will have to return to Michigan to serve sentences for sex crimes. He was sentenced to 40 to 125 years in Eaton County, Michigan, where nearly 200 girls and women made statements about how his sexual abuse had changed their lives.\n\nThat sentence will run concurrently with the 40- to 175-year sentence from nearby Ingham County. In the latter case, Nassar pleaded guilty to seven counts of criminal sexual conduct – three of which involved victims under age 13 – and admitted to using his stature as a medical professional to assault and molest girls under the guise of medical treatment.\n\nFirst male gymnast joins suit against Nassar\n\nSeparately, the first male gymnast has joined a civil federal suit against Nassar and others associated with the sex abuse scandal of the former Michigan State and USA Gymnastics doctor.\n\nFiled Wednesday, the complaint alleges Jacob Moore was treated multiple times by Nassar in a Twistars gym, at the Michigan State University Sports Medicine Clinic and in Nassar’s home. It was there, according to the suit, that Nassar “pulled down Plaintiff Jacob Moore’s pants, exposing his genitalia, explaining to Jacob Moore that he was doing this to treat his shoulder pain through acupuncture in his pubic area and in and around his genitalia.”\n\nMoore was a minor at the time, and this was done after another minor female gymnast came into the basement where he was being treated, the suit says.\n\n“There is no known medical connection between shoulder pain which can be treated through acupuncture in the area of a male’s genitalia,” the suit says. “Plaintiff Jacob Moore believes the conduct of Dr. Nassar was sexual assault, battery, abuse, molestation and harassment performed by Defendant Nassar for Defendant Nassar’s sexual pleasure and gratification.”\n\nMoore’s sister, Kamerin, a member of USA Gymnastics from 2003-2014, first testified about her and her brother’s victimization during Nassar’s criminal trial in Ingham County in January. She also joined the federal civil suit.\n\nJacob Moore has been a member of USA Gymnastics since 2006 and trained at the Twistars gym from 2001 through 2015.\n\nThe allegations were made in an amended civil federal complaint filed against Nassar. Defendants include Michigan State, the university’s board of trustees, USA Gymnastics and others associated with the scandal. USA Gymnastics also declined to comment on Moore’s complaint.\n\nThe suit, which has several other plaintiffs, seeks declaratory, injunctive, equitable and monetary relief for injuries.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/180205093736-larry-nassar-speaks-in-court-sentencing-hearing-sot-00001007.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/180208154441-aly-raisman-2-8-18-lead.jpg?q=x_2,y_0,h_1078,w_1915,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/140926165012-jill-martin-profile-image.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/180119152936-aly-raisman-0119.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/150107161917-amanda-watts-profile.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/180119152936-aly-raisman-0119.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/180228162439-scott-blackmun-03072016.jpg?q=x_291,y_475,h_1603,w_2849,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/180205101423-larry-nassar-third-sentencing-michigan-sot-00000000.jpg?q=x_204,y_80,h_839,w_1491,c_crop/h_144,w_256"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/180119152936-aly-raisman-0119.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/w_800", "keywords": [], "authors": ["Jill Martin Amanda Watts Kristina Sgueglia", "Jill Martin", "Amanda Watts", "Kristina Sgueglia"], "canonical_link": "https://www.cnn.com/2018/03/02/us/aly-raisman-files-lawsuit-against-usoc-usa-gymnastics/index.html", "title": "Aly Raisman sues US Olympic Committee and USA Gymnastics", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Aly Raisman sues US Olympic Committee and USA Gymnastics | CNN", "description": "Olympic gold-winning gymnast Aly Raisman has filed a lawsuit against the US Olympic Committee, USA Gymnastics, disgraced doctor Larry Nassar and others, alleging the committee at its highest levels was aware that Nassar had molested gymnasts who participated with USA Gymnastics.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180119152936-aly-raisman-0119.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/w_800", "type": "article", "url": "https://www.cnn.com/2018/03/02/us/aly-raisman-files-lawsuit-against-usoc-usa-gymnastics/index.html", "site_name": "CNN"}, "twitter": {"title": "Aly Raisman sues US Olympic Committee and USA Gymnastics | CNN", "description": "Olympic gold-winning gymnast Aly Raisman has filed a lawsuit against the US Olympic Committee, USA Gymnastics, disgraced doctor Larry Nassar and others, alleging the committee at its highest levels was aware that Nassar had molested gymnasts who participated with USA Gymnastics.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180119152936-aly-raisman-0119.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/w_800", "card": "summary_large_image", "site": "@CNN"}, "description": "Olympic gold-winning gymnast Aly Raisman has filed a lawsuit against the US Olympic Committee, USA Gymnastics, disgraced doctor Larry Nassar and others, alleging the committee at its highest levels was aware that Nassar had molested gymnasts who participated with USA Gymnastics.", "template_type": "article_leaf", "type": "article", "meta-section": "us", "theme": "us", "article": {"published_time": "2018-03-02T19:28:19Z", "modified_time": "2018-03-02T23:39:24Z", "tag": "aly raisman, crime, law enforcement and corrections, crimes against persons, criminal offenses, gymnastics, larry nassar, law and legal system, lawsuits and claims, sex and gender issues, sex crimes, sexual assault, society, sports and recreation, sports figures, sports organizations and teams, trial and procedure, us olympic committee, usa gymnastics, athletes, michigan, midwestern united states, north america, united states, michigan state university, universities and colleges, criminal law, olympics, sports events, bela karolyi", "publisher": "https://www.facebook.com/CNN"}, "keywords": "aly raisman, crime, law enforcement and corrections, crimes against persons, criminal offenses, gymnastics, larry nassar, law and legal system, lawsuits and claims, sex and gender issues, sex crimes, sexual assault, society, sports and recreation, sports figures, sports organizations and teams, trial and procedure, us olympic committee, usa gymnastics, athletes, michigan, midwestern united states, north america, united states, michigan state university, universities and colleges, criminal law, olympics, sports events, bela karolyi", "author": "Jill Martin,Amanda Watts,Kristina Sgueglia", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1519948800.0, "source": "https://www.cnn.com", "summary": ""}