{"url": "https://web.archive.org/web/20220823002204/https://www.forbes.com/sites/russespinoza/2018/05/30/e-cancels-scripted-series-the-arrangement-after-two-seasons/", "text": "It's off--\"canceled,\" if you will. After two seasons and 20 episodes, the E! network on Tuesday announced they will not renew The Arrangement, one of its two scripted series, for a third season.\n\nThe fictional celebrity drama, which certainly never mined the Church of Scientology and the marriage of Tom Cruise and Katie Holmes for source material, aired what turned out to be its series finale on May 13. That episode, titled \"Suite Revenge,\" was--at least for a short time--regarded as the Season 2 finale. It was seen by 432,000 viewers and drew a 1.8 rating in the 18-49 demo.\n\n\"Over two seasons, E!'s scripted series The Arrangement has taken viewers inside the world of an A-list movie star filled with secrets, scandal and romance,\" wrote an E! spokesperson in a statement to Deadline on Tuesday. \"While we have decided not to move forward with the series, we are incredibly grateful to the cast and our production partners.\"\n\nThe Arrangement was produced by Universal Cable Productions and starred Josh Henderson, Christine Evangelista, Lexa Doig and Michael Vartan.\n\nThe series stylized itself as a high-stakes Hollywood love story exploring the bizarre and sinister underbelly of incredible fame. Ratings for its first season in the spring of 2017 were fruitful by cable standards, having drawn an average of 1.3 million viewers overall and 725,000 in the 18-49 demo. Most commendably, the show became the year's second-most watched new scripted cable drama with women ages 18-34.\n\nDespite its strong start, ratings for Season 2 declined by double digits and the show reached its low point in the middle of this year's 10-episode spring run with a stretch of episodes viewed by 400,000 people or less.\n\n\"Sad to say I got the call that #TheArrangement won't be coming back for a 3rd season,\" tweeted creator, executive producer and writer Jonathan Abrahams early Tuesday night. \"There's grieving to be sure but also gratitude for the opportunity and the experience of working with so many wonderful and talented people. Thanks for all your support, twitter peeps. Much [love].\"\n\nAs of now, The Royals stands alone as E!'s only remaining scripted series; sticking out like a bearskin hat in a mob of reality programming (Keeping Up with the Kardashians, Total Bellas, Botched) and celebrity docuseries like Citizen Rose, Very Cavallari and Model Squad.\n\nFor its part, The Royals also suffered a marked downturn in ratings this year. Its fate is additionally in limbo following the December 2017 ouster of creator-showrunner Mark Schwahn over sexual harassment allegations.\n\nWhile a twin-killing of scripted fare could be in the offing at the network, E! is reportedly in the early stages of developing a scripted pilot from writer Michael Patrick King called Juicy Stories.\n\nOn Tuesday night, Arrangement creator Jonathan Abrahams fielded tweets from disappointed fans of the show. In reply to a question about whether depressed ratings in Season 2 ultimately doomed the series, he wrote: \"Yes. Definitely not for the reason that other show got canceled today...\"\n\nE! is owned by NBCUniversal.", "images": ["https://web.archive.org/web/20220823002204im_/https://imageio.forbes.com/specials-images/dam/imageserve/953969188/0x0.jpg?format=jpg&width=1200", "https://web.archive.org/web/20220823002204im_/https://secure.gravatar.com/avatar/c43a222abe250cc2bb7337c0c5eb4125?s=400&d=mm&r=g"], "top_img": "https://web.archive.org/web/20220823002204im_/https://imageio.forbes.com/specials-images/dam/imageserve/953969188/0x0.jpg?format=jpg&width=1200", "keywords": [], "authors": ["Russ Espinoza", "Former Contributor"], "canonical_link": "https://web.archive.org/web/20220823002204/https://www.forbes.com/sites/russespinoza/2018/05/30/e-cancels-scripted-series-the-arrangement-after-two-seasons/", "title": "E! Cancels Scripted Series 'The Arrangement' After Two Seasons", "meta_data": {"referrer": "no-referrer-when-downgrade", "viewport": "width=device-width,initial-scale=1,maximum-scale=5,minimum-scale=1,user-scalable=yes", "description": "Axing of the fictional Hollywood drama leaves only one scripted series left at E!", "author": "Russ Espinoza", "article": {"channel": "Business", "section": "Media", "section_url": "https://www.forbes.com/media/", "id": "blogAndPostId/blog/post/4948-2595", "published": "2018-05-30", "modified": "2018-05-30", "publisher": "https://www.facebook.com/forbes", "author": "Russ Espinoza"}, "og": {"title": "E! Cancels Scripted Series 'The Arrangement' After Two Seasons", "site_name": "Forbes", "type": "article", "url": "https://web.archive.org/web/20220823002204/https://www.forbes.com/sites/russespinoza/2018/05/30/e-cancels-scripted-series-the-arrangement-after-two-seasons/", "image": "https://web.archive.org/web/20220823002204im_/https://imageio.forbes.com/specials-images/dam/imageserve/953969188/0x0.jpg?format=jpg&width=1200", "description": "Axing of the fictional Hollywood drama leaves only one scripted series left at E!", "updated_time": "2018-05-30T04:47:15.831-04:00"}, "fb": {"app_id": 123694841080850}, "apple-itunes-app": "app-id=588647136", "twitter": {"card": "summary_large_image", "site": "@forbes", "title": "E! Cancels Scripted Series 'The Arrangement' After Two Seasons", "description": "Axing of the fictional Hollywood drama leaves only one scripted series left at E!", "image": "https://web.archive.org/web/20220823002204im_/https://imageio.forbes.com/specials-images/dam/imageserve/953969188/0x0.jpg?format=jpg&width=1200"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1527634800.0, "source": "https://web.archive.org", "summary": ""}