{"url": "https://www.hollywoodreporter.com/fien-print/girls-series-finale-critics-take-994527", "text": "[This article contains spoilers from the April 16 series finale of HBO’s Girls.]\n\nSo here’s how I’m looking at the series finale of Girls and you may choose to disagree or view things however you like:\n\nLast week’s episode, fittingly titled “Goodbye Tour,” was the true series finale of Girls. Written by Jenni Konner and Lena Dunham and directed beautifully by Nisha Ganatra , it brought the friendship between Hannah (Dunham), Marnie (Allison Williams), Shosh ( Zosia Mamet ) and Jessa ( Jemima Kirke ) to a lovely resting spot at Shosh’s engagement party. Hannah looking at her friends dancing each in their own distinctive ways — Jessa like nobody was watching, Marnie like everybody was watching and Shosh fixated on a groom-to-be introduced to audiences and Hannah just seconds earlier — before departing New York City for a job that every think piece posted on the Internet in the past seven days has already told you doesn’t exist in our current academic climate and wouldn’t have gone to Hannah anyway, was a perfect end for the series.\n\nThe previous couple of episodes had also given many of the show’s characters their own effective places of repose. With Shosh as accidental matchmaker, Ray (Alex Karpovsky ) found love, somebody whose idiosyncrasies matched his own. Elijah (Andrew Rannells ) somehow got the lead in the musical of White Men Can’t Jump and maybe he and Dill Harcourt are together. And I guess Adam ends up with Jessa , at least for a while, and even if you think that mercurial relationship isn’t good for the long haul, Adam Driver’s scenes with Dunham/Hannah in the antepenultimate episode were as well-acted as any in the show’s entire run. (I’m glad this season has helped a lot of detractors recognize how good an actress Lena Dunham has become over the six seasons of Girls. This isn’t a Jerry Seinfeld situation. I don’t care if you like or hate Hannah, but Dunham slayed all 10 episodes.)\n\nIf you wanted to sum up the series with Hannah’s half-apology to Jessa , “Think about it. We were all just doing our best,” and Jessa’s reply, “Our best was awful,” that’s a pretty amusing way to do it. Or you can sum the show up in Elijah’s braying laughter between sentences of the declaration, “Hannah, you’ve made so many wonderful friendships here. That’s not a thing!”\n\nAll season long, Girls has been sending itself off in the peak of style, delivering one top-notch episode after another. I’m not ready yet to step back and say this was the show’s best season or that any individual episode was the show’s best episode, but in the balance, from Hannah and Paul-Louis in the Hamptons to the Desi nightmare in Poughkeepsie to the Elijah-centric musical audition episode to Hannah’s and Adam’s brief dream reconciliation to the brief and triumphant return of Patrick Wilson’s doctor character, the highlights have been myriad. And that’s without getting to “American Bitch,” the two-hander with Matthew Rhys that probably would get the most Best Episode Yet votes.\n\nLet’s take the nine episodes as a build-up to last week’s finale and then we don’t need to stress about what our expectations were or weren’t for the last installment.\n\nBecause let’s be honest: There wasn’t anything that Girls owed me (or you) in Sunday’s finale. Most of the characters got the send-offs they deserved. There were absolutely no mysteries to be solved or outstanding questions that needed answering or anything that so many Peak TV finales have needed to accomplish when they neared the end. There was no question as to whether Hannah was going to die, whether the CIA was ever going to catch Shosh or whether Adam was going to get that out-of-the-blue phone call from Ron Howard launching his acting career into the stratosphere. Anything you really wanted or deserved from a finale came last week when the four main characters crammed themselves into a bathroom and argued about why they haven’t been good friends to each other for a while.\n\nSunday’s episode, “Latching,” was an epilogue . It was a postscript. It was a “Here’s what life looks like for a little bit until we get around to checking back in on these characters.”\n\nIf you wanted fireworks or epic dramatic outbursts, I’m sure you were disappointed. If you wanted an exceptional and intimate three-hander with Hannah, Marnie and Hannah’s mom Loreen (Becky Ann Baker), plus occasional outbursts by an adorable baby named Grover? Well, if you wanted specifically that exact thing, I’m sure you loved it. This is close enough to what I wanted, personally.\n\nIf last week’s episode did most of the things a good series finale does, “Latching” did probably the one thing last week’s episode didn’t do, specifically tying us back into the pilot.\n\nThe series began, remember, with Hannah’s parents setting Hannah adrift, telling her that she wouldn’t get any more financial support and that she was on her own trying to make it in the big city. It was nothing if not a forcible unlatching from the paternal teat. Sunday’s finale, which Konner directed from a script she co-wrote with Dunham and Judd Apatow …. Well, you don’t need me to explain. Hannah’s neurotic fears that Grover wouldn’t suckle related to Hannah’s ongoing fears about her difficulties being maternal and then, after a marvelous Loreen lecture, Hannah wandering the streets, coming upon a high school girl fleeing from her mother’s protective care and going into maternal overdrive herself. Having ranted at the girl — “She’ll take care of you forever, even if it means endless, endless pain” — Hannah returned home and Grover finally latched as the show eschewed a closing credits song for the sounds of an encouraging mom, a nursing baby and the mumbling singing of a woman with “Fast Car” stuck in her head.\n\n“Fast Car” was stuck in Hannah’s head because of Marnie’s dogged insistence on singing it in the car and the finale was an unexpectedly big showcase for Marnie . This is good if you’re a fan of Marnie and bad if you’re a Marnie hater and if you’re still a Marnie hater…. Good grief! What’s wrong with you? Last year’s “The Panic in Central Park” was designed to eliminate the last people not marveling at what a singular portrait of altruistically self-absorbed exceptionalism Williams and the writers have crafted.\n\nIt’s hilarious that while thematically “Unlatched” was one big callback to the pilot, the specific callbacks almost all related to Marnie , introduced in the series just as she was in this episode: spooning in bed with Hannah. As in the pilot, when Marnie’s idea of role-playing was to suggest to Charlie that he try being somebody entirely different from himself, we got to see more of Marnie’s horridness at forced raunch as her isolation in rural New York left her having FaceTime sex with a personal trainer from Weehawken , which included flight attendant/captain dirty talk at its worst (“Do you think I should use the oxygen mask on his dick?”).\n\nMarnie’s abrupt announcement that she wanted to move in with Hannah and help her raise the baby was pretty much vintage Marnie , since we already knew that Marnie lost her apartment and was facing life with her mother. It was pure kindness and pure personal desperation. And her strategy for getting Hannah to give in was also vintage Marnie , starting with, “You think you have a lot of friends, right?” followed by proof that Hannah’s other friends were all absent, at best.\n\n“I’m here. I win. I’m your best friend,” Marie squealed with glee and all Marnie has ever wanted since the pilot is to have Hannah’s undivided best friend attention when she wants/needs it.\n\nMarnie living with Hannah, if only for a few months, was exactly right and then it was also exactly right for her to start wondering about herself again at the end and also to decide that law school might be a good idea because, “I f— ing love rules.”\n\nYup. That’s our Marnie .\n\nThis was a ideal finale for Girls because taken in the right frame of mind, it offered the heart and humor that marked the show at its best and gave all three actresses many moments to shine. But if you take it in the wrong frame of mind, if you demand that after last week’s closure you get even more closure, it was probably an easy finale to hate and what could be more Girls than that?\n\nSo now let Dunham and Konner and Apatow take a few years to do other things. The Girls Think Piece Industrial Complex will either dry up or move on to The Handmaid’s Tale or Kevin Can Wait or something.\n\nThen it will be time to move this production to the big screen.\n\nGirls on Film, anyone?", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/girls_cropped.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/girls_cropped.jpg?w=2000&h=1126&crop=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/girls_cropped.jpg?w=1024", "keywords": [], "authors": ["Daniel Fienberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/girls-series-finale-critics-take-994527/", "title": "Critic’s Notebook: ‘Girls’ Series Finale Offers a Lovely Epilogue", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The penultimate episode wrapped things up for the main quartet, but Hannah and Marnie shined upstate in the finale.", "news_keywords": "Critic's Notebook, Girls (TV), hbo", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Daniel Fienberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 994527, "title": "Critic's Notebook: 'Girls' Series Finale Offers a Lovely Epilogue", "published_at": "2017-04-17 06:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/girls_cropped.jpg?w=1024", "comment_count": 0, "tags": "hbo", "topics": "TV News", "body": "[This article contains spoilers from the April 16 series finale of HBO's Girls.]\r\n\r\n\t \r\n\r\n\tSo here's how I'm looking at the series finale of Girls and you may choose to disagree or view things however you like: \r\n\r\n\t \r\n\r\n\tLast week's episode, fittingly titled \"Goodbye Tour,\" was the true series finale of Girls. Written by Jenni Konner and Lena Dunham and directed beautifully by Nisha Ganatra, it brought the friendship between Hannah (Dunham), Marnie (Allison Williams), Shosh (Zosia Mamet) and Jessa (Jemima Kirke) to a lovely resting spot at Shosh's engagement party. Hannah looking at her friends dancing each in their own distinctive ways — Jessa like nobody was watching, Marnie like everybody was watching and Shosh fixated on a groom-to-be introduced to audiences and Hannah just seconds earlier — before departing New York City for a job that every think piece posted on the Internet in the past seven days has already told you doesn't exist in our current academic climate and wouldn't have gone to Hannah anyway, was a perfect end for the series. \r\n\r\n\t \r\n\r\n\tThe previous couple of episodes had also given many of the show's characters their own effective places of repose. With Shosh as accidental matchmaker, Ray (Alex Karpovsky) found love, somebody whose idiosyncrasies matched his own. Elijah (Andrew Rannells) somehow got the lead in the musical of White Men Can't Jump and maybe he and Dill Harcourt are together. And I guess Adam ends up with Jessa, at least for a while, and even if you think that mercurial relationship isn't good for the long haul, Adam Driver's scenes with Dunham/Hannah in the antepenultimate episode were as well-acted as any in the show's entire run. (I'm glad this season has helped a lot of detractors recognize how good an actress Lena Dunham has become over the six seasons of Girls. This isn't a Jerry Seinfeld situation. I don't care if you like or hate Hannah, but Dunham slayed all 10 episodes.)\r\n\r\n\t \r\n\r\n\t\r\n\r\n\t \r\n\r\n\tIf you wanted to sum up the series with Hannah's half-apology to Jessa, \"Think about it. We were all just doing our best,\" and Jessa's reply, \"Our best was awful,\" that's a pretty amusing way to do it. Or you can sum the show up in Elijah's braying laughter between sentences of the declaration, \"Hannah, you've made so many wonderful friendships here. That's not a thing!\"\r\n\r\n\t \r\n\r\n\tAll season long, Girls has been sending itself off in the peak of style, delivering one top-notch episode after another. I'm not ready yet to step back and say this was the show's best season or that any individual episode was the show's best episode, but in the balance, from Hannah and Paul-Louis in the Hamptons to the Desi nightmare in Poughkeepsie to the Elijah-centric musical audition episode to Hannah's and Adam's brief dream reconciliation to the brief and triumphant return of Patrick Wilson's doctor character, the highlights have been myriad. And that's without getting to \"American Bitch,\" the two-hander with Matthew Rhys that probably would get the most Best Episode Yet votes.\r\n\r\n\t \r\n\r\n\tLet's take the nine episodes as a build-up to last week's finale and then we don't need to stress about what our expectations were or weren't for the last installment.\r\n\r\n\t \r\n\r\n\tBecause let's be honest: There wasn't anything that Girls owed me (or you) in Sunday's finale. Most of the characters got the send-offs they deserved. There were absolutely no mysteries to be solved or outstanding questions that needed answering or anything that so many Peak TV finales have needed to accomplish when they neared the end. There was no question as to whether Hannah was going to die, whether the CIA was ever going to catch Shosh or whether Adam was going to get that out-of-the-blue phone call from Ron Howard launching his acting career into the stratosphere. Anything you really wanted or deserved from a finale came last week when the four main characters crammed themselves into a bathroom and argued about why they haven't been good friends to each other for a while. \r\n\r\n\t \r\n\r\n\tSunday's episode, \"Latching,\" was an epilogue. It was a postscript. It was a \"Here's what life looks like for a little bit until we get around to checking back in on these characters.\"\r\n\r\n\t \r\n\r\n\tIf you wanted fireworks or epic dramatic outbursts, I'm sure you were disappointed. If you wanted an exceptional and intimate three-hander with Hannah, Marnie and Hannah's mom Loreen (Becky Ann Baker), plus occasional outbursts by an adorable baby named Grover? Well, if you wanted specifically that exact thing, I'm sure you loved it. This is close enough to what I wanted, personally.\r\n\r\n\t \r\n\r\n\tIf last week's episode did most of the things a good series finale does, \"Latching\" did probably the one thing last week's episode didn't do, specifically tying us back into the pilot. \r\n\r\n\t \r\n\r\n\t\r\n\r\n\t \r\n\r\n\tThe series began, remember, with Hannah's parents setting Hannah adrift, telling her that she wouldn't get any more financial support and that she was on her own trying to make it in the big city. It was nothing if not a forcible unlatching from the paternal teat. Sunday's finale, which Konner directed from a script she co-wrote with Dunham and Judd Apatow.... Well, you don't need me to explain. Hannah's neurotic fears that Grover wouldn't suckle related to Hannah's ongoing fears about her difficulties being maternal and then, after a marvelous Loreen lecture, Hannah wandering the streets, coming upon a high school girl fleeing from her mother's protective care and going into maternal overdrive herself. Having ranted at the girl — \"She'll take care of you forever, even if it means endless, endless pain\" — Hannah returned home and Grover finally latched as the show eschewed a closing credits song for the sounds of an encouraging mom, a nursing baby and the mumbling singing of a woman with \"Fast Car\" stuck in her head.\r\n\r\n\t \r\n\r\n\t\"Fast Car\" was stuck in Hannah's head because of Marnie's dogged insistence on singing it in the car and the finale was an unexpectedly big showcase for Marnie. This is good if you're a fan of Marnie and bad if you're a Marnie hater and if you're still a Marnie hater.... Good grief! What's wrong with you? Last year's \"The Panic in Central Park\" was designed to eliminate the last people not marveling at what a singular portrait of altruistically self-absorbed exceptionalism Williams and the writers have crafted. \r\n\r\n\t \r\n\r\n\tIt's hilarious that while thematically \"Unlatched\" was one big callback to the pilot, the specific callbacks almost all related to Marnie, introduced in the series just as she was in this episode: spooning in bed with Hannah. As in the pilot, when Marnie's idea of role-playing was to suggest to Charlie that he try being somebody entirely different from himself, we got to see more of Marnie's horridness at forced raunch as her isolation in rural New York left her having FaceTime sex with a personal trainer from Weehawken, which included flight attendant/captain dirty talk at its worst (\"Do you think I should use the oxygen mask on his dick?\"). \r\n\r\n\t \r\n\r\n\tMarnie's abrupt announcement that she wanted to move in with Hannah and help her raise the baby was pretty much vintage Marnie, since we already knew that Marnie lost her apartment and was facing life with her mother. It was pure kindness and pure personal desperation. And her strategy for getting Hannah to give in was also vintage Marnie, starting with, \"You think you have a lot of friends, right?\" followed by proof that Hannah's other friends were all absent, at best.\r\n\r\n\t \r\n\r\n\t\"I'm here. I win. I'm your best friend,\" Marie squealed with glee and all Marnie has ever wanted since the pilot is to have Hannah's undivided best friend attention when she wants/needs it. \r\n\r\n\t \r\n\r\n\t\r\n\r\n\t \r\n\r\n\tMarnie living with Hannah, if only for a few months, was exactly right and then it was also exactly right for her to start wondering about herself again at the end and also to decide that law school might be a good idea because, \"I f—ing love rules.\"\r\n\r\n\t \r\n\r\n\tYup. That's our Marnie.\r\n\r\n\t \r\n\r\n\tThis was a ideal finale for Girls because taken in the right frame of mind, it offered the heart and humor that marked the show at its best and gave all three actresses many moments to shine. But if you take it in the wrong frame of mind, if you demand that after last week's closure you get even more closure, it was probably an easy finale to hate and what could be more Girls than that?\r\n\r\n\t \r\n\r\n\tSo now let Dunham and Konner and Apatow take a few years to do other things. The Girls Think Piece Industrial Complex will either dry up or move on to The Handmaid's Tale or Kevin Can Wait or something.\r\n\r\n\t \r\n\r\n\tThen it will be time to move this production to the big screen.\r\n\r\n\t \r\n\r\n\tGirls on Film, anyone?", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Critic’s Notebook: ‘Girls’ Series Finale Offers a Lovely Epilogue", "url": "https://www.hollywoodreporter.com/tv/tv-news/girls-series-finale-critics-take-994527/", "description": "The penultimate episode wrapped things up for the main quartet, but Hannah and Marnie shined upstate in the finale.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/girls_cropped.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-04-17T06:00:00+00:00", "modified_time": "2017-08-10T10:49:58+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Critic’s Notebook: ‘Girls’ Series Finale Offers a Lovely Epilogue", "description": "The penultimate episode wrapped things up for the main quartet, but Hannah and Marnie shined upstate in the finale.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/girls_cropped.jpg?w=3000"}}, "movies": [], "publish_date": 1492408800.0, "source": "https://www.hollywoodreporter.com", "summary": ""}