{"url": "https://awards.wga.org/awards/nominees-winners", "text": "ORIGINAL SCREENPLAY\n\nBeing the Ricardos, Written by Aaron Sorkin; Amazon Studios\n\nDon’t Look Up, Screenplay by Adam McKay, Story by Adam McKay & David Sirota; Netflix - WINNER\n\nThe French Dispatch of the Liberty, Kansas Evening Sun, Screenplay by Wes Anderson, Story by Wes Anderson & Roman Coppola & Hugo Guinness & Jason Schwartzman; Searchlight Pictures\n\nKing Richard, Written by Zach Baylin; Warner Bros. Pictures\n\nLicorice Pizza, Written by Paul Thomas Anderson; United Artists\n\nADAPTED SCREENPLAY\n\nCODA, Screenplay by Siân Heder, Based on the Original Motion Picture La Famille Belier Directed by Eric Lartigau, Written by Victoria Bedos, Stanislas Carree de Malberg, Eric Lartigau and Thomas Bidegain; Apple - WINNER\n\nDune, Screenplay by Jon Spaihts and Denis Villeneuve and Eric Roth, Based on the novel Dune Written by Frank Herbert; Warner Bros. Pictures\n\nNightmare Alley, Screenplay by Guillermo del Toro & Kim Morgan, Based on the Novel by William Lindsay Gresham; Searchlight Pictures\n\ntick…tick…BOOM!, Screenplay by Steven Levenson, Based on the play by Jonathan Larson; Netflix\n\nWest Side Story, Screenplay by Tony Kushner, Based on the Stage Play, Book by Arthur Laurents, Music by Leonard Bernstein, Lyrics by Stephen Sondheim, Play Conceived, Directed and Choreographed by Jerome Robbins; 20th Century Studios\n\nDOCUMENTARY SCREENPLAY\n\nBecoming Cousteau, Written by Mark Monroe & Pax Wassermann; National Geographic\n\nExposing Muybridge, Written by Marc Shaffer; Inside Out Media - WINNER\n\nLike a Rolling Stone: The Life & Times of Ben Fong-Torres, Written by Suzanne Joe Kai; StudioLA.TV", "images": ["https://awards.wga.org/newwgaawards/images/wga-logo-17-2945-whitetype-borderbox.png", "https://awards.wga.org/NewWGAAwards/images/2022/Awards2022-800x450.jpg", "https://awards.wga.org/NewWGAAwards/images/Awards23logo.png"], "top_img": "https://awards.wga.org/NewWGAAwards/images/2022/Awards2022-800x450.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "2022 Writers Guild Awards Winners & Nominees", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "The Writers Guild Awards honor outstanding writing in film, television, new media, news, radio, and promotional categories.", "og": {"title": "2022 Writers Guild Awards Winners & Nominees", "description": "The Writers Guild Awards honor outstanding writing in film, television, new media, news, radio, and promotional categories.", "image": "/NewWGAAwards/images/2022/Awards2022-800x450.jpg"}}, "movies": [], "publish_date": null, "source": "https://awards.wga.org", "summary": ""}