{"url": "https://blog.iheart.com/Pages/2017-iheartradio-music-festival-lineup.aspx", "text": "Our time spent at the edge of our seats is over — we’ve just announced the lineup for the 2017 iHeartRadio Music Festival! The Festival will take place on September 22 and 23 at Las Vegas’ hottest new entertainment venue, T-Mobile Arena. This year, the epic two-day lineup will feature performances by Coldplay, The Weeknd, DJ Khaled, Chris Stapleton, Lorde, Kings of Leon, Big Sean, P!NK, Miley Cyrus, Thirty Seconds to Mars, Niall Horan, David Guetta, Thomas Rhett, Harry Styles, Special Guest Kesha, and more. We’ll also get the chance to see performances from this year's Macy's iHeartRadio Rising Star winner, James Maslow!\n\nAs if this lineup doesn’t spoil us enough already, attendees will also get to see performances by Migos, Halsey, Flume, Little Mix, French Montana, Niall Horan, Bleachers, Kelsea Ballerini, Judah &The Lion, Bebe Rexha, Noah Cyrus, Hey Violet, Cheat Codes, All Time Low, Khalid, and Julia Michaels, all at the Daytime Village Presented by Capital One® on September 23. Between the iHeartRadio Music Festival and the Daytime Village, concert-goers will have a unique opportunity to hear from one of the most diverse lineups they’ll ever see.\n\nTo add to the hype, iHeartMedia station listeners across the country can win a once-in-a-lifetime trip to Las Vegas to experience the festival, with one Grand Prize Winner chosen to receive a fantasy all-access experience!\n\nCan’t wait to get your tickets? Beginning July 25 at 1 p.m. EST/10a.m. PST, Capital One® cardholders will have access to a limited number of tickets through a special presale for the iHeartRadio Music Festival. Tickets will be available onlyat iHeartRadio.com/CapitalOne. They go on sale to the general public on July 28 at 1 p.m. EST/10 a.m. PST via iHeartRadio.com/tickets. And don’t forget that tickets for the Daytime Village are also on sale and can be purchased via iHeartRadio.com/village!\n\nIt’s going to be an absolutely legendary event, so make sure to check out even more exciting details about the iHeartRadio Music Festival here. Afterthat, be sure to tune in your favorite iHeartRadio Music Festival artists today, always on iHeartRadio!​", "images": ["https://blog.iheart.com/profiles/iheartblog/themes/iheartmediablog/images/img/In-Black-14px.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6036262&cv=2.0&cj=1", "https://blog.iheart.com/profiles/iheartblog/themes/iheartmediablog/logo.svg", "https://blog.iheart.com/profiles/iheartblog/themes/iheartmediablog/images/img/rss.png", "https://iheart-blog.s3.amazonaws.com/banner/originals/iHMF_banner.jpg", "https://blog.iheart.com/profiles/iheartblog/themes/iheartmediablog/images/img/adchoices.png", "https://blog.iheart.com/profiles/iheartblog/themes/iheartmediablog/favicon.ico"], "top_img": "https://blog.iheart.com/profiles/iheartblog/themes/iheartmediablog/favicon.ico", "keywords": [], "authors": [], "canonical_link": "https://blog.iheart.com/post/2017-iheartradio-music-festivals-legendary-lineup-released", "title": "2017 iHeartRadio Music Festival’s Legendary Lineup Released!", "meta_data": {"robots": "index, follow", "description": "Our time spent at the edge of our seats is over — we’ve just announced the lineup for the 2017 iHeartRadio Music Festival! The Festival will take place on September 22 and 23 at Las Vegas’ hottest new entertainment venue, T-Mobile Arena.", "og": {"site_name": "iHeart Blog", "type": "Article", "url": "https://blog.iheart.com/post/2017-iheartradio-music-festivals-legendary-lineup-released", "title": "2017 iHeartRadio Music Festival’s Legendary Lineup Released!", "description": "Our time spent at the edge of our seats is over — we’ve just announced the lineup for the 2017 iHeartRadio Music Festival! The Festival will take place on September 22 and 23 at Las Vegas’ hottest new entertainment venue, T-Mobile Arena.", "image": {"type": "image/jpeg"}}, "Generator": "Drupal 9 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://blog.iheart.com", "summary": ""}