{"url": "https://www.nbcnews.com/news/us-news/elizabeth-smart-kidnapper-wanda-barzee-due-be-released-prison-wednesday-n910966", "text": "A woman convicted for her role in the abduction of Elizabeth Smart, who was held captive for nine months when she was 14 years old, was released from prison on Wednesday.\n\nThe Utah Department of Corrections said just after 8 a.m. local time that Wanda Barzee, 72, had been freed from Utah State Prison. A gaggle of reporters and news cameras arrived early Wednesday to stake out prison exits in anticipation of her leaving, but Barzee was not immediately spotted.\n\nMinutes after Barzee's release, Smart thanked supporters in an Instagram post, and said she was determined to continue living her life despite her captor being free.\n\n\"May we all remain vigilant in watching over our families, friends, and community from anyone who would seek to hurt or take advantage. I truly believe life is meant to be happy and beautiful, and no matter what happens that will remain my goal for me and for my family,\" she wrote.\n\nIn a press conference later Wednesday morning, Barzee's attorney, Scott Williams, said Barzee didn't pose any threat by being out of prison.\n\n\"There is no credible evidence that she is a danger to the community,\" Williams said.\n\nWilliams did not answer questions about where Barzee will live or whether she has a support system. He expressed confidence that she could live in society without any problems, but said her biggest challenge, \"obviously, is the high-profile nature\" of the case.\n\nSmart was abducted at knifepoint in 2002 from the Salt Lake City bedroom she shared with her younger sister in a case that drew international headlines. After intense media attention surrounding Smart's disappearance, Smart was seen walking the streets of a Salt Lake City suburb with Brian David Mitchell, a street pastor, and Barzee, his wife.\n\nThe couple was arrested and charged in her kidnapping, which Smart has said included repeated sexual assaults by Mitchell. During the attacks, Barzee would sit next to Smart and \"encourage her husband to continue to rape me,\" Smart recalled during a press conference last week.\n\nMitchell, who prior to the abduction had done odd jobs around the Smart family household, is serving a life sentence after being convicted of kidnapping and raping Smart. Barzee was convicted of state and federal crimes, and in 2010 was sentenced to 15 years in federal prison for her role in the abduction.\n\nElizabeth Smart arrives for a news conference Thursday, Sept. 13, 2018, in Salt Lake City. Smart says it appears there is no viable, legal recourse she can take to stop the release of one of her kidnappers. Rick Bowmer / AP\n\nShe received credit for time already served and in 2016, Barzee was released from federal prison but still faced one to 15 years in state prison for a separate attempted abduction of Smart's cousin. In June, her attorney asked that Barzee get credit toward her state sentence for the time she spent in federal credit, but the Utah Board of Pardons and Parole denied that request — and set Barzee's sentence to go until 2024.\n\nThat changed last Tuesday when the parole board announced that Barzee would be released on Sept. 19 — an unexpected move that even caught Smart, who described it as a \"big shock,\" by surprise.\n\n\"I do believe she’s a threat,\" Smart said of Barzee during last week's press conference. \"For me, I know the depth of her depravity.\"\n\nThe parole board said that after a legal review of Barzee's time served, it discovered that part of the time she spent in federal prison should in fact count toward her state sentence, making her eligible for release.\n\nBarzee will be under federal supervision for five years. Smart's attorney, Brett Tolman, told the Associated Press that conditions of Barzee's release include mental health treatment and an order not to contact Smart's family.\n\nUpon her release, Barzee also voluntarily agreed to not go to any geographic locations that the Smart family might frequent, Williams, her attorney, said. Violating any of those conditions could result in her return to prison, although Williams was not able to say for how long, adding that it would depend on which condition had been violated.\n\nSmart, now 30, has said the couple kept her chained down in makeshift campsites during her abduction — including, at first, one in the foothills just miles from her house. She told reporters last week that she believes in forgiveness as a Christian, but does not believe Barzee has been rehabilitated to the point where she should be freed.\n\nSmart has since become an outspoken advocate against child abduction and sexual violence. Now married and pregnant with her third child, Smart said in an Instagram post last week that she is taking precautions to protect her family but refuses \"to live in fear.\"\n\n\"I lived in absolute fear and terror for nine months, no matter the outcome I will not do so again,\" she wrote.", "images": ["https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_38/2571716/180919-smart-barzee-mc-1302.JPG", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-760x428,f_auto,q_auto:best/MSNBC/Components/Video/201809/nn_jfr_wanda_barzee_prison_release_180919_1537399000822.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2018_38/2571721/180919-smart-barzee-mc-13022.JPG"], "top_img": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_38/2571716/180919-smart-barzee-mc-1302.JPG", "keywords": [], "authors": ["Elizabeth Chuck"], "canonical_link": "https://www.nbcnews.com/news/us-news/elizabeth-smart-kidnapper-wanda-barzee-due-be-released-prison-wednesday-n910966", "title": "Elizabeth Smart kidnapper Wanda Barzee released from prison", "meta_data": {"msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/nbcnews/all-other-sizes-PNG.ico/browserconfig.xml", "robots": "max-image-preview:large", "fb": {"app_id": 10150138890205613, "pages": 1508175089456029}, "og": {"site_name": "NBC News", "locale": "en_US", "url": "https://www.nbcnews.com/news/us-news/elizabeth-smart-kidnapper-wanda-barzee-due-be-released-prison-wednesday-n910966", "title": "Elizabeth Smart kidnapper Wanda Barzee released from prison", "description": "Smart, who was held captive for nine months when she was 14 by Barzee and her husband, has said she believes Barzee is a \"threat\" who shouldn't be freed.", "image": {"identifier": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_38/2571716/180919-smart-barzee-mc-1302.JPG", "secure_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_38/2571716/180919-smart-barzee-mc-1302.JPG", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@NBCNews", "creator": "NBCNews", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1024-512,f_auto,q_auto:best/newscms/2018_38/2571716/180919-smart-barzee-mc-1302.JPG", "title": "Elizabeth Smart kidnapper Wanda Barzee released from prison", "description": "Smart, who was held captive for nine months when she was 14 by Barzee and her husband, has said she believes Barzee is a \"threat\" who shouldn't be freed.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1, user-scalable=yes", "description": "A woman serving time for her role in the abduction of Elizabeth Smart, the Utah woman who was held captive when she was 14 years old, was released from prison on Wednesday.", "branch": {"deeplink": {"title": "Elizabeth Smart kidnapper Wanda Barzee released from prison", "description": "Smart, who was held captive for nine months when she was 14 by Barzee and her husband, has said she believes Barzee is a \"threat\" who shouldn't be freed.", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_38/2571716/180919-smart-barzee-mc-1302.JPG", "type": "article", "unibrow": "U.S. news", "authorName1": "Elizabeth Chuck"}}, "article": {"opinion": "false", "content_tier": "free", "published": "Wed Sep 19 2018 18:10:00 GMT+0000 (UTC)", "modified": "Thu Sep 20 2018 01:14:24 GMT+0000 (UTC)"}, "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x768_scale,f_auto,q_auto:best/newscms/2018_38/2571716/180919-smart-barzee-mc-1302.JPG", "next-head-count": 97}, "movies": [], "publish_date": 1537380600.0, "source": "https://www.nbcnews.com", "summary": ""}