{"url": "http://www.cnn.com/TRANSCRIPTS/0008/03/se.06.html", "text": "\n\nSpecial Event Republican National Convention Prepares for George W. Bush's Acceptance Speech Aired August 3, 2000 - 6:30 p.m. ET THIS IS A RUSH TRANSCRIPT. THIS COPY MAY NOT BE IN ITS FINAL FORM AND MAY BE UPDATED. BERNARD SHAW, CNN ANCHOR: After three days of speeches, this Republican Convention and delegates prepare for the big one. JUDY WOODRUFF, CNN ANCHOR: Delegates are on their way to the convention hall anxious to hear what George W. Bush will say to them and to the rest of the country. ANNOUNCER: Tonight from Philadelphia, the 37th Republican National Convention; 2000 delegates, 10,000 volunteers, and 15,000 media members have converged on the cradle of American democracy for the nomination of the GOP candidates for president and vice president of the United States. In this grand old city, the Grand Old Party of Lincoln, Eisenhower and Reagan starts its quest for the White House, led by a man with Texas roots and a president's name. Now, from Philadelphia's First Union Center, here are CNN's Bernard Shaw, Judy Woodruff, and Jeff Greenfield. SHAW: And welcome to this grand finale night. Judy, Jeff, my mother used to say, it's not what you say, it's how you say it. WOODRUFF: That's right. We already actually have a few tips about what Governor George W. Bush is going to say tonight. His campaign put out a release already, which we can tell you, they say he's going to say, among other things: \"Times of plenty, like times of crisis, are tests of American character.\" And Jeff, he will speak with regret about what has happened in the last eight years and say opportunities missed, time and again. JEFF GREENFIELD, CNN SENIOR ANALYST: Opportunities squandered, as Dick Cheney, said last night. You know, it is probably true that tonight -- and in two weeks at the Democratic Convention -- more Americans will spend more time listening to a sustained rhetorical argument than at any other time in the year. This is the one time an impatient political process slows down and lets a candidate for president talk to us. It is a very significant moment. WOODRUFF: And those people who perhaps have not been paying close attention to this campaign up until now will begin tonight to pay serious attention. GREENFIELD: This is when they tune in and say, I wonder if this guy is the guy I'll trust. It's a big one. WOODRUFF: As this convention has been going on, of course, we at CNN of course have been keeping a close watch on the story at a hospital here in Philadelphia -- former President Gerald Ford recovering from a stroke, minor stroke. Today, he had some visitors. Governor George W. Bush dropped by, met with some of the hospital staff. We also know that Bob Dole, who was the nominee at the Republican Convention four years, also came by to see the former president to pay his respects. And Jim Nicholson, who is the chairman of the Republican National Committee was there as well. GREENFIELD: But as we said, tonight is the tonight when George Bush gives his acceptance speech. We want to go down to the floor to get a sense of what the delegates might be thinking about, and certainly what our floor reporters are thinking about. And on the condition that you do not tell us that he has to be presidential, Jeanne Meserve, what's going on at this convention, and what's going to happen? JEANNE MESERVE, CNN CORRESPONDENT: Jeff, of course George W. Bush will be defining his message tonight. But we've been hearing parts of it all week from the stage, but also from the floor. And it turns out there's a good reason why. We've been told that in several states, the party has sent out talking points to the delegates before this convention began, telling them to stress party unity and inclusion, telling them to underline certain issues, especially that the election of George W. Bush would restore morality to the oval office. Some of the delegates don't like it. One of them said: We are nothing more than props in a huge movie production. We have also been told that, in some delegations, there were heavy-handed attempts to persuade the McCain delegates to vote for Bush. Some resisted and only changed their minds after a personal appeal from Cindy McCain. Again, some delegates don't like it. One of them resents the orchestration, the effort to quash dissent. He said, at this convention, there is absolutely no meaningful role for a delegate to play. Now onto Candy Crowley. CANDY CROWLEY, CNN CORRESPONDENT: To say that this is an important night for George Bush understates the case. This is one really of three pivotal moments that in the past have either made or broken a presidential candidate: The selection of a vice president, the convention speech, and the fall debates are considered the three key moments for any campaign. So George Bush has been practicing this speech, has been rewriting this speech for weeks, even more than a month now. What Bush must do is play both to the people in this room; that is, mostly the more conservative members of this party, as well as reach out to those who will, in fact, decide the election, the swing voters. We are told this will be a subtler speech than Secretary Cheney's speech was last night; that, in fact, Bush will outline his agenda. He may take a poke or two at Al Gore about the Internet. But beyond that, what you are going to hear tonight is a direct appeal to the swing voters. George Bush is the key face in the new face of the Republican Party, and that is the face that we will see tonight. And now onto my colleague, Frank Sesno. FRANK SESNO, CNN CORRESPONDENT: Now, to talk about what George W. Bush will say tonight, in talking to speech-writers, there is a very distinct artform, really, as to how you say it; because a convention speech is unlike any other speech. You are playing very intentionally to this room, where the delegates want to be riled up, want to be juiced, and where they will applaud. And you have to work those applause lines, we're told -- at the same time thinking very deliberately about how it plays across the television -- so calibrating those two things, balancing those two things. Speechwriters tell us candidates have to speak in short sentences, but most importantly, you know, as Bernie -- as you said a little while ago, Bernie -- it's not what you say so much, but how you say it. There are even studies that demonstrate that speechwriters are aware of. So, it's most important they say for George Bush to just be himself, deliver his lines and his humor with a smile, not a smirk. John King, to you. JOHN KING, CNN CORRESPONDENT: Thank you, Frank. Watching perhaps most closely tonight will not be the delegates here in the hall, but the Democrats, looking to find something in George W. Bush's speech that they can turn into a campaign ad. Already tonight, the Gore campaign putting out a five-page pre-buttal, as it calls it, saying -- trying to convince the American people, they will hear tonight about Governor Bush's tax cut. This document says that would be 62 cents a day for most American working families -- the Gore campaign saying you will hear Governor Bush and other Republicans tonight promote a prescription drug plan for elderly Americans -- the Gore campaign saying that, as now outlined, the Bush and Republican plan would leave millions of Americans without affordable coverage -- so the Democrats watching very closely tonight. They know that this convention has been aimed at rebutting the Democratic allegations used so successfully against the Republicans in 1992 and 1996. Vice President Gore's convention starts 10 days from now. In those very critical 10 days, he knows Governor Bush will leave Philadelphia with a big lead. The Democrats will be watching closely tonight for ammunition in trying to cut into that lead. Now, finally up to my colleague, Wolf Blitzer on the podium. WOLF BLITZER, CNN CORRESPONDENT: Thanks, John. There's no doubt that, as much energy as the Bush-Cheney campaign has given to this speech tonight, they are very much looking down the road, looking down the road to the immediate next few days. From here, they want to keep this momentum, the momentum of the convention going. And they are going to be taking it to the key battleground states that presumably will make the difference in November. From Philadelphia, they're going to fly to Pittsburgh -- Pennsylvania being a critical state, of course. But from there, they begin a train trip that will begin in Pennsylvania, take them to Ohio, another key state -- Michigan, winding up Sunday in Illinois. These states are critical. They want to make sure, also, that they stay on top of the news. They know that the Gore campaign is going to be getting a lot of attention in the coming days when the vice president picks his vice presidential running mate. They're hoping that they get a nice convention bounce and then take this show on the road, hoping they won't lose it in the days and weeks ahead. Back up to the booth. WOODRUFF: All right, Wolf. And before they take this show on the road, there is much to look forward to tonight, not just Governor's Bush's speech, but much more. Let's take a close look right now. Here's a look ahead at this evening, the fourth and final night of the convention, Thursday, August 3rd. Tonight, George W. Bush steps out of the party's shadows and onto its center stage. He is the singular focus of this night's theme: President with a purpose, a strong leader who can unite our country and get things done. Among the speakers in the 7:00 hour, Philadelphia time, two activists who will portray Bush as a take-charge leader who helped further their causes. One is a breast-cancer activist, the other a literacy expert. Later in the hour, California lawmaker Abel Maldonado delivers a convention speech entirely in Spanish. Then in the 9:00 hour... (BEGIN VIDEO CLIP) GEORGE P. BUSH, NEWPHEW OF GEORGE W. BUSH: It's a new day. (END VIDEO CLIP) WOODRUFF: ... the message of inclusion will echo in a bilingual address by George P. Bush, the nephew of the Republican nominee and son of the Florida governor and his Mexican-born wife. In the 10:00 hour, George W. Bush will deliver his acceptance speech to formally close the Republican National Convention. GREENFIELD: And if money is the mother's milk of politics, then we are in America's dairy land right now. And when we come back, CNN's Brooks Jackson is going to look at battle not just for votes, but for dollars. (COMMERCIAL BREAK) (BEGIN VIDEOTAPE) NARRATOR: On day four of the 1920 Republican convention in Chicago, 11 men were trying for the presidential nomination in a year with no clear favorite. Senator Warren Harding of Ohio was running sixth in early ballots. Months earlier, his campaign manager, Harry Dougherty, had predicted that 15 or 20 party leaders would end up picking the candidate at 2:11 a.m. and that's more or less what happened at Chicago's Blackstone Hotel that night. Dougherty later wrote of a \"smoke-fogged room,\" though he wasn't there. By morning, Harding was the compromised candidate. He would win the election and make Dougherty an attorney general, in an election that became the synonym for scandal. The smoke-filled room remains the powerful political metaphor. (END VIDEOTAPE) SHAW: As Jeff Greenfield said, money is powerful in politics. When Governor Bush leaving this hall, leaves Philadelphia tomorrow, he will be swinging into the general election campaign. He hopes to raise more money, historically, than ever before, as he did during the primary season. The richest campaign fund-raising ever. Here's Brooks Jackson. (BEGIN VIDEOTAPE) BROOKS JACKSON, CNN CORRESPONDENT (voice-over): It's once more into the breach for Bush fund-raisers Dean and Andrea McWilliams hoping to finance what's likely to be the most lavishly funded presidential campaign in history. These Texas lobbyists raised $100,000 for Bush during his primary campaign, qualifying them as Bush pioneers. Now they're being asked to do it again for the general election as part of team 2000. UNIDENTIFIED FEMALE: Now, we have proactively committed for a second time to join that fund-raising effort through our pioneer contacts. JACKSON: And the man in charge of the effort says there's no such thing as too much. UNIDENTIFIED MALE: We're going to raise absolutely as much money as we can to be prepared, because we know that there will be a very, very negative campaign run by the other side. They have to. JACKSON (on camera): Bush already has loads of money. As the party's nominee, he'll get $67.6 million this week in public funding from the U.S. Treasury. That's all his campaign can legally spend directly, but even more will be spent indirectly through the Republican National Committee, and CNN has learned the RNC soon will report it has nearly $70 million in cash. (voice-over): The RNC banked record amounts of so-called soft money from corporations and oversized donations from wealthy individuals. The biggest donors reported so far are AT&T, the investment firm Harvard Group Limited of St. Louis, Enron Corporation, and the Philip Morris company. And now, the McWilliams and hundreds of other GOP fund-raisers are being asked to find a total of $30 million more in so-called hard dollars. That's money raised within federal limits, no more than $20, 000 per person, $40, 000 per couple to the party, legal for all campaign activities. To that $30 million hard-money goal, add more millions in soft money, certain to come in between now and Election Day, and the total spent to elect Bush could easily reach $200 million -- simply stupendous. Much will go for TV ads. They've already started. This one ran in 17 battleground states. (BEGIN VIDEO CLIP, RNC AD) UNIDENTIFIED ANNOUNCER: ... to strengthen and improve Social Security. The Bush plan guarantees every... (END VIDEO CLIP) JACKSON: As long as the ads don't directly urge a vote for Bush or against Gore, there is no limit how much the party can spend on them, and the GOP says it could pay most of the costs with soft money. But at least as much party money is being budgeted for organization -- ground troops, voter contact. UNIDENTIFIED FEMALE: Do you need a ride or anything? You don't. JACKSON: Bush appeals to affluent donors of all sorts, not just lobbyists. His primary campaign brought in nearly $86 million, mostly in thousand-dollar checks. Now, Bush the nominee hits the money trail again. Team 2000 members have been alerted to fund-raisers in California cities and Seattle next week. Then Des Moines, Miami, New Orleans, Cincinnati, and next month, New York, and a return to money-rich California. (on camera): So when bush and Cheney leave here, they'll be hitting a campaign trail paved with money, and lots of it. Brooks Jackson, CNN, following the money in Philadelphia. (END VIDEOTAPE) WOODRUFF: And in the interest of full disclosure, we should let you know that within the last 15 seconds, this convention has been gaveled to order by House Speaker Dennis Hastert. He's standing right there at that podium in the middle, that lectern in the middle, and with three taps of the hammer, they're in session. Well, we've been listening to Brooks Jackson talk about what George W. Bush is going to have in the way of money, 200 million and counting. The question, of course is, what's Al Gore going to did it respond? Let's go down now to our floor correspondent, John King, who makes a habit of covering Al Gore -- John. KING: Judy, the Al Gore campaign and the Democrats say there is no way they can compete with those Republican numbers, but they do expect to be competitive this year. One reason, President Clinton. He's not on the ballot this November, but a very effective fund- raiser, and is out now several times a week raising money for the Democrat. Another reason, organized labor. The AFL-CIO spending millions throughout the primary campaign, even since Al Gore clinched the nomination in states like Pennsylvania, other key battleground states. The AFL-CIO working on a ground game that it says will be its best ever in turning out voters. Again, though, the Gore campaign says it won't be competitive, but one dynamic working in the Democratic Party's favor this year. The race for the House is so competitive. Republicans have a lead now, have a six-seat margin now that is viewed as so competitive, that many of the corporate interests that usually would give to the Republicans are giving to both parties this year just in case the Democrats win in November. Back to you in the booth. GREENFIELD: Thank you, John. We hear all the time about the so-called convention bounce. When a convention is over, the party almost always increases its standing. But what does it mean? How long does it last. There's nobody better around to answer that question than our own Bill Schneider. Bill, start bouncing. WILLIAM SCHNEIDER, CNN SENIOR POLITICAL ANALYST: OK, the convention is almost over, and very soon, we'll be talking about bounce. That's how you measure the success of a convention, how many points the candidate gains in the polls. Where are the voters? Well, let's see who got the biggest Republican convention bounce on record. Well, of course, Ronald Reagan, 1980. The excitement over his nomination and his choice of George Bush gave the GOP ticket a record 13-point bounce. Not much bounce for Reagan in 1984 because the voters were presold. Vice President George Bush got a pretty good bounce ought of the '88 convention, even though the press thought that convention was a catastrophe because of the controversy surrounding Dan Quayle. Bush used that convention to turn the whole campaign around. He defended his choice against a howling press mob and was tested under fire and showed that he was his own man. Al Gore should be so lucky. The bounce was a little smaller from the controversial 1992 convention, and just a three-point bounce for Bob Dole in 1996. Now, what kind of bounce does George W. Bush need from this convention in Philadelphia? The average convention bounce is six points. And you know what? Our poll of polls going into this convention shows that Bush is leading Gore by, you guessed it, six points. So to turn that modest lead into a comfortable lead, he's going to needs a slightly larger-than-average bounce, because you know Al Gore is going to get a bounce from his convention this month as well. So what kind of bounce will George Bush get? We don't know, and we won't know tonight. Because remember, unlike you model citizens, a lot of people aren't watching this convention. We're going to wait until this weekend. We'll be interviewing voters, and we'll tell you on Sunday. In the meantime, beware of pollsters bearing false bounce. A lot of it is spin. Back to the desk. SHAW: Thank you, Bill Schneider. There's No spin on the fact that John King alluded to the deep competition in the race for the House control. The Democratic leader from the House, Dick Gephardt of Missouri, indicated to Al Gore, I don't want to be on the ticket, because I want to stay here, I want to help my party. Let's check in with Stu Rothenberg to take a closer look at the House race. STUART ROTHENBERG, CNN POLITICAL ANALYST: That's right, Bernie, the fight for the House and the Senate, they're both very close, the Democrats just need seven seats to take over the House, and four seats to get to 50 in the U.S. Senate. And this convention actually could affect some races. For example, it could motivate energize, and give a good deal of enthusiasm to Republican voters in Republican districts, because there are some candidates in those districts who are having trouble, for example Republican candidates in the Florida district being left open by Bill McCollum, the Republicans could lows that district, or in Montana's at-large House seat, again, the Republicans could use a huge boost if Republican turnout increases. On the other hand, another way the Republicans could be helped is if the mood of this convention, the kinder and gentler Republican Party comes through, and convinces swing voter, some minorities maybe even, that they ought to look to Republican congressional candidates. And who could benefit? Well, possibly in California, Jim Rogan, in a very marginal district, increasingly Hispanic and Asian-American. If those voters decide the Republicans are more welcoming, they might look at him. And as well, there are candidates like Dick Zimmer in New Jersey, a moderate Republican in a moderate district, could be helped. Back to you. GREENFIELD: Stu, one quick question. In all of what you're talking about, I think it's important that you tell us, of the 435 seats that we will be voting for this fall, how many of them are authentically in competition, would you say? ROTHENBERG: Well, Jeff, we're talking about two or three dozen seats at the most. It's interesting, if you think back to the mid 1990s, when we were looking at 100 or 110 districts at this time, most incumbents looked very safe, there were relatively few open seats, and that's why there were very few contests. GREENFIELD: Thank you. WOODRUFF: All right, so much to talk about tonight. When we come back, we're going to take you behind the scenes to see just how this whole extravaganza is being put together. (COMMERCIAL BREAK) GREENFIELD: The convention hall is quiet, but if you want to see a frenzy activity, we're about to show it to you. Putting this convention together is a logistical nightmare. Just in these four days, the convention has featured 19 musical performing acts. It will have featured 139 speakers, 15,000 volunteers will have been involved, 200 pages will be running back and forth all night, 150, 000 balloons -- I don't know who counted, but I trust them -- and there will be a record amount of confetti dropped at this convention. To find out how the Republican convention coordinates all this, Wolf Blitzer, inside the secret room. BLITZER: It's actually a makeshift control room, Jeff. We're in what is normally the locker room of the Philadelphia 76ers, but right now, we're under the podium. This is the control center where all of these events, these four nights, have been so carefully choreographed, carefully scripted. Leading the way, Red Cavaney. He's the director of official proceedings. He's joined by Larry Harlowe (ph), and their job is to make sure that everything works perfectly, everything goes according to the schedule. They have to sometimes lose various musical interludes, sometimes they have to go wider, sometimes they have to make up some time, sometimes they have to listen. Let's listen to as they get going, as they try to monitor what they are making sure the colors ceremony is on schedule. Let's listen to them. UNIDENTIFIED MALE: We don't have them on either side. You didn't see them on either side. BLITZER: The Color Guard has got to be on the stage. The singers are getting ready for a special presentation from the Philadelphia Boys Choir. They'll be doing \"The Circle of Life.\" They want to be sure it begins and ends on schedule. UNIDENTIFIED ANNOUNCER: Ladies and gentlemen, the Philadelphia Boys' Choir. UNIDENTIFIED MALE: Roger, we have some people checking down here as well. Yes. Warren, Gary have prepared for it. (SINGING) UNIDENTIFIED MALE: That list coming up now? UNIDENTIFIED MALE: OK, Charlie, he's coming left your way. And when he gets there, let him know we've got plenty of time. so take his time coming out, and wave. UNIDENTIFIED MALE: Would you please tell me when he's there, just to make sure. (SINGING) (APPLAUSE) UNIDENTIFIED MALE: Until they fully get cleared out. We're a little ahead. We're doing fine. We're going to hold the music interlude for a little while and make sure they play. UNIDENTIFIED MALE: Music, we're going to let this go for a little bit, until the choir is completely clear and maybe even longer. We're a little bit ahead. UNIDENTIFIED MALE: Yes, we've got to clear the mics off and everything, make sure. Charlie, we're going to wait here until we clear the mics and everything from the -- when the band gets out of the way. BLITZER: Red, while waiting, maybe you could tell our... UNIDENTIFIED MALE: Let's not -- Roger, don't move until I give the cue, OK. We're going to clear some stuff. BLITZER: Maybe, while you're waiting, Red, you could tell our CNN audience what you are doing at this second. RED CAVANEY, PRESIDENT & CEO, AMERICAN PETROLEUM INSTITUTE: Well, right now, we are making a transition from the arts choir (CROSSTALK) ... where we use the standard podiums and all, so it's very difficult to move that and keep your timing going without breeding the commotion. That's what we're trying to do. BLITZER: What's your worst nightmare? CAVANEY: That one piece of gear gets left here in this particular move when the speaker is ready to go the (UNINTELLIGIBLE) BLITZER: All right, Red Cavaney. Normally, Red Cavaney is the president and CEO of the American Petroleum Institute in Washington, the trade industry for the oil industry -- the trade association for the oil industry. He has been a volunteer. He's been doing this four days every four years for many years. He says this is the last time he is volunteering. Next time, they will have his deputy over here, Larry Harlowe, who is sitting next to him. He is going to do it in four years, presumably getting ready for what is obviously a very meticulous operation. Back to you guys in the booth. SHAW: Thank you. And there's much, much more to come from this convention hall, as the delegates await Texas Governor George Bush and his acceptance speech. We'll be right back. (COMMERCIAL BREAK) (BEGIN VIDEOTAPE) NARRATOR: Nominating day at the 1948 Republican Convention in Philadelphia was a long one. New York Governor Thomas Dewey, who had lost to Franklin Roosevelt in 1944, was again the favorite. But on the first ballot, Ohio senator Robert Taft was a strong runner-up. And Harold Stassen had some support, too. It took until well past midnight, after another ballot and a time-out, for Dewey to become the party's unanimous choice. (BEGIN VIDEO CLIP) THOMAS DEWEY, PRESIDENTIAL CANDIDATE: I am profoundly sensible to the responsibly that goes with this nomination. (END VIDEO CLIP) NARRATOR: It was the last time Republicans chose a candidate who had already lost an election, and the last time the nominee needed more than one ballot. Dewey would lose to incumbent Harry Truman, but would it be close. (END VIDEOTAPE) GREENFIELD: You know it's funny, folks. We just were given a tour behind the scenes, thanks to Wolf Blitzer of this control room. It's as though -- and they are -- they are proud of the meticulous arrangement. You remember when it was almost a scandal? WOODRUFF: It was never -- it wasn't always like this, right? GREENFIELD: Well, I've been thinking of 1972, the Nixon re- nomination, one intrepid correspondent -- I think Sam Donaldson -- got hold of the script that had the minute-by-minute account of the convention. And it was reported as a scandal. How dare these people manufacture and script a convention? Today, the convention folks walk around from trailer to trailer telling, now, it's okay -- 7:04, spontaneous demonstration, 7:06, sustained applause, 7:08 sentimental moment. WOODRUFF: And not only that, Red Cavaney, who Wolf was talking to a minute ago, those conventions that he did in years past, those were conventions where they were juggling politicians, and trying to make sure that Congressmen this or Senator that didn't go too long. This year, you don't go too, you know, go a minute over. GREENFIELD: They almost strangled the governor of Wyoming, because his nomination total was too long. But we know that tonight, there is one piece of business, the most important of the convention. It is the speech. And to talk about it, Mary Matalin and Michael McCurry -- folks. MICHAEL MCCURRY, CNN POLITICAL ANALYST: It's good to be with you. You know, thinking of the way in which the parties have become so adept at planning out, second by second, what these conventions are all about, we forget that it really boils down to what one individual person can do when they stand there as the nominee of the party, what kind of vision they express. That is a hefty assignment for George Bush tonight. And I think a lot of people are going to be thinking, Mary, is this guy really up to this job? What can he tell me that reassures me that he could do this job as well as some of those presidents that paraded before the convention this week? MARY MATALIN, CNN \"CROSSFIRE\": Well, there is more people in the press, and certainly more amongst -- in the Democratic Party who are saying -- not people who have seen him perform in these primaries or have watched him perform his duties in Texas. But yes, you are absolutely right. This is one of those pivotal moments, one of those few opportunities in the entire campaign -- primary, general -- where so many eyes -- if not eyes focused on, reports about -- this is the most covered event. The debates are the most watched. But there's more of them. And he is ready. He is not nervous. He is ready and he's anxious. MCCURRY: Mary, this has, in my opinion, been rather light on substance this week. And the one thing I think that you have to do in convention -- and I think Bush has got to do tonight in his speech -- is to give people of some sense of the two or three things that I know this person would do and be about if he was president of the United States. Now, we get some indication from the Bush campaign that he is going to lay out some plans for Social Security, other things, but they have left a lot out there for Bush to do with this speech by being so, you know, warm and fuzzy during this week. And I think it is big, big challenge for him. And he is going to be measured against the speech that his father gave. He is going to be measured against some of those great convention speeches we have heard in past. And I'm just wondering whether he is going up to it. MATALIN: He is also going to be measured against what he says he is attempting to do and is using this convention as the launch pad, and that is to change the Republican Party. That is what he is going to be measured against. And this convention has done that so far. One of the things is warm and fuzzy. Some -- a big part of the Bush message is: We are going to change the tone in Washington. And this was an example of it. There's... MCCURRY: Tell me how Cheney's speech last night came... MATALIN: It is not -- that is not the same as we are there -- these two parties are very different. We have been talking about this every night. And he set out to contrast. But changing the tone means changing the team. But they do have to explain -- and maybe I've been listening to a different convention or hearing it in a better way -- they have said why it is time for them to go. There has to be a purpose to our prosperity. And each night they have said it: a better purpose for the military, better purpose for the prosperity; tonight the purpose of the presidency, to restore the dignity to White House. It might not resonate with you, Michael, but it's resonating out there. WOODRUFF: Mary, we have already seen some advance excerpts of the speech. And among other things, Governor Bush talks about, he says: \"I have no stake in the bitter arguments that have taken place in Washington in the last few years.\" How does he say that without, in some way, if not alienating, at least raising some questions about Congressional Republicans? I mean, he doesn't want to completely cut himself off from them, or does he? MATALIN: No, he doesn't. And he is not. And if you look at our polls -- you have seen this data -- the impeachment issue, the big \"i\" issue -- speaks for itself. What was once a negative for those who voted for impeachment is now, over time, become a positive. You don't have to say it. It just is there. And he is not trying to cut himself off. MCCURRY: I think -- look, I think you have to -- a presidential campaign has to look forward and be about the future. They have spent a lot of time talking about this character issue. I think the -- some of the polling data I have heard indicates that Dick Cheney's negatives rose as a result of his speech last night, and independents didn't respond very well to this speech, because they just thought it was part of that same bitter attack style. Look, you know we talked about the speech... MATALIN: You guys can't have it both ways. You can't be against touchy-feely and then you can't be against contrasting. What are you against? You are just against the whole party, the whole convention. MCCURRY: You have to contrast around the substantive differences the parties stand for. And last night was sort of rerunning a lot of stuff about character and dignity, but not much about: How do we differ from the prosperity that we have enjoyed for the last eight years? How would we govern -- or propose to govern -- in a different fashion from a way in which Americans, by and large, think has been pretty favorable? And I just think -- I think there is an awful lot of complex stuff that goes into this speech tonight by Bush. And some parts of this convention have left a little bit to be desired when it comes to building a national argument. GREENFIELD: OK, if I may. MCCURRY: Uh-oh. GREENFIELD: Yes, that's right. MCCURRY: Pop quiz time, I feel it coming. GREENFIELD: No, no, no, let me just point this out to those who weren't with us last night, last night witnessed one of the great bipartisan disasters since the congressional pay raise scandal. The political quiz that we have been using throughout this convention we applied to these two experts. And let me put it this away, if they do as badly tonight as they did last night, they'll be doing election night on the Home Shopping Network. MATALIN: Well, you can't lower our salaries. GREENFIELD: So here we go. First, the United States senator who unsuccessfully sought the 1952 GOP presidential nomination was known as \"Mr. Republican.\" Was he, a, Harold Stassen, b, Barry Goldwater, c, Thomas Dewey, or d, Robert Taft. MATALIN: You're Mr. Republican, who would that be? MCCURRY: And you're for Ohio. That's got to be Robert Taft. GREENFIELD: All right, back on track. MCCURRY: We're lucking out. GREENFIELD: Question two, who was the first Republican to be first be elected president twice? Was it Ronald Reagan, Richard Nixon Dwight Eisenhower or Abraham Lincoln? MATALIN: If this isn't a trick question, which would not be beyond you Jeff, it has to be Abraham Lincoln. MCCURRY: The Party of Lincoln, that's right. GREENFIELD: Excellent. And third... WOODRUFF: They're redeeming themselves, They're redeeming themselves. GREENFIELD: You know, about 80 percent of fifth graders got these, but I'm proud of these guys. And third, watch this one, please listen carefully: Who was the first Republican to serve two full presidential terms? Was it Theodore Roosevelt, Benjamin Harrison, Rutherford B. Hayes, Ulysses S. Grant. MATALIN: We pick Grant. GREENFIELD: Very good, because Roosevelt came in after the assassination of McKinley. Folks, you're back on track. Thank you very much. I'm sure you're more relieved than we are. And much more to do when we come back, we will be back to the floor to talk about the election beyond the presidency in just a moment. (COMMERCIAL BREAK) SHAW: Perhaps it's quietest it will be tonight. We're in an interlude, and the director -- oh, look at that. The director of the planning of this convention occasionally will intersperse some music, but right now, the delegates are waiting around just moments before the speeches get under way. That looks like Bob Michael of Illinois, that fellow in the middle. Below the top of the ticket, there is a major battle, trench warfare coast-to-coast. Let's go down to California delegation and Candy Crowley. CROWLEY: Hey, Bernie. I have moved a little bit over actually to the Mississippi delegation, where if I can get his attention, I have the Senate Majority Leader Trent Lott. Gee thanks for joining us SEN. TRENT LOTT (R-MS), MAJORITY LEADER: Glad to be here. CROWLEY: Standing next to him and who moved over just a little to be here is the House Speaker Dennis Hastert. Wanted to talk a little about coattails and the fall. If this ticket stays kind of where it is, leading, and that's a big if, what happens to Senate races, first of all? LOTT: Oh, I think it'll definitely help. I ran in 1972 when Richard Nixon was elected overwhelmingly, and it helped me in my race. So it definitely can be a help in Senate races. Some ways, though, I think it actually may help more in House races, from the experiences that I've had in the past. CROWLEY: Well, Mr. Speaker, I talked to somebody a little earlier, that said, \"You know, I wouldn't say coattails, maybe a little cuff.\" Is this fought district by district or does the top of the ticket help? REP. DENNIS HASTERT (R-IL), HOUSE SPEAKER: Our race is going -- our race to keep the House is going to be district by district. And we have probably 40, 45 districts out there in play. We're a lot better off now than we were a year ago, but I'll tell you, I think it's the predicate that both working with the Senate and the House, laying down and getting good legislation out there, balancing the budget, paying down the debt, protecting Social Security, giving a little money back to American workers out there that has laid our predicate that's going to make our job both in the House and the Senate much easier. We've had a great working relationship and cooperation. And I think George W. Bush and Dick Cheney, whatever help they can give, it'll be very, very welcome. CROWLEY: Now, do you expect any help -- I mean, it brings up an interesting point because I have to tell you, I haven't in the last, say six months, been with George Bush when he's been in to any House races or any Senate races or indeed had any House members or Senate members on the podium with him. HASTERT: Well, we're going to be -- he's going to be out in the hustings. He's going to be, you know, in Ohio and Michigan and Illinois. And we'll have our candidates out there. And I think that's very, very helpful. LOTT: You were in Brandon, Mississippi, when I was on the podium with George W. Bush... CROWLEY: I stand corrected. LOTT: ... did a press conference with him. And I think you're going to see this fall, as he goes around the country, when he's going through Illinois and Ohio and through the South, he'll have House and Senate candidates that will be participating with him. We all have to win our races, you know, state by state or district by district. There's no question about that. But if our candidates get out there and run on the issues that we've been dealing with in the Congress, I think we're going to do fine. CROWLEY: Now, you know, does it help you or hurt you with this sort of new face of the Republican Party? Because you've got some very conservative districts, you've got some very conservative states. How is this going to play with this sort of more moderate Republican Party? Is that a difficulty? HASTERT: Well, I think we're certainly the party of opportunity. And when you look at some of the open seats that we have and seats that we have a challenge in, Jennifer Carroll in Jacksonville, Florida, and Rodriguez in California, those are the people that we want to have representing our party and helping us. You know, I think that's a real positive for us. CROWLEY: OK. Let me ask you real quickly: Senator Santorum, how much trouble is he in? LOTT: He's not in trouble at all. Now the media and others have been saying, well, that could be a vulnerable race. He's running a great race. He's a dynamic young man. He's going to be a leader in the Senate. He's -- if you believe the polls, he's way ahead. He's done everything right. He's going to win overwhelmingly. And by the way, this convention didn't hurt him either. It helped him. CROWLEY: OK. All right. You know, and while we're on the topic, let's go over to John King in Pennsylvania. KING: Thank you, Candy. One of the most competitive Senate races this year, right here in host state for this convention, Pennsylvania. We're with first-term Republican Senator Rick Santorum. His wife, Karen. His niece, Fran, wanted to join us as well. For senators from the Western part state, one of the big challenge for a Republican is doing well here, in the Philadelphia suburbs. This convention can't hurt that regard. SEN. RICK SANTORUM (R), PENNSYLVANIA: It has been great help. I think we've really made a positive impact on this region with the great message of inclusiveness, and diversity and reaching out. I think George Bush's message of not taking any vote for granted, for or against you, is really what we need here in southeastern Pennsylvania, particularly the city of Philadelphia. Being out of the neighborhoods this week, I can tell you, it's resonating out there. People are excited. I've talked to people who told me they've been Democrats, and they're going to vote for George Bush because he's where they are, and he's concerned about them and he's reaching out to them, and that's great. KING: You're running against a Democratic congressman, Ron Clank (ph), who much like the vice president against Governor Bush, says the Republican plan for prescription drugs would leave millions uncovered, unaffordable, that the tax cuts squander the projected federal surpluses. What's the single most important issue, in your mind, in this race? And is there anything you need hear from Governor Bush tonight that you think would help you? SANTORUM: Well, I think there's two major issues. Number one is Social Security, and I think you need to hear from Governor Bush tonight that you think would help you. SANTORUM: Well, I think there's two major issues. Number one is Social Security, and I think we're going to hear from Governor Bush tonight about a man who's going to face a problem that's facing this country, Social Security, and having to deal with it for Fran's generation and making sure that it's going to be there for them. And his idea of personal-retirement accounts, as opposed to cuts in benefits or increase in taxes, and that's what alternative is, that is to me, is a real courage and visionary approach to solving this problem. KING: OK, Senator, we thank you for your time. We're going now back to booth. MESERVE: No, John, actually over to me, I'm in the state of Florida. Florida one of five Senate seats that the Republicans fear they could lose this year. Connie Mack, who's retiring. With me now, the Republican running for his seat, Congressman Bill McCollum. Thanks so much for joining us here today. You're down nine points in the polls right now. Do you think this convention can help you make that up? REP. BILL MCCOLLUM (R), FLORIDA SENATE CANDIDATE: I think we are making it up. Actually, the latest polls show us down five points last week. And I think that as the convention goes along, we're focusing on the issues I've been talking about, about, you know, not leaving anybody behind in a prosperous America and what we do in terms of defense needing to be rebuilt and so on and so forth. So I think this -- a focused convention is good for me. MESERVE: Mitch McConnell, the head of the Republican Senatorial Campaign Committee, called this the year of the contented voter. He said to me he didn't think anybody was going to have coattails this year, including Bush-Cheney. What do you think? MCCOLLUM: Well, I don't know about coattails, but we're not counting on their having coattails. I'm running a race that I think -- to succeed Connie Mack in Florida, a great United States senator. And I think the next senator from our state is going to be somebody who, first of all, understands Florida and can be fighting for our fair share of tax dollars to return to a growth state over the next decade, and somebody who basically represents Connie's mainstream views, which I do. MESERVE: Congressman Bill McCollum, thanks so much for joining us. Now to Frank Sesno in the state of New Jersey. SESNO: In the state of New Jersey and Congressman Bob Franks. He's running for a Senate seat that's been held by Democrats for 28 years. You are down by 20 points in the last poll I saw. What does this do to turn a bounce for you into a bound? REP. BOB FRANKS (R), NEW JERSEY SENATE CANDIDATE: Frank, it's a great opportunity for us to showcase a message around a governor of Texas who's responding to the concerns of people in my state: How are we going to save Social Security and Medicare? How are we going to use this emerging budget surplus to invest in America's future? And how are we going to make certain that we leave no child behind in America? SESNO: Your opponent, Jon Corzine, spent $35 million of his own money in the primaries alone. You only have a $1.5 million in the bank right now. What are you going to do? FRANKS: Frank, let me tell you something about the voters of New Jersey: They can't be bought. They won't be conned. This election is not for sale. I don't care how much money Jon Corzine spends, it's message that matters. It's our views that are important. We're going to win the election based on my record. SESNO: Congressman Bob Franks, thanks very much. Back to Judy in the booth. WOODRUFF: All right, Frank. I don't know how many of these members of Congress would acknowledge it, but a few of them would have liked to have had a little more airtime at this convention. I was talking the other day here with former New Jersey Governor Tom Kean, who said, yes, absolutely. Because I asked him, I said, wouldn't these members of Congress, senators who are running love to be -- he said, they'd love to be up on the podium, but this convention is George W. Bush's convention, not theirs. When we come back, we are going to take a close look at the very special relationship between George W. Bush, and his father, some of which you'll hear about in the governor's speech tonight. (COMMERCIAL BREAK) GREENFIELD: Only once in American history has a president had a son who also became president -- John Adams and John Quincy Adams. Well, for four nights in this convention, former President George Bush hat sat in a box above the convention floor watching the convention that will nominate his son to be the second such president. George Bush the father has been saluted at various times during this convention, not only as the most recent GOP presidential nominee and president, I should say president, but as the father of this nominee. And Frank Sesno takes a closer look at relationship between father and son, and maybe president and president. (BEGIN VIDEOTAPE) SESNO (voice-over): By all accounts and by any measure, the Bush family is a close and loyal clan, but the relationship between this father and this son is something special, if for no other reason than because it may be something historic. GEORGE H.W. BUSH, FORMER PRESIDENT OF THE UNITED STATES: As the father, I am very proud to brag about our son. SESNO: Only once before, 176 years ago, has a son, John Quincy Adams, followed his father, John Adams to the White House. GEORGE H.W. BUSH: George W. Bush will be great president of the United States, and he's a fighter and he has character to restore dignity and honor to White House, that from his proud father. SESNO: Those who know George W. Bush best say he has his mother's wit, her sharp tongue, even her withering glare, in the words of one aide. But it is father and son who share the competitors blood, whether it's golf or politics. CHARLES BLACK, GEORGE W. BUSH ADVISER: President Bush and Governor Bush are very close, have a close relationship. It's a private relationship. They talk frequently. SESNO: The elder Bush follows campaign meticulously, though, insiders say doesn't mettle. He gets constant updates from Karl Rove, the governor's top campaign strategist. From latest polls to press coverage, he is, in Rove's words, an avid consumer. Behind the scenes, the elder Bush offers advice, counsel and a very confidential ear. GEORGE W. BUSH: This man is not a political consultant, he's a father. And I love him and respect him. And the advice I get from him is the advice a dad would give a son. SESNO: Example: Aides say the senior Bush played a significant role in reinforcing his son's decision to pick Dick Cheney, President Bush's former defense secretary, as a running mate. According to insiders, the senior Bush offered a political gut check. He thought the choice would play well. He emphasized the importance of compatibility and loyalty, something that's been passed down just as surely as the physical resemblance. BLACK: Loyalty to your friends and those who serve you and expecting loyalty back is a big part of President Bush's code and Governor Bush's. And Governor Bush talks about it a lot and expects it and demands it from his people. SESNO: It's long been a two-way street. George W. has run interference for his father, too. During the White House years, the younger Bush was known by some as the enforcer. Most notably, he helped push out chief of then-Chief of Staff John Sununu, who it was felt was ill-serving the president. George W. was a sort of early- warning system. ANDREW CARD, FORMER BUSH WHITE HOUSE DEPUTY CHIEF OF STAFF: His dad used George W. to provide wise counsel and sometimes to provide a fresh vision of what was happening. But I never felt that George W. Bush was telling the president what to do. Instead, I think President Bush was calling his son and asking him what he thought was happening. SESNO: With the younger Bush in the limelight, the dynamic has changed, a careful balance now to avoid trappings of dynasty and entitlement, a crown prince not quite up to the task. This moment, in New Hampshire, made some supporters cringe. GEORGE H.W. BUSH: This boy, this son of ours, is not going to let you down. He's going go all the way and serve with great honor all the way. (CHEERING) SESNO: But generally, the family applause well, and the Bush boys proudly play it up. Florida Governor and brother Jeb put it this away. GOV. JEB BUSH (R), FLORIDA: I think my dad and mom symbolize integrity, and wholesomeness and traditional values probably. SESNO: Bush campaign officials say the former president will be out on the trail this fall, but used modestly, maybe 10 or 15 days, an enthusiastic but carefully scripted role, as at this convention, where the former president is a center of fond attention, a symbol of supportive family values, but not too prominent. He's not even making a speech here, though he says if President Clinton doesn't quit hammering his son unfairly, he may tell the nation what he thinks of Clinton -- quote -- \"as a human being and person.\" Meantime, associates say, the thoughts that matter most will take place out of earshot. Says George W., \"It's no sign of weakness to talk to your dad.\" (END VIDEOTAPE) SESNO: And one other twist to this whole thing, and that is that those close -- closest to George W. Bush say he could be more like Ronald Reagan as president, focusing on a few big issues, than his father, who seemed to go from issue to issue with some degree of abandon. Back to you in the booth. WOODRUFF: A very interesting relationship, almost endlessly fascinating, this relationship between a president and son running for president. George W. Bush grew up in a family of politics. His father was gone a lot when he was young, Bernie: You did some reporting in Texas, as did I. We talked to people there who remember George Bush the father being gone a lot, Barbara Bush shaping this young, when he was young, but the father always present, always, in a sense of influence, always present in his life. SHAW: And certainly at pivotal times, too. WOODRUFF: That's right. GREENFIELD: One thing you were mentioning, Judy, you know, in 1992 part of what shocked the Bush family, father and sons, was they thought on the character issue they had Bill Clinton dead to rights after Gennifer Flowers and the draft, and it turns out the issue of the economy and the issue of change doomed George Bush the father. You were making a point about issues, or the lack thereof, at this convention: It struck you. WOODRUFF: Well, it is: I was talking to some folks, and real people, you might say, in Philadelphia today outside the convention hall, people who are not delegates, people who have been watching this on television. And several of them said to me, \"How come we're not hearing about issues?\" One, in particular, was interested in prescription drugs. Another one, health care, HMOs. Another one wanted to know about education. And I said \"Well, you know, there have been interludes, there have been moments when they've talked about it,\" but these people are absolutely right. We just had, for example, just a few minutes ago Senator Bill Frist was talking about prescription drugs. He was on stage for four minutes. GREENFIELD: But this not, as they used to say in Marxist- Leninist, this no accident. From the very beginning of this election, the Bush campaign has been candid in saying that -- well, they've been candid when you talk to them, not with a camera perhaps -- that issues are not driving this election. This election will be on character and leadership. Tommy Thompson, governor of Wisconsin, platform chair, said the same thing this morning: If bush wins, it's because people trust him and like him more. WOODRUFF: The Gore campaign says just the opposite. SHAW: Exactly. WOODRUFF: They want the campaign to be about issues. Let's go down to the podium and to Wolf Blitzer -- Wolf. BLITZER: Judy, one of the things that we're all going to be looking for in this speech tonight is what issues won't be mentioned by George W. Bush. Presumably, one important issue to many of these Republican delegates here that won't be mentioned, because it is a divisive issue. It's an issue that there is a split on the abortion issue being resolved in the Republican platform. But another issue that is going to be difficult for the Republicans to deal with is this issue of the strong economy. President Clinton and Vice President Gore are going to be trying to take as much credit for the strong economy as possible: How do you deal with the problem, from the Republican standpoint, that is, that there's low inflation, low unemployment, and there is this massive budget surplus. So, that's an issue they're going to have to finesse. I did speak with one top Republican very much involved in this Bush campaign right now. He says what George W. Bush is going to try lay out, his vision as a president, something that his father, as we all know, had a difficult time doing when he was president. Back to you in the booth. SHAW: Interesting point you make, Wolf, because last night we were interviewing former Treasury Secretary Nicholas Brady, and I was asking him, how can you defend against the Democrats' claim that they are responsible for eight years of prosperity. He said it's important that we Republicans also get credit for the economy. GREENFIELD: Yes, I think their tacking (ph) is going to be everybody deserves credit or no politician does. It was the information economy and the new technology. WOODRUFF: Well, they very strongly argue, too, that this -- that the turnaround after the recession began while George Bush the father was still in office, and that Bill Clinton was simply the beneficiary of that. John King, you're down on the floor. KING: Well, Judy, the Bush campaign would dispute the fact that it has not been specific on the issues. It really depends on when you tuned into the campaign. At this convention, not a lot of specifics yet, but remember back in the primaries quite a spirited debate between Senator McCain and Governor Bush over how the big tax cuts should be. Governor Bush proposes about $1.3 trillion over 10 years; the Democrats of course say that is too much. Now also on Social Security, the governor thinks he deserves credit for being quite bold in proposing that individuals be allowed to invest perhaps 2 percent of their Social Security payroll taxes into individual private retirement accounts. Politicians for years have thought of Social Security as the third rail of politics and have been reluctant to touch that. One of the reasons, though, very few specifics at this convention. The governor has a difference of opinions with the Republican agenda in the Congress, and there's not even agreement among the Republicans in Congress on some issues so that governor has withheld some of the specifics, waiting for the fall debates against Al Gore, although we do expect to hear some tonight. Now over to my colleague Jeanne Meserve. MESERVE: John, I talked to one Democratic operative today who was quite gleeful in pointing out that the Republicans have not been talking about issues. Obviously, the Democrats hope to capitalize on that. He said the Gore campaign probably will be stressing five issue: Those are the patients' bill of rights, prescription drugs, tax cuts and Social Security, gun control, and choice. They -- he said that the campaign at this point has not decided which issues to give priority to. He said if he had his druthers, he would go with choice and gun control. He said those are the wedge issues that will really split up those women voters that are so critical in this campaign, particularly in those big battleground states. Now let's go to Candy Crowley. SHAW: OK, thanks very much, Jeanne Meserve. When we come back to Philadelphia, we're going to go to this great nation's heartland to find out what the people out there are thinking and saying about what's happening here. Back in a moment. (COMMERCIAL BREAK) (BEGIN VIDEOTAPE) NARRATOR: Day four of the 1892 Republican national convention in Minneapolis went relatively smoothly until delegates renominated incumbent President Benjamin Harrison. There was very little debate over that, but keeping the winning 1888 team was another matter. Few delegates wanted to keep Vice President Levi Morton. After a short break, the powerful New York delegation came up with Whitelaw Reid, the editor of \"The New York Tribune.\" Reid became the first nominee at a Republican convention to be named by acclamation: without a roll call. Voters would turn Harrison out of office that year in favor of challenger Grover Cleveland. (END VIDEOTAPE) GREENFIELD: Throughout this convention, you've been hearing themes that the Bush campaign is looking to be more inclusive. One of the firsts that they have scheduled to drive this point home is a speech delivered entirely in Spanish. The California assemblyman who will give that speech will draw on his own experience as the son of immigrants. (BEGIN VIDEOTAPE) GREENFIELD: This California farmland is where Abel Maldonado saw his American dreams take root. In 1966, the year before Abel was born, his father came to the United States from his native Mexico. He found work as a farm hand, but cultivated ambitions of his own. ABEL MALDONADO, CALIFORNIA ASSEMBLYMAN: From there he started actually as a sharecropper, and from being a sharecropper he went on to own his first 3 acres and went on to own 50 acres and farm, and you know, eventually grow 1,200 acres and own half of our farm here in (UNINTELLIGIBLE) Valley. GREENFIELD: And there in Santa Maria, the younger Maldonado managed to sow the seeds of a political career. He was elected to the town city council when he was 26, became its mayor at 28, and a state assemblyman at 31. MALDONADO: And my father early on taught us hard work and told us that if we worked very hard, we worked hard, we'd get somewhere in America, because this is a land of opportunity. (END VIDEOTAPE) WOODRUFF: Right now, we are looking at a speaker that -- we're looking, actually, at the entire podium. But there is a speaker named Dave Wenzel, who is speaking about issues regarding the disabled. He happens to be in a wheelchair. Coming up next, the man Jeff just profiled, Abel Maldonado, California assemblyman, who will be speaking entirely in Spanish. GREENFIELD: And he'll be introduced by someone who will be more familiar to most of our viewers than your average politician, and that will be Bo Derek. It's no secret that most of the Hollywood community tilts pretty substantially towards the Democrats, so the Republicans are happy to get pretty much the movie stars that they can get. And Bo Derek is certainly among the most noticeable. SHAW: And Maldonado's address, as you said, will be entirely in Spanish, but people in the hall will be able to follow what he's saying, because there will be a simultaneous translation on the center screen there, behind the podium. GREENFIELD: It's true. And it is the first time at any convention, as far as we know, that a speaker has addressed the convention entirely in Spanish. Not to be too flip, but there are some politicians who have been speaking in English, at times, and I have not fully been able to understand what they have said. But this is the first time, deliberately, that a speaker has addressed the convention entirely in a foreign language. It's just part of that theme. And we know that George Bush got nearly half the Hispanic vote when he ran for reelection as governor in 1998, something remarkable for a Republican. Down to the floor and Candy Crowley. CROWLEY: Jeff, (UNINTELLIGIBLE) the Latino community is a longstanding effort by George Bush, as you know. He prides himself on the pickup he got in the Latino community in his own state when he ran for reelection. There is hardly a day that goes by that I can remember on the campaign trail when there isn't some sort of Latino event, be it a school, be it an outreach group. This is a community that George Bush plans to work very hard in order -- particularly in big states like California and Florida. When the Bush campaign came into Pennsylvania, it was absolutely not a coincidence that the first event he had was with the Latino community. Jeff, let me go back to you in the booth. GREENFIELD: And I believe we're going to go down to the floor, where Bo Derek is about to make this introduction. BO DEREK, ACTRESS: Thank you. Thank you very much. Thank you. Good evening. First, my best wishes for a speedy recovery to President Ford. And then, now, ladies and gentlemen, America's Hispanic community is a shining example of immigrant families breathing strength into America. Yes. With their emphasis on hard work, faith and family, Hispanic Americans are revitalizing our communities and enriching our culture. Yes. California assemblyman Abel Maldonado is a rising star in the Republican Party. (APPLAUSE) Yes. A Republican who has successfully taken our message of hope and optimism to the Hispanic community. Please welcome a man with a special message for Hispanic Americans. (SPEAKING IN SPANISH) (APPLAUSE) Today California, my representative, Assemblyman Abel Maldonado. (APPLAUSE) AUDIENCE: (SPEAKING IN SPANISH) ABEL MALDONADO, CALIFORNIA ASSEMBLYMAN: Good evening, ladies and gentlemen. Buenos noches, amigas y amigos. (SPEAKING IN SPANISH) GREENFIELD: Abel Maldonado continues to address the convention. We go down to the floor to Jeanne Meserve. MESERVE: Jeff, with me is Al Cardenas. He is the chairman of the Republican Party here in the state of Florida. Thank you for joining us. Your party obviously making an attempt to appear inclusive of Hispanic voters. Why are you the only Hispanic party chairman? ALBERTO CARDENAS, FLORIDA DELEGATION CHAIRMAN: I don't know the answer to that, but I'm honored to be the first one. I'm honored to see Abel now addressing the nation in Spanish for the very first time ever. And it was appropriate that Bo Derek introduced him. I think this is a ten. And we have a long ways to go, but I know that George W. Bush's heart is sincere in including us and I'm proud to be part of this team. MESERVE: Because of the Cuban-American population in Florida, Republicans have the edge with the Hispanic vote. But in other states, they do not. If I was an Hispanic in another state and of different origin, why should I vote Republican? CARDENAS: Because, we say to you, bienvenidos. This is our welcome mat to the Hispanic community. It's a dawn of a new era, a new beginning, and George W. Bush, Jeb Bush from my state, they are the heart and soul of the party of this century. And I believe they will be a wonderful opportunity for the Hispanic community to embrace us through their leadership and through folks like us who work hard in the vineyards for it. MESERVE: Al Cardenas, thanks so much for joining us. Now to Frank Sesno. SESNO: Thanks, Jeanne. And I'm with Jose Santabella. He is a delegate from the state of Virginia -- came from Cuba 40 years ago. Your party platform says that English should be the common language of this country, but we just heard this address. Does this suggest that in fact this has become a bilingual society? JOSE SANTABELLA, VIRGINIA DELEGATION: Well, those things happen by themselves. There will be places where the Hispanic will be prevalent. There are places where people only speak Spanish. I don't believe in it. I think that English is the prevalent language of the country, but there is nothing wrong with that. SESNO: You don't believe in... SANTABELLA: I believe that the common language should be English. But I'm saying, they should not be denied the right to speak the language that they wish. And there will be places like Texas or California, where they will have the language. I think that we lose quite a bit. I have five children. They are fully bilingual. And life is smiling at them because of that, because it's a second career to have another language. But there are people who believe that they should have only one language. I think they are really handicapping themselves. SESNO: OK, Jose Santabella, thanks very much. Mucha Gracias. Back to the booth. SHAW: (SPEAKING IN SPANISH). GREENFIELD: My goodness. SHAW: Bill Schneider is here to give us a closer look at this very important community... WOODRUFF: Bernie is fluent. SCHNEIDER: ... in English, in English. WOODRUFF: And Spanish. SHAW: En Ingles. SCHNEIDER: Go back two years -- 1998 -- in California, the Republican Party virtually got wiped out by a huge tide of Hispanic voters voting Democratic. But that same day in that midterm in Texas, George Bush triumphed and carried almost half of the Mexican-American vote. As a result, California Republicans were the first party in the country to petition Bush to run for president and save the Republican Party. Can he? Where are the voters? Right now, Bush is getting over a third of the Hispanic vote. That's as well as Ronald Reagan did in the 1980s. Bush's father and Bob Dole got less than a quarter of the Hispanic vote in the 1990s. Hispanics are the fastest-growing constituency in America, and Republicans are hoping that Bush will keep them from getting buried by these new immigrants the way Republicans were buried by an earlier generation of immigrants during the 1930s. GREENFIELD: You know, in 1996, I sat with Newt Gingrich, as he assured me that Bob Dole was going to carry California and the anti- immigration and English-only movement was going to be a powerful reason why. That turned out not to be true at all. Do you think, Bill, that -- those memories are the principal obstacles between George W. Bush and a good showing in the Hispanic community, as we get to November? SCHNEIDER: Proposition 187 was the issue on the California ballot -- that was in 1994 -- Pete Wilson sponsored it -- that was an issue that took away government services from illegal immigrants, but the campaign that he ran was so bitter and divisive -- remember, \"they keep on coming\" with the ads -- that Hispanics got very angry about that. And as a result, Hispanics started registering and voting in huge numbers. George W. Bush refused to endorse Proposition 187. And to Hispanics in Texas, that made him a bit of a hero. WOODRUFF: All right, Bill, we are going to go right back to the floor, to the podium, actually, to Wolf Blitzer who has a... BLITZER: I have Maldonado. I have Bo Derek. I have everybody. WOODRUFF: Wolf Blitzer, go, we hear you. BLITZER: Hi, I'm standing by over here. Mr. Maldonado is supposed to be walking out, but he hasn't walked out yet. He should be walking out right -- but Bo Derek is here. Bo, could you come over here? We want to talk -- you introduced Mr. Maldonado -- I want you to look at our camera up there -- tell us why you got involved in supporting George W. Bush. DEREK: I had been a big fan of his parents, obviously, and President Bush. And watching what he's done as governor has really convinced me that he can solve our biggest problems. BLITZER: Well, Mr. Maldonado is right here. Mr. Maldonado, welcome. We are on CNN right now. Congratulations, Was this the first time that anyone has ever delivered an entire speech in a non-English language before a presidential convention? MALDONADO: This is the first time in any party that someone has given a speech from the heart in Spanish to the Hispanic community. This is a historic moment for the Republican Party, for my family, and for all the people of California. BLITZER: And how did you -- who came up with this idea? MALDONADO: Well, the people from the Bush campaign called me if I would speak in Spanish. And I obviously accepted immediately while I was stuck to the roof. And I told them I want to speak it all in Spanish, because that is my culture, that's my heart, and those are roots. And they allowed me to do it. BLITZER: And obviously, the elimination of English as the official language of the United States is something you totally support? MALDONADO: Absolutely. I think that it's important for -- all Americans don't know all languages, but it's very important for Americans to know English. That's how my family prospered also. BLITZER: Assemblyman Maldonado, Bo Derek, thank you so much for joining us. Back to Judy in the booth. WOODRUFF: All right, Wolf Blitzer. Of course, the delegates are important at this convention. But the really important audience is the people of the United States who are watching on television. In a moment, we are going to go to Kansas City and find out what some of them think about what they are watching. (COMMERCIAL BREAK) GREENFIELD: Being in a convention is a little like being in a bubble. And what really is matters is what's going on outside. With apologies to Wilbur Harrison, we are going to Kansas City, Kansas City, here we come -- and Jeff Flock. JEFF FLOCK, CNN CORRESPONDENT: Indeed, Jeff, we are in the heartland tonight. We are on the Plaza in Kansas City. It's the K.C. Masterpiece restaurant, with Republicans, Democrats. And we are talking Republicans and ribs tonight. Teresa Lore (ph) is a staunch Republican. Has this convention had significance for you, Teresa? And what do you want your man, George Bush, to say tonight? TERESA LORE: Well, so far, it's been very entertaining. And I have heard some good things, particularly on inclusion for women and minorities. I'm waiting to hear my candidate tell me tonight how we are going to implement those things. FLOCK: Chris Fosh (ph), fireman in town -- haven't watched the convention. You're a Republican too. Is it because you don't care? CHRIS FOSH: No, I just really haven't had a lot of time to watch the convention. But I am interested in hearing Governor Bush's positions on education, inclusion and tax (UNINTELLIGIBLE) FLOCK: Across the table is Sean Boik (ph), and you're an insurance adjustor. And you are on the fence. You may be leaning Democratic. But is there something that George Bush could say tonight -- either tonight or between now and November -- that would change your mind and make you a George Bush man? SEAN BOIK: If he could convince me of his position on affirmative action, perhaps -- but at this point, no. FLOCK: Larry Coleman (ph), an attorney, we have heard a lot at this convention about inclusion. Do you buy it? LARRY COLEMAN: I think it is wonderful symbolism for country, but I'm more interested in substance than symbolism. So I would like to see him ask Congress to get some of these judges confirmed -- hundreds of them sitting around. Congress has got to release itself and start confirming some judges. If he will do that, then I will have occasion to believe him. FLOCK: So you want to see some action. You could be swayed between now and November? COLEMAN: If that happens, sure. FLOCK: Somebody who is already swayed is across the table there, Nelsie Sweeney (ph), stay-at-home mom, staunch Republican: Has this convention had significance for you, and what do you want to hear from George W. Bush tonight? NELSIE SWEENEY: I think it has had a lot of substance. I think it's a completely different convention than four years ago. I think the Republican message is resonating a lot more. I have been very impressed with the diversity and the depth of the speakers. But I want to hear Bush talk about tax relief and education. I think the Republicans finally have a strong message on education. And, you know I want to hear about his foreign policy, and, you know, cleaning up the peacekeeping troops around the world. We have good friends that are stranded around the world. FLOCK: Last word to Sarah Jo Schettels (ph), loyal opposition Democrat, staunch Democrat: What have you made out of the convention so far, and yours is coming. SARAH JO SCHETTELS: Well, as far as infomercials go, it's been a really good infomercial. But tonight I'm looking for George Bush to say some specific things to prove to me that this inclusiveness in his overall image at the convention is real, like he's -- there's been no mention of health care. There's been no mention at this convention about gun control. FLOCK: Is there anything he could say to change your mind about him? SCHETTELS: I don't know if he could dance that fast. FLOCK: Very good. We will keep listening here in Kansas City. A lot of people want to hear what George W. Bush has to say tonight. We'll be back. Jeff Flock, reporting live from Kansas City. WOODRUFF: All right, Jeff Flock, very interesting to hear what the -- those folks are saying out there. Let's go down to the floor right now to John King. KING: Here we go. We're down here on the floor. Whoop, let this gentleman pass through. We like to think that are wireless microphones are high tech, but down here on the floor we're seeing a whole array of interesting new devises: 360 degree cameras broadcasting this convention live on the Web. But we haven't seen anything quite like this: Brian Davis -- Mark Watson and Brian Davis -- oop, got that backwards. OK, Mark Davis of InsightMag.com, tell me what all this is MARK DAVIS, INSIGHT.COM: Well, we're doing partnership with Apple Computers and Xybernaut, and we're doing a Webcast, live streaming to the Web from the convention floor. We're trying to show our viewers at home what actually goes on at the convention and give them a feel what it feels like to be here. KING: Explain to me what all this headgear is? DAVIS: What I've got right in front of my face is a screen, a little miniature computer screen. I can see exactly what I'm filming. We're running Windows 98 on this system, and then right here I've got a Web cam. This what actually sends the picture up to the web. And on my wrist, a keyboard, so I can type in messages. KING: Now, do you -- is this interactive? Are people asking you for any information, people on your site? DAVIS: It's not interactive right now, although we do have an ear piece that can plug in here so that people can communicate. KING: Now, you seem to have the easy job: You walk around with the microphone. What do you do with that? BRIAN WATSON, INSIGHT.COM: I walk around with a microphone, and what we do is he'll be guiding me around. We'll go into different delegations. I'll ask questions. I'm kind of the narrator: You know, I'll ask different people what they think of the, what they think of the convention about the different speeches. He'll capture it on the film. It's get shot right back onto to the Web. KING: All right. We thank you for your time. This perhaps the most interesting device we have seen down here on the floor. Back to you in the booth. SHAW: And when we return to Philadelphia, this gentleman, Donald Evans, the chairman of the Bush campaign, will be our guest. We've got quite a few questions to ask you. DONALD EVANS, CHAIRMAN, BUSH CAMPAIGN: Looking forward to it, Bernie. SHAW: Back in a moment. (COMMERCIAL BREAK) (BEGIN VIDEOTAPE) NARRATOR: On day four of the 1956 Republican convention, the delegates gathered in San Francisco cheered President Dwight Eisenhower and Vice President Richard Nixon as they accepted renomination. There had been minor objection to Nixon's candidacy, and some delegates had worried that Eisenhower wasn't healthy enough to run again and serve again. He had had a heart attack, in 1955 and an operation not long before the convention, but he recovered well. Tennessee delegate Guy Harwood (ph) said he would bet $5,000 Eisenhower would live out a second term. Delegates took the bet by renominating him unanimously. They'd go on to beat the challenge from Adlai Stevenson and Estes Kefauver. (END VIDEOTAPE) SHAW: Bush campaign chairman Donald Evans is here. You have just come from where and what is he doing there? EVANS: He's getting ready for tonight, the night of his life. He's getting ready to come into this hall and tell the American people, what I've known for over 25 years. And this is -- this is a great friend of mine, he's an extraordinary leader, and he love's America and he love's all Americans. And they're going to learn that tonight. SHAW: He's still working on his speech, right now, as we speak? EVANS: Well, I don't know. I don't think he's still working on it right now. He's probably thinking about it a little bit, Bernie. But he's ready. He's ready for tonight. (CROSSTALK) WOODRUFF: So many people who would be in this position, of being nominated by their political party to run for president, would have been in politics for years and years, for decades. I mean, we've seen men come to this podium who have spent more than half a lifetime here. Just 10 years ago, 15 years ago, certainly, Governor Bush didn't really know he was even going to run for governor of Texas, much less think he was going to be here. GREENFIELD: What does that tell you? EVANS: Well... SHAW: What does that tell you? EVANS: Well, you know, he ran for Congress in 1978, after we both moved to Midland in '75. And the first time I knew -- I met George W. Bush, I knew that he was going to serve the public in some kind of way. He just could -- knew that was going to be a part of his life. And the first opportunity was in 1978, congressional seat opened up, that George Mahon had held for some 40 years. And in politics, timing is everything. You never know when your opportunity is going to come along. But I know that he knew in his heart that some day he would like to be a public servant. And so, tried in '78, it didn't work, but then another opportunity arrived in 1993. He probably got a little taste of it in helping his father run in 1987 and 1988 in that successful campaign. But in 1993, he said, \"I can make a difference in the state of Texas.\" Texas had some problems that were on his mind, like education. And so, he made a decision to run. WOODRUFF: He selected a running mate, who, of course, had spent many years here -- not here, but I mean in Washington, in Congress, secretary of defense, and so on. EVANS: Right. WOODRUFF: Was -- how much was that a factor? EVANS: Well, Judy, I tell you this, he made the decision based on who was -- who could best help him serve America. Who was it that he could have at his side that would best help him serve this great country and lead this great country? And when he looked at those many very qualified candidates that he thought of, Dick Cheney was the man, that he obviously got to know even better during the course of the -- of the effort to select a vice president. And in the governor's heart, he said, \"This is the man that I want at my side.\" And did his years of public service as a dedicated steward of this country's great resources influence his decision? Of course, it did. Did his service with his father during his father's administration and the great Gulf War influence his decision? Of course, it did. GREENFIELD: It's been written that if George W. Bush becomes president, he will have done so with the thinnest resume of almost any president of our time. Four years, in terms of public service -- four years and one year as a governor of a state with a weak executive. Is that something that should concern the voter? That is, I assume the questions he will have to answer between now and November is in character and temperament and issues. Is he ready? How concerned should we be about that? EVANS: Well, not at all. Of course, look at his record in the state of Texas. The same thing was said when he ran for governor in 1994 against a very popular governor. But he was worried about the education system in our state. And he pledged to the people of Texas that if you elect me governor, I'm going to fix the education system in our state and I'm going to reach across party lines to fix the education system in the state of Texas. And indeed, he did. And I'm sure people saw in the Rand study that came out just this past week, Texas was ranked number one in terms of improvement in education in their state, particularly among minorities. So, you know, no. It's not something that -- he's ready to lead America. He's ready to lift the spirits of America. So it's not that -- it should not be a concern at all. And as I said, all they need -- people of this country need to do is look at his record in Texas and what he accomplished there. SHAW: One record was a fund-raising record set in the primary season. We had a report from our man Brooks Jackson, who is crunching the numbers. You probably saw that piece earlier this evening in our opening coverage. How much money do you expect you will have to raise to defeat the Democratic ticket, your stated mission? EVANS: We're going to have to receive more votes than they receive. When I think about our efforts over the last 15 months, what I think about is people all across this country that have said to me that, \"My country needs me and I know it. I'm going to do something about it.\" And they wanted to serve and serve their country. And they -- over 300,000 people have participated in our campaign by making contributions, financial contributions, to the campaign. And as far as how much money we'll need to raise, you get a set amount of money. You get $68 million from the federal government and then each party gives their respective candidate about $14 million. So each candidate will have $82 million to spend in the general. WOODRUFF: Does this administration deserve credit at all for the prosperity this country's enjoying? EVANS: The people of this country deserve credits for the prosperity in America. And I think you can go back in the Reagan years and some of the policies that were implemented in the 1980s and, not only through the '80s, but in the early '90s. But it's the American people that deserve the credit for the prosperity in this great country. Is it important for there to be a... WOODRUFF: But, I mean, should the people be blamed when there's a recession? I mean... EVANS: Well, you know, I would say to you that the technology industry has made a major contribution, I think, in this great country in the last 10 years in improving productivity. I think that you do -- over decades, you'll see this country go through economic cycles. But, you know, I don't think any administration, Republican or Democrat, should ever take credit for, you know, a prosperous time. I mean, I think you can give the credit to the people. GREENFIELD: Thank you for joining us, Mr. Chairman. EVANS: You bet. GREENFIELD: We appreciate it. I think if you had said that Bill Clinton was solely responsible for this recovery... EVANS: You'd been surprised. SHAW: ... we'd have a heck of a story. WOODRUFF: You might be a former chairman. EVANS: Right. Exactly. GREENFIELD: Speaking of the Bushes, we're going to go down on the floor quickly to Jeanne Meserve, who is with the governor of Florida, another Bush -- Jeanne. MESERVE: Hi, I'm down here with Jeb Bush, Gov. Jeb Bush of the state of Florida. How does it feel to be in this situation, about to cast Florida's votes for your brother? J. BUSH: Well, I'm full of emotion, full of pride, full of admiration for my brother, and also a little nervous for my son who's going to speak about 9:05 or something like that. This is a family affair, it's also something that's really important for me. I believe in the principles of our party and I'm pretty excited that my brother may have a pretty good chance of being president. MESERVE: Have you visited with him this evening? What's going through his head? How's he feeling? J. BUSH: I talked to him earlier, this morning, and just told him I was praying for him and I knew he was going to do great and that I loved him. He doesn't need any micro-management. He's going to do well, he's going to be great. MESERVE: Can you give us the highlights of the speech? J. BUSH: Well, I think he's going to talk directly to the people of the country and speak from his heart about what's on his mind about how we need to restore stability to politics and move this country forward. And I think he'll do great. MESERVE: Thanks so much, Governor Jeb Bush of Florida. Back to you in the booth. GREENFIELD: OK, thank you, Jeanne. When we come back in a moment, we're going to take another visit to one of the delegates at this convention, in a moment. (COMMERCIAL BREAK) GREENFIELD: Those folks on the floor include 2.066 delegates, who's votes made George Bush the Republican presidential nominee. Throughout this convention, I've been profiling the delegates, showing the wide variety of backgrounds they've come from and the drives that have brought them here. I want to introduce you now to a delegate who's philosophy and political passion was shaped by his childhood, by his work and by war. (BEGIN VIDEOTAPE) BOB MARTINEZ, COLORADO DELEGATE: You can see how relaxing it is up here. It's just fabulous. Just look at those mountains. You get tired of fishing, you just look at nature around you, and take a deep breath. GREENFIELD (voice-over): For 57-year-old Bob Martinez, a Rocky Mountain high isn't a line from a song; it is what he finds on Dillon Lake, high up in the Rockies. MARTINEZ: We have a lot of boat stories where my dad had a string of fish on the back, and he forgot and backed up with his motor and pureed all fish in lake. GREENFIELD: His home, heart and construction business are in Colorado, where he's lived for 23 years. MARTINEZ: I want to show you these diggers over here. GREENFIELD: His childhood was spent in New Mexico, where his earliest political memories are of a passionately loyal Republican grandfather. MARTINEZ: Actually, I think he listening to the Democrat convention, because I remember him saying something about, \"Give them hell, Harry?\" He didn't say that; he was upset that they were saying that. GREENFIELD: But if his grandfather planted seeds of political interest and an appreciation of their Hispanic heritage, it was his years in Vietnam and his travels that fueled both his patriotism and his political interest. MARTINEZ: I saw a breakdown in the whole character of the military at that time. Discipline was just falling apart. Morale was falling apart. And if it was happening in the United States military, I was thinking, what's happening in society as a whole? And it scared me, to be honest with you, so I really felt like I needed to get involved. GREENFIELD: So he moved to Colorado and built his successful business. MARTINEZ: Again, this is Bob Martinez, Great Southwestern Construction. GREENFIELD: And raised a family. He has four children, including daughter Courtney, who owns this deli in Castle Rock. MARTINEZ: We're here for lunch. You know what day today is? COURTNEY MARTINEZ, DAUGHTER: Your birthday. MARTINEZ: That's right. COURTNEY MARTINEZ: Happy birthday, dad. MARTINEZ: Good, thank you. COURTNEY MARTINEZ: And he threw himself into grassroots political work. MARTINEZ: Stuffed envelopes, called mailing lists, called people, encouraged them to vote. GREENFIELD: Decades of work for the Republican National Hispanic Assembly earned Martinez recognition with important leaders, but he says the motive for the work runs far deeper than an award or handshake with a leader. MARTINEZ: I think we've lost focus of the big picture and really, what we as a country have accomplished in just 200 years, and what that means to the individual. And I'll tell you, somebody that could probably express it better than I could would be a recent immigrant to this country that could really see the difference between the freedoms we have here and the freedoms they don't have in the countries they come from. GREENFIELD: The work brought him to GOP convention in 1984 -- he hasn't missed one since. MARTINEZ: It's like a happening, you know what I mean, of thousands of people, from all over country coming together, and talking politics and getting to know each other, and asking about, well, how do things in such and such state and things like that, so it's a lot of fun. GREENFIELD: And it was at New Orleans convention in 1988 where he saw someone waving a flag that the links between Bob Martinez's love of politics and love of country came together in a moment that still fills him with emotion. MARTINEZ: He had an American flag, and he was just waving it back and forth, just, you know, really vigorously, and I got choked up. I got choked up. It just really affected me. To see somebody like that so vigorously waving it, and obviously very proud, and just being happy about the situation and having pride in this country. I just have immense pride in the system, the people, the whole country. I just can truly say I love it. (END VIDEOTAPE) GREENFIELD: Frank Sesno is down on convention floor in the Colorado delegation with Bob Martinez -- Frank. SESNO: A very proud looking Bob Martinez. We heard in Jeff Greenfield's piece you've been coming to these conventions since 1984. What makes this one different, and what keeps you motivated pumped up? MARTINEZ: Well, you know, it's always a great honor and privilege to be here representing the state of Colorado. A lot of people don't realize it's a lot of work to get to one of these things. You have to be elected at your precinct caucus, then your district, then your county, and then the state. A lot of work goes into it, but you know, you just get really proud to be here, and there is a left emotional speeches that go on, things like that. SESNO: Do you ever feel just a twinge of that cynicism we hear about so much, that voters supposedly feel, that system is broken, not responsive? MARTINEZ: No, if you're involved in it, you don't feel that, and that's one of the things that we need to get to fix really. We need to get people encouraged to get involved, to work for the candidate that they want to support. We need to revise the primaries so that we allow people to get involved in caucuses, and not just have primaries, because in primaries, you know, you really don't get to know the candidate. All you see is a 30-second soundbite, and that's not representative of the man. SESNO: Bob Martinez, thanks very much. Have fun. Back to the booth. GREENFIELD: Thank you, Frank, and thank you, Mr. Martinez. We are about three-quarters of the way through the roll call. In case you think George Bush has already been nominated, well he has, but every state gets it chance for its 15 seconds, or 15 minutes of fame in front of that microphone. We are a little more than an hour and a half away from George W. Bush's acceptance speech. We are a little more than a half hour away from the first of two live \"LARRY KING LIVES.\" At the 9:00 hour Eastern Time, Larry will feature New York Mayor Rudy Giuliani, Neal, and Doro and Marvin Bush, Florida Gov. Jeb Bush, as well as three of the children of President Gerald Ford, who is recooperateing from a small stroke, former Housing Secretary Jack Kemp, and former governor of Texas, the man George W. Bush beat, Ann Richards. We'll be back in just a moment. (COMMERCIAL BREAK) (BEGIN VIDEOTAPE) NARRATOR: On the last day of the 1964 Republican convention in San Francisco, delegates confirmed New York Representative William Miller as Barry Goldwater's running mate. Miller got all but three of the 1,308 delegate votes, and became the first Roman Catholic on a Republican presidential ticket. Goldwater himself accepted the nomination with a speech that remains most famous. (BEGIN VIDEO CLIP, 1968) BARRY GOLDWATER, FORMER PRESIDENTIAL CANDIDATE: Extremism in the defense of liberty is no vice. (END VIDEO CLIP) UNIDENTIFIED CNN CORRESPONDENT \"And moderation in the pursuit of justice,\" he said, \"is no virtue.\" (END VIDEOTAPE) WOODRUFF: We've been talking this week about how this convention's different from other Republican conventions, because instead of having the roll call on one dramatic night, they have broken it up among four nights this week. Tonight, they are continuing, and they are finishing the roll call of the states, the night after George W. Bush was put over the top and nominated by the Republican Party. So if you're sitting out there wondering, wait a minute, I thought he was nominated last night, the fact was he was, but they want to get all the states in. GREENFIELD: And guess which state goes last. WOODRUFF: Guess which state goes last -- Bernie. SHAW: Preceded by California. California, and then Texas, of course. GREENFIELD: I'm sorry, Bernie. Go ahead. SHAW: There is something, what? GREENFIELD: Well, it's very interesting, this very tightly controlled convention, as you've been hearing, probably ad infinitum, they've got to make sure that Governor Bush's speech gets off by the end of primetime. This is the night that all the broadcast networks show up, as well as us, and... WOODRUFF: We were just told by campaign chairman Don Evans that they discovered that Dick Cheney's speech, with the applause, went about 10 minutes longer than they had planned, and the last they want is for these very important speeches to go beyond the 11:00, the bewitching hour, when people start turning off their sets and start going to asleep. They want people awake and paying attention for every word coming out of governor's mouth. SHAW: And the audience here, as well as you, wherever you're watching CNN's live coverage around the world, will hear from another Bush before the governor, Nephew George P. Bush. He'll be speaking to these delegates, two minutes in Spanish, on the inclusion and the challenges facing young people. WOODRUFF: We've been showing pictures, I know you saw it just a moment ago, of Governor Bush's parents, President George Bush and Barbara Bush. There they are again. They are surrounded by members of the Bush... SHAW: Look at Bush having fun. WOODRUFF: He has some of his grandchildren sitting in front of him. And there is the sister, Governor Bush's sister, Doro Bush, and then some of the grandchildren in front. Looks like they're having a little bit of fun. SHAW: Do you suppose that Al Gore out there on that North Carolina beach is tuned into CNN watching what these Republicans are doing? WOODRUFF: I don't know whether he's watching CNN, he certainly should be, but I bet he is watching. Wouldn't you want to know what the opposition is doing? GREENFIELD: Yes, these political folks sometimes say no, you know, I wasn't watching the convention, I was reading the Constitution, or you know, building sand castles, but something tells me that anybody in public life might be fairly curious to see what was going on at the convention that was nominating his opponent. And on top of that, he's got a deadline to meet of less than a week when he is supposed to tell us who his vice president is going to be. WOODRUFF: That's right. It's next Tuesday. This is Thursday night. And he's got to make that decision. Everything has got to be in place. SHAW: And John King might be on the floor of this convention hall, but believe me, he has many ways of finding out what's the thinking, the latest thinking in the Gore campaign. John, there you are? KING: That's right, Bernie, behind some Texas cowboy hats at the moment, as they celebrate Governor Bush's roll call here. After Governor Bush's speech tonight, the next big event in this campaign will be Vice President Al Gore's choice of a running mate. Sources telling CNN, the vice president is closing in on that decision. His aides insist he hasn't quite made it yet, but they do tell us he's operating off a short list of four Democratic members of the United States Senate. They are John Kerry of Massachusetts, John Edwards of North Carolina, Evan Bayh of the state of Indiana -- he's a former governor as well -- and Joseph Lieberman of Connecticut. Also on that list, we're told, the New Hampshire Governor Jeanne Shaheen, although she said again today, that she's not interested. She's in a very tough re-election battle right now. And perhaps the wild card on this list, the House Democratic leader Dick Gephardt of Missouri. He has repeatedly told the vice president he is not interested, that he wants to focus on winning back the House of Representatives for the Democrats, but the vice president is keeping him on the list, because Mr. Gephardt has not said that he would say no if asked. And some believe if that Governor Bush gets a big bounce out of this convention, the vice president might want to turn to somebody who is tested in national politics -- an announcement scheduled for next Tuesday, although we expect perhaps some more clues to the vice president's thinking to come clear over the weekend. Back to you in the booth. GREENFIELD: Thank you, John. We are going to ask that question about Al Gore's running mate and some others to a man who will join us in a minute, the majordomo of the Bush campaign, Karl Rove. He is with us, and (UNINTELLIGIBLE) in a second. (COMMERCIAL BREAK) WOODRUFF: Bush campaign manager Karl Rove joins us in the booth. But before we talk to him, just a few moments ago, as these delegates moved on with this roll call, there was kind of a fun moment when they got to the state of Florida -- Jeanne Meserve. MESERVE: That's right. Jeb Bush, the governor here, and brother of the nominee, cast Florida's 80 votes and he did it in a way that anyone with a brother will appreciate. (BEGIN VIDEO CLIP) J. BUSH: My name is Jeb Bush. I'm the governor of the great Sunshine State of Florida. (CHEERING) Florida, the land of no income tax, where we are building entrepreneurial heaven, the tourist capital of the world, with the best citrus and the greatest place to live -- also has a unique aspect of all of this is that the governor of the state, and perhaps the governor of the state of Texas, is the only person on this floor that has had his mouth washed out by the greatest, most popular woman in the world, been spanked by a president of the United States, and has gotten a wedgie from the next president of the United States. Florida proudly casts its vote, its 80 delegates, to a man that I love, admire and respect, George W. Bush (END VIDEO CLIP) WOODRUFF: So, now we know about corporal punishment inside the Bush household, Karl Rove. KARL ROVE, BUSH CAMPAIGN SENIOR STRATEGIST: More importantly, we know who got the wed", "images": ["http://i.cnn.net/cnn/images/main/fn.logo.newsnet.gif", "http://i.cnn.net/cnn/images/0010/network.airport.gif", "http://i.cnn.net/cnn/images/spacer.gif", "http://www.cnn.com/images/hub2000/CNN.com.news.net2.gif", "http://i.cnn.net/cnn/images/hub2000/cnn.com.logo.w.gray.top.gif", "http://i.cnn.net/cnn/images/hub2000/1.gif", "http://www.cnn.com/images/1999/09/up.gif", "http://www.cnn.com/images/1999/09/down.gif", "http://i.cnn.net/cnn/images/main/si.logo.gif", "http://www.cnn.com/images/hub2000/divider1.gif", "http://www.cnn.com/images/hub2000/1.gif", "http://www.cnn.com/TRANSCRIPTS/images/transcripts.head.jpg", "http://www.cnn.com/images/1998/05/homepage/ad.info.gif", "http://i.cnn.net/cnn/images/icons/arrow.gif", "http://www.cnn.com/images/icons/popup.gif", "http://i.cnn.net/cnn/images/1999/07/cnn.com.logo.gif", "http://i.cnn.net/cnn/images/1999/09/cnn.website.gif", "http://www.cnn.com/cookie.crumb"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "Special Event: Republican National Convention Prepares for George W. Bush's Acceptance Speech", "meta_data": {}, "movies": [], "publish_date": null, "source": "http://www.cnn.com", "summary": ""}