{"url": "https://www.j-14.com/posts/drake-rihanna-reunited-childs-birthday-party-129803/", "text": "Former celebrity couple Rihanna and Drake bumped into each other at a child's birthday party in Los Angles and things got awkward.\n\nIn a now deleted Snapchat, RiRi is seen walking around the party, playing with the kids in a ball pit and laughing with friends. Drake was also caught on video hanging out and enjoying the day. The one thing that didn't happen is any interaction between the two – publicly at least. To be honest, we're not totally surprised. What would YOU do if you ran into an ex at an intimate gathering? Probably the same thing these two did and that is avoid each other at all costs.\n\nRELATED: Drake Admits That He Still Loves Rihanna\n\nThe Shade Room posted a few seconds of the footage with the caption, \"#PressPlay #Rihanna and #Drake were spotted at a kids party today! They arrived separately, Riri came with her bestie. Drake looks like he was caught off guard ??.\"\n\nRihanna and Drake have known each other for a long time and he's professed his love for the songstress more than once. Most notably at the 2016 MTV Video Music Awards when the \"One Dance\" singer presented Rihanna with the Video Vanguard Award. There was speculation that these two were dating at the time. After the show, they were seen getting dinner alone.\n\nHowever, things reportedly fizzled out and no one really knows what went down between them. In August, a source told E! News, \"Rihanna and Drake are seeing other people at the moment. They are not exclusive anymore. They still love each other, but their schedules have gotten in the way. Anything can change between them though, for better or worse. They are still in each other's lives.\"\n\nRELATED: Drake Reveals the Most Unexpected Birthday Surprise\n\nSince then, Drake has been romantically linked to India Love and Jennifer Lopez while Rihanna has stayed publicly single. Clearly, things have changed between them considering how little time they spent together at the birthday bash.\n\nNo one is quite sure what their status is and if they even acknowledged each other at the gathering. However, we do know that these two are just living their lives exactly like they want at the moment. Both focusing on their careers, friends and family. Because there is so much history between them, we have a feeling these two will be seen hanging out together sooner rather than later. But this birthday party definitely wasn't the place to do that.\n\nRELATED: Here's Why Everyone Thought Drake and Rihanna Were So in Love\n\nLove J-14? Be sure to subscribe to our YouTube channel for fun, exclusive videos with your favorite stars.", "images": ["https://www.j-14.com/wp-content/uploads/2017/04/rihanna-drake-1.png?resize=784%2C630&quality=86&strip=all", "https://www.j-14.com/wp-content/uploads/2017/04/rihanna-drake-1.png?fit=784%2C718&quality=86&strip=all", "https://www.j-14.com/wp-content/themes/ami-magazines/assets/build/images/placeholders/placeholder-1x1.svg", "https://www.j-14.com/wp-content/themes/ami-magazines/assets/build/images/placeholders/placeholder-16x9.svg"], "top_img": "https://www.j-14.com/wp-content/uploads/2017/04/rihanna-drake-1.png?resize=784%2C630&quality=86&strip=all", "keywords": [], "authors": ["Alex Riccardi"], "canonical_link": "https://www.j-14.com/posts/drake-rihanna-reunited-childs-birthday-party-129803/", "title": "Drake And Rihanna Reunite At Child's Birthday Party In Los Angeles", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "theme-color": "#ffffff", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Former celebrity couple Rihanna and Drake bumped into each other at a child's birthday party in Los Angles and things got awkward. In a now deleted", "og": {"locale": "en_US", "type": "article", "title": "Rihanna and Drake Reunite", "description": "Former celebrity couple Rihanna and Drake bumped into each other at a child's birthday party in Los Angles and things got awkward. In a now deleted Snapchat, RiRi is seen walking around the...", "url": "https://www.j-14.com/posts/drake-rihanna-reunited-childs-birthday-party-129803/", "site_name": "J-14", "updated_time": "2018-04-03T14:56:18+00:00", "image": {"identifier": "https://www.j-14.com/wp-content/uploads/2017/04/rihanna-drake-1.png?resize=784%2C630&quality=86&strip=all", "secure_url": "https://www.j-14.com/wp-content/uploads/2017/04/rihanna-drake-1.png?resize=784%2C630&quality=86&strip=all", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/j14magazine", "published_time": "2017-04-11T15:01:11+00:00", "modified_time": "2018-04-03T14:56:18+00:00"}, "author": "Alex Riccardi", "twitter": {"card": "summary_large_image", "title": "Rihanna and Drake Reunite", "description": "Former celebrity couple Rihanna and Drake bumped into each other at a child's birthday party in Los Angles and things got awkward. In a now deleted Snapchat, RiRi is seen walking around the...", "image": "https://www.j-14.com/wp-content/uploads/2017/04/rihanna-drake-1.png?resize=784%2C630&quality=86&strip=all", "creator": "@J14Magazine", "site": "@J14Magazine"}, "fb": {"admins": 593583017, "pages": 6338692612}, "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://www.j-14.com/wp-content/uploads/2020/11/android-chrome-144x144-1.png?fit=144%2C144&quality=86&strip=all"}, "movies": [], "publish_date": 1491922871.0, "source": "https://www.j-14.com", "summary": ""}