{"url": "https://www.cnn.com/2018/04/05/entertainment/weinstein-timeline/index.html", "text": "CNN —\n\nHarvey Weinstein, the man once synonymous with Hollywood whose alleged behavior started one of the most important conversations in the industry’s history, began his epic fall from power one year ago.\n\nIt all started with a few brave women coming forward about mistreatment at the hands of the Oscar-winning producer.\n\nAs it stands, the allegations against Weinstein range from harassment to rape, include the stories of more than 80 women and span several decades. (Through a spokesperson, Weinstein has repeatedly denied “any allegations of non-consensual sex.”)\n\nHe has pleaded not guilty to six sex crime charges in New York, including two counts of rape.\n\nWeinstein remains under investigation by authorities in Los Angeles and London.\n\nThe stories about Weinstein’s alleged mistreatment snowballed into a movement against abuse that reverberated across industries.\n\nTo date, thousands of people have raised their voices to say, “me too.” Dozens of once powerful men – from celebrities to political figures – have been held accountable for mistreatment. Many continue to vehemently fight charges of misconduct.\n\nOne year later, the movement to end mistreatment is larger, stronger and more vocal than ever, with the hope being that at least one industry will never be the same.\n\nRead more: Sexual consent is a worldwide conversation\n\nBelow is a timeline of some of the fallout since the Weinstein scandal began.\n\nOctober 5\n\nThe New York Times publishes a story detailing numerous accusations of sexual harassment against movie producer Harvey Weinstein. One of Weinstein’s accusers is actress Ashley Judd.\n\n“Women have been talking about Harvey amongst ourselves for a long time, and it’s simply beyond time to have the conversation publicly,” Judd told the Times.\n\nIn response, Weinstein issues a statement and announces his leave of absence from The Weinstein Company.\n\n“I appreciate the way I’ve behaved with colleagues in the past has caused a lot of pain, and I sincerely apologize for it,” the statement read in part.\n\nOctober 8\n\nWeinstein is fired by The Weinstein Company, which he co-founded with his brother Bob in 2005. The board cites “new information about misconduct by Harvey Weinstein that has emerged in the past few days” as the reason for his termination.\n\nOctober 10\n\nWeinstein is accused of rape by multiple women in an explosive story by Ronan Farrow for The New Yorker.\n\nThe story, 10 months in the making, also included new allegations of harassment and other improper behavior – along with assertions that people at Weinstein’s film company knew about his misconduct.\n\nLater that day, The New York Times publishes a followup story with quotes from Gwyneth Paltrow, Angelina Jolie and other Hollywood actresses with allegations against Weinstein.\n\nWeinstein issues his first of what would be several denials of “non-consensual sex.”\n\nOctober 14\n\nWeinstein is ousted from the Academy of Motion Pictures Arts and Sciences.\n\nIn a statement, the Academy said the action was intended “not simply to separate ourselves from someone who does not merit the respect of his colleagues but also to send a message that the era of willful ignorance and shameful complicity in sexually predatory behavior and workplace harassment in our industry is over.”\n\nIn the coming weeks, the Directors Guild of America, the Producers Guild of America and the British Academy of Film and Television Arts would all take steps to distance themselves from Weinstein.\n\nOctober 15\n\nAlyssa Milano tweets a note reading, “Suggested by a friend: If all the women who have been sexually harassed or assaulted wrote ‘Me too’ as a status, we might give people a sense of the magnitude of the problem.” #MeToo, created more than a decade earlier by civil rights activist Tarana Burke to increase awareness of the sexual abuse of young women of color, becomes a viral campaign.\n\nOctober 19\n\nThe Los Angeles Police Department opens an investigation into an alleged 2013 sexual assault involving Weinstein and an accuser who asked to remain anonymous.\n\nLaw enforcement in London and New York also investigate alleged sex crimes by Weinstein.\n\nOctober 25\n\n“Game Change” co-author and journalist Mark Halperin is accused of sexual harassment by former female colleagues at ABC News.\n\n“During this period, I did pursue relationships with women that I worked with, including some junior to me,” Halperin said in a statement to CNN.\n\n“I now understand from these accounts that my behavior was inappropriate and caused others pain. For that, I am deeply sorry and I apologize. Under the circumstances, I’m going to take a step back from my day-to-day work while I properly deal with this situation.”\n\nNBC News, where Halperin was a contributor, would cut ties with him days later.\n\nOctober 29\n\nActor Anthony Rapp accuses Kevin Spacey of making a sexual advance at him when Rapp was 14 in a report published by Buzzfeed. Spacey responds via Twitter, saying he did not recall the alleged incident with Rapp. He apologizes for what he said would have been “deeply inappropriate drunken behavior.”\n\nKevin Spacey Kris Connor/Getty Images\n\nSpacey was fired from his television series, “House of Cards,” and has not spoken publicly since.\n\nNovember 1\n\nDirector and producer Brett Ratner is accused of sexual misconduct by Olivia Munn and five other women in a report published by The Los Angeles Times. The allegations range from sexual harassment to assault.\n\nRatner’s attorney Martin Singer says the director “vehemently denies” the allegations.\n\nNovember 9\n\nComedian Louis C.K. is accused of sexual misconduct by five women in a New York Times report, including allegations that he masturbated in front of them.\n\nLouis C.K. Ben Gabbe/Tribeca TV Fest/Getty Images\n\nNovember 10\n\nLouis C.K. releases a statement in response to the allegations.\n\n“These stories are true. At the time, I said to myself that what I did was okay because I never showed a woman my dick without asking first, which is also true,” the comedian wrote. “But what I learned later in life, too late, is that when you have power over another person, asking them to look at your dick isn’t a question. It’s a predicament for them. The power I had over these women is that they admired me. And I wielded that power irresponsibly.”\n\nIn August, the comedian performed his first stand-up set since the allegations first surfaced.\n\nNovember 21\n\nCBS and PBS cuts ties with host Charlie Rose after The Washington Post publishes claims of sexual harassment by eight women.\n\nBloomberg, which aired Rose’s eponymous interview program, also ended its business relationship with Rose.\n\nRose said in a statement that he “deeply apologized” for what he admitted was “inappropriate behavior,” but said he did “not believe that all of [the] allegations are accurate.”\n\nIn December, PBS gave CNN’s Christiane Amanpour her own show as an interim replacement for Rose.\n\nNovember 29\n\nMinnesota Public Radio terminates its contracts with Garrison Keillor, a fixture of public radio and the creator of “A Prairie Home Companion,” citing allegations of misconduct.\n\n“I’ve been fired over a story that I think is more interesting and more complicated than the version MPR heard,” Keillor said in a statement. “It’s some sort of poetic irony to be knocked off the air by a story, having told so many of them myself, but I’m 75 and don’t have any interest in arguing about this.”\n\nOn the same day, Savannah Guthrie announces on the “Today” show that Matt Lauer has been fired by NBC News after an employee filed a complaint about “inappropriate sexual behavior in the workplace,” according to the network.\n\n“We are devastated,” Guthrie said.\n\nNovember 30\n\nA day after he is fired, Matt Lauer issues an apology.\n\n“There are no words to express my sorrow and regret for the pain I have caused others by words and actions,” Lauer said in a statement provided to CNN. “Some of what is being said about me is untrue or mischaracterized, but there is enough truth in these stories to make me feel embarrassed and ashamed. I regret that my shame is now shared by the people I cherish dearly.”\n\nMatt Lauer NBC/NBCUniversal/NBCU Photo Bank via Getty Images\n\nOn the same day, Russell Simmons announces he is stepping down from his companies in the wake of an accusation of harassment and sexual assault by screenwriter Jenny Lumet in a guest column published by The Hollywood Reporter.\n\n“I know Jenny and her family and have seen her several times over the years since the evening she described. While her memory of that evening is very different from mine, it is now clear to me that her feelings of fear and intimidation are real,” Simmons writes in a statement. “While I have never been violent, I have been thoughtless and insensitive in some of my relationships over many decades and I sincerely and humbly apologize.”\n\nDecember 6\n\nTime magazine names “The Silence Breakers,” representing people who came forward to report sexual misconduct, as its Person of the Year.\n\n“These silence breakers have started a revolution of refusal, gathering strength by the day,” read an excerpt from the piece. “Their collective anger has spurred immediate and shocking results: nearly every day, CEOs have been fired, moguls toppled, icons disgraced. In some cases, criminal charges have been brought.”\n\nTime's 2017 'Person of the Year' cover TIME Magazine\n\nDecember 7\n\nDemocratic Sen. Al Franken of Minnesota resigns from Congress following allegations of sexual harassment.\n\n“I, of all people, am aware that there is some irony in the fact that I am leaving while a man who has bragged on tape about his history of sexual assault sits in the Oval Office,” Franken says in his resignation speech.\n\nFranken had previously said he was “embarrassed and ashamed.”\n\nDecember 11\n\nCelebrity chef Mario Batali steps away from his restaurant business and ABC television show amid allegations of sexual misconduct, following an investigation by online publication Eater.\n\nBatali issues an apology to “the people I have mistreated and hurt.”\n\n“That behavior was wrong and there are no excuses,” he says. “I take full responsibility and am deeply sorry for any pain, humiliation or discomfort I have caused to my peers, employees, customers, friends and family.”\n\nMario Batali Laura Cavanaugh/FilmMagic/Getty Images\n\nJanuary 1\n\nA group of more than 1,000 women in entertainment announce the launch of Time’s Up, a comprehensive plan to combat sexual assault, harassment and inequality in the workplace. Director Ava DuVernay, producer Kathleen Kennedy and dozens of actors, including America Ferrera, Emma Stone and Constance Wu, outline the mission of Time’s Up in an open letter.\n\n“We want all survivors of sexual harassment, everywhere, to be heard, to be believed, and to know that accountability is possible,” the letter read in part.\n\nJanuary 7\n\nBlack dresses rule the red carpet at the 75th Golden Globe Awards in a show of solidarity for the Time’s Up mission.\n\nOprah Winfrey accepts the Cecil B. DeMille Award at the Globes and gives a rousing speech in support of the #MeToo movement. The media mogul’s message came during a ceremony notable for being the first major awards show since Hollywood began addressing sexual abuse in the entertainment industry and beyond.\n\n“I want all the girls watching here, now, to know that a new day is on the horizon,” Winfrey tells the crowd. “And when that new day finally dawns, it will be because of a lot of magnificent women, many of whom are right here in this room tonight, and some pretty phenomenal men, fighting hard to make sure that they become the leaders who take us to the time when nobody ever has to say ‘me too’ again.”\n\nOprah Winfrey onstage during the 75th Annual Golden Globe Awards. Paul Drinkwater/NBCUniversal/Getty Images\n\nJanuary 11\n\nThe Los Angeles Times publishes a story in which five women allege they experienced inappropriate and sometimes sexually exploitative behavior by actor James Franco.\n\n“If I’ve done something wrong, I will fix it,” Franco says of the allegations.\n\nJanuary 16\n\nAziz Ansari responds to an accusation of sexual assault made by a woman with whom he went on a date the year prior by saying he believed their encounter had been “completely consensual.”\n\nThe woman, a 23-year-old photographer, had shared her account with the website Babe anonymously, the day prior.\n\nThe accusations against Ansari caused disagreement among many, including supporters of the Time’s Up and #MeToo movements, with debate around the nuances of consent.\n\nFebruary 6\n\nUma Thurman recounts to the New York Times a series of disturbing incidents involving Weinstein, including an alleged assault in a London hotel room.\n\nHer interview also sparks a conversation about on-set power dynamics, after she recalled an incident in which she was coerced into doing a dangerous stunt by director Quentin Tarantino. She described the event as “dehumanization to the point of death.”\n\nTarantino calls the incident “one of the biggest regrets” of his life in an interview with Deadline.\n\nFebruary 11\n\nNew York Attorney General Eric Schneiderman files a lawsuit against Weinstein and The Weinstein Company, effectively pausing plans for the company’s sale to a group of investors led by Maria Contreras-Sweet.\n\n“Weinstein Company leadership was complicit in Harvey Weinstein’s wrongdoing,” Schneiderman writes on Twitter the day after filing the suit. “They knew what was happening. They knew how pervasive it was. And yet they did nothing.”\n\nFebruary 17\n\nThe Weinstein Company terminates David Glasser, a top executive who had been in charge of running the studio along with Harvey and Bob Weinstein.\n\nGlasser was fired in response to some of the allegations contained in Schneiderman’s lawsuit, sources told CNN.\n\nGlasser responds with a wrongful termination claim. In a February statement to Variety, his attorney Eve Wagner said “the board had no grounds to justify his firing.”\n\n“Through this lawsuit, we intend to bring to light facts and evidence to demonstrate that the board acted precipitously and with malice. We are confident that a complete airing of all of the evidence will show that our client was scapegoated by the TWC Board of Directors,” Wagner added.\n\nMarch 2\n\nThe Weinstein Company strikes a $500 million deal to sell its assets to Contreras-Sweet and investors.\n\nDays later, the deal falls apart, and bankruptcy becomes imminent.\n\nMarch 4\n\nOscars host Jimmy Kimmel caps off a loaded awards season with a monologue that praises the Time’s Up movement and roasts Weinstein.\n\n“The only other person to be expelled from the Academy – ever – was a character actor named Carmine Caridi,” Kimmel says. “In 2004 he was kicked out for sharing screeners. Carmine Caridi got the same punishment as Harvey Weinstein for giving his neighbor a copy of ‘Seabiscuit’ on VHS.”\n\nDuring the show, Ashley Judd, Salma Hayek and Annabella Sciorra take the stage to talk about the #MeToo movement and praise the survivors of harassment who have come forward.\n\nAshley Judd, Annabella Sciorra and Salma Hayek speak onstage during the 90th Annual Academy Awards. Kevin Winter/Getty Images\n\n“The changes we are witnessing is being driven by the powerful sound of new voices, of different voices, of our voices, joining together in a mighty chorus that is finally saying, ‘time’s up,’” Judd said.\n\nMarch 19\n\nThe New York State attorney general announces it will review the Manhattan district attorney’s handling of a 2015 sexual abuse case involving disgraced media mogul Harvey Weinstein.\n\nTime’s Up had called for an investigation into DA Cyrus Vance and his office over its decision not to prosecute Weinstein for alleged sex abuse crimes against accuser Ambra Battilana.\n\nLater in the day, The Weinstein Company files for bankruptcy and, in the process, releases all former employees from the legal contracts, or non-disclosure agreements, that kept them from speaking out.\n\n“Effective immediately, those ‘agreements’ end,” the company said in a statement. “No one should be afraid to speak out or coerced to stay quiet,” it added.\n\nBankruptcy attorney Robert Marticello told CNN the Weinstein Company’s decision to release victims from their NDA’s “could be viewed as an attempt to ensure that all of the potential claims are raised and addressed in this bankruptcy case.” He added that victims asserting claims could benefit from the sale of the company’s assets, after others, including creditors and attorneys, are paid from the proceeds.\n\nApril 16\n\nThe New Yorker magazine and The New York Times newspaper receive one of journalism’s highest honors for their reporting on Harvey Weinstein’s alleged systemic abuse of women in the entertainment industry.\n\nThe pair of publications are awarded the Pulitzer Prize for Public Service for their coverage of Weinstein and the #MeToo movement.\n\nApril 30\n\nActress Ashley Judd sues Weinstein, claiming the disgraced former film executive made inflammatory statements about her that hurt her career.\n\nIn court documents obtained by CNN, Judd alleges that Weinstein deterred director Peter Jackson, who oversaw the “Lord of the Rings” trilogy, and his producing partner Fran Walsh from working with Judd on the films, a move that not only “torpedoed” her opportunity to star in the Academy Award-winning franchise but also cost her additional work.\n\n“The pathetic reality, however, was that Weinstein was retaliating against Ms. Judd for rejecting his sexual demands approximately one year earlier, when he cornered her in a hotel room under the guise of discussing business,” the suit states.\n\nJackson first revealed Weinstein’s comments in an interview back in December 2017, months after Weinstein began facing a host of allegations.\n\nA representative for Weinstein also denied the allegations that he smeared Judd’s name.\n\n“The most basic investigation of the facts will reveal that Mr. Weinstein neither defamed Ms. Judd nor ever interfered with Ms. Judd’s career, and instead not only championed her work but also repeatedly approved her casting for two of his movies over the next decade,” a statement from Weinstein’s attorney says.\n\nWeinstein’s lawyers later file a motion asking the courts to dismiss the lawsuit, saying it was “rife with speculation and conclusory allegations.”\n\nMay 8\n\nNew York Attorney General Schneiderman resigns over assault allegations by multiple women.\n\nSchneiderman contests the allegations by four women who accused him of physical violence in a report by The New Yorker.\n\n“In the last several hours, serious allegations, which I strongly contest, have been made against me,” Schneiderman says in a statement. “While these allegations are unrelated to my professional conduct or the operations of the office, they will effectively prevent me from leading the office’s work at this critical time. I therefore resign my office.”\n\nLater, the Manhattan District Attorney’s office announces they have opened an investigation into the allegations against Schneiderman.\n\nMay 11\n\nWeinstein’s estranged wife Georgina Chapman, the co-founder of high-end fashion house, Marchesa, breaks her silence in a Vogue interview.\n\nIn the piece, Chapman claims to have had no knowledge of her husband’s alleged pattern of abuse before the news reports began in October 2017.\n\n“That’s what makes this so incredibly painful: I had what I thought was a very happy marriage. I loved my life.” Chapman said. “Absolutely not [did she suspect him cheating]. Never. For one thing, he traveled constantly. And I’ve never been one of those people who obsesses about where someone is.”\n\nMay 24\n\nActor Morgan Freeman is accused by eight women of engaging in a pattern of alleged inappropriate behavior and harassment in a CNN investigation.\n\nSeveral of the women CNN spoke to said Freeman made frequent comments about their bodies and clothing in incidents that took place on movie sets or at his production company, Revelations Entertainment. Two of those eight said they were subjected to unwanted touching by the actor.\n\nAfter the publication of CNN’s story, Freeman released a statement.\n\n“Anyone who knows me or has worked with me knows I am not someone who would intentionally offend or knowingly make anyone feel uneasy,” he said. “I apologize to anyone who felt uncomfortable or disrespected – that was never my intent.”\n\nMay 25\n\nWeinstein turns himself in to authorities and is arrested, charged with rape, committing a criminal sex act, sexual abuse and sexual misconduct.\n\nThe charges stem from incidents with two separate women, the NYPD says in a statement, and were the result of a joint investigation between police and the Manhattan District Attorney’s office.\n\nHarvey Weinstein’s attorney Benjamin Brafman tells media outside of court in New York that his client intends to enter a plea of not guilty.\n\n“Mr. Weinstein has always maintained that he has never engaged in non-consensual sexual behavior with anyone. Nothing about today’s proceedings changes Mr. Weinstein’s position. He has entered a plea of not guilty and fully expects to be exonerated,” attorney Benjamin Brafman says in a statement after the arraignment.\n\nActress Rose McGowan, one of the first women to publicly accuse Weinstein of assault, tweets her reaction to Weinstein’s arrest, saying, “We got you, Harvey Weinstein, we got you.”\n\nJuly 9\n\nWeinstein pleads not guilty to three additional sex crime charges in New York.\n\nIn all, Weinstein now faces six felony charges relating to three women: two counts of predatory sexual assault, two counts of criminal sexual act in the first degree, and one count each of first-degree rape and third-degree rape. The charges are related to separate incidents in 2004, 2006 and 2013.\n\n“Any suggestion that Mr. Weinstein raped anyone, based on the overwhelming evidence that I have in my possession already, is a ludicrous suggestion, and Mr. Weinstein has of course also vigorously denied that suggestion,” Weinstein attorney Benjamin Brafman tells media outside a Manhattan courthouse.\n\nSeptember 9\n\nOnce again a legendary Hollywood power player is toppled after the publication of a bombshell story by Ronan Farrow.\n\nCBS Corporation announces its longtime chairman and chief executive officer Les Moonves is resigning after additional sexual-harassment charges are leveled against him in a second New Yorker article authored by Farrow.\n\nThe New Yorker had published an expose in July in which multiple women accused Moonves of sexual misconduct over several decades.\n\nThe network had previously issued a statement on Moonves’ behalf saying he denied “any characterization of ‘sexual assault,’ intimidation, or retaliatory action.”\n\nOctober 2\n\nTime’s Up announces that former WNBA president, Lisa Borders, will serve as the organization’s first president and CEO.\n\n“To disrupt and reinvent the ingrained status quo, we will need all hands-on deck to create and sustain enduring change,” Borders says in a statement announcing her new role. “I’m thrilled to lead Time’s Up and I am convinced that together, we will shift the paradigm of workplace culture.”\n\nCNN’s Jason Kravarik contributed to this story.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/170126173139-chloe-melas.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/171026102442-01-mark-halperin.jpg?q=x_84,y_134,h_2354,w_4184,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/180111100214-38-oprah-winfrey.jpg?q=x_3,y_0,h_1684,w_2993,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/171103174148-kevins-spacey-02.jpg?q=x_434,y_659,h_1168,w_2075,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/171206134006-2017-time-person-of-the-year-cover.jpg?q=x_3,y_0,h_1684,w_2993,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/140929104601-lisa-france-profile-image.jpg?q=x_2,y_0,h_898,w_1596,c_crop/h_270,w_480/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/171109141814-01-louis-ck.jpg?q=x_119,y_49,h_1206,w_2144,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/171130124150-11-matt-lauer.jpg?q=x_155,y_507,h_789,w_1402,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180304225222-13-oscars-show-judd-sciorra-hayek.jpg?q=x_0,y_0,h_1687,w_2997,c_fill/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180525103812-20-weinstein-court-0525.jpg?q=x_0,y_0,h_3038,w_5398,c_fill/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/171124210623-uma-thurman-cannes.jpg?q=x_374,y_388,h_1089,w_1936,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/170619101431-sandra-gonzalez.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/171211132920-01-mario-batali-file-restricted.jpg?q=x_11,y_82,h_1255,w_2230,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180115171342-aziz-ansari-responds-to-sexual-assault-allegation.jpg?q=x_6,y_69,h_1684,w_2993,c_crop/h_144,w_256"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/180525103812-20-weinstein-court-0525.jpg?q=x_0,y_0,h_3038,w_5398,c_fill/w_800", "keywords": [], "authors": ["Sandra Gonzalez Lisa Respers France Chloe Melas", "Sandra Gonzalez", "Lisa Respers France", "Chloe Melas"], "canonical_link": "https://www.cnn.com/2018/04/05/entertainment/weinstein-timeline/index.html", "title": "Harvey Weinstein timeline: how Hollywood's biggest scandal unfolded", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "The year since the Weinstein scandal first rocked Hollywood | CNN", "description": "Harvey Weinstein, the man once synonymous with Hollywood whose alleged behavior started one of the most important conversations in the industry's history, began his epic fall from power one year ago.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180525103812-20-weinstein-court-0525.jpg?q=x_0,y_0,h_3038,w_5398,c_fill/w_800", "type": "article", "url": "https://www.cnn.com/2018/04/05/entertainment/weinstein-timeline/index.html", "site_name": "CNN"}, "twitter": {"title": "The year since the Weinstein scandal first rocked Hollywood | CNN", "description": "Harvey Weinstein, the man once synonymous with Hollywood whose alleged behavior started one of the most important conversations in the industry's history, began his epic fall from power one year ago.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180525103812-20-weinstein-court-0525.jpg?q=x_0,y_0,h_3038,w_5398,c_fill/w_800", "card": "summary_large_image", "site": "@CNNent"}, "description": "Harvey Weinstein, the man once synonymous with Hollywood whose alleged behavior started one of the most important conversations in the industry's history, began his epic fall from power one year ago.", "template_type": "article_leaf", "type": "article", "meta-section": "entertainment", "theme": "entertainment", "article": {"published_time": "2018-04-05T14:31:54Z", "modified_time": "2018-10-04T21:47:44Z", "tag": "arts and entertainment, business and industry sectors, business figures, business, economy and trade, celebrity and pop culture, crime, law enforcement and corrections, crimes against persons, criminal offenses, discrimination, females (demographic group), feminism, gender equality, harvey weinstein, media industry, misconduct, movie and video industry, population and demographics, sex and gender issues, sex crimes, sex discrimination, sexual assault, sexual harassment, societal issues, society, time's up movement, celebrities, james franco, apologies, bob weinstein, companies, new york times co, scandals, charlie rose, ashley judd, academy awards, arrests, awards and prizes, criminal investigations, criminal law, entertainment and arts awards, investigations, law and legal system, law enforcement, lawsuits and claims, movie awards, movies, policing and police forces, trial and procedure, assault and battery, eric schneiderman, political figures - us, demographic groups, misc people, *metoo movement, condé nast, magazines, new yorker, publishing industry, resignations, sexual misconduct, continents and regions, new york (state), new york city, north america, northeastern united states, the americas, united states", "publisher": "https://www.facebook.com/CNN"}, "keywords": "arts and entertainment, business and industry sectors, business figures, business, economy and trade, celebrity and pop culture, crime, law enforcement and corrections, crimes against persons, criminal offenses, discrimination, females (demographic group), feminism, gender equality, harvey weinstein, media industry, misconduct, movie and video industry, population and demographics, sex and gender issues, sex crimes, sex discrimination, sexual assault, sexual harassment, societal issues, society, time's up movement, celebrities, james franco, apologies, bob weinstein, companies, new york times co, scandals, charlie rose, ashley judd, academy awards, arrests, awards and prizes, criminal investigations, criminal law, entertainment and arts awards, investigations, law and legal system, law enforcement, lawsuits and claims, movie awards, movies, policing and police forces, trial and procedure, assault and battery, eric schneiderman, political figures - us, demographic groups, misc people, *metoo movement, condé nast, magazines, new yorker, publishing industry, resignations, sexual misconduct, continents and regions, new york (state), new york city, north america, northeastern united states, the americas, united states", "author": "Sandra Gonzalez,Lisa Respers France,Chloe Melas", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1522882800.0, "source": "https://www.cnn.com", "summary": ""}