{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/mandy-moore-net-worth/", "text": "What is Mandy Moore's net worth and salary?\n\nMandy Moore is an American singer, songwriter, and actress who has a net worth of $14 million. She signed with Epic Records in 1999 and rose to fame with her debut single \"Candy.\" Moore made her feature film debut in 2001, with a minor voice role in the comedy film Dr. Dolittle 2. Since 2016, she has starred on the hit NBC show This Is Us.\n\nEarly Life\n\nAmanda Leigh Moore was born in Nashua, New Hampshire on April 10, 1984. Her mom Stacy is a former reporter who worked for the Orlando Sentinel, among other publications. Her father Donald is a pilot for American Airlines. Mandy is the middle child of three. She has an older brother named Scott and a younger brother named Kyle. The Moore family moved to a suburb of Orlando in Seminole County, Florida for her dad's job. Mandy was interested in singing and acting from a young age and begged her parents for voice and acting lessons. When she was 12, she attended the Stagedoor Manor performing arts camp, which counts Natalie Portman as one of its alumni. She attended Bishop Moore Catholic High School in Orlando for one year in 1998-1999. One day, while working in a studio, she was overheard by a FedEx delivery man who had a friend in A&R at Epic Records. That FedEx delivery man sent his friend a copy of Moore's unfinished demo, and Moore signed on with the label.\n\nCareer\n\nAfter signing with Epic, Mandy began working on her debut album. She dropped out of high school during her freshman year to focus on her album. She continued her high school education via tutors. During 1999, when Mandy was 15-years-old, she toured with NSYNC and the Backstreet Boys, two of the biggest names in pop of that era. She released her debut single in August 1999. \"Candy\" was a commercial hit but Mandy was compared to the hottest pop divas of that time– Christina Aguilera, Britney Spears, and Jessica Simpson, and came up short. Moore's debut studio album, So Real, was released on December 7, 1999. The album peaked at No. 31 on the Billboard charts.\n\nMoore's second studio album, I Wanna Be with You, was released on May 9, 2000. The album was a commercial success, debuting and peaking at No. 21 on the U.S. Billboard 200 chart. Moore won the Kids' Choice Awards for Favorite Rising Star for the album in 2000. In 2001, Moore began working on her third studio album. The album's lead single, \"In My Pocket,\" reached No. 21 on the Billboard Pop Songs chart. Moore's self-titled third studio album, Mandy Moore, debuted and peaked at number 35 on the No. Billboard 200 chart.\n\nMoore made her feature film debut in 2001, where she voiced a Girl Bear Cub in the comedy Dr. Dolittle 2, which starred Eddie Murphy. Later that year, Moore co-starred with Anne Hathaway in the comedy The Princess Diaries. In 2002, Moore made her starring debut with Shane West in the romantic drama A Walk to Remember.\n\nIn 2003, Moore began working on her fourth studio album, later revealed to be an album of cover songs called Coverage. The album debuted at No. 14 on the Billboard 200 chart.\n\nIn 2004, Moore co-starred in the romantic comedy Chasing Liberty. Late in 2004, Moore co-starred in the religious satirical comedy-drama Saved!. In 2005, Moore guest-starred in the HBO comedy-drama Entourage. In 2007, Moore co-starred in the romantic comedy Because I Said So.\n\nMoore's fifth studio album Wild Hope was released on June 19, 2007. The album debuted on the U.S. Billboard 200 at No. 30. Moore's sixth studio album, Amanda Leigh, was released on May 26, 2009. It debuted at No. 25 on the Billboard 200. It was her final album for over ten years.\n\nIn 2010, Moore voiced Rapunzel in Tangled. Moore has been co-starring as Rebecca Pearson in the NBC hit show This Is Us since September 2016. She received a Golden Globe Award nomination for her role.\n\nMoore's seventh studio album and her first album in 11 years, Silver Landings, was released in March 2020. Moore was scheduled to promote the album with a North American tour beginning on March 20, 2020, before it was postponed due to the COVID-19 pandemic.\n\nPersonal Life\n\nMandy Moore dated former Scrubs star Zach Braff from 2004 to 2006.\n\nIn 2008, Moore began dating musician Ryan Adams. They got engaged in February 2009 and married on March 10, 2009, in Savannah, Georgia. In January 2015, Moore filed for divorce from Adams, citing \"irreconcilable differences.\" Moore and Adams later released a joint statement explaining their decision, calling it a \"respectful, amicable parting of ways.\" The divorce was finalized in June 2016. In 2019, in light of a number of allegations from women over Ryan Adams' abusive behavior toward them, Moore called him emotionally abusive. She spoke about her years with Adams on an episode of the WTF with Marc Maron podcast. She said: \"I felt like I was drowning. It was so untenable and unsustainable and it was so lonely. I was so sad. I was lonely with him.\" She followed up in an interview with the New York Times, saying: \"His controlling behavior essentially did block my ability to make new connections in the industry during a very pivotal and potentially lucrative time — my entire mid-to-late 20s.\"\n\nIn 2015, Moore began dating Dawes frontman, Taylor Goldsmith. They got engaged in September 2017 and married on November 18, 2018, in Los Angeles. The ceremony was an intimate backyard wedding at Mandy's house that started just after sundown. After the ceremony, guests then traveled to The Fig House, a private event space in the Highland Park neighborhood of Los Angeles. Attendees include Minka Kelly, Wilmer Valderrama, Milo Ventimiglia, and Moore's This is Us co-stars Chrissy Metz and Sterling K. Brown.\n\nMoore is also a committed philanthropist, working tirelessly for causes related to Africa and its people. Moore is the ambassador for the UN Foundation's Nothing But Nets malaria prevention campaign and is also the spokesperson for Dove's self-esteem movement and the \"Women who should be famous\" campaign.\n\nMoore is a Democrat who endorsed Hillary Clinton in the 2016 Presidential election and Pete Buttigieg in the 2020 Presidential election.\n\nIn 2019, Moore reached the base camp at Mount Everest with a guide and a group of hikers.\n\nThis Is Us Salary\n\nMandy Moore's salary per episode on \"This Is Us\" is $250,000. That works out to $4.5 million per year in an 18-episode season.\n\nReal Estate\n\nIn early 2017, Moore and Goldsmith purchased a $2.56 million midcentury modern home in Pasadena that had been subjected to some unfortunate 1990s renovations that robbed it of its original and classic charm. The 3,351 square foot house has three bedrooms and three bathrooms on 1.4 acres. The backyard has a pool and sweeping views of the San Gabriel Valley. Moore underwent a complete renovation to restore the original midcentury modern details that had been lost in the 1990s renovation.\n\nIn 2002, Moore purchased a home in Los Feliz for $1.725 million. The 4,747-square-foot home has access to large outdoor spaces, including a terraced backyard with multiple gardens and seating areas. She sold it shortly after her divorce from Ryan Adama for $2.95 million.", "images": ["https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2020/05/Mandy-Moore.jpg", "https://vz.cnwimg.com/wp-content/uploads/2009/12/Mandy-Moore.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2009/12/Mandy-Moore.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/mandy-moore-net-worth/", "title": "Mandy Moore Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Mandy Moore net worth and salaru: Mandy Moore is an American singer, songwriter, and actress who has a net worth of $14 million. She signed", "cnw_share_fb_count": 81, "cnw_share_tw_count": 18, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Mandy Moore Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/mandy-moore-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/12/Mandy-Moore.jpg", "site_name": "Celebrity Net Worth", "description": "Mandy Moore net worth and salaru: Mandy Moore is an American singer, songwriter, and actress who has a net worth of $14 million. She signed"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-05-05T17:03:38+00:00", "published_time": "2020-05-02T04:12:23+00:00", "section": "Actors", "tag": "richest singers"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/12/Mandy-Moore.jpg", "title": "Mandy Moore Net Worth", "description": "Mandy Moore net worth and salaru: Mandy Moore is an American singer, songwriter, and actress who has a net worth of $14 million. She signed"}}, "movies": [], "publish_date": 1588392743.0, "source": "https://www.celebritynetworth.com", "summary": ""}