{"url": "https://ew.com/tv/2017/12/17/christmas-story-live-5-things-to-look-out-for/", "text": "Nestled in the dry brush of the Burbank hills, just over the hill from the Hollywood sign, lies an unlikely sight: a snowy Midwestern town circa 1940, come to life with a spectacular Christmas tree in the town square, beautiful homes outfitted with perfectly placed Christmas lights, a storefront bursting with toys, and a tucked-away Chinese restaurant.\n\nThis is the set of A Christmas Story Live, repurposing the famed “Midwestern town” section of the Warner Bros. lot that has served as backdrop to the likes of Gilmore Girls and The Music Man. Tonight it’s a small Indiana town home to the Christmas story of Ralphie Parker and the year he desperately wanted a BB gun. Producer Marc Platt and writers Robert Cary and Jonathan Tolins have adapted the beloved film-turned-Broadway-musical into a live television extravaganza just in time for the holidays.\n\nEW was on the scene at the final dress rehearsal for the live broadcast, where we saw the wonder of snow falling in Los Angeles as a traditional Christmas unfolds with tap-dancing, humor, and deep emotion and care. Here are five moments to look out for in the Dec. 17 broadcast that could just be the most memorable live musical to grace our television screens yet.\n\n1. An epic ‘SNL’ reunion\n\nRVM_1125_hires2 Credit: Ray Mickshaw/Fox\n\nTo amp up the comedic aspect of the Christmas classic, producers have rounded up an impressive bevy of Saturday Night Live alums, including Maya Rudolph, Fred Armisen, and Ana Gasteyer (and hey, let’s throw in Jane Krakowski with an honorable mention for appearing on a fictional version of SNL on 30 Rock).\n\nRudolph and Gasteyer in particular get to show off their chops as triple-threat performers, dancing and singing in ways that will delight and surprise fans. Armisen brings his droll humor to one of the film’s more iconic moments as an intimidating elf.\n\n“Every time I see an SNL alum, it’s like seeing a friend from high school,” Armisen tells EW of the experience working with Gasteyer and Rudolph. “It’s just, you pick right up and start talking away. It’s the best. I love it.”\n\nThe live experience of SNL will no doubt come in handy when it comes to bringing a live musical to television. Rudolph previously told EW that live performance gives her more “adrenaline” and “energy,” but otherwise this broadcast is “another animal.”\n\nArmisen echoes these sentiments, saying, “It’s different, but it helps a lot. It helps not being scared of the word ‘live.’”\n\n2. Jane Krakowski’s tap number\n\nA-CHRISTMAS-STORY-LIVE-Jane-krakowski Credit: Fox\n\nThe Broadway vet makes her live television musical debut as Miss Shields, Ralphie’s over-the-top, long-suffering elementary school teacher. Brought on to the project by Scott Ellis, who directed her to a Tony-nominated performance in She Loves Me, Krakowski delivers a show-stopping tap number she calls an “old-school, Pennies From Heaven, 42nd Street, Busby Berkeley”-style piece, and EW can confirm it lives up to those references.\n\nIf you’ve only ever seen Krakowski hamming it up on 30 Rock or The Unbreakable Kimmy Schmidt, do yourself a favor and watch her hoofing. She came up on Broadway stages in shows like Starlight Express and Grand Hotel, though she admits that her Broadway experience hasn’t been as helpful as she thought it might be. “It has been an entirely different entity and the exciting bit has been learning how new it is and learning something new at my age and years of experience in this business,” she says. “I came in thinking it was going to be more like putting a Broadway show on, and so I had a large adjustment period in the beginning to realize it’s it own thing.”\n\nKrakowski says that among the changes that have been made for the live broadcast was expanding and adjusting her character to match her performing style. “They certainly made her more quirky and humorous of a teacher, which I love and adore,” she says. Though, for her, the highlight of the night is her big tap number and the bond it’s created between her and the young cast.\n\n“It has been a great joy to bring out my tap shoes again, which I had not brought out for awhile. There’s not a lot of demand for tap these days, old-school tap, so it was a great joy to do it with the kids,” she says. “There’s a Bugsy Malone quality to that number because I’m the only adult and everybody else is a kid, and that’s been my bonding experience with the children. And I think they are really holding this show up on their shoulders.”\n\n3. Inventive takes on iconic moments\n\nRVM_0680_hires2 Credit: Ray Mickshaw/Fox\n\nTwenty-four-hour marathons of A Christmas Story on television during the holiday season have made the film eminently quotable, and the story is rife with iconic moments, from the “major award” leg lamp to Easter bunny pajamas to a “triple-dog dare” that results in a sticky situation with a frozen pole. Never fear, all those moments are here and then some. Writers Cary and Tolins (who previously penned Grease Live), along with the entire production team, have taken great care to deliver everyone’s favorite scenes and enhance them with a special musical twist.\n\n“Grease was about living up to everyone’s memories, and this is about adding on to people’s memories, which is a little different. This is an additive experience, not a replacement experience,” Cary says. “Coming up with ways to honor people’s love for something and give them new things to love is a great Christmas thing to do.”\n\nWhile there are moments that are lifted straight from the film, such as frozen-pole-licking that makes inventive use of vacuum technology, there are also many sequences that take beloved moments and elevate them into something more, whether it be through a musical number or a tweak in the writing to modernize something for 2017.\n\n“We basically kept everything that’s iconic, and then we have room for more,” adds Tolins. From a musicalized twist on Ralphie’s wild-west B-movie fantasies with his BB gun to costume designer William Ivey Long’s bright take on the iconic leg lamp (we can’t say more, but it’s a bit of costuming genius) to an updated, more “woke” take on the final Christmas dinner at a Chinese restaurant that includes a hysterical cameo.\n\nTolins and Cary said they appreciated the film when they took on the project but weren’t rabid fans. Tolins was first introduced to the film when he wrote a short play for a night of works inspired by beloved Christmas properties and watched in awe as the audience responded with glee and recognition to every reference in a Christmas Story piece. Hart saw the film as a kid and was tickled to see it become a cult favorite in recent years. “Being a fan of something is wonderful, but being somebody who appreciates it in terms of what we do without being a rabid fan means maybe we can step back a little so that we can figure out how to make it breathe in this new form,” he says. “If you love something so much, it’s hard to feel ok with letting it grow into something slightly different.”\n\n4. A brand new Hanukkah number\n\nACSL-REHEARSALS_0451_f_hires2 Credit: John P. Fleenor/Fox\n\nAna Gasteyer steals the show with a new number written specifically for the broadcast, “Market for a Miracle.” The SNL alum gets the chance to showcase her Broadway belt with a song devised expressly for her voice by Benj Pasek and Justin Paul. “I’m a big belter, and so they thought they’d write something kind of old-fashioned and Merman-y,” she explains.\n\nGasteyer delivers a fun musical number in the style of an old-fashioned Broadway showstopper, while also helping to make the broadcast not only about Christmas (despite the title). More than anything though, she was thrilled to have the chance to work on material created for her voice. “I’ve been working awhile and I have to fight for things a lot, and it’s so moving to have to have somebody call you up and say, ‘We have something, we think you would be good at it,’” she says. “It’s so flattering.”\n\nRead more about the creation of the song here.\n\n5. Ralphie looks back\n\n699A8679_hires2 Credit: Jordin Althaus/Fox\n\nIn the original film, the story is narrated by a grown-up Ralphie as he remembers his favorite, most special Christmas from childhood. The musical and this television adaptation take it one step further by making the narrator a physical presence, played here by Matthew Broderick with a blend of his signature youthful twinkle in his eye and a moving sense of melancholy.\n\n“In the original movie, the narration is all voiceover,” Tolins says. “In the Broadway musical, the narrator was on stage sometimes, not really interacting that much, but we really wanted to go as far as we could with the notion that the narrator is grown-up Ralphie and he is watching and remembering as the evening goes on.”\n\nThe emotional arc of the story packs a wallop at the broadcast’s conclusion, one not present in the more wry and satirical film. Andy Walken is quite the discovery as young Ralphie Parker. The 11-year-old carries the broadcast on his shoulders, nailing emotional beats, comedic moments, and intricate musical numbers while maintaining an infectious sense of joy and childlike wonder. And yet, none of this would land quite as well without Broderick’s journey alongside him.\n\n“We wanted to add the feeling that sometimes he’s even discovering things along the way that he may not have realized at the time, so by the end of it, you have the feeling of what we call the Our Town effect, where someone is realizing how beautiful and how fleeting those moments of their childhood were,” says Tolins.\n\nRudolph agrees, praising Broderick’s ability to nail lengthy sequences where he has to look into camera to deliver his dialogue. Though Broderick jokes he “never knows which camera to look at,” he delivers precisely what Tolins and Cary are aiming for. Have a box of tissues on hand for the end of the show.\n\nIn addition to those five Christmas Story moments, an honorable mention goes to the live commercial that will be performed by Hugh Jackman and the cast of The Greatest Showman. We’ve seen the consummate entertainer deliver live performances hosting the Tony Awards and Oscars, but here you get the joy of seeing his mind-boggling musical theater skills in a new light (tune in for his precise body lines alone).\n\nA Christmas Story Live airs tonight at 7 p.m. ET (tape-delayed PT) on Fox.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2Fa-christmas-story-live-jane-krakowski-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F07%2F14%2FJosh-Hartnett-The-Faculty-071422.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F08%2F05%2FBrett-Goldstein-Hannah-Waddingham-Three-Rounds-080522-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2Frvm_1125_hires2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2Frvm_0680_hires2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Few.com%2Fimg%2Fmisc%2F300x250_magazines_and_more.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2Facsl-rehearsals_0451_f_hires2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2F699a8035_hires2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2F699a8035_hires2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2F699a8679_hires2-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F06%2F14%2F5188-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F08%2F16%2FBetter-Call-Saul_081622_4.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2F699a8035_hires2-2000.jpg", "keywords": [], "authors": ["Maureen Lee Lenker", "December", "At Pm Est"], "canonical_link": "https://ew.com/tv/2017/12/17/christmas-story-live-5-things-to-look-out-for/", "title": "A Christmas Story Live: 5 things to look out for during the musical broadcast", "meta_data": {"viewport": "width=device-width,initial-scale=1", "theme-color": "#111", "keywords": "entertainment, entertainment news, ew, entertainment weekly", "news_keywords": "entertainment, entertainment news, ew, entertainment weekly", "description": "Stand-out moments from behind the scenes at dress rehearsal", "robots": "max-image-preview:large", "og": {"title": "'A Christmas Story Live': 5 things to look out for during the musical broadcast", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2017/12/17/christmas-story-live-5-things-to-look-out-for/", "description": "Stand-out moments from behind the scenes at dress rehearsal", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2F699a8035_hires2-2000.jpg", "width": 2000, "height": 1000}}, "pinterest": {"url": "https://ew.com/tv/2017/12/17/christmas-story-live-5-things-to-look-out-for/", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2F699a8035_hires2-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2017/12/17/christmas-story-live-5-things-to-look-out-for/", "title": "'A Christmas Story Live': 5 things to look out for during the musical broadcast", "description": "Stand-out moments from behind the scenes at dress rehearsal", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F12%2F699a8035_hires2-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}, "url": "https://ew.com/tv/2017/12/17/christmas-story-live-5-things-to-look-out-for/"}, "movies": [], "publish_date": 1513468800.0, "source": "https://ew.com", "summary": ""}