{"url": "https://www.etonline.com/bachelor-ben-higgins-advice-for-how-arie-luyendyk-jr-should-handle-his-messy-ending-exclusive-97306", "text": "Ben Higgins is one of the most beloved Bachelors of all time. At his Women Tell All, the contestants had a hard time criticizing him. They wished him the best and complimented his character, even while knowing that he had told both of his top two women that he loved them.\n\nArie Luyendyk Jr.'s season is a similar story, but with a very different vibe and a shocking finale. On Monday night's episode, he told both Becca and Lauren, his top two, \"I love you.\" ET has confirmed through multiple sources that he proposed to one of them, then broke up with her, and is now in a relationship with his so-called runner-up. Monday night, a three-hour Bachelor finale airs, and a source tells ET that on Tuesday, the women are ready to \"grill\" Arie on the show's live After the Final Rose special. (Becca, Lauren, Kendall, Tia, Seinne and Bekah will all be in attendance.)\n\nWe spoke to Ben after his return from a charitable trip to Honduras to get his advice for Arie, and the real story on how a Bachelor goes about saying \"I love you\" to two women.\n\nET: Walk us through how you said \"I love you\" to both JoJo Fletcher and Lauren Bushnell. Did you have to talk it out with producers beforehand?\n\nBen Higgins: There isn’t a lot of, especially towards the end, guidance. The one thing the producers become are friends, for good or bad. They become your confidantes and you try to process your thoughts and your feelings with them, and I remember sitting at dinner in Jamaica and all the executive producers from the show were living in the same house as me at the time. I said, \"I really love these two women and care about these two women. And I don’t want one of them to walk away from this not knowing how I felt. What would happen if one of these women voiced their feelings for me and I responded?\" And they said, \"You can say whatever you want. There’s no rules here, but think it through and make sure that’s what you want to do.\" Honestly, maybe to my own lack of wisdom, I thought, Maybe the best way to tell JoJo exactly how I feel so she walks away from this knowing this was real is to tell her I love her. Because I did. I cared about her a ton, loved her as a person and loved my time with her. But I just knew I couldn’t, at the time, live without Lauren, and I loved her as my partner.\n\nWATCH: 'Bachelor' Arie Luyendyk Jr. Confronted By Caroline Over His Final Choice on 'Women Tell All' This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. WATCH: 'Bachelor' Arie Luyendyk Jr. Confronted By Caroline Over His Final Choice on 'Women Tell All'\n\nWhat's the distinction? Would you say you loved JoJo, but weren't in love with her?\n\nYeah. I mean, I don't exactly know what that means, but today I would still be able to say I cared deeply for JoJo. If she needed assistance, help, I would bend over backwards to do that, just as I would today with Lauren, because of how much respect and care and love that I still have for both of them as people. ... I'm kind of embarrassed about it ... I thought it was cool I was able to open up and be that vulnerable with two people. And then ... it came pretty quickly to me when I was sitting with JoJo after our last date, and I realized I’d told her something that I did feel, but it was going to be a lot harder on her for me to break up with her the next day. And I realized then this might not have been the best decision.\n\nSo you had love for JoJo, but knew Lauren was the one for you. Do you think Arie is really in love with both women?\n\nI get why you can be torn. There’s still this thought in the back of your head,1,000 thoughts really, of, \"How is this so perfect? Is it because of the show? Am I forcing myself into this? Do I really love this woman? Do I really see a future with this woman?\" ... I stood in my bedroom, looked at myself in the mirror and said, \"Stop being a wuss. You love this woman. Get down on one knee. You know it’s the right thing to do.\" And I’m glad I did. I don’t regret that. ... If you were there and you could actually sit him down, he would probably have a pretty strong lean towards somebody.\n\nWould you advise future Bachelors to not say \"I love you\" to two women?\n\nI will never say I regret doing it … but I would advise anybody to not probably do that when you’re going to be engaged very soon. I knew I was going to be engaged. I thought it was the right thing [to tell JoJo I loved her]. Sometimes in life you can really believe you’re doing the right thing, and maybe you weren’t. Saying it to two people is not smart for a relationship. Even if you feel it, hold it in, because as soon as the cameras go down and you look at the person you proposed to, you realize this is a really real thing. You’ve called your families. They’re excited for you. You realize very quickly that you don’t want anybody else, you’re very happy with where you’re at and any emotions or feelings told to anybody but that woman are unfair to her. And that’s why I told Lauren the next day. We had a few days in Jamaica to hang out and I sat her down and said, \"Lauren, you have to realize this is how things played out.\" It was really hard, and I get why it was hard. It wasn’t fair to her.\n\nHow much of a part did all that play in you and Lauren ultimately splitting?\n\nI don’t think it’s why things didn’t work out. It played a part in those first weeks. … Coming off the show, you’re so confused about how you just ended up engaged off of a show, that any type of things that can add any reassurance or doubt really affect you.\n\nWell, Arie took things one big step further. He proposed to one woman, she said yes, they were together, and then he changed his mind. Arie, Becca and Lauren will be together live for After the Final Rose. How should he handle it?\n\nHe should own it. Ultimately he decided to do the things he did. Even if it was wrong, we’re entitled as humans to make incorrect decisions sometimes. That's OK, as long as we recognize that and move forward with that. To say, \"I messed up, I was wrong.\" … As a fan of the show, I would forgive him and offer him grace. … Nothing looks worse than blaming everybody else for a decision that you made.\n\n'Bachelor' Ben Higgins on How His Breakup from Lauren Bushnell 'Crushed Him' For Months (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page.\n\nRELATED CONTENT:\n\n'Bachelor' Arie Luyendyk Jr. Dumps Season 22 Winner for Runner-Up -- Here's Exactly What Happened!\n\nOriginal 'Bachelorette' Trista Sutter Says This Was 'Bachelor' Arie's 'Huge' Mistake (Exclusive)\n\n'The Bachelor' Standout Bekah Martinez Says Arie Luyendyk Jr. Isn't Ready for Marriage (Exclusive)\n\nBekah Martinez Knows Who Arie Luyendyk Jr. Ends Up With, and Says They Won't Stay Together (Exclusive)", "images": ["https://media.amlg.io/image-assets/et/et+et_prod-image-570324.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-10/GettyImages-1243560296.jpg?h=27af8da9&itok=n9B1yPno", "https://media.amlg.io/image-assets/et/et+et_prod-image-566597.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-570258.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-569417.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-566033.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-567711.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-569836.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-566831.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-571426.png", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_bachelorbenhiggins_022118.jpg?h=d1cb525d&itok=kPWxicv6", "https://media.amlg.io/image-assets/et/et+et_prod-image-569662.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-569099.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-569078.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-569363.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-10/Screen%20Shot%202022-10-08%20at%202.01.34%20PM.png?h=597e033f&itok=1KV1Fu0Z", "https://media.amlg.io/image-assets/et/et+et_prod-image-571470.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-567052.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-569238.png", "https://www.etonline.com/sites/default/files/styles/video_1280x720/public/brightcove/videos/images/posters/et_bachelorbenhiggins_022118.jpg?h=d1cb525d&itok=X6mGnTSv", "https://media.amlg.io/image-assets/et/et+et_prod-image-568023.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-569092.png"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_bachelorbenhiggins_022118.jpg?h=d1cb525d&itok=kPWxicv6", "keywords": [], "authors": ["Lauren Zima"], "canonical_link": "https://www.etonline.com/bachelor-ben-higgins-advice-for-how-arie-luyendyk-jr-should-handle-his-messy-ending-exclusive-97306", "title": "'Bachelor' Ben Higgins' Advice for How Arie Luyendyk Jr. Should Handle His Messy Ending (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "apple-mobile-web-app-capable": "yes", "robots": "index", "description": "Higgins was the first Bachelor in the franchise to say 'I love you' to two women, and Arie did it too.", "keywords": "News, TV, The Bachelor, Ben Higgins, Arie Luyendyk Jr.", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/bachelor-ben-higgins-advice-for-how-arie-luyendyk-jr-should-handle-his-messy-ending-exclusive-97306", "title": "'Bachelor' Ben Higgins' Advice for How Arie Luyendyk Jr. Should Handle His Messy Ending (Exclusive)", "description": "Higgins was the first Bachelor in the franchise to say 'I love you' to two women, and Arie did it too.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_bachelorbenhiggins_022118.jpg?h=d1cb525d&itok=kPWxicv6", "width": 1280, "height": 720}}, "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "twitter": {"card": "summary_large_image", "description": "Higgins was the first Bachelor in the franchise to say 'I love you' to two women, and Arie did it too.", "site": {"identifier": "@etnow", "id": 23603092}, "title": "'Bachelor' Ben Higgins' Advice for How Arie Luyendyk Jr. Should Handle His Messy Ending (Exclusive)", "creator": "Lauren Zima‍", "url": "https://www.etonline.com/bachelor-ben-higgins-advice-for-how-arie-luyendyk-jr-should-handle-his-messy-ending-exclusive-97306", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/brightcove/videos/images/posters/et_bachelorbenhiggins_022118.jpg?h=d1cb525d&itok=kPWxicv6"}, "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}