{"url": "https://www.hollywoodreporter.com/live-feed/originals-charles-michael-davis-key-699471", "text": "The Originals is diving into the origins of Klaus and Marcel’s relationship.\n\nIn Tuesday’s episode, “A Closer Walk With Thee,” Klaus is forced to revisit his path with Marcel, his former protege and adoptive son, amid regular nightmares of his father Mikael. The trip down memory lane, all told in flashbacks, comes at a time when things between Klaus and Marcel are at an impasse, for lack of a better term.\n\n“It’s like any relationship,” actor Charles Michael Davis tells The Hollywood Reporter. “With brothers growing up, you can’t really get away from each other so you got to fight your issues out or you got to talk about it. They’re not the best at communicating. They’re just going to have to have it out. With the finale coming up, it’ll be one of the things that will need to be resolved or at least need to be brought up.”\n\nSTORY: ‘The Originals’: Claire Holt Goes on Record About Her Exit; Creator and Co-Stars Weigh In\n\nThe chances of Klaus and Marcel having a cup of coffee as they hash out their differences will be slim to none, Davis promises: “It probably won’t be them sitting down in therapy talking about it.”\n\nThis week’s installment sheds more light on Marcel’s pre-vampire days, as well as his first moments after turning into a supernatural being. “You’re going to get a glimpse into the actual path and the events that brought [Klaus and Marcel] together,” Davis hints of those “turning points.” The episode also explains “what keeps their bond so strong and why Klaus doesn’t just kill Marcel like he could so easily with anybody else.”\n\nAs Davis explains it, the flashbacks were actually filmed earlier in the year to be used for a previous episode, “but they didn’t quite fit with the timing and the edit.” “Because of the strength of those scenes, [the producers] decided to bring them back and use them for episode 20,” he says, teasing that there are some “very emotional” scenes.\n\nEvents of the past may have been alluded to in passing or in dialogue, but Davis promises that these flashbacks fill in the blanks for viewers. “The audience is going to understand Marcel and I might win a bit more Team Marcel fans,” he says. “After this episode, more people will sympathize and empathize with him.\n\n“When somebody tells you their personal story, you look at them differently and you understand them. There’s a lot of information in this episode. The flashbacks are really key,” Davis adds.\n\nAs The Originals marches toward the remaining episodes of the season, Davis describes them as “big productions” — “all sorts of stunts, some characters that came back, big reveals.” “Each episode has the intensity of a finale,” he says. As for the final battle between the witches, werewolves and vampires? One word: “Epic.”\n\nThe Originals airs Tuesdays at 8 p.m. on The CW.\n\nEmail: Philiana.Ng@THR.com\n\nTwitter: @insidethetube", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2014/04/to.jpg?w=2000&h=1126&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/uploads/2014/04/to.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2014/04/to.jpg?w=1024", "keywords": [], "authors": ["Philiana Ng"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/originals-charles-michael-davis-key-699471/", "title": "‘The Originals’: Charles Michael Davis on ‘Key’ Flashbacks, Family Rifts and ‘Epic’ Closer", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "In a chat with THR, the CW star previews the remaining episodes of the season, promising \"big productions\" until the finale.", "news_keywords": "Charles Michael Davis, The Originals", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Philiana Ng", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 699471, "title": "'The Originals': Charles Michael Davis on 'Key' Flashbacks, Family Rifts and 'Epic' Closer", "published_at": "2014-04-29 07:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2014/04/to.jpg?w=1024", "comment_count": 0, "tags": "The Originals", "topics": "TV News", "body": "The Originals is diving into the origins of Klaus and Marcel's relationship.\r\nIn Tuesday's episode, \"A Closer Walk With Thee,\" Klaus is forced to revisit his path with Marcel, his former protege and adoptive son, amid regular nightmares of his father Mikael. The trip down memory lane, all told in flashbacks, comes at a time when things between Klaus and Marcel are at an impasse, for lack of a better term.\r\n\r\n\"It's like any relationship,\" actor Charles Michael Davis tells The Hollywood Reporter. \"With brothers growing up, you can't really get away from each other so you got to fight your issues out or you got to talk about it. They're not the best at communicating. They're just going to have to have it out. With the finale coming up, it'll be one of the things that will need to be resolved or at least need to be brought up.\"\r\nSTORY: 'The Originals': Claire Holt Goes on Record About Her Exit; Creator and Co-Stars Weigh In \r\nThe chances of Klaus and Marcel having a cup of coffee as they hash out their differences will be slim to none, Davis promises: \"It probably won't be them sitting down in therapy talking about it.\"\r\nThis week's installment sheds more light on Marcel's pre-vampire days, as well as his first moments after turning into a supernatural being. \"You're going to get a glimpse into the actual path and the events that brought [Klaus and Marcel] together,\" Davis hints of those \"turning points.\" The episode also explains \"what keeps their bond so strong and why Klaus doesn't just kill Marcel like he could so easily with anybody else.\"\r\nAs Davis explains it, the flashbacks were actually filmed earlier in the year to be used for a previous episode, \"but they didn't quite fit with the timing and the edit.\" \"Because of the strength of those scenes, [the producers] decided to bring them back and use them for episode 20,\" he says, teasing that there are some \"very emotional\" scenes. \r\nEvents of the past may have been alluded to in passing or in dialogue, but Davis promises that these flashbacks fill in the blanks for viewers. \"The audience is going to understand Marcel and I might win a bit more Team Marcel fans,\" he says. \"After this episode, more people will sympathize and empathize with him.\r\n\"When somebody tells you their personal story, you look at them differently and you understand them. There's a lot of information in this episode. The flashbacks are really key,\" Davis adds.\r\nAs The Originals marches toward the remaining episodes of the season, Davis describes them as \"big productions\" -- \"all sorts of stunts, some characters that came back, big reveals.\" \"Each episode has the intensity of a finale,\" he says. As for the final battle between the witches, werewolves and vampires? One word: \"Epic.\"\r\nThe Originals airs Tuesdays at 8 p.m. on The CW.\r\nEmail: Philiana.Ng@THR.com\r\n\tTwitter: @insidethetube", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘The Originals’: Charles Michael Davis on ‘Key’ Flashbacks, Family Rifts and ‘Epic’ Closer", "url": "https://www.hollywoodreporter.com/tv/tv-news/originals-charles-michael-davis-key-699471/", "description": "In a chat with THR, the CW star previews the remaining episodes of the season, promising “big productions” until the finale.", "site_name": "The Hollywood Reporter", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2014/04/to.jpg?w=1024", "locale": "en_US"}, "article": {"published_time": "2014-04-29T07:00:00+00:00", "modified_time": "2014-04-29T07:00:17+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘The Originals’: Charles Michael Davis on ‘Key’ Flashbacks, Family Rifts and ‘Epic’ Closer", "description": "In a chat with THR, the CW star previews the remaining episodes of the season, promising “big productions” until the finale.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2014/04/to.jpg?w=3000"}}, "movies": [], "publish_date": 1398754800.0, "source": "https://www.hollywoodreporter.com", "summary": ""}