{"url": "https://www.vanityfair.com/news/2018/02/monica-lewinsky-in-the-age-of-metoo", "text": "How, then, to get a handle, today, on what exactly happened back then?\n\nOne useful viewpoint is that of cognitive linguist George Lakoff. In his book Moral Politics: What Conservatives Know That Liberals Don’t, Lakoff observes that the connective fiber of our country is often best represented through the metaphor of family: e.g., “our Founding Fathers,” “Uncle Sam,” the concept of sending our sons and daughters to war. Lakoff goes on to argue that, “for conservatives, the nation is conceptualized (implicitly and unconsciously) as a Strict Father family and, for liberals, as a Nurturant Parent family.” Addressing the scandal itself, he asserts that Clinton was widely perceived as “the naughty child” and that, in line with the filial metaphor, “a family matter [had turned] into an affair of state.” Thus, in many ways, the crack in the foundation of the presidency was also a crack in our foundation at home. Moreover, the nature of the violation—an extramarital relationship—struck at the heart of one of humanity’s most complicated moral issues: infidelity. (You’ll forgive me if I leave that topic right there.)\n\nThe result, I believe, was that in 1998 the person to whom we would typically turn for reassurance and comfort during a national crisis was remote and unavailable. The country, at that stage, had no consistent, Rooseveltian voice of calm or reason or empathy to make sense of the chaos. Instead, our Nurturer in Chief, because of his own actions as much as the subterfuge of his enemies, was a figurative “absent father.”\n\nAs a society, we went through this together. And ever since, the scandal has had an epigenetic quality, as if our cultural DNA has slowly been altered to ensure its longevity. If you can believe it, there has been at least one significant reference in the press to that unfortunate spell in our history every day for the past 20 years. Every. Single. Day.\n\nThe fog of 1998 has lodged in our consciousness for many reasons. The Clintons have remained pivotal political figures on the global stage. Their disparagement has been vigorously abetted by “this vast right-wing conspiracy,” as Hil­la­ry Clinton famously put it. And the Clinton presidency segued into a bitter electoral deadlock: the contested Bush v. Gore showdown, which would usher in an era so turbulent that it would leave the lessons of the Clinton years altogether murky. In succession came the unthinkable (the attacks of September 11, 2001), protracted conflicts (the wars in Iraq and Afghanistan), the Great Recession, a state of perpetual gridlock in Washington, and then the daily bedlam central to Trumpism. No matter how these subsequent events dwarfed the impeachment and subsumed our attention, maybe, just maybe, the long, unimpeded derivation of this drama, ever since, is partly the result of 1998 having been a year of unremitting crisis that we all endured but never actually resolved—a low-grade collective trauma, perhaps?\n\nI discussed this idea with psychologist Jack Saul, founding director of New York’s International Trauma Studies Program and author of Collective Trauma, Collective Healing. “Collective trauma,” he told me, “usually refers to the shared injuries to a population’s social ecology due to a major catastrophe or chronic oppression, poverty, and disease. While the events of 1998 in the United States do not fit neatly into such a definition, they may have led to some of the features we often associate with collective traumas: social rupturing and a profound sense of distress, the challenging of long-held assumptions about the world and national identity, a constricted public narrative, and a process of scapegoating and dehumanization.”\n\nUntil recently (thank you, Harvey Weinstein), historians hadn’t really had the perspective to fully process and acknowledge that year of shame and spectacle. And as a culture, we still haven’t properly examined it. Re-framed it. Integrated it. And transformed it. My hope, given the two dec­ades that have passed, is that we are now at a stage where we can untangle the complexities and context (maybe even with a little compassion), which might help lead to an eventual healing—and a systemic transformation. As Haruki Murakami has written, “When you come out of the storm you won’t be the same person who walked in. That’s what this storm’s all about.” Who were we then? Who are we now?\n\n‘I’m so sorry you were so alone.” Those seven words undid me. They were written in a recent private exchange I had with one of the brave women leading the #MeToo movement. Somehow, coming from her—a recognition of sorts on a deep, soulful level—they landed in a way that cracked me open and brought me to tears. Yes, I had received many letters of support in 1998. And, yes (thank God!), I had my family and friends to support me. But by and large I had been alone. So. Very. Alone. Publicly Alone—abandoned most of all by the key figure in the crisis, who actually knew me well and intimately. That I had made mistakes, on that we can all agree. But swimming in that sea of Aloneness was terrifying.\n\nIsolation is such a powerful tool to the subjugator. And yet I don’t believe I would have felt so isolated had it all happened today. One of the most inspiring aspects of this newly energized movement is the sheer number of women who have spoken up in support of one another. And the volume in numbers has translated into volume of public voice. Historically, he who shapes the story (and it is so often a he) creates “the truth.” But this collective rise in decibel level has provided a resonance for women’s narratives. If the Internet was a bête noire to me in 1998, its stepchild—social media—has been a savior for millions of women today (notwithstanding all the cyberbullying, online harassment, doxing, and slut-shaming). Virtually anyone can share her or his #MeToo story and be instantly welcomed into a tribe. In addition, the democratizing potential of the Internet to open up support networks and penetrate what used to be closed circles of power is something that was unavailable to me back then. Power, in that case, remained in the hands of the president and his minions, the Congress, the prosecutors, and the press.\n\nThere are many more women and men whose voices and stories need to be heard before mine. (There are even some people who feel my White House experiences don’t have a place in this movement, as what transpired between Bill Clinton and myself was not sexual assault, although we now recognize that it constituted a gross abuse of power.) And yet, everywhere I have gone for the past few months, I’ve been asked about it. My response has been the same: I am in awe of the sheer courage of the women who have stood up and begun to confront entrenched beliefs and institutions. But as for me, my history, and how I fit in personally? I’m sorry to say I don’t have a definitive answer yet on the meaning of all of the events that led to the 1998 investigation; I am unpacking and reprocessing what happened to me. Over and over and over again.\n\nFor two dec­ades, I have been working on myself, my trauma, and my healing. And, naturally, I have grappled with the rest of the world’s interpretations and Bill Clinton’s re-interpretations of what happened. But in truth, I have done this at arm’s length. There have been so many barriers to this place of self-reckoning.", "images": ["https://media.vanityfair.com/photos/61e9a4b7b7a91122f5b3d8b9/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/5a64db687df577764ae9be9b/master/w_1600%2Cc_limit/01-womens-march-dc-DSCF3272VF.jpg", "https://media.vanityfair.com/photos/623a28a1e700ab34afc82b7f/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/6270778fc79ffab65a2f7d6d/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/5a64db5f522d2433237667c1/master/w_1600%2Cc_limit/03-womens-march-dc-DSCF3371VF.jpg", "https://media.vanityfair.com/photos/5f3166c4476de5b2fc5e5654/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://www.vanityfair.com/verso/static/hive/assets/logo-header.ea437ae89b8c3c7aabbb46bb45a04f1a514e5803.svg", "https://media.vanityfair.com/photos/5a8dcfed3c0f45451fecd3a7/master/w_1600%2Cc_limit/monica-lewinsky-metoo-03-2018-embed.jpg", "https://media.vanityfair.com/photos/5a64db8c2d4c642bf63b3ba4/master/w_1600%2Cc_limit/02-womens-march-dc-DSCF3316VF.jpg", "https://media.vanityfair.com/photos/63370d0bb02ed9e1f657fa60/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/5a8dcf3d1c6be356b8dcf6a6/16:9/w_1280,c_limit/t-monica-lewinsky-metoo-03-2018.jpg", "https://media.vanityfair.com/photos/5a8dcf3f9028ff3af11a186e/master/w_2560%2Cc_limit/monica-lewinsky-metoo-03-2018-lede.jpg", "https://media.vanityfair.com/photos/633dac5a42c2d8adf3fa7d9c/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://www.vanityfair.com/verso/static/hive/assets/logo-reverse.6ccb38f17720796c2695284ed57385b6fda63de0.svg", "https://media.vanityfair.com/photos/633e045546d7fce1e25ce391/1:1/w_350%2Ch_350%2Cc_limit/undefined"], "top_img": "https://media.vanityfair.com/photos/5a8dcf3d1c6be356b8dcf6a6/16:9/w_1280,c_limit/t-monica-lewinsky-metoo-03-2018.jpg", "keywords": [], "authors": ["Condé Nast", "Monica Lewinsky"], "canonical_link": "https://www.vanityfair.com/news/2018/02/monica-lewinsky-in-the-age-of-metoo", "title": "Monica Lewinsky: Emerging from “the House of Gaslight” in the Age of #MeToo", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "On the 20th anniversary of the Starr investigation, which introduced her to the world, the author reflects on the changing nature of trauma, the de-evolution of the media, and the extraordinary hope now provided by the #MeToo movement.", "id": "5a8d9cf6112b4c50fd8b310d", "keywords": "metoo,#metoo movement,monica lewinsky", "news_keywords": "metoo,#metoo movement,monica lewinsky", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "5a8d9cf6112b4c50fd8b310d", "parsely-metadata": "{\"description\":\"On the 20th anniversary of the Starr investigation, which introduced her to the world, the author reflects on the changing nature of trauma, the de-evolution of the media, and the extraordinary hope now provided by the #MeToo movement.\",\"image-16-9\":\"https://media.vanityfair.com/photos/5a8dcf3d1c6be356b8dcf6a6/16:9/w_1000,c_limit/t-monica-lewinsky-metoo-03-2018.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/5a8dcf3d1c6be356b8dcf6a6/1:1/w_1000,c_limit/t-monica-lewinsky-metoo-03-2018.jpg\"}", "og": {"description": "On the 20th anniversary of the Starr investigation, which introduced her to the world, the author reflects on the changing nature of trauma, the de-evolution of the media, and the extraordinary hope now provided by the #MeToo movement.", "image": "https://media.vanityfair.com/photos/5a8dcf3d1c6be356b8dcf6a6/16:9/w_1280,c_limit/t-monica-lewinsky-metoo-03-2018.jpg", "site_name": "Vanity Fair", "title": "Monica Lewinsky: Emerging from “the House of Gaslight” in the Age of #MeToo", "type": "article", "url": "https://www.vanityfair.com/news/2018/02/monica-lewinsky-in-the-age-of-metoo"}, "article": {"content_tier": "metered", "opinion": "false", "section": "tags", "published_time": "2018-02-25T22:00:00.000Z", "modified_time": "2018-02-25T22:00:00.000Z", "author": "Monica Lewinsky"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "On the 20th anniversary of the Starr investigation, which introduced her to the world, the author reflects on the changing nature of trauma, the de-evolution of the media, and the extraordinary hope now provided by the #MeToo movement.", "domain": "https://www.vanityfair.com", "image": "https://media.vanityfair.com/photos/5a8dcf3d1c6be356b8dcf6a6/16:9/w_1280,c_limit/t-monica-lewinsky-metoo-03-2018.jpg?mbid=social_retweet", "site": "@VanityFair", "title": "Monica Lewinsky: Emerging from “the House of Gaslight” in the Age of #MeToo"}, "fb": {"app_id": 256281040558, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": 1519596000.0, "source": "https://www.vanityfair.com", "summary": ""}