{"url": "https://en.wikipedia.org/wiki/April_(giraffe)", "text": "Reticulated giraffe (2000–2021)\n\nApril (April 18, 2000 – April 2, 2021) was a reticulated giraffe (Giraffa camelopardalis reticulata) at the Animal Adventure Park in Harpursville, New York, in the United States. She gained worldwide fame after live videos of her in the late stages of pregnancy and the subsequent birth were uploaded to YouTube in 2017. The birth was watched live by nearly 1.2 million viewers.\n\nLife [ edit ]\n\nApril was born in 2000[3] at the Catskill Game Farm in Catskill, New York. She resided at the Catskill Game Farm until it closed in October 2006, when she was relocated to Adirondack Animal Land in Broadalbin, New York.[4]\n\nAnimal Adventure Park owned by Jordan Patch acquired 14-year-old April shortly after acquiring Oliver, a 3-year-old male giraffe, in 2015. Oliver and April soon mated, which resulted in her pregnancy that normally lasts 15 months.[5] It was Oliver's first siring and April's fourth pregnancy;[6] she had previously mothered three other giraffes, two males and a female named Autumn, with a male giraffe named Stretch.[2] After becoming pregnant, at Animal Adventure Park she became a \"viral sensation\" in February 2017 while being monitored by a live stream.[7][8][9][10] An estimated 1.2 million viewers watched the live feed of April giving birth on YouTube; the live feed was sponsored by Toys R Us and Babies R Us, as a play on that chain's mascot, Geoffrey the Giraffe.[6] By the time the camera was shut off, the YouTube feed had accumulated 232 million views.[11] A GoFundMe fundraiser page that initially set a goal of $50,000 received more than $135,000 by the time the calf was born. The money was used to offset the annual care for the animals and upgrading the giraffe exhibit at the park.[12]\n\nWith the prolonged wait for April to enter labor, some people had questioned if the pregnancy was an April Fools' Day joke,[13][14][15] and other conspiracy theories had also been put forward.[16] Prior to the birth, April's veterinarian Dr. Tim Slater stated that despite a great sense of anticipation, the birth of her calf was not considered overdue.[17] On April 8, 2017, April's zookeeper Allysa Swilley and caretaker Corey Dwyer stated that April was big, full of milk and \"closer\" to giving birth, but at this time, the calf is \"just not coming out.\" A live stream of April's pregnancy has been posted to the video-sharing site YouTube. A minor controversy resulted when YouTube briefly removed the stream in late February 2017 following complaints from animal activists of the video allegedly violating standards in regards to nudity and sexual activity. Following thousands of complaints from YouTube users, the stream was restored to the website within an hour.[18]\n\nOn April 15, 2017, Animal Adventure Park announced April had gone into labor, noting that the calf's hooves had come out of the womb and that it would take between 30 minutes and two hours from that point to complete the birth. The calf, a male[6] with a height of 5.75 feet (1.75 m) and weighing 129 pounds (59 kg),[19] was born at approximately 9:54 a.m. Eastern Time.[5] The giraffe cam was shut off at 4:30 p.m. Eastern Time on April 21, with the staff appearing on camera before the shutoff to express their thanks.[11] As a result of a name-the-baby contest, the calf was named Tajiri, from the Swahili language word for \"hope\".[20]\n\nOn July 25, 2018, Animal Adventure Park announced that April and Oliver had conceived a second time earlier in the year.[21] This calf, also a male,[22] was born at 12:43 p.m. Eastern Time on March 16, 2019; as with Tajiri's birth, the birth was live-streamed on the Internet, with 300,000 viewers at the time of birth.[23] On March 16, 2019, at 12:43 pm April gave birth to her fourth son, Azizi (Ah-Zee-Zee) weighing 139 pounds with a height of 5 feet and 11 inches. The calf was on his feet at 1:27 pm; and was observed nursing at 1:51 pm.\n\nApril was placed on birth control in June 2019 and entered senior care after her handlers observed behavior that made them believe that further calf bearing would be hazardous to her health. During her retirement, she was housed with her two youngest children, Tajiri and Azizi. Subsequently Animal Adventure Park acquired another female giraffe, Johari, to continue breeding of the species with Oliver.[24]\n\nOn November 25, 2019, it was announced that Azizi, April's youngest calf, was moving to the East Texas Zoo & Gator Park in Grand Saline, Texas, in spring 2020,[25] because he was growing faster than older brother Tajiri,[26] and also taking to alfalfa hay and a fortified pelleted giraffe diet early on in his development.\n\nThe East Texas Zoo and Gator Park announced that Azizi died unexpectedly on October 27, 2020.[27] He had recently received treatment for a parasitic issue; the treatment regimen appeared to be working, and Azizi was showing signs of improvement. On October 27, however, Azizi was unable to stand, and he died during a veterinary examination. Post-mortem review revealed a twisted gut around his cranial mesenteric artery, which was ultimately the cause of his death. This condition was entirely unexpected and unpreventable.[28]\n\nOn April 2, 2021, sixteen days before her 21st birthday, Animal Adventure Park announced that April had been euthanized at the age of 20 because of worsening arthritis. She was cremated and her ashes were returned to the park.[29][30]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Flag_of_New_York.svg/32px-Flag_of_New_York.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Okapi2.jpg/32px-Okapi2.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/April_(giraffe)", "title": "April (giraffe)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "April (giraffe) - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}