{"url": "https://en.wikipedia.org/wiki/Mohamed_Hadid", "text": "Jordanian-American real estate developer\n\nFor the Iraqi minister, see Mohammed Hadid\n\nMohamed Anwar Hadid (Arabic: محمد حديد; born (1948-11-06)6 November 1948)[2][3] is a Jordanian-American real estate developer. He is known for building luxury hotels and mansions, mainly in the Bel Air neighbourhood of Los Angeles and the city of Beverly Hills, California.\n\nEarly life\n\nHadid was born into a Palestinian Muslim family on 6 November 1948 in Nazareth.[4][5][6][1] He is the son of Anwar Mohamed Hadid (1918[7] –1989[8]) and his wife Khairiah Hadid (née Daher; 1925–2008),[9] and has two brothers and five sisters.[8] Through his mother, Hadid claims descent from Dahir al-Umar, an 18th-century Arab ruler of northern Palestine.[10][11]\n\nDue to the 1947–1949 Palestine War, Hadid and his family fled Palestine as part of the 1948 Palestinian exodus. In 2015, Hadid stated: \"We became refugees to Syria and we lost our home in Safad to a Jewish family that we sheltered... Strange thing. That I and my family would do it again.\"[12]\n\nHis father studied at a teachers' college in Jerusalem and attended a university[which?] in Syria to study law, before working in land settlement for the British authorities and teaching English at a teachers' college in Mandatory Palestine. In 1948, he moved to Syria and joined the United States Information Agency (USIA) and Voice of America (VOA). Hadid and his family lived in Damascus, Tunisia and Greece before moving to Washington, D.C. when he was 14 years old, as his father had a job at the VOA headquarters there and spent the rest of his career there with VOA and USIA as a writer, editor and translator.[8][10][13]\n\nHadid attended North Carolina State University and the Massachusetts Institute of Technology.[1]\n\nCareer\n\nAmong his early ventures was a company that exported equipment to the Middle East.[3][14] He started his career restoring and reselling classic cars in the Georgetown neighbourhood of Washington, D.C., before moving to Greece, where he opened a nightclub on an island, and with the profits, started developing real estate in the United States.[15]\n\nIn the 1980s, much of his financial clout came from the SAAR Foundation, a Herndon-based foundation with Saudi roots. The foundation was a 50–50 partner in many of Hadid's ventures.[14] In the late 1980s, he faced at least 30 lawsuits from creditors and banks claiming he had not fulfilled various financial obligations.[16] He paid $150 million for the Ritz-Carlton hotels in Washington and New York. He also converted a Houston hotel into a Ritz-Carlton Hotel and developed a Ritz-Carlton resort in Scottsdale, Arizona. He outmaneuvered Donald Trump, paying $42.9 million for several choice parcels in Aspen and announcing plans for a 292-room Ritz resort.[14][16]\n\nIn 1992, a settlement was reached in a lawsuit by Riggs Bank against Columbia First Bank Chairman Melvin Lenkin, a Hadid partner in a Washington, D.C., construction project that involved a loan on which Hadid defaulted. Following the settlement Hadid closed his local office, lost his McLean home to foreclosure, and left the Washington area.[17]\n\nHe developed Le Belvedere, a mansion in Bel Air, Los Angeles,[18] that sold for $50 million in 2010. In 2012, he developed The Crescent Palace, a 48,000-square-foot home on an acre plot next door to the Beverly Hills Hotel, which he listed for sale at $58 million.[19]\n\nEstate on Strada Vecchia Road\n\nShortly after Hadid received approval for the construction of a mansion in Bel Air, the Bel Air Homeowners Alliance, chaired by Fred Rosen, was formed to oppose it.[18] In January 2015, Nancy Walton Laurie, an heiress to the Walmart fortune and a Bel Air resident, filed a lawsuit through her company, LW Partnership, against Hadid.[20] Laurie accused Hadid of damaging the roots of a eucalyptus tree on her property with a retaining wall he built next to her house.[20]\n\nIn December 2015, the Los Angeles city council voted to pursue criminal charges over a claim that Hadid violated local zoning laws. The council alleged he built his house contrary to multiple planning orders and made it twice the permitted size.[21][22] In May 2017, Hadid pleaded no contest to misdemeanor charges stemming from mansion-construction issues for which he did not receive city approval, and was sentenced that July to community service and fines.[23][24]\n\nIn July 2017, he was sentenced to 200 hours of community service, summoned to return $14,191 to the City of Los Angeles in damages, and fined $3,000.[25] He was also given a three-year probation period to ensure the property would comply with existing regulations, or he would face a 180-day jail sentence.[25]\n\nAthletic career\n\nHadid competed in the demonstration sport of speed skiing at the 1992 Winter Olympics, representing Jordan. He was 43 years old at the time. Hadid was encouraged to participate by his friend, Austrian Olympic skier Franz Weber. Hadid was the only member of the Jordanian delegation,[1] and remains the only person to have represented Jordan in the Winter Olympics.[26][27]\n\nTelevision appearances\n\nHadid has appeared on the TV show The Real Housewives of Beverly Hills, as the ex-husband of Yolanda Hadid.[19] He has also appeared on Shahs of Sunset,[18] and Second Wives Club on E! with his fiancée Shiva Safai in 2017.[28]\n\nPersonal life\n\nHadid's first marriage was with Mary Butler, with whom he had two daughters, Alana Hadid and Marielle Hadid. He and Butler ended their marriage in 1992.[29][30]\n\nFrom 1994 until their divorce in 2000, he was married to the Dutch model Yolanda Hadid, née Van den Herik.[31] They had three children, who all became models: Gigi (born 1995), Bella (born 1996),[30] and Anwar (born 1999).[32]\n\nIn 2014, Hadid was engaged to Shiva Safai, a model and businesswoman. She was born in Iran and raised in Norway, and at age 19, moved to Los Angeles with her family.[33] Safai, who is 33 years his junior, began to appear in E! reality show, Second Wives Club in 2017.[34][35] As of December 2019, Hadid and Safai had split, and she was now in a relationship with Niels Houweling.[36]\n\nHadid is a dual Jordanian-American citizen.[1] He does not consider himself a devout Muslim,[11] but has never drunk alcohol, although he does have a 5,000-bottle wine cellar, including some from his own Beverly Hills winery.[15]", "images": ["https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8c/Extended-protection-shackle.svg/20px-Extended-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Mohamed_Hadid", "title": "Mohamed Hadid", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "Mohamed Hadid - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}