{"url": "https://en.wikipedia.org/wiki/Survivor:_Heroes_vs._Healers_vs._Hustlers", "text": "No.\n\noverall No. in\n\nseason Title CBS recap Rating/share\n\n(18-49) Original air date US viewers\n\n(millions) Weekly\n\nrank\n\n513 1 \"I'm Not Crazy, I'm Confident\" Recap 1.8/7[5] September 27, 2017 ( ) 8.33[5] 23[6]\n\nJeff welcomed the 18 new castaways to the 35th season of Survivor. He explained to them that they have been divided into three tribes based on the positive traits most associated with them by others: Heroes, Healers, and Hustlers. Reward Challenge: On the beach nearby, each tribe has an urn which is on fire and is 15 feet in the air. Each tribe is allowed to gather as many supplies as they can until Jeff rings the bell on the boat. Then, each tribe must get all six members on their boat and paddle to the beach. When they get to shore, they must lift one person high enough to light their torch. The first tribe to light their torch wins fire in the form of a massive fire making kit that will be waiting for them back at their camp. The second tribe to light their torch will win flint. The losers will go back to camp with no fire-making tools. During the challenge, Ryan found a secret advantage. The Healers and Heroes came in first and second respectively, while the Hustlers went completely off course. The Healers tribe had no problem creating fire with their kit, while Jessica developed an attraction towards Cole. The next day, Mike decided to look for a hidden immunity idol, but Joe became suspicious of Mike's absence and confronted him over what he had been doing. At the Heroes tribe, a majority formed among Alan, Ashley, Ben, and JP, but Alan was at odds with Ashley and JP over their closer bond, calling them a \"power couple\" before accusing JP of having an idol. At the Hustlers tribe, Patrick and Ali aligned, while Ryan learned his \"secret advantage\" was a \"super immunity idol\" that could be played after the votes were read. This advantage could only be used at the first Tribal Council, meaning he would have to anonymously will it to someone on the losing tribe if his tribe won immunity. Ryan informed Devon of this advantage and offered to use it on him in the event they end up at Tribal Council, forming a final 2 deal. Immunity Challenge: The castaways will race up a cargo net to the top of a tower. Each tribe will then pull a heavy cart up the tower, then hop in and quickly roll down to the bottom. At the bottom will be three different table mazes. The first tribe to reach the mazes will get first choice of which maze they want to tackle. The second tribe will get to choose between the remaining two mazes. The last tribe will be left with the maze that remains. Next, they will work together as a tribe to get their maze to the top of an even taller tower. Once at the top of the tower, two players from each tribe will maneuver three balls through their maze. The first two tribes to finish win immunity. After Ben and Chrissy's poor maneuvering of the maze, the Healers and Hustlers won immunity, sending the Heroes to Tribal Council and forcing Ryan to will his advantage. At the Heroes camp, the majority decided to send Katrina home over Chrissy, but the tension between Alan and Ashley still lingered. Alan later approached Chrissy and Katrina with a plan to vote out Ashley, and tried to convince Ben to join them. Ben tried to assure Alan that Ashley and JP were loyal to them, but Alan was still paranoid about the potential couple. Before Tribal Council, Chrissy learned that she had been given the secret advantage. At Tribal Council, Ashley called Alan out for his irrational behavior, while Alan openly stated that he did not trust Ashley or JP and warned his other tribemates about them becoming a power couple. He also divulged that the initial discussion was between voting out Chrissy and Katrina. Ultimately, the plan to vote out Katrina was followed and she became the first person voted out in a unanimous vote.\n\n514 2 \"I'm a Wild Banshee\" Recap 1.6/6[7] October 4, 2017 ( ) 8.15[7] 20[8]\n\nChrissy felt more secure about her spot in the game after Katrina's elimination. At the Hustlers camp, Simone was pleased with her conquering of the outdoors, but her bragging and laziness set most of her tribemates off, while Ali approached Simone about working together. At the Healers camp, Cole and Jessica bonded over a fishing trip, while Joe began looking for a hidden immunity idol. After misinterpreting the clue as pointing towards the fishing raft, Joe had Cole help him find the idol. At the Heroes camp, JP established himself as the tribe’s provider to keep the target off his back, while Chrissy formed an alliance with Ben after weighing her options. Back at the Hustlers camp, Patrick tried to amuse his tribemates by acting boisterous around camp, but Lauren saw him as too unpredictable to keep around and voiced her concerns to Ali. Reward/Immunity Challenge: Three members of each tribe will swim out to a floating net ring. They will then dive down and maneuver a bundle of puzzle pieces through a cage. Once a tribe has collected all three bundles, the two remaining tribe members will use those pieces to solve a sign post puzzle. The first two tribes to finish win immunity. In addition, the first tribe to finish wins a fishing kit with traps, net, knife, line, lures, and sinkers. The second tribe to finish wins a smaller fishing kit with lines and lures. Despite the Hustlers starting the puzzle first, Simone’s inability to assist resulted in the Healers & Heroes placing first and second respectively. Simone apologized to the tribe for costing them the victory and asked Lauren to join her in voting out Patrick. Patrick and Ryan agreed on voting out Simone, while Ali weighed her options with Ryan. At Tribal Council, Patrick and Simone each pled their case, with Patrick stating tribe strength was important while Simone stated that trust was more important. In an accidental slip-up, Patrick said he could trust most of his tribemates, when he meant to say “all,” raising some concern amongst his tribemates. However, Patrick was spared, and Simone was unanimously voted out.\n\n515 3 \"My Kisses Are Very Private\" Recap 1.7/7[9] October 11, 2017 ( ) 8.02[9] 19[10]\n\nThe morning after Simone’s elimination, Ryan and Patrick agreed on a guys’ alliance with Lauren as their first target, while Lauren still wanted Patrick gone, as Patrick’s social game was lacking. Patrick also openly searched for a hidden immunity idol, which caused his tribemates to distrust him. Ali tried to convince Patrick to calm down, and he appreciated that she was looking out for him. At the Heroes camp, Ben and Chrissy were torn between voting out JP or Alan. Ben was wary about JP and Ashley’s perceived status as a power couple, while Alan struggled with camp life. At the Healers camp, Cole and Jessica’s mutual romantic interest continued. Joe believed that Mike would be a unanimous target, but Cole told Jessica about Joe’s idol. After Joe complained about the way Roark prepared food and threw it away instead of offering it to his tribemates, Cole prematurely leaked the idol information to Roark and Desi, to Jessica’s shock and dismay. Immunity/Reward Challenge: All tribe members race through a series of obstacles. They use sandbags to knock blocks off a ledge. Next, they will stack those blocks one on top of the other. The first two tribes to finish win immunity. In addition, the first tribe to finish wins four live chickens. The second tribe to finish wins a dozen eggs. The Heroes placed first, while the Healers placed second despite forgetting a block. Patrick’s refusal to swap out during the throwing segment led to another loss for the Hustlers, and he apologized for his actions in the challenge. Lauren was angry with Patrick, and the way he responded to her asking if she was the target due to his selfish competitiveness in the challenge set her off even more. Ali, Devon, and Ryan debated whether to vote out Lauren or Patrick. At Tribal Council, Lauren passionately campaigned for Patrick’s elimination. Patrick promised to integrate with his tribe better, but they never gave him the chance; after being voted out unanimously, Patrick had harsh words for his former tribemates as his torch was snuffed, and he became the third person eliminated from the game.\n\n516 4 \"I Don't Like Having Snakes Around\" Recap 1.8/7[11] October 18, 2017 ( ) 8.12[11] 17[12]\n\nOn day 9, the castaways were surprised when Jeff announced a tribe swap. The new Levu tribe consisted of Heroes Alan & Ashley, Healers Desi & Joe, and lone Hustler Devon. The new Soko tribe consisted of Heroes Chrissy & JP, lone Healer Roark, and Hustlers Ali & Ryan. The new Yawa tribe consisted of lone Hero Ben, Healers Cole, Jessica & Mike, and lone Hustler Lauren. Jeff also announced a winner-take-all reward challenge to test how well the new tribes worked together. Reward Challenge: Three members of each tribe will be attached to a braided rope and must work together to untangle themselves and progress through a course. They will then use the rope to hook a sled and pull it back to them. The two remaining tribe members will use the pieces on the sled to solve an upright puzzle. The first tribe to finish wins a feast of peanut butter and jelly sandwiches and an individual bag of potato chips for each tribe member. By a narrow margin, Jessica and Mike solved their puzzle for Yawa first, winning reward for their tribe. As the new Yawa tribe members got to know each other better, Jessica discovered a secret advantage in her bag of chips that allowed her to block a person from voting, to be used only at the next Tribal Council. She told Cole and Mike to build trust and keep the original Healers tribe intact, but Cole used the information to gain trust with Ben and Lauren, confusing the latter as to why he would tell her about it. She told Mike, who confronted Jessica and Cole about telling Lauren. After initial denials, Cole admitted only to telling Ben, which upset Jessica. At the new Soko tribe, Roark worried about her position within the tribe as the lone Healer, while Ryan and Chrissy aligned after he told her he was the one who gave her the super idol for the first Tribal Council. At the new Levu tribe, Ashley and Alan put aside their differences to target a Healer, while Joe told Devon the Heroes were targeting him so that he would side with the Healers, but Devon saw through the lie. Immunity Challenge: Each tribe will race out to a large crate of puzzle pieces. Next, they will maneuver their crate through a series of obstacles. Once they reach the finish, they will unlock their second set of puzzle pieces. They will arrange those pieces so to complete a giant puzzle. The first two tribes to finish win immunity. Yawa easily finished first, while Soko placed second. At the Levu camp, Devon was the swing vote; he asked Ashley if she was targeting him, which she denied. Desi overheard the conversation and relayed it to Joe, who presumed that Devon would side with the Heroes. In an effort to get the target on his back so he would play his immunity idol, Joe confronted his entire tribe, and a heated argument ensued between him and Alan. Desi tried to convince Joe to give her his idol to gain her trust, while Devon saw that he received Jessica’s advantage, not to be opened until voting took place. At Tribal Council, Joe targeted Ashley as the weakest link, while the old Heroes & Healers each campaigned for Devon’s vote. Devon opened his advantage and was shocked to learn his vote had been blocked. Before the votes were read, Joe stood up to play his idol. After some deliberation, he decided to play it for himself after catching Ashley’s facial expression, and the two votes against him were negated. The Healers’ votes went against Alan, and he was eliminated.\n\n517 5 \"The Past Will Eat You Alive\" Recap 1.7/7[13] October 25, 2017 ( ) 8.22[13] 17[12]\n\nAt the Yawa camp, the loud crackling of bamboo in the fire reminded Ben of his difficult time in the United States Marine Corps. He removed himself from the camp to clear his head, while his tribemates showed concern for his well-being. Reward Challenge: The contestants will have their arms and legs bound together and must slither through the sand while pushing a ball relay style through the course. When they reach the finish, the remaining tribe member will shoot five balls into a very high and narrow basket. The first tribe to finish will win iced coffee, pastries, extra coffee, and tea to take back to camp. The second tribe to finish gets one jug of iced coffee. Levu easily cruised to first place, and Yawa placed second after Ryan struggled for Soko in the challenge. Devon still felt threatened by Joe and pledged his allegiance to Ashley, and they discussed bringing in Desi against Joe. At the Soko camp, Ryan apologized for losing the challenge for his tribe, but relied on his social game to further himself. Roark still felt uneasy about her position within the tribe and aligned with Ali, who suggested to Ryan that they target Chrissy. Ryan was reluctant to turn against Chrissy, but he kept his options open. At the Yawa camp, Cole annoyed his tribemates with his poor eating manners, while Mike and Jessica discovered a hidden immunity idol at the water well. Immunity Challenge: The contestants will swim out to a boat and retrieve three bags of rice, push them through a hole and transport them across a balance beam to shore. They must then tear open each bag to retrieve three balls and maneuver them through a balance maze. The first two tribes to finish win immunity. Yawa placed first and Levu placed second, sending Soko to their first Tribal Council of the season. Chrissy approached Roark about strategy for the first time, but Roark targeted Chrissy for her poor challenge performance; to save herself, Chrissy told JP that Roark proposed an all-girls’ alliance, and JP instantly agreed to vote out Roark. Ali again talked to Ryan about voting out Chrissy, and Ryan realized he was the swing vote. At Tribal Council, Roark and Chrissy each campaigned against the other, but ultimately, Ryan sided with Chrissy to eliminate Roark from the game.\n\n518 6 \"This is Why You Play Survivor\" Recap 1.6/6[14] November 1, 2017 ( ) 7.69[14] 20[15]\n\nAli confronted Ryan over why he left her out of the vote against Roark, and a defensive Ryan replied that he was scared of Ali and Roark’s bond. Ali and Ryan subsequently got into an argument. At the Yawa camp, Mike caught a small fish and accidentally dropped it in the fire, but he recovered it and even shared the fish with his tribemates, while Cole ate a bigger fish for himself, annoying Ben. Cole continued to agitate his tribemates by arguing that he hadn’t been eating enough. Reward Challenge: The castaways will race through an obstacle course; pairs of castaways will carry a buoy using poles across a teeter-totter balance beam, which will release a key that is used to unlock the tribe’s boat. They must untie the knots and pull the boat to a platform where one tribe member will use a slingshot to knock down two targets. The first tribe to finish wins 10 pizzas and soft drinks, and the second tribe to finish wins one cheese pizza to share. Soko placed first and Yawa placed second after Levu was unable to recover from their bad start. Ryan anticipated a merge and considered blindsiding JP for being a physical threat. At the Levu camp, Ashley tried to turn Desi against Joe, and Desi considered making that move. Meanwhile, Devon tried to keep an eye on Joe to make sure he wouldn’t scheme, but when he turned his back, Joe found a clue to a hidden immunity idol. That night, while everyone else was asleep, Joe followed the clue to the idol’s location. At the Yawa camp, Cole passed out from hunger, but after Mike and Jessica tended to him, he felt fine. Ben and Mike subsequently discussed getting rid of Cole due to his perceived weakness. Immunity Challenge: The tribe must work together to balance a plate using 5 ropes, 4 of which are held by the tribe (1 by each member). Players must make their way to the center, one by one, and stack blocks that spell “IMMUNITY.” The first two tribes to finish win immunity. Each tribe lost their stack at least once, but Yawa and Levu won the challenge, sending Soko to Tribal Council once again. Ryan and Chrissy were torn between voting out JP or Ali; Chrissy did not trust Ali, but recognized JP as a physical threat. At Tribal Council, the tribe discussed the impending merge and how JP’s laidback approach to strategy made him tough to read. In the end, Ryan and Chrissy voted against Ali, sending her home.\n\n519 7 \"Get to Gettin'\" Recap 1.6/6[16] November 8, 2017 ( ) 7.82[16] 21[17]\n\nChrissy felt like she was in a power position due to both Ryan and JP wanting to work with her. At the Levu camp, the tribe's food supply was depleted. When the tribes arrived at what looked like a reward challenge, Jeff announced the merge, as well as a large steak feast. During the feast, Chrissy became irritated at Joe's mannerisms and tried to realign with Ben, who was worried that the others might hear their conversation. At the new camp, Cole unsuccessfully attempted to find an advantage while building the new shelter. The Healers reunited, with plans to bring in Ben and Lauren from the old Yawa tribe, while the Heroes & Hustlers aligned against the Healers. Devon approached Lauren about turning against the Healers, but she instantly told Mike. Devon also approached Chrissy and Ben about voting out either Joe or Cole; Ben still wanted Cole gone for personal reasons, while Jessica and Mike warned Cole that he was in danger. Immunity Challenge: Using centrifugal force, the castaways must keep a ball spinning within a wheel as they stand on individual balance beams. At regular intervals, the castaways will be made to step forward onto narrower parts of the beam. If at any point the ball drops or a castaway falls off the beam, the castaway loses the challenge. The last castaway with a spinning ball wins immunity. Desi outlasted Ashley to win the challenge. Cole apologized to Ben, who pretended to forgive him and realized he might have to continue with Cole to benefit his own game. Mike suggested to the rest of the Healers that they target Chrissy due to her intelligence, while Lauren tried to convince Ben to stick with the Healers. Chrissy and her allies came up with a \"Plan B\" to vote against Jessica in case of an idol. At Tribal Council, Joe went off on the tribe and openly wore his idol from the Levu camp. Before the votes were read, Joe played the idol for himself, but didn't receive any votes, while Ben and Lauren sided with the Heroes & Hustlers to blindside Jessica.\n\n520 8 \"Playing with the Devil\" Recap 1.7/6[18] November 15, 2017 ( ) 8.85[18] 18[19]\n\nThe Healers lamented being in the minority, while Lauren found the secret advantage Cole looked for after the merge. She learned that she could vote twice at a Tribal Council of her choice, provided she abstained from voting at the next Tribal Council. Reward Challenge: Randomly divided into two teams of five, castaways must race to the top of a tower. At the top of the tower, they will have to use a slingshot and sandbags to hit five targets. The first team to hit all five targets, indicated by a flag being released, wins a spaghetti dinner on a private island. In addition, the castaway drawing the odd-colored rock will join them. Since Joe drew the white rock, he got to join the winning team of Chrissy, Cole, Devon, JP, and Ryan. Jeff revealed the feast would be served family-style, meaning players would eat one at a time and must leave enough food for the next person, with Joe choosing the order. Joe ate last and suggested that Devon eat first, in an attempt to build trust with Devon. While eating, Cole found a clue to the location of a new hidden immunity idol under the plate, and he made sure to cover it up using a nearby cloth. However, Chrissy and Ryan both discovered the clue, and Ryan hid the plate in the bushes after he was finished eating. Back at camp, Ryan took advantage of Cole going off on his own and quickly found the idol, then asked Chrissy to cover up his tracks. Cole dashed in to ambush Chrissy before most of the tribe joined them. Ben believed he saw Cole find it and began to target him again. Immunity Challenge: Standing on a narrow beam and using a long pole, castaways must balance a statue. At regular intervals, they will move further away from the statue. If at any point, they fall from the beam or drop their statue, they are out of the challenge. The last person left standing wins immunity. Cole outlasted JP to win the challenge, foiling the plans of the majority alliance. Ben suggested splitting the vote between Joe and Desi, who had proven to be a strong competitor. Joe tried to convince Ryan and Devon to blindside Ben, whom Joe perceived as the leader of the alliance, but Ben overheard the conversation. Ben confronted Joe, who accused him of swearing on the Marines; this angered Ben, and the two got into a heated argument. Lauren told Ben of her advantage and how it would prevent them from splitting the votes at that night’s Tribal Council; Ben then asked Mike to join his alliance in voting out Joe in fear of the vote split causing a scenario where he would be voted out. At Tribal Council, Joe reignited his argument with Ben, who opened up about his time after the Marines. During the vote, Lauren was able to play her advantage without being caught, Cole and Mike joined in the majority alliance's split-vote plan, and the votes were tied at 4 apiece between Joe and Desi while Ben and Lauren each received a stray vote. On the revote, Desi received 7 votes to Joe's 1 and became the first member of the jury.\n\n521 9 \"Fear of the Unknown\" Recap 1.4/5[20] November 22, 2017 ( ) 7.42[20] 15[21]\n\nThe next morning, Mike pitched an idea to the majority alliance to blindside Cole at the next Tribal Council. Meanwhile, Lauren told Ben about her successful advantage play, and Ryan told Devon about his immunity idol. Reward Challenge: Randomly divided into two teams of five, three castaways will swim out to a tall ladder, climb it, leap into the water, and retrieve a key on a buoy. Once they have the keys, the next two will unlock a chest containing balls. They will then have to score five baskets to win a feast on a luxury yacht. The team of Chrissy, Cole, Joe, JP, and Mike won the challenge. Joe hoped to use the reward to sway Chrissy and JP to his side, but his efforts were for naught. At camp, Joe capitalised on his tribemates' perception of him as obnoxious and abrasive by calling Ashley a goat in order to make them believe he would never win a jury vote at Final Tribal and thus they would not vote him out. Ryan told Ben about his idol, and while Ben was excited about his ally finding it instead of Cole, he also realized it would make Ryan a threat to him in the future. Ben told Devon, who started to lose trust in Ryan because he wasn't the only one who knew about Ryan's idol. Immunity Challenge: Castaways will have to stand up slightly in a squatting position, releasing the safety from their apparatus holding up an urn of water above a fire. Should they stand too high, their urn will extinguish their fire, or if they go too low, will release a flag eliminating them from the challenge. The last castaway standing wins immunity. Lauren outlasted Cole to win immunity. Back at camp, Ben wanted to split the vote between Cole and Mike, but Chrissy and Ashley were fed up with Joe. Ben was very adamant about wanting to vote out either Cole or Mike, causing some discord among the majority. After Chrissy was shut down by Ben about Joe's status as a threat despite being widely disliked, she discussed deviating from Ben's plan and voting out Joe with her allies and Mike. Before Tribal Council started, Mike told Joe to follow his lead. Chrissy confronted Joe about insulting her and Ashley before Mike outlined the hypocrisy in her argument, stating that, by keeping Joe in the game, the rest of the castaways were not playing with moral character. Joe accused everyone else of not playing the game at all, and Mike brought up the fact that the majority had 4 Heroes and 3 Hustlers, meaning the Hustlers would be picked off one by one at that point after voting out the rest of the Healers. Ashley countered Mike's point by outlining that his comment was just as hypocritical as Chrissy's opening one, that nobody is just a number and that morals and relationships do serve a purpose in the game. Before the votes were read, Mike played his idol for himself, but received only 2 votes. Ultimately, Ben got his way, and everyone else voted Cole out.\n\nAfter the heated Tribal Council, Mike revealed his blowup was a calculated plan to ensure the vote went against him so he would play his idol. Reward Challenge: Using only their feet, castaways must unwind a rope to release blocks that they will use to assemble a three-tiered tower with a flag in the middle. The first castaway to complete their tower will win an aerial tour of the Sacred Islands and a feast of cheeseburgers, fries, and beer. Lauren won the challenge and chose to share the reward with Devon, Ben, and Ashley. At camp, Ryan and Chrissy discussed voting out Ben and Lauren after Joe and Mike. While on reward, Lauren revealed she chose Devon, Ben, and Ashley due to her plans for a 4-person alliance to shake up the game, and they were in agreement. The castaways on the reward trip received letters from home. The next morning at camp, while reading his letter, Ben stumbled upon a clue to the location of a new hidden immunity idol, which he eventually found. Immunity Challenge: Perched on a roof-shaped structure, castaways will have to balance on narrow beams. After 20 minutes, castaways will move up the structure, standing on a narrow beam. If at any point a castaway touches the structure with any body part other than their feet, or they fall off, they are out of the challenge. The last person left standing wins immunity. Before the challenge started, Jeff tempted the castaways with food; Devon, Ben, and Lauren sat out, and Ashley won immunity. Back at camp, Lauren’s new alliance prepared their revolt, with Devon assigning Ben to be their “double agent”, voting against Mike, while Lauren and Ashley asked Joe and Mike to join them. At Tribal Council, Lauren’s alliance put their plan in motion, completely blindsiding JP and sending him to the jury. After Tribal Council, a stunned Chrissy and Ryan confronted their former allies about leaving them out of the vote. Ryan tried to make amends with Devon, but he was unable to do so. Reward Challenge: Randomly divided into two teams of four, castaways will swim out to a boat. They will then paddle to shore, collecting 4 bags of logs along the way. Back on shore, they will use the logs to push out puzzle pieces from a chute. The first team to finish their puzzle wins a spa trip with a feast. The team of Ashley, Ben, Devon, and Joe won the challenge. On the reward trip, Ashley considered turning against Ben. Back at camp, Ryan unsuccessfully tried to sway Mike to his side, and Chrissy also failed with Lauren. Immunity Challenge: Using a driving wheel, castaways drive a key hanging on an urn through a series of obstacles. The key will unlock a set of puzzle pieces. Using the driving wheel, they must transport the puzzle pieces to the finish. The first person to solve the word puzzle “INVULNERABLE” wins immunity. Chrissy won the challenge. At camp, Lauren told her alliance about her second vote, and Devon told Mike and Joe that they would use it to split the votes between Ryan and Ben, when in reality, the alliance planned to stick together to blindside Joe. In private, Ashley told Lauren and Devon she was having second thoughts about staying loyal to Ben. At Tribal Council, Ben continued his charade of being on the outside, but he warned Joe and Mike that they were on the bottom of the new alliance. Before the vote, Ryan played his idol but received only 2 votes. Ultimately, the alliance of 4 stuck together and sent Joe to the jury.\n\n523 11 \"Not Going to Roll Over and Die\" Recap 1.8/7[24] December 6, 2017 ( ) 8.96[24] 11[25]\n\nChrissy angrily confronted Ben about his betrayal, and they got into an argument. When the castaways arrived at the reward challenge, they were reunited with their loved ones: Ashley’s father Jim, Ryan’s father Steve, Mike’s wife Bari, Lauren’s sister Sunny, Chrissy’s husband Keith, Devon’s mother Sonia, and Ben’s wife Kelly. Reward Challenge: The castaways will conduct this challenge with their loved ones. Each person will have a bag with black and white marbles. Both the castaways and their loved ones must draw the same-colored marble to remain in the challenge. The last pair left standing wins a Survivor barbeque and quality time with each other. All except Ben and Chrissy failed to match on the first round. In the second round, Ben failed to match while Chrissy was able to. After winning reward, Chrissy chose Ryan, Mike, and Ashley, as well as their loved ones, to join her and her husband. Chrissy later revealed she chose Ashley because she felt that Ashley would be the easiest to turn against the majority. Ben made a fake idol in hopes that Chrissy would find it, while Lauren found half of a real idol, showing it to Ben and Devon, with the other half hidden at the immunity challenge. Immunity Challenge: The castaways must support two discs, weighted by wind chimes, supported by two posts with only their fingertips. If they drop their discs, they are out of the challenge. The last person left standing wins immunity. Devon conceded immunity to Ashley for a massage, stating that they were a tight alliance, to the others' concern. Lauren picked up the second half of the idol at the challenge, but was seen by Ben. Ashley continued to talk to Devon and Lauren about blindsiding Ben, but he overheard the conversation. After they agreed on voting out Chrissy, a paranoid Ben realized how much power Lauren had in the game, between her idol and the extra vote. He got Mike and Ryan on board with voting out Lauren and tried to convince Chrissy, but she was still angry with him. She told Mike she wanted Ben out, and Mike told Ashley and Devon that Ben had told Chrissy about Lauren’s power. Devon warned Lauren that she was in danger, and Lauren gave the other half of the idol to Mike to show him she trusted him. At Tribal Council, Devon said he stepped down at the immunity challenge to show his trust in his alliance, not including Ben. Ben subsequently confronted his tribemates about potentially voting him out, and he said flat-out that he would vote for Lauren. Lauren revealed she left her extra vote at camp, while Ben revealed his fake idol. Mike then tossed the half of Lauren’s idol that he had into the fire. While the tribe openly quarreled among each other, Ryan whispered to Mike that Lauren had to go, but Devon walked over to Mike with the intention to turn against Ben; this made Chrissy walk to Ryan to say she was on board with voting out Lauren. She refused when Mike and Ryan asked her to vote out Ben. In the end, everyone voted for Ben. However, unbeknownst to the others, Ben also had his real idol; he played it on himself, and for the first time in Survivor history, a unanimous vote was successfully negated. Ben’s sole vote sent Lauren out of the game, much to the shock of the other jury members, except Joe.\n\n524 12 \"The Survivor Devil\" Recap 1.8/7[26] December 13, 2017 ( ) 8.74[26] 11[27]\n\nAfter the hectic Tribal Council, the tribe dynamic was Ben vs. everyone else. Ben woke up early the next morning to search for a new hidden immunity idol, and nobody followed him, as they believed he wouldn't find it. Reward Challenge: Randomly divided into three pairs, castaways are clipped to a rope and must maneuver together through three obstacles. Once they have reached the end of the course, they will unclip themselves and attempt to throw rings onto a target. The first pair to get all five rings on the target wins an overnight stay at a private island with a feast. Devon and Chrissy won the challenge; Jeff instructed them to take one more person, and Chrissy suggested to Devon that they select Ryan. They did so, much to Ashley's shock and chagrin. Mike was also frustrated, as he saw himself as a swing vote. Ben tried to talk strategy with Mike and Ashley at camp, but neither of them wanted any part of it. On reward, Chrissy proposed a final 3 deal with Ryan and Devon. She also considered voting out Ashley before Ben, out of fear that she has built better relationships in the game than Ben. Immunity Challenge: The castaways must first climb a ladder and go down a cargo net. Then will then have to traverse a series of obstacles, where they will then untie a bag containing sandbags. Using the sandbags, they must get one into a basket, which will release the first ladder on a tower. One the second level, castaways will then use a ball and rope to pull down a second ladder. On the top of the tower, castaways then have to solve a cog puzzle. The first person to finish the puzzle and hoist their flag wins immunity. Chrissy won immunity. Ben continued his search for an idol, while Ashley suggested splitting the vote between Ben and Mike. Chrissy began campaigning for Ashley's elimination, but Mike desperately wanted Ben out, while Devon was reluctant to turn against Ashley. Ben eventually found a clue saying the idol was hidden under the shelter. At Tribal Council, final 3 discussions and potential plans were brought up. Devon continued campaigning against Ben, who subsequently revealed he did find the idol. He convinced Ashley to vote for Mike, and when Devon said he didn't believe Ben would play the idol, Ben presented the idol to Jeff to play on himself before the votes were to be cast. Ashley did vote for Mike, but everyone else, including Devon, blindsided Ashley, sending her to the jury.\n\n525 13 \"Million Dollar Night\" Recap 1.9/8[28] December 20, 2017 ( ) 8.70[28] 8[29]\n\nAs the tribe returned from Tribal Council, Chrissy, Devon, Mike, and Ryan reinforced their desire to vote out Ben, who searched for a newly hidden idol all night. He found it early the next morning, marking his third consecutive idol discovery. Chrissy attempted to bury the hatchet with Ben in order to keep herself in the game in case Ben won immunity (not knowing he had found another idol), but Ben still wanted to vote her out. Reward/Immunity Challenge: Castaways will swim out and then climb a stack of crates. Jumping off the crates, they must grab a bag of keys. Castaways will then swim to a balance beam, and cross it, while getting a second set of keys. Using their keys, castaways will unlock their puzzle. Castaways must move balls around so they match the corresponding color in the chute. The first person to solve their puzzle wins immunity and a feast of comfort food. Chrissy won immunity and chose to share her reward with Mike and Devon. They searched for an idol clue on reward, but they were unable to find one. Chrissy told Mike and Devon about her super idol from the first Tribal Council, and planned to trick Ben into thinking she had found a new idol so that he wouldn't search for one himself. Ben let them think he believed them, but the joke was on them, as he had found the real one that morning. Devon felt uneasy about Ben's nonchalant attitude about getting voted out at the next Tribal Council, and he told Ryan he was considering voting against Mike, but Ryan tried to talk him out of it. At Tribal Council, Chrissy pulled out her now-defunct super idol and continued her charade, while Ben continued acting as though he would get voted out that night. Before the votes were read, Chrissy offered her idol to her alliance; Mike was prepared to play it to continue the sham, but Ben pulled out his idol to play on himself, negating the three votes against him and shocking the other four players. Devon did vote against Mike, but Ben voted against Devon, creating a tie. Ben, Chrissy, and Ryan went to revote; Mike, the last Healer remaining, was eliminated after receiving two votes to Devon's one. After Mike left Tribal Council, Jeff surprised the final 4 by revealing there was one more twist left in the game. Upon returning to camp, the castaways were on edge about what the twist might be. Immunity Challenge: Castaways will have to stack letter blocks on a wobbly platform. The first person to correctly spell \"Heroes,\" \"Healers,\" and \"Hustlers\", without any upside down letters wins immunity and is guaranteed a spot in the Final Tribal Council. Chrissy tied the record for most individual immunity wins by a woman, winning her fourth challenge after several drops by all castaways. Chrissy also received the twist, which was revealed to be a final game advantage. This gave her the power to choose one person to bring to the Final Three with her, with the other two castaways going to a fire-making challenge to determine who would get the last spot in the Final Three and who would be the last jury member. Chrissy felt like Devon would have a better chance to beat Ben than Ryan would; she told Devon and Ryan her plans with the advantage, and Devon broke the flint while practicing his fire-making skills. At Tribal Council, Chrissy revealed her advantage to the jury and Ben. She voted to take Ryan to the end, and Ben won the ensuing firemaking challenge, making Devon the final member of the jury. Chrissy, Ben, and Ryan enjoyed the traditional Day 39 breakfast. That night, the finalists and the jurors convened for the Final Tribal Council. Like he did in Game Changers, Jeff led a moderated discussion that focused on the three aspects of the game, \"Outwit,\" \"Outplay,\" and \"Outlast.\" During the discussion, Ryan was chastised for his perceived laziness at camp and his weak post-merge strategic game, Chrissy was praised for her challenge prowess, and Ben was applauded for his strong strategic game; however, both Chrissy and Ben were castigated for their poor social games, with Ben taking most of the heat. Ben opened up to the jury about his post-traumatic stress disorder and how he had learned to live with it, stating that he hoped to help show fellow veterans that while life after the military is difficult, there is more to look forward to in the future.\n\n526 14 \"Reunion Special\" N/A 1.2/5[28] December 20, 2017 ( ) 5.97[28] 17[29]", "images": ["https://upload.wikimedia.org/wikipedia/en/5/53/Survivor_heroes_healers_hustlers_region_1_dvd_s35.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/5/53/Survivor_heroes_healers_hustlers_region_1_dvd_s35.png/220px-Survivor_heroes_healers_hustlers_region_1_dvd_s35.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Desiree_Williams.jpg/220px-Desiree_Williams.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/5/53/Survivor_heroes_healers_hustlers_region_1_dvd_s35.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Survivor:_Heroes_vs._Healers_vs._Hustlers", "title": "Survivor: Heroes vs. Healers vs. Hustlers", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/5/53/Survivor_heroes_healers_hustlers_region_1_dvd_s35.png", "width": 640, "height": 910}, "title": "Survivor: Heroes vs. Healers vs. Hustlers - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}