{"url": "https://www.hollywoodreporter.com/live-feed/bachelor-paradise-resume-production-investigation-finds-no-misconduct-1015130", "text": "Bachelor in Paradise will resume filming after an internal investigation by Warner Bros. Television found no misconduct occurred on the set of the reality series.\n\n“As we previously stated, we recently became aware of allegations regarding an incident on the set of Bachelor in Paradise in Mexico,” Warner Bros. said Tuesday in a statement. “We take all such allegations seriously. The safety, security and well-being of the cast and crew is our number one concern, and we suspended filming so that the allegations could be investigated immediately and thoroughly. Our internal investigation, conducted with the assistance of an outside law firm, has now been completed. Out of respect for the privacy interests of those involved, we do not intend to release the videotape of the incident. We can say, however, that the tape does not support any charge of misconduct by a cast member. Nor does the tape show, contrary to many press reports, that the safety of any cast member was ever in jeopardy. Production on this season of Bachelor in Paradise will be resuming, and we plan to implement certain changes to the show’s policies and procedures to enhance and further ensure the safety and security of all participants.”\n\nThe news comes a little more than a week after Warner Bros. suspended production to launch an investigation into allegations of misconduct on the Mexico set of the series. It’s unclear whether the suspension will delay the launch of season four, which was originally slated to debut on Aug. 8. ABC confirmed Tuesday that Bachelor in Paradise season four will still air this summer; the network, however, did not disclose an exact premiere date.\n\n“We appreciate the swift and complete investigation by Warner Bros. into allegations of misconduct on the set of Bachelor in Paradise,” a network spokesperson said in a statement. “Given their results, the series will resume production, and will air this summer on ABC.”\n\nSeries creator Mike Fleiss and longtime Chris Harrison also weighed in Tuesday shortly after Warner Bros. and ABC confirmed the show’s return.\n\nSee you on the beach!!! — Mike Fleiss (@fleissmeister) June 20, 2017\n\nThank you for your patience, trust and loyalty #BachelorNation and to our entire Bachelor family — Chris Harrison (@chrisbharrison) June 20, 2017\n\nBecause of the production suspension, Bachelor in Paradise still has a considerable amount left to film. A source tells The Hollywood Reporter the show was originally scheduled to shoot through June 27, but the series has limited footage in the can, including the first one-on-one dates. The spinoff had yet to shoot the first rose ceremony when production was suspended. However, producers are confident they’ll be able to work with whatever limited schedule they have to complete filming on season four.\n\nAfter announcing the cast for this summer’s season on June 6, Warner Bros. halted production shortly after to investigate a misconduct incident on the Sayulita, Mexico, set. A producer filed a complaint over an alleged sexual encounter between two contestants who had been drinking, Corinne Olympios and DeMario Jackson. It remains unclear if the producer witnessed the incident or had seen the footage, though sources tell The Hollywood Reporter that Olympios was “lucid” and “conversational” on the tape. Still, since alcohol was involved, there was a question of whether one or both parties may have been too intoxicated to give consent.\n\nThe season four castmates were sent back to the U.S. the same day Warner Bros. announced the investigation, with most arriving home by June 12. When the cast was told to pack their bags, they were informed that they “might” return. It remains unclear if either Jackson or Olympios will return to continue filming. Jackson had no comment on Warner Bros.’ decision, and Olympios‘ rep could not immediately be reached for comment.\n\nMany headlines quickly flooded Bachelor Nation, though few facts have been confirmed. Both Olympios and Jackson have lawyered up, with Olympios retaining top Hollywood litigator Marty Singer and Jackson hiring Los Angeles-based attorney Walter Mosley. It’s unclear whether either contestant has seen the tape in question since retaining counsel.\n\nThe controversy comes as ABC has been generating good buzz and ratings for its diverse season of The Bachelorette, airing now. For the first time in the franchise’s 15-year run, Rachel Lindsay is leading a historic season as the franchise’s first black lead. The 13th cycle of the dating competition made a strong return with its May 22 premiere, averaging 5.7 million viewers. The Bachelor franchise is also set to launch a new spinoff, Bachelor Winter Games, early next year opposite the Olympics.\n\nBachelor in Paradise reunites former castoffs of The Bachelor and The Bachelorette in hopes they find love with other stars of the franchise. Last year’s cycle ended with three engagements, and the one remaining couple, Evan Bass and Carly Waddell, returned to Paradise over the weekend to tie the knot for the cameras. Bass defended the show against cancellation in a column for THR ahead of his June 17 wedding.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/bachelorinparadise_featuredimage-936x482-h_2017_0.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/bachelorinparadise_featuredimage-936x482-h_2017_0.jpg?w=1024", "keywords": [], "authors": ["Jackie Strause Kate Stanhope", "Jackie Strause", "Kate Stanhope"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/bachelor-paradise-resume-production-investigation-finds-no-misconduct-1015130/", "title": "‘Bachelor in Paradise’ to Resume Production After Investigation Finds No Misconduct", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Producers Warner Bros. Television plan to \"implement changes to the show’s policies and procedures to enhance and further ensure the safety and security of all participants.\"", "news_keywords": "Bachelor In Paradise", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Kate Stanhope", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1015130, "title": "'Bachelor in Paradise' to Resume Production After Investigation Finds No Misconduct", "published_at": "2017-06-20 09:46:25", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/bachelorinparadise_featuredimage-936x482-h_2017_0.jpg?w=1024", "comment_count": 0, "tags": "Bachelor In Paradise", "topics": "TV News", "body": "Bachelor in Paradise will resume filming after an internal investigation by Warner Bros. Television found no misconduct occurred on the set of the reality series.\r\n“As we previously stated, we recently became aware of allegations regarding an incident on the set of Bachelor in Paradise in Mexico,\" Warner Bros. said Tuesday in a statement. \"We take all such allegations seriously. The safety, security and well-being of the cast and crew is our number one concern, and we suspended filming so that the allegations could be investigated immediately and thoroughly. Our internal investigation, conducted with the assistance of an outside law firm, has now been completed. Out of respect for the privacy interests of those involved, we do not intend to release the videotape of the incident. We can say, however, that the tape does not support any charge of misconduct by a cast member. Nor does the tape show, contrary to many press reports, that the safety of any cast member was ever in jeopardy. Production on this season of Bachelor in Paradise will be resuming, and we plan to implement certain changes to the show’s policies and procedures to enhance and further ensure the safety and security of all participants.” \r\n\r\nThe news comes a little more than a week after Warner Bros. suspended production to launch an investigation into allegations of misconduct on the Mexico set of the series. It's unclear whether the suspension will delay the launch of season four, which was originally slated to debut on Aug. 8. ABC confirmed Tuesday that Bachelor in Paradise season four will still air this summer; the network, however, did not disclose an exact premiere date.\r\n“We appreciate the swift and complete investigation by Warner Bros. into allegations of misconduct on the set of Bachelor in Paradise,\" a network spokesperson said in a statement. \"Given their results, the series will resume production, and will air this summer on ABC.”\r\n\r\nSeries creator Mike Fleiss and longtime Chris Harrison also weighed in Tuesday shortly after Warner Bros. and ABC confirmed the show's return.\r\n\r\n\tSee you on the beach!!!\r\n\t— Mike Fleiss (@fleissmeister) June 20, 2017\r\n \r\n\r\n\tThank you for your patience, trust and loyalty #BachelorNation and to our entire Bachelor family\r\n\t— Chris Harrison (@chrisbharrison) June 20, 2017\r\nBecause of the production suspension, Bachelor in Paradise still has a considerable amount left to film. A source tells The Hollywood Reporter the show was originally scheduled to shoot through June 27, but the series has limited footage in the can, including the first one-on-one dates. The spinoff had yet to shoot the first rose ceremony when production was suspended. However, producers are confident they'll be able to work with whatever limited schedule they have to complete filming on season four.\r\nAfter announcing the cast for this summer's season on June 6, Warner Bros. halted production shortly after to investigate a misconduct incident on the Sayulita, Mexico, set. A producer filed a complaint over an alleged sexual encounter between two contestants who had been drinking, Corinne Olympios and DeMario Jackson. It remains unclear if the producer witnessed the incident or had seen the footage, though sources tell The Hollywood Reporter that Olympios was \"lucid\" and \"conversational\" on the tape. Still, since alcohol was involved, there was a question of whether one or both parties may have been too intoxicated to give consent.\r\n\r\nThe season four castmates were sent back to the U.S. the same day Warner Bros. announced the investigation, with most arriving home by June 12. When the cast was told to pack their bags, they were informed that they \"might\" return. It remains unclear if either Jackson or Olympios will return to continue filming. Jackson had no comment on Warner Bros.' decision, and Olympios' rep could not immediately be reached for comment.\r\nMany headlines quickly flooded Bachelor Nation, though few facts have been confirmed. Both Olympios and Jackson have lawyered up, with Olympios retaining top Hollywood litigator Marty Singer and Jackson hiring Los Angeles-based attorney Walter Mosley. It's unclear whether either contestant has seen the tape in question since retaining counsel.\r\n\r\nThe controversy comes as ABC has been generating good buzz and ratings for its diverse season of The Bachelorette, airing now. For the first time in the franchise's 15-year run, Rachel Lindsay is leading a historic season as the franchise's first black lead. The 13th cycle of the dating competition made a strong return with its May 22 premiere, averaging 5.7 million viewers. The Bachelor franchise is also set to launch a new spinoff, Bachelor Winter Games, early next year opposite the Olympics.\r\nBachelor in Paradise reunites former castoffs of The Bachelor and The Bachelorette in hopes they find love with other stars of the franchise. Last year's cycle ended with three engagements, and the one remaining couple, Evan Bass and Carly Waddell, returned to Paradise over the weekend to tie the knot for the cameras. Bass defended the show against cancellation in a column for THR ahead of his June 17 wedding.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Bachelor in Paradise’ to Resume Production After Investigation Finds No Misconduct", "url": "https://www.hollywoodreporter.com/tv/tv-news/bachelor-paradise-resume-production-investigation-finds-no-misconduct-1015130/", "description": "Producers Warner Bros. Television plan to “implement changes to the show’s policies and procedures to enhance and further ensure the safety and security of all participants.”", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/bachelorinparadise_featuredimage-936x482-h_2017_0.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2017-06-20T09:46:25+00:00", "modified_time": "2017-06-21T10:57:41+00:00"}, "twitter": {"site": "@thr", "creator": "@jackiedstrause", "card": "summary_large_image", "title": "‘Bachelor in Paradise’ to Resume Production After Investigation Finds No Misconduct", "description": "Producers Warner Bros. Television plan to “implement changes to the show’s policies and procedures to enhance and further ensure the safety and security of all participants.”", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/bachelorinparadise_featuredimage-936x482-h_2017_0.jpg?w=1280"}}, "movies": [], "publish_date": 1497951985.0, "source": "https://www.hollywoodreporter.com", "summary": ""}