{"url": "https://www.independent.co.uk/news/people/tom-daley-father-dustin-lance-black-husband-baby-birth-lgbt-surrogate-robert-ray-a8424351.html", "text": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nBreaking News email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nBritish diver Tom Daley and his husband Dustin Lance Black have become parents.\n\nThe celebrity couple revealed the birth of their son, Robert Ray, in a notice printed in The Times, the same newspaper in which they announced their 2015 engagement.\n\n\"On 27th June 2018 to Thomas Robert Daley and Dustin Lance Black, a son, Robert Ray,\" it read.\n\nThe couple had revealed they were expecting a child through a surrogate on Valentine's Day, and said they did not know who the biological father would be after fertilising \"half the eggs each\".\n\nThe three-time world champion diver has also said he wants to be as good a dad as his father, who was also called Robert and died in 2011.\n\nDaley spoke of how impending fatherhood changed his perspective as he competed at the Commonwealth Games on the Gold Coast in April.\n\nHe said: “It's been such a crazy experience. It changes your outlook on life.\n\n✕ Tom Daley and his husband have revealed that they’re expecting their first child together\n\n“Even on a plane. I'm never scared of flying - and as soon as there was any turbulence I was like 'oh my God', because there's more than my life I have to care about now.\n\n“It made me feel a bit more nervous. It changes your perspective on absolutely everything.\n\n“It's all filled with excitement, getting everything ready, feeling like you don't really know what's going to happen.\n\nUK news in pictures Show all 50 1 /50 UK news in pictures UK news in pictures 3 October 2022 British artist Sam Cox, aka Mr Doodle, reveals the Doodle House, a twelve-room mansion at Tenterden, in Kent, which has been covered, inside and out in the artist's trademark monochrome, cartoonish hand-drawn doodles PA UK news in pictures 2 October 2022 Erling Haaland celebrates after scoring Manchester City's second goal against Manchester United at Etihad Stadium. Haaland went on to score a hattrick, his third of the season in the Premier League. City beat United 6-3. Manchester City FC/Getty UK news in pictures 1 October 2022 Protesters hold up flags and placards at a protest in London. A variety of protest groups including Enough is Enough, Don't Pay and Just Stop Oil all demonstrated on the day AFP/Getty UK news in pictures 30 September 2022 British Prime Minister Liz Truss, who has not been seen in days, leaves the back of Downing Street after a meeting with Office For Budget Responsibility following the release of her government’s mini-budget Getty UK news in pictures 29 September 2022 The Virginia creeper foliage on the Tu Hwnt i'r Bont (Beyond the Bridge) Llanwrst, Conwy North Wales, has changed colour from green to red in at the start of Autumn. The building was built in 1480 as a residential dwelling but has been a tearoom for over 50 years PA UK news in pictures 28 September 2022 Criminal barristers from the Criminal Bar Association (CBA), demonstrates outside the Royal Courts of Justice in London, as part of their ongoing pay row with the Government PA UK news in pictures 27 September 2022 David White, Garter King of Arms, poses with an envelope franked with the new cypher of King Charles III 'CIIIR', after it was printed in the Court Post Office at Buckingham Palace in central London AFP/Getty UK news in pictures 26 September 2022 A gallery staff member poses next to a painting by Lucian Freud - Self-portrait (Fragment), 1956 - on show at a photocall for the Credit Suisse exhibition - Lucian Freud: New Perspectives at the National Gallery in London PA UK news in pictures 25 September 2022 Labour leader, Sir Keir Starmer is interviewed by Laura Kuenssberg in Liverpool before the start of the Labour Party annual Conference which he opened with a tribute to Queen Elizabeth II and sang the national anthem PA UK news in pictures 24 September 2022 Handout photo issued by Buckingham Palace of the ledger stone at the King George VI Memorial Chapel, St George's Chapel, Windsor Castle PA UK news in pictures 23 September 2022 A climate change activist protests against UK private jets while lighting his right arm on fire during the Laver Cup tennis tournament at the O2 Arena in London EPA UK news in pictures 22 September 2022 Woody Woodmansey, Lee Bennett, Kevin Armstrong, Nick Moran and Clifford Slapper attend the unveiling of a stone for David Bowie on the Music Walk of Fame at Camden, north London PA UK news in pictures 21 September 2022 A flock of birds in the sky as the sun rises over Dungeness in Kent PA UK news in pictures 20 September 2022 Flowers which were laid by members of the public in tribute to Queen Elizabeth II at Hillsborough Castle in Northern Ireland are collected by the Hillsborough Gardening Team and volunteers to be replanted for those that can be saved or composted PA UK news in pictures 19 September 2022 The ceremonial procession of the coffin of Queen Elizabeth II travels down the long walk as it arrives at Windsor Castle for the committal service at St George’s Chapel AFP/Getty UK news in pictures 18 September 2022 A man stands among campers on The Mall ahead of the Queen’s funeral Reuters UK news in pictures 17 September 2022 Wolverhampton Wanderers’ Nathan Collins fouls Manchester City’s Jack Grealish leading to a red card. City went on to win the match at Molineux Stadium three goals to nil. Action Images/Reuters UK news in pictures 16 September 2022 Members of the public stand in the queue near Tower Bridge, and opposite the Tower of London, as they wait in line to pay their respects to the late Queen Elizabeth II, in London AFP via Getty Images UK news in pictures 15 September 2022 Members of the public in the queue on in Potters Fields Park, central London, as they wait to view Queen Elizabeth II lying in state ahead of her funeral on Monday PA UK news in pictures 14 September 2022 The first members of the public pay their respects as the vigil begins around the coffin of Queen Elizabeth II in Westminster Hall, London, where it will lie in state ahead of her funeral on Monday PA UK news in pictures 13 September 2022 Crowds cheer as King Charles III and Camilla, Queen Consort arrive for a visit to Hillsborough Castle Getty UK news in pictures 12 September 2022 Crowds line the Royal Mile, Edinburgh, as King Charles III joins a procession from the Palace of Holyroodhouse to St Giles’ Cathedral following the coffin of Queen Elizabeth II Katielee Arrowsmith/SWNS UK news in pictures 11 September 2022 Members of the Public pay their respects as the hearse carrying the coffin of Queen Elizabeth II, draped in the Royal Standard of Scotland, is driven through Ballater AFP/Getty UK news in pictures 10 September 2022 Britain's Prince William, Prince of Wales, Britain's Catherine, Princess of Wales, Britain's Prince Harry, Duke of Sussex, Britain's Meghan, Duchess of Sussex, wave at well-wishers on the Long walk at Windsor Castle AFP/Getty UK news in pictures 9 September 2022 King Charles III and Camilla, Queen Consort wave after viewing floral tributes to the late Queen Elizabeth II outside Buckingham Palace Getty UK news in pictures 8 September 2022 A screen commemorating Britain's Queen Elizabeth II in Piccadilly Circus, London Britain EPA UK news in pictures 7 September 2022 Police officers stand guard after Animal Rebellion activists threw paint on the walls and road outside the Houses of Parliament in protest, in London, Britain Reuters UK news in pictures 6 September 2022 Queen Elizabeth II welcomes Liz Truss during an audience at Balmoral, Scotland, where she invited the newly elected leader of the Conservative party to become Prime Minister and form a new government PA UK news in pictures 5 September 2022 Visitors at the PoliNations garden in Victoria Square, Birmingham, which is made up of five 40ft high tree installations and over 6,000 plants. The PoliNations programme aims to explore how migration and cross-pollination have shaped the UK’s gardens and culture PA UK news in pictures 4 September 2022 Undergraduates at the University of St Andrews take part in the traditional Pier Walk along the harbour walls of St Andrews before the start of the new academic year PA UK news in pictures 3 September 2022 The Massed Pipes and Drums parade during the Braemar Highland Gathering at the Princess Royal and Duke of Fife Memorial Park PA UK news in pictures 2 September 2022 Number 12 Company Irish Guards at Wellington Barracks, central London, before commencing their first Guard Mount at Buckingham Palace PA UK news in pictures 1 September 2022 A salmon leaps up the weir at Hexham in Northumberland, despite the drought warnings and low water levels, the River Tyne is still flowing well allowing the salmon and sea trout to head up river to spawn. Every year tens of thousands of salmon make the once-in-a-lifetime journey along the Tyne to spawn, having been out a sea PA UK news in pictures 31 August 2022 Flowers are placed at the gates outside Kensington Palace, London, the former home of Diana, Princess of Wales, on the 25th anniversary of her death PA UK news in pictures 30 August 2022 Edinburgh’s waste workers clearing mountains of rubbish at Forrest Road as they return to work following their 11 days of industrial action PA UK news in pictures 29 August 2022 Competitors take part in the World Gravy Wrestling Championships at the Rose 'N' Bowl, in Rossendale, Lancashire PA UK news in pictures 28 August 2022 People from the Emancipated Run Crew who are running the carnival parade all in green to remember the 72 people that died in the Grenfell fire during the Family Day at the Notting Hill Carnival in London, which returned to the streets for the first time on two years, after it was thwarted by the pandemic PA UK news in pictures 27 August 2022 Competitors in the bog section during Rude Health Bog Triathlon at Llanwrtyd Wells, in Wales PA UK news in pictures 26 August 2022 Britain's Prime Minister Boris Johnson meets patient Rita Thomson after she had a complete hip replacement during a visit to South West London Orthopaedic Centre Getty UK news in pictures 25 August 2022 Finney Harrod receiving his GCSE results at Norwich School, in Norwich, Norfolk PA UK news in pictures 24 August 2022 A young girl lays a tribute in Kingsheath Avenue, Knotty Ash, Liverpool, where nine-year-old Olivia Pratt-Korbel was fatally shot on Monday night PA UK news in pictures 23 August 2022 Florists prepare the entrance to 10 Downing Street with flowers in the Ukraine national colors in London AP UK news in pictures 22 August 2022 17-year-old pilot Mack Rutherford lands at Biggin Hill Airport, Westerham, Kent, as he continues in his bid to beat the Guinness World Record for the youngest person to fly around the world solo in a small plane PA UK news in pictures 21 August 2022 Members of the Unite union man a picket line at one of the entrances to the Port of Felixstowe in Suffolk, Britain's biggest and busiest container port, after backing industrial action by 9-1 in a dispute over pay PA UK news in pictures 20 August 2022 A young girl dances in Belfast City Centre during the first Mela Carnival, in which participants from more than 20 different cultura groups don traditional costumes to celebrate Northern Ireland’s cultural diversity PA UK news in pictures 19 August 2022 Commuters queue for buses outside Victoria underground train station which is closed due to strike action Getty UK news in pictures 18 August 2022 Pupils celebrate with their A-level results at Norwich School, Norwich PA UK news in pictures 17 August 2022 Rishi Sunak looks at a NLAW anti tank launcher, supplied to Ukraine, during a campaign visit to Thales Defence System plant in Belfast, as part of his campaign to be leader of the Conservative Party and the next prime minister PA UK news in pictures 16 August 2022 Protesters gather outside Perth Concert Hall in Scotland, where Conservative leadership hopefuls, Liz Truss and Rishi Sunak are due to take part in an hustings event PA UK news in pictures 15 August 2022 A van from the company Bishop’s Move, which specialises in removals, storage and shipping, outside Downing Street, London PA\n\n“The fear of what might happen and the excitement. There's so many emotions that come with being an expectant father.”\n\nDaley and Black also announced their engagement in a similarly understated way in 2015, with an announcement reading: “The engagement is announced between Tom, the son of Robert and Debra Daley of Plymouth, and Lance, son of Jeff Bisch of Philadelphia and Anne Bisch of Lake Providence.”\n\nBlack, 44, is an American film director and producer. He won an Oscar for best original screenplay for Milk, a film based on the life of gay rights activist and politician Harvey Milk.\n\nAdditional reporting by Press Association.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/14/14/tom-daley-dustin-lance-black.jpg?quality=75&width=982&height=726&auto=webp", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/14/14/tom-daley-dustin-lance-black.jpg?quality=75&width=1200&auto=webp"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/14/14/tom-daley-dustin-lance-black.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Tom Embury-Dennis"], "canonical_link": "https://www.independent.co.uk/news/people/tom-daley-father-dustin-lance-black-husband-baby-birth-lgbt-surrogate-robert-ray-a8424351.html", "title": "Tom Daley and husband Dustin Lance Black release first photos of their baby boy", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "Couple revealed they were expecting child through surrogate", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "People", "sitename": "The Independent", "page path": "/news/people", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2018-06-30T14:05:00.000Z", "site_name": "The Independent", "title": "Tom Daley and husband Dustin Lance Black release first photos of their baby boy", "url": "https://www.independent.co.uk/news/people/tom-daley-father-dustin-lance-black-husband-baby-birth-lgbt-surrogate-robert-ray-a8424351.html", "type": "article", "description": "Couple revealed they were expecting child through surrogate", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/14/14/tom-daley-dustin-lance-black.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/14/14/tom-daley-dustin-lance-black.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2018-06-30T14:05:00.000Z", "modified_time": "2018-06-30T14:05:00.000Z", "section": "News", "subsection": "People", "author_name": "Tom Embury-Dennis", "content_type": "story", "word_count": 473, "image_count": 1, "embed_count": 4, "video_count": 1, "internal_link_count": 4, "external_link_count": 0}, "date": "2018-06-30T14:05:00.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "Tom Daley and husband Dustin Lance Black release first photos of their baby boy", "site": "@Independent", "card": "summary_large_image", "description": "Couple revealed they were expecting child through surrogate", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/14/14/tom-daley-dustin-lance-black.jpg?quality=75&width=1200&auto=webp"}, "keywords": "Tom Daley,Dustin Lance Black,Internal"}, "movies": [], "publish_date": 1530367500.0, "source": "https://www.independent.co.uk", "summary": ""}