{"url": "https://www.bustle.com/p/christian-isnt-naked-in-fifty-shades-freed-nearly-as-much-as-ana-is-thats-actually-a-serious-problem-8176722", "text": "Going into the third and final installment in the Fifty Shades franchise, fans have one very important question: is there D in Fifty Shades Freed? The degree of Christian Grey's nudity has been hotly debated ever since Fifty Shades of Grey hit theaters in 2015, with many hoping that there'd be substantial nude shots of actor Jamie Dornan in the series, considering that his co-star, Dakota Johnson, is frequently seen naked in the movies. But Dornan stayed mostly covered up in both Grey and the sequel, Fifty Shades Darker, and unfortunately, the latest film, Fifty Shades Freed, squanders a chance for equal-opportunity nudity.\n\nAs a dominant, Christian Grey does not like to take his clothes off during sex. This fact was well established in Fifty Shades of Grey, hence the internet declaring his red room jeans his \"f*ck jeans.\" As a boyfriend, Christian, as seen in Fifty Shades Darker, was a little more willing to get naked, though the movie only showed him nude in the afterglow and only from the waist up or from behind. In Fifty Shades Freed, the now-husband Christian is definitely comfortable taking his clothes completely off in the bedroom, but, again, the audience sees only his butt, a choice Dornan was apparently comfortable with. \"You see my arse quite a lot,\" Dornan said in an interview with Elle. \"I just thought, we don't need to be flashing the rest if it's not essential to the story.\"\n\nDornan is right when he says that nudity for nudity's sake is unnecessary, but this defense only goes so far before it becomes a double standard. Johnson's Anastasia Steele was a slight angle shift away from giving the audience a full frontal look in both Fifty Shades of Grey and Fifty Shades Darker. And even though she and Dornan are on somewhat equal-nudity footing in Fifty Shades Freed, the fact remains that, as a whole, the franchise is heavily tilted towards female nudity. \"There is a lot more of my body that's shown than Jamie's,\" Johnson said in an interview with Entertainment Tonight, and it's true; in Freed, for instance, Johnson is shown naked constantly. If nudity is OK when required for the story, the question then becomes, why is more female nudity necessary to Fifty Shades while male nudity is not? The answer: men.\n\nSpeaking of the decision to leave Christian's bottom half out of Fifty Shades Darker, director James Foley told Cosmopolitan that it \"wasn't on purpose. It was just where the camera was.\" In Hollywood, an industry driven by men, male nudity is more taboo than female nudity. Every single Fifty Shades movie had a male director of photography, and the last two films were directed by men. In other words, the movies were quite literally shot with a male gaze. Is it any wonder, then, that these men simply did not think to include more of Christian's body, while showcasing so much of Ana's?\n\nA report published in 2016 found that women are three times more likely to be naked on screen than men in major Hollywood movies. Looking at the top 100 films at the 2014 domestic box office, \"The Report on the Status of Women and Girls in California\" from Mount Saint Mary's University, found that 29 percent of female characters appeared \"partially or fully nude\" compared to only nine percent of male characters.\n\nMoreover, the Motion Picture Association of America that gives ratings to movies has also recently made specifications in their ratings for \"male nudity,\" as opposed to the gender-neutral \"nudity\" warning. Examining movies cited for \"nudity\" by the MPAA between 2006-2010, Jezebel found that of the 786 movies that earned the warning, three were cited as featuring \"male nudity,\" and none were cited as having \"female nudity.\" The fact that the MPAA felt it had to specify when certain films included \"male nudity\" reflects an American taboo. Female nudity is normalized, while male nudity is seen as an oddity or, in the case of the MPAA, a specific offense.\n\nIf it had given the audience more male nudity, Fifty Shades Freed could have helped shift how the MPAA and audiences view nudity. Equal opportunity nudity in Hollywood should be standard — for every full frontal naked woman on screen, there should be a full frontal naked man. The only way to achieve that is to begin normalizing male nudity on screen. And, yes, that will mean showing some D.", "images": ["https://imgix.bustle.com/uploads/image/2018/2/9/15098ffd-5549-4946-9c50-f92073e3a571-screen-shot-2018-02-09-at-112747-am.png?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/10/8/cf08e992-6bd1-4b94-9bd5-a04c285aa11b-getty-1395845101.jpg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.4093&fp-y=0.5227", "https://imgix.bustle.com/uploads/getty/2021/5/11/b0482c01-f6ea-4620-ac68-4f7118aa0d95-getty-71805167.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2022/10/7/ee2c977e-15a4-4dce-b29a-4ca9be003046-met0002_101_comp_ste_v0002_r709_bw_8fe3b57a.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/7/e445d44d-33df-4ad5-8213-e6a7c41a19d5-ciw_unit_12862_r.JPG?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2018/2/9/15098ffd-5549-4946-9c50-f92073e3a571-screen-shot-2018-02-09-at-112747-am.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/2/9/15098ffd-5549-4946-9c50-f92073e3a571-screen-shot-2018-02-09-at-112747-am.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/christian-isnt-naked-in-fifty-shades-freed-nearly-as-much-as-ana-is-thats-actually-a-serious-problem-8176722", "title": "Christian Isn't Naked In 'Fifty Shades Freed' Nearly As Much As Ana Is & That's Actually A Serious Problem", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@iwatchiam"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/christian-isnt-naked-in-fifty-shades-freed-nearly-as-much-as-ana-is-thats-actually-a-serious-problem-8176722", "type": "article", "title": "Christian Isn't Naked In 'Fifty Shades Freed' Nearly As Much As Ana Is & That's Actually A Serious Problem", "description": "Going into the third and final installment in the Fifty Shades franchise, fans have one very important question: is there D in Fifty Shades Freed? The degree of Christian Grey's nudity has been hotly debated ever since Fifty Shades of Grey hit…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/2/9/15098ffd-5549-4946-9c50-f92073e3a571-screen-shot-2018-02-09-at-112747-am.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Going into the third and final installment in the Fifty Shades franchise, fans have one very important question: is there D in Fifty Shades Freed? The degree of Christian Grey's nudity has been hotly debated ever since Fifty Shades of Grey hit…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}