{"url": "https://www.cosmopolitan.com/uk/entertainment/a9961424/zayn-gigi-hadid-dating-timeline/", "text": "You'd be forgiven for not knowing Zayn Malik and Gigi Hadid's relationship timeline off by heart. So here's a detailed look back at the highs and lows of their love story so far, starting way back in 2015 - and going all the way to their baby girl's birth and beyond.\n\n23 April 2021: Gigi Hadid celebrates turning 26 with a small celebration in New York, which featured everything from a grilled cheese van outside her apartment to a big cheese-themed cake. The model and sister Bella shared glimpses into the bash on social media, while paparazzi also caught photos of Gigi and Zayn showing some PDA outside:\n\nGetty Images\n\nGetty Images\n\nHere's the rest of Gigi and Zayn's relationship timeline:\n\nNovember 2015: Zayn and Gigi first spark romance rumours a few short weeks after she ends thing with Joe Jonas. Photographs of them leaving Justin Bieber’s American Music Awards after-party in LA surface. A source tells Us Weekly source the rumoured new couple aren’t using “boyfriend and girlfriend” terms just yet.\n\n“But seeing each other? Definitely. He’s chuffed.”\n\nDays later, Zayn stirs more romance rumours when he takes a selfie wearing what appears to be Gigi’s glasses.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nOn Nov. 29, Zayn and Gigi make things official by holding hands while leaving The Nice Guy together.\n\nBefore the month wraps, Joe Jonas quietly unfollows Gigi on Instagram and Twitter and deletes a #squad photo of himself with Zayn from earlier in the year.\n\nGigi, meanwhile, posts and deletes four tweets likely directed at Joe. “Sometimes life just happens.. For whatever reason in whatever timing. And sometimes it doesn’t make sense 'til it does. That’s it,” reads one of the tweets.\n\nScreenshot | Twitter\n\nShe also posts this extremely suggestive “CHILL” photo for Joe and everyone because it’s less than one month into this new relationship, OK?\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nJanuary 2016: Gigi takes things to the next level with a “Z” necklace. It first appears on her Instagram in a blink-and-you’ll-miss-it moment.\n\nInstagram\n\nNext up: Zayn's photo is spotted as Gigi’s background image on her phone after she touches down at Charles de Gaulle Airport in Paris ahead of Paris Fashion Week.\n\nAnd because teasing is better than the real thing (?), Zayn says he and Gigi are “good friends, yeah” while appearing on Apple’s Beats 1 radio show. Um, excuse me?\n\nMeanwhile, Gigi and Zayn star in his new music video for 'PILLOWTALK.' It’s his first music video as a solo artist and it’s so hot. Let's watch this video. Again.\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nGigi solidifies herself as Zayn’s biggest fan by singing along to 'PILLOWTALK' en route to somewhere nice in the wee hours of the morning.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nIt's confirmed, Gigi is Zayn's biggest fan pic.twitter.com/oXokPirovF — l (@gigimypassion) January 29, 2016\n\nHe returns the gesture by commenting on her work in the music video.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n@zaynmalik nah musta missed it 😏😜\n\n\n\nJokes.. I wasn't looking at myself, trust me 😻🔥🔥🔥🔥🔥 — Gigi Hadid (@GiGiHadid) January 29, 2016\n\nApril 2016: Zayn and Gigi appear in their first photo shoot together as a couple for Vogue. They are so in love in Naples it hurts. There’s a behind-the-scenes video too and yes, it’s also very pretty.\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMeanwhile, Gigi’s ex Joe Jonas weighs in on ZiGi, telling the Daily Mirror, “I think it’s interesting that she moved on so quickly. I mean, it was definitely very quick.” He also notes that people have been comparing him and Zayn “for years.”\n\nMay 2016: Zayn and Gigi walk the red carpet together at the Met Gala and are the beau and belle of the ball in Versace and Tommy Hilfiger, respectively.\n\nGetty\n\nGetty Images\n\nJune 2016: E! News reports that Gigi and Zayn have ended their relationship after seven months of dating. Sources claim that they’ve actually broken up and reunited “multiple times,” with the latest due to communication problems.\n\nThree days later, Gigi is spotted out in West Hollywood wearing her “Z” necklace, which could mean all is right in the world again.\n\nGetty\n\nTo further squash breakup rumours, Zayn and Gigi reveal his-and-hers Nutella containers in their New York kitchen via Gigi’s Snapchat. It’s the sweetest thing (get it?):\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nJuly 2016: *CUTE PHOTO BREAK*.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nSeptember 2016: Taylor Swift is spotted third-wheeling on a ZiGi night out. Is this where Zayn and Taylor's Fifty Shades Darker song idea first started?\n\nGetty\n\nZayn and Gigi jet off to London for Fashion Week, where they sit front row for the Versus Versace show.\n\nGetty\n\nGetty\n\nNovember 2016: Nearly one year to the day ZiGi was born, Zayn tells ES Magazine that he and Gigi met in early November 2015 at a Victoria’s Secret party.\n\nHe approached her after recognising her “from her picture” and proceeded to ask her out, taking her to The Bowery Hotel’s restaurant Gemma in New York City. “She’s a very intelligent woman,” he says of Gigi. “She knows how to carry herself. She’s quite classy and that. She’s not, like, arrogant in any way. She's confident. She carries it well. She’s cool.”\n\nDecember 2016: In an interview on Sirius XM’s Morning Mash Up, Zayn continues the ZiGi origin story. “I just asked her [out]. It was pretty straight up,” he said. “I just asked her if she wanted to go on a date. I was in New York.”\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nJanuary 2017: Zayn and Gigi spark ~ENGAGEMENT RUMOURS~ after Gigi is spotted with a pretty gold ring on that finger while out in New York City. The next day, Zayn reveals a new tattoo – LOVE – written in cursive on his right hand. What does it all mean?\n\nGetty\n\nGetty\n\nMeanwhile, in an interview with British Vogue, Gigi reveals her typical night in with Zayn when she’s in L.A. For starters, they love “doing art” and cooking. “We like late-night movies and we order from this amazing place that does lattes and gingerbread cookies. I need coffee to stay up. I’m always like, ‘Babe, let’s go to a movie.’ Then I fall asleep halfway through and he’s like, ‘You’ve seen the first half of every movie out there and you have no idea how any of them end.’”\n\nFebruary 2017: ZiGi spend their second Valentine’s Day together and yes, there’s a cute Instagram in honour of the big day.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nShe also calls him “Love of my life” in an Instagram story. Open your eyes Zayn! They’re pretty and the world needs to see them.\n\nInstagram\n\nMarch 2017: Zayn and Gigi appear in a video together after he wins the Best Music Video award at the iHeartRadio Music Awards. The clip exists because he couldn’t accept the award in person. It all worked out though, because even his co-star got to squeeze in a cute thank-you.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nSpeaking to the Sunday Times Style, Zayn reveals the couple’s nicknames for each other. “I call her Gee, she calls me Zee. There’s some other nicknames too, but I’ll keep those private,” he said.\n\nApril 2017: Zayn calls Gigi “my everything” in a birthday Instagram post.\n\nJuly 2017: Gigi reminds us how cute she and Zayn Malik are with adorable Instagram story of him cuddling a dog. Yes please.\n\nInstagram Stories/Gigi Hadid\n\nAugust 2017: Gigi's mum Yolanda Foster calls Zayn 'family' in the caption for an adorable photo of the couple cuddling, writing: \"Summer Loving....... #Family.\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nNovember 2017: Zayn and Gigi celebrate their two year anniversary with an adorable smoochy video on Instagram, in which the model calls the singer her \"favourite human\". Adorable.\n\nDecember 2017: Gigi Hadid reminds us all that she and Zayn are still ver much in love with adorable throwback from the 2017 Met Gala.\n\nInstagram/Gigi Hadid\n\nJanuary 2018: Gigi shares sickly sweet Instagram post to mark Zayn's 25th birthday, writing, \"love this man more than I could ever put into words, & am inspired by his drive to be and do better everyday ✨ cheers to YOUR YEAR my @zayn - happiest happiest birthday & 25th year of life !! I’m proud to be by your side x\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nJanuary 2018: Zayn debuts massive tattoo of Gigi's eyes on his torso in an Instagram video the model shared, along with the caption: \"birthday boogie 🕺🏻😍🤣 @zayn\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nFebruary 2018: Gigi's mum Yolanda is asked whether she thinks her daughter will ever marry Zayn, to which she responds, \"He's a beautiful human being from Bradford, England. He's from the same background that I'm from, him and I get along great and he's like a son to me. It's all good.\n\n\"He has no family here and he's so far away so I understand that life because I lived that life. I think that I'm just a momma to him.\"\n\n13 March 2018: Zayn and Gigi announce their split, following speculation the had gone their separate ways.\n\n\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nZayn wrote,\n\n\"Gigi and I had an incredibly meaningful, loving and fun relationship and I have a huge amount of respect and adoration for Gigi as a woman and a friend. She has such an incredible soul. I'm grateful to all of our fans for respecting this difficult decision and our privacy at this time, we wish the news could have come from us first. We love you all. xZ\"\n\nGigi's statement added,\n\n\"Breakup statements often seem impersonal because there is really no way to put into words what two people experience together over a few years.. not only in the relationship, but in life in general.\n\n\"I'm forever grateful for the love, time, and life lessons that Z and I shared. I want nothing but the best for him and will continue to support him as a friend that I have immense respect and love for. As for the future, whatever's meant to be will always be. xG\"\n\n19 April 2018: Zayn is pictured turning up at Gigi's place in New York. He then leaves the next morning wearing the same clothes. THE SAME CLOTHES!\n\nGetty Images\n\nAnd soon after he left her apartment, Gigi liked one of Zayn's Instagram posts. So are things back on for ZiGi? God we hope so...\n\n30 April 2018: Goodness gracious - Zayn and Gigi are spotted kissing. THINGS ARE BACK ON, PEOPLE!\n\n4 May 2018: Despite all the recent K-I-S-S-I-N-G, Gigi is reportedly \"hesitant\" about getting back together with Zayn. A source told E! News that \"Zayn really wants to be with [Gigi] and has made it clear. He misses her and can't stand being apart,\" but \"Gigi's a little bit more hesitant.\"\n\nThe source added that Gigi \"does love him, but she isn't completely sure this is where she wants to be right now.\"\n\n\n\n6 June 2018: The couple have made their reconciliation Instagram official!\n\nInstagram\n\nGigi posts a selfie with someone who looks suspiciously like Zayn kissing her on the cheek while they played a game of Pokemon.\n\n\n\n19 June 2018: During an interview with GQ magazine, Zayn comments that his reconciliation with Gigi doesn't need labelling right now. \"We're still really good friends, and we're still in contact,\" he said. \"No bad blood . . . Taylor Swift. We're adults. We don't need to put a label on it, make it something for people's expectations.\"\n\n27 June 2018: What better way to celebrate a rekindled romance than with a selfie while Gigi is made up like a space alien? Yeah, we're not sure either.\n\nInstagram Stories/Gigi Hadid\n\n5 July 2018: Gigi hits back at rumours she's dating Zayn as a PR stunt.\n\nIn comments section on the private Instagram account @ExposingFakeeAssZigiii, Gigi writes a long but quite polite message in screen grabs obtained by E!.\n\n\"Seems like u guys tag me in a new post every day … pls stop,\" she said. \"It's just negative, I really have no hard feelings towards you I just know what a beautiful world there is to go out and live in instead of trying to dissect a relationship between two people that you don't even know and that you do not see 99% of. For someone who is virtually inactive on the app, I don't need his follow- my eyes are tattooed to his chest.\"\n\n\"The energy you put into this does not serve you our your life in any way kids…. truly 'beating a dead horse.' You guys can call it promo but I just post about my boyfriend like anyone else, whether I support z or he supports me is out of love and excitement for one another. There's nothing to figure out all the time… give it a break. This is my last comment on this matter but I hope u know it's not coming from a bad place. Just would love for you to find something else that inspires you in life…. x.\"\n\nGigi also responded to a fan who said she should have DM'd the account:\n\n\"I see your point that it should have been a direct message, and I agree- just didn't think of it. This is all just very frustrating and I'm only human ... I've seen the s--t on this account for just as long as u- and have too stand quiet. - I've just had enough.. just because I'm 'a celebrity' doesn't mean I don't feel, or that my time is too precious to not listen to what people have to say. I'm sure you can see how assumptions like this can be hurtful, especially about someone I love deeply- if you guys love him too, sooner or later you'll realise we're on the same team. ;)\"\n\n26 July 2018 - Yolanda Hadid shares an Instagram Story hanging out with Zayn. In with the fam, eh?\n\n\n\nInstagram Stories/Yolanda Hadid\n\n14 August 2018 - Gigi shares first proper selfie with Zayn since their romantic reconciliation, posting to Instagram Stories with the caption, \"Goodbye vacay we thank you\". Selfies mean it's serious, right?\n\nInstagram Stories/Gigi Hadid\n\n24 August 2018 - Yolanda Hadid posts this adorable photo of her daughter and Zayn celebrating Eid together.\n\nInstagram\n\n22 October 2018: Gigi and Zayn's relationship might've just gone through a rocky patch after the pair embarked on a bit of a break, but it looks like they've come out of the other side now, after Gigi shared a cute snap of the pair on Instagram.\n\n\"flyin[g] home to my happy place ❤️\" she wrote, alongside a candid shot of a topless Zayn hugging her from behind. Cute!\n\nDecember 12, 2018 - Zayn releases the track 'There You Are' an intense love song about relying on people that fans definitely think is about Gigi Hadid. Lyrics include, \"Friends that I rely on/Don't come through/They run like the river/But not you.\n\n\"Only you know me the way you know me / Only you forgive me when I'm sorry / Even when I messed it up / There you are.\"\n\nThis could refer to Zayn and Gigi's on-again-off-again relationship, or the fact the couple have previously touched on tough times in their relationship, which are ultimately resolved.\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nJanuary 3rd 2019 - Have Zayn Malik and Gigi Hadid split?! The pair have reportedly been spending time apart 'since early November', with an insider saying it was for the sake of their future.\n\nAccording to a source at E! News, the singer, 25, and the model, 23, both \"think that time apart is best for the sake of their relationship right now. Both have been really focused on themselves and their separate careers.\n\n\"Zayn has been in the studio recording new music and pushing out his new album, while Gigi has been focusing a lot of time on herself.\"\n\nMarch 4th 2019 - Zayn Malik tweets about his love for Gigi Hadid, and fans are confused. While neither party have commented on the split claims so far, they also haven't been spotted together in public this year, so fans assumed they had broken up.\n\nThat is until Zayn tweeted Gigi [3 March] saying \"@GiGiHadid love you.\" Some outlets are reporting the singer deleted the tweet before Gigi had a chance to respond, but it is seemingly still live on the site:\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMarch 29th 2019 - A new report claims that despite Gigi Hadid still having love for Zayn Malik, they are currently not together, and haven't been since January.\n\n\"She still has feelings for him, of course, but he has major issues and she knows they aren’t compatible. She’s still very single\" said an Us Weekly insider, before adding that \"Gigi and Zayn still talk.\"\n\nApril 5th 2019 - Zayn Malik says Gigi Hadid is the \"most amazing woman I have ever met\" as he defends her against Twitter trolls, following a tweet from him which many assumed was about her.\n\nLet's rewind for a second. So Gigi was spotted out with her friend Samuel Krost, and many paparazzi agencies immediately referred to him as her \"mystery man\". Gigi then took to Twitter to shut down any romance rumours, writing, \"If you outlets are going to continue writing bs headlines every time I’m seen with a friend of the male gender then there’s going to be a lot of unneeded confusion 🙃😑🤦🏼‍♀️ [sic]\"\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nIf you outlets are going to continue writing bs headlines every time I’m seen with a friend of the male gender then there’s gunna be a lot of unneeded confusion 🙃😑🤦🏼‍♀️ — Gigi Hadid (@GiGiHadid) April 4, 2019\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nTo any dumb fuck out there that wants to make they’re own stories up — zayn (@zaynmalik) April 4, 2019\n\nLater, Zayn tweeted, \"To any dumb f*** out there that wants to make their own stories up\", which many assumed was fighting Gigi's corner about the photos.\n\nThe singer later took to Twitter again, though, to not only deny his original tweet was about his ex-girlfriend, but to shut down any trolls who were attacking the model on social media. He wrote:\n\n\"My tweet was not about @GiGiHadid so leave her the f*** alone she is the most amazing woman I’ve ever known / And does nothing but love and support me when lord knows I don’t deserve it / So if you have anything to say @ me and I’ll put you the f*** straight / If you know nothing shut your fucking mouth.\"\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMy tweet was not about @GiGiHadid so leave her the fuck alone she is the most amazing woman I’ve ever known — zayn (@zaynmalik) April 4, 2019\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nAnd does nothing but love and support me when lord knows I don’t deserve it — zayn (@zaynmalik) April 4, 2019\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nSo if you have anything to say @ me and I’ll put you the fuck straight — zayn (@zaynmalik) April 4, 2019\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nIf you know nothing shut your fucking mouth — zayn (@zaynmalik) April 4, 2019\n\nWe're as confused as you are about what's going on, but one thing is for sure: Zayn is still full of love for Gigi.\n\nNovember 20th 2019 - Zayn and Gigi reportedly start talking again 10 months after their split. However, anyone who wants to see them back together in a romantic way is set to be disappointed, as sources say it's purely just friendly.\n\nThe model is believed to have reached out to the former 1D singer after she split from Bachelorette star Tyler Cameron.\n\n\"Gigi has always had a soft spot for Zayn and they have a lot of history together. They are definitely not getting back together but are on good terms right now,\" a source spilled.\n\nThey added to E! News: \"They went through a phase where they took time apart and weren't communicating at all, but they have been in touch recently. She is supportive of him. They chat here and there but it's been casual.\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nFebruary 14th 2020 - Gigi Hadid basically confirmed that she and Zayn Malik are back together, after sharing a picture of him on Instagram for Valentine's Day. While the pair had been spotted out together earlier this year, this is the first time Gigi has spoken out about them being back on.\n\n\n\nRumours had been circulating since late 2019 that the couple had rekindled their romance, and we reckon this Valentine's Day ode is pretty conclusive evidence that they have.\n\nPosting a picture on her second Instagram account, gisposable, Gigi shared a snap of Zayn out in the countryside, captioning the pic, \"HEY VALENTINE. Z on the farm ♡ Dec 2019.\"\n\nGigi then reposted the picture from her gisposable account, where she shares personal pictures taken on disposable film, on her main Instagram story, adding a cute loveheart gif. Her main account, gigihadid, has 51.7 million followers, so if there's one way to declare your love for someone, that's just about as public as you can get.\n\nThe cute photo of Zayn is thought to have been take on Gigi's mum's farm in Pennsylvania, where the couple spend time privately.\n\nZayn and Gigi were rumoured to have started speaking again back in November 2019 after Gigi split from Bachelorette star Tyler Cameron. But it wasn't until January 2020 that the couple were photographed out together in New York. If Gigi's newest post is anything to go by, it looks like they could have been back together as early as December 2019.\n\nWhy do you keep these things from us, Gigi?!\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nApril 26th 2020 - After Gigi Hadid and Zayn Malik officially got back together earlier this year, it seems like they're now in lockdown together, with Gigi sharing pics of the pair celebrating her 25th birthday. Gigi and Zayn are usually pretty private but Gigi made the exception for her bday, posting pics of her family's celebrations.\n\n\n\nPosing with some \"25\" balloons on her front porch, Gigi shared an Instagram pic of her hugging Zayn, showing only the back of his head and leaving fans wondering if it was even him. However, all became clear when she followed up with a second Insta. In a boomerang post, Gigi, her sister Bella Hadid and Zayn can be seen cuddling up together with balloons for Gigi's birthday, and we love to see them together as a happy family.\n\nGigi added the caption, \"Had the sweetest day celebrating my 25th birthday with my quarantine family, who made it so special for me, along with all the love I felt from all over the world!\n\nShe continued, \"I am grateful and lucky that my family and friends -near and far- are healthy and safe, and although I missed loved ones I wish I could have celebrated with, know that these times will make us even more grateful for togetherness to be had in the future! I will never forget my 25th bday!\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nIt seems like Gigi's family are 100% on board with her and Zayn's rekindled romance, with Gigi's dad, Mohamed Hadid, commenting, \"Coolest crowd.\" Honestly, we couldn't agree more.\n\nApril 28, 2020 - Omg! Zayn Malik and Gigi Hadid are reportedly expecting their first child, and the 25 year old is pregnant! According to TMZ, family sources say Gigi is apparently already 20 weeks, and there has been no word on whether or not the baby is a girl or a boy, though the couple may not yet know.\n\nApril 29, 2020 - After it was reported by TMZ that Gigi and Zayn are expecting their first child together, new Us Weekly sources disclosed that the model has always dreamed about having children with the singer. The source revealed, \"She’s always wanted to start a family with Zayn\" and they're both \"so in love.\"\n\nAhh we're so happy for them!\n\nJune 5th 2020 - Zayn and Gigi shared a rare selfie of the two of them together, two months after announcing that they're expecting their first child.\n\nGigi and Zayn barely ever take pics together, so this one was a real treat. The new photo showed Gigi taking a mirror selfie, while a mysterious man has his arm around her waist - but, let's be honest, we can tell that it's Zayn a mile off. Honestly, these two don't even need a professional photographer to look amazing.\n\nThe rare photo of the couple came as part of British Vogue's campaign to raise money for NHS Charities Together and the NAACP, with celebs donating their clothes to British Vogue's 'Hardly Ever Worn It' auction. To be honest, anything worn by Zigi we'd part with our cash for.\n\nThe pics also appeared in the July issue of British Vogue with limited edition prints available to buy - if you want Zayn and Gigi permanently swooning down at you, that is.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nAugust 2020 - Gigi shows off her gorgeous baby bump on Instagram, looking like a real like angel.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nSeptember 2020 - Surprise! Gigi and Zayn have welcomed a baby girl! The pair made the announcement with some adorable photos on Instagram.\n\nZayn wrote, \"Our baby girl is here, healthy and beautiful. To try put into words how I am feeling right now would be an impossible task. The love I feel for this tiny human is beyond my understanding. Grateful to know her, proud to call her mine, and thankful for the life we will have together x\".\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nGigi added the caption, \"Our girl joined us earth-side this weekend and she’s already changed our world. So in love.\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nSO cute. Can't wait to see what she looks like.\n\n28 September 2020 - New details about Gigi Hadid giving birth and welcoming her first child with Zayn Malik have emerged. According to Page Six, the 25-year-old gave birth at the New Hope farmhouse in Pennsylvania.\n\nAccording to reports, the pair 'had been isolating on the farm since May', which neighbours Gigi's mum Yolanda's $4M, 32-acre farm nearby. Speaking about their farmhouse, Zayn told Billboard back in 2017, \"There's not a lot of things around. I do a lot of farm work. I take the horses out and feed the cows and that kind of stuff. It's cool. I've always been interested in animals.\" So wholesome!\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nOctober 4th, 2020: While Gigi and Zayn have been keeping a low-profile since the birth of their little girl, insiders in the US have revealed that the model is \"elated\" to be a mum. \"Gigi is very tired but is already an amazing mum,\" they spilled to E! News. \"The first couple of weeks have been a hard transition but she hasn't complained and is very elated to be a mum.\"\n\nThey added that the couple will be staying at their farm in Pennsylvania, where Gigi gave birth, for the 'foreseeable future'.\n\n\"They feel peaceful staying there for now. Gigi wants the most privacy for their baby and wants to be able to raise her privately,\" the insider revealed. They also said Gigi's mum Yolanda has been \"helping them tremendously.\"\n\n\"She is their built-in nurse and they are so grateful to have her,\" the source continued.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nOctober 16th, 2020: Gigi has been showing fans some of the baby gifts she's been receiving from her famous friends and they're all SO cute. Sharing a snap on her Instagram Story, the model posted a picture of the adorable \"Zigi's Girl\" outfits that Tan France bought their daughter. Gigi also previously shared a picture of a gift from Taylor Swift who handmade a blanket for the newborn, while Donatella Versace sent her lots of designer outfits. She's not even a month old and already has a better wardrobe than us!\n\n\n\nInstagram\n\nOctober 17th: Apparently all is well for the new parents - or at least according to a source who spoke to Us Weekly, saying: \"Gigi and Zayn are loving parenthood and can’t get enough of their little girl. Things are going really swimmingly between them and they’re both so happy. Gigi is so excited to be a new mom and has been appreciating every moment.”\n\nToo cute!\n\nOctober 18th: Gigi and Zayn have celebrated their first evening as just the two of them since welcoming their daughter, with Gigi sharing updates on her Instagram story.\n\n\"Mom and dad's first date night,\" the model captioned a photo of their romantic meal, adding: \"She's in the other room w Oma but miss her sm lol.\" We're guessing that means Gigi's mum Yolanda was on babysitting duty!\n\nGigi Hadid\n\nDecember 1st, 2020: Gigi shares an adorable series of throwback pictures to her Instagram showing her and Zayn during her pregnancy, including one particularly sweet picture of Zayn resting his head against her baby bump as the pair smile at each other.\n\nThe post included two other pictures of Gigi posed on the deck of her garden presumably at her family home in Pennsylvania wearing an off-white sleeveless dress which showed her baby bump in all its glory. She captioned the post, \"August, waiting for our girl 😭.\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nDecember 18th, 2020: Gigi has shared another picture of her and Zayn's daughter as she took the tot out to experience her very first glimpse at snow.\n\nThe couple have returned to New York after spending time at the family farm in Pennsylvania following their daughter's birth in September, and there they were greeted by a heavy snow storm.\n\nGigi and her little girl are stood in the middle of an empty street with snow carpeting the ground. \"Her first snow 🗽,\" the model wrote.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nJanuary 12th, 2021: Gigi has thanked Zayn for \"making me a mamma\" as she wished him happy birthday with an adorable tribute. Giving fans a rare glimpse into their relationship, the model posted a picture of them together with the caption: \"Team No Sleep! Happiest birthday to our Zaddy baba. So special. Love you long time, thank you for making me a mamma to the best girl ever. Wish you the best every single day.\"\n\nGigi, who is casually rocking a pair of cute unicorn slippers, pulled out all the stops for Zayn's big day, hiring out an arcade and decking it out with Zayn-themed hats, balloons and other party favours.\n\nHappy birthday Zayn!\n\nJanuary 26th, 2021: On January 21st, Gigi Hadid casually revealed the name of her and Zayn's daughter. There was no big reveal, just a small amendment to her Instagram bio: \"Khai's mom.\"\n\nHowever, eagle-eyed fans have just realised she actually first revealed the name way back in November on social media - and none of us even noticed.\n\nGigi shared pics of her festive decorations on Instagram, and one present under the tree featured the name 'Khai'. Meanwhile, fans have also spotted that Zayn now has her name inked on his wrist.\n\n“Zayn has his daughter’s name tattoo on his arm,” one fan wrote on Twitter. “And he also said in the live that he’s gonna show us his new tattoo next time MAYBE He will show us now the ‘خایی (Khai)’ tattoo.”\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nFebruary 14 2021: It's Valentine's Day and famous people everywhere are taking to social media to share loved-up tributes to their partners, and Gigi Hadid has gone step one further, treating fans to a whole load of unseen pictures of her and Zayn, giving fans a rare glimpse into their often very private relationship.\n\nShe began by posting a black and white picture to her grid, of her and Zayn smiling together in a room full of balloons. She captioned the post, \"I love you, Valentine && love the Valentine we get to share forever 👼🏼\".\n\nShe then posted a string of pictures to her Instagram Story showing the happy couple throughout the year. Along with adorable selfies, she included a picture of Zayn holding a \"dad\" mug and another of him pushing a pram through a very autumnal-looking park.\n\nGigi Hadid Instagram\n\nInstagram\n\nGigi Hadid Instagram\n\nInstagram\n\nGigi Hadid Instagram\n\nLike this article? Sign up to our newsletter to get more articles like this delivered straight to your inbox.\n\nSIGN UP", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gigi-hadid-and-zayn-malik-celebrate-her-birthday-at-the-grilled-cheese-van-1619434392.jpg?crop=1.00xw:0.753xh;0,0&resize=1200:*", "https://www.cosmopolitan.com/sites/cosmopolitan/assets/images/logos/ipso_regulated_hires.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gigi-hadid-and-zayn-malik-celebrate-her-birthday-at-the-grilled-cheese-van-1619434392.jpg?crop=1.00xw:0.753xh;0,0&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.cosmopolitan.com/uk/entertainment/a9961424/zayn-gigi-hadid-dating-timeline/", "title": "Zayn Malik and Gigi Hadid's relationship timeline", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Gigi Hadid and Zayn Malik celebrate her birthday at the grilled cheese van", "description": "Plus Gigi and Zayn's full relationship history", "url": "https://www.cosmopolitan.com/uk/entertainment/a9961424/zayn-gigi-hadid-dating-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gigi-hadid-and-zayn-malik-celebrate-her-birthday-at-the-grilled-cheese-van-1619434392.jpg?crop=1.00xw:0.753xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 211620818858710}, "article": {"publisher": "https://facebook.com/cosmopolitanuk", "modified_time": "2021-06-08T19:27:20Z", "published_time": "2021-04-26T10:56:00Z", "section": "Entertainment", "opinion": "false"}, "twitter": {"site": "@CosmopolitanUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gigi-hadid-and-zayn-malik-celebrate-her-birthday-at-the-grilled-cheese-van-1619434392.jpg?crop=1.00xw:0.753xh;0,0&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Zayn Malik and Gigi Hadid's relationship timeline", "description": "From their first date to their numerous Instagrams, here are Zayn and Gigi Hadid's key moments from their relationship.", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gigi-hadid-and-zayn-malik-celebrate-her-birthday-at-the-grilled-cheese-van-1619434392.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Entertainment,entertainment,Gigi Hadid", "sailthru.date": "2021-04-26T10:56:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gigi-hadid-and-zayn-malik-celebrate-her-birthday-at-the-grilled-cheese-van-1619434392.jpg?crop=1.00xw:0.753xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gigi-hadid-and-zayn-malik-celebrate-her-birthday-at-the-grilled-cheese-van-1619434392.jpg?crop=0.668xw:1.00xh;0.167xw,0", "sailthru.socialtitle": "Gigi Hadid and Zayn Malik celebrate her birthday at the grilled cheese van", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1619434560.0, "source": "https://www.cosmopolitan.com", "summary": ""}