{"url": "https://www.hollywoodreporter.com/live-feed/x-files-finale-trailer-spoilers-analysis-1093269", "text": "“I always wondered how this was going to end.”\n\nWith only two episodes left of The X-Files‘ latest revival, the culmination of the long-running Fox drama is very much up in the air — especially as next week’s episode, “Nothing Lasts Forever,” is a stand-alone hour, leaving the March 21 finale to dive back into the show’s core mythology. Ahead of the season (and possibly series) finale, Fox released a new promo for the rest of the season that offers a few clues as to what to expect. Here, THR breaks it all down.\n\nIn Wednesday’s penultimate hour, FBI agents Fox Mulder (David Duchovny) and Dana Scully (Gillian Anderson) investigate a youth-obsessed cult. But arguably the most important parts of the episode — certainly the most emphasized by the trailer — are the conversations the duo have about their own relationship. “I believed we could live together, and I fled,” Scully says. “I believed I could protect our son, and I failed.” Adds Mulder: “I don’t know if any God is listening, but I am standing right here.”\n\nThe notoriously complicated couple (who broke up before the season 10 revival, but slept together earlier this season) even finally address their status head-on, when Scully questions Mulder’s assumption that they’re together. (Baby steps.)\n\nUnfortunately for them, that may be the least of their problems. In the season finale, “My Struggle IV,” series-long baddie Cigarette Smoking Man (William B. Davis) tells Assistant Director Walter Skinner (Mitch Pileggi) that he’s about to deliver on his promise to unleash a global contagion. The season 10 finale also had the agents trying to stop a global contagion from wiping out the majority of the population; the season 11 premiere revealed that was Scully’s shared premonition with her MIA son, William, about what was to come.\n\nSpeaking of Skinner, the trailer implies he may finally share the secret he’s been sitting on all year. “There’s something you need to know,” Skinner tells Scully. “Something you may not want to hear.” Viewers know that Skinner was told in the season 11 premiere that CSM (not Mulder) was actually William’s (Miles Robbins) biological father … but will he finally tell Scully? (And if he does, will she tell Mulder?)\n\nEither way, William finally will have to face his parents in the finale. After encountering them midseason in “Ghouli” (but using his powers to disguise himself), Mulder seeks out his son to try to get his help; he isn’t able to sway William. “He won’t listen to reason,” Mulder laments to Scully. “He’ll listen to me,” she insists. But the couple aren’t the only ones interested in him: CSM makes it clear he wants to find William ASAP, and the mysterious Erika Price (Barbara Hershey) and Mr. Y (AC Peterson) also appear to have an eye on him. With William on the run (and CSM’s history of hurting/killing the people he claims to care about), will the young man be able to escape the finale unscathed?\n\nA montage of quick scenes also included in the trailer indicates CSM will come face to face with his other son, Mulder (with last season’s finale essentially erased, the two haven’t seen each other since CSM was blown up and presumed dead in 2002’s then-series finale); Skinner gets cornered by a car in an alley; and Mulder and Scully get forcibly separated. (It’s notable that this finale does appear to have more of Mulder/Scully together than the season 10 finale, which saw them share just the final scene.)\n\nComplicating everything is the real-life fact that the show’s fate is still very much up in the air. Anderson has said she’s done with the series after this season; it’s hard to imagine the Scully storyline gets completely tied up with one hour of the mythology story left. With the X-Files world on the verge of dissolving into mayhem, will there be any time for real closure?\n\nWhat do you want to see from the two remaining episodes? Sound off in the comments, below.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/03/the_x-files_s02e10_still_1_embed.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/03/the_x-files_s02e10_still_0.jpg?w=768", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/03/the_x-files_s02e10_still_2_embed.jpg?w=928", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/03/the_x-files_s02e10_still_0.jpg?w=768", "keywords": [], "authors": ["Marisa Roffman"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/x-files-finale-trailer-spoilers-analysis-1093269/", "title": "‘The X-Files’ Finale: Can William Survive His Reunion With Mulder and Scully?", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The trio have a proper reunion in the March 21 season (and possibly series) finale, but it may not be a happy ending.", "news_keywords": "The X-Files", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Marisa Roffman", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1093269, "title": "'The X-Files' Finale: Can William Survive His Reunion With Mulder and Scully?", "published_at": "2018-03-08 17:52:19", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/03/the_x-files_s02e10_still_0.jpg?w=768", "comment_count": 0, "tags": "The X-Files", "topics": "TV News", "body": "\"I always wondered how this was going to end.\"\r\n\t\r\n\tWith only two episodes left of The X-Files' latest revival, the culmination of the long-running Fox drama is very much up in the air — especially as next week's episode, \"Nothing Lasts Forever,\" is a stand-alone hour, leaving the March 21 finale to dive back into the show's core mythology. Ahead of the season (and possibly series) finale, Fox released a new promo for the rest of the season that offers a few clues as to what to expect. Here, THR breaks it all down.\r\nIn Wednesday's penultimate hour, FBI agents Fox Mulder (David Duchovny) and Dana Scully (Gillian Anderson) investigate a youth-obsessed cult. But arguably the most important parts of the episode — certainly the most emphasized by the trailer — are the conversations the duo have about their own relationship. \"I believed we could live together, and I fled,\" Scully says. \"I believed I could protect our son, and I failed.\" Adds Mulder: \"I don't know if any God is listening, but I am standing right here.\"\r\n\t\r\n\tThe notoriously complicated couple (who broke up before the season 10 revival, but slept together earlier this season) even finally address their status head-on, when Scully questions Mulder's assumption that they're together. (Baby steps.)\r\n\r\n\t\r\n\tUnfortunately for them, that may be the least of their problems. In the season finale, \"My Struggle IV,\"  series-long baddie Cigarette Smoking Man (William B. Davis) tells Assistant Director Walter Skinner (Mitch Pileggi) that he's about to deliver on his promise to unleash a global contagion. The season 10 finale also had the agents trying to stop a global contagion from wiping out the majority of the population; the season 11 premiere revealed that was Scully's shared premonition with her MIA son, William, about what was to come.\r\n\t\r\n\tSpeaking of Skinner, the trailer implies he may finally share the secret he's been sitting on all year. \"There's something you need to know,\" Skinner tells Scully. \"Something you may not want to hear.\" Viewers know that Skinner was told in the season 11 premiere that CSM (not Mulder) was actually William's (Miles Robbins) biological father … but will he finally tell Scully? (And if he does, will she tell Mulder?)\r\n\t\r\n\tEither way, William finally will have to face his parents in the finale. After encountering them midseason in \"Ghouli\" (but using his powers to disguise himself), Mulder seeks out his son to try to get his help; he isn't able to sway William. \"He won't listen to reason,\" Mulder laments to Scully. \"He'll listen to me,\" she insists. But the couple aren't the only ones interested in him: CSM makes it clear he wants to find William ASAP, and the mysterious Erika Price (Barbara Hershey) and Mr. Y (AC Peterson) also appear to have an eye on him. With William on the run (and CSM's history of hurting/killing the people he claims to care about), will the young man be able to escape the finale unscathed?\r\n\t\r\n\tA montage of quick scenes also included in the trailer indicates CSM will come face to face with his other son, Mulder (with last season's finale essentially erased, the two haven't seen each other since CSM was blown up and presumed dead in 2002's then-series finale); Skinner gets cornered by a car in an alley; and Mulder and Scully get forcibly separated. (It's notable that this finale does appear to have more of Mulder/Scully together than the season 10 finale, which saw them share just the final scene.)\r\n\r\n\t\r\n\tComplicating everything is the real-life fact that the show's fate is still very much up in the air. Anderson has said she's done with the series after this season; it's hard to imagine the Scully storyline gets completely tied up with one hour of the mythology story left. With the X-Files world on the verge of dissolving into mayhem, will there be any time for real closure?\r\nWhat do you want to see from the two remaining episodes? Sound off in the comments, below.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘The X-Files’ Finale: Can William Survive His Reunion With Mulder and Scully?", "url": "https://www.hollywoodreporter.com/tv/tv-news/x-files-finale-trailer-spoilers-analysis-1093269/", "description": "The trio have a proper reunion in the March 21 season (and possibly series) finale, but it may not be a happy ending.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/03/the_x-files_s02e10_still_0.jpg?w=768", "width": 768, "height": 433}, "locale": "en_US"}, "article": {"published_time": "2018-03-08T17:52:19+00:00", "modified_time": "2018-03-13T13:58:22+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘The X-Files’ Finale: Can William Survive His Reunion With Mulder and Scully?", "description": "The trio have a proper reunion in the March 21 season (and possibly series) finale, but it may not be a happy ending.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/03/the_x-files_s02e10_still_0.jpg?w=768"}}, "movies": [], "publish_date": 1520531539.0, "source": "https://www.hollywoodreporter.com", "summary": ""}