{"url": "www.billboard.com/articles/columns/pop/8465069/blake-shelton-gwen-stefani-relationship-timeline", "text": "Gwen Stefani and Blake Shelton have been going strong for years now. From overcoming hard times together and collaborating on romantic duets to dealing with constant wedding rumors, they constantly prove that they are the ultimate #CoupleGoals.\n\nTo celebrate the season 19 premiere of The Voice on Monday (Oct. 19), where the duo was back in the judges’ chairs where it all began, here’s a look at how one of the cutest couples in music came together.\n\nExplore See latest videos, charts and news Blake Shelton Gwen Stefani See latest videos, charts and news\n\nApril 2014: First Encounter\n\nNo Doubt frontwoman-turned-solo star Gwen Stefani joins Adam Levine, Pharrell Williams and Blake Shelton as a coach on The Voice.\n\nNovember 2014: Flirty Friends\n\nStefani posts her first picture with Shelton, a selfie captioned “[heart] him.”\n\nJuly 2015: Blake & Miranda Lambert Divorce\n\nThe stars call it quits after a four-year reign as one of country music’s hottest couples. With heavy hearts, they announced, “We are real people, with real lives, with real families, friends and colleagues. Therefore, we kindly ask for privacy and compassion concerning this very personal matter.”\n\nAugust 2015: Gwen Splits From Gavin Rossdale\n\nAfter 13 years together, the rocker couple ended their marriage soon after Shelton and Lambert. Their joint statement read, “While the two of us have come to the mutual decision that we will no longer be partners in marriage, we remain partners in parenthood and are committed to jointly raising our three sons in a happy and healthy environment.”\n\nSeptember 2015: Another Sweet Selfie\n\nThe pair lean on each other during mutual hard times, relating through the struggle of divorce.\n\nOctober 2015: Clearly Chemistry\n\nStefani and Shelton appear on The Tonight Show Starring Jimmy Fallon and perform a duet rendition of Drake’s “Hotline Bling.” The performance is packed with chemistry and perhaps some tension in Gwen’s voice on the lyric “late night when you need my love.”\n\nLater that month, the are-they-or-aren’t-they couple are reportedly spotted at George Clooney’s Halloween celebration before heading over to Jared Leto’s. A source told E! News the pair was holding hands and eventually left together.\n\nNovember 2015: It’s Official\n\nA rep for Shelton finally confirms the romance, saying, “Gwen and Blake are longtime friends who have very recently started dating.” Stefani later told Ryan Seacrest, “To be super honest, it is kind of crazy we both went through the same thing at the same time,” adding that they bonded through their divorces.\n\nJanuary 2016: Horsing Around\n\nOklahoma native Shelton gives Stefani a horse for her birthday. Perks of dating a cowboy. Shelton told ET, “I got her a horse and I got myself a horse at the same time. Gwen, she loves riding and she loves horses. It’s actually so funny that people are so shocked by that, but if you can name me one girl on the planet that doesn’t love horses or just thinks that they are beautiful.”\n\nFebruary 2016: Red Carpet Debut\n\nGwen and Blake finally make their public debut as a couple at the Vanity Fair 2016 Oscars afterparty. Gwen performed at the event and wowed in red.\n\nMay 2016: Duet Performance at the Billboard Music Awards\n\nBlake and Gwen beamed in love during a sweet performance of “Go Ahead and Break My Heart” at the BBMAs. They ended the song hand in hand.\n\nJune 2016: Blake Opens Up to Billboard\n\nShelton opened up about heartbreak and new love in his cover story interview, revealing, “Gwen saved my life. Who else on earth could understand going through a high-profile divorce from another musician? You can’t even imagine the similarities in our divorces.”\n\nSeptember 2016: Rumors Arise\n\nEllen asks Gwen point blank about wedding plans, and the smitten singer simply giggles along saying, “I’ll let you know.”\n\nFeb 2017: Gwen Gushes Over All Things Blake\n\nOn The Tonight Show Starring Jimmy Fallon, Gwen talks about Shelton’s love of the woods and all things camo, plus taking him to Disneyland. She gushes through the entire interview, and it’s cute.\n\nOctober 2017: Adam Levine Weighs In\n\nLevine told Howard Stern the couple was “so in love it’s disgusting.” The Maroon 5 singer added, “It’s so funny. They found each other at really interesting times in their lives. It’s really beautiful. Because it’s in the public eye, a lot of people want to have their own bullshit opinions about it, but I’m, like, there. I see it every day. I have a pretty unique perspective on it, and it’s real, man.”\n\nNovember 2017: Blake Shelton Crowned People Magazine’s Sexiest Man Alive.\n\nAfter her beau earned the Sexiest Man Alive title, Stefani told Ellen, “He doesn’t even like to do a photo shoot. You can never convince him to do it. So he just called me like, ‘They want me to do this.’ And I was like, ‘You should totally do it! You’re so sexy!’”\n\nDecember 2017: Holiday Cheer\n\nThe couple unites for a cheerful performance of their duet “You Make It Feel Like Christmas.” They stare into each other’s eyes and look so in love, it hurts.\n\nApril 2018: More Wedding Rumors\n\nGwen sits down with Ellen and admits that she thinks about getting married all the time. Hint-hint, Blake.\n\nJune 2018: Supportive BF\n\nBefore kicking off her Las Vegas residency, Shelton caught his girlfriend rehearsing, and shouted her praises on Twitter. She responded with the hashtag, #Bestboyfriendever.\n\nSetting here watching @gwenstefani rehearsals it continues to shock me the amount of GIANT hits this girl has written… I highly recommend y’all catch her Vegas show if you can get tickets!!! — Blake Shelton (@blakeshelton) June 14, 2018\n\nOn opening night of the residency, Gwen posted an adorable photo series, with youngest son Zuma snuggled on Blake’s lap.\n\nJuly 2018: ‘Super In Love’\n\nIn an interview with In Style, Gwen admits that her look is more feminine than ever before. She adds, “It’s probably because I’m super in love and have a really manly man [Blake Shelton]. I enjoy letting that part of me come out.”\n\nNovember 2018: ‘You Make It Feel Like Christmas’\n\nThe video for the titular song off Stefani’s holiday album finds the couple celebrating the holidays together by jamming together in classic formal attire. Children dressed like Santa back them up with jazzy instruments and fun dance moves.\n\nMarch 2019: Album Smooch\n\nIn the midst of his national tour, the country star picked up a copy of Love. Angel. Music. Baby., Stefani’s 2004 solo debut album after an audience member hurled it onto the stage.\n\n“She is awesome! And hot!” he declared. He then pulled the record close to his face and planted a kiss on the cover. “I haven’t seen her in a couple weeks, so…”\n\nJune 2019: Shelton’s Birthday\n\n“Happy b day to my favorite human!!! Can’t believe your mine,” Stefani wrote alongside a throwback snap of the star. “#soooooolucky!!!! Gx #2019 #gemini #greatestguyiknow thank u shedd aquarium Chicago for an amazing unexpected b day tour!!!”\n\nAugust 2019: Stefani Returns to The Voice\n\nStefani sat in the coach’s chair for season 17 of The Voice, alongside Shelton. It was the first time both have been judges since their romance ignited on the show in 2015. In a teaser for the season, Stefani eggs Shelton on, saying: “You wanna fight, Blakey?” to which Shelton responds, “I’m gonna pay for this at home!”\n\nSeptember 2019: Stefani Admits a Hilarious Secret\n\nThe “Hollaback Girl” singer stopped by SiriusXM’s Andy Cohen Live show, where she discussed why she loves working with her partner. “He’s so good at the show, I mean, he’s just so magical,” Stefani gushed to Cohen. “Blake is literally a unicorn. Like anywhere he goes, people are just attracted to him, and he’s such an incredible talent.”\n\nBut once upon a time, Stefani didn’t know he even existed on the same planet. “I can’t imagine before, I didn’t even know he existed, like before the show. I didn’t even know he was a human being on this planet, and I didn’t know much about country…. He is literally a country jukebox. He knows every single song forever, he’s incredible like that. But I just love that we’re so from different genres.”\n\nOctober 2019: Sweet Birthday Post\n\nFor Stefani’s 50th birthday, Shelton took to Twitter to express his love. “Happy Birthday @gwenstefani!!!! I love you so much it’s actually stupid… And possibly illegal in the state of California,” the country superstar tweeted.\n\nHappy Birthday @gwenstefani!!!! I love you so much it’s actually stupid… And possibly illegal in the state of California. — Blake Shelton (@blakeshelton) October 3, 2019\n\nJanuary 2020: ‘Nobody But You’\n\nThe couple’s duet, featured on Shelton’s Fully Loaded: God’s Country album, showcases the couple’s relationship, has Shelton singing of how he doesn’t want to look back in 30 years and find out who Stefani gets married to. “When you love someone they say set ‘em free/ But that ain’t gonna work for me,” the couple sing.\n\nThe song entered the streaming, airplay and sales-based Hot Country Songs chart at No. 9, awarding Shelton his 32nd top 10 and Stefani her first.\n\nJanuary 2020: Grammys Performance\n\nThe couple performed “Nobody But You” at the Grammys, gazing into each other’s eyes as they sang. The performance ended with Shelton bowing down to the fellow Voice judge as she chuckled towards the audience.\n\nMarch 2020: Quarantine Mullet\n\nAs the world began to shut down due to the coronavirus pandemic, Shelton took the time away from in-person appearances to bring back his iconic mullet from the good ol’ days.\n\nThe country crooner took to Twitter to provide a much-anticipated “quarantine mullet” update. He noted that Stefani “has decided to take it to the next level.. Stripes.”\n\nQuarantine mullet update 3/26/2020… @gwenstefani has decided to take it to the next level.. Stripes. pic.twitter.com/XZJzWOoAd5 — Blake Shelton (@blakeshelton) March 26, 2020\n\nApril 2020: ACM Presents: Our Country Performance\n\nDuring ACM Presents: Our Country on Sunday night (April 5), the couple got in on the fun with an at-home performance recorded in Oklahoma. “We’re happy to be [here], hiding away from everybody doing what we’re supposed to do: drinking all day,” said Shelton, to which Stefani replied with a laugh, “Not me!”\n\nApril 2020: Their First No. 1 Together\n\n“Nobody But You,” hit No. 1 on the Billboard Country Airplay chart, and the couple could not contain their excitement. “Trying to wrap my head around the fact that I even get to know you Blake Shelton – let alone be on Such a beautiful classic duet w u?!,” Stefani wrote. “Thank you ! for taking me along on this ride with you!! I am so grateful and blown away by all the support everyone has shown us!!?!!”\n\n“Not bad for your first try!!!!! Thank you all as well!!!” Shelton congratulated Stefani for her first country song going to No. 1 at country radio.\n\nTrying to wrap my head around the fact that I even get to know you Blake Shelton 😍-let alone be on Such a beautiful classic duet w u?!🤯\n\nthank you ! for taking me along on this ride with you!! I am so grateful and blown away by all the support everyone has shown us!!?!!😳🙏🏻\n\ngx https://t.co/mhK0i9JZ3H — Gwen Stefani (@gwenstefani) April 28, 2020\n\nJuly 2020: ‘Happy Anywhere’\n\nBlake Shelton is “Happy Anywhere” in his next quarantine-inspired duet featuring Gwen Stefani. “Even though Gwen and I just had a single out we decided that, under the circumstances, this year… man, there’s never been a better time for ‘Happy Anywhere,'” Shelton said in a press release. “We’ve all been in quarantine and lockdown, and hopefully we’ve been doing that with somebody that we really love and enjoy being around. That’s what happened with Gwen and me this summer — and this entire year.”\n\nSeptember 2020: Stefani Updates Some Old Photos\n\nStefani shared a Photoshopped throwback picture on social media, replacing ex-husband Gavin Rossdale with longtime love Blake Shelton.\n\n“#Datenight @acmawards w my boo @blakeshelton gx,” she captioned the photo, which featured her younger self wearing a black crop top with floral embroidery and victory rolls while a younger Shelton is pasted in next to her, wearing an oversized trench coat and long flowing locks under his black cowboy hat. Stefani had previously shared the original vintage photo featuring Rossdale on her Instagram feed back in Sept. 2014.\n\nCompare Stefani’s throwback posts with Shelton and Rossdale here and here.\n\nSeptember 2020: Hair Dye Job\n\nShelton trusted Stefani to dye his hair once he realized he was going gray.\n\n“We were on Jimmy’s show and I think I saw a picture back, and I turned my head to the side at some point, and it was just…. There was no more salt and pepper. It’s just salt,” he laughed during an appearance on The Ellen DeGeneres Show. “And so I said, ‘Oh my God, when did this happen to me?'”\n\n“So we ordered some Just For Men, and I tried that for a while. And I wasn’t doing it right, and… it had too much color. It was like blue or purple or something,” the “God’s Country” artist recalled. “So then she just said, ‘Let’s just do it right.’ … And I actually really liked it…. I’m not opposed to having her color my hair again. I don’t care. If it makes her happy, I’m cool with it.”\n\nOctober 2020: Yet Another Adorable Birthday Post\n\nTo help celebrate the singer’s 51st birthday, Shelton shared a romantic message dedicated to her on Instagram.\n\n“It’s a special day for a special lady in my life. Happy birthday @gwenstefani, I’d write a song for you every single day if I could…,” Shelton captioned a photo of the couple cozying up in a field. See Shelton’s birthday post here.\n\nOctober 2020: Gwen Returns to The Voice (Again)\n\nSpeaking to Entertainment Tonight, Shelton said Stefani’s return in place of season 18 judge Nick Jonas is like getting the band back together.\n\n“Having Gwen back is very comforting to all the coaches,” Shelton told ET from the socially-distanced set. “We were all able to just go back to the game we already knew. We all know how to play each other at this thing. It felt like the old gang got back together again, and we’re having a blast.”\n\nOctober 2020: Engaged!\n\nAfter five years together, the couple announced their engagement on Instagram with matching photos of the No Doubt frontwoman holding up her hand to show up her sparkly new accessory as they kiss in what appears to be a small church. “I heard a YES!” Shelton captioned his image.", "images": ["https://www.billboard.com/wp-content/uploads/media/Blake-Shelton-and-Gwen-Stefani-2016-pre-grammy-party-billboard-1548.jpg?w=942&h=623&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.billboard.com/wp-content/uploads/media/Blake-Shelton-and-Gwen-Stefani-2016-pre-grammy-party-billboard-1548.jpg?w=1024", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif"], "top_img": "https://www.billboard.com/wp-content/uploads/media/Blake-Shelton-and-Gwen-Stefani-2016-pre-grammy-party-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Sofia Mele"], "canonical_link": "https://www.billboard.com/music/pop/gwen-stefani-blake-shelton-relationship-timeline-8465069/", "title": "A Timeline of Gwen Stefani & Blake Shelton’s Relationship", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "Pop-rockstar Gwen Stefani and country crooner Blake Shelton have been going steady for years now. From overcoming hard times together and collaborating on romantic duets, to dealing with constant wedding rumors, here's a look back at one of the cutest couples in music.", "news_keywords": "bbnews", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 8465069, "author": "Sofia Mele", "pmc-category": "Music,Pop", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2020-10-27T13:00:07"}, "pmc-tag": "bbnews", "title": "A Timeline of Gwen Stefani & Blake Shelton’s Relationship", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Sofia Mele", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 8465069, "title": "A Timeline of Gwen Stefani & Blake Shelton's Relationship", "published_at": "2020-10-27 13:00:07", "image": "https://www.billboard.com/wp-content/uploads/media/Blake-Shelton-and-Gwen-Stefani-2016-pre-grammy-party-billboard-1548.jpg?w=1024", "comment_count": 0, "tags": "bbnews", "topics": "Pop", "body": "Gwen Stefani and Blake Shelton have been going strong for years now. From overcoming hard times together and collaborating on romantic duets to dealing with constant wedding rumors, they constantly prove that they are the ultimate #CoupleGoals.\r\n\r\nTo celebrate the season 19 premiere of The Voice on Monday (Oct. 19), where the duo was back in the judges' chairs where it all began, here's a look at how one of the cutest couples in music came together.\r\n\r\n\r\n\r\nApril 2014: First Encounter\r\n\r\nNo Doubt frontwoman-turned-solo star Gwen Stefani joins Adam Levine, Pharrell Williams and Blake Shelton as a coach on The Voice. \r\n\r\nNovember 2014: Flirty Friends \r\n\r\nStefani posts her first picture with Shelton, a selfie captioned “[heart] him.\"\r\n\r\nhttps://www.instagram.com/p/v2EKNcOLb7/\r\n\r\nJuly 2015: Blake & Miranda Lambert Divorce\r\n\r\nThe stars call it quits after a four-year reign as one of country music's hottest couples. With heavy hearts, they announced, \"We are real people, with real lives, with real families, friends and colleagues. Therefore, we kindly ask for privacy and compassion concerning this very personal matter.\"\r\n\r\nAugust 2015: Gwen Splits From Gavin Rossdale\r\n\r\nAfter 13 years together, the rocker couple ended their marriage soon after Shelton and Lambert. Their joint statement read, \"While the two of us have come to the mutual decision that we will no longer be partners in marriage, we remain partners in parenthood and are committed to jointly raising our three sons in a happy and healthy environment.\"\r\n\r\n\r\n\r\nSeptember 2015: Another Sweet Selfie \r\n\r\nThe pair lean on each other during mutual hard times, relating through the struggle of divorce.\r\n\r\nhttps://www.instagram.com/p/BLzJq6cDojw/\r\n\r\nOctober 2015: Clearly Chemistry \r\n\r\nStefani and Shelton appear on The Tonight Show Starring Jimmy Fallon and perform a duet rendition of Drake's \"Hotline Bling.\" The performance is packed with chemistry and perhaps some tension in Gwen's voice on the lyric \"late night when you need my love.\"\r\n\r\nLater that month, the are-they-or-aren't-they couple are reportedly spotted at George Clooney's Halloween celebration before heading over to Jared Leto's. A source told E! News the pair was holding hands and eventually left together.\r\n\r\nNovember 2015: It's Official\r\n\r\nA rep for Shelton finally confirms the romance, saying, \"Gwen and Blake are longtime friends who have very recently started dating.\" Stefani later told Ryan Seacrest, \"To be super honest, it is kind of crazy we both went through the same thing at the same time,\" adding that they bonded through their divorces.\r\n\r\nJanuary 2016: Horsing Around\r\n\r\nOklahoma native Shelton gives Stefani a horse for her birthday. Perks of dating a cowboy. Shelton told ET, \"I got her a horse and I got myself a horse at the same time. Gwen, she loves riding and she loves horses. It's actually so funny that people are so shocked by that, but if you can name me one girl on the planet that doesn't love horses or just thinks that they are beautiful.\"\r\n\r\nhttps://www.instagram.com/p/BA7pBV9OLQ-/\r\n\r\nFebruary 2016: Red Carpet Debut\r\n\r\nGwen and Blake finally make their public debut as a couple at the Vanity Fair 2016 Oscars afterparty. Gwen performed at the event and wowed in red.\r\n\r\nhttps://www.instagram.com/p/BCcWrQduLTN/\r\n\r\nMay 2016: Duet Performance at the Billboard Music Awards\r\n\r\nBlake and Gwen beamed in love during a sweet performance of “Go Ahead and Break My Heart” at the BBMAs. They ended the song hand in hand.\r\n\r\nhttps://www.youtube.com/watch?v=tC7nXAYIQ-s\r\n\r\nJune 2016: Blake Opens Up to Billboard\r\n\r\nShelton opened up about heartbreak and new love in his cover story interview, revealing, “Gwen saved my life. Who else on earth could understand going through a high-profile divorce from another musician? You can’t even imagine the similarities in our divorces.”\r\n\r\nSeptember 2016: Rumors Arise \r\n\r\nEllen asks Gwen point blank about wedding plans, and the smitten singer simply giggles along saying, \"I'll let you know.\"\r\n\r\nFeb 2017: Gwen Gushes Over All Things Blake \r\n\r\nOn The Tonight Show Starring Jimmy Fallon, Gwen talks about Shelton's love of the woods and all things camo, plus taking him to Disneyland. She gushes through the entire interview, and it's cute.\r\n\r\nhttps://www.youtube.com/watch?v=T1iAhCr0jGo\r\n\r\nOctober 2017: Adam Levine Weighs In\r\n\r\nLevine told Howard Stern the couple was “so in love it's disgusting.” The Maroon 5 singer added, “It's so funny. They found each other at really interesting times in their lives. It's really beautiful. Because it's in the public eye, a lot of people want to have their own bullshit opinions about it, but I'm, like, there. I see it every day. I have a pretty unique perspective on it, and it's real, man.\"\r\n\r\nNovember 2017: Blake Shelton Crowned People Magazine's Sexiest Man Alive. \r\n\r\nAfter her beau earned the Sexiest Man Alive title, Stefani told Ellen, “He doesn’t even like to do a photo shoot. You can never convince him to do it. So he just called me like, ‘They want me to do this.’ And I was like, ‘You should totally do it! You’re so sexy!’”\r\n\r\n\r\n\r\nDecember 2017: Holiday Cheer \r\n\r\nThe couple unites for a cheerful performance of their duet \"You Make It Feel Like Christmas.\" They stare into each other's eyes and look so in love, it hurts.\r\n\r\nhttps://www.instagram.com/p/BcoX5h-F7Ji/\r\n\r\nApril 2018: More Wedding Rumors \r\n\r\nGwen sits down with Ellen and admits that she thinks about getting married all the time. Hint-hint, Blake.\r\n\r\nJune 2018: Supportive BF\r\n\r\nBefore kicking off her Las Vegas residency, Shelton caught his girlfriend rehearsing, and shouted her praises on Twitter. She responded with the hashtag, #Bestboyfriendever.\r\n\r\nhttps://twitter.com/blakeshelton/status/1007405160811958272\r\n\r\nhttps://twitter.com/gwenstefani/status/1007444616587587585\r\n\r\nOn opening night of the residency, Gwen posted an adorable photo series, with youngest son Zuma snuggled on Blake's lap.\r\n\r\nhttps://www.instagram.com/p/Bkkrif5FFsM/\r\n\r\nJuly 2018: 'Super In Love'\r\n\r\nIn an interview with In Style, Gwen admits that her look is more feminine than ever before. She adds, \"It’s probably because I’m super in love and have a really manly man [Blake Shelton]. I enjoy letting that part of me come out.\"\r\n\r\nNovember 2018: 'You Make It Feel Like Christmas' \r\n\r\nThe video for the titular song off Stefani's holiday album finds the couple celebrating the holidays together by jamming together in classic formal attire. Children dressed like Santa back them up with jazzy instruments and fun dance moves.\r\n\r\nhttps://www.youtube.com/watch?v=3ZT9_H4-hbM&feature=emb_title\r\n\r\nMarch 2019: Album Smooch\r\n\r\nIn the midst of his national tour, the country star picked up a copy of Love. Angel. Music. Baby., Stefani's 2004 solo debut album after an audience member hurled it onto the stage.\r\n\r\n\"She is awesome! And hot!\" he declared. He then pulled the record close to his face and planted a kiss on the cover. \"I haven't seen her in a couple weeks, so...\"\r\n\r\nhttps://www.instagram.com/p/BvVyNA9F-25/?utm_source=ig_embed&utm_medium=loading\r\n\r\nJune 2019: Shelton's Birthday\r\n\r\n\"Happy b day to my favorite human!!! Can’t believe your mine,\" Stefani wrote alongside a throwback snap of the star. \"#soooooolucky!!!! Gx #2019 #gemini #greatestguyiknow thank u shedd aquarium Chicago for an amazing unexpected b day tour!!!\"\r\n\r\nhttps://www.instagram.com/p/By3kFrwBZEH/\r\n\r\nAugust 2019: Stefani Returns to The Voice\r\n\r\nStefani sat in the coach's chair for season 17 of The Voice, alongside Shelton. It was the first time both have been judges since their romance ignited on the show in 2015. In a teaser for the season, Stefani eggs Shelton on, saying: \"You wanna fight, Blakey?\" to which Shelton responds, \"I'm gonna pay for this at home!\"\r\n\r\nhttps://twitter.com/gwenstefani/status/1162028739657551872\r\n\r\nSeptember 2019: Stefani Admits a Hilarious Secret\r\n\r\nThe “Hollaback Girl” singer stopped by SiriusXM’s Andy Cohen Live show, where she discussed why she loves working with her partner. “He’s so good at the show, I mean, he’s just so magical,” Stefani gushed to Cohen. “Blake is literally a unicorn. Like anywhere he goes, people are just attracted to him, and he’s such an incredible talent.”\r\n\r\nBut once upon a time, Stefani didn’t know he even existed on the same planet. “I can’t imagine before, I didn’t even know he existed, like before the show. I didn’t even know he was a human being on this planet, and I didn’t know much about country…. He is literally a country jukebox. He knows every single song forever, he’s incredible like that. But I just love that we’re so from different genres.”\r\n\r\nhttps://www.youtube.com/watch?v=N9qxYGtbvLo&feature=emb_title\r\n\r\nOctober 2019: Sweet Birthday Post\r\n\r\nFor Stefani's 50th birthday, Shelton took to Twitter to express his love. “Happy Birthday @gwenstefani!!!! I love you so much it’s actually stupid… And possibly illegal in the state of California,” the country superstar tweeted.\r\n\r\nhttps://twitter.com/blakeshelton/status/1179766749778055170\r\n\r\nJanuary 2020: 'Nobody But You'\r\n\r\nThe couple's duet, featured on Shelton's Fully Loaded: God's Country album, showcases the couple's relationship, has Shelton singing of how he doesn’t want to look back in 30 years and find out who Stefani gets married to. “When you love someone they say set ‘em free/ But that ain’t gonna work for me,” the couple sing.\r\n\r\nThe song entered the streaming, airplay and sales-based Hot Country Songs chart at No. 9, awarding Shelton his 32nd top 10 and Stefani her first.\r\n\r\nhttps://www.youtube.com/watch?v=4h9o0Gujuoc&feature=emb_title\r\n\r\nJanuary 2020: Grammys Performance\r\n\r\nThe couple performed \"Nobody But You\" at the Grammys, gazing into each other's eyes as they sang. The performance ended with Shelton bowing down to the fellow Voice judge as she chuckled towards the audience.\r\n\r\nhttps://www.youtube.com/watch?v=kB49u6rsib8&feature=emb_title\r\n\r\nMarch 2020: Quarantine Mullet\r\n\r\nAs the world began to shut down due to the coronavirus pandemic, Shelton took the time away from in-person appearances to bring back his iconic mullet from the good ol' days.\r\n\r\nThe country crooner took to Twitter to provide a much-anticipated \"quarantine mullet\" update. He noted that Stefani \"has decided to take it to the next level.. Stripes.\"\r\n\r\nhttps://twitter.com/blakeshelton/status/1243256685688487944\r\n\r\nApril 2020: ACM Presents: Our Country Performance\r\n\r\nDuring ACM Presents: Our Country on Sunday night (April 5), the couple got in on the fun with an at-home performance recorded in Oklahoma. \"We're happy to be [here], hiding away from everybody doing what we're supposed to do: drinking all day,\" said Shelton, to which Stefani replied with a laugh, \"Not me!\"\r\n\r\nApril 2020: Their First No. 1 Together\r\n\r\n\"Nobody But You,\" hit No. 1 on the Billboard Country Airplay chart, and the couple could not contain their excitement. \"Trying to wrap my head around the fact that I even get to know you Blake Shelton - let alone be on Such a beautiful classic duet w u?!,\" Stefani wrote. \"Thank you ! for taking me along on this ride with you!! I am so grateful and blown away by all the support everyone has shown us!!?!!\"\r\n\r\n\"Not bad for your first try!!!!! Thank you all as well!!!\" Shelton congratulated Stefani for her first country song going to No. 1 at country radio.\r\n\r\nhttps://twitter.com/gwenstefani/status/1254958402737930240\r\n\r\nJuly 2020: 'Happy Anywhere'\r\n\r\nBlake Shelton is \"Happy Anywhere\" in his next quarantine-inspired duet featuring Gwen Stefani. \"Even though Gwen and I just had a single out we decided that, under the circumstances, this year… man, there’s never been a better time for 'Happy Anywhere,'\" Shelton said in a press release. \"We’ve all been in quarantine and lockdown, and hopefully we've been doing that with somebody that we really love and enjoy being around. That’s what happened with Gwen and me this summer -- and this entire year.\"\r\n\r\nhttps://www.youtube.com/watch?v=UcLSjQx8GXA\r\n\r\nSeptember 2020: Stefani Updates Some Old Photos\r\n\r\nStefani shared a Photoshopped throwback picture on social media, replacing ex-husband Gavin Rossdale with longtime love Blake Shelton.\r\n\r\n\"#Datenight @acmawards w my boo @blakeshelton gx,\" she captioned the photo, which featured her younger self wearing a black crop top with floral embroidery and victory rolls while a younger Shelton is pasted in next to her, wearing an oversized trench coat and long flowing locks under his black cowboy hat. Stefani had previously shared the original vintage photo featuring Rossdale on her Instagram feed back in Sept. 2014.\r\n\r\nCompare Stefani's throwback posts with Shelton and Rossdale here and here.\r\n\r\nSeptember 2020: Hair Dye Job\r\n\r\nShelton trusted Stefani to dye his hair once he realized he was going gray.\r\n\r\n\"We were on Jimmy's show and I think I saw a picture back, and I turned my head to the side at some point, and it was just.... There was no more salt and pepper. It's just salt,\" he laughed during an appearance on The Ellen DeGeneres Show.  \"And so I said, 'Oh my God, when did this happen to me?'\"\r\n\r\n\"So we ordered some Just For Men, and I tried that for a while. And I wasn't doing it right, and... it had too much color. It was like blue or purple or something,\" the \"God's Country\" artist recalled. \"So then she just said, 'Let's just do it right.' ... And I actually really liked it.... I'm not opposed to having her color my hair again. I don't care. If it makes her happy, I'm cool with it.\"\r\n\r\nhttps://www.youtube.com/watch?v=EuNl5ibP4wI&feature=emb_title\r\n\r\nOctober 2020: Yet Another Adorable Birthday Post\r\n\r\nTo help celebrate the singer's 51st birthday, Shelton shared a romantic message dedicated to her on Instagram.\r\n\r\n\"It’s a special day for a special lady in my life. Happy birthday @gwenstefani, I’d write a song for you every single day if I could...,\" Shelton captioned a photo of the couple cozying up in a field. See Shelton's birthday post here.\r\n\r\nOctober 2020: Gwen Returns to The Voice (Again)\r\n\r\nSpeaking to Entertainment Tonight, Shelton said Stefani's return in place of season 18 judge Nick Jonas is like getting the band back together.\r\n\r\n\"Having Gwen back is very comforting to all the coaches,\" Shelton told ET from the socially-distanced set. \"We were all able to just go back to the game we already knew. We all know how to play each other at this thing. It felt like the old gang got back together again, and we're having a blast.\"\r\n\r\nOctober 2020: Engaged!\r\n\r\nAfter five years together, the couple announced their engagement on Instagram with matching photos of the No Doubt frontwoman holding up her hand to show up her sparkly new accessory as they kiss in what appears to be a small church. \"I heard a YES!\" Shelton captioned his image.", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "A Timeline of Gwen Stefani & Blake Shelton’s Relationship", "url": "https://www.billboard.com/music/pop/gwen-stefani-blake-shelton-relationship-timeline-8465069/", "description": "Pop-rockstar Gwen Stefani and country crooner Blake Shelton have been going steady for years now. From overcoming hard times together and collaborating on romantic duets, to dealing with constant w…", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/Blake-Shelton-and-Gwen-Stefani-2016-pre-grammy-party-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Blake Shelton and Gwen Stefani"}, "locale": "en_US"}, "article": {"published_time": "2020-10-27T17:00:07+00:00", "modified_time": "2020-10-27T17:51:40+00:00"}, "twitter": {"site": "@billboard", "card": "summary_large_image", "title": "A Timeline of Gwen Stefani & Blake Shelton’s Relationship", "description": "Pop-rockstar Gwen Stefani and country crooner Blake Shelton have been going steady for years now. From overcoming hard times together and collaborating on romantic duets, to dealing with constant wedding rumors, here's a look back at one of the cutest couples in music.", "image": "https://www.billboard.com/wp-content/uploads/media/Blake-Shelton-and-Gwen-Stefani-2016-pre-grammy-party-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1603818007.0, "source": "http://www.billboard.com", "summary": ""}