{"url": "www.yahoo.com/entertainment/everything-jennifer-garner-said-ben-113604502.html", "text": "It’s been more than three years since Ben Affleck and Jennifer Garner announced their decision to separate after 10 years of marriage.\n\nThough the two have not been romantically involved since then, they have remained very much a part of each other’s lives, co-parenting their three children — Violet, 12, Seraphina, 9, and Sam, 6 — together and often attending church and going on vacations as a family.\n\nThen on Wednesday, Garner was spotted driving her ex to a rehab facility.\n\n“Ben’s priorities remain his family and his sobriety,” a source told ET. “He continues to attend meetings and mediation classes for his well-being. You have to work at your sobriety every day and he does that.”\n\nSince their separation in 2015, the exes have not officially divorced. While Garner, 46, has remained fiercely private and protective of her family, she has, on occasion, spoken about Affleck and their children.\n\nHere’s everything she’s said about Affleck since their split:\n\nJuly 2018\n\nGarner opened up about the pressures of public life on her marriage and her family during a CBS Sunday Morning interview, saying, “Looking back on that, I really feel the stress of it. I really — I could cry talking about it.”\n\nShe added, “What I think I’ve learned is that the scrutiny in your private life puts a pressure to make something happen. You feel a pressure to hurry up and get married, ‘cause you think that’ll end the, ‘Are they engaged? Are they not?’ And that’s true in reverse, as well. If you are — if there is any inkling of trouble, or if the tabloids decide there’s trouble, it can create trouble. But to be honest, public scrutiny, everyone says, ‘Oh, you’ve had to go through this in public.’ The public isn’t what’s hard. What’s hard is going through it.”\n\nJune 2018\n\nFor Father’s Day, Garner penned a rare and touching tribute to Affleck on Instagram, writing, “Our kids are lucky to have a dad who looks at them the way you look at them and loves them the way you love them, @benaffleck. #happyfathersday #threeluckykids #haveagreatday.”\n\nStory continues\n\nNovember 2017\n\nIn an interview with news.com.au, Garner talked about being separated from the father of her children, saying, “I would not have chosen this life for myself or for my kids. I would not choose to be single or be in this position. It’s something that we are working through.”\n\nMay 2017\n\nAfter People magazine released a cover story about Garner’s new life as a single mom, Garner took to Facebook to set the record straight.\n\n“This isn’t a tragedy by any measure, but it does affect me and my family and so, before my mom’s garden club lights up her phone, I wanted to set the record straight,\" she said. \"I did not pose for this cover. I did not participate in or authorize this article. While we are here, for what it’s worth: I have three wonderful kids and my family is complete.”\n\nOctober 2016\n\nGarner spoke with ET’s Denny Directo at the Save the Children Illumination Gala about how she and Affleck have chosen to raise their kids.\n\n“It’s so important that you model for your kids how to be a citizen of the world, and I think that’s the best thing you can do,” she told ET, adding that she and Affleck each have special causes that they try to teach their kids about.\n\n“That’s really important at home, to make sure that our kids know that we both have causes that we care so much about… that we dedicate time, resources, and our energy toward making our own little slice of the world a little bit better,” she said.\n\nAugust 2016\n\n'We are definitely a modern family': #JenniferGarner talks to @nmoralesnbc about family and marriage https://t.co/jJpZAE5BoG — TODAY (@TODAYshow) August 4, 2016\n\nGarner was praised on the Today show for putting her kids first while dealing with the end of her marriage.\n\n“It has to be,” she said. \"You don’t have a choice. It has to be.”\n\nCalling their family unit “definitely a modern family,” she added, “We’re doing really well.”\n\nShe also opened up about her decision to take her kids to London for the filming of Justice League, in which Affleck played Batman.\n\n“Ben was working on Justice League, and I thought, ‘Well, the kids should have that experience,'” she explained. “He and I are great friends, and we just all went en masse.”\n\nFebruary 2016\n\nVanity Fair\n\nOpening up for the first time since the couple announced their split in June 2015, Garner told her side of the story in a Vanity Fair cover piece. She had both kind and honest words for her estranged husband in the article.\n\n“It was a real marriage,” she said. “It wasn’t for the cameras. And It was a huge priority for me to stay in it. And that didn’t work.”\n\nShe added that she’d do it all over again, saying, “I didn’t marry the big fat movie star; I married him. And I would go back and remake that decision. He’s the love of my life. What am I going to do about that?”\n\nAs for Affleck’s personality, Garner admitted, “I always say, ‘When his sun shines on you, you feel it.’ But when the sun is shining elsewhere, it’s cold. He can cast quite a shadow.”\n\nOf their bond, she admitted, “He’s still the only person who really knows the truth about things. And I’m still the only person that knows some of his truths.”\n\nWhen it comes to the public’s response to Affleck, she noted, “No one needs to hate [Ben] for me. I don’t hate him. Certainly we don’t have to beat the guy up. Don’t worry — my eyes were wide open during the marriage.”\n\nHere's more on Garner and Affleck:\n\nRELATED CONTENT:\n\nInside What Led to Ben Affleck's Return to Rehab (Exclusive)\n\nJennifer Garner Takes Ben Affleck Back to Rehab After His Struggles With Sobriety\n\nJennifer Garner Doesn't Want to 'Police' Who Ben Affleck Dates Amid Romance With Playboy Model (Exclusive)\n\nRelated Articles:", "images": ["https://s.yimg.com/rz/p/yahoo_entertainment_en-US_h_w_entertainmentv2.png", "https://sb.scorecardresearch.com/p?c1=2&c2=7241469&c5=1197800334&c7=https%3A%2F%2Fwww.yahoo.com%2Fentertainment%2Feverything-jennifer-garner-said-ben-113604502.html&c14=-1", "https://s.yimg.com/ny/api/res/1.2/ah.zH2Cz3o7dYIXtOmd7Xw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTUwO2g9NDg-/https://s.yimg.com/os/creatr-uploaded-images/2020-11/07b8d210-243d-11eb-bbff-617af51ac603", "https://s.yimg.com/ny/api/res/1.2/cYZGJsf_Q1a1eoVeVoATKA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en-US/homerun/etonline.tv/45faf34ab2e832651cb1c32d7bff4233", "https://s.yimg.com/rz/p/yahoo_entertainment_en-US_h_p_entertainmentv2.png", "https://s.yimg.com/ny/api/res/1.2/QUHh5GbdRzCvnFM6w7boug--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTEzNDc-/https://s.yimg.com/uu/api/res/1.2/.x_jpV6ZlK9G8nKTxGluXA--~B/aD04OTg7dz02NDA7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/homerun/etonline.tv/76b58ee39c7a25af40c6ec5d61100555", "https://s.yimg.com/cv/apiv2/default/20190501/placeholder.gif"], "top_img": "https://s.yimg.com/ny/api/res/1.2/cYZGJsf_Q1a1eoVeVoATKA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en-US/homerun/etonline.tv/45faf34ab2e832651cb1c32d7bff4233", "keywords": [], "authors": ["Rachel Mcrady"], "canonical_link": "https://www.yahoo.com/entertainment/everything-jennifer-garner-said-ben-113604502.html", "title": "Everything Jennifer Garner Has Said About Ben Affleck Since Their Split", "meta_data": {"oath": {"guce": {"consent-host": "guce.yahoo.com"}}, "news_keywords": "Jennifer Garner, Ben Affleck, Jennifer Garner, Ben Affleck, Batman", "twitter": {"title": "Everything Jennifer Garner Has Said About Ben Affleck Since Their Split", "description": "The actress drove her ex to rehab on Wednesday.", "site": "@Yahoo", "dnt": "on", "image": {"identifier": "https://s.yimg.com/ny/api/res/1.2/cYZGJsf_Q1a1eoVeVoATKA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en-US/homerun/etonline.tv/45faf34ab2e832651cb1c32d7bff4233", "src": "https://s.yimg.com/ny/api/res/1.2/cYZGJsf_Q1a1eoVeVoATKA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en-US/homerun/etonline.tv/45faf34ab2e832651cb1c32d7bff4233"}, "card": "summary_large_image"}, "og": {"title": "Everything Jennifer Garner Has Said About Ben Affleck Since Their Split", "url": "https://www.yahoo.com/entertainment/everything-jennifer-garner-said-ben-113604502.html", "description": "The actress drove her ex to rehab on Wednesday.", "type": "article", "image": {"identifier": "https://s.yimg.com/ny/api/res/1.2/cYZGJsf_Q1a1eoVeVoATKA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en-US/homerun/etonline.tv/45faf34ab2e832651cb1c32d7bff4233", "width": 1200, "height": 675}}, "al": {"android": {"url": "yahoo://article/view?uuid=ead37a7d-0693-35ed-9248-93a4ca9303c7&src=web", "app_name": "Yahoo", "package": "com.yahoo.mobile.client.android.yahoo"}, "ios": {"url": "yahoo://article/view?uuid=ead37a7d-0693-35ed-9248-93a4ca9303c7&src=web", "app_name": "Yahoo", "app_store_id": 304158842}}, "description": "The actress drove her ex to rehab on Wednesday.", "robots": "max-image-preview:large"}, "movies": [], "publish_date": null, "source": "http://www.yahoo.com", "summary": ""}