{"url": "https://en.wikipedia.org/wiki/Scott_Peterson", "text": "American convicted murderer (born 1972)\n\nNot to be confused with Drew Peterson , an individual with a similar name and criminal case.\n\nFor other people named Scott Peterson, see Scott Peterson (disambiguation)\n\nScott Lee Peterson[1] (born October 24, 1972) is an American convicted murderer. In 2004, he was convicted of the first-degree murder of his wife, Laci, who was pregnant at the time, and the second-degree murder of their unborn son, Conner, in Modesto, California.\n\nIn 2005, Peterson was sentenced to death by lethal injection. His case was put on automatic appeal to the Supreme Court of California.[2][3][4] On August 24, 2020, the death penalty for Peterson was overturned, though his conviction was upheld.[5] He was re-sentenced to life in prison without the possibility of parole on December 8, 2021.[6]\n\nEarly life and marriage [ edit ]\n\nScott Lee Peterson was born October 24, 1972, at Sharp Coronado Hospital in San Diego, California, to Lee Arthur Peterson, a businessman who owned a crate-packaging company, and Jacqueline \"Jackie\" Helen Latham,[7][8][9] who owned a boutique in La Jolla called The Put On.[7] Though Lee and Jackie had six children from previous relationships, Scott was their only child together.[8][9] As a child, Peterson shared a bedroom with his half-brother John in the family's two-bedroom apartment in La Jolla.[7] Peterson began playing golf at an early age, a result of time he spent with his father. By age 14, he could beat his father at the game. For a time, he had dreams of becoming a professional golfer like Phil Mickelson, his teammate at the University of San Diego High School.[8] By the end of high school, he was one of the top junior golfers in San Diego.[7]\n\nIn 1990, Peterson enrolled at Arizona State University (where Mickelson had also enrolled) on a partial golf scholarship.[10] Mickelson would go on to become a highly successful PGA golfer,[11] and Peterson's father, Lee, later testified that the considerable competition that Mickelson presented while they were at Arizona State discouraged Peterson. Randall Mell of the Broward County, Florida Sun-Sentinel reported that Chip Couch, the father of another young golfer, Chris Couch, who was visiting Arizona State on a recruiting trip, told Mell that he got Peterson kicked off the golf team. Couch stated that Peterson had taken Chris out drinking and to meet girls, resulting in a hangover for Chris. Because Chris was the No. 1 junior in the country, Chip did not want Peterson to threaten his son's future, and he complained to the golf coach, who kicked Peterson off the team. Peterson transferred to Cuesta College, in San Luis Obispo, and later to California Polytechnic State University.[12] He initially planned to major in international business, but changed his major to agricultural business. Professors who taught Peterson described him as a model student. His agribusiness professor Jim Ahern commented, \"I wouldn't mind having a class full of Scott Petersons.\"[7]\n\nWhile at California Polytechnic, Peterson worked at a restaurant in Morro Bay called the Pacific Café. One of his co-workers would receive visits from a neighbor named Laci Denise Rocha, who also attended Cal Poly[7][13] as an ornamental horticulture major.[7] When Peterson and his future wife first met at the restaurant in mid-1994, Laci made the first move, sending him her phone number. Immediately after meeting Peterson, Laci told her mother that she had met the man that she would marry. Peterson later called Laci and they began dating, their first date being a deep-sea fishing trip on which Laci got seasick.[13] As Peterson's relationship with Laci grew more serious, he put aside his dreams of professional golf in order to focus on a business career.[8] The couple dated for two years[13] and eventually moved in together.[7] In 1997, after Laci graduated, they married at Sycamore Mineral Springs Resort, in San Luis Obispo County's Avila Valley.[7][10] While Peterson finished his senior year, Laci took a job in nearby Prunedale. Prosecutors have stated that around this time, Peterson engaged in the first of at least two extramarital affairs, though they did not reveal names or details of these relationships. Peterson graduated with a Bachelor of Science degree in agricultural business in June 1998.[7]\n\nAfter their graduations, the Petersons opened a sports bar in San Luis Obispo called The Shack.[7][8][13] Contrary to a Los Angeles Times story that reported that Peterson's parents loaned him money to open the establishment,[8] his parents emphatically told the San Francisco Chronicle that they did not, believing that it was a bad investment. When the couple had difficulty finding a technician to install a needed vent in the restaurant, Peterson took the necessary certification course in Los Angeles in order to install it himself. Business was initially slow, but eventually improved, especially on weekends.[7] The Petersons decided to put The Shack up for sale when they moved to Laci's hometown of Modesto, California to start a family.[13][8] In October 2000, they purchased a three-bedroom, two-bath bungalow house for $177,000 on Covena Avenue in an upscale neighborhood near East La Loma Park.[7][8] They sold the Shack in April 2001.[14]\n\nLaci soon took a part-time job as a substitute teacher,[8] and Peterson got a job with Tradecorp U.S.A., a newly founded subsidiary of a European fertilizer company.[15] According to Lee Peterson, the Spanish company was trying to establish a customer base in the United States, and they hired Peterson as their West Coast representative. Working on salary plus commission, he sold irrigation systems, fertilizer, chemical nutrients, and related products to big farms and flower growers, primarily in California, Arizona, and New Mexico.[8] Peterson was earning a salary of $5,000 a month before taxes.[15] Laci's loved ones, including her mother and younger sister, stated that she worked enthusiastically at being the perfect housewife, enjoying cooking and entertaining, and that she and her family welcomed the news in 2002 that she was pregnant.[8] In November 2002, when Laci was seven months pregnant, Peterson was introduced by a friend to a Fresno massage therapist named Amber Frey. In later public statements, Frey said Peterson told her he was single, and the two began a romantic relationship. The last time Peterson's parents saw Laci was during a three-day weekend they spent together in Carmel, California the week before Christmas.[16]\n\nDisappearance of Laci Peterson [ edit ]\n\nOn December 23, 2002, at 5:45 pm, Peterson and Laci went to Salon—the workplace of Laci's sister Amy Rocha—for a monthly scheduled haircut.[17] As they spoke, Rocha said Peterson offered to pick up a fruit basket that she had ordered for her grandfather as a Christmas gift the next day because he would be playing golf at a course nearby. Prosecutors say Peterson also told other people he would be playing golf on the day of Christmas Eve.[17][18] Later that evening, Sharon Rocha, Laci's mother, spoke with Laci on the telephone around 8:30 pm.[19]\n\nPeterson later told police that he last saw his wife about 9:30 a.m. on December 24, 2002, when he left to go fishing at the Berkeley Marina. He said Laci was watching a cooking television show but was preparing to mop the floor, bake cookies, and walk the family dog to a nearby park.[20][21][22] Later that morning a female neighbor of the Petersons says she found the Petersons' dog, a Golden Retriever named McKenzie, and returned him to the Petersons' back yard between 10:10 and 10:17 a.m. About a half hour later, shortly after 10:45 am, another neighbor named Mike Chiavetta said he found McKenzie[23] wandering the neighborhood with a muddy leash, and also returned him to the Petersons' yard.[24] Peterson said he returned home that afternoon to find it empty.[20] Peterson found McKenzie in their back yard,[25] and Laci's 1996 Land Rover Discovery SE was in the driveway.[26] He showered and washed his clothes because he got wet from fishing.[20]\n\nAccording to ABC News, Peterson reported his wife Laci missing from their Modesto home.[27] However, the New York Post reported that when Laci still had not returned home by 5:15 p.m., Peterson called his mother-in-law, and that a half-hour later, Laci's stepfather, Ron Grantski, called the police.[20] The Modesto Bee also attributes the first call to police to Grantski.[28] Laci was seven-and-a-half months pregnant[27] with a due date of February 10, 2003. The couple had planned to name the baby boy Conner.[29][30] Laci was reported missing on Christmas Eve,[31][32] and the story attracted nationwide media interest.[33][34][35]\n\nModesto police detectives Jon Buehler and Allen Brocchini, the lead investigators on the case, responded to the call.[27] When they arrived at the Peterson home, Laci's keys, wallet and sunglasses were found in her purse in a closet.[20][36] The dining room table was meticulously set for a family dinner the following night. One of the two detectives found a phone book on a kitchen counter, opened to a full-page ad for a defense lawyer.[27]\n\nWhen the detectives questioned Peterson that evening,[27] they found him to be \"dead calm\", despite her family's distraught reaction to her disappearance.[20] According to TruTV, Bronchini found Peterson's nonchalant demeanor suspicious, describing it as \"a strange combination of polite and arrogant, disaffectedly distant and impatiently irritable. He just didn't seem like a man who was crushed or even greatly disturbed by his wife's disappearance and possible death.\"[37] Buehler told ABC News in 2017, \"I suspected Scott when I first met him. Didn't mean he did it, but I was a little bit thrown off by his calm, cool demeanor and his lack of questioning ... he wasn't, 'Will you call me back? Can I have one of your cards? What are you guys doing now?'\"[27]\n\nAlthough Peterson initially said he had spent the day golfing, he later told the police that he had gone to fish for sturgeon at the Berkeley Marina. At 2:15 p.m., he left a message for Laci, stating, \"Hey, Beautiful. It's 2:15. I'm leaving Berkeley.\"[20] Peterson stated that he went fishing about 90 miles from the couple's Modesto home. Detectives immediately launched a search.[27]\n\nAlthough inconsistencies in Peterson's statements led police to suspect foul play almost immediately,[38] they did not treat the case as suspicious within the first few hours after the missing persons report was filed.[39] During this initial period, Peterson's in-laws defended him and portrayed him and Laci as the ideal couple, and public perception of Peterson reflected this.[40] As police continued to investigate, they grew more suspicious of Peterson.[41]\n\nOn January 17, 2003, it became known that Peterson had engaged in two other extramarital affairs prior to an affair with a woman named Amber Frey.[41]\n\nAmber Frey approached the police about Peterson, who had denied to police that he was having an affair. She told detectives that she met Peterson on November 20, and that he had initially told her he was single. After they had begun dating, however, she came to suspect that he was married, and confronted him on December 9 about this. Frey said to Brocchini, \"He said he lost his wife, this would be the first holiday he was without his wife.\"[42]\n\nFrey allowed police detectives to secretly record her subsequent phone conversations with Peterson in the hopes of getting him to confess.[43] During the trial, the audio recordings of the couple's telephone conversations were played, and the transcripts were publicized. The recordings revealed that in the days after Laci went missing, Peterson told Frey that he had traveled to Paris to celebrate the holidays, in part with his new companions Pasqual and François. In reality, he had made one of these phone calls minutes before attending the New Year's Eve candlelight vigil for Laci in Modesto.[44]\n\nAt a January 24, 2003, press conference,[45] the Rocha family publicly withdrew their support of Peterson,[46] explaining that they did this upon learning of his affair with Frey,[47] in particular upon seeing photos of Peterson and Frey together.[48] A month after Laci's disappearance, her brother, Brent Rocha, stated at a press conference that although Peterson had admitted to him during a January 16, 2003, phone conversation that he had been having an affair with a woman from Fresno at the time, Peterson was now no longer communicating with the Rocha family.[46] They later said that they were angered not by the affair, but by the fact that Peterson had told Frey that he had \"lost his wife\" on December 9, 2002, 14 days before she disappeared,[20] and that he would be spending his first Christmas without her. Police later speculated whether this was an indication that Peterson had already decided to kill Laci,[49] which Sharon Rocha agreed was a possibility.[50]\n\nRecovery of Laci and Conner's remains [ edit ]\n\nOn April 13, 2003, a couple walking their dog found the decomposing body of a small baby, in a marshy area of the San Francisco Bay shore in Richmond's Point Isabel Regional Shoreline park, north of Berkeley.[51][52] Although a judge sealed autopsy results, an anonymous Associated Press source revealed that 1.5 loops of nylon tape were found around the fetus's neck and a significant cut was on the fetus's body.[53][54]\n\nOne day later, a passerby found the torso of a recently pregnant woman, wearing beige pants and a maternity bra, on the eastern shore of the bay,[52][18][55] along a rocky shoreline of the same park,[52] one mile away from where the baby's body was found.[52][55] The corpse was decomposed to the point of being almost unrecognizable as a human body since the head, arms, most of the legs and all the internal organs except for the uterus were missing.[53][56]\n\nOn April 18, 2003, the results of DNA tests verified that the bodies were Laci Peterson and her son,[52][57] who was to be named Conner.[53][58][59] The autopsy on both bodies was performed by forensic pathologist Dr. Brian Peterson (no relation).[59] Conner's skin was not decomposed at all, though the right side of his body was mutilated.[53] An April 24 ABC News report stated his umbilical cord was still attached,[60] and the San Francisco Chronicle reported that it appeared torn, rather than cut or clamped, as is the normal practice following birth.[56] However, ABC News later reported on May 30 that according to the autopsy, the placenta and umbilical cord were not found with the body.[53]\n\nThe exact date and cause of Laci's death were never determined. Her cervix was intact.[31][53][58] She had suffered two cracked ribs, but Dr. Peterson could not determine if this occurred before or after her death.[61] Laci's upper torso had been emptied of internal organs except for the uterus, which protected the fetus, explaining the lower level of decomposition it experienced.[56] Dr. Peterson concluded that the fetus had died in utero,[56] and determined he had been expelled from Laci's decaying body, though when cross-examined in court the following year, he conceded that he could not determine whether he had been born alive when this occurred.[59] Dr. Peterson also found meconium in the fetus's bowels, which is the first stool passed after birth.[56]\n\nThe discovery of the bodies created a greater sense of urgency for Brocchini and Buehler, who had put a tracker on Peterson's car. Knowing that he was in San Diego at the time, they feared he would escape across the border to Mexico. Brocchini commented in 2017, \"I just thought, 'We've got to find Scott right now. He told me he was there and that's where the bodies come up? I mean, I believe it was premeditated, he planned it ... San Diego was pretty darn close to the Mexican border. Scott knew the area pretty well. That's where his parents lived. That's where he lived. So it wasn't like he was going to have to get on MapQuest to try and figure out a way to get to Tijuana.\"[27]\n\nThe FBI and Modesto Police Department performed forensic searches of Peterson's home.[62] The FBI also conducted mitochondrial DNA testing on a hair from pliers found in Peterson's fishing boat that linked them with hairs recovered from Laci's hairbrush.[63] The authorities also searched Peterson's pickup truck, toolbox, warehouse, and boat.[64] After Peterson was arrested, police conducted further searches in the bay in an attempt to locate hand-made concrete anchors they believe weighed down Laci's body while it was under water. Nothing was found.[65]\n\nArrest [ edit ]\n\nPeterson was arrested on April 18, 2003,[66][67][68] near a La Jolla golf course.[69] He told police that he was meeting his father and brother for a game of golf.[70] His naturally dark brown hair had been dyed blonde,[71] and he had grown a mustache and goatee.[72] His Mercedes-Benz was \"overstuffed\" with miscellaneous items, including nearly $15,000 in cash, twelve Viagra tablets, survival gear,[73] camping equipment,[70][74] several changes of clothes, four cell phones,[74] and his brother's driver's license, in addition to his own.[71][74] Peterson's father explained that he used his brother's license the day before to get a San Diego resident discount at the golf course and that Peterson had been living out of his car because of the media attention.[74] However, police suspected these items were an indication that Peterson planned to flee to Mexico, an idea prosecutors would later concur with.[74][75]\n\nOn April 21, 2003, Peterson was arraigned before Judge Nancy Ashley in Stanislaus County Superior Court. He was charged with two felony counts of murder with premeditation and special circumstances: the first-degree murder of Laci and the second-degree murder of Conner. He pleaded not guilty,[2] and was held without bail.[76]\n\nTrial [ edit ]\n\nBefore his arraignment, Peterson had been represented by Kirk McAllister, a veteran criminal defense attorney from Modesto. Chief Deputy Public Defender Kent Faulkner was also assigned to the case. Peterson later indicated that he could afford a private attorney, namely Mark Geragos, who had done other high-profile criminal defense work.[77] On January 20, 2004, a judge changed the venue of the trial from Modesto to Redwood City, because Peterson was the victim of increasing hostility in the Modesto area.[78]\n\nPeterson's trial began on June 1, 2004,[2] and was followed closely by the news media. The lead prosecutor was Rick Distaso while Geragos led Peterson's defense. In opening statements, Geragos claimed Peterson was \"a cad\" for cheating on Laci but was not a murderer.[79]\n\nProsecution witness Frey hired her own attorney, Gloria Allred, to represent her. Allred was not bound by the gag order imposed on those involved in the trial. Although she maintained that her client had no opinion about whether Peterson was guilty, Allred was openly sympathetic to the prosecution. She appeared frequently on television news programs during the trial.[80][81]\n\nProsecutors claimed Peterson made cement anchors to weigh his wife's body down in San Francisco Bay, however none were found when the Bay was searched, even though sonar could locate small objects on the sea floor.[82] The defense questioned whether the investigation was thorough since Modesto police Detective Mike Hermos admitted he did not check the alibi of a prostitute who was accused of stealing checks from Peterson's mailbox but Hermos did not indicate that the woman was ever a suspect and prosecutor Dave Harris noted that the checks were stolen after Laci vanished, precluding the woman from involvement in her disappearance. A police community service officer testified that an interview with Peterson had no sound because no batteries had been placed in the tape recorder that was used to record it. Other detectives were called to testify about the extensive search for evidence.[83]\n\nPeterson's defense lawyers based their case on the lack of direct evidence and played down the significance of circumstantial evidence.[79] They suggested the fetal remains were of a full-term infant and theorized that someone kidnapped Laci, held her until she gave birth and then dumped both bodies in the bay. The prosecution's medical experts contended that the baby was not full-term and died at the same time as his mother.[84]\n\nJuror Frances Gorman was removed and replaced early in the trial due to misconduct. Jury foreman and attorney Gregory Jackson later requested his own removal during jury deliberations, most likely because his fellow jurors wanted to replace him as foreman.[85][86][87] Geragos told reporters that Jackson had mentioned threats he received when he requested to be removed from the jury.[88] Jackson was replaced by an alternate.[89]\n\nEvidence [ edit ]\n\nA single hair was the only piece of forensic evidence that was identified. The hair, matched through DNA comparison to hair from Laci's hairbrush, was stuck to pliers found on Peterson's boat.[90]\n\nPresented as prosecution evidence during the trial was the fact that Peterson changed his appearance and purchased a vehicle using his mother's name in order to avoid recognition by the press. He added two pornographic television channels to his cable service only days after his wife's disappearance.[91] The prosecution stated this meant he knew she would not be returning home. Peterson expressed interest in selling the house he had shared with Laci,[92] and traded in her Land Rover for a Dodge pick-up truck.[93]\n\nRick Cheng, a hydrologist with the United States Geological Survey and an expert witness on tides of the San Francisco Bay, testified as a witness for the prosecution. During cross-examination, Cheng admitted that his findings were \"probable, not precise.\"[94] Tidal systems are sufficiently chaotic, and he was unable to develop an exact model of the bodies' disposal and travel. As the trial progressed, the prosecution opened discussion of Peterson's affair with Frey and the contents of their secretly recorded telephone calls.[95]\n\nCharles March, a fertility specialist, was expected to be a crucial witness for the defense, one who, according to the San Francisco Chronicle, could single-handedly exonerate Peterson by showing that Laci's fetus died a week after prosecutors claimed. Under cross-examination, March admitted basing his findings on an anecdote from one of Laci's friends that she had taken a home pregnancy test on June 9, 2002. When prosecutors pointed out that no medical records relied on the June 9 date, March became flustered and confused on the stand and asked a prosecutor to cut him \"some slack\", undermining his credibility. Summing up this key defense witness, Stan Goldman, a criminal law professor at Loyola Law School in Los Angeles said, \"There were moments today that reminded me of Chernobyl.\"[96] According to one newspaper account about March's testimony, \"By the end of his testimony Thursday, legal analysts and jurors closed their notebooks, rolled their eyes and snickered when they thought no one was looking\".[97]\n\nMotive [ edit ]\n\nThe prosecution presented Peterson's affair with Frey, financial problems, and impending fatherhood as motives for the murder, surmising that he killed Laci due to increasing debt and a desire to be single again.[98][99]\n\nVerdict and sentencing [ edit ]\n\nOn November 12, 2004, the jury convicted Peterson of two counts of murder: first-degree murder with special circumstances for killing Laci, and second-degree murder for killing the fetus she carried.[2][100] The penalty phase of the trial began on November 30, and concluded December 13, when the jury rendered a sentence of death. On March 16, Judge Alfred A. Delucchi followed the jury verdict,[2] sentencing Peterson to death by lethal injection and ordering him to pay $10,000 toward the cost of Laci's funeral,[101][102][103] calling the murder of Laci \"cruel, uncaring, heartless, and callous\".[104]\n\nIn later press appearances, members of the jury stated that they believed Peterson's demeanor—specifically his lack of emotion and the phone calls to Frey in the days following Laci's disappearance—indicated his guilt. Juror No. 1, Greg Beratlis, and two other jurors, said they based their verdict on \"hundreds of small 'puzzle pieces' of circumstantial evidence that came out during the trial, from the location of Laci Peterson's body to the myriad lies her husband told after her disappearance.[105]\n\nOn October 21, 2005, a judge ruled that proceeds from a $250,000 life insurance policy Peterson took out on Laci would go to Laci's mother, which was reaffirmed by the Fifth District Court of Appeal on October 21, 2005. Peterson's automatic appeal was filed in the Supreme Court of California on July 5, 2012.[4][2]\n\nPeterson arrived at San Quentin State Prison in the early morning hours of Wednesday, March 17, 2005. He was reported not to have slept the night before, being too \"jazzed\" to sleep.[106][107] He joined the more than 700 other inmates in California's sole death row facility during the appeals process.[101][3]\n\nIn September 2006, former congressman William E. Dannemeyer sent a letter to the California Attorney General and other officials arguing that Laci Peterson had been killed by members of a Satanic cult, not by Peterson.[108][109]\n\nAppeal and death sentence overturn [ edit ]\n\nOn July 6, 2012, Peterson's attorney, Cliff Gardner, filed a 423-page appeal of Peterson's sentence, stated that the publicity surrounding the trial, incorrect evidentiary rulings, and other mistakes deprived Peterson of a fair trial.[110][111] The State Attorney General's office filed their response brief on January 26, 2015.[112] The defense filed a response to the State's brief in July 2015, claiming that a certified dog that detected Laci's scent at Berkeley Marina had failed two-thirds of tests with similar conditions.[113]\n\nIn November 2015, the defense filed a habeas corpus petition, claiming that a juror lied on her jury application, and that there was evidence that neighbors saw Laci alive after Scott left home.[114] On August 10, 2017, the State Attorney General responded to the appeal by filing a 150-page document contesting the notion disputing the claims put forward in the appeal, stating that the appeal ignored \"overwhelming evidence\" that Peterson murdered Laci. Supervising Deputy Attorney General Donna Provenzano stated that the timeline of the crime was established by the neighbor who found the Petersons' Golden Retriever, McKenzie, wandering in the street with its leash still attached, before the sightings of Laci and her dog. Provenzano also indicated, \"Purported sightings of Laci were legion,\" noting 74 reported sightings in 26 states and overseas, most of which she stated, were neither viable nor corroborated.[115]\n\nIn August 2018, the defense filed a reply, the sixth brief filed. The brief included six claims of \"deficient performance” by trial attorney Mark Geragos, such as failing to call experts in fetal growth, dog scent, how bodies move in water, stating that he would call witnesses but failing to follow through on this, and failing to properly address burglary evidence.[116]\n\nIn March 2019, California Governor Gavin Newsom issued a moratorium for all 737 prisoners on death row in California, including Peterson.[117] The order postponed all executions for the duration of Newsom's tenure as governor. California had not executed a prisoner since 2006[118] due to legal challenges to the state's execution protocol.[119] Newsom's order spares the approximately 25 prisoners on death row who had exhausted their legal appeals and could have had their executions move forward once the legal challenge was resolved. Peterson's sister-in-law Janey Peterson welcomed Newsom's decision but noted that his case was likely to be unaffected by it, and did not believe Peterson would exhaust all of his legal challenges by January 2027, when Newsom would be leaving office, assuming his re-election in 2022.[117]\n\nOn June 2, 2020, the California Supreme Court heard argument on Scott Peterson's appeal. The defense argued that prospective jurors were improperly excused; that the trial judge improperly allowed two jurors onto Peterson's boat; that the judge erred in insisting the prosecution be present during defense testing of the boat; and that the motion to move the trial to another county should have been granted due to juror questionnaire results showing almost half of the prospective jurors had already concluded Peterson was guilty prior to the trial. The prosecution countered that the California Supreme Court should overturn the verdict only if it were to find that a prospective juror was improperly dismissed, and that \"there was 'no credible claim' that any of the 12 jurors who decided Peterson’s fate were unfair or partial.\"[120]\n\nOn August 24, 2020, in a 7–0 decision, the Supreme Court of California upheld Peterson's conviction, but overturned his death sentence, because Peterson's trial judge,[5] Alfred Delucchi, who had died on February 26, 2008,[121] had dismissed jurors who opposed capital punishment without asking them whether they could put their views aside. Justice Leondra Kruger explained that per Supreme Court rulings since 1968, \"Jurors may not be excused merely for opposition to the death penalty, but only for views rendering them unable to fairly consider imposing that penalty in accordance with their oath. This is the meaning of the guarantee of an impartial jury.\"[5][122][123] Prosecutors initially stated that they would retry the penalty phase, but subsequently reversed that decision in June 2021.[124]\n\nOn September 22, 2021, California Superior Court Judge Anne-Christine Massullo ruled that Peterson would be re-sentenced to life in prison without the possibility of parole.[125] The following month, Massullo scheduled a hearing on that matter for December 8.[126][127] On December 8, Massullo re-sentenced Peterson to life in prison without the possibility of parole, for the first-degree murder of Laci, and a concurrent sentence of 15 years to life for the second-degree murder of Conner.[6][128]\n\nMedia [ edit ]\n\nDocumentary media about the case [ edit ]\n\nPortrayals of Scott Peterson [ edit ]\n\nFurther reading [ edit ]\n\nLee, Henry C.; Labriola, Jerry (2006). Dr. Henry Lee's Forensic Files: Five Famous Cases Scott Peterson, Elizabeth Smart, and more.. . Amherst, New York: Prometheus Books. ISBN 1-59102-409-9 .\n\nThomas, Donna (December 2007). I'm Sorry I Lied To You: The Confession of Scott Peterson (3rd ed.). Duj Pepperman Enterprises. ISBN 978-0978572884 .", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/1/19/Scott_Lee_Peterson_mugshot_2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Aerial_view_of_San_Quentin_State_Prison.jpg/220px-Aerial_view_of_San_Quentin_State_Prison.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Scott_Lee_Peterson_mugshot_2011.jpg/220px-Scott_Lee_Peterson_mugshot_2011.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/1/19/Scott_Lee_Peterson_mugshot_2011.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Scott_Peterson", "title": "Scott Peterson", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/1/19/Scott_Lee_Peterson_mugshot_2011.jpg", "width": 640, "height": 752}, "title": "Scott Peterson - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}