{"url": "https://wwd.com/eye/people/paris-jackson-stylist-sonia-young-10891301/", "text": "Los Angeles-based stylist Sonia Young is the woman helping 19-year-old Paris Jackson make her foray into the fashion world. Young first worked with Jackson at the InStyle and Warner Bros. Golden Globes after party in January — and has been crafting the teen’s attention-getting looks ever since.\n\nEarlier this month, it was reported that Jackson, the only daughter of late pop legend Michael Jackson, signed a six-figure deal with Calvin Klein. The brand has not yet confirmed a collaboration, the speculation sparked after Paris Jackson made her Met Gala debut wearing one of its designs. Young isn’t privy to the details surrounding Jackson’s rumored deal, but she does offer a tidbit: “Calvin Klein is someone who she will be wearing.”\n\nWWD caught up with Young about Jackson’s red-carpet style, fashion outlook and more:\n\nWWD: How did the InStyle collaboration with Paris come about?\n\nSonia Young: We got introduced through her publicist, Mark, who’s a good friend of mine. We met and we did her first outfit and it got tons of attention. It was her first big red carpet. When you meet someone for the first time, you have to gingerly walk around what they like, what they don’t, so it was a learning curve — as everything is. Her biggest thing is that she wanted to be comfortable and she wanted to wear something that she loved, so that’s how we picked the Tadashi dress. She liked the silhouette of it, she liked that it was sheer. It was a perfect first look for her and it really set the tone for what’s next.\n\nWWD: What’s your work relationship like?\n\n\n\nS.Y.: We bounce off of each other. I’ll come to her with something and she’ll be, like, “Absolutely not.” And then she’ll be, like, “What if we did this?” There’s a lot of “absolutely nots” on either side, but then we meet somewhere in the middle and we end up coming up with something that’s fantastic.\n\nWWD: This is the first year we’ve seen her come into her own. What’s your approach to crafting her entry into the limelight?\n\n\n\nS.Y.: The biggest thing with Paris is that she wants to use her platform for good. She wants to bring awareness to situations, so if we can do, say, the Alison Lou Planned Parenthood earring that she wears all the time or even something as simple as a peace sign on the back of her dress that she designed with Jeremy Scott. She always likes to be heard and we like to reflect that in her clothing.\n\nParis Jackson in Tadashi Shoji at the InStyle Golden Globes party. Kolasinski/BFA/REX/Shutterstock\n\nWWD: How would you describe her red carpet style?\n\n\n\nS.Y.: She’s a flower child. She’s a creature of comfort that wants to make a statement. She likes to wear stuff that reflects her personality, and she’s not gonna wear something that she doesn’t love.\n\nWWD: What about her casual style?\n\n\n\nS.Y.: She’s the most relatable girl of her generation. Who doesn’t go to Starbucks in their sweatpants and Uggs, you know? She’s so real. When she’s on the carpet, that’s work and she turns it on and she wears the glamorous stuff. But when she’s at home and she’s not working, she loves wearing her band Ts, her tie-dye, her Doc Martens. Uggs are a big staple in the wardrobe of Miss Paris.\n\nParis Jackson in Yanina Couture at the 2017 GLAAD Awards. Jim Smeal/BEI/Shutterstock\n\nWWD: Which designers does she gravitate toward?\n\n\n\nS.Y.: We don’t necessarily look at labels in our fittings. We go off of what she likes. It’s an eclectic mix. We’ll have up-and-coming designers, we’ll have really established fashion houses. We decide what feels right. For GLAAD, I never in a million years thought she would want to wear a ballgown with a rainbow on it, but it was appropriate for the occasion and she loved it. We’re not driven by the designer. We’re driven by what she wants.\n\nWWD: How do you see her style evolving?\n\n\n\nS.Y.: We have a cool relationship where we can find what is gonna be her style. She’s 19. I think it’s always gonna be evolving and I think fashion always is evolving. I don’t think we have a label where we want to go or what we want to achieve. I think we want to just stay true to who we are and keep creating beautiful looks and empowering young women and wearing great stuff.\n\nParis Jackson in Calvin Klein by Appointment Rob Latour/REX/Shutterstock\n\nMore from WWD.com:\n\nKeri Russell Loves Shopping While Lying in Bed\n\nMeet ‘Twin Peaks’ Arrival and David Lynch Recruit Amy Shiels\n\nCleo Wade, Herieth Paul on What It Takes To Be a Muse\n\nWhatever Happened to the Boys of No Doubt?", "images": ["https://wwd.com/wp-content/uploads/2017/05/rexfeatures_8770831vt.jpg?w=1000&h=563&crop=1", "https://www.facebook.com/tr?id=1378822052216463&ev=PageView&noscript=1", "https://wwd.com/wp-content/uploads/2017/05/rexfeatures_8770831vt.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-31f3D02tYU8zY.gif", "https://ct.pinterest.com/v3/?tid=2612680468235&pd[em]=&noscript=1", "https://wwd.com/wp-content/themes/vip/pmc-wwd-2021/assets/public/lazyload-fallback.gif", "https://dc.ads.linkedin.com/collect/?pid=609602&fmt=gif"], "top_img": "https://wwd.com/wp-content/uploads/2017/05/rexfeatures_8770831vt.jpg?w=1024", "keywords": [], "authors": ["Alexa Tietjen"], "canonical_link": "https://wwd.com/eye/people/paris-jackson-stylist-sonia-young-10891301/", "title": "Paris Jackson’s Stylist Opens Up About Crafting Her Entry Into the Limelight", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://wwd.com/wp-content/themes/vip/pmc-wwd-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://wwd.com/wp-content/uploads/2018/06/a9597fffaf6885dd6f870d1269ef3b72.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Stylist Sonia Young talks Paris Jackson's style, fashion outlook and more.", "fb": {"pages": 19457049254}, "news_keywords": "Celebrity Style, personal style", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "wwd", "pmc-page_type": "article", "articleid": 10891301, "author": "Alexa Tietjen", "pmc-category": "People", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-05-20T08:00:37"}, "pmc-tag": "Celebrity Style,personal style", "title": "Paris Jackson’s Stylist Opens Up About Crafting Her Entry Into the Limelight", "pageclass": "article", "pmc-vertical": "eye", "pmc-is_free": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-strategiccontent": "no"}, "generator": "WordPress 6.0.2", "author": "Alexa Tietjen", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "WWD", "application-name": "WWD", "content_type": "Article", "post_id": 10891301, "title": "Paris Jackson's Stylist Opens Up About Crafting Her Entry Into the Limelight", "published_at": "2017-05-20 08:00:37", "image": "https://wwd.com/wp-content/uploads/2017/05/rexfeatures_8770831vt.jpg?w=1024", "tags": "personal style", "topics": "People", "verticals": "Eye", "body": "Los Angeles-based stylist Sonia Young is the woman helping 19-year-old Paris Jackson make her foray into the fashion world. Young first worked with Jackson at the InStyle and Warner Bros. Golden Globes after party in January — and has been crafting the teen's attention-getting looks ever since.\r\n\r\nEarlier this month, it was reported that Jackson, the only daughter of late pop legend Michael Jackson, signed a six-figure deal with Calvin Klein. The brand has not yet confirmed a collaboration, the speculation sparked after Paris Jackson made her Met Gala debut wearing one of its designs. Young isn't privy to the details surrounding Jackson's rumored deal, but she does offer a tidbit: \"Calvin Klein is someone who she will be wearing.\"\r\n\r\nWWD caught up with Young about Jackson's red-carpet style, fashion outlook and more:\r\n\r\nWWD: How did the InStyle collaboration with Paris come about?\r\n\r\nSonia Young: We got introduced through her publicist, Mark, who’s a good friend of mine. We met and we did her first outfit and it got tons of attention. It was her first big red carpet. When you meet someone for the first time, you have to gingerly walk around what they like, what they don’t, so it was a learning curve — as everything is. Her biggest thing is that she wanted to be comfortable and she wanted to wear something that she loved, so that’s how we picked the Tadashi dress. She liked the silhouette of it, she liked that it was sheer. It was a perfect first look for her and it really set the tone for what’s next.\r\n\r\nWWD: What’s your work relationship like?\r\n\r\n\r\nS.Y.: We bounce off of each other. I’ll come to her with something and she’ll be, like, \"Absolutely not.\" And then she’ll be, like, \"What if we did this?\" There’s a lot of \"absolutely nots\" on either side, but then we meet somewhere in the middle and we end up coming up with something that’s fantastic.\r\n\r\nWWD: This is the first year we've seen her come into her own. What's your approach to crafting her entry into the limelight?\r\n\r\n\r\nS.Y.: The biggest thing with Paris is that she wants to use her platform for good. She wants to bring awareness to situations, so if we can do, say, the Alison Lou Planned Parenthood earring that she wears all the time or even something as simple as a peace sign on the back of her dress that she designed with Jeremy Scott. She always likes to be heard and we like to reflect that in her clothing.\r\n\r\n\r\n\r\nWWD: How would you describe her red carpet style?\r\n\r\n\r\nS.Y.: She’s a flower child. She’s a creature of comfort that wants to make a statement. She likes to wear stuff that reflects her personality, and she’s not gonna wear something that she doesn’t love.\r\n\r\nWWD: What about her casual style?\r\n\r\n\r\nS.Y.: She’s the most relatable girl of her generation. Who doesn’t go to Starbucks in their sweatpants and Uggs, you know? She’s so real. When she’s on the carpet, that’s work and she turns it on and she wears the glamorous stuff. But when she’s at home and she’s not working, she loves wearing her band Ts, her tie-dye, her Doc Martens. Uggs are a big staple in the wardrobe of Miss Paris.\r\n\r\n\r\n\r\nWWD: Which designers does she gravitate toward?\r\n\r\n\r\nS.Y.: We don’t necessarily look at labels in our fittings. We go off of what she likes. It’s an eclectic mix. We’ll have up-and-coming designers, we’ll have really established fashion houses. We decide what feels right. For GLAAD, I never in a million years thought she would want to wear a ballgown with a rainbow on it, but it was appropriate for the occasion and she loved it. We’re not driven by the designer. We’re driven by what she wants.\r\n\r\nWWD: How do you see her style evolving?\r\n\r\n\r\nS.Y.: We have a cool relationship where we can find what is gonna be her style. She’s 19. I think it’s always gonna be evolving and I think fashion always is evolving. I don’t think we have a label where we want to go or what we want to achieve. I think we want to just stay true to who we are and keep creating beautiful looks and empowering young women and wearing great stuff.\r\n\r\n\r\n\r\nMore from WWD.com:\r\n\r\nKeri Russell Loves Shopping While Lying in Bed\r\n\r\nMeet 'Twin Peaks' Arrival and David Lynch Recruit Amy Shiels\r\n\r\nCleo Wade, Herieth Paul on What It Takes To Be a Muse\r\n\r\nWhatever Happened to the Boys of No Doubt?", "fragment": "!", "og": {"type": "article", "title": "Paris Jackson’s Stylist Opens Up About Crafting Her Entry Into the Limelight", "url": "https://wwd.com/eye/people/paris-jackson-stylist-sonia-young-10891301/", "description": "Sonia Young talks Jackson’s whirlwind year of style, red carpet statements and Ugg boots at Starbucks.", "site_name": "WWD", "image": {"identifier": "https://wwd.com/wp-content/uploads/2017/05/rexfeatures_8770831vt.jpg?w=1024", "width": 1024, "height": 1536, "alt": "Paris JacksonThe Costume Institute Benefit celebrating the opening of Rei Kawakubo/Comme des Garcons: Art of the In-Between, Arrivals, The Metropolitan Museum of Art, New York, USA - 01 May 2017"}, "locale": "en_US"}, "article": {"published_time": "2017-05-20T12:00:37+00:00", "modified_time": "2017-05-20T12:00:38+00:00"}, "twitter": {"image": "https://wwd.com/wp-content/uploads/2017/05/rexfeatures_8770831vt.jpg?w=683", "site": "@wwd", "card": "summary_large_image", "title": "Paris Jackson’s Stylist Opens Up About Crafting Her Entry Into the Limelight", "description": "Stylist Sonia Young talks Paris Jackson's style, fashion outlook and more."}}, "movies": [], "publish_date": 1495281637.0, "source": "https://wwd.com", "summary": ""}