{"url": "https://www.independent.co.uk/arts-entertainment/films/oscars-2018-jennifer-lawrence-wine-leaping-chairs-academy-awards-ceremony-a8240261.html", "text": "Get our free weekly email for all the latest cinematic news from our film critic Clarisse Loughrey Get our The Life Cinematic email for free Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nThe Life Cinematic email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nJennifer Lawrence might not have been nominated for any Oscars this year but she still managed to attracted a share of the limelight at the 90th Academy Awards.\n\nThe 27-year-old actor, famed for tripping up at the Oscars, could be seen skilfully handling her glass of wine as she intrepidly bounded over chairs to rub shoulders with fellow Hollywood stars.\n\nLawrence, who was lauded on social media for the display of balance and dexterity, was spotted hiking up her gold gown and clambered over chairs to have a chat with Meryl Streep at the Dolby Theatre.\n\n✕ Oscars 2018: Jodie Foster and Jennifer Lawrence joke with Meryl Streep\n\nOscars 2018: Best-dressed on the red carpet Show all 26 1 /26 Oscars 2018: Best-dressed on the red carpet Oscars 2018: Best-dressed on the red carpet Saoirse Ronan Praised for her leading role in Lady Bird, the Irish actress sweetened the sartorial stakes in this candy-coloured gown by Calvin Klein. Rex Features Oscars 2018: Best-dressed on the red carpet Lupita Nyong'o and Danai Gurira The Black Panther stars dazzled in their respective gold and blush ensembles. Getty Images Oscars 2018: Best-dressed on the red carpet Sandra Bullock Stunning in lashings of sequins, the Academy Award-winning actress took to the red carpet in a halter-neck gown by Louis Vuitton. Getty Images Oscars 2018: Best-dressed on the red carpet Elizabeth Chambers and Armie Hammer The Call Me By Your Name star attended the ceremony in a crimson velvet tuxedo while his wife, American actress Elizabeth Chambers, opted for a slick, off-the-shoulder gown. Getty Images Oscars 2018: Best-dressed on the red carpet Meryl Streep She may not be the only lady in red at this year's ceremony, but with more Oscar nominations under her belt than any other Hollywood starlet, Streep certainly stands out in this elegant Dior gown. Getty Images Oscars 2018: Best-dressed on the red carpet Daniel Kaluuya The British actor added a touch of splendour to his Brunello Cucinelli tuxedo with a velvet jacket in a dusty mustard hue. Getty Images Oscars 2018: Best-dressed on the red carpet Nicole Kidman Few cut a razor-sharp silhouette on the red carpet like Nicole Kidman - and this Armani Privé gown is no exception. With its wide peplum waist and intricate-tailoring, the Australian actress makes a strong case for best-dressed guest at this year's awards. Getty Images Oscars 2018: Best-dressed on the red carpet Camila Alves, Matthew McConaughey and Timothée Chalamet The 22-year-old Call Me By Your Name actor posed alongside McConaughey and his model wife Alves, with all three coordinating in a triptych of monochromatic mastery. Getty Images Oscars 2018: Best-dressed on the red carpet Emma Stone She took home the coveted gong for best actress at last year's ceremony for her leading role in La La Land. This year, Emma Stone proved her red carpet style credentials yet again in a custom-made Louis Vuitton suit. Getty Images Oscars 2018: Best-dressed on the red carpet Emily Blunt The British actress chose a pale periwinkle couture gown by Schiaparelli complete with a ruffled Victorian neckline and a gently-pleated skirt. Getty Images Oscars 2018: Best-dressed on the red carpet Viola Davis At a first glance, Viola Davis' fluorescent fuchsia gown might have you seeing spots, but the Academy Award-winning actress somehow manages to pack a punch in pink while deterring any Barbie doll disaster comparisons in this Michael Kors gown. Rex Features Oscars 2018: Best-dressed on the red carpet Gal Gadot The Wonder Woman actress revolutionised Twenties glamour in this Givenchy Haute Couture flapper dress. Rex Features Oscars 2018: Best-dressed on the red carpet Margot Robbie The Australian actress looked like a Grecian goddess in this optic white Chanel haute couture gown. Getty Images Oscars 2018: Best-dressed on the red carpet Sally Hawkins Nominated for best actress for her role in Guillermo del Toro's The Shape of Water, the British actress cut a modest silhouette in this long-sleeved shimmering gown. Rex Features Oscars 2018: Best-dressed on the red carpet Jennifer Lawrence Staying true to her Dior loyalties, the Red Sparrow actress channelled metallic mastery in this spaghetti strap gown, hot from the luxury fashion house's pre-fall 2018 collection. Rex Features Oscars 2018: Best-dressed on the red carpet Jennifer Garner The American actress sashayed down the red carpet in this deep blue Atelier Versace gown complete with a dynamic neckline and a billowing train. Getty Images Oscars 2018: Best-dressed on the red carpet Greta Gerwig Taking to the red carpet in custom Rodarte complete with floral appliqué, the best director nominee complemented her golden gown with a slick of red lipstick and an understated chain necklace. Rex Features Oscars 2018: Best-dressed on the red carpet James Ivory The Call Me By Your Name screenwriter donned a custom-made shirt adorned with none other than Timothée Chalamet's face. Unsurprisingly, Ivory's outfit choice proved to be a social media hit amongst fans of the 22-year-old actor, who is nominated for best actor for his performance in the 89-year-old's film. Getty Images Oscars 2018: Best-dressed on the red carpet Gina Rodriguez The American actress was a vision in sparkles in this plunging chiffon gown from Zuhair Murad's spring 2018 couture collection. Getty Images Oscars 2018: Best-dressed on the red carpet Helen Mirren If anyone can elevate the grandeur of regal blue it's British treasure Helen Mirren, who took home an Oscar for her stellar performance in The Queen in 2007. Getty Images Oscars 2018: Best-dressed on the red carpet Laura Dern Complementing her lithe figure, the Big Little Lies star proved that white needn't be dull in this elegant column gown by Calvin Klein. Getty Images Oscars 2018: Best-dressed on the red carpet Salma Hayek A firm friend of Alessandro Michele, it simply wouldn't make sense if Hayek took to the red carpet in anything other than a custom-made Gucci gown, which in this instance comes complete with globular sequins and a tiered Mermaid-like skirt. Getty Images Oscars 2018: Best-dressed on the red carpet Elisabeth Moss Taking to the red carpet in pastel-perfect pink, the Handmaid's Tale star put a sophisticated spin on girlish glamour in this off-the-shoulder Dior gown. Rex Features Oscars 2018: Best-dressed on the red carpet Allison Janney The I,Tonya star opted for an eye-popping scarlet gown by Reem Acra paired with a Roger Vivier clutch. Getty Images Oscars 2018: Best-dressed on the red carpet Zoey Deutch Making her Oscars debut, the 23-year-old actress donned a couture lilac gown by Elie Saab featuring intricate beading detail. Getty Images Oscars 2018: Best-dressed on the red carpet Allison Williams The Get Out star radiated in a pearlescent Armani Privé couture gown, complete with an opulent jewelled bodice and a softly-pleated skirt that gently folded out onto the red carpet. Rex Features\n\nThe star made sure not to let go of her wine while doing so. This might not sound particularly noteworthy but it is something most Hollywood celebrities would not dream of doing.\n\nThe actor, who wore a gold sequined Dior dress, could later be seen flashing a mischievous grin as she talked to Salma Hayek and Woody Harrelson, while cradling her glass of white wine.\n\nThe antics, were hailed as “peak J Law” by Twitter users.\n\nIt is by no means the first time Lawrence has gained attention for her actions at the Oscars. In 2013 she tripped up while attempting to walk to the stage to collect Best Actress for her role in Silver Linings Playbook.\n\nLawrence, who has starred in X-Men and American Hustle, then tripped over a cone on the red carpet before she being helped up by a security guard the following year.\n\n“I did trip over a cone, I'm not safe,\" she said afterwards.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/05/03/gettyimages-927278296.jpg?quality=75&width=982&height=726&auto=webp", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/05/03/gettyimages-927278296.jpg?quality=75&width=1200&auto=webp"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/05/03/gettyimages-927278296.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Maya Oppenheim"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/films/oscars-2018-jennifer-lawrence-wine-leaping-chairs-academy-awards-ceremony-a8240261.html", "title": "Oscars 2018: Jennifer Lawrence lauded for juggling wine while leaping over chairs", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "'Jennifer Lawrence and her wine are coming for you'", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "Film", "sitename": "The Independent", "page path": "/arts-entertainment/films", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2018-03-05T13:00:48.000Z", "site_name": "The Independent", "title": "Jennifer Lawrence was an absolute icon at the Oscars", "url": "https://www.independent.co.uk/arts-entertainment/films/oscars-2018-jennifer-lawrence-wine-leaping-chairs-academy-awards-ceremony-a8240261.html", "type": "article", "description": "'Jennifer Lawrence and her wine are coming for you'", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/05/03/gettyimages-927278296.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/05/03/gettyimages-927278296.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2018-03-05T13:00:48.000Z", "modified_time": "2018-03-05T13:00:48.000Z", "section": "Culture", "subsection": "Film", "author_name": "Maya Oppenheim", "content_type": "story", "word_count": 294, "image_count": 1, "embed_count": 5, "video_count": 1, "internal_link_count": 1, "external_link_count": 0}, "date": "2018-03-05T13:00:48.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "vf": {"owner": "viafoura-id:11000177327066"}, "twitter": {"title": "Jennifer Lawrence was an absolute icon at the Oscars", "site": "@Independent", "card": "summary_large_image", "description": "'Jennifer Lawrence and her wine are coming for you'", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/05/03/gettyimages-927278296.jpg?quality=75&width=1200&auto=webp"}, "keywords": "Jennifer Lawrence,Oscars 2018,Internal"}, "movies": [], "publish_date": 1520254848.0, "source": "https://www.independent.co.uk", "summary": ""}