{"url": "http://www.clooneysopenhouse.com/t7848-amal-clooney-enjoys-dinner-date-in-italy-with-george-clooney-and-her-mom", "text": "[You must be registered and logged in to see this link.]\n\nSleepless nights, George? New dad Clooney cuts an exhausted figure as he joins radiant wife Amal and her mother for dinner in Lake Como... during first holiday with their newborn twins\n\nBy Julia Pritchard for MailOnline\n\nPUBLISHED: 18:06 BST, 8 August 2017 | UPDATED: 21:10 BST, 8 August 2017\n\nItaly last week for their first ever holiday with their newborn twins Ella and Alexander - who they welcomed in June.\n\n\n\nBut George and Amal Clooney took a night off their parenting duties on Tuesday, to instead enjoy dinner in Lake Como with Amal's mother Baria.\n\n\n\nThe barrister 39, looked truly radiant in a silk striped jumpsuit as she arrived at the swanky Gatto Nero restaurant hand-in-hand with her man, 56 - who cut an incredibly fatigued figure in comparison, as a new dad.\n\n[You must be registered and logged in to see this image.]\n\n\n\n\n\nThat's amore! Amal and George Clooney took a night off their parenting duties on Tuesday, to instead enjoy dinner in Lake Como, Italy\n\nThey jetted tolast week for their first ever holiday with their newborn twins Ella and Alexander - who they welcomed in June.Butandtook a night off their parenting duties on Tuesday, to instead enjoy dinner in Lake Como with Amal's mother Baria.The barrister 39, looked truly radiant in a silk striped jumpsuit as she arrived at the swanky Gatto Nero restaurant hand-in-hand with her man, 56 - who cut an incredibly fatigued figure in comparison, as a new dad.That's amore! Amal and George Clooney took a night off their parenting duties on Tuesday, to instead enjoy dinner in Lake Como, Italy\n\narenthood taking its toll? Glamorous Amal, 39, looked truly radiant in a silk striped jumpsuit, while George cut an incredibly fatigued figure in comparison, as a new dad (L)\n\nNew mother Amal looked truly stunning as she headed for dinner with her husband and mother in a slinky striped jumpsuit.\n\nPulling into a chic strapless neckline and cinching in at her waist, the one-piece served to accentuate her impressively slender frame just one month after giving birth.\n\nMaintaining her glamorous appearance from head to toe, the Lebanese beauty styled her hair into big, bouncy waves, and accessorised with striking fringed earrings.\n\n[You must be registered and logged in to see this image.]\n\n\n\n\n\nRadiant: New mother Amal looked truly stunning as she headed for dinner in a slinky striped jumpsuit, paired with glamorous fringe drop earrings and a purple lip Radiant: New mother Amal looked truly stunning as she headed for dinner in a slinky striped jumpsuit, paired with glamorous fringe drop earrings and a purple lip\n\nMeanwhile the handsome Hollywood actor kept things more casual in a simple yellow shirt and jeans as he led his wife home from dinner by the hand.\n\nHowever, the Ocean's Eleven star cut an exhausted figure as he swiftly returned to his home in the resort - showcasing signs of strain as a new dad in his 50s.\n\nSpending a night away from their twins, born in June, the pair were also accompanied by Amal's mother Baria - who proved style runs in their family in chic floral trousers and a lace blouse.\n\n\n\nHaving enjoyed a meal at the eatery, which is thought to be one of George's favourites, the group seemed keen to reunite with little Ella and Alexander as they swiftly got into their car.\n\n\n\n[You must be registered and logged in to see this image.]\n\n\n\n\n\nTired? However, the Ocean's Eleven star cut an exhausted figure as he swiftly returned to his home in the stunning Italian resort Tired? However, the Ocean's Eleven star cut an exhausted figure as he swiftly returned to his home in the stunning Italian resort\n\n[You must be registered and logged in to see this image.]\n\n\n\n\n\nWe are family: The pair were joined by Amal's mother Baria, as they spent a night out away from their two-month old twins Ella and Alexander We are family: The pair were joined by Amal's mother Baria, as they spent a night out away from their two-month old twins Ella and Alexander\n\nAmal and George landed in the stunning Italian hotspot last week with their newborn twins, who were born on June 6.\n\n\n\nThe trip marks their first ever family holiday, and the group have been spotted enjoying a number of dinners by the water.\n\nAmal's mother also joined them for the getaway - having recently gushed of her newborn grandchildren to People magazine.\n\nReflecting on the birth, she said excitedly: 'Seeing these two angels, these stunningly beautiful babies cuddled together...\n\n\n\n[You must be registered and logged in to see this image.]\n\n\n\nGood genes: Baria (above) proved style runs in their family in chic floral trousers and a lace blouse Good genes: Baria (above) proved style runs in their family in chic floral trousers and a lace blouse\n\n'And seeing the joy on Amal and George’s faces, it’s one of those deeply felt beautiful feelings you can’t express in words.'", "images": ["https://2img.net/u/2515/13/22/24/avatars/1360-91.jpg", "http://www.clooneysopenhouse.com/users/2515/13/22/24/smiles/735322.gif", "https://2img.net/u/2515/13/22/24/avatars/2-43.jpg", "https://2img.net/i/fa/empty.gif", "https://2img.net/u/2515/13/22/24/avatars/433-87.jpg", "https://i.servimg.com/u/f44/15/94/75/48/button36.jpg", "https://2img.net/u/2515/13/22/24/avatars/1633-45.jpg", "https://2img.net/u/2515/13/22/24/avatars/1112-12.jpg", "https://2img.net/i/fa/i/smiles/icon_biggrin.png", "https://2img.net/u/2515/13/22/24/avatars/280-2.jpg", "https://2img.net/i/empty.gif", "https://2img.net/i/fa/i/smiles/affraid.gif", "https://i.servimg.com/u/f44/15/94/75/48/button26.jpg", "https://i.servimg.com/u/f44/15/94/75/48/button29.jpg", "https://2img.net/u/2515/13/22/24/avatars/1224-70.jpg", "http://www.clooneysopenhouse.com/users/2515/13/22/24/smiles/189762.gif", "https://i.servimg.com/u/f44/15/94/75/48/button37.jpg", "https://i.servimg.com/u/f44/15/94/75/48/logo3s10.jpg", "http://www.clooneysopenhouse.com/users/2515/13/22/24/smiles/2050935144.gif", "https://2img.net/u/2515/13/22/24/avatars/601-98.jpg"], "top_img": "https://i.servimg.com/u/f44/15/94/75/48/logo3s10.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.clooneysopenhouse.com/t7848-amal-clooney-enjoys-dinner-date-in-italy-with-george-clooney-and-her-mom", "title": "Amal Clooney Enjoys Dinner Date in Italy With George Clooney and Her Mom", "meta_data": {"description": "I've no idea if that's from a few weeks ago or just recently. https://www.instagram.com/p/BXbTgyXhbSo/?tagged=georgeclooney", "og": {"title": "Amal Clooney Enjoys Dinner Date in Italy With George Clooney and Her Mom", "site_name": "www.clooneysopenhouse.com", "url": "https://www.clooneysopenhouse.com/t7848-amal-clooney-enjoys-dinner-date-in-italy-with-george-clooney-and-her-mom", "type": "article", "image": "https://i.servimg.com/u/f44/15/94/75/48/logo3s10.jpg", "description": "I've no idea if that's from a few weeks ago or just recently. https://www.instagram.com/p/BXbTgyXhbSo/?tagged=georgeclooney"}, "twitter": {"card": "summary", "site": "@clooneysopenhse", "title": "Amal Clooney Enjoys Dinner Date in Italy With George Clooney and Her Mom"}, "title": "Amal Clooney Enjoys Dinner Date in Italy With George Clooney and Her Mom", "dailymotion-domain-verification": "dmq4qfhiscot8ok5t"}, "movies": [], "publish_date": null, "source": "http://www.clooneysopenhouse.com", "summary": ""}