{"url": "https://www.hollywoodreporter.com/live-feed/greys-anatomy-adds-abigail-spencer-key-recasting-1026817", "text": "Grey’s Anatomy diehards, hold on to your scrubs.\n\nIn a key recasting, the ABC Shondaland drama has enlisted Timeless star Abigail Spencer to replace Bridget Regan and take on the role of Owen’s presumed-dead sister, Megan Hunt. Regan was unable to return to reprise the role due to scheduling. (She’s a series regular on TNT’s The Last Ship, starring Grey’s grad Eric Dane.)\n\nSpencer, who is slated to return to NBC’s Timeless for its 10-episode sophomore run next summer, will appear in a multiple-episode arc in the veteran medical drama’s upcoming 14th season.\n\nRegan originally guest-starred in a season 13 episode that included flashbacks as Owen’s (Kevin McKidd) younger sister. While serving in the Army, Megan was romantically paired with Owen’s best friend Nathan (Martin Henderson), and after learning he cheated on her, took off in a helicopter. She was presumed dead after the helicopter went missing. The season 13 finale revealed that Owen’s sister is indeed alive.\n\nMegan’s return sets the stage for an awkward love triangle in season 14, as Nathan and Meredith (Ellen Pompeo) finally took a major step forward in their burgeoning relationship.\n\nSpencer’s casting comes as Grey’s Anatomy is poised to further explore Owen’s and Amelia’s (Caterina Scorsone) dynamic, as the married couple spent the bulk of last season separated, as well as Owen’s relationship with Megan.\n\nIn addition to Spencer, former Grey’s Anatomy series regular Kim Raver is set to reprise her role as Dr. Teddy Altman, Owen’s former Army buddy, in season 14.\n\nSpencer’s credits include Rectify, Suits and Mad Men. She’s repped by WME, Untitled Entertainment and Hansen Jacobson.\n\nGrey’s Anatomy returns Sept. 28 at 8 p.m. with a two-hour season 14 premiere.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/08/gettyimages-819714530_0.jpg?w=1294&h=733&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/gettyimages-819714530_0.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/gettyimages-819714530_0.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/greys-anatomy-adds-abigail-spencer-key-recasting-1026817/", "title": "‘Grey’s Anatomy’ Adds Abigail Spencer in Key Recasting", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The 'Timeless' star will replace Bridget Regan and play Kevin McKidd's on-screen sister.", "news_keywords": "Abigail Spencer, Fall TV Preview, Grey's Anatomy", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1026817, "title": "'Grey's Anatomy' Adds Abigail Spencer in Key Recasting", "published_at": "2017-08-04 09:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/gettyimages-819714530_0.jpg?w=1024", "comment_count": 0, "tags": "Grey's Anatomy", "topics": "TV News", "body": "Grey's Anatomy diehards, hold on to your scrubs.\r\nIn a key recasting, the ABC Shondaland drama has enlisted Timeless star Abigail Spencer to replace Bridget Regan and take on the role of Owen's presumed-dead sister, Megan Hunt. Regan was unable to return to reprise the role due to scheduling. (She's a series regular on TNT's The Last Ship, starring Grey's grad Eric Dane.)\r\nSpencer, who is slated to return to NBC's Timeless for its 10-episode sophomore run next summer, will appear in a multiple-episode arc in the veteran medical drama's upcoming 14th season.\r\n\r\nRegan originally guest-starred in a season 13 episode that included flashbacks as Owen's (Kevin McKidd) younger sister. While serving in the Army, Megan was romantically paired with Owen's best friend Nathan (Martin Henderson), and after learning he cheated on her, took off in a helicopter. She was presumed dead after the helicopter went missing. The season 13 finale revealed that Owen's sister is indeed alive.\r\nMegan's return sets the stage for an awkward love triangle in season 14, as Nathan and Meredith (Ellen Pompeo) finally took a major step forward in their burgeoning relationship.\r\n\r\nSpencer's casting comes as Grey's Anatomy is poised to further explore Owen's and Amelia's (Caterina Scorsone) dynamic, as the married couple spent the bulk of last season separated, as well as Owen's relationship with Megan.\r\nIn addition to Spencer, former Grey's Anatomy series regular Kim Raver is set to reprise her role as Dr. Teddy Altman, Owen's former Army buddy, in season 14.\r\nSpencer's credits include Rectify, Suits and Mad Men. She's repped by WME, Untitled Entertainment and Hansen Jacobson.\r\nGrey's Anatomy returns Sept. 28 at 8 p.m. with a two-hour season 14 premiere.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Grey’s Anatomy’ Adds Abigail Spencer in Key Recasting", "url": "https://www.hollywoodreporter.com/tv/tv-news/greys-anatomy-adds-abigail-spencer-key-recasting-1026817/", "description": "The ‘Timeless’ star will replace Bridget Regan and play Kevin McKidd’s on-screen sister.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/gettyimages-819714530_0.jpg?w=1024", "width": 1024, "height": 580}, "locale": "en_US"}, "article": {"published_time": "2017-08-04T09:00:00+00:00", "modified_time": "2017-08-04T13:09:10+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Grey’s Anatomy’ Adds Abigail Spencer in Key Recasting", "description": "The ‘Timeless’ star will replace Bridget Regan and play Kevin McKidd’s on-screen sister.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/gettyimages-819714530_0.jpg?w=1294"}}, "movies": [], "publish_date": 1501837200.0, "source": "https://www.hollywoodreporter.com", "summary": ""}