{"url": "https://www.celebritynetworth.com/richest-businessmen/producers/brandon-blackstock-net-worth/", "text": "What is Brandon Blackstock's net worth?\n\nBrandon Blackstock is an American talent manager who has a net worth of $10 million. Blackstock is probably best-known for being married to singer Kelly Clarkson. They married in 2013 and had two children together. Brandon had two children from a previous relationship.\n\nEarly Life\n\nBrandon Blackstock was born in Fort Worth, Texas in December 1976. Brandon is the stepson of singer Reba McEntire and his father, Narvel Blackstock, is Clarkson's manager. Narvel was married to Reba for 26 years, from 1989 to 2015. Narvel and Reba had one child together. Soon after marrying, Narvel and Reba formed a corporation called Starstruck Entertainment that managed all aspects of Reba's career. When they divorced Narvel reportedly received a large percentage of Reba's wealth, which was considered communal property.\n\nBrandon Blackstock and Kelly Clarkson were engaged in 2012 and married in 2013. When they met, Blackstock was technically still married to Melissa Ashworth. Brandon and Melissa's divorce was finalized in 2012. Brandon and Melissa had two children together. Together, Kelly and Brandon have a daughter and a son together.\n\nReal Estate\n\nDuring their marriage Brandon and Kelly resided in an $8 million mansion in Encino, California. In June 2018, Kelly bought the 10,000-square-foot mansion in Encino, California that became the family's primary residence. They had previously been renting an LA home that had been burglarized a number of times. Kelly listed the Encino home for sale in May 2020 for a tad under $10 million. The price was reduced to $9 million and then finally $8.24 million when it finally sold in September 2021. Here's a video tour of that house:\n\nThey also owned a home in Nashville, Tennessee and a ranch in Montana. Kelly maintained ownership of the ranch after the divorce. Brandon was ultimately awarded a 5% stake. At the time of that 5% award, the ranch was valued at $17 million.\n\nDivorce\n\nKelly filed for divorce in June 2020. A few months earlier they put their Encino home on the market for $10 million. They have been trying to sell their Nashville property since 2018.\n\nIn early December 2020, Brandon filed paperwork in which he requested $436,000 PER MONTH in spousal support. He broke the request down as $135,000 in child support and $301,000 in spousal support. He also requested a one-time $2 million payment to cover legal expenses. Brandon also asserted that he wanted their two children to live with him in Montana.\n\nA few weeks later Kelly filed legal documents with the California Labor Commission in which she claimed Brandon defrauded her during the 13 years he served as her manager. She also asserted that Brandon was not licensed to operate as a talent agent – talent agents in California must be licensed. A spokesperson for Brandon's company, Starstruck Management Group, countered by pointing out that during that period Kelly was always properly represented by her separate talent agency CAA. Two months earlier Starstruck sued Kelly for $1.4 million in owed commissions.\n\nIn April 2021 a judge ordered Kelly to pay Brandon $195,000 per month in support. That was broken up as $150,000 in spousal support which will last for two years, and $45,000 per month in child support which will presumably last until their children turn 18. He was awarded $1.2 million for legal fees as a one-time payment.", "images": ["https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/wp-content/uploads/2015/03/bb.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2015/03/bb.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-businessmen/producers/brandon-blackstock-net-worth/", "title": "Brandon Blackstock Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Brandon Blackstock net worth: Brandon Blackstock is an American talent manager who has a net worth of $10 million. Blackstock is probably best-known for being married to singer", "cnw_share_fb_count": 64, "cnw_share_tw_count": 46, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Brandon Blackstock Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-businessmen/producers/brandon-blackstock-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2015/03/bb.jpg", "site_name": "Celebrity Net Worth", "description": "Brandon Blackstock net worth: Brandon Blackstock is an American talent manager who has a net worth of $10 million. Blackstock is probably best-known for being married to singer"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-01-24T18:51:03+00:00", "published_time": "2015-03-18T22:29:37+00:00", "section": "Producers", "tag": "brandon blackstock worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2015/03/bb.jpg", "title": "Brandon Blackstock Net Worth", "description": "Brandon Blackstock net worth: Brandon Blackstock is an American talent manager who has a net worth of $10 million. Blackstock is probably best-known for being married to singer"}}, "movies": ["https://player.vimeo.com/video/504589168?h=bd5ca0b7da&title=0&byline=0&portrait=0"], "publish_date": 1426717777.0, "source": "https://www.celebritynetworth.com", "summary": ""}