{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/10/08/jason-aldean-opens-snl-with-tribute-to-las-vegas-victims-we-hurt-with-you/", "text": "Gift Article Share\n\n“Saturday Night Live” didn’t begin how it normally does — with jokes at the president’s expense — but rather with an emotional tribute to those affected by the Las Vegas shooting massacre. Country singer Jason Aldean delivered a brief monologue on the SNL main stage, saying “I’m struggling to understand what happened that night” and that “so many people are hurting.” He then performed a rendition of the Tom Petty classic “I Won’t Back Down,” which also paid homage to Petty, who died Monday at 66.\n\nIt has been less than a week since 64-year-old Stephen Paddock fired upon the crowd at the Route 91 Harvest Festival in Las Vegas, several songs into Aldean’s closing set. Authorities said Paddock killed at least 58 people and left more than 500 injured, making the rampage the deadliest mass shooting in modern American history.\n\nAdvertisement\n\nThis is how Aldean began SNL on Saturday:\n\n“I’m Jason Aldean. This week, we witnessed one of the worst tragedies in American history. Like everyone, I’m struggling to understand what happened that night and how to pick up the pieces and start to heal. So many people are hurting. There are children, parents, brothers, sisters, friends — they’re all part of our family. So I want to say to them: We hurt for you and we hurt with you. But you can be sure we’re going to walk through these tough times together, every step of the way, because when America is at its best, our bond and our spirit, it’s unbreakable.”\n\nThe shooting renewed the debate over gun control, and one musician — lead guitarist of the Josh Abbott Band, Caleb Keeter — publicly reversed his position on the issue and called for greater gun control. His declaration was a rarity for country music, where it’s rare to make any remotely political statements (especially regarding guns given the community’s close ties to the National Rifle Association).\n\nIt’s not uncommon for SNL to go for an entirely seriously cold open following a national tragedy. Perhaps most memorably, SNL returned to air 18 days after the Sept. 11, 2001, attacks with then-New York Mayor Rudolph W. Giuliani delivering a speech while flanked by several first responders. Paul Simon performed “The Boxer.”\n\nAdvertisement\n\nGiuliani said it was important that SNL, as a New York institution, continue again to show the city “was open for business.” SNL executive producer Lorne Michaels then asked, “Can we be funny?”\n\n“Why start now?” Giuliani responded, getting big laughs from the audience.\n\nBut the most recent serious cold open came after the highly contentious 2016 presidential election, when Kate McKinnon as Hillary Clinton played the piano on the SNL main stage, singing Leonard Cohen’s “Hallelujah.”\n\nIt also served as partially a tribute to Cohen, who had just died.\n\nAfter the song, McKinnon’s Clinton, with tears in her eyes, simply said: ““I’m not giving up, and neither should you.” It was an opening that drew praise from those reeling from Clinton’s surprise defeat, and criticism from those who said the approach showed SNL had a clear bias and that it treated Trump’s triumph as a time to grieve.\n\nBut this week’s cold open avoided any hint of politics. It saved that for later in the show.\n\nRead more:\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2017/10/snl.png&w=1440"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2017/10/snl.png&w=1440", "keywords": [], "authors": ["Elahe Izadi"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/10/08/jason-aldean-opens-snl-with-tribute-to-las-vegas-victims-we-hurt-with-you/", "title": "Jason Aldean covers Tom Petty on SNL in an emotional tribute to Las Vegas victims", "meta_data": {"description": "\"Saturday Night Live\" began its first post-Las Vegas shooting episode with a serious cold open.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/10/08/jason-aldean-opens-snl-with-tribute-to-las-vegas-victims-we-hurt-with-you/", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2017/10/snl.png&w=1440", "title": "Jason Aldean covers Tom Petty on SNL in an emotional tribute to Las Vegas victims", "description": "\"Saturday Night Live\" began its first post-Las Vegas shooting episode with a serious cold open."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Jason Aldean covers Tom Petty on SNL in an emotional tribute to Las Vegas victims", "description": "\"Saturday Night Live\" began its first post-Las Vegas shooting episode with a serious cold open."}, "last_updated_date": "2021-12-03T05:55:13.443Z", "article": {"published_time": "2017-10-08T05:54:12.000Z", "modified_time": "2021-12-03T05:55:13.443Z", "section": "Arts & Entertainment", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 70, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/10/08/jason-aldean-opens-snl-with-tribute-to-las-vegas-victims-we-hurt-with-you/"}, "movies": [], "publish_date": 1507417200.0, "source": "https://www.washingtonpost.com", "summary": ""}