{"url": "https://www.billboard.com/articles/columns/hip-hop/8466927/dj-khaled-collaborators-future-drake-lil-wayne-list", "text": "DJ Khaled has evolved into one of the premier hitmakers in hip-hop, with a catalog of hits spanning more than a decade. Throughout that time period, the We the Best CEO has nurtured relationships with some of the most talented artists in the industry. Most don’t have any issue offering up their talents for a potential banger meticulously constructed by Khaled.\n\nExplore Explore DJ Khaled See latest videos, charts and news See latest videos, charts and news\n\nWith back-to-back albums topping the Billboard 200, the Miami native looks to make it three in a row with the anticipated Father of Asahd. On Monday (July 24), Khaled kicked off the rollout process into his eleventh studio album by announcing the project’s lead single “No Brainer” due out Friday (July 27).\n\nAfter 2017’s “I’m the One” debuted at No. 1 on the Billboard Hot 100, DJ Khaled has decided to go back to the well one more time with the same collaborators (sans Lil Wayne), with Quavo, Chance The Rapper, and Justin Bieber all re-enlisted to help execute the global smash formula.\n\nKhaled has connected with a range of hitmaking artists over the years, including Rihanna, Nas, Drake, Demi Lovato and many other. Below, Billboard lists ten of the king of Snapchat’s most frequent star collaborators throughout his decorated career.\n\nFuture\n\nNumber of Appearances: 15\n\nSongs: “I Can’t Lie,” “Do You Mind,” “I Got the Keys,” “Top Off,” “I Don’t Play About My Paper,” “Ice Out My Arms,” “I Wanna Be With You,” “Fuck Up the Club,” “Ima Be Alright,” “That Range Rover Came With Steps,” “Whatever,” “Hold You Down,” “Down For Life,” “You Mine,” “Bitches & Bottles”\n\nIf there’s one thing to take away from this list, it’s when Khaled gives the Freebandz CEO a call, he picks up the phone. Future is a lock to make multiple cameos in the studio whenever the 42-year-old is in album mode. The trap pioneer has made a career of crafting high-quality music at a blistering rate throughout the decade. “I Got the Keys” pitted the Atlanta native against JAY-Z, but their contrasting flows made for an enthralling joint effort, as Future held his own.\n\nRick Ross\n\nNumber of Appearances: 15\n\nSongs: “Do You Mind,” “I’m On One,” “No New Friends,” “All I Do Is Win,” “We Takin’ Over,” “Take It to the Head,” “Fuck Up the Club,” “Down For Life,” “Brown Paper Bag,” “Whatever,” “I’m So Hood,” “Welcome to My Hood (Remix),” “On Everything,” “Pull a Caper,” “Holla at Me”\n\nThe ongoing bromance between DJ Khaled and Rick Ross is real. The fellow Miami natives spend plenty of time together outside of music, as their houses are only a jet ski ride away. Rozay is a shoo-in to lay down a verse when Khaled is piecing together his next hit record. Ross appeared on 2007’s “We Takin’ Over” smash to four different tracks on the inspirational figure’s Grateful album a decade later.\n\nLil Wayne\n\nNumber of Appearances: 12\n\nSongs: “We Takin’ Over,” “I’m the One,” “I’m On One,” “Take It to the Head,” “Welcome to My Hood,” “I’m So Hood,” “No New Friends,” “Tourist,” “Brown Paper Bag,” “Bitches & Bottles,” “How Many Times,” “Holla at Me”\n\nLil Wayne has become a staple in the 305 music scene. If you frequent the LIV nightclub on a Sunday, there’s a good chance you’ll see Weezy sipping in VIP. Khaled actually met the New Orleans legend in his hometown and continued to build their relationship whenever Wayne was in Miami. He’s even hosted some of the rapper’s early mixtapes. Weezy’s appearance on “Holla at Me” alongside Paul Wall, Rick Ross, Fat Joe, and Pitbull powered the first single from Khaled’s debut album in 2006.\n\nOver a decade later, and the pair are still crafting hits together, as Lil Wayne joined Chance The Rapper, Quavo, and Justin Bieber on “I’m The One” which debuted at No. 1 on the Billboard Hot 100 last May. Weezy may be wondering where his call was to hop on “No Brainer.”\n\nMeek Mill\n\nNumber of Appearances: 9\n\nSongs: “They Don’t Love You No More,” “Never Surrender,” “I Lied,” “I Did It for My Dawgz,” “Murcielago,” “Future,” “Shout out to the Real,” “I Feel Like Pac/I Feel Like Biggie,” “You Don’t Want These Problems”\n\nAfter Meek Mill inked a deal under Rick Ross’ MMG label in 2011, Khaled quickly got familiar with the Philly street rapper and the two have connected on plenty of tracks throughout the better part of the decade. Meek laid the opening verse on I Changed A Lot‘s debut single “They Don’t Love You No More” in 2014, where JAY-Z controversially challenged the toughness of lacrosse players. DJ Khaled has said that he kept in touch with Meek during his incarceration and hopefully, another collaboration is on the horizon.\n\nChris Brown\n\nNumber of Appearances: 7\n\nSongs: “Do You Mind,” “How Many Times,” “Gold Slugs,” “Hold You Down,” “Take It to the Head,” “I’m Still,” “Legendary”\n\nWhenever Khaled is searching for a certain melodic chorus, there’s always one call he seems to make. Chris Brown has churned out dozens of tuneful guest hooks throughout his historic catalog. Breezy teamed up with Asahd’s father on numerous occasions this decade, including the Gold-certified “Take It to the Head” in 2012 by forming the Fab 5 alongside superstar collaborators Nicki Minaj, Rick Ross, and Lil Wayne.\n\nNicki Minaj\n\nNumber of Appearances: 6\n\nSongs: “Do You Mind,” “I Wanna Be With You,” “I Can’t Lie,” “Take It to the Head,” “Nobody,” “All I Do Is Win (Remix)”\n\nThe only female artist to grace the list is Nicki Minaj. As the First Lady of Young Money, Nicki was quickly introduced to Khaled through his developing rapport with her YM compatriots Lil Wayne and Drake. Back in 2013, Khaled oddly proposed to Minaj on MTV, which just ended up being a promotional stunt for his “I Wanna Be With You” single off his seventh studio album.\n\nDrake\n\nNumber of Appearances: 5\n\nSongs: “Fed Up,” “I’m on One,” “No New Friends,” “For Free,” “To the Max”\n\nDrizzy and DJ Khaled’s relationship spans back to when Drake appeared on “Fed Up” back in 2009, when he was just a burgeoning MC. Since that point, the star pair have successfully connected on a plethora of hits, including summer bangers “I’m On One” and the now-Platinum “For Free,” which dominated urban radio stations throughout the country and steered Khaled’s 2016 Major Key album. The pair most recently linked up to less FM fanfare with 2017’s “To the Max.”\n\nJAY-Z\n\nNumber of Appearances: 4\n\nSongs: “I Got the Keys,” “Shining,” “Top Off,” “They Don’t Love You No More”\n\nGrowing up, Khaled had dreams of one day working with JAY-Z. The Miami-bred DJ caught Hov’s eye to the point he even inked a management deal directly under Jay’s guidance with Roc Nation in 2016. Since then, Khaled has been blessed to work with the Brooklyn-bred MC on three additional occasions. He’s also slated to open for The Carters on the North American leg of their On The Run II Tour this summer.\n\nChance The Rapper\n\nNumber of Appearances: 3\n\nSongs: “I Love You So Much,” “I’m The One,” “No Brainer”\n\nThe 42-year-old has made a concerted effort to connect with the younger generation of stars in order to expand his diverse fan base. Chance The Rapper appeared on a pair of tracks from Khaled’s Grateful album, including his worldwide anthem “I’m the One,” which recently eclipsed the billion-view mark on YouTube.\n\nKanye West\n\nNumber of Appearances: 2\n\nSongs: “I Wish You Would,” “Go Hard”\n\nKanye West and T-Pain paired up for “Good Life” off West’s Graduation and the track went on to take home Best Rap Song at the 2008 Grammy Awards. DJ Khaled teamed the Godfathers of auto-tune together once again later that year on The Runners-produced “Go Hard.” Yeezy would then return the favor in 2012 by enlisting Khaled on his Cruel Summer album for the harrowing “Cold.”", "images": ["https://www.billboard.com/wp-content/uploads/media/DJ-Khaled-2017-bet-experience-billboard-1548.jpg?w=942&h=623&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif", "https://www.billboard.com/wp-content/uploads/media/DJ-Khaled-2017-bet-experience-billboard-1548.jpg?w=1024"], "top_img": "https://www.billboard.com/wp-content/uploads/media/DJ-Khaled-2017-bet-experience-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Michael Saponara"], "canonical_link": "https://www.billboard.com/music/rb-hip-hop/dj-khaled-collaborators-future-drake-lil-wayne-list-8466927/", "title": "From Future to Drake, Here’s a Look Back at DJ Khaled’s Most Frequent Star Collaborators", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "DJ Khaled has connected with a range of artists including Rihanna, Lil Wayne, Nas, Drake, Demi Lovato, and many others on a slew of hit records. With that said, 'Billboard' lists the king of Snapchat's most frequent collaborators throughout his decorated career.", "news_keywords": "bbfeature", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 8466927, "author": "Michael Saponara", "pmc-category": "Music,R&B/Hip-Hop", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-07-26T15:58:39"}, "pmc-tag": "bbfeature", "title": "From Future to Drake, Here’s a Look Back at DJ Khaled’s Most Frequent Star Collaborators", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Michael Saponara", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 8466927, "title": "From Future to Drake, Here's a Look Back at DJ Khaled's Most Frequent Star Collaborators", "published_at": "2018-07-26 15:58:39", "image": "https://www.billboard.com/wp-content/uploads/media/DJ-Khaled-2017-bet-experience-billboard-1548.jpg?w=1024", "comment_count": 0, "tags": "bbfeature", "topics": "R&B/Hip-Hop", "body": "DJ Khaled has evolved into one of the premier hitmakers in hip-hop, with a catalog of hits spanning more than a decade. Throughout that time period, the We the Best CEO has nurtured relationships with some of the most talented artists in the industry. Most don't have any issue offering up their talents for a potential banger meticulously constructed by Khaled. With back-to-back albums topping the Billboard 200, the Miami native looks to make it three in a row with the anticipated Father of Asahd. On Monday (July 24), Khaled kicked off the rollout process into his eleventh studio album by announcing the project's lead single \"No Brainer\" due out Friday (July 27). After 2017's \"I'm the One\" debuted at No. 1 on the Billboard Hot 100, DJ Khaled has decided to go back to the well one more time with the same collaborators (sans Lil Wayne), with Quavo, Chance The Rapper, and Justin Bieber all re-enlisted to help execute the global smash formula.Khaled has connected with a range of hitmaking artists over the years, including Rihanna, Nas, Drake, Demi Lovato and many other. Below, Billboard lists ten of the king of Snapchat's most frequent star collaborators throughout his decorated career.FutureNumber of Appearances: 15Songs: \"I Can't Lie,\" \"Do You Mind,\" \"I Got the Keys,\" \"Top Off,\" \"I Don't Play About My Paper,\" \"Ice Out My Arms,\" \"I Wanna Be With You,\" \"Fuck Up the Club,\" \"Ima Be Alright,\" \"That Range Rover Came With Steps,\" \"Whatever,\" \"Hold You Down,\" \"Down For Life,\" \"You Mine,\" \"Bitches & Bottles\"If there's one thing to take away from this list, it's when Khaled gives the Freebandz CEO a call, he picks up the phone. Future is a lock to make multiple cameos in the studio whenever the 42-year-old is in album mode. The trap pioneer has made a career of crafting high-quality music at a blistering rate throughout the decade. \"I Got the Keys\" pitted the Atlanta native against JAY-Z, but their contrasting flows made for an enthralling joint effort, as Future held his own. Rick RossNumber of Appearances: 15Songs: \"Do You Mind,\" \"I'm On One,\" \"No New Friends,\" \"All I Do Is Win,\" \"We Takin' Over,\" \"Take It to the Head,\" \"Fuck Up the Club,\" \"Down For Life,\" \"Brown Paper Bag,\" \"Whatever,\" \"I'm So Hood,\" \"Welcome to My Hood (Remix),\" \"On Everything,\" \"Pull a Caper,\" \"Holla at Me\"The ongoing bromance between DJ Khaled and Rick Ross is real. The fellow Miami natives spend plenty of time together outside of music, as their houses are only a jet ski ride away. Rozay is a shoo-in to lay down a verse when Khaled is piecing together his next hit record. Ross appeared on 2007's \"We Takin' Over\" smash to four different tracks on the inspirational figure's Grateful album a decade later. Lil WayneNumber of Appearances: 12Songs: \"We Takin' Over,\" \"I'm the One,\" \"I'm On One,\" \"Take It to the Head,\" \"Welcome to My Hood,\" \"I'm So Hood,\" \"No New Friends,\" \"Tourist,\" \"Brown Paper Bag,\" \"Bitches & Bottles,\" \"How Many Times,\" \"Holla at Me\"Lil Wayne has become a staple in the 305 music scene. If you frequent the LIV nightclub on a Sunday, there's a good chance you'll see Weezy sipping in VIP. Khaled actually met the New Orleans legend in his hometown and continued to build their relationship whenever Wayne was in Miami. He's even hosted some of the rapper's early mixtapes. Weezy's appearance on \"Holla at Me\" alongside Paul Wall, Rick Ross, Fat Joe, and Pitbull powered the first single from Khaled's debut album in 2006.Over a decade later, and the pair are still crafting hits together, as Lil Wayne joined Chance The Rapper, Quavo, and Justin Bieber on \"I'm The One\" which debuted at No. 1 on the Billboard Hot 100 last May. Weezy may be wondering where his call was to hop on \"No Brainer.\"Meek MillNumber of Appearances: 9 Songs: \"They Don't Love You No More,\" \"Never Surrender,\" \"I Lied,\" \"I Did It for My Dawgz,\" \"Murcielago,\" \"Future,\" \"Shout out to the Real,\" \"I Feel Like Pac/I Feel Like Biggie,\" \"You Don't Want These Problems\"After Meek Mill inked a deal under Rick Ross' MMG label in 2011, Khaled quickly got familiar with the Philly street rapper and the two have connected on plenty of tracks throughout the better part of the decade. Meek laid the opening verse on I Changed A Lot's debut single \"They Don't Love You No More\" in 2014, where JAY-Z controversially challenged the toughness of lacrosse players. DJ Khaled has said that he kept in touch with Meek during his incarceration and hopefully, another collaboration is on the horizon.Chris Brown Number of Appearances: 7Songs: \"Do You Mind,\" \"How Many Times,\" \"Gold Slugs,\" \"Hold You Down,\" \"Take It to the Head,\" \"I'm Still,\" \"Legendary\"Whenever Khaled is searching for a certain melodic chorus, there's always one call he seems to make. Chris Brown has churned out dozens of tuneful guest hooks throughout his historic catalog. Breezy teamed up with Asahd's father on numerous occasions this decade, including the Gold-certified \"Take It to the Head\" in 2012 by forming the Fab 5 alongside superstar collaborators Nicki Minaj, Rick Ross, and Lil Wayne.Nicki MinajNumber of Appearances: 6Songs: \"Do You Mind,\" \"I Wanna Be With You,\" \"I Can't Lie,\" \"Take It to the Head,\" \"Nobody,\" \"All I Do Is Win (Remix)\"The only female artist to grace the list is Nicki Minaj. As the First Lady of Young Money, Nicki was quickly introduced to Khaled through his developing rapport with her YM compatriots Lil Wayne and Drake. Back in 2013, Khaled oddly proposed to Minaj on MTV, which just ended up being a promotional stunt for his \"I Wanna Be With You\" single off his seventh studio album. DrakeNumber of Appearances: 5 Songs: \"Fed Up,\" \"I'm on One,\" \"No New Friends,\" \"For Free,\" \"To the Max\"Drizzy and DJ Khaled's relationship spans back to when Drake appeared on \"Fed Up\" back in 2009, when he was just a burgeoning MC. Since that point, the star pair have successfully connected on a plethora of hits, including summer bangers \"I'm On One\" and the now-Platinum \"For Free,\" which dominated urban radio stations throughout the country and steered Khaled's 2016 Major Key album. The pair most recently linked up to less FM fanfare with 2017's \"To the Max.\"JAY-ZNumber of Appearances: 4Songs: \"I Got the Keys,\" \"Shining,\" \"Top Off,\" \"They Don't Love You No More\"Growing up, Khaled had dreams of one day working with JAY-Z. The Miami-bred DJ caught Hov's eye to the point he even inked a management deal directly under Jay's guidance with Roc Nation in 2016. Since then, Khaled has been blessed to work with the Brooklyn-bred MC on three additional occasions. He's also slated to open for The Carters on the North American leg of their On The Run II Tour this summer.Chance The RapperNumber of Appearances: 3Songs: \"I Love You So Much,\" \"I'm The One,\" \"No Brainer\"The 42-year-old has made a concerted effort to connect with the younger generation of stars in order to expand his diverse fan base. Chance The Rapper appeared on a pair of tracks from Khaled's Grateful album, including his worldwide anthem \"I'm the One,\" which recently eclipsed the billion-view mark on YouTube.Kanye WestNumber of Appearances: 2Songs: \"I Wish You Would,\" \"Go Hard\"Kanye West and T-Pain paired up for \"Good Life\" off West's Graduation and the track went on to take home Best Rap Song at the 2008 Grammy Awards. DJ Khaled teamed the Godfathers of auto-tune together once again later that year on The Runners-produced \"Go Hard.\" Yeezy would then return the favor in 2012 by enlisting Khaled on his Cruel Summer album for the harrowing \"Cold.\"", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "From Future to Drake, Here’s a Look Back at DJ Khaled’s Most Frequent Star Collaborators", "url": "https://www.billboard.com/music/rb-hip-hop/dj-khaled-collaborators-future-drake-lil-wayne-list-8466927/", "description": "DJ Khaled has connected with a range of artists including Rihanna, Lil Wayne, Nas, Drake, Demi Lovato, and many others on a slew of hit records. With that said, ‘Billboard’ lists the ki…", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/DJ-Khaled-2017-bet-experience-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "DJ Khaled"}, "locale": "en_US"}, "article": {"published_time": "2018-07-26T19:58:39+00:00", "modified_time": "2018-07-26T19:58:39+00:00"}, "twitter": {"site": "@billboard", "creator": "@LordTreeSap", "card": "summary_large_image", "title": "From Future to Drake, Here’s a Look Back at DJ Khaled’s Most Frequent Star Collaborators", "description": "DJ Khaled has connected with a range of artists including Rihanna, Lil Wayne, Nas, Drake, Demi Lovato, and many others on a slew of hit records. With that said, 'Billboard' lists the king of Snapchat's most frequent collaborators throughout his decorated career.", "image": "https://www.billboard.com/wp-content/uploads/media/DJ-Khaled-2017-bet-experience-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1532635119.0, "source": "https://www.billboard.com", "summary": ""}