{"url": "https://web.archive.org/web/20180108074306/https://www.forbes.com/sites/maddieberg/2018/01/08/what-oprah-winfrey-the-star-of-the-golden-globes-had-to-say-backstage/", "text": "The real winner of the 2018 Golden Globes had nothing to do with the films or television series up for awards. Oprah Winfrey—the talkshow host, philanthropist, producer, actress and businesswoman—stole the show with a moving and cohesive speech that touched on everything from racial equality to press freedom to sexual harassment and brought tears to the star-filled audience.\n\nWinfrey—whose unsurpassable compassion and relatability has brought her both incredible fame and fortune—made the memorable speech as the first African American woman to ever accept the Cecil B. DeMille Award, honoring her contributions to the world of entertainment. (With a net worth of $2.8 billion, Winfrey is the only billionaire to have, herself, won an award, though Steven Spielberg, worth $3.6 billion, was nominated, and Jeff Bezos, worth $103 billion, was likely celebrating the many wins of Amazon Studio's The Marvelous Mrs. Maisel.)\n\nFollowing her acceptance, Winfrey headed backstage to answer questions posed by various members of the press. Her answers demonstrated the same balance of justifiable frustration and hope that her speech did and further addressed the Time's Up movement, while also turning to her personal journey—and, of course, including some of that Oprah Winfrey wisdom.\n\nWhat is the greatest lesson you’ve learned throughout your life and career?\n\n\"The greatest lesson I’ve learned throughout my career came from Maya Angelou actually. After I’d known her for a while, she said, ‘Baby, you know, you need to know that when people show you who they are, you believe them the first time. And your problem is that it takes you 29 times.' I that has been one of my greatest wisdom-teachings: to assess from people’s behavior—their actions not just towards me, but towards other people—who they are. I think in business and in personal relationships that’s been my greatest lesson. Also staying grounded has been really great for me.\"\n\nWhat humbles you right now?\n\n\"This humbles me! When they first called me and said they wanted me to accept this, I said, ‘I shouldn’t be the person to get the Cecil B. DeMille Award.’ You know why? I was working with Reese Witherspoon this past spring and winter, and I happened to say in the makeup room one morning, ‘How many movies have you done?’ She goes ‘Oh, honey child, I don’t know. It’s been so many.’ And I then thought, ‘I hope she doesn’t ask me, because I think it’s been five.’ So I didn’t understand [the award], and then they explained it’s about overall entertainment.\"\n\nWhat I was able to do with The Oprah Show and the cultural statement we were able to make throughout the world, I feel very, very, very proud of that. But I think that when it comes to films that I am really the new kid on the block. And I always feel that when I’m acting, I am out of my box, and it’s the most intimidated I ever feel.\"\n\nI’m curious what wisdom you can pass on to me and my friends? We are film school scholarship recipients of the Hollywood Foreign Press. What wisdom can you pass on to the future generation here in Hollywood that wants to make movies?\n\n\"The way to make movies is to do stuff that you love because for 25 years I worked on The Oprah Show, and, Stedman will tell you, there were nights I came home and it was hard to even take off my clothes because I knew I was going to be getting up four hours later. I felt exhausted, but I never really felt depleted.\n\nDo the work that comes straight from the soul of you—from your background, from stories that you’ve grown up with, from stories that bring you passion, from stories that you not just yearn to tell, but that if you don't tell them, they won’t get told.\n\nThe single greatest wisdom I think I’ve ever received—other than when people show you who you are—is that the key to fulfillment, success, happiness, contentment in life is when you align your personality with what your soul actually came to do. I believe everybody has a soul—has their own personal, spiritual energy—so when you can use your personality to serve whatever that thing is, you can’t help but be successful. So if you do films that come from the interior of your soul—you do work, you do art—that comes from the interior of you, you cannot miss.\n\nIt’s only when you’re doing stuff that you think may make money, you think may be a hit or you think may bring you some level of attention or success, that isn’t what does it. I would have to say that all of the great, wonderful experiences of my life that have brought me to this moment, have come from working from the interior of myself. And so that’s why it feels so authentic, because it actually is. So when you do that, you’ll win.\"\n\nWhat advice would you give to seven-year-old Oprah about being a woman surviving in this world?\n\n\"At seven, I was so sad. At seven, all of my real love came from my teachers. I would say this to anyone in this room: You have no idea the power of noticing another human being and what it feels like when someone knows they have been seen—truly seen—by you. It is the greatest offering you can give.\n\nAll those years at The Oprah Show, the greatest lesson I learned, was that after every show, someone would say, invariably, in one way or another, “How was that?” I’d finish an interview of a father who killed his twin daughters, I’d finish an interview with a politician—Barack Obama, Joe Biden, George Bush—or with Beyonce. They all say the same thing: ‘How was that?’\n\nSo I started to see that there is this common thread in our humanity where everyone wants to know 'How was that? Did I do okay? Did you hear me? Did what I say mean something to you?'\n\nSo I would say that recognizing that in other people has helped me be able to become a person of compassion, a person of understanding, a person who can interview anybody about anything, because I know that the core of you is the same as the core of me, you just want to be heard.\"\n\nLast year when Meryl Streep won this award, it was a very different time—Trump had just won, and since then we’ve had all of the allegations. With your speech, with everyone in solidarity in black tonight, do you feel that the country together as a whole is moving in a better direction that we moved last year?\n\n\"I always think and know—having watched it over the years, through thousands and thousands of interviews and watching people in their dysfunction—that when something really negative is brewing, that there is the direct opposite reaction that is also possible. For every action, there’s an equal and opposite reaction. So when something as big as what started to happen in October with Harvey Weinstein started to unfold, I though 'Woah, woah, woah.' And with every day’s revelation, I thought, here is an opportunity for a powerful growth, and how do we use this moment to elevate what is happening instead of continuing to victimize ourselves.\n\nSo I think that wearing black in solidarity is one step. I think what Time’s Up is doing with a legal defense fund is a major step. It was very important to all of us involved with Time’s Up that it not just be about the women of Hollywood, because we're already a privileged group, but to extend to the women of the world. As I said tonight, there isn’t a culture, a race, a religion, a politic, a workplace that hasn’t been affected by it. One of the reasons I wanted to tell Recy Taylor’s story is because it's been happening for a very long time—when people didn’t know that they could speak up. There are so many women who have endured so much and remained silent and kept going because there was no other recourse. And now that we've all joined as one voice, I think that it feels like empowerment to those women who have never had it.\"", "images": ["https://web.archive.org/web/20180108074306im_/https://specials-images.forbesimg.com/dam/imageserve/902386684/960x0.jpg?fit=scale", "https://web.archive.org/web/20180108074306im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F902386684%2F960x0.jpg%3Ffit%3Dscale", "https://web.archive.org/web/20180108074306im_/https://thumbor.forbes.com/thumbor/144x144/smart/https%3A%2F%2Fblogs-images.forbes.com%2Ffiles%2F2015%2F02%2Fmaddieberg_avatar_1425069302.jpg"], "top_img": "https://web.archive.org/web/20180108074306im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F902386684%2F960x0.jpg%3Ffit%3Dscale", "keywords": [], "authors": ["Madeline Berg"], "canonical_link": "https://web.archive.org/web/20180108074306/https://www.forbes.com/sites/maddieberg/2018/01/08/what-oprah-winfrey-the-star-of-the-golden-globes-had-to-say-backstage/", "title": "What Oprah Winfrey, The Star Of The Golden Globes, Had To Say Backstage", "meta_data": {"viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "What Oprah Winfrey, The Star Of The Golden Globes, Had To Say Backstage", "image": "https://web.archive.org/web/20180108074306im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F902386684%2F960x0.jpg%3Ffit%3Dscale", "updated_time": "2018-01-08T00:42:04-05:00", "url": "https://web.archive.org/web/20180108074306/https://www.forbes.com/sites/maddieberg/2018/01/08/what-oprah-winfrey-the-star-of-the-golden-globes-had-to-say-backstage/", "description": "After her powerful speech, the Cecil B. DeMille winner spoke to the press about being hopeful and staying humble—and included a Reese Witherspoon impression.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "What Oprah Winfrey, The Star Of The Golden Globes, Had To Say Backstage", "description": "After her powerful speech, the Cecil B. DeMille winner spoke to the press about being hopeful and staying humble—and included a Reese Witherspoon impression.", "image": "https://web.archive.org/web/20180108074306im_/https://thumbor.forbes.com/thumbor/600x300/smart/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F902386684%2F960x0.jpg%3Ffit%3Dscale", "creator": "@maddieberg"}, "description": "After her powerful speech, the Cecil B. DeMille winner spoke to the press about being hopeful and staying humble—and included a Reese Witherspoon impression.", "author": "Madeline Berg", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Madeline Berg", "section": "Business", "section_url": "https://www.forbes.com/business/", "id": "blogAndPostId/blog/post/3609-5208", "published": "2018-01-08", "modified": "2018-01-08"}}, "movies": [], "publish_date": 1515369600.0, "source": "https://web.archive.org", "summary": ""}