{"url": "www.usacarry.com/forums/politics-and-news/63339-chuck-schumer-s-steamy-affair-high-school-cheerleader-confirmed.html", "text": "UPDATE: Chuck Schumer’s Steamy Affair With A High School Cheerleader Confirmed\n\n.\n\nThe alleged affair between Democrat Senate Minority Leader Chuck Schumer and his daughter’s best friend from high school has been confirmed by the girl’s mother and by medical records obtained by subpoena from Planned Parenthood. The young girl, just 16-years-old when she was seduced by Schumer, committed suicide before her 20th birthday.\n\n.\n\nSchumer’s daughter, Lisa, first broke the story because she thought her dad was being a “hypocrite about the Roy Moore scandal.” Schumer has been one of the most vocal opponents of Judge Moore’s Senate run on the grounds of some fantasy tale told by a woman who we’re expected to believe can remember details from 1977 like it was yesterday, even though she managed to forget for 40 years.\n\n.\n\nWhat will end up being the nail in Schumer’s coffin is the report from Planned Parenthood showing that Schumer paid for not one but two abortions and was the “responsible party” who picked the girl up from the murder clinic when she was done. Schumer’s own wife, Kaitlyn, paid the girl’s mother nearly $2 million to go away. Until now, she was happy to stay in the shadows:\n\n.\n\n“Now that the story is public and my daughter isn’t the one who did wrong, I can finally grieve and she can finally rest.”\n\n.\n\nSchumer might want to consider paying her a little bit more money before she opens up completely. He is expected to resign over the allegations as soon as Congress returns from Christmas break.\n\n.\n\nRead More: Link Removed\n\n.\n\nMy Thoughts:\n\n.\n\nIsn’t it most of the time, when someone like Schumer always pointing out other people’s misdeeds is most likely guilty of the same act’s he’s calling out?", "images": ["http://www.usacarry.com/data/avatars/s/19/19160.jpg?1619532679", "http://www.usacarry.com/data/avatars/m/51/51316.jpg?1619533271", "https://www.usacarry.com/wp-content/uploads/2019/08/concealed-carry-1-1.png", "http://www.usacarry.com/data/avatars/m/50/50420.jpg?1619533262", "http://emoji.tapatalk-cdn.com/emoji351.png", "https://www.usacarry.com/wp-content/uploads/2019/08/favicon.ico", "http://www.usacarry.com/data/avatars/s/13/13497.jpg?1643352048", "http://www.usacarry.com/data/avatars/m/76/76241.jpg?1619533425"], "top_img": "https://www.usacarry.com/wp-content/uploads/2019/08/favicon.ico", "keywords": [], "authors": [], "canonical_link": "https://forums.usacarry.com/threads/chuck-schumers-steamy-affair-with-a-high-school-cheerleader-confirmed.63339/", "title": "Chuck Schumer’s Steamy Affair With A High School Cheerleader Confirmed", "meta_data": {"viewport": "width=device-width, initial-scale=1, viewport-fit=cover", "theme-color": "#ffffff", "apple-mobile-web-app-title": "USA Carry - Concealed Carry Forum", "description": "UPDATE: Chuck Schumer’s Steamy Affair With A High School Cheerleader Confirmed\n.\nThe alleged affair between Democrat Senate Minority Leader Chuck Schumer...", "og": {"description": "UPDATE: Chuck Schumer’s Steamy Affair With A High School Cheerleader Confirmed\n.\nThe alleged affair between Democrat Senate Minority Leader Chuck Schumer and his daughter’s best friend from high school has been confirmed by the girl’s mother and by medical records obtained by subpoena from...", "url": "https://forums.usacarry.com/threads/chuck-schumers-steamy-affair-with-a-high-school-cheerleader-confirmed.63339/", "site_name": "USA Carry - Concealed Carry Forum", "type": "website", "title": "Chuck Schumer’s Steamy Affair With A High School Cheerleader Confirmed"}, "twitter": {"description": "UPDATE: Chuck Schumer’s Steamy Affair With A High School Cheerleader Confirmed\n.\nThe alleged affair between Democrat Senate Minority Leader Chuck Schumer and his daughter’s best friend from high...", "title": "Chuck Schumer’s Steamy Affair With A High School Cheerleader Confirmed"}}, "movies": [], "publish_date": 1512971785.0, "source": "http://www.usacarry.com", "summary": ""}