{"url": "www.inquisitr.com/4378189/jennifer-garner-dating-chris-pine-after-affleck-divorce/", "text": "Has Jennifer Garner finally moved on from Ben Affleck? The actress is allegedly dating a new Hollywood heartthrob after Ben went public with his relationship with Lindsay Shookus.\n\nAccording to Hollywood Life, Jennifer Garner is reportedly dating Chris Pine. The couple are allegedly involved in a super-secret romance, and they're not ready to go public with the relationship just yet. A source reveals the pair have been secretly meeting up whenever their schedules will allow them to do so and that they're \"attraction\" to one another is \"growing.\"\n\nJennifer Garner and Chris Pine reportedly met each other at a charity event back in 2011. The couple allegedly got along great and bonded over their \"shared sense of humor.\" However, at the time of their meeting, Garner was still married to husband Ben Affleck.\n\nNow that Jennifer Garner and Ben Affleck's marriage is officially over, Jen's relationship with Chris Pine has blossomed. A mutual friend of the pair, who is said to have starred with Pine in the film This Means War, reportedly set the two up. The couple went on their first official date back in May at LA's Sunset Tower. An insider claims that Jennifer was very nervous, but Chris \"kept the mood light,\" which put the actress at ease. The two ended up having a \"wonderful\" time together.\n\nSince their first date, the couple have reportedly been spending time together by sneaking out for low-key dinner dates, hikes, and hanging out at his LA home. The insider adds that Chris Pine has been like a \"breathe of fresh air\" for Jennifer Garner following her rocky marriage to Ben Affleck. He reportedly makes her feel young and sexy again, and he's allegedly thrilled to have really connected with someone on a romantic level.\n\nHowever, Jennifer Garner is reportedly keeping things light with Chris Pine, and she's not taking the relationship too seriously just yet. Meanwhile, when Ben Affleck found out about the romance, he reportedly \"freaked out,\" but the two now have a mutual respect for one another's relationships.\n\nWhat are your thoughts on Jennifer Garner allegedly dating Chris Pine after her divorce with Ben Affleck?\n\n[Featured Image by Craig Barritt/Getty Images]", "images": ["https://secure.gravatar.com/avatar/5a1aab41ece6a274bcaecb11bc798ff5?s=800", "https://imgb.srgcdn.com/c2fbdf24-a0a4-40f9-ad23-b0cb57bf8766.jpg", "https://imgb.srgcdn.com/d258d2ec-e52b-4489-9950-908cc366bacf.jpg", "https://imgb.srgcdn.com/fe42e24b-1fa1-4cf2-b7ef-0bcd25a6f5c9.png", "https://imgb.srgcdn.com/1740626a-9ecf-4723-b66a-d7ca5e1d678c.jpg", "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "https://imgb.srgcdn.com/a5ba8e20-c5b5-4c82-ae2b-4f343261a07b.jpg", "https://imgb.srgcdn.com/6977b3f9-ffc5-44c5-866c-e80c13668077.jpg"], "top_img": "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.inquisitr.com/4378189/jennifer-garner-dating-chris-pine-after-affleck-divorce/", "title": "Jennifer Garner Dating Chris Pine After Ben Affleck Divorce?", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimal-ui, user-scalable=no", "msapplication-TileImage": "/static/inquisitr/favicon-128x128.png", "robots": "max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Jennifer Garner Dating Chris Pine After Ben Affleck Divorce?", "url": "https://www.inquisitr.com/4378189/jennifer-garner-dating-chris-pine-after-affleck-divorce/", "site_name": "The Inquisitr", "description": "Jennifer Garner Dating Chris Pine After Ben Affleck Divorce?", "updated_time": "2021-08-16 18:13:43Z"}, "article": {"modified_time": "2021-08-16 18:13:43Z", "published_time": "2017-07-19 14:03:02Z", "section": "Rumors"}, "description": "Jennifer Garner Dating Chris Pine After Ben Affleck Divorce?", "keywords": "Rumors", "twitter": {"card": "summary_large_image"}}, "movies": [], "publish_date": 1500472982.0, "source": "http://www.inquisitr.com", "summary": ""}