{"url": "https://en.wikipedia.org/wiki/Behati_Prinsloo", "text": "Namibian model (born 1988)\n\nBehati Prinsloo ( bee-ah-tee prin-sloo, Afrikaans: [ˈbɛɦati ˈprənsluə];[3] born 16 May 1988)[4][5][6] is a Namibian model. In 2008, she became a Pink contract model, and moved on to become a Victoria's Secret Angel in 2009.[7] She walked in ten Victoria's Secret Fashion Shows (2007–2015; 2018), and opened consecutive Victoria's Secret Fashion shows in 2014 and 2015.[8]\n\nEarly life [ edit ]\n\nPrinsloo was born in Grootfontein, Namibia, then part of South West Africa.[9][10] Her father was contracted to work in South Africa before she was born, but when she was three years old her family moved back to Namibia. She is the only child of father Boet Prinsloo, who is a church minister. Her mother, Magda (née Rossouw), runs a bed and breakfast.[11][12] Her family are Afrikaners and she grew up speaking Afrikaans as her native language, although she was later educated in English.[13] She attended Grootfontein Secondary School and left after Grade 9 to pursue modelling.[14]\n\nHer modelling career began when she was discovered while vacationing in Cape Town with her grandparents. \"We went to the grocery store after church and this guy came up to me and asked if I was a model and wrote his number on a piece of paper...\".[15]\n\nCareer [ edit ]\n\nPrinsloo debuted as a Prada[16]/Miu Miu Exclusive.[17] Soon after, Juergen Teller photographed her for her debut ad campaign, Marc by Marc Jacobs,[17] and she soon was photographed by Mario Testino and Paolo Roversi for British Vogue[18] and David Sims for W Magazine.\n\nPrinsloo has walked in fashion shows for Alexander Wang,[19] Louis Vuitton,[20] Miu Miu,[21] Versace,[22] Calvin Klein,[23] Givenchy,[23] Chanel,[24] Alexander McQueen,[25] Jil Sander,[26] Marc Jacobs,[27] Proenza Schouler,[28] Christian Dior,[29] Ralph Lauren,[30] Anna Sui,[31] Michael Kors,[32] and Yves Saint Laurent.[33]\n\nShe has been on the covers of Vogue Spain,[34] Vogue Turkey,[35] Vogue Brasil,[36] Vogue Mexico,[37] Vogue Russia,[38] Vogue Thailand,[39] Elle France,[40] Elle Spain,[41] Elle Italia,[42] Elle Sweden,[43] L'Officiel Netherlands,[44] Marie Claire Greece,[45] Marie Claire South Africa,[46] i-D Magazine,[47] V Magazine,[48] Russh Magazine,[49] 10 Magazine,[50] The Edit,[51] Jalouse,[52] and So It Goes Magazine.[53]\n\nHer ad campaigns include I Love Juicy Couture Fragrance,[54] I Am Juicy Couture Fragrance,[55] Juicy Couture Black Label,[56] Tommy Hilfiger,[57] Alexander Wang 'Do Something',[58] T by Alexander Wang,[59] Marc by Marc Jacobs,[17] H&M,[60] Nina Ricci,[61] The Gap,[62] Aquascutum,[63] M Missoni,[64] Sportmax,[65] DKNY Jeans,[66] Pepe Jeans,[67] Lancaster,[68] Stefanel,[69] Esprit,[70] Lacoste,[71] Desigual,[72] Seafolly,[73] Nine West,[74] and Raw Spirit Fragrance.[75]\n\nIn 2010, Prinsloo designed \"Behati Loves Pink\" swimsuit capsule collection for Victoria's Secret.[76] In 2014 she designed a line of denim for THVM.[77] Most recently she designed a fashion and accessories collection for Juicy Couture.[78] Models.com ranks Prinsloo on their lists of 'The Top Sexiest Models' as well as their list of 'The Money Girls'.[79]\n\nThe night before the 4 December 2012 airing of the annual Victoria's Secret Fashion Show, Prinsloo and fellow Victoria's Secret models Jacquelyn Jablonski and Jasmine Tookes guest starred on 3 December \"Ha'awe Make Loa\" episode of CBS' Hawaii Five-0 playing themselves.[80] In June 2014, Prinsloo made a cameo appearance in a preview of Missy Elliott protégée Sharaya J's \"Shut It Down\" via a T by Alexander Wang campaign.[81] Prinsloo appeared in various music videos such as The Virgins' \"Rich Girls\" and Maroon 5's \"Animals\", \"Lost\", and \"Girls Like You\".\n\nAfter taking a two-year hiatus from the Victoria's Secret Fashion show, Prinsloo returned to walk in the brand's 2018 show.[82]\n\nPrinsloo was among the models and celebrities who made appearances modeling lingerie at Rihanna's Savage x Fenty Vol. 3 fashion show in 2021.[83]\n\nPhilanthropy [ edit ]\n\nPrinsloo embarked on a charitable trip following the 2010 Haiti earthquake. Partnering with LakayPam, an organization dedicated to helping children in developing nations meet their basic needs, she collected and delivered hundreds of letters of hope from all over the world and helped raise funds.[84] She was accompanied by a cameraman and his friend, and the resulting short film, Letters to Haiti, debuted 7 December 2011 at Milk Gallery in New York.[85][84]\n\nShe also supports organizations trying to protect the black rhinoceros, a critically endangered species native to Namibia and other countries in Southern Africa.[citation needed]\n\nPersonal life [ edit ]\n\nArchitectural Digest magazine in 2021 Adam Levine and Prinsloo in their Los Angeles home, filmed bymagazine in 2021\n\nPrinsloo married Maroon 5 frontman Adam Levine in Mexico in 2014 after the pair had been in a relationship since 2012.[86] They have two daughters: Dusty Rose (born September 2016) and Gio Grace (born February 2018).[87] As of summer 2022, Prinsloo is pregnant with the couple's third child.[88]\n\nShe is close friends with fellow models Candice Swanepoel and Lily Aldridge.[89]\n\nPrinsloo appeared in the 2018 Maroon 5 video \"Girls Like You,\" along with husband Levine, their daughter Dusty Rose and more than two dozen women celebrities (including Jennifer Lopez, Mary J. Blige, Cardi B, Gal Gadot, Ellen DeGeneres, Tiffany Haddish, Lilly Singh and more).[90]\n\nIn 2021, Levine and Prinsloo founded Calirosa, a line of California red wine barrel-aged tequila.[91][92]\n\nFilmography [ edit ]\n\nMusic videos [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Adam_Levine_%26_Behati_Prinsloo_Vogue.jpg/220px-Adam_Levine_%26_Behati_Prinsloo_Vogue.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Africa_%28orthographic_projection%29.svg/28px-Africa_%28orthographic_projection%29.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Behati_Prinsloo_-_GEORGES_CHAKRA_2010_04.jpg/220px-Behati_Prinsloo_-_GEORGES_CHAKRA_2010_04.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/BathingSuit1920s.jpg/32px-BathingSuit1920s.jpg"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Behati_Prinsloo", "title": "Behati Prinsloo", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "Behati Prinsloo - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}