{"url": "http://remezcla.com/features/film/lowriders-director-ricardo-de-montreuil-on-subverting-cliches-in-his-new-east-la-set-drama/", "text": "When Peruvian filmmaker Ricardo de Montreuil (Máncora) moved to Los Angeles 12 years ago, he started hanging out with some of his friends in neighborhoods like Echo Park and Boyle Heights. It’s there where he discovered “all these amazing things on the East Side,” including the lowrider culture, and wondered “why Hollywood wasn’t telling stories from that side of town.”\n\nDe Montreuil attempts to do just that in his new film Lowriders, which follows the drama inside the Álvarez family – Miguel Álvarez (Demián Bichir), patriarch and owner of a lowrider custom car shop, and his two sons Danny (Gabriel Chavarria), an aspiring graffiti artist, and Ghost (Theo Rossi), an ex-con with a chip on his shoulder.\n\nThe film also stars Eva Longoria (Frontera) as Miguel’s second wife Gloria; Tony Revolori (The Grand Budapest Hotel) as Danny’s good friend Chuy; and Melissa Benoist (TV’s Supergirl) as Danny’s new girlfriend who urges him to take his art to the next level.\n\nDuring a recent interview with Remezcla, de Montreuil, whose first feature film was the 2005 drama La mujer de mi hermano (My Brother’s Wife), talked about traditions in the Latino culture, why he doesn’t think the film stereotypes Mexican-Americans, and the type of lowrider he would like to get behind the wheel of to do some cruising.\n\nLowriders opens in theaters on May 12.\n\nOn what attracted him to the script\n\nI would say it was [the theme of] generational class. Culturally, we’re living in a global world. It was interesting to me that when you’re young, you try to escape where you come from, but as you grow older, you realize the most valuable thing you have is your background and who you are. This movie explores that idea. It’s a universal story. I wanted to take the opportunity to take a picture of what East L.A. looks like. It’s a very animated and vibrant melting pot of art and Mexican American culture.\n\nOn his experience with lowrider culture in East LA\n\nI went to some of the lowrider galleries. I was curious. I was also invited to some of the lowrider events they had. So, I was already familiar with lowriding, but not to the extent I was when we started making the film. I discovered more of its origins and what it represents like family and tradition. It’s very much a part of the American culture. I feel like kids today are drawn to more of a global culture. We’re living in a very different time. I think it’s important not to forget where we come from and to keep those traditions.\n\nOn critics who say a film like Lowriders perpetuates Latino stereotypes\n\nI think creating lowriders is an artform. Lowriding in the film is used as a vehicle for Danny to connect to his culture. I don’t think we’re falling into any stereotypes. I think we’re showing a side of lowriding that people are not familiar with. It represents family and tradition and art. It’s an artform that was born in California. Lowriders is definitely a film that shows many faces of Latinos in Los Angeles. Not every Latino has the same story. The movie is a lot more complex than someone might think if they were just watching the trailer.\n\nDirector Ricardo de Montreuil on set of ‘Lowriders.’ Courtesy of BH Tilt Read more\n\nOn transcending what some might consider stereotypical roles\n\nI hope it shows a very different side of who Latinos are in Los Angeles and in the states. I hope it breaks some clichés. At the end, Mexican-Americans are Americans. We should never forget that.\n\nOn working with Oscar-nominated actor Demián Bichir\n\nIt was an amazing experience. Demián is an amazing actor. I think he is one of the best actors working today. We were certainly lucky to have him in the film. He’s one of those actors who makes every other actor better when they work with him. At the same time, he is a very generous actor. He cares about all the other actors. He really wanted us to make the best film we could. I think every actor was devoted to that.\n\nDemián Bichir and Eva Longoria in ‘Lowriders.’ Photo by Justin M Lubin. Courtesy of BH Tilt Read more\n\nOn casting Eva Longoria in her role\n\nWe wanted actors who were part of the culture and who were already familiar with lowriding. I knew Eva and had met with her for other films before. When we started developing the film, the only person I could think of for the role was Eva. I knew her outside of her public persona. She really wanted to play a character that wasn’t a stereotype. She wanted to play a character who was a complex human. She is a very smart woman and very passionate about politics. She has this maternal quality, which was very important for her character to have. Her character is the person that grounds the family and keeps it together.\n\nOn which lowrider he would like to own and cruise around in\n\n(Laughs) An impala. I’m not that well versed, so I couldn’t tell you exactly what year, but an impala is a classic. Those are the cars that I really love in the film. They’re fascinating. You could never imagine a car could look like that. I think lowriders should be considered part of the American artform just like jazz and rock ’n’ roll.", "images": ["https://remezcla.com/wp-content/themes/remezcla/public/img/facebook.svg", "https://remezcla.com/wp-content/themes/remezcla/public/img/twitter.svg", "https://remezcla.com///wp-content/uploads/2017/05/Photo-3.png", "http://pixel.quantserve.com/pixel/p-4j1ATWQxNAWFa.gif", "https://remezcla.com/wp-content/themes/remezcla/public/img/search.svg", "https://www.facebook.com/tr?id=847969198903107&ev=PageView&noscript=1", "https://res.cloudinary.com/remezcla/images/f_auto,q_auto/v1663177493/production/DSCF0467/DSCF0467.jpg?_i=AA", "https://res.cloudinary.com/remezcla/images/f_auto,q_auto/v1664838500/production/Ritz-Savoy-Roots-159/Ritz-Savoy-Roots-159.jpg?_i=AA", "http://b.scorecardresearch.com/p?c1=2&c2=17229175&cv=2.0&cj=1", "https://remezcla.com/wp-content/uploads/2017/05/Photo-6.png", "https://res.cloudinary.com/remezcla/images/f_auto,q_auto/v1664468306/production/header-tropicalia/header-tropicalia.jpg?_i=AA", "https://remezcla.com/wp-content/themes/remezcla/public/img/close-x.svg", "https://remezcla.com///wp-content/uploads/2017/05/Lowriders-Photo-5.png", "https://res.cloudinary.com/remezcla/images/f_auto,q_auto/v1663876628/production/Divino-Niño-by-Matt-Allen-2/Divino-Niño-by-Matt-Allen-2.jpeg?_i=AA", "https://res.cloudinary.com/remezcla/images/f_auto,q_auto/v1662062968/production/NR-001/NR-001.jpg?_i=AA", "https://remezcla.com/wp-content/themes/remezcla/public/img/instagram.svg"], "top_img": "https://remezcla.com/wp-content/uploads/2017/05/Photo-6.png", "keywords": [], "authors": ["Kiko Martinez", "Michael Butler"], "canonical_link": "https://remezcla.com/features/film/lowriders-director-ricardo-de-montreuil-on-subverting-cliches-in-his-new-east-la-set-drama/", "title": "'Lowriders' Director Ricardo de Montreuil On Subverting Clichés", "meta_data": {"description": "We talked to Ricardo de Montreuil about why he doesn’t think 'Lowriders' stereotypes Mexican-Americans and the type of lowrider he'd like to cruise in.", "amp-experiments-opt-in": "amp-next-page", "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Ricardo de Montreuil On How His Film Explores a Side of Lowriding We Haven't Seen Before", "description": "We talked to Ricardo de Montreuil about why he doesn’t think 'Lowriders' stereotypes Mexican-Americans and the type of lowrider he'd like to cruise in.", "url": "https://remezcla.com/features/film/lowriders-director-ricardo-de-montreuil-on-subverting-cliches-in-his-new-east-la-set-drama/", "site_name": "Remezcla", "image": {"identifier": "https://remezcla.com/wp-content/uploads/2017/05/Photo-6-1024x683.png", "width": 1024, "height": 683, "type": "image/png"}}, "article": {"publisher": "http://facebook.com/remezcla", "modified_time": "2017-05-09T17:27:33+00:00", "opinion": "false", "content_tier": "free"}, "twitter": {"card": "summary_large_image", "title": "'Lowriders' Director Ricardo de Montreuil On Subverting Clichés", "description": "We talked to Ricardo de Montreuil about why he doesn’t think the film stereotypes Mexican-Americans.", "site": "@remezcla", "label1": "Est. reading time", "data1": "5 minutes"}, "news_keywords": "interview, lowriders, ricardo de montreuil, latino, entertainment, latina, arts, movies, music, tv, celebrities, lifestyle, culture, sports, food, politics, soccer, baseball, basketball, nfl, internet, world news, wierd news", "original-source": "https://remezcla.com/features/film/lowriders-director-ricardo-de-montreuil-on-subverting-cliches-in-his-new-east-la-set-drama/", "generator": "WordPress 6.0.2", "fb": {"pages": 119685104266}, "msapplication-TileImage": "https://remezcla.com/wp-content/uploads/2020/10/cropped-favicon-re-300x300.png"}, "movies": ["https://www.youtube.com/embed/6k0mm_cxzy0?feature=oembed"], "publish_date": null, "source": "http://remezcla.com", "summary": ""}