{"url": "https://www.hollywoodreporter.com/live-feed/dick-wolf-discusses-agenda-behind-law-order-true-crime-menendez-murders-1026527", "text": "The first edition of the anthology series reunites Dick Wolf with Emmy winner Edie Falco, who previously guest-starred on several episodes of Law and Order as a defense attorney before her star-making turn on The Sopranos, and with longtime Law and Order exec producer Rene Balcer, who serves as showrunner on the new drama.\n\nDick Wolf has been producing various installments of Law & Order since 1990. However, the prolific producer insists the latest extension of the popular franchise, Law & Order True Crime: The Menendez Murders, will instantly set itself apart from the many iterations that came before it.\n\n“This is a show that has an agenda,” Wolf told reporters Thursday at the Television Critics Association summer press tour. “Your mind is going to receive information that I think will change a lot of people’s attitudes.”\n\nThe eight-episode first installment of the anthology is described as a “gripping, in-depth dramatization” of the famed murder case that took America by storm in the early 1990s. When brothers Lyle and Erik Menendez were tried on national TV for brutally killing their parents in Beverly Hills on Aug. 20, 1989, their story became a nationwide obsession. Law & Order True Crime: The Menendez Murders dives into the players, the crime and the media circus, detailing the day-to-day battles of the trial and unveiling the shocking truth of what really went down behind the scenes.\n\nWhile Wolf had previously used the famed Menendez case as inspiration for self-contained episodes of Law & Order, Wolf admitted he was initially hesitant about whether there was enough material to make a “compelling” series. However, Law & Order vet Rene Balcer serves as showrunner and did extensive research that eased Wolf’s mind.\n\n“The research revealed things none of us knew, and that’s one of the things that I think is most impactful about the eight hours,” Wolf said.\n\nIn addition to focusing on the molestation both boys alleged they suffered at the hands of their mother and father — one incident Balcer said occurred two weeks before the murders — the first season of the anthology will also examine the politics that played a role in the case and their sentencing. “The other part of the story that is probably not well known is the degree of political collusion between the judge and the district attorney’s office in the second trial to ensure a conviction,” Balcer said. “That’s one new facet to the case that the series sort of highlights.”\n\nWolf is confident these new details, joined by a cast led by four-time Emmy winner Edie Falco as the Menendez brothers’ defense attorney, will keep viewers coming back despite viewers already knowing the outcome.\n\n“I think anybody who watches the first episode is going to be there every week because there is new information,” Wolf said. “When you see the information, I think people are going to realize, ‘Yeah, they did it,’ but it wasn’t first-degree murder without possibility of parole.” Wolf said he believed that the brothers should instead have been convicted of first-degree manslaughter.\n\nAdded Wolf: “After 27 years of Law & Orders, this is taken from the headlines. We’ve made some great shows ripped from the headlines. This is on a different level.”\n\nAfter the panel in a scrum with reporters, Wolf said that “there are discussions” about future iterations. “Look, this is endless if you get the right case,” he said. “You just think of [Timothy] McVeigh in Oklahoma City, Richard Ramirez, Son of Sam — there are a lot of things that I would like to examine for a full eight hours.”\n\nLaw & Order True Crime: The Menendez Murders premieres Sept. 26 on NBC.\n\nWatch the latest trailer for the series.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/05/LAWORDERTRUECRIMETHEMENENDEZMURDERS_Still2.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/LAWORDERTRUECRIMETHEMENENDEZMURDERS_Still2.jpg?w=1296&h=730&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/LAWORDERTRUECRIMETHEMENENDEZMURDERS_Still2.jpg?w=1024", "keywords": [], "authors": ["Kate Stanhope"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/dick-wolf-discusses-agenda-behind-law-order-true-crime-menendez-murders-1026527/", "title": "Dick Wolf Discusses “Agenda” Behind ‘Law and Order True Crime: The Menendez Murders’", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Fellow EP Rene Balcer also discussed the new information that will be highlighted in the eight-episode drama.", "news_keywords": "Dick Wolf, Law & Order True Crime: The Menendez Murders, TCA 2017, The Menendez Murders", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Kate Stanhope", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1026527, "title": "Dick Wolf Discusses \"Agenda\" Behind 'Law and Order True Crime: The Menendez Murders'", "published_at": "2017-08-03 10:51:17", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/LAWORDERTRUECRIMETHEMENENDEZMURDERS_Still2.jpg?w=1024", "comment_count": 0, "tags": "The Menendez Murders", "topics": "TV News", "body": "Dick Wolf has been producing various installments of Law & Order since 1990. However, the prolific producer insists the latest extension of the popular franchise, Law & Order True Crime: The Menendez Murders, will instantly set itself apart from the many iterations that came before it.\r\n\"This is a show that has an agenda,\" Wolf told reporters Thursday at the Television Critics Association summer press tour. \"Your mind is going to receive information that I think will change a lot of people's attitudes.\"\r\nThe eight-episode first installment of the anthology is described as a \"gripping, in-depth dramatization\" of the famed murder case that took America by storm in the early 1990s. When brothers Lyle and Erik Menendez were tried on national TV for brutally killing their parents in Beverly Hills on Aug. 20, 1989, their story became a nationwide obsession. Law & Order True Crime: The Menendez Murders dives into the players, the crime and the media circus, detailing the day-to-day battles of the trial and unveiling the shocking truth of what really went down behind the scenes.\r\n\r\nWhile Wolf had previously used the famed Menendez case as inspiration for self-contained episodes of Law & Order, Wolf admitted he was initially hesitant about whether there was enough material to make a \"compelling\" series. However, Law & Order vet Rene Balcer serves as showrunner and did extensive research that eased Wolf's mind.\r\n\"The research revealed things none of us knew, and that's one of the things that I think is most impactful about the eight hours,\" Wolf said. \r\nIn addition to focusing on the molestation both boys alleged they suffered at the hands of their mother and father — one incident Balcer said occurred two weeks before the murders — the first season of the anthology will also examine the politics that played a role in the case and their sentencing. \"The other part of the story that is probably not well known is the degree of political collusion between the judge and the district attorney's office in the second trial to ensure a conviction,\" Balcer said. \"That's one new facet to the case that the series sort of highlights.\"\r\nWolf is confident these new details, joined by a cast led by four-time Emmy winner Edie Falco as the Menendez brothers' defense attorney, will keep viewers coming back despite viewers already knowing the outcome.\r\n\r\n\"I think anybody who watches the first episode is going to be there every week because there is new information,\" Wolf said. \"When you see the information, I think people are going to realize, 'Yeah, they did it,' but it wasn't first-degree murder without possibility of parole.\" Wolf said he believed that the brothers should instead have been convicted of first-degree manslaughter.\r\nAdded Wolf: \"After 27 years of Law & Orders, this is taken from the headlines. We've made some great shows ripped from the headlines. This is on a different level.\"\r\nAfter the panel in a scrum with reporters, Wolf said that \"there are discussions\" about future iterations. \"Look, this is endless if you get the right case,\" he said. \"You just think of [Timothy] McVeigh in Oklahoma City, Richard Ramirez, Son of Sam — there are a lot of things that I would like to examine for a full eight hours.\"\r\nLaw & Order True Crime: The Menendez Murders premieres Sept. 26 on NBC.\r\nWatch the latest trailer for the series.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Dick Wolf Discusses “Agenda” Behind ‘Law and Order True Crime: The Menendez Murders’", "url": "https://www.hollywoodreporter.com/tv/tv-news/dick-wolf-discusses-agenda-behind-law-order-true-crime-menendez-murders-1026527/", "description": "Fellow EP Rene Balcer also discussed the new information that will be highlighted in the eight-episode drama.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/LAWORDERTRUECRIMETHEMENENDEZMURDERS_Still2.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-08-03T10:51:17+00:00", "modified_time": "2018-04-12T09:44:41+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Dick Wolf Discusses “Agenda” Behind ‘Law and Order True Crime: The Menendez Murders’", "description": "Fellow EP Rene Balcer also discussed the new information that will be highlighted in the eight-episode drama.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/LAWORDERTRUECRIMETHEMENENDEZMURDERS_Still2.jpg?w=1296"}}, "movies": ["https://www.youtube.com/embed/xh01uHWc15Q"], "publish_date": 1501757477.0, "source": "https://www.hollywoodreporter.com", "summary": ""}