{"url": "https://en.wikipedia.org/wiki/Ni_T%C3%BA_Ni_Yo", "text": "2017 single by Jennifer Lopez featuring Gente de Zona\n\n\"Ni Tú Ni Yo\" ( pronounced [ni ˈtu ni ˈʝo]) is a song recorded by American singer Jennifer Lopez, featuring Cuban reggaeton duo Gente de Zona. It was written by Alexander Delgado Hernández, Lopez, Jerickson Mendoza, Jimmy Abreu, Manuel Bolivar, Marc Anthony, Oscar \"Oscarcito\" Hernández, Randy Malcom Martínez Amey and Álvaro Farinas, while production was handled by Arbise \"Motiff\" González, Julio Reyes Copello, Anthony and Hernández. The song was released digitally on July 4, 2017, by Nuyorican Productions and Sony Music Latin.\n\nA dance and reggaeton song about \"when love takes you by surprise\", \"Ni Tú Ni Yo\" was praised by critics, who described it as a potential summer hit. While failing to chart on the US Billboard Hot 100, it charted moderately worldwide, reaching the top forty in countries such as Poland, Finland, Spain, Hungary, Switzerland and Venezuela. An accompanying music video for the single was directed by Emil Nava. It depicts Lopez falling in love with a photographer played by Khotan Fernández, and features a cameo appearance by Anthony.\n\nBackground [ edit ]\n\nIn March 2016, it was confirmed by Billboard that Lopez had returned to Epic Records, having previously parted ways with the label in 2010. She signed a new long-term contract that saw her reunite with longtime mentor, L.A. Reid.[3] In October 2016, Billboard magazine confirmed that Lopez is working on her second Spanish album, which was originally set to be released in 2017 through Sony Music Latin. Her ex-husband Marc Anthony serves as executive producer for the album.[4][5] Anthony described the album as \"some of the best work I've ever done and some of the best work that she's ever done\", and of their collaboration said: \"The fact that she put her career in my hands is a massive responsibility, but no one knows her like I do ... We've always been good friends from day one, you know.\"[6] \"Ni Tú Ni Yo\" serves as the album's first single.[7] The single's cover art features Lopez posing in front of a sea, clothed in a 1960s-inspired yellow gown custom designed by Michael Costello.[8] Katie Skinner of Billboard observed that the shot \"fits Lopez's glamorous style and personality perfectly.\"[9]\n\nComposition [ edit ]\n\n\"Ni Tú Ni Yo\" was produced by Oscar Hernandez \"Oscarcito\", Jimmy \"JIMMIX\" Abreu, Manuel \"ManyBeat\" Bolivar and Motiff.[4] In English, the title translates to \"neither you nor I\".[8] The track sees Lopez and Gente de Zona \"pronounce their love for one another over a joyful production\",[10] which features a reggaeton beat and horn section.[11] Lopez commented that the song is \"really about when love takes you by surprise — 'Ni Tú Ni Yo,' 'Not You, Not Me' really expected this to happen, you know? That's what it's about, it's one of those things that when love comes, it just comes, it doesn't announce itself, and then it just takes over — ha! — you know what I mean? That's what the song is about, which is why I love it so much.\"[12] She revealed that the song mirrored her own relationship with boyfriend Alex Rodriguez.[12]\n\nCritical response [ edit ]\n\nRolling Stone writer Brittany Spanos called the song a \"vivacious dance track\", noting that \"Lopez's vocals stand out over the song's intricate guitars and horns.\"[1] MTV UK labelled it a \"future smash hit\" and wrote: \"Here's hoping that 'Ni Tú Ni Yo' follows the international success of other Spanish bangers like 'Bailando' and 'Despacito'.\"[13] Mike Nied from Idolator echoed this sentiment, remarking that the song \"may be a contender for the coveted title of Song Of The Summer\", calling it a \"potentially massive hit\".[10] Brooke Metz of USA Today said: \"The song, with its fast pace, swinging trumpets and all-Spanish lyrics, creates the perfect soundtrack for beach days and summer nights.\"[14]\n\nChart performance [ edit ]\n\n\"Ni Tú Ni Yo\" peaked at number 24 in Spain, and was certified Gold by Productores de Música de España for sales of 20,000 units.[15] In the United States, it sold 4,867 copies after two days,[16] and later peaked at number 15 on the Hot Latin Songs chart.[17]\n\nLive performances [ edit ]\n\nLopez debuted \"Ni Tú Ni Yo\" during her first concert in the Dominican Republic at the Altos de Chavón amphitheater in April 2017. She was joined on-stage by Gente de Zona for the performance.[18][19] Lopez and Gente de Zona officially premiered the song during her performance at Macy's July 4 Fireworks Spectacular, which aired the same day. It took place before a live audience at Hunter's Point South. The song became available digitally immediately after the performance[14][20] which received positive feedback on social media, as well as criticism towards Lopez for \"performing a Spanish song in celebration of an American holiday\".[21] Lopez wore a high-cut, double-slit embroidered gown designed by Fausto Puglisi while performing \"Ni Tú Ni Yo\",[10][22] which also drew criticism for its revealing nature.[21] She performed an acoustic version of the song at the Stars Together For One Voice: Somos Live! concert/telethon in October 2017, which benefited victims of Hurricane Maria in Puerto Rico.[23]\n\nMusic video [ edit ]\n\nThe song's official music video premiered on Telemundo on July 11, 2017.[24] Lopez shared an image from the set of the video shoot on June 13, in which she and Gente de Zona are featured wearing Caribbean-styled outfits.[25] The music video was directed by Emil Nava, and was shot in Islamorada, Florida Keys over two days. It features several product placements and cameos from Anthony, Mexican actor Khotan Fernández, and actor/Sprint \"Test Man\" Paul Marcarelli. Lopez's outfits in the music video include a red wrap dress and a canary yellow gown.[26] According to Billboard, set in Miami, the clip \"tells the story of Lopez falling in love with a photographer she met through her manager (played by ex-husband Marc Anthony), while also enjoying life in a tropical paradise.\"[27] The clip begins with a potential director pitching a tropical-themed idea for the song's music video to Lopez and Anthony. This is followed by Lopez \"flirtatiously\" posing for the photographer while donning a number of \"elaborate fashions\" and \"sultry poses\" on a beach, in front of a plain backdrop and amid tropical foliage.[28]\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRegion Certification Certified units/sales Mexico (AMPROFON)[52] Gold 30,000 Spain (PROMUSICAE)[15] Gold 20,000 Sales+streaming figures based on certification alone.\n\nRelease history [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c8/Ni_T%C3%BA_Ni_Yo_cover_art.png/220px-Ni_T%C3%BA_Ni_Yo_cover_art.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/en/c/c8/Ni_T%C3%BA_Ni_Yo_cover_art.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/c/c8/Ni_T%C3%BA_Ni_Yo_cover_art.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Ni_T%C3%BA_Ni_Yo", "title": "Ni Tú Ni Yo", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/c/c8/Ni_T%C3%BA_Ni_Yo_cover_art.png", "width": 640, "height": 640}, "title": "Ni Tú Ni Yo - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}