{"url": "kellyandryan.com/uncategorized/ryan-bio/", "text": "Host and Executive Producer\n\n“Live with Kelly and Ryan”\n\nRyan Seacrest is an Emmy-winning television host, radio personality, mega producer, entrepreneur, and philanthropist. Seacrest co-hosts and executive produces the nationally syndicated Emmy award-winning show ‘Live With Kelly And Ryan,’ for which he earned an Emmy for Outstanding Entertainment Talk Show Host.\n\nAs one of the most recognizable voices across television and radio, Seacrest is also the host of “On Air with Ryan Seacrest,” his market-topping #1 nationally syndicated LA morning drive-time show for iHeartMedia’s 102.7 KIIS-FM, as well as a nationally syndicated Top 40 radio show.\n\nFor 20 seasons, Seacrest has hosted television’s ground-breaking singing competition series, ABC’s American Idol, and earned several Emmy Award nominations for his work on the show. The show will return for its 21st season in early 2023. Additionally, Seacrest continues to be a fixture as the host of the annual live broadcast of Dick Clark’s New Year’s Rockin’ Eve With RyanSeacrest since 2005.\n\nSeacrest launched his Emmy award-winning company RyanSeacrest Productions in 2006. Since then, the production banner has been behind countless hit series including Hulu’s Keeping Up With The Kardashians, and its spinoffs, as well as E!’s E! Live From The Red Carpet, Netflix’s Insatiable, NBC’s Shades of Blue starring Jennifer Lopez, and the Emmy Award-winning series Jamie Oliver’s Food Revolution for ABC. Currently, Ryan Seacrest Productions has several scripted projects in development, including the recently announced mystery series, The Watchful Eye, that has been picked up by Freeform.\n\nHis philanthropic efforts include serving as chairman of the RyanSeacrest Foundation (RSF), which has eleven broadcast media centers – Seacrest Studios – in pediatric hospitals in cities across the country. He also serves on the board of the Los Angeles County Museum of Art (LACMA), and on the board of trustees of the Paley Center for Media.", "images": ["https://kellyandryan.com/wp-content/themes/dtci-kellyandryan/images/white_logo.svg", "https://kellyandryan.com/wp-content/uploads/2017/05/ryan_flipped.jpg?w=732", "https://kellyandryan.com/wp-content/themes/dtci-kellyandryan/assets/img/spacer.gif", "https://kellyandryan.com/wp-content/uploads/2021/08/live-kelly-and-ryan_share.jpg", "https://kellyandryan.com/wp-content/themes/dtci-kellyandryan/images/back_to_top.png"], "top_img": "https://kellyandryan.com/wp-content/uploads/2021/08/live-kelly-and-ryan_share.jpg", "keywords": [], "authors": [], "canonical_link": "https://kellyandryan.com/show-info/ryan-bio/", "title": "Ryan Seacrest", "meta_data": {"viewport": "width=device-width, height=device-height, initial-scale=1, user-scalable=no", "og": {"url": "https://kellyandryan.com/show-info/ryan-bio/", "image": {"identifier": "https://kellyandryan.com/wp-content/uploads/2017/05/ryan_flipped.jpg", "width": 584, "height": 336}, "description": "Host and Executive Producer “Live with Kelly and Ryan” Ryan Seacrest is an Emmy-winning television host, radio personality, mega producer, entrepreneur, and philanthropist. Seacrest co-…", "type": "article", "title": "Ryan Seacrest", "site_name": "LIVE with Kelly and Ryan", "locale": "en_US"}, "sitesectionid": "dadt_live_other", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "color-scheme": "only light", "article": {"published_time": "2017-05-07T06:48:47+00:00", "modified_time": "2022-08-25T22:18:20+00:00"}, "twitter": {"text": {"title": "Ryan Seacrest"}, "image": "https://kellyandryan.com/wp-content/uploads/2017/05/ryan_flipped.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://kellyandryan.com/wp-content/uploads/2017/09/faviconkelly.jpg?w=270"}, "movies": [], "publish_date": 1494139727.0, "source": "http://kellyandryan.com", "summary": ""}