{"url": "https://web.archive.org/web/20181221182733/https://www.forbes.com/sites/moiraforbes/2018/12/21/jennifer-lopez-on-battling-self-doubt-and-achieving-her-own-second-act/", "text": "Jennifer Lopez is a testament to the fact that achieving the entertainment industry’s biggest breaks requires creating your own opportunities, not waiting for them. “ I just kept going. I started working harder and harder than everyone else. And it started paying off ,” says Lopez on the value of ceaseless hustle and self-belief in paving her own success path. It’s that same attitude that comes to life in Lopez’s new film, “Second Act” where her character Maya, sidelined by unfulfilled career dreams, learns to unleash her inner confidence to realize her biggest aspirations.\n\nWith a heroine who hits her career stride in her forties and proves that attitude, versus social status or education, determines your possibility, the film represents more than a storyline; it’s part of critical cultural conversation around embracing reinvention, banishing self-doubt, and the power of believing in limitless potential.\n\nWith the mission to spotlight how women spanning the success spectrum have overcome barriers to embrace their own second acts, Jennifer Lopez joined a discussion of dynamic female leaders including Hollywood producer and the film’s writer Elaine Goldsmith-Thomas, Thrive Global CEO Arianna Huffington and Dr. Stacy Smith, Founder and Director of the Annenberg Inclusion Initiative. Hosted and moderated by Full Picture CEO Desiree Gruber, the conversation offered a candid exchange on pushing past career hurdles, from the pervasive glass ceiling still faced by women today to unlocking the “straightjackets in our minds.”\n\n“Part of what’s happened in this [women’s] movement right now is that some of it is platitudes like ‘Try harder. Tomorrow’s another day. Be your best self. Reach for the stars!’ And it’s like, how? What do I need to do today? What can I do today?” says Gruber on the importance of offering women actionable insights and tangible solutions to empower them to take their next step forward. “As women and as industry leaders, we can and should mentor as many people and help as many people as we can to reinvent,” says Goldsmith-Thomas, a sentiment which exemplifies the spirit of Gruber’s conversation and the powerful perspectives shared on learning to be limitless.\n\nBanish Impost0r Syndrome:\n\n“More than anything, I started believing in myself. I started believing in the fact that I wasn’t an impostor. That I wasn’t a fake. That there was a reason I was doing this and people kept hiring me. It took time and it took me to believe in myself.” – Jennifer Lopez\n\nTurn Setbacks Into Successes:\n\n“For me, the question of how we deal with failure is everything. My mom used to say to my sister and me, ‘Failure is not the opposite of success. It’s a stepping stone to success. There is absolutely nobody who has not failed.” – Arianna Huffington\n\nTune Out the Critics:\n\n“I don’t let the opinions of others really influence how I think about myself. And that took a long time. Everybody was like ‘She can’t sing. She can’t dance. She can’t act. She is just a pretty face’. Or ‘her butt is big’. Or whatever they were saying about me. And I started thinking, ‘yeah that’s true’.”\n\n“Despite the hurt and the pain, I just kept going and I just couldn’t allow myself to let that become who I was. The most important thing is not listening to all the outside voices, but making sure that the voice that I’m speaking to myself – that roommate – is a kind roommate.” – Jennifer Lopez\n\nCome Back Stronger:\n\n“There isn’t anybody out there who hasn’t fallen, who hasn’t said, ‘God, I wish I didn’t do that.’ All we can do is let it inform a better path for us and be stronger because of it.” – Elaine Goldsmith-Thomas\n\nCompete With Yourself:\n\n“This is my path. This is my race. Yes, I’m competitive, but I’m competitive with myself. How much further can I go? How much more can I do? How much better can I be?” – Jennifer Lopez\n\nWrite Your Own Story:\n\n“We are the architects of our own lives. We have to be responsible. We have one life. We have one narrative and it is ours to write. Get up and do it.” – Elaine Goldsmith-Thomas\n\nJust Jump:\n\n“Women can be limitless, we can rise above it. That doesn’t mean that we’re not going through pain, or through challenges, or through difficulties. That’s what is so powerful.”\n\n“I think there are limitless acts. The fact that you can achieve everything without having to lose your health and your relationships and what matters to you. It’s hard, but close your eyes, take a deep breath, and jump. And it’s sometimes what we all need to do because it doesn’t make sense always.” – Arianna Huffington\n\n\"Second Act\" is in theaters now.", "images": ["https://web.archive.org/web/20181221182733im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fmoiraforbes%2Ffiles%2F2018%2F12%2FIMG_0899a-1200x887.jpg", "https://web.archive.org/web/20181221182733im_/https://secure.gravatar.com/avatar/7c06f39493c31e3f1dda4a5d4849fb1a?s=400&d=mm&r=g"], "top_img": "https://web.archive.org/web/20181221182733im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fmoiraforbes%2Ffiles%2F2018%2F12%2FIMG_0899a-1200x887.jpg", "keywords": [], "authors": ["Moira Forbes"], "canonical_link": "https://web.archive.org/web/20181221182733/https://www.forbes.com/sites/moiraforbes/2018/12/21/jennifer-lopez-on-battling-self-doubt-and-achieving-her-own-second-act/", "title": "Jennifer Lopez On Battling Self-Doubt And Achieving Her Own Second Act", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1,maximum-scale=2,user-scalable=yes", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "Jennifer Lopez On Battling Self-Doubt And Achieving Her Own Second Act", "image": "https://web.archive.org/web/20181221182733im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fmoiraforbes%2Ffiles%2F2018%2F12%2FIMG_0899a-1200x887.jpg", "updated_time": "2018-12-21T12:20:20-05:00", "url": "https://web.archive.org/web/20181221182733/https://www.forbes.com/sites/moiraforbes/2018/12/21/jennifer-lopez-on-battling-self-doubt-and-achieving-her-own-second-act/", "description": "Jennifer Lopez is a testament to the fact that achieving the entertainment industry’s biggest breaks requires creating your own opportunities, not waiting for them.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "Jennifer Lopez On Battling Self-Doubt And Achieving Her Own Second Act", "description": "Jennifer Lopez is a testament to the fact that achieving the entertainment industry’s biggest breaks requires creating your own opportunities, not waiting for them.", "image": "https://web.archive.org/web/20181221182733im_/https://thumbor.forbes.com/thumbor/600x300/https%3A%2F%2Fblogs-images.forbes.com%2Fmoiraforbes%2Ffiles%2F2018%2F12%2FIMG_0899a-1200x887.jpg", "creator": "@moiraforbes"}, "description": "Jennifer Lopez is a testament to the fact that achieving the entertainment industry’s biggest breaks requires creating your own opportunities, not waiting for them.", "author": "Moira Forbes", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Moira Forbes", "section": "Leadership", "section_url": "https://www.forbes.com/forbeswoman//", "id": "blogAndPostId/blog/post/1017-5316", "published": "2018-12-21", "modified": "2018-12-21"}}, "movies": [], "publish_date": 1545350400.0, "source": "https://web.archive.org", "summary": ""}