{"url": "https://www.newsday.com/entertainment/celebrities/longest-lasting-celebrity-marriages-1.13022641", "text": "It’s not unusual to hear that a celebrity couple is splitting up, but what about those stars who got married long ago and are still going strong? From Beyonce and Jay Z to Tom Hanks and Rita Wilson, learn more about the actors and musicians whose marriages are surviving the test of time.\n\nAnne and Kirk Douglas\n\nCredit: Matt Sayles/Invision/AP\n\nYEARS OF MARRIAGE: 62\n\nAnne Douglas, 97, met her 100-year-old husband Kirk while he was working in Paris in 1953. Anne (then Anne Buydens) was a native European--born in Germany, raised in Belgium and at the time living in France--and was using her understanding of several languages as a career tool. She was hired to help the actor with translating, and the two started seeing each other.\n\nMr. Douglas soon returned to the U.S., and invited her to come to visit. Fearful she would once again leave, he arranged a quick visit to a justice of the peace, and the two were married in May 1954 in Las Vegas, NV (which means 41 of the 66 people mentioned in this list weren't even born yet when Kirk and Anne said \"I do\").\n\nJoy and Regis Philbin\n\nCredit: Getty Images / Jamie McCarthy\n\nYEARS OF MARRIAGE: 45\n\nJoy, 75, and Regis Philbin, 85, were married at Forest Lawn Cemetery in California in March 1970.\n\nSamuel L. Jackson and LaTanya Richardson\n\nCredit: AP\n\nYEARS OF MARRIAGE: 37\n\nJackson, 68, and LaTanya Richardson, 67, met in college, and married in January 1980.\n\nRingo Starr and Barbara Bach\n\nCredit: AFP / Getty Images\n\nYEARS OF MARRIAGE: 35\n\nStarr, 76, may have made his name as a member of The Beatles, but he met Bach, 69, on the set in 1980 of the 1981 film \"Caveman,\" in which the two starred. The couple married in April 1981.\n\nAli Hewson and Bono\n\nCredit: Getty Images\n\nYEARS OF MARRIAGE: 34\n\nAli Hewson, 55, and U2 frontman Bono (born Paul Hewson), 56, first met while attending secondary school (high school) in Dublin, Ireland and married in August 1982.\n\nMaureen and Steven Van Zandt\n\nCredit: Getty Images\n\nYEARS OF MARRIAGE: 34\n\nMaureen, 65 and Steven \"Little Steven\" Van Zandt, 66, were married in Asbury Park, NJ in December 1982. Little Steven's longtime bandmate Bruce Springsteen was the best man, Reverend Richard Penniman--better known as Rock & Roll Hall of Fame member Little Richard--was the preacher that married the couple, and fellow Rock and Roll Hall of Fame inductee Percy Sledge sang his signature song \"When a Man Loves a Woman\" at the wedding reception.\n\nKeith Richards and Patti Hansen\n\nCredit: Getty/Rob Kim\n\nYEARS OF MARRIAGE: 33\n\nRolling Stones guitarist Richards, 73, first met model/ actress Hansen, 60, at the legendary Studio 54 nightclub in 1979 while she was celebrating her twenty-third birthday, but didn't get involved until meeting again on Richards' thirty-sixth birthday in December that same year.\n\nThe couple eventually married on December 18, 1983 (which also happened to be Richards' fortieth birthday) in Cabo San Lucas, Mexico.\n\nTracy Pollan and Michael J. Fox\n\nCredit: Getty Images\n\nYEARS OF MARRIAGE: 28\n\nPollan, 56, and Fox, 55, first met in 1985 while working together on the NBC networks sitcom \"Family Ties,\" but didn't begin dating until sharing a second gig in 1987 (the 1988 film \"Bright Lights, Big City\"). The two were married in Arlington, Vermont in July 1988.\n\nTom Hanks and Rita Wilson\n\nCredit: AP / Jonathan Short\n\nYEARS OF MARRIAGE: 28\n\nHanks and Wilson, both 60, first met on the set of Hanks' ABC networks sitcom \"Bosom Buddies\" but didn't really hit it off until they worked together again on the 1985 film \"Volunteers.\" The pair married in April 1988.\n\nKyra Sedgwick and Kevin Bacon\n\nCredit: Getty Images\n\nYEARS OF MARRIAGE: 28\n\nSedgwick, 51, actually first met Bacon, 58, when she was 12--she approached the then 19-year-old Bacon to compliment him on his performance in a play--but the two didn't start dating until meeting again while working on the 1998 film \"Lemon Sky,\" at which point the two were both in their twenties.\n\nThe two were married in September 1988.\n\nJon Bon Jovi and Dorothea Hurley\n\nCredit: Getty Images / Dimitrios Kambouris\n\nYEARS OF MARRIAGE: 27\n\nBon Jovi, 54, may be a rock star with a heartthrob image, but the man has long been off the market as he married Hurley (also 54)--his high school sweetheart--in Las Vegas in April 1989, in a ceremony led by an Elvis impersonator.\n\nRobin Dearden and Bryan Cranston\n\nCredit: AFP/Getty Images / ROBYN BECK\n\nYEARS OF MARRIAGE: 27\n\nActors Dearden, 63, and Cranston, 60, first met while working together on the CBS network series \"Airwolf\" in 1986, but didn't start dating until a year later. The two married in July 1989.\n\nBruce Springsteen and Patti Scialfa\n\nCredit: Owen Sweeney/Invision/AP / Owen Sweeney\n\nYEARS OF MARRIAGE: 25\n\nScialfa, 63, was (and still is) a member of the 67-year-old Springsteen's E-Street Band, and their relationship first became public knowledge during the 1988 \"Tunnel of Love Express\" tour. The rockers tied the knot in the garden of their shared Beverly Hills mansion in June 1991.\n\nJohn Travolta and Kelly Preston\n\nCredit: Invision, AP / Jordan Strauss\n\nYEARS OF MARRIAGE: 25\n\nActors Travolta, 62, and Preston, 54, met while shooting the 1989 film \"The Experts,\" started dating in 1990 and married in Paris in September 1991 (and had a second ceremony a week later in Daytona Beach, FL).\n\nKate Capshaw and Steven Spielberg\n\nCredit: Getty Images/ Jason Merritt\n\nYEARS OF MARRIAGE: 25\n\nCapshaw, 63, and Steven Spielberg, 70, met while the two were working on the 1984 film \"Indiana Jones and the Temple of Doom\" (she was a co-star, he was the director). The two married in October 1991.\n\nAnnette Bening and Warren Beatty\n\nCredit: AFP/Getty Images / ANGELA WEISS\n\nYEARS OF MARRIAGE: 24\n\nBening, 58, and Beatty, 79, met on the set of their 1991 film \"Bugsy,\" and started dating immediately after it wrapped, and married in March 1992 in a secret ceremony, so private it wasn't announced publicly for almost two weeks.\n\nSting and Trudie Styler\n\nCredit: AFP/Getty Images / ANGELA WEISS\n\nYEARS OF MARRIAGE: 24\n\n65-year-old Gordon Sumner (AKA Sting) and Trudie Styler, 63, first met as neighbors, and got romantically involved in 1981. The two got married in August 1992, in an lavish affair that took place at their mansion in Wiltshire, England that included her arriving on horseback and an unscheduled reunion of Sting's former group The Police.\n\nTed Danson and Mary Steenburgen\n\nCredit: AFP/Getty Images/SAUL LOEB\n\nYEARS OF MARRIAGE: 21\n\nActors Danson, 69, and Steenburgen, 63, met while working together on the 1993 film \"Pontiac Moon.\" The couple married in October 1995.\n\nKelly Ripa and Mark Consuelos\n\nCredit: AP / Evan Agostini\n\nYEARS OF MARRIAGE: 20\n\nRipa, 46, and Consuelos, 45, met while working together on the ABC networks soap opera \"All My Children,\" playing characters that fell in love and married. However, the actors fell in love in the real world, and eloped in Las Vegas in May 1996.\n\nFaith Hill and Tim McGraw\n\nCredit: AP / Evan Agostini\n\nYEARS OF MARRIAGE: 20\n\nMcGraw, 49, proposed to Hill, also 49, in June 1996 at a festival in Colorado. The two were both performers at the event, and Hill had already done her set when McGraw asked for her hand in marriage before he went on--and she didn't give him an answer.\n\nHowever, once he finished his set, he returned to his dressing room to find a \"Yes\" response written on the mirror with a Sharpie. The two married in October 1996.\n\nFelicity Huffman and William H. Macy\n\nCredit: Invision/AP / Richard Shotwell\n\nYEARS OF MARRIAGE: 19\n\nFelicity Huffman, 54, and William H. Macy, 66, met at New York's off-Broadway Atlantic Theater Company and dated for 15 years before finally marrying in September 1997.\n\nCourtney B. Vance and Angela Bassett\n\nCredit: AP\n\nYEARS OF MARRIAGE: 19\n\nActors Vance, 56, and Bassett, 58, first met in college, at the Yale School of Drama in 1980. The two started off as friends but a deeper relationship blossomed several years later in 1996, and the couple got married in October 1997.\n\nWill Smith and Jada Pinkett Smith\n\nCredit: AP, Invision / Chris Pizzello\n\nYEARS OF MARRIAGE: 19\n\nSmith, 48, and Pinkett-Smith, 45, met in 1995 when she (then simply Jada Pinkett) auditioned for Smith's NBC networks sitcom \"The Fresh Prince of Bel-Air;\" the open role was to play the girlfriend of Smith's character. She didn't get the job, but the two hit it off in real life and after dating for some time married on New Years' Eve 1997, at the Cloisters Castle in Maryland.\n\nChristine Taylor and Ben Stiller\n\nCredit: AP\n\nYEARS OF MARRIAGE: 18\n\nChristine Taylor, 45, and Ben Stiller, 51, met while shooting an unsuccessful pilot for a show called \"Heat Vision and Jack,\" but did find romantic success and married on the Hawaiian island of Kaua in September 1998.\n\nDavid and Victoria Beckham\n\nCredit: Getty Images\n\nYEARS OF MARRIAGE: 17\n\nToday they are Victoria Beckham, 42, and David Beckham, 41--but back in 1997, she was better known as Posh Spice of the Spice Girls. Victoria (then Victoria Adams) was in the Manchester United players' lounge following a soccer match when David--then only a second-string player (today he's a member of the English Football Hall of Fame)--asked her for her phone number.\n\nThe two started dating and eventually married in an Irish castle in July 1999, an affair at which Sir Elton John gave a private performance.\n\nJerry and Jessica Seinfeld\n\nCredit: Jordan Strauss/Invision/AP / Jordan Strauss\n\nYEARS OF MARRIAGE: 17\n\nJessica Seinfeld, 45, first met her 62-year-old comedian husband at a Manhattan fitness club in August 1998, and were married on Christmas Day (Dec. 25) in 1999.\n\nBeyonce and Jay Z\n\nCredit: Getty Images / Jason Miller\n\nYEARS OF MARRIAGE: 8\n\nBeyonce Knowles, 35, and Shawn \"Jay Z\" Carter, 47, have managed to keep a great deal about their relationship private, but it's believed they met around 1999-2000 and possibly started dating in 2001. However, their marriage was made public after the musicians privately wed in April 2008.\n\nEllen DeGeneres and Portia de Rossi\n\nCredit: Getty Images / Christopher Polk\n\nYEARS OF MARRIAGE: 8\n\nEllen DeGeneres, 58 and Portia de Rossi, 43, first met backstage at a VH1 awards program, and shortly following the May 2008 overturn of the same-sex marriage ban in California, the two married at their Beverly Hills home (in Aug. 2008).\n\nPeter Sarsgaard and Maggie Gyllenhaal\n\nCredit: Getty Images / Dimitrios Kambouris\n\nYEARS OF MARRIAGE: 7\n\nSarsgaard, 45, and Gyllenhaal, 39 were quietly married at a chapel in Italy in 2009.\n\nSacha Baron Cohen and Isla Fisher\n\nCredit: John Shearer/Invision/AP\n\nYEARS OF MARRIAGE: 6\n\nSacha Baron Cohen, 45, and Isla Fisher, 40, met in 2002 at a party in Sydney, Australia. After a lengthy engagement, the couple exchanged wedding vows in at a private and small ceremony (only six guests attended) in Paris in March 2010.\n\nHarrison Ford and Calista Flockhart\n\nCredit: Getty Images/ VALERIE MACON\n\nYEARS OF MARRIAGE: 6\n\nFord, 74, and Flockhart, 52, first met at the Golden Globes awards program in Jan. 2002, and married in June 2010 in the Governor's Mansion in Santa Fe, NM, performed by then-Governor Bill Richardson.", "images": ["https://www.newsday.com/img/newsdayLogo.svg", "https://cdn.newsday.com/ace/c:Zjc2MDY1M2UtZjg4Ni00:M2ZjYjlj/landscape/1280"], "top_img": "https://cdn.newsday.com/ace/c:Zjc2MDY1M2UtZjg4Ni00:M2ZjYjlj/landscape/1280", "keywords": [], "authors": ["Ian J. Stark"], "canonical_link": "https://www.newsday.com/entertainment/celebrities/longest-lasting-celebrity-marriages-f51684", "title": "Longest-lasting celebrity marriages", "meta_data": {"viewport": "width=device-width", "robots": "index,follow", "description": "From Beyonce and Jay Z to Tom Hanks and Rita Wilson, learn more about the actors and musicians whose marriages are surviving the test of time.", "twitter": {"card": "summary_large_image", "site": "@newsday", "creator": "@newsday", "image": "https://cdn.newsday.com/ace/c:Zjc2MDY1M2UtZjg4Ni00:M2ZjYjlj/landscape/1280", "app": {"id": {"iphone": 358571317, "ipad": 358571317, "googleplay": "com.pagesuite.newsday"}}}, "og": {"title": "Longest-lasting celebrity marriages", "description": "From Beyonce and Jay Z to Tom Hanks and Rita Wilson, learn more about the actors and musicians whose marriages are surviving the test of time.", "url": "https://www.newsday.com/entertainment/celebrities/longest-lasting-celebrity-marriages-f51684", "type": "imagegallery", "image": "https://cdn.newsday.com/ace/c:Zjc2MDY1M2UtZjg4Ni00:M2ZjYjlj/landscape/1280", "site_name": "Newsday"}, "apple-itunes-app": "app-id=358571317, affiliate-data=, app-argument=https://itunes.apple.com/us/app/newsday/id358571317?mt=8", "msvalidate.01": "AC41EB10D1EC6B5358F0ECA0E861CCAA", "theme-color": "#0077c8", "google-site-verification": "WS-IPs_DqbPtrQ9XhKPi_32a-1spE4tjsjhWUqwVVns", "application-name": "Newsday", "fb": {"pages": 19175874448, "app_id": 147686468041}, "origin-trial": "AxNC/9eKMmjjy1dTV1CFOUFT7kXZR87jH426QDYyiSzWBNkMnd8eKsK1/WRyinBMBUJGp8r1lDKn1ERUehny9g0AAACBeyJvcmlnaW4iOiJodHRwczovL3d3dy5uZXdzZGF5LmNvbTo0NDMiLCJmZWF0dXJlIjoiSW50ZXJlc3RDb2hvcnRBUEkiLCJleHBpcnkiOjE2MjYyMjA3OTksImlzU3ViZG9tYWluIjp0cnVlLCJpc1RoaXJkUGFydHkiOnRydWV9", "keywords": "Celebrities, Entertainment, Holiday, Things to Do, Sarah Jessica Parker Matthew Broderick Kevin Bacon Tom Hanks Bruce, Celebrity weddings, Valentine's Day", "sailthru.title": "Longest-lasting celebrity marriages", "sailthru.date": "2017-03-21T23:51:00.846Z", "sailthru.author": "Ian J. Stark", "next-head-count": 46}, "movies": [], "publish_date": 1490140260.846, "source": "https://www.newsday.com", "summary": ""}