{"url": "www.wonderwall.com/celebrity/brad-pitt-and-angelina-jolies-divorce-and-custody-proceedings-stall-again-plus-more-news-3012630.gallery", "text": "Judge extends Brad Pitt and Angelina Jolie's custody and divorce proceedings Brad Pitt and Angelina Jolie could be looking at another whole year of drawn-out split negotiations. According to In Touch, the two requested more time to work out agreements for the custody of their six children and the distribution of their assets earlier this month. \"They had been diligently going along privately and amicably, trying to keep the focus on the family,\" says a source. \"But suddenly, Angelina reversed course when she felt Brad was pushing too hard to resolve the situation to his benefit.\" A court order excepted by the tab states, \"The completion date for all proceedings before the temporary judge is extended from Dec. 31, 2017, to Dec. 31, 2018.\" Says the insider: \"This means their custody battle can drag on for another year.\" Brad and Angelina split in September 2016. Their current custody deal gives Angelina primary custody while Brad gets visitation. He's reportedly asking for joint custody. Meanwhile, an OK report claiming the two are calling off the divorce altogether has been debunked by Gossip Cop. RELATED: Celebrity splits of 2017\n\nRobsten reunion rumors heat up the Internet Did Robert Pattinson and Kristen Stewart get together for drinks this week? A number of social media users claimed to have spotted the former couple at Edendale, a bar in the Silver Lake neighborhood of Los Angeles on Sunday, Feb. 11. \"Was just at bar enjoying my friends birthday and in comes Robert Pattinson which blew my twilight mind up, and then Kristen Stewart walked in and now I'm reliving my highschool twilight fantasies,\"wrote one Twitter user excerpted on Elle.com. Pressed for pics to prove the sighting, she said, \"It wouldn't have been cool to take a picture of them, they just seemed like two friends hanging out.\" Another user chimed in \"It's true!! It was such a small venu it would have been so rude to take a pic but scouts honor!!!\" while a third wrote, \"when you're just innocently at a bar in LA and suddenly robert pattinson and kristen stewart appear right in front of you. EDWARD AND BELLA IN THE SPARKLY FLESH :o.\" Robert, who recently broke off his engagement to FKA twigs, and Kristen, who is reportedly dating Stella Maxwell, dated from 2008 until 2013. RELATED: Our favorite onscreen TV couples\n\nCindy Crawford and Rande Gerber support Kaia Gerber at Calvin Klein NYFW show It's been a busy New York Fashion Week for 16-year-old model Kaia Gerber and her parents, Cindy Crawford, have been by her side every step of the way. On Tuesday, Feb. 13, Cindy and Rande were in the front row as their daughter walked in her sixth show of the week — this time, for Calvin Klein. \"@calvinklein FW18! thank you to the genius team that is @rafsimons, @ashleybrokaw, and #olivierrizzo,\" Kaia wrote on Instagram after hitting the runway. \"SO MUCH LOVE ❤️🍿.\" Speaking to the AP about her daughter and son Presley's modeling careers, Cindy said, \"The great thing for my kids is that I know a lot about that world. I feel like: Who better to help guide them than me?\" RELATED: Celebrity kids all grown up\n\nTaylor Swift wins 'Shake It Off' lawsuit Taylor Swift is off the hook in a copyright infringement case over \"Shake It Off.\" On Tuesday, Feb. 13, a federal judge ruled the singer had no liability in the case because the 2001 track \"Playas Gon' Play\" is \"not unique enough to fall under copyright protection,\" according to The Blast. When the lawsuit surfaced a lawyer for Taylor said, \"This is a ridiculous claim and nothing more than a money grab.\"\n\nSarah Jessica Parker prayed Robert Downey Jr. wouldn't die after they broke up For Sarah Jessica Parker, dating Robert Downey Jr. while he was an addict in the '80s took a lot of energy. It was scary, too. \"There was a huge amount of time spent making sure he was OK,\" she recently told the New York Post of her relationship with the \"Iron Man\" star, which ended after seven years in 1991. \"At a certain point, I had the courage to say, 'I'm going to walk away and I'm just going to pray that you don't die,'\" she admitted. \"I didn't know for a long time. I was like, 'Why is his heart beating so fast? Don't do so many push-ups before bed!'\" She added that she has no misgivings about having invested herself in their romance, telling the Post, \"I don't resent the time spent.\" Robert, who has reportedly been sober since 2003, told Parade in 2008 that SJP \"provided me a home and understanding\" and \"tried to help\" before they called it quits. Many years after they split, Robert went to visit his ex to get closure on things between them. \"Seeing her I was like, 'She's so great and so cool and so funny and so in command,'\" he later told Howard Stern. \"I got to meet her kids and I saw the way she and [husband] Matthew [Broderick] live and I respect both of them so much.\"\n\nWendy Williams cancels the rest of the week's shows Four months after she passed out on live TV from what she said was dehydration while wearing a Statue of Liberty costume, Wendy Williams is being extra cautious with her health. The New York Post reports the 53-year-old has canceled new shows from Wednesday, Feb. 14 through Friday, Feb. 16 due to illness. \"Wendy is still experiencing flu-like symptoms, and so she can rest up and get better, we have decided to cancel tapings the rest of the week,\" a rep for \"The Wendy Williams Show\" confirmed to the Post.\n\nDustin Lance Black and Tom Daley are expecting their first child Congrats are in order for \"Milk\" screenwriter and director Dustin Lance Black and his husband Tom Daley, who announced on Wednesday, Feb. 14, that they're expecting their first child. \"A very happy #ValentinesDay from ours to yours,\" Dustin wrote on social media, sharing a sweet photo of himself holding up a sonogram with his husband. Tom, an Olympic diver who took home the bronze at the 2012 Olympics, shared a similar pic, with the caption, \"HAPPY VALENTINES DAY!\" Before their 2017 wedding, the couple shared an Out cover story in which they explained how much they were dreaming of settling down and starting a family. \"We were so busy making all these plans – we both wanted to have children; we both wanted to build a home of our own someday,\" Dustin said at the time (via People). \"I draw, so I was sketching little plans for houses on cliffs overlooking oceans, while Tom watched over my shoulder — it was a very grown-up version of playing house. Marriage is the foundation to all of these other big plans we have. So we knew we were going to get engaged — it was just a matter of when, and who does it.\"\n\nMeek Mill's legal team has new evidence they hope will get his conviction set aside The plot around Meek Mill's leal situation continues to thicken. The Philadelphia-based rapper was recently sentenced to four years of prison time for a probation violation stemming from a 2007 drug and weapon conviction but new evidence suggests that conviction could have some holes in it. The New York Post reports Reginald V. Graham, who arrested Meek ten years ago for allegedly selling drugs and then threatening to shoot police officers, is on a secret Philadelphia District Attorney's Office list of more than 20 cops with histories of \"lying, racial bias, brutality or abuse of power.\" The list was reportedly created as a means of preventing those officers from testifying in court, but testimony from the cop who arrested Meek still helped send him to jail. While the cop claimed to have seen Meek selling drugs then hiding behind a car with a gun, Meek was reportedly supporting a relative in court at the time of the alleged drug deal. After he was arrested, he has said he was dragged inside a house where all of the police involved britallu attacked him. \"I was getting beat by at least four cops. I was laying on my stomach, I was being kicked in my face, punched in my face,\" he recalled. \"I maybe got knocked out two or three times from getting kicked in my face. I had stitches. I had lumps. If you see my mug shot from the pictures I went out [unconscious] like three times … The handcuff prints on my hand from when you get thrown around with handcuffs, your hands are going to start bleeding … every last cop hit me.\" The officer who appears on the secret list was the only one to testify against Meek in court. Meek's legal team now plans to ask the Pennsylvania Supreme Court to the rapper's conviction aside and to grant him bail immediately.\n\nCardi B. staffer says Cardi is expecting In recent weeks, Cardi B has repeatedly denied rumors she's expecting her first child. At least one member of her team, however, is telling folks she is pregnant. After Cardi performed a Super Bowl party hosted by Maxim, a venue employee offered to take her back to her VIP room, where booze was being served. That's when a rep for Cardi said she wanted to avoid the \"party atmosphere,\" adding that she'd rather drink water by the stage. The rep added that the rapper, singer and songwriter is \"three to four months pregnant,\" according to TMZ.", "images": ["https://www.wonderwall.com/wp-content/uploads/sites/2/2016/08/104-188807_Actual.jpg?crop=0px,0px,3010px,1580px&resize=1200,630", "https://i0.wp.com/www.wonderwall.com/wp-content/uploads/sites/2/2016/08/104-188807_Actual.jpg?crop=0px%2C0px%2C3010px%2C1580px&resize=1200%2C630&ssl=1", "https://www.wonderwall.com/wp-content/uploads/sites/2/2020/04/whalerock-logo.svg", "https://www.wonderwall.com/wp-content/uploads/sites/2/2020/04/ww-logo.svg", "https://www.wonderwall.com/wp-content/uploads/sites/2/2022/09/shutterstock_editorial_396135aj-2.jpg?h=800", "https://www.wonderwall.com/wp-content/themes/wonderwall/assets/images/download.png"], "top_img": "https://www.wonderwall.com/wp-content/uploads/sites/2/2016/08/104-188807_Actual.jpg?crop=0px,0px,3010px,1580px&resize=1200,630", "keywords": [], "authors": ["Wonderwall.Com Editors"], "canonical_link": "https://www.wonderwall.com/celebrity/brad-pitt-and-angelina-jolies-divorce-and-custody-proceedings-stall-again-plus-more-news-3012630.gallery", "title": "Brad Pitt, Angelina Jolie's divorce, custody proceedings stall", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Brad Pitt and Angelina Jolie have until the end of the year to work out divorce and custody arrangements. Plus, more celebrity news for Feb. 14, 2018.", "og": {"locale": "en_US", "type": "article", "title": "Brad Pitt, Angelina Jolie's divorce, custody proceedings stall", "description": "Brad Pitt and Angelina Jolie have until the end of the year to work out divorce and custody arrangements. Plus, more celebrity news for Feb. 14, 2018.", "url": "https://www.wonderwall.com/celebrity/brad-pitt-and-angelina-jolies-divorce-and-custody-proceedings-stall-again-plus-more-news-3012630.gallery", "site_name": "Wonderwall.com", "image": "https://i0.wp.com/www.wonderwall.com/wp-content/uploads/sites/2/2016/08/104-188807_Actual.jpg?crop=0px%2C0px%2C3010px%2C1580px&resize=1200%2C630&ssl=1"}, "article": {"publisher": "https://facebook.com/Wonderwall", "published_time": "2018-02-14T19:46:00+00:00", "modified_time": "2021-04-29T08:28:11+00:00"}, "twitter": {"card": "summary_large_image", "image": "https://www.wonderwall.com/wp-content/uploads/sites/2/2016/08/104-188807_Actual.jpg?crop=0px,0px,3010px,1580px&resize=1200,630", "creator": "@Wonderwall", "site": "@Wonderwall", "label1": "Written by", "data1": "Wonderwall.com Editors"}, "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://www.wonderwall.com/wp-content/uploads/sites/2/2020/04/cropped-favicon-96x96-1-192x192-1.png?w=192"}, "movies": [], "publish_date": 1518637560.0, "source": "http://www.wonderwall.com", "summary": ""}