{"url": "www.usatoday.com/story/life/entertainthis/2017/11/01/nyc-terror-attack-lin-manuel-miranda-mariah-carey-more-celebs-send-love-city/820496001/", "text": "NYC terror attack: Lin-Manuel Miranda, Mariah Carey, more celebs send love to the city\n\nShow Caption Hide Caption At least 8 people dead after van plows into NYC bike path According to New York City mayor Bill de Blasio, at least 8 people have died and several others have been injured after a motorist drove a truck into a Lower Manhattan bike path. USA TODAY\n\nCelebrities are sending their love and support to New York on social media following a terror attack that left eight people dead Tuesday when a truck plowed down pedestrians on a bicycle path near the World Trade Center in Lower Manhattan.\n\nJosh Groban said he and he his dog were just half a block from the scene of the attack. \"Oh my god I just heard gun shots and ran with my dog. Downtown. (expletive),\" he wrote in a string of tweets.\n\nI hope everyone’s ok. Was half a block from me, didn’t see it but heard 8-10 quick rounds fired off. Be safe with your kids out there. — josh goblin 👹 (@joshgroban) October 31, 2017\n\nI’m shaking. That’s the corner I was supposed to have my coffee but my dog pulled me into the park half a block away 10 min before shooting. https://t.co/AvQeRv7Jha — josh goblin 👹 (@joshgroban) October 31, 2017\n\nDevastated for the victims and their families tonight & inspired by the spirit of this city. Sirens and trick or treaters everywhere. 💙🗽 — josh goblin 👹 (@joshgroban) October 31, 2017\n\nSam Smith took to Twitter to give his condolences, writing, \"New York. My heart is with you always and forever. Devastating news.\"\n\nNew York. My heart is with you always and forever. Devastating news. My soul and heart is with the victims and there loved ones x horrific — Sam Smith (@samsmithworld) October 31, 2017\n\nNew York natives Lin-Manuel Miranda, Mariah Carey and Barbra Streisand sent their love to the city, with Miranda writing, \"NY, I love you so much. You are strong and full of everyday heroes and I love you.\"\n\nNY, I love you so much.\n\nYou are strong and full of everyday heroes and I love you.\n\nWe'll get through today and tomorrow and the next one. — Lin-Manuel Miranda (@Lin_Manuel) November 1, 2017\n\nI ♥️NY — Mariah Carey (@MariahCarey) November 1, 2017\n\nNew York City... my hometown... you’re in my thoughts and prayers. Barbra. — Barbra Streisand (@BarbraStreisand) October 31, 2017\n\nLena Dunham asked her \"five borough friends\" to stay safe after the attack.\n\nJust landed in New York to the news heart 💔 Please stay safe out on the town tonight. Love to all my five borough friends. — 💎 Lena Dunham 💎 (@lenadunham) November 1, 2017\n\nBette Midler sent her \"deepest condolences\" to the families of the victims.\n\nTerror attack in NYC, not far from 9/11. Deepest condolences to the families of those murdered; and those involved who are scarred forever. — Bette Midler (@BetteMidler) November 1, 2017\n\nStranger Things star David Harbour called the incident \"unsettling.\"\n\nUnfolding tragedy in Manhattan today is awful, sad and unsettling. My love and strength to all my fellow New Yorkers. — David Harbour (@DavidKHarbour) October 31, 2017\n\nMore messages of love came from John Legend and Jane the Virgin star Gina Rodriguez.\n\nNew York. I love you. 💔 — Gina Rodriguez (@HereIsGina) October 31, 2017\n\nSending love to the people of New York. I will always ❤️ NY — John Legend (@johnlegend) October 31, 2017\n\nBilly Eichner recognized his high school in photos from the scene, tweeting out about the \"horrifying\" event and sending his love.\n\nThat's my high school in the picture. This is sad and horrifying. Sending love to everyone there. https://t.co/DWvZy5AdS1 — billy eichner (@billyeichner) October 31, 2017\n\nJosh Gad and Zoe Saldana sent their condolences to the people affected in Tuesday's attack, with Gad tweeting that he \"can't stomach this non-stop senseless hatred and violence.\"\n\nMy heart is broken. Sending prayers to all the victims who's lives were taken today in NYC — Zoe Saldana (@zoesaldana) October 31, 2017\n\nOh God. Just read about NYC attack. I can’t stomach this non-stop senseless hatred and violence. So sad for the city and all those affected. — Josh Gad (@joshgad) October 31, 2017\n\nNYC terror attack: What we know now about the truck attack in Manhattan", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/29906170001/29906170001_5631321273001_5631297870001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/-mm-/34c079fc422fe0ee478204cf92b482930b1d33f5/c=0-0-2558-1445/local/-/media/2017/11/01/USATODAY/USATODAY/636451266493911678-nycterror.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/34c079fc422fe0ee478204cf92b482930b1d33f5/c=0-0-2558-1445/local/-/media/2017/11/01/USATODAY/USATODAY/636451266493911678-nycterror.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Anika Reed"], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2017/11/01/nyc-terror-attack-lin-manuel-miranda-mariah-carey-more-celebs-send-love-city/820496001/", "title": "NYC terror attack: Celebrities react on social media", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/entertainthis/2017/11/01/nyc-terror-attack-lin-manuel-miranda-mariah-carey-more-celebs-send-love-city/820496001/life/entertainthis", "theme-color": "#ffffff", "og": {"type": "article", "title": "NYC terror attack: Lin-Manuel Miranda, Mariah Carey,\\u00a0more celebs send love to the city", "description": "Josh Groban, Sam Smith, Lin-Manuel Miranda, Mariah Carey, and more celebrities sent support and condolences in the wake of the NYC terror attack.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/34c079fc422fe0ee478204cf92b482930b1d33f5/c=0-0-2558-1445/local/-/media/2017/11/01/USATODAY/USATODAY/636451266493911678-nycterror.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Josh Groban, Sam Smith, Lin-Manuel Miranda, Mariah Carey, and more celebrities sent support and condolences in the wake of the NYC terror attack.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1509494400.0, "source": "http://www.usatoday.com", "summary": ""}