{"url": "jezebel.com/5557059/kristen-stewarts-gay-rumor-tila-tequilas-suicide-stunt", "text": "Is Kristen Stewart gay?\n\nAustralian model, MTV VJ and fashion designer Ruby Rose wrote on Twitter: \"I'm sorry, but Kristen Stewart has to be a lesbian. I don't mean to stereotype but isn't it obvious?'' Huh? Is it because she prefers Chucks and combat boots to frills and heels? Hmm. The weirdest thing about this is that something random Ruby Rose Tweeted as a \"joke\" became \"news\" on a \"news\" site. But you know what? That pic of KStew and RPatz that has been floating around the internets is positively post-coital. [News.com.au]\n\nSandra Bullock was \"radiant\" at the MTV Movie Awards, and told the crowd: \"No matter what you might have seen or heard or read lately, I love what I do. And I'm not going anywhere.\" And: \"One, I'm not dead. Two, everyone has cellulite, not just me. Paparazzi need more flattering lenses. And whoever established the high road and how high it should be should be fired.\" [ People\n\nwas \"radiant\" at the MTV Movie Awards, and told the crowd: \"No matter what you might have seen or heard or read lately, I love what I do. And I'm not going anywhere.\" And: \"One, I'm not dead. Two, everyone has cellulite, not just me. Paparazzi need more flattering lenses. And whoever established the high road and how high it should be should be fired.\" [ By the by: Sandra Bullock and Scarlett Johansson kissed on stage at the MTV Awards. [ AP NY Post\n\nand kissed on stage at the MTV Awards. [ The peeps from Spike TV used tiger cages to keep Sandra Bullock's entrance at the Guys Choice Awards a surprise. [ TMZ\n\nRush Limbaugh got married and Elton John was the wedding singer. [ LA Times\n\ngot married and was the wedding singer. [ Breaking: Rihanna has red hair. [ People\n\nhas red hair. [ OWN: The Oprah Winfrey Network is set to hit airwaves January 1, and is close to finalizing an ad deal with GM. Best possible scenario: You tune in and Oprah calls and says, \"You get a car!\" [ NY Post\n\nis set to hit airwaves January 1, and is close to finalizing an ad deal with GM. Best possible scenario: You tune in and Oprah calls and says, \"You get a car!\" [ Dear Lady Gaga : If you wear a metal-studded outfit and carry a metal-studded bag, of course you're going to get stopped at the airport. [ Daily Express\n\n: If you wear a metal-studded outfit and carry a metal-studded bag, of course you're going to get stopped at the airport. [ Ugh: Galen Hopper, Dennis Hopper 's 7-year-old daughter, \"didn't attend her father's funeral because her parents' divorce battle turned so ugly in the last six months before the actor's death that lawyers couldn't work out an agreement that would allow her to go.\" [ The Daily Beast\n\n's 7-year-old daughter, \"didn't attend her father's funeral because her parents' divorce battle turned so ugly in the last six months before the actor's death that lawyers couldn't work out an agreement that would allow her to go.\" [ \" Miley Cyrus 7-inch spike heels make her wobble but they can be equally empowering.\" [ NYDN\n\n7-inch spike heels make her wobble but they can be equally empowering.\" [ Miley Cyrus grabbed two of her dancers in a \"seductive\" move at her show in Madrid. [ Radar Online\n\ngrabbed two of her dancers in a \"seductive\" move at her show in Madrid. [ Lindsay Lohan wore an overly long glittery jumpsuit with a plunging neckline to the MTV Movie Awards last night — which hid her SCRAM anklet. She recently Tweeted: \"Can CHANEL please help me out by getting me some stickers to put on my scram bracelet so that i can at least wear a chic dress?! maybe!?\" Girl, we all know you have it. Why try to hide it? [ US Magazine\n\nwore an overly long glittery jumpsuit with a plunging neckline to the MTV Movie Awards last night — which hid her SCRAM anklet. She recently Tweeted: \"Can CHANEL please help me out by getting me some stickers to put on my scram bracelet so that i can at least wear a chic dress?! maybe!?\" Girl, we all know you have it. Why try to hide it? [ In case you missed it: Tom Cruise , dressed as Les Grossman, dancing with Jennifer Lopez at the MTV awards. [ Radar Online\n\n, dressed as Les Grossman, dancing with at the MTV awards. [ Jennifer Lopez and Marc Anthony renewed their vows on Saturday, and the color scheme for the party was black, chocolate brown and white. [ Us Magazine\n\nand renewed their vows on Saturday, and the color scheme for the party was black, chocolate brown and white. [ Really? Someone is trying to sell pictures of Gary Coleman hooked up to a ventilation machine — as well of a picture of Gary after he died. [ TMZ\n\nhooked up to a ventilation machine — as well of a picture of Gary after he died. [ Gary Coleman 's ex-wife is asking for up to $50,000 for a sit-down interview. [ Radar Online\n\n's ex-wife is asking for up to $50,000 for a sit-down interview. [ Britney Spears is still under her father's conservatorship, and a child custody expert is now on the case. The expert will prepare quarterly reports on Brit — the first one is due September. It's a \"step in the process\" for Britney to go through before the conservatorship ends. [ Radar Online\n\nis still under her father's conservatorship, and a child custody expert is now on the case. The expert will prepare quarterly reports on Brit — the first one is due September. It's a \"step in the process\" for Britney to go through before the conservatorship ends. [ Interesting: Snooki and The Situation will be presenters at the CMT Music Awards in Nashville on Wednesday. [ Page Six\n\nand will be presenters at the CMT Music Awards in Nashville on Wednesday. [ Tila Tequila claims that she has multiple personalities, and the one named Jane tried to kill her on Friday night by smashing and breaking everything in her room and then using glass shards to slice up her wrists and arms. Here's the thing: If what she says is true, that's super scary. And if she is making it up for publicity, that's super scary. [ Radar Online\n\nclaims that she has multiple personalities, and the one named Jane tried to kill her on Friday night by smashing and breaking everything in her room and then using glass shards to slice up her wrists and arms. Here's the thing: If what she says is true, that's super scary. And if she is making it up for publicity, that's super scary. [ \"Up to 70 police, paramedics and fire rescue personnel were involved in a frantic search for Tila Tequila over the weekend, after the former reality TV star posted a video on her website of her bloody arm — supposedly sliced at the wrist.\" The LAPD is pissed about the stunt and gave Tila a warning. [ Radar Online\n\nover the weekend, after the former reality TV star posted a video on her website of her bloody arm — supposedly sliced at the wrist.\" The LAPD is pissed about the stunt and gave Tila a warning. [ A car registered to Kanye West smashed into a house in Honolulu on Saturday, but Kanye was not involved; the car had been reported stolen. (Yeezy has been living in Hawaii working on music, btw.) [ TMZ\n\nsmashed into a house in Honolulu on Saturday, but Kanye was not involved; the car had been reported stolen. (Yeezy has been living in Hawaii working on music, btw.) [ Was the lease for the the house Heidi Montag and Jen Bunney are living in signed for by a reality show producer? [ TMZ\n\nand are living in signed for by a reality show producer? [ The item at the link informs us that Justin Long likes going down on women. Drew Barrymore is dating a cunning linguist! [ New York Mag\n\nlikes going down on women. is dating a cunning linguist! [ Jane Lynch 's wife, clinical psychologist Dr. Lara Embry, says that when she first met Sue Sylvester at a fundraiser, \"I said, 'I want my picture taken with her.' I thought she was cute.\" [ People\n\n's wife, clinical psychologist Dr. Lara Embry, says that when she first met Sue Sylvester at a fundraiser, \"I said, 'I want my picture taken with her.' I thought she was cute.\" [ At the link: Secrets from the Glee finale on Tuesday. [ NY Post\n\nfinale on Tuesday. [ Charlie Sheen will work in a theater as part of his jail sentence; he is eligible for work release. [ Daily Express\n\nwill work in a theater as part of his jail sentence; he is eligible for work release. [ Charlie Sheen 's work release begins Tuesday. [ TMZ\n\n's work release begins Tuesday. [ Julia Stiles is in a Neil LaBute play, and says using filthy language \"definitely helped me get over my prudishness.\" [ Gatecrasher\n\nis in a Neil LaBute play, and says using filthy language \"definitely helped me get over my prudishness.\" [ What Michael Jackson 's dad, 80-year-old Joe Jackson , eats for breakfast: One pancake, two eggs, summer sausage and sugar-free syrup. And two strips of bacon. [ Page Six\n\n's dad, 80-year-old , eats for breakfast: One pancake, two eggs, summer sausage and sugar-free syrup. And two strips of bacon. [ Of course Simon Cowell is planning a World's Got Talent show. He's an evil genius! [ NY Post\n\nis planning a World's Got Talent show. He's an evil genius! [ A day in the life of the Parks And Recreation writers. [ Reuters\n\nwriters. [ Behold Coolio 's new tattoo, which is misspelled. [ TMZ\n\n's new tattoo, which is misspelled. [ Jason Wahler was busted for assault over the weekend. A woman who is not his girlfriend claims he hit her during an argument. [ TMZ\n\nwas busted for assault over the weekend. A woman who is not his girlfriend claims he hit her during an argument. [ Nice: Don Cheadle is now a spokesman for the United Nations environment program. [ AP\n\nis now a spokesman for the United Nations environment program. [ Sex And The City 2 is number one in France and Australia and the no. 1 flick on the international market. Le sigh. [ The Wrap\n\nis number one in France and Australia and the no. 1 flick on the international market. Le sigh. [ Someone put on some kind of indelible lipstick and kissed the marble at Clark Gable 's grave and \"the stain is so bad, Forest Lawn had to dispatch their in-house marble repair team to fix the damage.\" [ TMZ\n\n's grave and \"the stain is so bad, Forest Lawn had to dispatch their in-house marble repair team to fix the damage.\" [ \" Brenda Hamilton , who is an understudy in the Broadway show Wicked , said she had been taking [birth control drug] Yasmin for a little more than two years when she suffered the terrifying stroke in May 2007.\" [ NYPost\n\n, who is an understudy in the Broadway show , said she had been taking [birth control drug] Yasmin for a little more than two years when she suffered the terrifying stroke in May 2007.\" [ From a lengthy piece about Richard Burton and Liz Taylor : \"While sober, Richard lost all desire to make love. This was a great concern to a legendary lover like Richard, and frustrating to Elizabeth, who complained to her close friend, Norma Heyman, when she visited: '[He] hasn't fucked me for weeks!'\" [ Daily Mail\n\nand : \"While sober, Richard lost all desire to make love. This was a great concern to a legendary lover like Richard, and frustrating to Elizabeth, who complained to her close friend, Norma Heyman, when she visited: '[He] hasn't fucked me for weeks!'\" [ \"They offered me a cameo role but I turned it down because I knew what was coming. People die in the film and there's plenty of sex but when we did it no one got hurt and it was all played for fun and family entertainment. These seem to be elements nobody is interested in any more. It was too graphic for me. I've no doubt it will do big business at the box office but it's nothing like the show we turned out every week.\" — Mr. T on the A-Team movie. [ Daily Express\n\non the A-Team movie. [ \"I don't see any trends out there that aren't good or interesting. These are good times. I can live with cupcakes. I buy cupcakes. My daughter loves cupcakes. It's not the cupcakes I have a problem with - it's cupcake mania. It's only a fucking cupcake. And I have a secret guilty pleasure: red velvet cupcakes. I do like those. Red velvet anything. If there was a red velvet mini-cupcake truck outside my house I'd be sneaking there with a bag over my head. Nothing's more delicious than hypocrisy.\" — Anthony Bourdain . [ NY Post\n\n. [ \"I really don't think they appreciate her. I don't think they understand the value of who she is as a human being and what she's done. I'm just saying from an insider's point of view that I don't think she gets her just due based on who she really is and what she's done for the Chicagoland area. It's home for her, and it's just natural for people to kind of take her for granted — until you leave… A prophet has no honor in its own town.\" — Stedman Graham , on Oprah. [ UPI\n\n, on Oprah. [ \"The part that pops into my mind is the fighting I have to do to protect the patients that go on a reality television show. I have to fight to protect that their care is good and that nothing happens to them. Because television doesn't care about anything except getting eyes. Which is great and I understand that, and I have to capitulate to that because nobody learns anything if nobody watches. But I'm the one that's responsible to make sure that people get good care.\" — Dr. Drew Pinsky , at a reality show roundtable. [ Reuters\n\n, at a reality show roundtable. [ \"I do a lot of crazy shows, but every single cast member and their family has my direct cell phone. When someone has a particularly difficult episode [about to air], I always call and say, 'This is what's coming up; you know what happened that night. It's going down just like it did. I probably wouldn't watch this episode with your grandmother.' I do care about Snooki! You can look at my cell phone right now. I've got Papa Snooki, Mama Snooki. All of them.\" — SallyAnn Salsano , producer of Jersey Shore, as well as many other shows, including More to Love, Dance Your Ass Offand A Shot at Love with Tila Tequila. [ Reuters\n\n, producer of Jersey Shore, as well as many other shows, including More to Love, Dance Your Ass Offand A Shot at Love with Tila Tequila. [ \"It's going to be indulgent, right? Everyone's going to be topless, the bride, the groom, that's me, our parents, all topless. It will be a festival of decadence. The first thing we're going to do is slaughter a swan. That's to the god Zeus. Our wedding is essentially going to be a recreation of the greatest moments in mythological history.\" — Russell Brand , on his upcoming nuptials with Katy Perry. [ Money Times\n\n, on his upcoming nuptials with Katy Perry. [ \"And I'd name it Snoop.\" — Snoop Dogg wants to get Russell Brand and Katy Perry a dog as a wedding gift. [ LA Times\n\nwants to get Russell Brand and Katy Perry a dog as a wedding gift. [ \"I'm a bit superstitious about certain things, like what shoes to wear. If I wear the wrong shoes, the whole day may go wrong.\" — Rachel Weisz . [ Showbiz Spy\n\n. [ \"I don't buy into it at all. I'd advise you to not either.\" — The Hills' Lo Bosworth, on Heidi and Spencer's split. [ LA Times", "images": ["https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/f5zr3vuc90hrpnmx0nme.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/kqnkjlylkf7tymsqmoqr.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/52a29fe0001de9a08e76ea6d559528e9.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/u0939doeuioaqhspkjyc.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/j59upeyynundqjvbmcwj.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/aqhdzcldymb9mkltfhxh.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/rnxqtvv6advgidzfs6am.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/f2b6295902a8e0a7c4d168840e7b3d51.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/eti2h1r4wg0bqxctxenl.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/muaaluj2wznfomol9ero.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/no63bw902mddhwxtjtxh.png"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png", "keywords": [], "authors": [], "canonical_link": "https://jezebel.com/kristen-stewarts-gay-rumor-tila-tequilas-suicide-stunt-5557059", "title": "Kristen Stewart's Gay Rumor; Tila Tequila's Suicide Stunt", "meta_data": {"google-site-verification": "QDPLbDJXTQNT0n69mvNADCeRmwnbkYyL20OKJAVCKq8", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW, NOIMAGEINDEX", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/muaaluj2wznfomol9ero.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/muaaluj2wznfomol9ero.png", "keywords": "Dirt Bag, Kristen stewart lesbian, Kristen Stewart, Gay, Gettypic, ruby rose, Sandra Bullock, tila tequila, Scarlett Johansson, Rush Limbaugh, Elton John, rihanna, Own the oprah winfrey network, Dennis Hopper, Miley Cyrus, Lindsay Lohan, Jennifer Lopez, Marc Anthony, lady gaga, Gary Coleman, Britney Spears, Snooki, the situation, Kanye West, Heidi Montag, spencer pratt, Jen Bunney, justin long, Drew Barrymore, Jane Lynch, Jezebel", "news_keywords": "Dirt Bag, Kristen stewart lesbian, Kristen Stewart, Gay, Gettypic, ruby rose, Sandra Bullock, tila tequila, Scarlett Johansson, Rush Limbaugh, Elton John, rihanna, Own the oprah winfrey network, Dennis Hopper, Miley Cyrus, Lindsay Lohan, Jennifer Lopez, Marc Anthony, lady gaga, Gary Coleman, Britney Spears, Snooki, the situation, Kanye West, Heidi Montag, spencer pratt, Jen Bunney, justin long, Drew Barrymore, Jane Lynch, Jezebel", "twitter": {"url": "https://jezebel.com/kristen-stewarts-gay-rumor-tila-tequilas-suicide-stunt-5557059", "card": "summary_large_image", "site": "jezebel", "title": "Kristen Stewart's Gay Rumor; Tila Tequila's Suicide Stunt", "description": "Is Kristen Stewart gay?", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png"}, "article": {"published_time": "2010-06-07T13:00:00.793Z", "modified_time": "2013-06-20T07:09:46.450Z"}, "description": "Is Kristen Stewart gay?", "og": {"title": "Kristen Stewart's Gay Rumor; Tila Tequila's Suicide Stunt", "type": "article", "url": "https://jezebel.com/kristen-stewarts-gay-rumor-tila-tequilas-suicide-stunt-5557059", "description": "Is Kristen Stewart gay?", "locale": "en_US", "site_name": "Jezebel", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png"}, "fb": {"app_id": 40338819712}}, "movies": [], "publish_date": 1275915600.793, "source": "http://jezebel.com", "summary": ""}