{"url": "https://www.billboard.com/articles/events/women-in-music/8054855/billboard-women-in-2017-what-you-didnt-see-on-twitter", "text": "Billboard Women in Music 2017 event brought some of the music industry’s most powerful executives and artists under one roof. The event, which was live-streamed on Twitter, featured knockout performances from Camila Cabello, Grace Vanderwaal, Kehlani and Kelly Clarkson, as well as appearances from a host of musicians including Mary J. Blige, Tori Kelly, Betty Who, Solange and, of course, Woman of the Year nominee Selena Gomez.\n\nBut as viewers watched from home, there were plenty of things going on behind the scenes that they have missed out on.\n\n– As artists filed onto the magenta carpet, Kehlani, in a shimmering silver ensemble, greeted Ciara as she walked by, bowing her hands down to the “1, 2 Step” singer and then walking away — right after fanning her hands towards her face and stating, “I’m so hot!”\n\n– Before the event began, Diplo posed in the photo area ahead of the event, during which he introduced Cabello’s performance. But they had a run-in prior to the Cabello taking the stage, as the former Fifth Harmony singer squealed in delight when she saw him backstage and gave the Major Lazer producer a hug.\n\n– While the evening was about honoring career accomplishments, it was also an opportunity for the women to compare style notes. Honorees Jody Gerson, chairman/CEO Universal Music Group Publishing, and Capitol Music Group COO Michelle Jubelirer discussed how long they could go between bang trims with Interscope senior VP of Strategic Development Erika Savage (named one of Women In Music’s 5 of the Rise), and past honoree, Harvest Records and Caroline GM Jacqueline Saturn. The consensus? Every two weeks.\n\n– Diane Warren is already deep into awards season, with the legendary songwriter penning two songs up for Oscar consideration: “Stand Up for Something” from Marshall and “Prayers For This World” from Cries from Syria. (Of the two, Warren likes her chances better with “Stand Up for Something.”) Should either song receive a nod, it will be Warren’s ninth Oscar nomination for best song.\n\n– Powerhouse Award recipient Kelly Clarkson was typically humble—and hilarious—about receiving the honor. Talking to Billboard at the start of the ceremony, Clarkson, who was there with husband Brandon, joked that all her friends were calling her about the award. “They’re saying, ‘Are you sure there wasn’t a mistake?'”\n\n– Clarkson was on hand in the photo area as the audience was taking its seats, with music from the night’s honorees blaring through the sound system. “Love So Soft,” her Grammy-nominated new single, was one of them, and Clarkson didn’t waste an opportunity to sing along to the chorus, snapping her fingers as she maneuvered backstage.\n\n– As Cabello delivered a stripped-down rendition of her hit “Havana,” in the crowd, Mary J. Blige clapped and swayed along to the track, which currently sits at No. 2 on the Billboard Hot 100.\n\n– As Taraji P. Henson sang Mary J. Blige’s praises while introducing her Icon Award, pop singer Betty Who slipped into to the audience a bit late, but in sharp style.\n\n– Backstage, Blige was doing press after accepting her award as Solange and her entourage walked by. “Hey Solange, you look beautiful!” said Blige with a laugh. Later, before Solange returned to her seat after receiving the American Express Impact Award, she stooped down to hug and congratulate Blige. Blige was in high demand: as soon as the evening concluded, she and Pharrell Williams shared a warm embrace as they caught up.\n\n– Woman of the Year honoree Selena Gomez gathered her friends Elle Fanning and actress Francia Raisa — who had just presented her with the award — backstage in the photo area, posing for shots with one another.\n\n– Williams also spends a few minutes hugging, chatting and posing for photos with two other WIM honorees: Kehlani and Solange.\n\n– After the show wrapped, some of the evening’s stars stuck around for photo opps. Ciara was spotted on the step and repeat posing in her flowing gown, while inside, Kehlani wrangled her team to smile for the camera.", "images": ["https://www.billboard.com/wp-content/uploads/media/camila-cabello-selfie-bb-wim-red-carpet-2017-billboard-1548.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif"], "top_img": "https://www.billboard.com/wp-content/uploads/media/camila-cabello-selfie-bb-wim-red-carpet-2017-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Billboard Staff"], "canonical_link": "https://www.billboard.com/music/awards/billboard-women-in-2017-what-you-didnt-see-on-twitter-8054855/", "title": "The 12 Things You Didn’t See on Twitter at Billboard Women in Music 2017", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "Kelly Clarkson, Selena Gomez and Camila Cabello are just a few of the honorees on hand for the annual event.", "news_keywords": "Women in Music", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 8054855, "author": "Billboard Staff", "pmc-category": "Awards,Music", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-12-01T11:44:56"}, "pmc-tag": "Women in Music", "title": "The 12 Things You Didn’t See on Twitter at Billboard Women in Music 2017", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Billboard Staff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 8054855, "title": "The 12 Things You Didn't See on Twitter at Billboard Women in Music 2017", "published_at": "2017-12-01 11:44:56", "image": "https://www.billboard.com/wp-content/uploads/media/camila-cabello-selfie-bb-wim-red-carpet-2017-billboard-1548.jpg?w=1024", "comment_count": 0, "tags": "Women in Music", "topics": "Music", "body": "Billboard Women in Music 2017 event brought some of the music industry's most powerful executives and artists under one roof. The event, which was live-streamed on Twitter, featured knockout performances from Camila Cabello, Grace Vanderwaal, Kehlani and Kelly Clarkson, as well as appearances from a host of musicians including Mary J. Blige, Tori Kelly, Betty Who, Solange and, of course, Woman of the Year nominee Selena Gomez.But as viewers watched from home, there were plenty of things going on behind the scenes that they have missed out on.- As artists filed onto the magenta carpet, Kehlani, in a shimmering silver ensemble, greeted Ciara as she walked by, bowing her hands down to the \"1, 2 Step\" singer and then walking away — right after fanning her hands towards her face and stating, \"I'm so hot!\"- Before the event began, Diplo posed in the photo area ahead of the event, during which he introduced Cabello's performance. But they had a run-in prior to the Cabello taking the stage, as the former Fifth Harmony singer squealed in delight when she saw him backstage and gave the Major Lazer producer a hug.- While the evening was about honoring career accomplishments, it was also an opportunity for the women to compare style notes. Honorees Jody Gerson, chairman/CEO Universal Music Group Publishing, and Capitol Music Group COO Michelle Jubelirer discussed how long they could go between bang trims with Interscope senior VP of Strategic Development Erika Savage (named one of Women In Music's 5 of the Rise), and past honoree, Harvest Records and Caroline GM Jacqueline Saturn. The consensus? Every two weeks.- Diane Warren is already deep into awards season, with the legendary songwriter penning two songs up for Oscar consideration: \"Stand Up for Something\" from Marshall and \"Prayers For This World\" from Cries from Syria. (Of the two, Warren likes her chances better with \"Stand Up for Something.\") Should either song receive a nod, it will be Warren's ninth Oscar nomination for best song.- Powerhouse Award recipient Kelly Clarkson was typically humble—and hilarious—about receiving the honor. Talking to Billboard at the start of the ceremony, Clarkson, who was there with husband Brandon, joked that all her friends were calling her about the award. \"They're saying, 'Are you sure there wasn't a mistake?'\"- Clarkson was on hand in the photo area as the audience was taking its seats, with music from the night's honorees blaring through the sound system. \"Love So Soft,\" her Grammy-nominated new single, was one of them, and Clarkson didn't waste an opportunity to sing along to the chorus, snapping her fingers as she maneuvered backstage.- As Cabello delivered a stripped-down rendition of her hit \"Havana,\" in the crowd, Mary J. Blige clapped and swayed along to the track, which currently sits at No. 2 on the Billboard Hot 100.- As Taraji P. Henson sang Mary J. Blige's praises while introducing her Icon Award, pop singer Betty Who slipped into to the audience a bit late, but in sharp style.- Backstage, Blige was doing press after accepting her award as Solange and her entourage walked by. \"Hey Solange, you look beautiful!\" said Blige with a laugh. Later, before Solange returned to her seat after receiving the American Express Impact Award, she stooped down to hug and congratulate Blige. Blige was in high demand: as soon as the evening concluded, she and Pharrell Williams shared a warm embrace as they caught up.- Woman of the Year honoree Selena Gomez gathered her friends Elle Fanning and actress Francia Raisa -- who had just presented her with the award -- backstage in the photo area, posing for shots with one another.- Williams also spends a few minutes hugging, chatting and posing for photos with two other WIM honorees: Kehlani and Solange.- After the show wrapped, some of the evening's stars stuck around for photo opps. Ciara was spotted on the step and repeat posing in her flowing gown, while inside, Kehlani wrangled her team to smile for the camera.", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "The 12 Things You Didn’t See on Twitter at Billboard Women in Music 2017", "url": "https://www.billboard.com/music/awards/billboard-women-in-2017-what-you-didnt-see-on-twitter-8054855/", "description": "Kelly Clarkson, Selena Gomez and Camila Cabello are just a few of the honorees on hand for the annual event.", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/camila-cabello-selfie-bb-wim-red-carpet-2017-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Camila Cabello, 2017"}, "locale": "en_US"}, "article": {"published_time": "2017-12-01T16:44:56+00:00", "modified_time": "2017-12-01T18:08:20+00:00"}, "twitter": {"site": "@billboard", "creator": "@billboard", "card": "summary_large_image", "title": "The 12 Things You Didn’t See on Twitter at Billboard Women in Music 2017", "description": "Kelly Clarkson, Selena Gomez and Camila Cabello are just a few of the honorees on hand for the annual event.", "image": "https://www.billboard.com/wp-content/uploads/media/camila-cabello-selfie-bb-wim-red-carpet-2017-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1512146696.0, "source": "https://www.billboard.com", "summary": ""}