{"url": "https://en.wikipedia.org/wiki/List_of_Twin_Peaks_episodes", "text": "No.\n\noverall No. in\n\nseason Title Directed by Written by Original air date U.S. viewers\n\n(millions)\n\n9 1 \"Episode 8\"[b]\n\n\"May the Giant Be with You\" David Lynch Story by : Mark Frost & David Lynch\n\nTeleplay by : Mark Frost September 30, 1990 ( ) 19.1[21]\n\nAs Cooper lies bleeding from his wound, he has a vision of a senile waiter and a mysterious giant who gives him several clues, notably that three people have seen Laura's killer, but none have seen his body. In the fire's aftermath, Shelly and Catherine's husband Pete Martell recover from smoke inhalation, while Catherine is missing and Josie has fled to avoid suspicion. Leo, having survived his shooting, recovers under police guard. Albert returns to Twin Peaks to investigate Cooper's shooting, but Cooper returns to work quickly and realizes that Leo could not have been the killer as he was in jail when the previous victim of the same killer was murdered. In the hospital, Jacoby recalls smelling scorched engine oil at the same time Jacques was killed. Overnight, Leland's hair has turned completely white, while Maddy is horrified when a nightmare she had of seeing the carpet covered in blood miraculously comes true. Realizing neither Leo nor Jacques could have been the killer, Cooper and the police theorize that a third man must have been involved. Audrey finds herself hopelessly out of her depth at One Eyed Jacks. Still comatose, Ronette has a horrifying vision of BOB killing Laura.\n\n10 2 \"Episode 9\"\n\n\"Coma\" David Lynch Harley Peyton October 6, 1990 ( ) 14.4[22]\n\nAlbert reveals that Cooper's insane former partner, Windom Earle, has escaped from a mental hospital. Donna takes Laura's place as a Meals on Wheels volunteer to investigate potential suspects, leading to an eerie encounter with the bedridden Mrs. Tremond and her grandson, who Tremond claims is studying magic. Tremond complains about the presence of creamed corn on her plate, and when Donna looks away the creamed corn miraculously appears in Tremond's grandson's hands. Ronette awakens from her coma and with horror identifies BOB as her attacker. Andy discovers he is infertile and concludes Lucy must have had an affair. Leland recognizes a wanted poster for BOB as a man who lived near his grandfather's house when he was a child. With Leo in a vegetative state, Bobby schemes for Shelly to continue to care for Leo so that she can collect disability payments and she and Bobby can live together. Bobby's father, Major Garland Briggs, who works for the U.S. Army monitoring deep space probes, passes on a mysterious message for Cooper from the probes: \"The owls are not what they seem\". Maddy has a horrifying vision of BOB. Blackie discovers Audrey's deception and restrains her.\n\nCooper discovers a piece of paper bearing the letter \"B\" under Ronette’s fingernail, matching the \"R\" under Laura's fingernail and the \"T\" under Teresa Banks, the previous victim of the same killer. Donna meets Harold Smith, an agoraphobiac and one of Laura's Meals on Wheels deliverees. Leland reveals BOB's real name is Robertson, a man who lived near his childhood summer house who used to flick matches at him and ask \"You want to play with fire, little boy?\". Cooper realizes the letters are attempting to spell \"Robertson\". Blackie drugs Audrey into a comatose state. Jacques's older brother Jean Renault schemes to use her to lure Cooper to One Eyed Jacks to kill him and avenge Jacques. Shelly refuses to testify about Leo's involvement in the mill fire, leading Cooper to suspect her disability scheme. Gerard, selling Truman shoes, sees the poster of BOB and is overcome with lightheadedness. Realizing James and Maddy are falling for each other, Donna laments at Laura's grave that things are more complicated with her dead. In a trance state, Jacoby identifies Leland as Jacques's killer, leading Truman to arrest Leland. Donna discovers a secret diary of Laura's hidden at Harold’s house.\n\n12 4 \"Episode 11\"\n\n\"Laura's Secret Diary\" Todd Holland Jerry Stahl and Mark Frost & Harley Peyton & Robert Engels October 20, 1990 ( ) 12.8[24]\n\nLeland confesses to murdering Jacques. Rumor spreads that a food critic going by the pseudonym \"M.T. Wentz\" will be visiting Twin Peaks, much to the excitement of Hank, who is working at the Double R with Norma and believes that a positive review could bring new business to the diner. Jean blackmails Ben with a videotape of Audrey being held captive, demanding $125,000 for her return with Cooper as the drop-off man. Harold reads excerpts from Laura's diary to Donna, but refuses to give it to her, claiming it holds no evidence to her murder. Josie returns, having been shopping in Seattle, and Pete tells her that Catherine is presumed dead. Lucy reveals to Andy that she had an affair with Dick Tremayne, a pretentious men's fashion salesman, who could potentially be the father of her child and who has offered her money for an abortion. Although jealous over James's attraction to her, Donna enlists Maddy's help in retrieving Laura's diary. Josie introduces Pete to Jonathan, who she claims to be her cousin. Once Pete leaves, Jonathan tells Josie it is time for her to return to Hong Kong. Later, Jonathan roughs up and threatens Hank at the Double R.\n\nCooper finds Audrey's note and realizes that she has gone to One Eyed Jacks. Hawk discovers that the house Leland claimed to be occupied by BOB is owned by two retired schoolteachers who have no knowledge of BOB. As Leland's court hearing begins, Judge Clinton Sternwood releases him on bail and deems Leo incompetent to stand trial. Sternwood advises Cooper to keep his eyes on the woods. Following a suicide attempt, Ed's unstable wife Nadine Hurley mentally reverts to a teenager, believing herself to be a high school student, and demonstrates unnatural strength which she seems unaware of. A Japanese businessman, Mr. Tojamura, offers Ben five million dollars for the Ghostwood Development Project (on the site of the sawmill). Ben tasks Cooper with delivering Audrey’s ransom money. Andy discovers that his sperm count has miraculously recovered, meaning that he could be the father of Lucy’s child, but realizes with horror that she has gone to an abortion clinic. Realizing that Jean plans to kill him, Cooper and Truman plan to raid One Eyed Jacks. They rescue Audrey and Blackie is killed, but Jean manages to escape. Maddy and Donna attempt to steal Laura’s diary but are caught by Harold.\n\n14 6 \"Episode 13\"\n\n\"Demons\" Lesli Linka Glatter Harley Peyton & Robert Engels November 3, 1990 ( ) 11.3[26]\n\nJames rescues Maddy and Donna, who fail to take Laura's diary. Discerning that Audrey has received a near-lethal dose of heroin, Cooper and Truman identify Jean as a major Canadian drug trafficker. Cooper returns the ransom money to Ben, whose affection is rebuffed by Audrey. Shelly and Bobby discover that Leo's disability payment is substantially smaller than they expected. FBI Regional Bureau Chief Gordon Cole, Cooper's hard-of-hearing supervisor, arrives in Twin Peaks, revealing that a material found outside Cooper's room following his shooting was from a vicuña coat, that a drug taken by Gerard is a unique and unidentified substance, and that papers found near the crime scene were from a diary. Gordon warns Cooper not to get in over his head, referring to a previous incident in Pittsburgh, and delivers an anonymous message: an opening chess move, which Cooper believes is from Earle. Cooper and Truman interrogate Gerard, who has a seizure and is possessed by MIKE, who claims to be BOB’s former partner and recites a poem: Through the darkness of future past, the magician longs to see, one chants out between two worlds, fire walk with me. MIKE reveals that BOB is hiding at the Great Northern.\n\n15 7 \"Episode 14\"\n\n\"Lonely Souls\" David Lynch Mark Frost November 10, 1990 ( ) 17.2[27]\n\nHawk investigates Harold after Donna reveals he has Laura's diary, but discovers he has hanged himself, leaving a suicide note reading \"J'ai une âme solitaire\" (French for \"I have a lonely soul\"). Maddy tells Leland and Sarah she is returning home. Bobby discovers a hidden cassette tape in the heel of Leo’s boots. Audrey confronts Ben, revealing that she knows he owns One Eyed Jacks, and Ben admits that he slept with and loved Laura. The pages from Laura’s diary are reconstructed, revealing Laura was molested and abused by BOB and that she planned to \"tell the world about Ben Horne\". After Audrey reveals her information about Ben, Cooper and Truman arrest him. The Log Lady tells Cooper there are owls at a local bar called the Roadhouse. Going to the Roadhouse, Cooper has a vision of the giant telling him \"It is happening again.\" At the Palmer house, Leland smiles at himself in the mirror and his reflection is that of BOB. Possessed by BOB, he drugs Sarah and murders Maddy, placing a letter under her fingernail. At the Roadhouse, Donna, Bobby, James, and Cooper all sense that something has happened and are visibly distressed. Cooper is comforted by the senile waiter, who tells him \"I'm so sorry...\"\n\n16 8 \"Episode 15\"\n\n\"Drive with a Dead Girl\" Caleb Deschanel Scott Frost November 17, 1990 ( ) 13.3[28]\n\nJames and Donna visit the Palmer house to say goodbye to Maddy, but a jovial Leland tells them she has already left. When he adjusts his tie in the mirror, the face of BOB stares back at him. Jerry, revealed to be a disreputable lawyer, prepares Ben’s defense. Ben insists he was with Catherine the night of Laura’s murder, which Jerry realizes is a poor alibi given that Catherine is presumed dead. Having crammed Maddy’s corpse into his golf bag, Leland drives around town in an eerily good mood. When Truman informs him that Ben has been arrested, Leland feigns shock, but secretly smiles darkly. Later, he is pulled over by Truman and Cooper for reckless driving and prepares to kill them with a golf club when they almost discover Maddy, but they are called away at the last minute. Bobby discovers that Leo’s hidden tape contains evidence of Ben’s involvement in the sawmill fire. Catherine, revealed to have survived and in disguise as Tojamura, delivers a cassette tape to Ben, blackmailing him by offering to confirm his alibi in exchange for Ghostwood. Leland stashes Maddy’s corpse in the woods, where it is later discovered by Truman and Cooper.\n\n17 9 \"Episode 16\"\n\n\"Arbitrary Law\" Tim Hunter Mark Frost & Harley Peyton & Robert Engels December 1, 1990 ( ) 12.4[29]\n\nCooper asks Truman not to report Maddy’s death yet, believing he is the verge of solving the case. Revealing that Mrs. Tremond’s grandson had said \"J'ai une âme solitaire\" to her, Donna decides to visit to Mrs. Tremond with Cooper and Andy. They find a woman claiming to be Mrs. Tremond, despite being decades younger and having no children. \"Mrs. Tremond\" gives Donna an envelope containing a page from Laura’s diary, revealing Laura shared Cooper’s red room dream. Leland is agitated when he sees Donna wearing Laura’s sunglasses and receives a call from Maddy’s mother who reports her missing. Leland poises to attack Donna, but is distracted by Truman, who reports there has been another murder. Donna realizes with despair that Maddy is dead and tells James, who leaves town on his motorcycle in exile. Following his instincts, Cooper brings Ben, Leland, Ed, and Major Briggs to the Roadhouse. The giant and the waiter appear, and Cooper recalls what Laura whispered in his dream: \"My father killed me\". Cooper and Truman arrest Leland, and BOB taunts them. BOB leaves Leland’s body, leaving Leland horrified by his actions. Cooper holds Leland as he dies. Truman speculates that BOB has escaped.\n\nCooper tells a distraught Sarah that Leland was a victim of dark forces and was not responsible for his crimes. Donna tells Ed that James blames himself for everything that has happened. Twin Peaks's mayor, Dwayne Milford, feuds with his brother, newspaper publisher Dougie Milford, over Dougie marrying a young woman, Lana Budding. With Nadine still believing herself to be a teenager, Jacoby persuades the high school administration to admit her as a student. Bobby plans to blackmail Ben using Leo’s tape to provide for him and Shelly. Catherine tells Truman that her life was saved after the fire by an angel. With the murder solved, Cooper prepares to leave Twin Peaks, but FBI agent Roger Hardy arrives and informs him that he has been suspended for his illegal raid on One Eyed Jacks, while an RCMP officer angrily reveals that cocaine is missing from Jacks, prompting the DEA to become involved. Ernie is hired by Jean to raise $125,000 by selling cocaine, while the RCMP officer plots to plant cocaine on Cooper’s car. On a camping trip with Cooper, Major Briggs begins talking about a mysterious \"White Lodge\", before a bright light flashes and Major Briggs vanishes.\n\n19 11 \"Episode 18\"\n\n\"Masked Ball\" Duwayne Dunham Barry Pullman December 15, 1990 ( ) 12.1[31]\n\nGordon warns Cooper that the DEA is sending Denise Bryson, a friend of Cooper's, to investigate the missing cocaine. Cooper maintains his innocence, insisting he must \"focus out beyond the edge of the board\". Riding his motorcycle on the open road, James meets a woman named Evelyn Marsh at a bar. She hires him to fix her husband's car. Trying to impress Lucy, Dick and Andy mentor an orphan named Nicky Needleman. Hawk reveals that the White Lodge is a mythical place where spirits reside, and that those traveling there must first pass through its counterpart, the Black Lodge, where the souls of those with imperfect courage will be annihilated by their shadow selves. Denise arrives in Twin Peaks and starts her investigation. Josie reveals to Truman that she worked for a man in Hong Kong named Thomas Eckhardt who she believes to be responsible for her husband's death, and that Eckhardt wants her back. Cooper receives a letter from Earle, containing a chess move and cassette tape saying, \"the king must die\". Andrew Packard, Josie's husband, is revealed to be alive and scheming with Catherine to use Josie as bait for Eckhardt.\n\n20 12 \"Episode 19\"\n\n\"The Black Widow\" Caleb Deschanel Harley Peyton & Robert Engels January 12, 1991 ( ) 10.3[32]\n\nIn an erratic mental state, Ben hires Bobby to tail Hank, who is working with Jean and Ernie. Cooper inquires about buying property in Twin Peaks; touring a bungalow named Dead Dog Farm, he discovers tire tracks and cocaine. Dougie dies of a heart attack. Dwayne accuses Lana, who has an intoxicating effect on the men around her, of murdering Dougie with sex. Nadine joins the high school wrestling team and easily defeats Mike, whom she has a crush on. Evelyn’s brother Malcolm reveals to James that Evelyn's husband beats her regularly and that she damages his car in retaliation. While changing a flat tire with Nicky, Dick narrowly avoids injury when the car falls off the jack. Major Briggs's superior, Colonel Reilly, informs Cooper that the major's disappearance is a matter of national security, and that the message he shared with Cooper originated from the woods near Twin Peaks. Threatening to give her up to Eckhardt, Catherine employs Josie as her maid. Cooper publishes his response to Earle's chess move in the newspaper, but Earle anticipates his response. Denise blackmails Ernie into helping her and Cooper create a sting for Jean. Major Briggs miraculously returns in his living room.\n\n21 13 \"Episode 20\"\n\n\"Checkmate\" Todd Holland Harley Peyton January 19, 1991 ( ) 9.8[32]\n\nMajor Briggs, bearing three triangular scars below his right ear, recalls a vision of a giant owl. He becomes upset wondering if his experience was meant for his soul. He tries to explain to Cooper that the Air Force has been unofficially searching for the White Lodge, but they are interrupted by soldiers who escort the major away. An anxious Ernie calls Jean to arrange the sting operation at Dead Dog Farm. Dick becomes paranoid that Nicky may be a personification of Satan and enlists Andy's help in raiding the orphanage's files to investigate. Ben comes to believe that he is Robert E. Lee and reenacts the Battle of Gettysburg, changing history so that the Confederacy won. James finishes fixing Evelyn's husband's car and they have sex. Truman deputizes Cooper as they leave for the sting. Jean foils the sting and holds Cooper hostage. Denise distracts Jean, allowing Cooper to shoot him. A power outage hits Twin Peaks. Leo awakens from his coma, startling a terrified Shelly. Cooper, Truman, and Hawk discover that the power outage was caused by a fire at the power station, and that Earle has planted a corpse in Truman's office, with one hand pointed at a chess board.\n\n22 14 \"Episode 21\"\n\n\"Double Play\" Uli Edel Scott Frost February 2, 1991 ( ) 8.7[32]\n\nCooper accurately predicts the corpse's wounds. Leo corners Shelly with an axe. Bobby arrives at the last minute, distracting Leo long enough for Shelly to stab him in the leg. Wounded, Leo wanders away into the night. Lucy and Dr. Hayward scorn Dick and Andy’s efforts to prove Nicky's malice, revealing Nicky is the victim of a lifetime of tragedies. Cooper reveals that years ago he and Earle were assigned to protect Earle's wife Caroline Powell after she witnessed a federal crime. Cooper admits to having loved Caroline and that she died after he was wounded by an unseen assailant. Cooper believes that Earle committed the crime Caroline witnessed and that he murdered her. In a delirious state, Major Briggs confesses that he believes he was taken to the White Lodge during his disappearance. Thomas Eckhardt arrives in Twin Peaks. Jonathan is found murdered in Seattle, leading Cooper and Truman to suspect Josie. Evelyn reveals her husband has died in a car accident, leading James to realize that she and Malcolm (revealed to be her lover) have framed him to kill her husband. Leo stumbles through the woods into a log cabin, where a man introduces himself as Windom Earle.\n\n23 15 \"Episode 22\"\n\n\"Slaves and Masters\" Diane Keaton Harley Peyton & Robert Engels February 9, 1991 ( ) 8.2[32]\n\nEvelyn frames James for her husband's death. Hiding from the police, James meets with Donna, who tries to help him prove his innocence. Albert returns, warning that Earle has sent fragments of Caroline's clothing to various locations across the country. Earle imprisons Leo, placing a shock collar around his neck, and forces to him to transcribe a poem. Josie refuses to discuss Jonathan's murder. Cooper secretly takes a fiber sample from her coat, which Albert identifies as the vicuña found outside Cooper's room after he was shot, overwhelmingly favoring Josie as the assassin. Cooper and Truman suspect that every time Earle takes a piece in the chess game, he kills a person in real life. They enlist Pete – an expert chess player – in helping to stalemate the game to prevent further loss of life. Audrey, Jerry, Bobby, and Jacoby take part in Ben's fantasy, revising history so that Ulysses S. Grant surrenders instead of Lee, triggering Ben's return to reality. Donning a disguise, Earle delivers torn fragments of the poem to Shelly, Audrey, and Donna. Malcolm tries to kill James but Evelyn, confessing that she genuinely loves James, fatally shoots Malcolm. Earle plants Caroline's death mask and a cassette tape in Cooper's bed.\n\n24 16 \"Episode 23\"\n\n\"The Condemned Woman\" Lesli Linka Glatter Tricia Brock February 16, 1991 ( ) 7.8[32]\n\nEarle's message for Cooper taunts him to make his move in the deadly chess game. Albert presents ballistic evidence that confirms Josie shot Cooper and murdered Jonathan, which Truman overhears. Ben enlists the help of his business associate John Justice Wheeler to foil Catherine's plans for the Ghostwood development, and together with Audrey and Jerry they formulate a plan to stage a protest over the disruption posed to the natural habitat of the pine weasel by the development. Catherine coerces Josie to meet with Eckhardt, which Josie realizes will lead to her imminent return to Hong Kong. Andrew reveals himself to Eckhardt, warning him that Josie is dangerous. The torn fragments of Earle's poem delivered to Shelly, Audrey, and Donna contain an invitation to meet at the Roadhouse; the three of them go there and realize that someone has arranged their meeting. Disguised, Earle watches on but doesn't introduce himself to them. Cooper and Truman ambush Josie at the Great Northern; she fatally shoots Eckhardt before dying of an unexplained cause. A vision of BOB taunts Cooper, followed by the dwarf from Cooper's dream dancing. Josie's face appears trapped in the wooden knob on a drawer.\n\n25 17 \"Episode 24\"\n\n\"Wounds and Scars\" James Foley Barry Pullman March 28, 1991 ( ) 9.2[32]\n\nTruman mourns Josie, leaving Cooper and Hawk to take over sheriff duties. Norma’s half-sister Annie Blackburn arrives in Twin Peaks after having run away from a convent. The Log Lady is transfixed by Major Briggs’s scars, telling Cooper that as a girl she disappeared for several days and returned with similar scars on her leg. Earle realizes with fury that Cooper is attempting to stalemate the game. Eckhardt’s assistant, Jones, delivers a puzzle box from Eckhardt to Catherine. Disguised, Earle visits Donna and leaves a gift for her father, pretending to be a colleague from medical school. Later, Dr. Hayward is disturbed by this encounter, as the colleague Earle imitated drowned several years earlier and the gift is a chess piece intended for Cooper. Audrey and Dick organize a fashion show to promote the Stop Ghostwood campaign, where Catherine tells Ben that an environmental impact assessment has already proven that the pine weasel is not threatened by the development, and that she knows he’s acting out of self-interest rather than genuine empathy. A live pine weasel runs amok, ruining the event. While Truman rests, Jones breaks in, incapacitates the officer looking after him, and joins him in bed.\n\n26 18 \"Episode 25\"\n\n\"On the Wings of Love\" Duwayne Dunham Harley Peyton & Robert Engels April 4, 1991 ( ) 9.2[32]\n\nJones attempts to strangle Truman, but he manages to subdue her. Cooper speculates that Eckhardt wanted Truman dead out of sexual jealousy over his affair with Josie. Audrey flirts with Wheeler, who offers to take her flying in his private jet. A bonsai tree is delivered to Truman's office, supposedly sent by Josie prior to her death. Unbeknownst to Cooper and Truman, the bonsai was sent by Earle who planted a listening device in it. Gordon returns, reinstating Cooper as a federal agent, and reveals that Earle has a history with Major Briggs and that they share a special interest in the Black and White Lodges. Earle reveals to Leo that he intends to kill the winner of the upcoming Miss Twin Peaks beauty pageant. Donna discreetly follows Eileen to a secret meeting with Ben. Gordon meets Shelly, who he can inexplicably hear perfectly. Annie recognizes Major Briggs and the Log Lady's scars as a petroglyph from Owl Cave. Donna receives a postcard from James, who has gone to Mexico to clear his head but promises to return. Cooper discovers the petroglyph but is unable to make sense of it. Later, Earle visits it and the cave wall rumbles violently.\n\n27 19 \"Episode 26\"\n\n\"Variations on Relations\" Jonathan Sanger Mark Frost & Harley Peyton April 11, 1991 ( ) 7.9[32]\n\nCooper and Truman realize that Earle has visited Owl Cave. Earle kidnaps Rusty Tomasky, a traveling musician, and tells him about the Black Lodge and his desire to harness its evil power. Catherine requests Pete's help in opening the puzzle box. Lana, who is now in a relationship with Dwayne, convinces him to rig the Miss Twin Peaks contest – of which he is one of the judges – so that she will win. Cooper matches the handwriting in the poem sent by Earle and Leo's arrest report, realizing that Leo wrote the poem. Earle traps Rusty inside a papier-mâché chess pawn before killing him with a crossbow. Pete accidentally drops the puzzle box, opening it and revealing a smaller puzzle box inside. Cooper and Annie spend time together, where they bond over their troubled pasts – Cooper failing to protect Caroline, and Annie attempting suicide prior to going to the convent. Gordon flirts with and kisses Shelly, much to Bobby’s chagrin. Dick hosts a wine tasting to promote the Stop Ghostwood campaign, where his pretentious behaviour irritates Lucy. Donna presses Eileen over her meeting with Ben, which Eileen insists was charity-related. Truman discovers Rusty’s corpse inside the pawn in a park.\n\n28 20 \"Episode 27\"\n\n\"The Path to the Black Lodge\" Stephen Gyllenhaal Harley Peyton & Robert Engels April 18, 1991 ( ) 7.4[32]\n\nCooper realizes Earle's chess game is leading to a violent conclusion. Wheeler reveals he must leave immediately for Brazil. Donna finds her birth certificate, which has no father listed. Major Briggs reveals that Earle is obsessed with \"dugpas\", beings of pure evil. Cooper speculates that Earle's true motivation in coming to Twin Peaks is to find the Black Lodge. Several people around Twin Peaks are struck by sudden hand tremors. Shelly and Bobby reconcile their love. Audrey insists Pete drive her to the airport to catch Wheeler before he leaves. Earle tranquilizes Major Briggs. Audrey and Wheeler make love in his jet, bringing a tear to Pete's eye before he too is struck by hand tremors. Earle interrogates Major Briggs about the Black Lodge, discovering it will open when \"Jupiter and Saturn meet\". Andrew smashes the second puzzle box with a rolling pin, revealing a smaller metallic cube inside. Cooper and Annie dance at the Roadhouse, before a vision of the giant waving his arms at Cooper and mouths \"no.\" Earle realizes that the petroglyph is a map to the Black Lodge. In the woods, BOB emerges from a bright light, the drapes of the red room reflected beneath him.\n\n29 21 \"Episode 28\"[c]\n\n\"Miss Twin Peaks\" Tim Hunter Barry Pullman June 10, 1991 ( ) 10.4[32]\n\nLeo frees Major Briggs, begging him to save Shelly. Audrey discovers that Ghostwood is being discreetly funded by the Twin Peaks Savings and Loan. Cooper speculates that BOB was drawn to Josie's fear and that fear is the key to the Black Lodge. Earle abandons Leo with a cage of tarantulas rigged on a pulley above his head. Donna demands that her parents tell her the truth about Eileen and Ben, but they refuse. Cooper recognizes two symbols on the petroglyph as Jupiter and Saturn, leading him to speculate that the Black Lodge will open with Jupiter and Saturn’s impending alignment. After Major Briggs returns to society under the influence of haloperidol, his incoherent babbling that \"fear and love open the doors\" and mentions of a queen lead Cooper to realize that Earle will take the winner of the Miss Twin Peaks contest to the Black Lodge. At the contest that night, Donna confronts Ben, who to admits to having an affair with Eileen and potentially being Donna's father. Annie wins the contest. Disguised as the Log Lady, Earle shuts off the lights and sets off smoke bombs. When the lights turn back on, Earle and Annie are missing.\n\n30 22 \"Episode 29\"[c]\n\n\"Beyond Life and Death\" David Lynch Mark Frost & Harley Peyton & Robert Engels[d] June 10, 1991 ( ) 10.4[32]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/e/e6/Peaks2.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/e6/Peaks2.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Twin_Peaks_episodes", "title": "List of Twin Peaks episodes", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/e/e6/Peaks2.jpg", "width": 640, "height": 966}, "title": "List of Twin Peaks episodes - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}