{"url": "https://www.hollywoodreporter.com/live-feed/will-grace-season-9-rosario-dies-1053124", "text": "[Warning: This story contains spoilers from Thursday’s episode of Will & Grace, “Rosario’s Quinceanera.”]\n\nWill & Grace said goodbye to one of its most beloved characters on Thursday.\n\nThursday’s tearful episode of the revival saw the death of Karen’s longtime maid Rosario (Shelley Morrison) following a heart attack. When Karen & Co. went to visit an then-ailing Rosario in the hospital, Karen promised to throw her a quinceanera when she was discharged because Rosario’s mother had never given her one.\n\nHowever, Rosario died in the hospital soon thereafter from complications and Karen then turned the funeral for her longtime sidekick into — yup — a quinceanera.\n\n“We knew that we weren’t going to have Shelley anymore and so the character wasn’t going to be on the show,” co-creator Max Mutchnick tells The Hollywood Reporter. “As writers, it just presented us with a situation that was too interesting to not explore and to write.”\n\nGiving Rosario a funeral also allowed the show a chance, as co-creator David Kohan put it, “to give her a proper sendoff.\n\nThe creators, who also serve as showrunners, revealed in August that Morrison would not be returning for the revival after appearing in all eight seasons of the show’s original run. During her 68-episode run, Morrison not only played Karen’s maid and BFF but also Jack’s (Sean Hayes) wife when they married to secure a green card in season two.\n\nAlthough Morrison appeared in the first cast reunion, the 2016 “Vote Honey” video created to support Hillary Clinton’s presidential campaign, she had otherwise retired from acting. Her last onscreen appearance was in a 2006 episode of My Name Is Earl that aired seven months after the Will & Grace series finale. She continued doing voiceover work until 2012.\n\nWhen it came to write Rosario out of the series, Mutchnick and Kohan said they told Morrison about their plans to kill Rosario off ahead of time.\n\n“To deal with Karen dealing with death and how that character would manage herself and how she would ultimately have a moment of truth in dealing with it — that was too rich of an area for us to not write and so we went for it,” Mutchnick says. “As we suspected, Megan Mullally delivers a tour-de-force performance in this episode.”\n\nThursday’s episode also addressed the December 2016 death of Debbie Reynolds, who appeared in 10 episodes of the show’s original run as Grace’s mom, Bobbi Adler. Eagle-eyed viewers might have noticed Reynolds’ appearance in previous episodes of the revival, specifically in a photo of her and Messing in character that was featured prominently in Will and Grace’s apartment in the new episodes.\n\nThursday’s episode revealed that Reynolds’ character had passed away some time before the events of the revival. In Thursday’s episode, Grace (Debra Messing) tried to console Karen by talking about her mother’s death.\n\n“I get what you’re going through. When my mother died, I was a wreck. On the day of her funeral, my sister had to dress me. I couldn’t even do my own blowout and I really wanted pretty hair for my mom, you know? But I made it and everyone said how brave I was and how pretty I looked and everyone said how proud they were of me,” Grace said as she started to cry. “It doesn’t change how much it hurts.”\n\nHowever, in the end it was Will (Eric McCormack), not Grace, who was able to get through to Karen with the simple act of a hug. Although Karen had missed nearly the whole funeral to drown her sorrows at a nearby bar, she went to the church and said an emotional goodbye to Rosario.\n\n“Sorry I wasn’t here, but come on, what the hell was I going to say?” Karen said. “She was my maid. She was my sparring partner. She was my best friend. You were my everything, Rosario Yolanda Salazar.”\n\n“People keep asking, ‘What do you need? What do you need?’ I need for you to not be gone,” she continued as she gave Rosario a ring from her hand, a family heirloom that previously belonged to her mother.\n\n“It was actually a very emotional night and it was something that we took very seriously. There was a hush on the stage the two times that Megan delivered her goodbye to her best friend,” Mutchnick recalls. “It was something that I will never forget and one of the best nights I’ve ever had on the stage of making this show. It was an incredible thing to witness and highly emotional.”\n\nWill & Grace airs Thursdays at 9 p.m. on NBC.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/nup_179298_3184_-_h_2017.jpg?w=1024", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/nup_179298_3184_-_h_2017.jpg?w=1296&h=730&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/nup_179298_3184_-_h_2017.jpg?w=1024", "keywords": [], "authors": ["Kate Stanhope"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/will-grace-season-9-rosario-dies-1053124/", "title": "‘Will & Grace’ Creators Break Down That “Highly Emotional” Fan-Favorite Farewell", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The NBC revival addressed the absence of two beloved actresses who appeared on the show during its original run.", "news_keywords": "autoplay, David Kohan, Max Mutchnick, Will and Grace", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Kate Stanhope", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1053124, "title": "'Will & Grace' Creators Break Down That \"Highly Emotional\" Fan-Favorite Farewell", "published_at": "2017-11-02 18:30:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/nup_179298_3184_-_h_2017.jpg?w=1024", "comment_count": 0, "tags": "Will and Grace", "topics": "TV News", "body": "[Warning: This story contains spoilers from Thursday's episode of Will & Grace, \"Rosario's Quinceanera.\"]\r\nWill & Grace said goodbye to one of its most beloved characters on Thursday.\r\nThursday's tearful episode of the revival saw the death of Karen's longtime maid Rosario (Shelley Morrison) following a heart attack. When Karen & Co. went to visit an then-ailing Rosario in the hospital, Karen promised to throw her a quinceanera when she was discharged because Rosario's mother had never given her one.\r\nHowever, Rosario died in the hospital soon thereafter from complications and Karen then turned the funeral for her longtime sidekick into — yup — a quinceanera.\r\n\"We knew that we weren’t going to have Shelley anymore and so the character wasn’t going to be on the show,\" co-creator Max Mutchnick tells The Hollywood Reporter. \"As writers, it just presented us with a situation that was too interesting to not explore and to write.\"\r\nGiving Rosario a funeral also allowed the show a chance, as co-creator David Kohan put it, \"to give her a proper sendoff.\r\n\r\nThe creators, who also serve as showrunners, revealed in August that Morrison would not be returning for the revival after appearing in all eight seasons of the show's original run. During her 68-episode run, Morrison not only played Karen's maid and BFF but also Jack's (Sean Hayes) wife when they married to secure a green card in season two.\r\nAlthough Morrison appeared in the first cast reunion, the 2016 \"Vote Honey\" video created to support Hillary Clinton's presidential campaign, she had otherwise retired from acting. Her last onscreen appearance was in a 2006 episode of My Name Is Earl that aired seven months after the Will & Grace series finale. She continued doing voiceover work until 2012.\r\nWhen it came to write Rosario out of the series, Mutchnick and Kohan said they told Morrison about their plans to kill Rosario off ahead of time.\r\n\"To deal with Karen dealing with death and how that character would manage herself and how she would ultimately have a moment of truth in dealing with it — that was too rich of an area for us to not write and so we went for it,\" Mutchnick says. \"As we suspected, Megan Mullally delivers a tour-de-force performance in this episode.\"\r\n\r\nThursday's episode also addressed the December 2016 death of Debbie Reynolds, who appeared in 10 episodes of the show's original run as Grace's mom, Bobbi Adler. Eagle-eyed viewers might have noticed Reynolds' appearance in previous episodes of the revival, specifically in a photo of her and Messing in character that was featured prominently in Will and Grace's apartment in the new episodes.\r\nThursday's episode revealed that Reynolds' character had passed away some time before the events of the revival. In Thursday's episode, Grace (Debra Messing) tried to console Karen by talking about her mother's death.  \r\n\"I get what you're going through. When my mother died, I was a wreck. On the day of her funeral, my sister had to dress me. I couldn’t even do my own blowout and I really wanted pretty hair for my mom, you know? But I made it and everyone said how brave I was and how pretty I looked and everyone said how proud they were of me,\" Grace said as she started to cry. \"It doesn’t change how much it hurts.\"\r\nHowever, in the end it was Will (Eric McCormack), not Grace, who was able to get through to Karen with the simple act of a hug. Although Karen had missed nearly the whole funeral to drown her sorrows at a nearby bar, she went to the church and said an emotional goodbye to Rosario.\r\n\"Sorry I wasn’t here, but come on, what the hell was I going to say?\" Karen said. \"She was my maid. She was my sparring partner. She was my best friend. You were my everything, Rosario Yolanda Salazar.\"\r\n\"People keep asking, 'What do you need? What do you need?' I need for you to not be gone,\" she continued as she gave Rosario a ring from her hand, a family heirloom that previously belonged to her mother.\r\n\"It was actually a very emotional night and it was something that we took very seriously. There was a hush on the stage the two times that Megan delivered her goodbye to her best friend,\" Mutchnick recalls. \"It was something that I will never forget and one of the best nights I've ever had on the stage of making this show. It was an incredible thing to witness and highly emotional.\"\r\nWill & Grace airs Thursdays at 9 p.m. on NBC.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Will & Grace’ Creators Break Down That “Highly Emotional” Fan-Favorite Farewell", "url": "https://www.hollywoodreporter.com/tv/tv-news/will-grace-season-9-rosario-dies-1053124/", "description": "The NBC revival addressed the absence of two beloved actresses who appeared on the show during its original run.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/nup_179298_3184_-_h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-11-02T18:30:00+00:00", "modified_time": "2017-11-03T13:52:51+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Will & Grace’ Creators Break Down That “Highly Emotional” Fan-Favorite Farewell", "description": "The NBC revival addressed the absence of two beloved actresses who appeared on the show during its original run.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/nup_179298_3184_-_h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1509647400.0, "source": "https://www.hollywoodreporter.com", "summary": ""}