{"url": "www.yahoo.com/entertainment/fights-post-notes-secret-sleepovers-brad-jennifer-anistons-separation-leads-creative-tabloid-tales-194445753.html", "text": "Jennifer Aniston and Justin Theroux’s split is like a celebration for the celebrity weeklies, who have so many theories — some absurd — about what went wrong. (Photo: Yahoo Entertainment)\n\nIt’s a weird time in the world: Children are being killed in school, politicians are fighting over whether we actually need to do something about it, and yet — like clockwork — the new celebrity weeklies are dissecting Jennifer Aniston’s love life.\n\nOf course, it wasn’t your typical week for “Lonely Jen,” the sort of fictional persona the tabloids have created with embellished details of the Friends alum’s real life. She announced the end of her second marriage. And while the 49-year-old actress and Justin Theroux, 46, said in their joint statement that “Whatever else is printed about us” beyond their own comment “is someone else’s fictional narrative,” the mags — from the gold standard People to kitty litter box liner OK! — had no problem crafting those narratives. And crafty they are. Here are the most ridiculous/sensational/silly stories of the lot…\n\n1. Justin found Jen’s Post-it notes collection from Brad Pitt, and the impact was “huge.” We feel dumber by the second even typing this, but Us Weekly reports that Justin “stumbled upon old Post-it notes Brad had written” back when they were together. (They divorced in 2005, after he left her for Angelina Jolie, thus giving birth to the whole “Lonely Jen” tabloid storyline.) The mag described them as “sweet little Post-its that said things like, ‘You looked nice tonight,’ or, ‘Miss you already.’” (Not exactly sonnets, but…) While Jen assured Justin that the “love notes” really “weren’t a big deal,” Theroux “wasn’t thrilled.” The Leftovers actor “had moments of insecurity like that” in their relationship in which he was “frequently out of his element.”\n\n2. Jen dumped Justin for Brad because it was “pointless” to fight their attraction “any longer.” OK! magazine just went for it, claiming “Jen dumped Justin for Brad,” using italics and everything. Even though People magazine has said that Jen and Brad straight up “haven’t seen each other for ages” and “for well over a decade now they have lived totally separate lives,” OK! insists that Aniston ended her marriage to reunite with Pitt. “They never stopped loving each other, and realized it’s pointless to fight it any longer. They’re soul mates and … the stars are aligning for them to get back together,” read the breathless copy.\n\nStory continues\n\n3. Justin dumped Jen after Brad texted her to congratulate her on the Architectural Digest cover. Jen and Brad have maintained that they text now and then, and In Touch used that factoid to push its narrative. The tab wrote that, despite Jen and Justin saying they split in December, it was really after Jen appeared on the February cover of AD. That is when Brad texted her to extend his “best wishes,” as someone who has also covered the magazine. “Design is so important to them,” a source said of exes Jen and Brad. Brad’s text didn’t go over well with Justin, according to In Touch. “He saw the message on Jen’s phone and was annoyed his wife was texting with her ex over their love of design.” And that caused their final split.\n\n4. Jen and Brad have been having “secret sleepovers.” Which brings us here. The same mag reports that after Justin got mad that Brad texted Jen, “Jen showed up at Brad’s door.” The exes know that they’re “meant to be back together” and “they’ve been having ‘secret sleepovers.’” The story went on to say that Angelina would “hit the roof” if she heard about the secret trysts.\n\n5. Justin has a mistress. But don’t worry, y’all — Justin’s got his own side piece. Life & Style said that it was Jen’s jealousy that did them in and “now she believes he’s dumped her for another woman.” The story paints him as “a classic ladies’ man,” adding that “it has always driven her up the wall” because “Jen’s got a jealous streak a mile wide.” In Touch also claims Justin has a mistress, but their evidence is an anonymous comment on one of Justin’s Instagram photos featuring Jen and Justin that said, “I know a few people who saw him with his mistress in N.Y.” Solid reporting.\n\n6. Jen’s been hanging out with Brad’s kids. Yet another claim by In Touch is that — while Brad’s custody agreement is vague and the kids mostly seem to be with Jolie — during one of Jen and Brad’s “more intimate moments” since they reconciled, he “introduced Jen to several of his children.”\n\n7. Jen is now “adopting.” But Jen doesn’t need Brad’s kids in her life to feel like a whole woman, because she’s adopting! Since her husband “ditched her to hobnob with models,” Aniston is “building a new family,” according to Star. Oh, and not just any kids. The mag claims that her estranged half-brother Alex “AJ” Aniston left his children behind, so Aniston wants to raise them as her own.\n\nPeople magazine’s six-page spread on the breakup was the cover the magazine opted for, beating out the Florida school shooting that took place two days prior. Their story is much less sensational than the others, which is typical, and talked about how Jen and Justin met up on Valentine’s Day for a final goodbye, but “clashing lifestyles and personalities doomed their marriage.” Even therapy didn’t help. As has been reported all along, Jen was “miserable” whenever they were living in NYC, which was his preference, and he was frustrated that she obsessed over paparazzi and wouldn’t be more “spontaneous.” But, again, the magazine noted that — despite the hopes and dreams of Twitter — it’s “unlikely” she’d reunite with Brad, whom she hasn’t seen. While they do text, “They broke up, and they did it because they have serious issues. They’re not stupid — they remember why it didn’t work.”\n\nBut the tabloids clearly know what does work: “Lonely Jennifer” stories. Love triangles with Brad and Jen. And claims of cheating celebrities (sorry, Justin).\n\nRead more from Yahoo Entertainment:\n\n", "images": ["https://s.yimg.com/rz/p/yahoo_entertainment_en-US_h_w_entertainmentv2.png", "https://s.yimg.com/ny/api/res/1.2/QRb0dB16TFI3qmntDiVGvg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/704d5100eb70dd0245a7dde7454d984a", "https://s.yimg.com/ny/api/res/1.2/7JOOHnw2N_SFubWRzMV56A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTM0MjtoPTQ4/https://s.yimg.com/os/creatr-uploaded-images/2020-12/d7f38f00-340b-11eb-b7bf-540525a865da", "https://s.yimg.com/rz/p/yahoo_entertainment_en-US_h_p_entertainmentv2.png", "https://s.yimg.com/ny/api/res/1.2/UXXovDuaEGV0ZypFk.17mQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTgwO2g9ODA-/https://s.yimg.com/os/creatr-images/GLB/2017-10-17/711f88c0-b37f-11e7-8353-c582c6383d28_oath_suzybyrne_03_7589.jpg", "https://s.yimg.com/ny/api/res/1.2/JyneEHhxdk55uXjJ3_0P6w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTcyMA--/https://s.yimg.com/uu/api/res/1.2/9bHTF0Ayvn_uh8aNnPnIrw--~B/aD0xNTM2O3c9MjA0ODthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/704d5100eb70dd0245a7dde7454d984a", "https://sb.scorecardresearch.com/p?c1=2&c2=7241469&c5=1197800334&c7=https%3A%2F%2Fwww.yahoo.com%2Fentertainment%2Ffights-post-notes-secret-sleepovers-brad-jennifer-anistons-separation-leads-creative-tabloid-tales-194445753.html&c14=-1", "https://s.yimg.com/cv/apiv2/default/20190501/placeholder.gif"], "top_img": "https://s.yimg.com/ny/api/res/1.2/QRb0dB16TFI3qmntDiVGvg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/704d5100eb70dd0245a7dde7454d984a", "keywords": [], "authors": [], "canonical_link": "https://www.yahoo.com/entertainment/fights-post-notes-secret-sleepovers-brad-jennifer-anistons-separation-leads-creative-tabloid-tales-194445753.html", "title": "Fights over Post-it notes? 'Secret sleepovers' with Brad? Jennifer Aniston's separation leads to bonkers tabloid tales.", "meta_data": {"oath": {"guce": {"consent-host": "guce.yahoo.com"}}, "news_keywords": "Jennifer Aniston, Brad Pitt, Justin Theroux, Jen and Brad, Brad and Jen, Jen and Justin", "twitter": {"title": "Fights over Post-it notes? 'Secret sleepovers' with Brad? Jennifer Aniston's separation leads to bonkers tabloid tales.", "description": "The tabloids are having big fun with Jennifer Aniston and Justin Theroux's split, crafting creative stories about what went wrong. We pick through the nonsense.", "site": "@Yahoo", "dnt": "on", "image": {"identifier": "https://s.yimg.com/ny/api/res/1.2/QRb0dB16TFI3qmntDiVGvg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/704d5100eb70dd0245a7dde7454d984a", "src": "https://s.yimg.com/ny/api/res/1.2/QRb0dB16TFI3qmntDiVGvg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/704d5100eb70dd0245a7dde7454d984a"}, "creator": "@SuzyByrne", "card": "summary_large_image"}, "og": {"title": "Fights over Post-it notes? 'Secret sleepovers' with Brad? Jennifer Aniston's separation leads to bonkers tabloid tales.", "url": "https://www.yahoo.com/entertainment/fights-post-notes-secret-sleepovers-brad-jennifer-anistons-separation-leads-creative-tabloid-tales-194445753.html", "description": "The tabloids are having big fun with Jennifer Aniston and Justin Theroux's split, crafting creative stories about what went wrong. We pick through the nonsense.", "type": "article", "image": {"identifier": "https://s.yimg.com/ny/api/res/1.2/QRb0dB16TFI3qmntDiVGvg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/704d5100eb70dd0245a7dde7454d984a", "width": 1200, "height": 900}}, "al": {"android": {"url": "yahoo://article/view?uuid=48af23a0-52c6-32a7-8bd8-88631fe384fd&src=web", "app_name": "Yahoo", "package": "com.yahoo.mobile.client.android.yahoo"}, "ios": {"url": "yahoo://article/view?uuid=48af23a0-52c6-32a7-8bd8-88631fe384fd&src=web", "app_name": "Yahoo", "app_store_id": 304158842}}, "description": "The tabloids are having big fun with Jennifer Aniston and Justin Theroux's split, crafting creative stories about what went wrong. We pick through the nonsense.", "robots": "max-image-preview:large"}, "movies": [], "publish_date": null, "source": "http://www.yahoo.com", "summary": ""}