{"url": "https://en.wikipedia.org/wiki/The_X-Files_(film)", "text": "1998 film by Rob Bowman\n\nThe X-Files (also known as The X-Files: Fight the Future) is a 1998 American science fiction thriller film based on Chris Carter's television series of the same name, which revolves around fictional unsolved cases called the X-Files and the characters solving them. It was directed by Rob Bowman, written by Carter and Frank Spotnitz and featured five main characters from the television series: David Duchovny, Gillian Anderson, Mitch Pileggi, John Neville, and William B. Davis reprise their respective roles as FBI agents Fox Mulder and Dana Scully, FBI Assistant Director Walter Skinner, Well-Manicured Man, and the Cigarette-Smoking Man. The film was promoted with the tagline Fight the Future.\n\nThe film takes place between seasons five (episode \"The End\") and six (episode \"The Beginning\") of the television series, and is based upon the series' extraterrestrial mythology. The story follows agents Mulder and Scully, removed from their usual jobs on the X-Files, and investigating the bombing of a building and the destruction of criminal evidence. They uncover what appears to be a government conspiracy attempting to hide the truth about an alien colonization of Earth.\n\nCarter decided to make a feature film to explore the show's mythology on a wider scale, as well as appealing to non-fans. He wrote the story with Frank Spotnitz at the end of 1996 and, with a budget from 20th Century Fox, filming began in 1997, following the end of the show's fourth season. Carter assembled cast and crew from the show, as well as some other, well-known actors such as Blythe Danner and Martin Landau, to begin production on what they termed \"Project Blackwood\". The film was produced by Carter and Daniel Sackheim. Mark Snow continued his role as X-Files composer to create the film's score.\n\nThe film premiered on June 19, 1998, in the United States, and received mixed reviews from critics but was a box office success, earning $189 million worldwide against a budget of $66 million. A sequel, titled I Want to Believe, was released ten years later.\n\nPlot [ edit ]\n\nIn 35,000 B.C. during the Ice Age, in what will become North Texas, two cavemen hunters encounter a large extraterrestrial life form in a cave, which kills one and infects the other with a black oil-like substance. In 1998, in the same area, a boy falls into a hole and is also infected by a black substance which seeps from the ground. Firefighters who enter the hole to rescue him do not come out. A team of men wearing hazmat suits arrive and extract the bodies of the boy and the firefighters. Meanwhile, FBI Special Agents Fox Mulder and Dana Scully, while investigating a bomb threat against a federal building in Dallas, discover the bomb in a building across the street. As the building is evacuated, Special Agent in Charge Darius Michaud remains, ostensibly to disarm the bomb. However, he simply waits for the bomb to detonate.\n\nMulder and Scully are later chastised because, in addition to Michaud, four other people were in the building during the bombing. That evening Mulder is accosted by a paranoid doctor, Alvin Kurtzweil, who explains that the \"victims\" were already dead, and that the bombing was staged to cover up how they died. At the hospital morgue, Scully is able to examine one of the victims, finding evidence of an alien virus. Meanwhile, the Cigarette Smoking Man goes to Texas, where Dr. Ben Bronschweig shows him one of the lost firefighters, who has an alien organism residing inside his body. He orders Bronschweig to administer a vaccine to it, but to burn the body if it fails. Later, the alien organism unexpectedly gestates and kills Bronschweig.\n\nMulder and Scully travel to the crime scene in Texas, where they find the site has been hastily turned into a new playground and encounter the boys whose friend fell into the hole. Driving in the direction indicated by the boys, the pair encounters a train with some white gasoline tankers and follow it to a large cornfield surrounding two glowing domes. Inside the domes, grates in the floor open and swarms of bees fly out, attacking the agents. They flee through an adjacent cornfield, chased by black helicopters, but manage to escape when the helicopters suddenly disappear.\n\nUpon returning to Washington, D.C., Scully attends a performance hearing; at the same time, Mulder meets with Kurtzwell in an attempt to get more information. Scully arrives at Mulder's apartment to tell him she has been transferred to Salt Lake City. Mulder is devastated to lose his partner. The two are about to share a kiss when Scully is stung by a bee that had lodged itself under her shirt collar. She quickly falls unconscious while Mulder calls paramedics, but the ambulance driver shoots Mulder and whisks Scully away. She is seen later in an isolation unit being loaded onto a plane. An unconscious Mulder is picked up by another ambulance. Not severely injured, he slips out of hospital with the help of The Lone Gunmen and FBI Assistant Director Walter Skinner. He then meets a former adversary, the Well-Manicured Man, who gives him Scully's location, along with a vaccine against the virus that has infected her. As Mulder leaves, the Well-Manicured Man kills himself in a car bomb, before his betrayal of The Syndicate is discovered.\n\nIn Antarctica 48 hours later, Mulder finds Scully in a large underground facility containing many humans suspended in ice-like enclosures. He breaks Scully's confinement and uses the vaccine to revive her, but this disrupts the facility and cocooned aliens begin trying to escape. After Mulder and Scully escape to the surface, a huge alien vessel emerges from beneath the ice and travels into the sky. Mulder watches it disappear into the distance as Scully regains full consciousness.\n\nLater at another hearing, Scully's testimony is disregarded and evidence in Texas is destroyed. To the hearing moderator, she hands over the only remaining proof of their ordeal—the bee that stung her—noting that the FBI is not currently capable of investigating this evidence. Outside, Mulder reads an article that has covered up the domes and crop field in Texas. Scully informs Mulder that she is willing to continue working with him: \"If I quit now, they win.\"\n\nAt another crop outpost in Tunisia, the Cigarette Smoking Man warns Conrad Strughold that Mulder remains a threat, as he explains what Mulder has found out about the virus. He then hands him a telegram revealing that the X-files unit has been re-opened.\n\nCast [ edit ]\n\nLead actor David Duchovny who portrayed FBI agent Fox Mulder.\n\nProduction [ edit ]\n\nConception and pre-production [ edit ]\n\n\"We wanted it to be true to the TV show, for one thing. We didn't want The X-Files to become something else in the movie, just because we had a bigger budget to work with. Yet, we were also mindful that it had to be a culmination of something for the people who had been watching the show for five years, as well as an introduction of these characters and this story to people who hadn't.\" — Frank Spotnitz talking about the development of The X-Files film.[3]\n\nAfter five successful seasons, Chris Carter wanted to tell the story of the series on a wider scale, which ultimately meant creating a feature film. He later explained that the main problem was to create a story for which the viewer would not need to be familiar with the show's setting and the various story arcs.[4]\n\nCarter and Frank Spotnitz wrote major parts of the script in Hawaii over Christmas 1996. They used the same method that they had used when writing episodes and sketching out scenes for the series on 3x5 index cards. By the time the Christmas break had ended, the whole narrative for the film had been written. Upon his return from Hawaii, Carter looked for spare time to write the script. He returned to Hawaii and in ten days wrote about half of the 124-page screenplay for the film.[5]\n\nCarter gave 90 pages of the screenplay to Fox who received it well. While not officially greenlighted, he got a budget from Fox and began to make plans as to when and where it would be filmed. Carter then enlisted Daniel Sackheim as a producer on the film. Sackheim had previously produced the pilot episode of The X-Files and directed several episodes in the first two seasons. The X-Files marked his first contribution as producer to a feature film. Carter's choice for director was Rob Bowman, who had been the series' executive producer and a director before the production base was moved from Vancouver to Los Angeles.[6]\n\nDuring production, the filmmakers went to great lengths to preserve secrecy, including printing the script on red paper to prevent photocopying,[4] and leaking disinformation to the media and giving the film the codename \"Project Blackwood\". The code was cracked by fans who speculated on the meaning behind it. During the North Texas scene, \"Blackwood County\" can be seen on the fire trucks responding to the infected boy. According to Spotnitz, \"Blackwood\" held no particular significance.[7]\n\nAt the beginning of the pre-production phase, Carter and Bowman were busy with the television series, leaving Sackheim to work alone. Sackheim hired executive producer Lata Ryan, who had previously collaborated with Steven Spielberg for his 1993 film, Jurassic Park. Once hired, Ryan was allowed to read the script in front of the Ten Thirteen Productions staff members—but not to take it away. At this time, most of the staff members had not read the script for themselves. After Ryan accepted the offer of becoming executive producer, Chris Nowak was hired as production designer, Ward Russell as director of photography and Bill Liams as construction coordinator. According to Ryan, they had secured all key personnel six weeks before principal filming began.[8]\n\nWriting and casting [ edit ]\n\nBoth Carter and Spotnitz wanted to make the film \"bigger\" than the series, so they decided to start and end the film at an \"extreme place\" and explain aspects of the story arc that the show had not. While gathering research materials, they learned that the Earth was once covered with ice and decided to open the film in Texas in 35,000 BC with human \"Primitives\" as the first characters to appear.\n\nThe film included known actors from the show such as David Duchovny as Fox Mulder, Gillian Anderson as Dana Scully, Mitch Pileggi as Walter Skinner and William B. Davis as the Cigarette Smoking Man, as well as new actors and characters to the franchise. These included Martin Landau and Blythe Danner. The signing of these actors broke with what had become tradition for The X-Files. Carter had purposely cast virtually unknown actors for the television series, to make it more believable; \"As soon as you put in an actor whose face is very recognizable, you've got a situation that works against the reality of the show.\"[10] He saw creating the film as a chance to break this rule. He offered Glenne Headly the small role of a bartender. A fan of the show, she accepted enthusiastically.[10]\n\nSet design [ edit ]\n\nChris Nowak was hired as production designer for the film by Daniel Sackheim. Nowak was a former architect who had worked as a professional theater set designer for eight years, before moving towards the film business as an art director. Nowak had previously worked with Sackheim on a television production, which led to Sackheim contacting him to do an interview for the selection of a production designer. According to Sackheim, Nowak was hired because he was the only one able to create a \"focused vision\" for the film.[11]\n\nNowak wanted to start the design process after talking through the story with the filmmakers so that he could formulate \"a sense of the atmosphere\" which they wanted to create for the film. He wanted to create a \"dark, scary and oppressive environment\" for the characters, especially Mulder. While familiar with the television series, Nowak decided not to review any episodes as preparation for his role in the production. Explaining this decision, he said, \"I wanted the movie to be as fresh and new as possible in its design. Of course, there were some elements from the show that had to be retained.\"[11]\n\nThe design department found all their locations and designed sets in eight weeks, guided by input from the filmmakers. Nowak started by creating artwork for all the major sets and locations, working with the two concept artists Tim Flattery and Jim Martin. Nowak created drafts and sent them to Flattery and Martin who continued to develop them until they were complete. The complete artwork was then presented to Chris Carter, Rob Bowman, Lata Ryan and Sackheim for approval. While considering the time schedule, they made no notable changes to the artwork.[11]\n\nOnce the set concepts were approved by Carter, Bowman, Sackheim and Ryan, they were sent to the blueprint stage so that construction of the sets could begin under the supervision of construction coordinator Bill Liams. All the major sets were constructed \"simultaneously\" because of the schedule. However, this proved to be a challenge for the production team, because it meant they had to pay the rent on all the stages at the same time. The set construction started seven weeks before filming.[11]\n\nFilming [ edit ]\n\nNot only could I not have directed the movie as well as Rob Bowman [...] I didn't have the time to even attempt to direct the movie as well as Rob Bowman. Rob is a very collaborative person; and I thought that working with him collaboratively was a much wiser way to approach this than to try to do it myself. — Carter talking about choosing a director for the film.[12]\n\nCarter and Bowman wanted to film in as many different locations as possible to give the film a \"grander\" feel than had usually been achievable for the television episodes.[4] The tighter schedule, with only eight weeks of pre-production and 45 days of principal photography, still caused the production to have less location shooting than planned. Los Angeles ended up standing in for Dallas and London (though a shot was done in London with a double), and the ice scenes, initially envisaged for an ice field in Alaska, were moved to Whistler, British Columbia, nearby the show's regular locations in Vancouver.[13] Principal photography for the film started on June 16, 1997.[12]\n\nThe X-Files was filmed in the hiatus between the show's fourth and fifth seasons and re-shoots were conducted during the filming of the show's fifth season. Due to the demands of the film shoot on the actors' schedules, some episodes of the fifth season did not revolve around both Mulder and Scully but just one of the two lead stars.[14]\n\nMusic [ edit ]\n\nTwo soundtracks, The X-Files: Original Motion Picture Score[15] and The X-Files: The Album were both released to home markets in 1998. The X-Files: The Album included a take on the original theme song by the American duo The Dust Brothers, and included a hidden track on which Chris Carter details a summary of The X-Files mythology.[16] Mark Snow, who had worked on the television series as a composer, was hired to score the film. Chris Carter wanted a \"very minimal approach\" to the music. He did not want much \"melody\" and wanted to replace it with plain \"ambient atmosphere\" and \"sound design\". Snow mixed electronic music with an 85-member orchestra to give the film a \"great sense of scope and grandeur.\"[4]\n\nWhen creating the music for the film, Snow had a couple of months to write and produce the music, composing the television series simultaneously. The film marked the first time in the history of the franchise that music was composed and recorded with the help of an orchestra, although, according to Snow, there was no significant change in the recording and writing process during the production of the film. The most substantial difference was that Snow used MIDI files to save his musical scores and pieces, which would afterward be sent to a copyist who would take it through one of their programs and eventually give it to the orchestrators.[17]\n\nRelease [ edit ]\n\nTheatrical run [ edit ]\n\nThe film was distributed by 20th Century Fox and premiered theatrically in the United States (as well as Canada) on June 19, 1998, along with Disney's Mulan.[18] It closed after 14 weeks, with its widest release having been 2,650 theaters.[2]\n\nHome media [ edit ]\n\nThe same year as the international theatrical release, The X Files was released on VHS on October 13, 1998 with an Extended Cut that is 41 seconds longer[19] than the theatrical release.[20][21] The VHS comes in either pan and scan fullscreen or widescreen releases and both versions are THX certified.[22] The film later appeared on DVD in Region 1 on May 4, 1999 and in Region 2 on January 24, 2000.[23] On January 23, 2001, the DVD was released once again, this time featuring a DTS enhanced widescreen version and THX Optimode.[24] In 2008, producer Frank Spotnitz announced plans to release a new special edition DVD and Blu-ray edition of the film. \"We are working on packing the [re-issued] DVD and Blu-ray releases with as many extras as they will fit, including video and audio commentaries, behind-the-scenes footage, bloopers, trailers, a new documentary, and several other cool surprises.\"[25] The Blu-ray version was released on December 2, 2008.[26] In addition, a novelization of the film was written by Elizabeth Hand and released on June 19, 1998.[27]\n\nTelevision airing [ edit ]\n\nThe film was originally scheduled to air on Fox on September 14, 2001, but was pulled following the September 11 attacks which happened three days prior to its scheduled airing. It was replaced with a repeat airing of Nine Months. This also happened to Independence Day, which was pulled from its scheduled September 16, 2001 airing as There's Something About Mary took its spot.[28]\n\nReception [ edit ]\n\nBox office [ edit ]\n\nThe film grossed $83,898,313 in the U.S. and $105,278,110 abroad, giving a total worldwide gross of $189,176,423.[2] In its opening weekend, showing at 2,629 theaters, it earned $30,138,758 which was 35.9% of its total gross.[2] According to Box Office Mojo, it ranked at No. 23 for all films released in the U.S. in 1998 and No. 10 for PG-13 rated films released that year.\n\nCritical response [ edit ]\n\nOn Rotten Tomatoes the film has a 66% rating based on reviews from 72 critics and an average rating of 6.1/10. The consensus states, \"Results may vary for newcomers, but fans of the series will enjoy its big-screen transition.\"[29] On Metacritic the film has a score of 60 out of 100, based on reviews from 23 critics.[30] Audiences surveyed by CinemaScore gave the film a grade A− on scale of A to F.[31]\n\n\"The X-Files\" movie does answer one question raised in the show for an hour a week, five years running: Is the government conspiring to keep the truth about extraterrestrials from the public? You bet. That's certainly been the implication from the start, and since paranoia fuels the show, it's no great leap on the big screen. —Tim Goodman, writing for The San Francisco Examiner[32]\n\nRoger Ebert gave a positive review of the film with three out of four stars, saying, \"As pure movie, The X-Files more or less works. As a story, it needs a sequel, a prequel, and Cliff Notes.\"[33] Gene Siskel also gave the film three out of four stars, saying that he was intrigued by the characters and was \"now seriously tempted to watch the TV show.\"[34] Joyce Millman of Salon was more equivocal, writing, \"... You really can't treat The X-Files as a movie because it isn't one. It's a two-hour episode of the show,\" and said it was far from the \"most satisfying\" of X-Files releases.[35] San Francisco Chronicle reviewer Bob Graham was positive towards the film, calling \"David Duchovny and Gillian Anderson [...] enormously sympathetic heroes.\"[21] Michael O'Sullivan, a reviewer from The Washington Post called the film, \"stylish, scary, sardonically funny and at times just plain gross.\"[36]\n\nLos Angeles Times reviewer Kenneth Turan felt that it was difficult to make sense of the film, saying that it relied too heavily on the series' mythology.[37] Lisa Alspector wrote that \"Only two scenes in this spin-off are worth the time of followers of the TV series.\"[38] Variety reviewer Todd McCarthy remarked, \"As it is, the pic serves up set-pieces and a measure of scope that are beyond TV size but remain rather underwhelming by feature standards.\"[39] Janet Maslin of The New York Times responded negatively towards the film, opining that it was uneventful and scorning the \"hush-hush atmosphere\" surrounding the production.[40] Andrew Johnston reviewed the film in Time Out New York and observed: \"The X-Files has always been the most cinematic show on TV, and Bowman (who's directed many of its best episodes) expands the show's scale and impact on the big screen while keeping its charms intact.\"[41]\n\nSequel [ edit ]\n\nThe X-Files has spawned one sequel, a 2008 film entitled The X-Files: I Want to Believe released six years after the series ended. The film grossed $68 million [42] and received a lower approval rating on Rotten Tomatoes than the first film.[43] In an interview with Entertainment Weekly, Chris Carter announced that if I Want to Believe proved successful, he would propose that a third film go back to the television series' mythology and focus on the alien invasion foretold within the series, due to occur in December 2012.[44] No third film appeared; instead, the TV series was revived in 2016.\n\nSee also [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/6c/XFilesMoviePoster.jpg/220px-XFilesMoviePoster.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/MartinLandau2008TIFF.jpg/150px-MartinLandau2008TIFF.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/EC1835_C_cut.jpg/16px-EC1835_C_cut.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/6/6c/XFilesMoviePoster.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/fd/Portal-puzzle.svg/21px-Portal-puzzle.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/19px-Video-x-generic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/David_Duchovny_by_Gage_Skidmore.jpg/170px-David_Duchovny_by_Gage_Skidmore.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/6/6c/XFilesMoviePoster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_X-Files_(film)", "title": "The X-Files (film)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/6/6c/XFilesMoviePoster.jpg", "width": 640, "height": 917}, "title": "The X-Files (film) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}