{"url": "https://en.wikipedia.org/wiki/The_Originals_(season_4)", "text": "No.\n\noverall No. in\n\nseason Title Directed by Written by Original air date Prod.\n\ncode US viewers\n\n(millions)\n\n67 1 \"Gather Up the Killers\" Lance Anderson Michael Russo & Michael Narducci March 17, 2017 ( ) 401 1.05[14]\n\nFive years since the defeat of Klaus and the expulsion of the Mikaelsons from New Orleans, Marcel is the sole vampire king of the city. The witches and vampires are at peace in the Quarter. Vincent is troubled to hear of dark magic symbols appearing throughout the Quarter. Hayley has been travelling the country in search of a cure for the Originals. If she can find venom from all seven packs of New Orleans, she can find a cure to wake Freya, who will then have proper materials to wake the others. This leads Hayley to find the last remaining survivor of a pack, Keelin, who is being hunted by Marcel's men as well. Marcel clashes with an enemy of Klaus', who wants to see to it that Marcel will kill Klaus, rather than leave him captured and Klaus kills him. Klaus, having angered Marcel, is knifed again. Hayley successfully wakes all Originals, however, Freya keeps Keelin captured for later. Maxine's son goes missing, finding himself in an abandoned house with strange symbols on the wall. A blinding blue light appears that calls to him and as he walks towards it a scream is heard. At the same time, Hope awakes from a nightmare and has drawn the symbls lina few papers as seen around town over and over again.\n\n68 2 \"No Quarter\" Bethany Rooney Talicia Raggs & Michelle Paradise March 24, 2017 ( ) 402 0.99[15]\n\nWhile under immense pain, Klaus is greeted by Cami's ghost who offers him motivation to fight and survive. Awaken, the Originals all feed and plan to free Klaus. Vincent helps Maxine look for her son Adam, while Vincent realizes that there have been reports of screaming, odd lights, and disappearing children throughout the Quarter in a manner similar to her son. Embarking on their plan, Rebekah confronts and stalls Marcel, Kol stalls Josh, Marcel's new right-hand man while the others rescue Klaus. Rebekah and Marcel clash over their past romance while Rebekah pleads for Klaus' release. Kol and Josh bond over their respective losses of Davina and Aiden. Marcel realizes Rebekah's motive and she's vervained by Sofiya, Marcel's new spy and informer leaving Sofya to watch over Rebekah. In return, he and Elijah clash and fight over the recent events while Freya and Hayley successfully saves Klaus. Vincent investigates the disappearances and is put up against the blinding blue lights and strange symbols where he is barely saved. He realizes that something has been released and it is all his fault, dating back to his past many years ago. Marcel threatens the Originals and forbids them from ever returning to town again. The Mikalesons return safely and Klaus sees his daughter Hope now a little girl sleeping after 5 years.\n\n69 3 \"Haunter of Ruins\" Jeffrey Hunt Carina Adly Mackenzie & Declan de Barra March 31, 2017 ( ) 403 0.93[16]\n\nKlaus bonds with Hope. Freya is still draining the venom from Keelin. Hayley and Elijah jump back into their romance and have sex. Hayley questions her place in the family. Kol, distraught after losing Davina, is unsure where he wants to take his next steps but wants to explore the world. Vincent and Marcel investigate the disappearances of several children while Vincent sheds light on his backstory with Eva. She became pregnant with his child while Vincent turned to dark magic. The magic became hungry for sacrifices and constantly needed a bigger sacrifice. Eva fell to dark magic and became addicted to the blue light magic, resorting to sacrificing children. Hayley and Elijah set Keelin free, upsetting Freya, who later captures her and tells her the family will protect her while she is still hunted. Rebekah seeks Klaus' approval to leave and see the world. She and Kol later set off to explore. Vincent and Marcel find and save the children being sacrificed to the blue light, just as Hope falls ill. Vincent realizes Hope was chosen to be sacrificed due to her bloodline and calls the Mikaelsons to New Orleans to have her cured. Will later becomes possessed by the blue light and kidnaps the children.\n\n70 4 \"Keepers of the House\" Joseph Morgan Beau DeMayo & Christopher Hollier April 7, 2017 ( ) 404 1.08[17]\n\nHope is brought to Vincent to cure her, when he does, she ends up feeling worse. Vincent realizes they need to find the children who have been kidnapped to be sacrificed. Hope warns Klaus not to investigate the blue light. Hayley works with Marcel to find out where the kids have been taken, when they find that a werewolf had begun working with followers of the blue light to take back the city from Marcel, who is despised by the witches and werewolves. She blames the power of the blue light on something related to Hayley and says Marcel will bow to the Hollow too, before killing herself. Freya and Keelin work on finding Marcel's blood and receive a vile of it to kill him. Vincent tracks Will to the sacrificial ritual area and is joined by Klaus, Hayley, Marcel, and Elijah. They all kill the followers of the Hollow, but ultimately realize this was The Hollow's intention. Klaus and Marcel are sent into the Hollow Realm, where Klaus refrains from looking into the blue light, but Marcel does. Marcel finds himself drawn to a blue light before finding the dragon symbol. Hope has a dream where Klaus' eyes turn blue. She wakes up horrified, noting that The Hollow has arrived.\n\n71 5 \"I Hear You Knocking\" Chris Grismer Kyle Arrington April 14, 2017 ( ) 405 0.87[18]\n\nKlaus and Marcel, under the influence of the Hollow, are driven to a dangerous game, tasked with killing each other. Freya successfully develops a knife to kill Marcel while growing closer to Keelin. Hayley visits Mary to keep Hope safe, where she learns that Mary's husband had journals including the serpent sigil that Hope has drawn and is all over town. Sofya and Dominic share that The Hollow was let free when Vincent, Davina, and Kol severed the ancestors' link. Hayley later begins to question if the cult of The Hollow made Mary's husband kill her parents years back. Elijah and Freya barely save Marcel and Klaus from killing each other, just as the blue orb begins to form a black shadow of a person. Elijah keeps Marcel bound in the dungeon, fearing Marcel will halt Klaus' redemption. Sofya and Dominic meet at the battleground, with Sofya angry that their deal was broken; Klaus was not killed and Marcel was taken. Dominic points out that Marcel's blood had been spilled and they can use it to kill Klaus or any Original.\n\n72 6 \"Bag of Cobras\" Jesse Warn Michael Russo & Michelle Paradise April 28, 2017 ( ) 406 0.96[19]\n\nKlaus and Elijah stage a party to learn who is in the cult of the Hollow. Vincent learns that The Hollow emerges every few years, and when it does it commits murders in four different areas. Sofya and Josh search for Marcel, who is still being held in the basement. Hayley has Freya use dark magic to allow her to view her parents murder, looking for the connection to the Hollow. She sees her father drop a key in the floorboard, which takes her to a warehouse where she locates a set of human teeth. Dominic pleads with Elijah to give them Vincent, as the Hollow's followers will always pose a threat. Klaus strikes a deal with Sofya, she will tell him who is loyal to the Hollow, and he will give her Marcel back. Elijah declares war on the Hollow by killing Dominic in front of the party-goers. Hayley shares her finding with the group, where they note that it must be one of four items necessary for the Hollow's followers to revive its human form. Hearing this, Klaus realizes Sofya was a distraction and that the followers have stolen the dagger, which they use to revive Dominic. Horrified, he notes that if they find the other bones before them, The Hollow will come for them all.\n\n73 7 \"High Water and a Devil's Daughter\" Charles Michael Davis Celeste Vasquez & Carina Adly MacKenzie May 5, 2017 ( ) 407 0.93[20]\n\nDominic stabs Sofya with the Tunde Blade. Freya places a boundary spell on the compound. Elijah forces Vincent to perform another Harvest Girl ritual to link with the ancestors and trap the Hollow. Freya teams with Josh to trap Dominic and learn where the other remains are. Dominic only knows that the bones were long protected by guardians. Dominic threatens Keelin; when an angered Freya confronts him, he kills her and the protection spell fails. Vincent and Elijah's ritual goes awry, leading Vincent to call on Davina to help him complete the ritual. Dominic storms the compound and threatens Hope, so Klaus decapitates him. Marcel convinces Hope to free him. Keelin rushes to Freya and resuscitates her and they later kiss. Freya, tracking the guardians' lineage, learns one, a werewolf bloodline, died out with Tyler Lockwood, and that she and Elijah must travel to Mystic Falls to retrieve them. Vincent shares that he now has a permanent ally in Davina. Klaus and Marcel call a truce to defeat the Hollow. Sofya is awakened by the smokey woman figure, who is angry that the Ancestors are back. The girl has a crescent tattoo, just like Hayley and her father. She inserts herself into Sofya.\n\n74 8 \"Voodoo in My Blood\" John Hyams Talicia Raggs & Christopher Hollier May 12, 2017 ( ) 408 0.85[21]\n\nHope hears voices telling her that she and Hayley are connected to what is happening. The Ancestors send a warning. Alaric Saltzman heads to New Orleans with an item from the Lockwood estate. The search for the bones becomes a priority, and Marcel and his vampires join the Mikaelsons in searching. Sofya/The Hollow returns to Marcel. Hayley and Klaus meet with the Harvest girls who send them to talk with Davina who explains the history behind The Hollow. Davina takes Hayley and gives her information about the history of the Crescent pack. Alaric meets Sofya and requires rescue. Elijah and Marcel continue the search for the bones only to be confronted by Sofya. Hayley intervenes and things take a twist of fate. while Davina fights for a sacrifice in order to stop The Hollow, Hope shows her powers. Alaric and Hope meet and he later suggests to Klaus that she would be happy at the school he and Caroline run in Mystic Falls. Hayley and Elijah discuss their future together while Marcel spends time at Davina's grave. Elijah visits Marcel but is met by a murderous Sofya, inhabited by the Hollow.\n\n75 9 \"Queen Death\" Nicole Rubio Beau DeMayo May 19, 2017 ( ) 409 0.84[22]\n\nThe Hollow has poisoned and imprisoned Elijah. Hayley raises the alarm that Elijah is missing, and Klaus confronts Marcel. Freya continues to woo Keelin, who promises to stand by her side. Freya, Klaus, Marcel, Vincent and Hayley meet to make plans to finish the Hollow. Vincent's plan requires Elijah's death, which angers Klaus. Freya and Vincent search for a loophole. The Hollow reveals to Elijah that only Hope has the power to truly destroy her. Klaus offers himself as a sacrifice in Elijah's place, causing Vincent to tell him that Camille would be proud of him. Marcel offers the jawbone to the Hollow in exchange for Sofya. Vincent's spell and Klaus' sacrifice goes awry when the Hollow's acolytes intervene. Freya and Hayley attempt to rescue Elijah while the Hollow leaves Sofya before attacking Marcel. Elijah is killed, giving the Hollow the power it requires to be reborn. Vincent encourages the witches to leave New Orleans until he tells them it is safe to return. Hope and Freya search for Elijah in the broken pendant. Vincent requests his dark magic journal back from Marcel, putting his life at risk. The Hollow is reborn as Inadu.\n\n76 10 \"Phantomesque\" Daniel Gillies K.C. Perry & Kyle Arrington June 2, 2017 ( ) 410 1.03[23]\n\nRebekah and Kol are partying when vampires around them begin dying. They realize these vampires are from Elijah's sire line and return to New Orleans. Marcel and Josh work to revive Sofya. Inadu massacres the witches who had followed her. She tells Marcel that she can heal Sofya if he pledges loyalty before attacking him. Rebekah, Kol and Klaus hunt for the poisonous rose thorns in order to destroy them. Kol becomes angry when he finds that the Ancestors are back and goes looking for Davina. Hayley goes into the pendant to look for Elijah after Freya fails in her attempt. They use Hope as an anchor. She finds Elijah behind the red door but flees when he does not recognize her. Marcel finds the last rose thorn but Rebekah takes it from him. He tells her about Sofya and she returns it to him on the understanding that he destroy it when done. Freya puts Hope into the pendant to rescue Hayley. When she uses magic, it shocks Elijah and brings him to them, making the pendant whole. Inadu brings Davina back but it creates a link between them, binding Kol to them both.\n\n77 11 \"A Spirit Here That Won't Be Broken\" Hanelle Culpepper Carina Adly MacKenzie & Michael Russo June 9, 2017 ( ) 411 0.89[24]\n\nKol refuses to lose Davina again and tries to find a way to kill Inadu without Davina dying. Inadu charges Kol with safeguarding her protection totem from the Mikaelsons. Freya realizes that Hope's blood is the only thing that will kill the Hollow. Rebekah asks Kol to help her locate the totem. Marcel joins the search and they are trapped by dark magic, realising that Kol is involved. Time is running out for Elijah as the pendant begins cracking. Freya and Hayley confront Inadu. They confront visions and nightmares, with Hayley finding herself in the bayou with Jackson. Kol approaches Hope and asks her to do a spell for him. Marcel and Rebekah find a unique way to break free of the dark magic holding them. Davina visits Josh while Kol and Klaus fight at the compound, resulting in Klaus breaking the totem and preparing to dagger Kol. As Hayley kills Inadu, Davina experiences the same pain. Hope completes the spell and collapses. She is awoken by a blue light. Kol and Davina leave New Orleans. Freya and Klaus resurrect Elijah while Hayley chooses to spend time in the bayou.\n\n78 12 \"Voodoo Child\" Michael Grossman Michelle Paradise & Christopher Hollier June 16, 2017 ( ) 412 1.01[25]\n\nVincent is attacked and the journal stolen. Elijah is angry because Hayley is avoiding him. Believing the Hollow has been defeated, the Mikaelsons continue their lives. Freya and Keelin get together. Marcel tells Rebekah the family has to leave New Orleans and that the kiss was a mistake. Sofya wakes from her coma and tells Marcel the Hollow is still out there. Vincent tells Klaus and Elijah the same thing. Elijah admits that Hayley will never accept him now she has been behind the red door. The family realize that Hope has been possessed by Inadu, and Hayley demands she leave her baby. Vincent sends Klaus into Hope's mind to encourage her to fight while he and the others return to the compound to confront Inadu. Hope destroys the journal, leaves the compound and meets the Hollow acolytes in the church.\n\n79 13 \"The Feast of All Sinners\" Bethany Rooney Michael Narducci June 23, 2017 ( ) 413 0.80[26]", "images": ["https://upload.wikimedia.org/wikipedia/en/e/e6/The_Originals_S4_Poster.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e6/The_Originals_S4_Poster.jpg/220px-The_Originals_S4_Poster.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/e6/The_Originals_S4_Poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Originals_(season_4)", "title": "The Originals (season 4)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/e/e6/The_Originals_S4_Poster.jpg", "width": 640, "height": 960}, "title": "The Originals (season 4) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}