{"url": "http://toofab.com/2018/11/12/2018-peoples-choice-awards-moments-nicki-minaj-shadowhunters-victoria-beckham-shelton-stefani-gurira/", "text": "Getty\n\n\"Shadowhunters\" comes from nowhere to dominate, Victoria Beckham gives a Spice Girls tease, Danai Gurira kicks everyone's ass and Nicki Minaj hits on them.\n\nMoving the \"People's Choice Awards\" to E! may have been the right call, as fans were treated to a brisk show with plenty of shocking wins and fun moments along the way.\n\nAnd by fun, we mean awkward as in whenever Nicki Minaj decided to mention anyone in one of her acceptance speeches. The \"Queen\" rapper had a very good night, and so did the people she decided to shout-out, though there was surely some blushing as well.\n\nThe night was positively glowing for \"Shadowhunters,\" a cult television show on Freeform that made a huge statement at the PCA's to the point its own stars were flabbergasted by what was unfolding before them. It was a beautiful and powerful message from that show's fervent fans to the actors who work so hard for them.\n\nThe PCAs was filled with tributes and mentions of the tireless work of the firefighters and rescue crews working around the clock in Southern California battling the two wildfires endangering so many lives and homes. There were also tributes for Veterans Day and the recent Borderline mass shooting.\n\nIt was a powerful, energetic and moving night and easily one of the best awards shows we've had all year long. The awards may not be as prestigious, but E! clearly knows how to put on an entertaining show. Who knew after all these years watching them hamming it up on the red carpet, we probably should have just given them the whole show.\n\nCheck out the night's most memorable moments below:\n\nNicki Minaj Hits on Michael B. Jordan Hard\n\nNicki Minaj was not subtle during her acceptance speech for female artist of the year. After thanking designer Donatella Versace for her killer look, the rapper with the killer curves added with a wink, \"And shout out to Michael B. Jordan cause he's gonna be taking it off of me tonight.\"\n\nUnfortunately, Jordan wasn't on hand to offer what we're sure would have been a priceless reaction, but we all probably made the same face he was making. It looks like, \"Dayum!\"\n\nThe Kardashians Speak Out on \"Really Rough Week\"\n\nAccepting the award for favorite Reality TV Show of 2018, the Kardashians dedicated their win to the firefighters, first responders and law enforcement working hard to put out the fires in Los Angeles, as well as reacting to the \"horrific shootings\" near their home.\n\n\"It's been a really rough week in our home in Calabasas, Hidden Hills, and our neighbors in Thousand Oaks and Malibu. Our hearts are broken from the horrific shootings and those who have lost their lives and homes as well as the hundreds of thousands of us that have been evacuated from the devastating fires that are currently burning,\" said Kim during the speech.\n\n\"Action is necessary. So anything that we can do to help, as simple as donating to the many organizations that are collecting supplies, no form of help is too small,\" she continued. \"Our country is stronger when we come together and we cannot face devastation alone. We must continue to reach out and help each other in these trying times. So thank you so much to all of the people who have voted for us. This is such an honor, and we would like to dedicate this win to all of the firefighters, the law enforcement, and the first responders. We really truly appreciate what you have done for all of us, so please let's continue to pray for everyone's safety.\"\n\nDanai Gurira Proves Women Kick Ass\n\nAs if there was any doubt about Danai Gurira's kick-assery, we submit as Exhibit A her eight seasons on \"The Walking Dead.\" She was nominated for Exhibit B, her badass work in \"Black Panther.\" In fact, she squared off against King T'Challa himself, Chadwick Boseman, and emerged victorious.\n\nGurira was the only female in the superhero-dominated category, besting Chris Pratt, Chris Hemsworth and Ryan Reynolds as well, and we say it's about damned time. Oh, and pay attention to things like this, Hollywood. Every time you try to shut down a female-led action movie because you don't think audiences will support it, look back at this moment.\n\nLook at Danai Gurira's face as Okoye, or face her down as Michonne, and dare to tell her people wouldn't be interested in watching her kick some butt. Hell, we'd be down to watch her kick your butts!\n\nNicki Minaj Pays Tribute to Kim Kardashian's Ass\n\nNot done after her first cheeky dedication, Minaj was at it again later in the night, this time giving a shout-out to another famous derriere.\n\n\"I'm going to dedicate this award to Kim Kardashian's ass in that dress tonight,\" Nicki Minaj said, winning the award for best album of the year for \"Queen.\" And if anyone knows a thing or two about \"ass,\" it's gotta be Queen Nicki!\n\nTo her credit, we're totally going to have to agree about this one, too. Kim is known for her wild fashion choices and always knows how to stand out, but the pattern and style of this dress are a cut above. It not only draws the eyes, it doesn't let them go. Poor Nicki must have looked at it just before going on stage.\n\n\"Shadowhunters\" Has a Crazy Fanbase\n\nWe know, this show's existence probably comes as a shock to a lot of people, but not to the people who vote for the People's Choice Awards. Not only did the show get nominated, it dominated the television categories, picking up awards for TV show of 2018 as well as male and female TV star for Harry Shum Jr. and Katherine McNamara, respectively, and bingeworthy show of the year.\n\nEver feel like you must be missing out on something that all the cool kids already know about? That's how many people in the room were probably feeling as \"Shadownunters\" won again and again over such stiff competition as \"This Is Us,\" \"Grey's Anatomy,\" \"13 Reasons Why\" and all the stars of \"Riverdale.\"\n\nOn top of that, the show wasn't even on the ballot in any of those categories, so it was fan write-in votes that put them on the ballot and then on top. It was only on there originally for sci-Fi/fantasy show, and ironically lost that one to another cult favorite, \"Wynonna Earp.\"\n\nAnd yet, the Freeform series is set to wrap after a three-season run in February 2019. After this kind of fan showing, maybe some suit who makes these kinds of decisions should start reconsidering.\n\nVictoria Beckham's Haircut en Route to PCA's\n\nSo, that happened. On her way to picking up the first-ever Fashion Icon Award, former Spice Girl -- and will you just agree to go on tour with them again already -- Victoria Beckham knew her look had to be on point and fresh, so what better than a fresh 'do.\n\nAnd the way to get the freshest hairstyle was to cut and style her hair on the way to the People's Choice Awards. Talk about service!\n\n\"So we are now doing hair and makeup in the car. A quick haircut. Why are you doing this, Ken?\" Beckham asked her hairstylist Ken Paves in a video shared to her Instagram Stories on Sunday, teasing him for being \"late,\" as she put it.\n\nTo his credit, despite the rocking and rolling of the car as he worked, she looked great when she accepted her award and spoke of empowering women and even quoted the Spice Girls. You wicked tease, you!\n\nBlake Shelton and Gwen Stefani Are Adorkable\n\nBlake Shelton and Carson Daly were on stage accepting the award for competition TV show \"The Voice\" when Shelton decided to invite his girlfriend Gwen Stefani up on the stage. \"What am I doing up here?\" she asked, and we couldn't help but wonder if Shelton was going to pull a Glenn Weiss and propose to her (see 2018 Emmys).\n\nHe didn't, though, instead just gushing love at her as Daly awkwardly tried to joke that they were going to get a room later.\n\nYou all know that Carson Daly is the most awkward person associated with \"The Voice,\" right? And that includes a squirming Gwen Stefani who nevertheless won over everyone with her adorable, \"I'm so excited to be with Blake Shelton.\"", "images": ["https://images.toofab.com/image/3f/3by2/2022/10/05/3ffae1c2aa4b4ae08bba9ca0ffca7702_md.jpg", "https://images.toofab.com/image/0c/2by3/2022/10/03/0c8eaaa39c934072b49d2d26590b3acf_xs.jpg", "https://images.toofab.com/image/b8/16by9/2018/11/12/b8710260ff3858d8b1fd71a71d7488d7_xl.jpg", "https://images.toofab.com/image/02/2by3/2022/10/06/02f8dae158224fef81315cde92fc9ef1_xs.jpg", "https://images.toofab.com/image/1b/5by4/2018/11/05/1b2297dd0e1d5cb79d71eb97a56b45e8_xs.jpg", "https://images.toofab.com/image/7b/4by3/2022/10/06/7ba6d79f88e14d70bffca38d3f38c318_sm.jpg", "https://images.toofab.com/image/39/2by3/2022/10/03/39d6ab76bda6491b896e9683c766c3f6_xs.jpg", "https://images.toofab.com/image/03/5by4/2018/11/02/03569d2bf3a05731b6e033ceb19cee66_xs.jpg", "https://images.toofab.com/image/ad/5by4/2018/11/06/ada04f4d814f5566b22a34c931534070_xs.jpg", "https://images.toofab.com/image/49/2by3/2022/10/07/49f6de19a159456189138e9c903768cd_xs.jpg", "https://images.toofab.com/image/06/2by3/2022/10/07/06987f7243784718b93e1692e8b75099_xs.jpg", "https://images.toofab.com/image/9d/5by4/2018/10/30/9db738f6fedb547ba40d1ba78233436f_xs.jpg", "https://images.toofab.com/image/90/5by4/2018/09/18/90b8126c12d35ea9b1da8bb414ed8299_xs.jpg", "https://images.toofab.com/image/c2/o/2018/11/12/c297fbe487f158b3be157bdbec413e6c_md.jpg", "https://images.toofab.com/image/4a/2by3/2022/10/05/4ab592e0012c4eb98454932121fdd26d_xs.jpg", "https://images.toofab.com/image/b0/2by3/2022/10/05/b0deec921f8b44509a87f506c556a741_xs.jpg", "https://images.toofab.com/image/9a/2by3/2022/10/05/9acbe7261a034df88e225ae344cc7b2a_xs.jpg", "https://images.toofab.com/image/d3/2by3/2022/09/30/d30f8b9e23b048888812dd3ff17ead97_xs.jpg", "https://images.toofab.com/image/01/4by3/2022/10/06/013d042ece3a4d118b04c8602c6f5ba9_sm.jpg", "https://images.toofab.com/image/2e/5by6/2022/10/07/2e19fe6a0f3844bb8a4f2cc475a9e16e_md.jpg", "https://static.toofab.com/toofab-web/img/toofab-logo-white.svg", "https://images.toofab.com/image/d3/2by3/2022/10/05/d3d12f54e0604ac681d1eb3b1444c7f3_xs.jpg", "https://images.toofab.com/image/70/4by3/2022/10/06/70ec19b507384877a3d5fd60b8f33bbf_sm.jpg", "https://images.toofab.com/image/64/5by6/2022/10/05/643d928365e2499a88cf9121fdde59dd_md.jpg", "https://images.toofab.com/image/2b/2by3/2022/10/06/2bbcf07aba1846b282ce6b184e453df8_xs.jpg", "https://images.toofab.com/image/07/2by3/2022/10/04/0724125990d24cb58f2a45d2f0245b19_xs.jpg", "https://images.toofab.com/image/5a/4by3/2018/11/09/5a63bdf0bca95d65953149ada8de7f62_md.jpg", "https://images.toofab.com/image/e0/5by4/2018/11/05/e0383c7218bf57b9abc7f6eb4a3ca84f_xs.jpg", "https://images.toofab.com/image/b5/3by2/2022/10/06/b57c8717abd041158cf14bf322b41ea3_md.jpg", "https://images.toofab.com/image/a2/4by3/2022/10/05/a2112e7fc22c4fdda98ee922cc4bd6a2_sm.jpg"], "top_img": "https://images.toofab.com/image/b8/16by9/2018/11/12/b8710260ff3858d8b1fd71a71d7488d7_xl.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2018/11/12/2018-peoples-choice-awards-moments-nicki-minaj-shadowhunters-victoria-beckham-shelton-stefani-gurira/", "title": "2018 People's Choice Awards: The Only Moments Anyone Will Be Talking About", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "google-site-verification": "JHSxtKhEsTL_hpvIJB7Z_rx6B--w25QC-LHhSPPDFbc", "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "robots": "index,follow", "description": "The \"People's Choice Awards\" moves to E! and brings plenty of surprising moments with Nicki Minaj, Victoria Beckham, Kim Kardashian, Blake Shelton and more.", "article": {"publisher": "https://www.facebook.com/toofab"}, "og": {"site_name": "Toofab", "type": "article", "url": "https://toofab.com/2018/11/12/2018-peoples-choice-awards-moments-nicki-minaj-shadowhunters-victoria-beckham-shelton-stefani-gurira/", "title": "2018 People's Choice Awards: The Only Moments Anyone Will Be Talking About", "description": "The \"People's Choice Awards\" moves to E! and brings plenty of surprising moments with Nicki Minaj, Victoria Beckham, Kim Kardashian, Blake Shelton and more.", "image": "https://images.toofab.com/image/b8/16by9/2018/11/12/b8710260ff3858d8b1fd71a71d7488d7_xl.jpg"}, "twitter": {"site": "@Toofab", "card": "summary_large_image", "title": "2018 People's Choice Awards: The Only Moments Anyone Will Be Talking About", "description": "The \"People's Choice Awards\" moves to E! and brings plenty of surprising moments with Nicki Minaj, Victoria Beckham, Kim Kardashian, Blake Shelton and more.", "image": "https://images.toofab.com/image/b8/16by9/2018/11/12/b8710260ff3858d8b1fd71a71d7488d7_xl.jpg"}, "application-name": "Toofab.com", "mobile-web-app-capable": "yes", "theme-color": "#f3f3f3", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "#f3f3f3", "apple-mobile-web-app-title": "Toofab.com", "msapplication-TileImage": "https://static.toofab.com/toofab-web/icons/msapplication-tile-image-270x270-v1.png", "msapplication-TileColor": "#282828", "msapplication-starturl": "https://toofab.com/?adid=IE9pin", "msapplication-navbutton-color": "#282828", "msapplication-window": "width=1024;height=768", "msapplication-tooltip": "Toofab.com", "msapplication-task": "name=Photos;action-uri=https://toofab.com/photos/;icon-uri=https://static.toofab.com/toofab-web/icons/favicon-32x32-v1.png"}, "movies": [], "publish_date": 1541980800.0, "source": "http://toofab.com", "summary": ""}