{"url": "https://www.thecut.com/2017/12/keeping-up-with-the-kardashians-season-14-episode-11-recap.html", "text": "Photo: Courtesy of E! Entertainment\n\nOn this week’s episode of Keeping Up With the Kardashians, our A-plot was Kris Jenner’s manipulation, our B-plot was Kim Kardashian’s announcement, and our C-plot was Kourtney Kardashian’s new relationship. Jonathan Cheban isn’t going to hate on himself, so #LEGGO!\n\nScene 1/Cold Open:\n\nKourtney Kardashian entertains Kim Kardashian, Khloé Kardashian, and family ward Jonathan Cheban. Out of nowhere, Kourtney says that Jonathan is the one person to go to for advice. Jonathan agrees, while Khloé finds it funny that once upon a time, Kourtney hated Jonathan and Former Greatest Assistant of All Time Steph Shep — but now she’s attached at the hip to both of them. Kourtney, too, marvels at how the tides have changed.\n\nSomehow, following this conversation, Jonathan proves that he may be the only one of the group with a sound mind: Khloé sneezes, and Kim says, “Gesundheit.” Khloé asks who says that word in response to a sneeze, and Jonathan says it’s Yiddish (which, it’s not). Then Kim, Kourtney, and Khloé wonder aloud what Yiddish is. They all realize that they’ve lived their whole lives thinking Yiddish was the cousin to “gibberish” and possibly had something to do with “British.” Finally, Jonathan tells them that Yiddish is a form of Hebrew, and everyone just sits in confusion. This scene was filmed on May 5, 2017.\n\nScene 3:\n\nKylie Jenner holds a Lip Kit meeting with Kourtney Kardashian and Jordyn Woods at Kris Jenner’s home. Sequestered away in the kitchen with their mom are Kris’s other daughters, Kim and Khloé. Kim tells Khloé and Kris that the night before Saint was whispering in his sleep “shoes … dada,” which tracks with his love of shoes and all things Yeezy, according to Kim. Aside from discussing the littlest tastemaker in Southern California, Kim and Khloé wonder why Kris is knee deep in Kylie’s business affairs and never bothers to check in on theirs.\n\nKris explains that she’s still helping to get Kylie off the ground, which sounds like B.S. to Kim and Khloé since Kylie’s business has been running for nearly two years and she’s made billions. They suppose the real reason is that Kylie makes her the most money, therefore she’s the current favorite and deserves the most attention. Kris does think that Kylie’s general niceness and desire to be around her mother makes her an obvious favorite — and the success doesn’t hurt. Especially since Kylie makes a point to buy Kris fun things to let her know she’s thinking about her. This shocks Kim and Khloé, who got Kris the ultimate fun thing, a surprise 60th birthday party in 2015. And on top of it all: Kendall and Kylie had no thoughts about her 60th birthday at all. Kim and Khloé argue that memories are better than physical gifts. Kris is beyond annoyed, and jokes that these two are now tied for her least favorite. This scene was filmed on August 16, 2017.\n\nScene 5:\n\nVying for the top spot in her mother’s life, Khloé shows up to Kris’s to reorganize her kitchen. According to Khloé and Kris’s assistant, Jenna, Kris has always envied Khloé’s kitchen and her “Khlo-C-D” (still very problematic) organizational skills. Today, Khloé’s bringing her skills all the way to Kris.\n\nIn the midst of Khloé’s project, Kris shows up and is thrilled. She’s excited about the organized cookies and teas, and she can’t believe her luck. Interrupting their love fest, Kim arrives carrying Kris’s favorite basket-weave cake from Hansen’s bakery. Kris can’t believe that her other daughter would be so kind as to drop off a cake just because. She’s overwhelmed with gratitude. She’s also overwhelmed with an idea to get more treats from her kids … so she casually throws in that this is all the cherry on top of her day of massages with Kylie. Like Scene 3, this scene was filmed on August 16, 2017. Which makes a busy day for our Kardashian and Jenner women!\n\nScene 8:\n\nStill eager to win over all of her mom’s affection, Khloé rents out the entire Saks Fifth Avenue in Beverly Hills for a shopping spree with Kris Jenner. The ladies first start with sunglasses, and are completely stunned by a pair that has lenses that lift up to reveal another pair of clear lenses. Then they take a look at clothes, including matching jumpsuits that Kris wants to wear out on the town. Khloé thinks she’s done it — after this trip, the other kids will be dead to Kris. Odd that Khloé was trying to win over her mom’s affection months before her competition with Kim started, since this scene was filmed on May 19, 2017.\n\nScene 12:\n\nAt Khloé’s house, Kim and Khloé concoct a plan to get Kourtney to admit she has a boyfriend. Even after months of dating, Kourtney’s withheld details — even from her sisters — about the young, hot model she’s dating, Younes Bendjima. So they decide to FaceTime her with a possible (fake) setup with Chris Hemsworth, a.k.a. Thor. Khloé thinks that Chris is so hot and just the act of declining a date with him means her sister is spoken for. During the call, Kim and Khloé are a fit of giggles as they explain how handsome and gifted her potential suitor is, and even saying it’s Chris Hemsworth. Kourtney doesn’t bite. She claims to be busy, but the sisters know that’s a lie. Even after the sisters reveal their prank and accuse her of being committed, Kourtney admits nothing. This scene was filmed on August 25, 2017. Which makes sense, because Kim is obviously wearing a wig to conceal the yellow hair she had to wear before going platinum blonde in early September.\n\nScene 13:\n\nPossibly pregnant sisters Khloé Kardashian and Kylie Jenner visit Kim Kardashian at her Bel Air home. The sisters struggle in the 106-degree heat as they climb the steps to Kim’s home, lamenting their outfit choices. Kim’s prepared salads for only herself and Kylie (unfortunately, Kim doesn’t explain why a salad was not prepared for Khloé!), but what’s even more shocking than that is a rogue blender sitting on her kitchen counter.\n\nEarlier in the episode, Kris bragged to Khloé and Kim about a SMEG toaster that Kylie bought her “just because” — now Kim is giving Kris a SMEG blender to match her other new appliance. Kylie is very confused, and tells the ladies that she never bought her mom a blender and they didn’t even get massages together because Kylie doesn’t like them. This admission turns on a light for Kim and Khloé who now realize that they’ve been played! Kim and Khloé call their mother a “manipulator” and “pathological liar,” and vow to get her back. This scene was filmed on August 27, 2017.\n\nScene 14:\n\nAt the home of Master Manipulator Kris Jenner, Kim and Khloé Kardashian patiently wait for their mother to enter the kitchen so they can toss cake on her as payback. Yet again, they’ve gotten basket-weave cakes from Hansen’s (these cakes cost hundreds of dollars) and as soon as Kris enters, she’s greeted with a fake hug and a cake to the head.\n\nAlarmed, Kris asks why she’s being attacked, and Khloé and Kim happily explain that it’s because she’s a liar using her kids against one another in order to get free goods and services. Kris doesn’t see what she’s done as a scam, and instead thinks her daughters should view her trickery as a life lesson. Basically: Don’t mess with Kris because she will turn the tables on you. Kim and Khloé aren’t satisfied, so they toss yet another cake on their mom. I love seeing Kris covered in desserts, but what I love even more is seeing Khloé and Kim eat cake off the floor. That alone is worth my Spectrum cable package, as trash as it may be. Like Scene 14, this scene was filmed on August 27, 2017\n\nScene 15:\n\nAt home, Kim FaceTimes her family to let them know some great news: Her surrogate is pregnant with a baby girl! It’s no surprise that she’s been trying, so everyone’s happy for her, especially Kris Jenner, who immediately cries.\n\nKhloé and Kourtney’s reactions are a bit more measured, as they, and even Kim, are unsure of how to properly celebrate the news of a new Kardashian baby when the Kardashian isn’t carrying the baby. It’s a first for the family! (One official KUWTK pregnancy announcement down, two to go.) This scene was most likely filmed on May 9, 2017, considering Khloé mentioned “Taco Tuesday” during her chat with Kim, and this was the last Tuesday of May where Kim had her hair this length, and she also Snapchatted with that phone case on that same day.\n\nScene 17:\n\nAt Khloé’s house, Khloé entertains her sisters Kourtney and Kim. Kim drags the Daily Mail, which the previous day said she toured the home she “shared with Kris Humphries.” Now, Kim did tour her old home the day before, but she says the Daily Mail needs to “stop reaching” because “boo didn’t even have a toothbrush, honey!”\n\nKim then moves on to the more serious topic of feeling a disconnect because of the surrogate. Her sisters admit that they even forget she’s expecting a baby sometimes, especially since they don’t see the surrogate. Kim says the reason for that is to protect the woman’s privacy, and to keep her safe. During her previous pregnancies, Kim says, she nearly got into a car accident because of the paparazzi following her. Kim is going to every doctor’s appointment, and she’s hoping to find a way to better connect with her surrogate and baby. This scene was filmed on July 28, 2017.\n\nScene 18:\n\nIn the final scene of the night, Khloé and Kourtney tell Kim about the fight they had over Kourtney’s refusal to acknowledge her new boyfriend Younes. Kourtney says it’s because she doesn’t want to bring her relationship on the show (despite the fact that he’s been featured on KUWTK already this season … ). They’ve since made up, and Kourtney is now more comfortable with calling Younes by name or at the very least calling him “Y.” She’s also admitting that he is, in fact, her boyfriend. This is leaps and bounds more open than she’s been in the past regarding Younes, but she’s still cagey about how far her feelings go. She won’t say she loves him, but she does say he’ll be joining her workouts soon, which in the Kardashian family means a ring isn’t too far down the line. This scene was filmed on August 27, 2017.\n\nThat’s it for this week, Dolls! Can’t wait to see you back here next week for another #KUWTKE recap of Keeping Up With Basket-Weave Cake. #LETTHEMEATFLOORCAKE", "images": ["https://pyxis.nymag.com/v1/imgs/921/72c/19c6a97afc443ca55a3a04d55fb3417b00-11-KUWTKE.rsquare.w330.jpg", "https://pyxis.nymag.com/v1/imgs/e33/6e7/aed044d06bd5c293490430f400dc112e41-2022Cov4x5-AsianAmericaPkg.w240.jpg", "https://pyxis.nymag.com/v1/imgs/641/968/28ed793967c8a7042fae7335383f14601c-KUWTKE-33.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/2bd/150/6d0b0b4edd24c77ea777adab2a10fdb4af-KUWTKE-01.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/dec/17e/d5704b59249bd95a263debfe2dd31e7b70-KUWTKE-08.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/bd9/2c6/07b6eaac9fafd3ba70100771b97fa1cc3c-KUWTKE-12.h473.w710.jpg", "https://www.thecut.com/media/components/customer-alert-banner/double_chevron.svg", "https://pyxis.nymag.com/v1/imgs/e51/c94/543aca12760317503e938cd665c63d0359-KUWTKE-16.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/c32/3bf/0a393283dc1f3f9257ff8b361ea03216c8-russia-missile.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/5ea/81e/4d3b39a96107c321338c0c9a25557bd47f-zarifa-ghafari.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/6a1/589/f381beb9b004183b138c86e192e7f536c3-KUWTKE-15.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/43e/1d1/2024108b95da8665dc18d94838658855df-KUWTKE-10.h473.w710.jpg", "https://www.thecut.com/media/components/customer-alert-banner/alert.svg", "https://pyxis.nymag.com/v1/imgs/9d7/41c/bc1e542ef0e13e2f6b78c4808f5b95b168-KUWTKE-14.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/6f3/616/3d72942ea2cbfba5e6e83d2ef5488249d9-KUWTKE-17.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/9ec/930/e8c33df81744b09be203b2589919f2d21e-KUWTKE-02.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/b0b/cf0/e6bd72174f0670e26fcd39b7daa2332dc0-KUWTKE-03.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/5ba/887/f6ccebad638235ecfa34cd938e0f2cb9b2-KUWTKE-31.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/756/14a/074c46bc4a776236890d223dbf06b5d560-KUWTKE-07.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/428/ea2/dca43237ad268fcc284296e026ebf9001c-KUWTKE-19.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/9e6/d01/7ceb8a5c105b4cb20e2107c997587c6a9b-KUWTKE-05.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/dd1/057/c6220d2f4491a6fd3a663abb0148afd5a6-KUWTKE-18.h473.w710.jpg", "https://www.thecut.com/media/components/customer-alert-banner/close_x.svg", "https://pyxis.nymag.com/v1/imgs/b02/dd8/591cfff423518c7d9b3c7533859142a668-KUWTKE-11.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/129/e6e/fcc2d3099e5e201776d06c92a120ffd3de-KUWTKE-21.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/31a/165/7b2cda49d5258316afceb071e56d8d3a8b-women-3.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/993/8fd/bdc3ff7da56077ccda9560fc22a9dfcb22-KUWTKE-26.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/e63/20e/ee76b6b65fed6850348cb021529f7726f0-KUWTKE-30.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/0d6/e24/edef598539719d461d983cd889674021b1-KUWTKE-06.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/921/72c/19c6a97afc443ca55a3a04d55fb3417b00-11-KUWTKE.1x.rsocial.w1200.jpg", "https://pyxis.nymag.com/v1/imgs/768/914/1be8c411d702c8f73f89d76808380121aa-KUWTKE-04.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/554/b88/8554ee4cfdb4f2c39dd106b65e674009b8-KUWTKE-22.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/d37/831/e3ba2ac4377304f199aad60aee27d91019-KUWTKE-25.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/f0e/51a/e18a74be0aaff1c989cf8500f9c3dc3137-KUWTKE-20.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/bce/607/eb7769d7d28d3913a9a67c9465440eae86-KUWTKE-23.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/c57/b0c/d1f7f5e97987710cf7b716f5a64d32702a-KUWTKE-24.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/d1e/6de/1c1df7022a9cfaf047979d71b3208f7e08-KUWTKE-13.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/857/d3e/24cd7bd4d4cdb8ef493b3899731627e8b6-KUWTKE-32.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/575/336/84fb6277c9d36f89787664586427533768-KUWTKE-09.h473.w710.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/921/72c/19c6a97afc443ca55a3a04d55fb3417b00-11-KUWTKE.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Mariah Smith"], "canonical_link": "https://www.thecut.com/2017/12/keeping-up-with-the-kardashians-season-14-episode-11-recap.html", "title": "How Does Kris Jenner Choose Her Favorite Child?", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "parsely-tags": "kontinuity errors, keeping up with the kontinuity errors, keeping up with the kardashians, kim kardashian, khloe kardashian, kourtney kardashian, kris jenner, kylie jenner, culture, featuretype:tv recap", "og": {"title": "How Does Kris Jenner Choose Her Favorite Child?", "url": "https://www.thecut.com/2017/12/keeping-up-with-the-kardashians-season-14-episode-11-recap.html", "description": "Find out, in this week’s Keeping Up With the Kardashians recap.", "image": "https://pyxis.nymag.com/v1/imgs/921/72c/19c6a97afc443ca55a3a04d55fb3417b00-11-KUWTKE.1x.rsocial.w1200.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "How Does Kris Jenner Choose Her Favorite Child?", "description": "Find out, in this week’s Keeping Up With the Kardashians recap.", "image": "https://pyxis.nymag.com/v1/imgs/921/72c/19c6a97afc443ca55a3a04d55fb3417b00-11-KUWTKE.2x.rsocial.w600.jpg", "card": "summary_large_image", "site": "@TheCut"}, "article": {"published_time": "2017-12-11T16:28:50.741-05:00", "tag": "kontinuity errors, keeping up with the kontinuity errors, keeping up with the kardashians, kim kardashian, khloe kardashian, kourtney kardashian, kris jenner, kylie jenner, culture", "publisher": "https://www.facebook.com/cut"}, "description": "On the 11th episode of the 14th season of Keeping Up With the Kardashians, Kim and Khloe vie for Kris’s affections.", "robots": "max-image-preview:large", "sailthru.tags": "kontinuity errors, keeping up with the kontinuity errors, keeping up with the kardashians, kim kardashian, khloe kardashian, kourtney kardashian, kris jenner, kylie jenner, culture", "author": "Mariah Smith", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1513027730.741, "source": "https://www.thecut.com", "summary": ""}