{"url": "https://www.harpersbazaar.com/celebrity/latest/a19664485/meghan-markle-queen-elizabeth-ii-relationship/", "text": "Though Meghan, Duchess of Sussex, and husband Prince Harry have bid adieu to life as senior members of the royal family, the duchess revealed that Queen Elizabeth II has always been particularly kind to her during the Sussexes' tell-all interview with Oprah Winfrey.\n\nOn the difference between \"family\" and \"business,\" Meghan said, \"It's hard for people to distinguish the two because it's a family business, right? So there's the family. And then there's the people that are running the institution. Those are two separate things.\"\n\nThe duchess emphasized the distinction between those two concepts. \"It's important to be able to compartmentalize that because the queen, for example, has always been wonderful to me,\" she said. \"We had one of our first joint engagement together. She asked me to join her and I was on the train ... and we had breakfast together that morning.\"\n\nMeghan revealed that, during that engagement, the monarch had gifted her a set of pearl earrings and a necklace. \"I just really loved being in her company,\" said Meghan, adding a sweet anecdote from their time together. \"We were in the car going between engagements. And she has a blanket that sits across her knees for warmth, and it was chilly. And she was like, \"Meghan, come on,\" and put it over my knees as well. ... And it made me think of my grandmother, where she's always been warm and inviting and and really welcoming.\"\n\nQueen Elizabeth II sits and laughs with Meghan, Duchess of Sussex, during a ceremony to open the new Mersey Gateway Bridge on June 14, 2018. Jeff J Mitchell // Getty Images\n\nBelow, read on for the basics of the queen’s relationship with Meghan Markle.\n\n\n\nThey met before Meghan and Harry got engaged.\n\nUs Weekly reported that Meghan first met the queen in September 2017 at Balmoral Castle, and things apparently “went well,\" leaving Harry pleased about how his girlfriend got along with his loved ones. And it turns out that was the first of several meetings.\n\nIn the couple’s big post-engagement interview, Meghan said she had met the queen “a couple of times” and Harry had prepared her for what the meeting would be like. “It’s incredible. I think to be able to meet her through his lens, not just with his honor and respect for her as the monarch but the love that he has for her as his grandmother, all of those layers have been so important for me.\" She added, \"When I met her I had such a deep understanding and, of course, incredible respect for being able to have that time with her, and she’s an incredible woman.”\n\nThe queen’s corgis love her.\n\nGetty Images\n\nAlso in the post-engagement interview, Prince Harry noted that the Queen’s beloved corgis have never liked him—but they love his fiancée. “The corgis took to you straight away. For the last 33 years, I’ve been barked at, and this one walks in, absolutely nothing, just wagging tails,” Harry joked. “Just laying on my feet during tea, it was very sweet,” Meghan said. And it makes sense, because Meghan is an animal lover, who had two rescue dogs of her own at one point. (She reportedly had to leave one behind when she moved to London to live with Harry.)\n\nTheir first appearance together was at an important event.\n\nGetty Images\n\nOn March 12, the two made their first appearance together—along with other senior members of the royal family—at a service at Westminster Abbey celebrating Commonwealth Day. Harry and Meghan were seated directly behind the Queen and Prince Charles for the ceremony, which featured a performance by Liam Payne and celebrated the Commonwealth, which makes up 53 countries around the world and is headed by the Queen.\n\nShe gave Meghan the ultimate blessing, and no, there was no shade.\n\nIn March, the queen gave her official approval for Meghan and Harry to get married: \"My Lords, I declare My Consent to a Contract of Matrimony between My Most Dearly Beloved Grandson Prince Henry Charles Albert David of Wales and Rachel Meghan Markle, which Consent I am causing to be signified under the Great Seal and to be entered in the Books of the Privy Council.\"\n\n\n\nSome people suggested that this was less enthusiastic than the queen's announcement about Kate Middleton, in which she called her “trusty and well-beloved.” But that was in a separate document, and the announcements for both princes were actually extremely similar.\n\nThey reportedly discussed flower arrangements.\n\nVanity Fair reported that Meghan met with the monarch to talk about the particulars of planning a royal wedding, including flower arrangements. “She is very hands-on with everything,” a source told the magazine of Markle. “She met with the queen who wanted to talk through some ideas for flowers and introduced her to some of her events staff. Meghan is taking everything on board, but she has her own ideas when it comes to flowers.”\n\nPhillippa Craddock served as the official florist for the royal wedding. It looks like Markle and the Queen have great taste.\n\nMeghan's dog got to ride in a car with the queen.\n\nGetty Images\n\nYou know your future grandmother-in-law likes you when your dog gets the best seat in the house. Markle's beagle, Guy, was seen riding in a car with the Queen as the two made their way to Windsor days ahead of the royal wedding. Markle hasn't even been seen spending time one-on-one with the monarch, but Guy, a rescue pup from the United States, has received that honor.\n\nThe duchess trained with the queen's personal assistant.\n\nAs a part of her \"duchess training,\" Markle was reportedly guided by the Queen's assistant and private secretary, Samantha Cohen, as she continues to transition into royal life. \"It will be six months of listening, a source told The Times. \"She is seeking out advice on a range of people. She is going to proceed with humility. It is not going to be quiet, though. It's going to be a very busy office.\"\n\nRoyal biographer Ingrid Seward adds that Her Majesty is aware of the \"potential pitfalls\" of not giving new royals any guidance. “It’s all about the monarchy. She can’t expect Meghan to know everything without being shown,\" she told People. “She doesn’t want 70 years of hard work to be for nothing. I’m sure she feels Meghan needs a steadying hand in these early days.”\n\nTheir first joint engagement together was a success—and it included a sleepover.\n\nMarkle embarked on her first solo trip with the queen, without Prince Harry, to open the Mersey Gateway Bridge in Cheshire, celebrate the launch of the Storyhouse Theater in Chester, and attend a lunch at the Chester Town Hall, according to the royal family website.\n\nThe trip there included an overnight ride on the royal train, which means the duo will be having a royal sleepover. The pair shared a number of sweet moments together, from watching children's performances to wishing a young well-wisher happy birthday.\n\nGetty Images\n\nThey reportedly bonded over their sense of humor.\n\nA source tells Us Weekly that the in-laws have met private and publicly on multiple occasions, allowing them to bond more closely. Markle made a good impression on her grandmother-in-law after she \"quickly demonstrated that she is intelligent, polite and keen to learn,\" an insider told the site.\n\nApparently, her \"enthusiasm towards living a life of service and humanitarianism excites the queen and it’s just the type of vim and vigor she likes to see in someone.\"\n\nThe Queen also \"has a brilliant sense of humor,\" the insider added. \"That’s one of the first things that brought her and Meghan closer. It’s that warm side of her that has made Meghan feel so at ease.\"", "images": ["https://hips.hearstapps.com/hmg-prod/images/gettyimages-141707876-1522701898.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/hm-1589890755.jpg?crop=1.00xw:1.00xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/prince-harry-looks-at-his-bride-meghan-markle-as-she-news-photo-960051980-1544130764.jpg?crop=0.556xw:0.835xh;0.391xw,0.165xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/hbz-meghan-markle-queen-elizabeth-g976311684-1530107175.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/meghan-markle-style-1655915134.jpg?crop=0.502xw:1.00xh;0.250xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-974106742-1615175271.jpg?resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/hbz-prince-harry-meghan-markle-index-1526831107.jpg?crop=0.501xw:1.00xh;0.250xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/hbz-queen-elizabeth-car-1526661962.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-995394744-1615175310.jpg?crop=1.00xw:0.622xh;0,0.161xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/the-duchess-of-sussex-departs-after-her-wedding-to-prince-news-photo-960068514-1549489684.jpg?crop=0.669xw:1.00xh;0.100xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/pre-royal-1512328552.jpg?crop=0.502xw:1.00xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-995394744-1615175310.jpg?crop=0.8066666666666666xw:1xh;center,top&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/hbz-prince-harry-meghan-markle-index-1526934897.jpg?crop=0.502xw:1.00xh;0.232xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/duchess-of-sussex-and-prince-harry-duke-of-sussex-wave-as-news-photo-960173986-1544793777.jpg?crop=0.681xw:1.00xh;0.106xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/hbz-meghan-markle-wedding-gown4-1526758146.jpg?crop=0.698xw:1.00xh;0.0748xw,0&resize=180:*", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/network-logo.a5366f4.svg", "https://hips.hearstapps.com/rover/profile_photos/21445446-1bde-4290-a24e-2bdd274be027_1521573573.jpg?fill=1:1&resize=80:*", "https://hips.hearstapps.com/hmg-prod/images/pictured-rick-hoffman-as-louis-litt-gina-torres-as-jessica-news-photo-148451291-1548879078.jpg?crop=0.707xw:1.00xh;0.256xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1054546696-1543340962.jpg?crop=0.668xw:1.00xh;0.140xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/hbz-prince-harry-meghan-markle-cute-moments-2019-05-gettyimages-1142167978-2-1557339976.jpg?crop=0.494xw:0.987xh;0.229xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/hbz-queen-meghan-commonwealth-day-1522708545.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/vidthumb/images/screen-shot-2019-01-16-at-1-21-54-pm-1547662931.png?crop=0.7671930128983747xw:1xh;center,top&resize=480:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-995394744-1615175310.jpg?crop=1.00xw:0.622xh;0,0.161xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a19664485/meghan-markle-queen-elizabeth-ii-relationship/", "title": "Meghan Markle Queen Elizabeth II Relationship from How They Met to Post-Royal Life", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Meghan Markle Queen Elizabeth II Relationship from How They Met to Post-Royal Life", "description": "Meghan revealed that Queen Elizabeth \"has always been wonderful\" during her interview with Oprah Winfrey. Here's how Meghan gets along with Queen Elizabeth II.", "keywords": "prince harry, meghan markle, the queen, queen elizabeth ii, royal blessing, queen elizabeth, royal wedding, meghan markle the queen, meghan markle and the queen", "theme-color": "#000000", "og": {"site_name": "Harper's BAZAAR", "title": "Duchess Meghan Says the Queen Has \"Always Been Wonderful\" to Her", "description": "Meghan told Oprah that a sweet gesture from Queen Elizabeth II reminded her of her own grandmother.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-995394744-1615175310.jpg?crop=1.00xw:0.622xh;0,0.161xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.harpersbazaar.com/celebrity/latest/a19664485/meghan-markle-queen-elizabeth-ii-relationship/", "type": "article"}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "section": "Celebrity News", "modified_time": "2021-11-02T00:43:31Z", "published_time": "2021-03-08T03:54:00Z"}, "twitter": {"site": "@harpersbazaarus", "image": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-995394744-1615175310.jpg?crop=1.00xw:0.622xh;0,0.161xh&resize=640:*", "card": "summary_large_image"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-995394744-1615175310.jpg?crop=0.809xw:1.00xh;0.0962xw,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-995394744-1615175310.jpg?crop=0.809xw:1.00xh;0.0962xw,0&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-995394744-1615175310.jpg?crop=0.809xw:1.00xh;0.0962xw,0", "auto-publish": "timely", "sailthru.excerpt": "Though Meghan, Duchess of Sussex, and husband Prince Harry have bid adieu to life as senior members of the royal family, the duchess revealed that Queen Elizabeth II has always been particularly kind to her during the Sussexes' tell-all interview with Oprah Winfrey.On the difference between \"family\" and \"business,\" Meghan", "sailthru.tags": "celebrity,Celebrity,latest,Celebrity News", "sailthru.date": "2021-03-08 03:54:00", "sailthru.socialtitle": "Duchess Meghan Says the Queen Has \"Always Been Wonderful\" to Her", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 47}, "movies": [], "publish_date": 1615175640.0, "source": "https://www.harpersbazaar.com", "summary": ""}