{"url": "https://parade.com/627563/samuelmurrian/we-ranked-all-10-star-wars-films/", "text": "Before it was released in May 1977, not everyone was convinced George Lucas' space opera about a wizard, a farm boy and a princess would even be a hit, much less that over 40 years later Star Wars would still be one of the biggest names in pop culture.\n\nFollowing humble and scrappy beginnings, the Star Wars films have grossed over $10 billion, and with about $70-billion in total revenue to date, it's the fifth most lucrative entertainment brand ever.\n\nThough the best of the films are undisputed classics, there have been ups and downs (pretty much unavoidable after four decades). Here, we've ranked them all from worst to best.\n\nRelated: Star Wars Trivia—Take Our Quiz!\n\nNote: In ranking the series worst to best, we are judging the films based on their original cuts. Also, this list only covers theatrically released films in the franchise, so there will be no mention of the 1980s Ewok television movies or the 1978 holiday special (which is for the best).\n\nIn ascending order, here is our ranking of all 12 theatrical Star Wars movies.\n\nIan McDiarmid and Daisy Ridely in 'The Rise of Skywalker'\n\n12. Star Wars: Episode IX - The Rise of Skywalker (2019)\n\nRise of Skywalker is, easily, by some distance, the worst Star Wars movie ever. One feels uneasy just calling it a \"movie\" because that implies cohesiveness. Long-running rumors that eventually became unofficial news stories about this troubled production have proven to be true. Lucasfilm didn't have a plan for the sequel series--and it shows. Rise of Skywalker feels even lamer in light of the glorious payoff of the same year's Avengers: Endgame, Hollywood's ultimate testament to filmmakers planning ahead and staying organized.\n\nWhat's more, this feels like a point-of-no-return move for the integrity of this series. The Rise of Skywalker kowtows to toxic fandom, retconning, quite crassly, the bold decisions of The Last Jedi. This is a submissive, sloppy apology for a terrific movie. This is a series apologizing for itself when it didn't need to. Which just feels embarrassing.\n\nThe other side of this is: Thanks to all of the ridiculous everything-including-the-kitchen-sink choices that were clearly made by many, many people, The Rise of Skywalker is fitfully maniacally entertaining. The best Star Wars films, the ones that have rendered this series immortal in spite of its low points, are far smarter than the average blockbuster: spiritual, carefully plotted, romantic. Never before has there been a \"leave-your-brain-at-the-door\" Star Wars entry. If you aren't dead set on seeing grand entertainment that will move you, and you're willing to settle for a dumb fireworks show, you could do worse than this.\n\nThe best part: Accommodating performances from a cast of overqualified world-class performers do wonders for this structurally disastrous film. Best of all is Daisy Ridley, who's more responsible for developing the character of Rey than any of these scripts have been. The scavenger girl's backstory and arc are convoluted to the point of being flat-out obnoxious-- but this a fantastic actress; she brings real emotion wherever possible to what often feels like a B-grade video game.\n\nRelated: Here's Why Avengers Endgame Became the Biggest Movie of All Time\n\n11. Star Wars: The Clone Wars (2008)\n\nRoger Ebert summed it up perfectly with the first line of his 2008 review: \"Has it come to this?\"\n\nSet between the events of Episode II and Episode III, this 98-minute 3D animated novelty served as a big-screen lead-in to the premiere of the TV show of the same name two months later. The popularity and longevity of this decades-old series has a lot to do with how much it appeals to audiences of all ages, bringing families and generations together in passionate fandom. The Clone Wars works best for very young viewers, and thisis the only theatrical Star Wars film not to receive a single Academy Award nomination.\n\nReleased four weeks after The DarkKnight broke box office records and captured the zeitgeist, the Saturday morning serial approach of The Clone Wars felt dated andwas shrugged off by audiences, grossing $68.3 million worldwide (compare that to Revenge of the Sith's $849 million haul three years earlier). The cinematic future of the once-towering franchise remained in limbo for half a decade before Disney stepped in to shake things up.\n\nThe best part: The television series received a warmer reception, with positive reviews and an impressive six-season run.\n\nRelated: Star Wars Memes\n\n10. Star Wars: Episode II - Attack of the Clones (2002)\n\nOf all the live-action films in the franchise, this is the one that feels the most like it was untouched by human hands. Attack of the Clones was the first Hollywood studio feature filmed entirely with digital cameras, and nearly every shot is a special effects shot, every setting a green screen. There's so much going on in every frame, but all the digital trickery in the world can't overcome tedious plotting, thin characterization and a script in need of a rewrite (or two).\n\nIt's hard to overstate just how rich the writing of the original trilogy was, particularly the dialogue. Penned by Lawrence Kasdan, The Empire Strikes Back has the snappiest and most clever screenplay this side of Casablanca; virtually every line is now considered a classic movie quote. The only line from Attack of the Clones anyone quotes these days is Anakin (Hayden Christensen)'s intended-to-be romantic bit favorably comparing Padmé (Natalie Portman)'s skin to sand (and not for the right reasons). The prequels are oft-criticized for having wooden acting, but this really isn't fair. These movies are filled with world-class actors who've all been wonderful elsewhere; no one could have brought dialogue like this to life.\n\nOnce again, the ever-on-point Ebert nailed it in the first line of his 2002 review: \"It is not what's there on the screen that disappoints me, but what's not there.\"\n\nThe best part: In a film that mostly feels like it was made in a laboratory, Ewan McGregor's sparkling take on Obi-Wan Kenobi stands out. Here's to the upcoming Disney+ series.\n\nhttps://parade.com/393857/lharris-2/20-of-the-most-epic-star-wars-quotes-of-all-time/\n\n9. Star Wars: Episode I - The Phantom Menace (1999)\n\nWhen assessing why the first prequel (possibly the most hyped and breathlessly anticipated movie ever when it was released) didn't live up to hopes, it's easy and tempting to just say, \"Jar Jar Binks,\" and be done with it. And though the very existence of the 7-feet-tall motormouth cartoon rabbit boggles the mind, the miscalculations of The Phantom Menace are far more multifaceted and deeply rooted than this.\n\nInspired by Joseph Campbell's The Hero With a Thousand Faces and centuries of myth, the original trilogy is the epitome of a hero's journey. The Phantom Menace doesn't even have a protagonist. We're introduced to several goodies and baddies, but there's no central character to follow and no one has an arc. What's more, the tonal inconsistencies that first sprouted in Return of the Jedi are amplified here. Episode I's plot is at once far too complicated (trade and taxation are hardly the most exciting jumping-off points for a space adventure), and downright silly at times.\n\nIt's hard to say much about the legacy of The Phantom Menace that hasn't already been laid out in Red Letter Media founder Mike Stoklasa's exhaustive 2009 feature-length video review, a unique blend of absurdist humor and astute film criticism. Check it out after the jump.\n\nRelated: Best Star Wars Quotes and Yoda Quotes\n\nThe best part: John Williams' music in Episode I is characteristically terrific, rousing and lush. \"The Duel of the Fates,\" a standout piece performed by the London Symphony Orchestra and a full choir, elevates the highly choreographed, pretty-yet-emotionally-distant climactic lightsaber battle. \"The Duel of the Fates\" music video is the only classical music selection ever to appear on MTV's Total Request Live.\n\n8. Solo: A Star Wars Story (2018)\n\nThere are ingredients for a special film in here: a serviceable story, a solid script, and many terrific actors. But Solo is wildly uneven; jarring moments of meta-humor, like Han speaking Wookie and exhausting myriad winks to the older films, undermine an otherwise respectable narrative.\n\nOn the bright side of things, the cast is uniformly outstanding, and it can’t be overstated how much they help this movie out. Emilia Clarke is a presence as the galaxy far, far away’s first femme fatale. Paul Bettany is a menacing villain who could have used more screen time. Alden Ehrenreich had virtually impossible shoes to fill and insurmountable hype to live up to, and ultimately—he does a fine job with the role. It’s a winning performance.\n\nJohn Williams didn’t score Solo, and he's is sorely missed. As is the Force and the spirituality fans have connected with since day one.\n\nThe second half of Solo is overall more entertaining than the first, and it’s no coincidence that this is the part of the movie when Donald Glover’s Lando Calrissian steps in along with his robot partner L3-37 (Phoebe Waller-Bridge). Glover and the Emmy-winning Fleabag star aren’t just having a moment right now; they're planting the seeds of extraordinary respective careers. Glover and Waller-Bridge aren’t afraid to get weird [in the right ways] and take risks.\n\nThe best part: A train heist in the first act is thrilling and fresh enough to make us wish Lucasfilm had greenlit a standalone heist movie in the Star Wars universe instead of this origin story no one really asked for.\n\n7. Star Wars: Episode VII - The Force Awakens (2015)\n\nFew films have opened with as much riding on them as J.J.Abrams'soft reboot, and The Force Awakens was largely successful in revitalizing the brand and—most importantly—getting the Skywalker saga back on its feet. In setting a solid foundation for future installments, this entry played it safe and left audiences longing for fresh story elements and surprises—fortunately, Rian Johnson delivered this and more in The Last Jedi.\n\nAbrams directed the hell out of The Force Awakens, and every frame crackles stylishly with energy and confident precision. Ford's tender, funny, grizzled and authentic farewell as Han Solo is a highlight, but the pleasant revelation here was seeing the new stars take off. DaisyRidleyand Adam Driver in particularelevate the material every step of the way, giving Rey and Kylo Ren a chemistry worthy of previous franchise peaks.\n\nThe best part: Near the end, as Rey is accepting and exploring her powers, Ren interrogates her, probing the corners of her mind with the Force—then she turns the tables and freaks him out by doing exactly the same. \"You're afraid,\" she says, \"that you'll never be as strong as Darth Vader.\"\n\nThe best part (runner-up): Thanks to a suggestion from his filmmaker friend,Selma director Ava DuVernay, Abrams added a seconds-long, wordless and ultimately invaluable shot of Rey closing her eyes, finding the Force inside of her before she bests Ren with a lightsaber. This fleeting oasis of pure feeling—a subtle echo of Luke using the Force in the Death Star's trenches—drives this story home, and roots the sequel trilogy in the magic of the Force the prequels lacked.\n\n6. Rogue One: A Star Wars Story (2016)\n\nThe greatest asset of the franchise's first standalone theatrical film is its huge cast of talented international actors like Felicity Jones, Riz Ahmed and Ben Mendelsohn (just to name a few). They make the most of a script heavy on action and nods to the past, but low on character development.\n\nRogue One's prioritization of nostalgia and spectacle is most apparent in the computer-generated recreation of late actors Peter Cushing and CarrieFisher. Animated avatars are inevitably in the uncanny valley; no one believes they're real people. Fisher and Cushing were icons, stars with big personalities and little subtleties no computer could replicate. If Tarkin and Leia even needed to be in this movie at all, audiences would have happily accepted actors with a passing resemblance to the originals. Good actors would have brought a fresh take to the characters to boot.\n\nAlso, the humor in the otherwise grim Rogue One feels forced and shoehorned-in, a far cry from the breezy, effortless banter of the original trilogy, which stemmed from sharply written characters given the time and thought to develop strong personalities.\n\nThe best part: The decision to kill off every major character is unexpected, risky and inspired. It's a welcome reminder of what's at stake and the Empire's massive, mighty threat—and it would have made an even bigger impact if we had gotten to know these people.\n\nDaisy Ridley and Adam Driver in 'Star Wars: The Last Jedi'\n\n5. Star Wars: Episode VIII — The Last Jedi (2017)\n\nTransporting in its artistry, challenging in its deconstructive storytelling, and showcasing some of the strongest all-around acting in franchise history, Rian Johnson's take on Star Wars also raises the pulse with heart-stopping, surprising action sequences. There's something deeper that sets The Last Jedi apart from, frankly, every other picture on this list: tangible melancholy, themes of regret, loss and failure. It's powerful stuff that doesn't go down easy. Such things are nowhere to be found in the laser-brained Rise of Skywalker.\n\nThe Last Jedi isn't perfect; the cleverness and humor is just too much at times, and a cliffhanger ending would have been a better choice, seeing as this is part two of three and all. Still, that doesn't change the fact that this series hasn't felt so alive and rife with possibilities since 1983. The most compelling plot point here is that, for the first time in the saga, the Force isn't exclusive to certain bloodlines. Anyone, from anywhere, can have the power to make a difference. This thread was thrown out the window in Rise of Skywalker, where we're back to nepotism as usual. What a letdown.\n\nThe best part: The throne room fight is an all-timer, among this series' most stunning combat sequences. The lightsaber duels in the prequels sometimes looked like ballet recital. This is brutal, filled with rage, dismemberment, screaming and messy, conflicted emotions. And it’s the immediate aftermath of the picture's keenest plot twist to boot. Exhilarating.\n\n4. Star Wars: Episode III - Revenge of the Sith (2005)\n\nThe downfall of Anakin Skywalker might have worked best as a single film (though one could argue Darth Vader was a stronger villain with some mystery and we didn't even need his backstory), and Revenge of the Sith is the best of the prequels largely because this is when the drama finally kicks in. A notable step-up from its immediate predecessors, particularly when it establishes an emotional connection to the original trilogy in its third act, Sith still bears many similarities: over-reliance on over-produced visual effects, unintentionally humorous bits, and unnaturally literal dialogue that makes the characters sound like androids.\n\nThere are flashes of philosophical Star Wars brilliance here, like Yoda's wise and foreboding advice to Anakin that going through life avoiding pain is the most dangerous choice one can make, that \"the fear of loss is a path to the dark side.\" And props to Portman. Padmé's tragic arc should have been more nuanced on the page, and the actress brings a great deal more to it.\n\nThe best part: The film's unanimously praised standout is Scottish Tony Award-winner Ian McDiarmid, splendid as Palpatine.In the best scene of the entire prequel trilogy, the serpentine, insatiable Chancellor and soon-to-be-Emperor tells Anakin the tragedy of Darth Plagueis, seducing the Jedi with the notion of unnatural and unjust power. Lucas originally intended for this to take place in an office, and it was theater vet McDiarmid's suggestion to set it in an opera box. In a tonally uneven and occasionally goofy trilogy, this quiet moment comes closest to capturing the threat of the Dark Side that made the original films feel so dangerous.\n\nhttps://parade.com/624594/parade/mark-hamill-on-the-true-meaning-of-the-legacy-of-star-wars/\n\n3. Star Wars: Episode VI - Return of the Jedi (1983)\n\nIn the wake of two streamlined and impeccably paced predecessors, Return of the Jedi loses its footing on occasion and has tonal issues, but it's ultimately a worthy denouement to the first batch. The final confrontation between Luke (Mark Hamill) and Vader (James EarlJones) is the heart of the film, by far the strongest of several parallel plot threads.\n\nLess involving is what happens on Endor. The toyetic furballs known as Ewoks are the first time Star Wars went out of its way to appeal exclusively to the very young, a precursor to Jar-Jar. Few screen romances in history make us swoon (and laugh) in equal measure like the magic between Han (Harrison Ford) and Leia (Carrie Fisher) in Empire—so it looks like a missed opportunity when they spend the third act of Jedi fixing a door. The climactic space battle on an unfinished second Death Star is still a stunner today, though!\n\nGranted endings are tough, and ending the most popular film trilogy of all time is really tough, but it's impossible to walk away 100 percent satisfied when a saga of good and evil of galactic proportions wraps up with—in the words of Harrison Ford himself—a \"teddy bear picnic.\" (Nailed it). Still, the best of Return of the Jedi is in line with the rest of the original trilogy: a singular achievement.\n\nThe best part: A decades-younger McDiarmid playing a decades-older Palpatine under impressively scary makeup nearly walks away with this movie, too, but it's the moment when Luke finally looks into his father's eyes as the redeemed dark lord breathes his final breaths that gives Jedi its soul, the payoff this hero's journey deserved.\n\n2. Star Wars: Episode IV - A New Hope (released as Star Warsin 1977)\n\nLike all the greatest phenomena, Star Wars came out of nowhere. Following the success of 1973's American Graffiti, USC alum Lucas switched gears and pieced together a space opera with wildly varied inspirations including 1950s sci-fi serials like Flash Gordon, Spaghetti Westerns and Akira Kurosawa samurai pictures like The Hidden Fortress.\n\nEvery movie studio except Fox passed on the unusual project, and though the troubled production made some fear a flop, Star Wars surpassed Jaws to become the highest-grossing film of all time, influencing every blockbuster in its wake.\n\nStar Wars was nominated for 10 Oscars and won six; whether or not the Academy made the right call by awarding Best Director and Best Picture to Annie Hall is highly debatable.\n\nThe best part: Star Wars totally works as a self-contained film, and even on the millionth watch you want to stand up and cheer when reluctant hero Han swoops in and clears the way for Luke and the Force to blow up the Death Star. Check out a 1977 audience's reaction to the triumphant finale below.\n\n1. Star Wars: Episode V - The Empire Strikes Back (1980)\n\nDecidedly not as exuberant a crowd-pleaser as its predecessor (in fact it plunges headfirst into darkness and despair), The Empire Strikes Back is nevertheless an even better film, and it represents some of the most powerful and sophisticated broad strokes in cinema.\n\nOne of the earliest sequels commonly regarded as superior to the original, Empire has become something of a template for second installments, with several middle chapters borrowing from it, attempting to crack its code over the decades. Though itis indeed the darkest film in the series, it's important to note that it's the funniest, too, made with more time and money than Lucas had for the first, with deeper ambitions and confidence in the visionary material.\n\nIn 2010, Empire was selected for preservation in the National Film Registry by the Library of Congress for being \"culturally, historically, and aesthetically significant\"—one of few sequels ever to obtain the honor.\n\nThe best part: The Empire Strikes Back is such a masterpiece that arguably the best plot twist in film history isn't even its highest high. The characters in Empire are all so vividly realized, the emotional through-line is so clear and true—yet the film belongs to Yoda. The two-foot-tall green puppet voiced by Frank Oz could have come off as cloying comic relief, but instead he's the Star Wars series' most indelible and imaginative creation, expanding the mystery of the Force and guiding Luke's story in thought-provoking directions only hinted at in the original.\n\nFrom the moment he appears onscreen (first presenting himself as senile and clueless to test Luke's patience and teach him a lesson about expectations) Yoda breaks down everything we think we know about the Star Wars universe—and maybe ours, too.\n\nDo you agree with our ranking of the Star Wars saga on the big screen? What's your very favorite part of Star Wars? Sound off and let us know in the comments!", "images": ["https://parade.com/.image/t_share/MTkwNTc4MzQyNjc0MzEwMjY5/revengeofthesith.jpg", "https://parade.com/.image/t_share/MTkwNTc4MzQzMjA2MzMxNTE3/rey.jpg", "https://parade.com/.image/t_share/MTkwNTc4MzQyNjc2NDA3NDIx/clonewars.jpg", "https://parade.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkwNTc4NjkxMTA3NzI3MjI4/maxresdefault-1.jpg", "https://parade.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkwNTc1OTIzMjUzMTU5MDM3/halle.jpg", "https://parade.com/.image/t_share/MTkwNTc4MzQyOTQ3OTIzMDY5/forceawakens.jpg", "https://parade.com/.image/MTg5NzMxMjY4MjY5NzEyNjEw/parade-logo-nav-140w.svg", "https://parade.com/.image/t_share/MTkwNTc4MzQyNjgwNTM2MTg5/rogueone2.jpg", "https://parade.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyMTcxNTYzNzI5MDM2NDY0/goodnight-mommy.jpg", "https://parade.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyMTcxNTYzNzI5MDM2NDY0/goodnight-mommy.jpg", "https://parade.com/.image/t_share/MTkwNTc4MzQzMjA2MTM0OTA5/empirestrikesback.jpg", "https://parade.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkwNTc1OTIzMjUzMTU5MDM3/halle.jpg", "https://parade.com/.image/t_share/MTkwNTc4MzQyOTMyNTIyMTA5/attackoftheclones-2.jpg", "https://parade.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkwNTc4NjkxMTA3NzI3MjI4/maxresdefault-1.jpg", "https://parade.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyNDcxODI2MjM0ODc3MjU0/hellraiser-pinhead-jamie-clayton-hulu.jpg", "https://parade.com/.image/c_fit%2Ccs_srgb%2Ch_60%2Cq_auto:good%2Cw_600/MTg5NTQ5Njk0NzY5MTc4MjA5/parade-logo-footer-275x60.svg", "https://parade.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyODcwMTM1MDU5NDU3NzQ0/jumanji-the-next-level-uk-film-premiere---red-carpet-arrivals.jpg", "https://parade.com/.image/t_share/MTkwNTc4MzQyNjU5OTU3ODg1/returnofthejedi.jpg", "https://parade.com/.image/t_share/MTkwNTc4MzQyNjY3NzU2NjY5/screen-shot-2022-03-22-at-124908-pm.png", "https://parade.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyODAwMTY0NjczNDk2Nzg0/luckiest-girl-alive-mila-kunis.jpg", "https://parade.com/.image/t_share/MTkwNTc4MzQyNjc5MjkxMDA1/anewhope.jpg", "https://parade.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyODY5MjAzMzE5OTg5OTY4/mindy-kaling.jpg", "https://parade.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyODY0ODQwNDM4NTIzMTAx/stranger-things-quotes.jpg", "https://parade.com/.image/t_share/MTkwNTc4MzQyOTQ4NjQzOTY1/solo2.jpg", "https://parade.com/.image/t_share/MTkwNTc4MzQzMjA4NTU5NzQx/phantommenace.jpg", "https://parade.com/.image/MTg5NTUwNzMyMjcyMjE1NjM2/parade-logo-hamburger.svg", "https://parade.com/.image/t_share/MTkwNTc4MzQyNjY3MzYzNDUz/lastjedi.jpg", "https://parade.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTkyNzk3MDczMTAyMzQ5NTMz/gettyimages-1426022223.jpg"], "top_img": "https://parade.com/.image/t_share/MTkwNTc4MzQyNjY3NzU2NjY5/screen-shot-2022-03-22-at-124908-pm.png", "keywords": [], "authors": ["Samuel R. Murrian"], "canonical_link": "https://parade.com/627563/samuelmurrian/we-ranked-all-10-star-wars-films/", "title": "We Ranked All 12 Star Wars Movies From Worst to Best", "meta_data": {"author": "Samuel R. Murrian", "description": "Is Rise of Skywalker the worst Star Wars movie ever?", "keywords": "Entertainment,Star Wars,Disney,Mark Hamill,Carrie Fisher,Oscar Isaac,John Boyega,Daisy Ridley,movies", "section": "Entertainment", "pagetype": "article", "companies": "Screen Shot 2022-03-22 at 12.49.08 PM; Rey; CloneWars; AttackoftheClones 2; PhantomMenace; Solo2; ForceAwakens; RogueOne2; LastJedi; RevengeoftheSith; ReturnoftheJedi; ANewHope; EmpireStrikesBack", "tags": "Star Wars, Disney, Mark Hamill, Carrie Fisher, Oscar Isaac, John Boyega, Daisy Ridley, movies", "robots": "max-image-preview:large", "item-id": "ci02a512076000277c", "published": "2022-05-24T09:00:44Z", "dcterms.dateCopyrighted": 2022, "twitter": {"card": "summary_large_image", "url": "https://parade.com/627563/samuelmurrian/we-ranked-all-10-star-wars-films/", "image": "https://parade.com/.image/t_share/MTkwNTc4MzQyNjY3NzU2NjY5/screen-shot-2022-03-22-at-124908-pm.png", "description": "Before it was released in May 1977, not everyone was convinced George Lucas' space opera about a wizard, a farm boy and a princess would even be a hit, much", "domain": "parade.com"}, "og": {"type": "article", "url": "https://parade.com/627563/samuelmurrian/we-ranked-all-10-star-wars-films/", "title": "We Ranked All 12 Star Wars Movies From Worst to Best", "description": "Before it was released in May 1977, not everyone was convinced George Lucas' space opera about a wizard, a farm boy and a princess would even be a hit, much", "image": "https://parade.com/.image/t_share/MTkwNTc4MzQyNjY3NzU2NjY5/screen-shot-2022-03-22-at-124908-pm.png", "site_name": "Parade: Entertainment, Recipes, Health, Life, Holidays"}, "pinterest-rich-pin": "false", "apple-mobile-web-app-title": "Parade: Entertainment, Recipes, Health, Life, Holidays", "parsely-title": "We Ranked All 12 Star Wars Movies From Worst to Best - Parade: Entertainment, Recipes, Health, Life, Holidays", "parsely-link": "https://parade.com/627563/samuelmurrian/we-ranked-all-10-star-wars-films/", "parsely-image-url": "https://parade.com/.image/c_fill%2Ccs_srgb%2Ch_400%2Cq_auto:good%2Cw_620/MTkwNTc4MzQyNjY3NzU2NjY5/screen-shot-2022-03-22-at-124908-pm.png", "parsely-post-id": "ci02a512076000277c", "parsely-pub-date": "2022-05-24T09:00:44Z", "parsely-section": "Entertainment", "parsely-author": "Samuel R. Murrian", "parsely-tags": "Entertainment,Star Wars,Disney,Mark Hamill,Carrie Fisher,Oscar Isaac,John Boyega,Daisy Ridley,movies", "sailthru.title": "We Ranked All 12 Star Wars Movies From Worst to Best", "sailthru.image.full": "https://parade.com/.image/t_share/MTkwNTc4MzQyNjY3NzU2NjY5/screen-shot-2022-03-22-at-124908-pm.png", "sailthru.date": "2022-05-24T09:00:44Z", "sailthru.author": "Samuel R. Murrian", "sailthru.tags": "Entertainment,Star Wars,Disney,Mark Hamill,Carrie Fisher,Oscar Isaac,John Boyega,Daisy Ridley,movies", "sailthru.description": "Is Rise of Skywalker the worst Star Wars movie ever?", "phx": {"content-item-id": "ci02a512076000277c", "content-object-type": "ContentArticle", "exclusive-content-type": "free", "site-keyword": "parade"}, "facebook-domain-verification": "xsm5wtv6dad9pr0j3gk8h029u3xwek", "viewport": "width=device-width, initial-scale=1", "referrer": "unsafe-url", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-mobile-web-app-capable": "no", "apple-mobile-web-app-status-bar-style": "black", "format-detection": "address=no", "generator": "Tempest - maven.io", "pinterest": "nohover"}, "movies": [], "publish_date": 1653382844.0, "source": "https://parade.com", "summary": ""}