{"url": "https://www.hollywoodreporter.com/live-feed/leftovers-series-finale-explained-1010052", "text": "The Leftovers has closed the book on its final chapter.\n\nThe HBO drama from Damon Lindelof and Tom Perrotta aired its finale Sunday night, and it did so by offering more closure than most viewers had been trained to anticipate — not only for all the major characters but even for the show’s biggest mystery. (Note: spoilers abound below, so proceed with caution if you haven’t yet watched “The Book of Nora.”)\n\nLindelof had long tempered expectations about the finale, telling The Hollywood Reporter last year when he was writing the final script that The Leftovers is in no way a mystery-solving show. “If the takeaway from Lost was that there was a disgruntled portion of the fan base that said, ‘You did not give satisfactory answers to the mysteries,’ then I feel somewhat liberated with The Leftovers because that’s off the table,” he said at the time.\n\nBut in an emotional monologue that concludes the third and final season of the thought-provoking drama, Carrie Coon’s character Nora Durst actually provides one possible answer to what happened to the 2 percent of the population that suddenly departed years ago. Whether or not she’s telling the truth is up for debate.\n\nSeated across from an aged Kevin (Justin Theroux), Nora explains that years earlier she got into a machine that transported her to a parallel earth where the departed now live. It was the closure she’d always longed for — except that when she found her three children and husband, it was apparent that they were happy and had moved on with their lives. Realizing there was no place for her in their world, she had the creator of the machine send her back home.\n\n“I knew that if I told you what happened that you would never believe me,” Nora tells Kevin as she finishes her poignant tale. “I believe you,” Kevin assures her, tears streaming down his face. “You do?” she asks incredulously. “Why wouldn’t I believe you? You’re here,” he responds before reaching out to grab his former wife’s hand. “I’m here,” Nora echoes, her mouth slowing turning upward into a smile.\n\nAnd with that, The Leftovers concluded its story, leaving the credibility of Nora’s account open to interpretation. “I definitely feel like there are going to be people out there who watch the show who don’t believe her story,” says Lindelof, “and then for a lot of people, it won’t even occur to them to disbelieve it.”\n\nAhead of the finale’s debut, THR chatted with Lindelof about why not revealing the fates of certain characters would be a “travesty,” the questions he doesn’t want to have to answer about the finale and whether or not he personally believes Nora (hint: he really wants to).\n\nNow that people have gotten a chance to watch the finale, what’s the most surprising question you’re getting about it?\n\nI can’t explain why it is surprising to me — I mean, I could explain it but I’m not going to — is why didn’t we show the story that Nora is telling as she’s telling it?\n\nWas that ever a consideration in the writers room?\n\nIt was something that was discussed very early on when we first were talking about the ending of the series, but once the storytelling process began and scripts started getting written, we landed on the idea of this season, if not the series, being about people telling stories. And, more important, people telling stories that would either give themselves a degree of comfort or that they believed would give comfort to others. That tradition goes all the way back to season one with Matt at the pulpit, and in season two, with Tom [Chris Zylka] speaking in front of the ex-guilty members like AA meetings, saying that he can give magic hugs. So, there’s always been a tradition on the show of characters delivering monologues that are fantastical or believable or unbelievable stories, with themselves at the center of those stories. They’re told in the first person, and it was sort of like, “Oh, yeah, how could we not end the series with Carrie Coon doing that?”\n\nWhen did you know that this is how you wanted to end the show?\n\nVery early on. The holdover writers from season two got together in January, and all we talked about was, “What’s the last scene of the finale, and when and where does the finale take place? And what are the things we want to resolve definitively, and what are the things that we’re OK not resolving definitively, etc.” They were both esoteric, enthymematic conversations and then they became much more directed toward the scene we ended up with and we explored different permutations. It was always going to be that Nora tells the story of going through, but there were a couple different permutations of who she was telling that story to — and then it became very obvious to us that it had to be Kevin. That was locked in before we even started breaking the season premiere.\n\nWho were the others that you considered for her telling the story to?\n\nErika Murphy was a contender, and then a grown-up version of Lily who would be maybe a 19- or 20-year-old young woman at the time that this would be taking place. Those were really the only other two contenders, other than Kevin.\n\nAnd how did you land on it being Kevin?\n\nWell, it isn’t to say that Kevin isn’t an incredibly important character in The Leftovers — of course he is — but I think the idea is that the third and final season was just as much about Nora’s journey as it was about Kevin’s. His journey would resolve in the penultimate episode and then her journey would resolve in the finale. And that’s inevitable for us because she just lost so much more. He’s been suffering in this kind of existential way. He feels like he’s a coward and he feels like he wanted to escape his family. There’s a part of him that will not allow himself to be vulnerable enough to form real connections with people. Those are important but more esoteric, emotional and internal issues. Nora lost her kids and her husband. Of course, he was cheating on her, so f— that guy, but she had a much more tangible thing that she lost. All along we promised that we were never going to resolve where the departed people went, but at the same time, here we are flirting with disaster because this season feels like Nora’s entire story starts with someone coming to her and saying, “There’s a device you can get to inside that is going to transport you to be with those people again.” It seems to be teasing the audience if we told you that we’re never going to resolve where everybody went, and yet Nora is walking down that path with increasingly and rapidly escalating footsteps. So, how are we going to thread that needle? And now you’ve seen how we’ve tried. Whether or not the thread went through the eye perfectly is anyone’s guess, but I’m really happy and proud. I feel like we did not violate the spirit of The Leftovers by doing what we did.\n\nYou offered a bit more closure in the end than you initially let on that you might, although the question of whether or not Nora is telling the truth is left unanswered. How do you think her story will be received by viewers?\n\nAll I’m really willing to say on the subject of that without being like frustratingly and pretentiously obtuse is that Nora told the story. She told the story. I definitely feel like there are going to be people out there who watch the show who don’t believe her story, and then for a lot of people, it won’t even occur to them to disbelieve it. That’s why the answer to the question, “Why didn’t we show Nora’s journey?” is that because if we showed it, it would be undeniable that it were true. Yet, even in shows like The OA, where the whole basis of the series is the characters telling the tale and we are, in fact, seeing that tale unwind, the show is still asking the question, “Is she making all of this up?” For a show that’s based around the idea of belief and the idea that belief can actually bring a tremendous amount of emotional healing and the lack of belief can bring a lot of emotional pain, what is true and what is authentic and what matters —those are all themes and ideas that were in Tom’s book that we tried to bring to the series. I feel like Nora’s story is the culmination of all those ideas.\n\nDo you believe Nora?\n\nWell, I want to believe her. Let me just put it to you that way. I want to believe her. That’s the most honest answer I can give you.\n\nWere the show’s writers divided on how they felt about Nora’s story?\n\nYeah, I mean, we’re still discussing it. From when we first talked about it at the beginning of the season to when we talked about it again when we were actually writing the finale to the script of the finale being written and then sitting in the editing room. Once I had a cut that I wanted all the writers to see, they came in and all I’ll say is that people changed their minds once they saw Carrie do it. Both ways. And I would ask you another question. Let’s say that I said one thing like, “I don’t believe Nora’s story,” and Carrie Coon says, “I one-thousand percent believe Nora’s story.” Then which is true? Whose intention wins? And what about what [director] Mimi Leder thinks? The reality is that Carrie and Mimi and I never had the conversation that you and I are having now, quite purposefully. We wanted to let Carrie make the choice that felt right to her. I saw her last night and we still haven’t talked about. I haven’t said to her, “Carrie, do you think it’s true?” I don’t want to know what her answer to that question is. You can ask her. But I don’t know. She still hasn’t seen it, by the way.\n\nWhat did she add to the finale as an actor that wasn’t on the page?\n\nThere’s just an incredible amount of intelligence and depth in Carrie as a human being that always translates to Nora in her performance. And while I’m not entirely always sure I can tell what Nora’s thinking, I know that she is thinking — and she’s thinking about a lot of different things. You can almost feel the subtle, silent moments with her, when the camera’s just holding on her face in terms of what she’s thinking and it’s much more intense than just like, “She’s in distress,” or, “She’s confused.” I don’t have a stopwatch but what I think is interesting about this finale is that it’s a 70-minute episode and there may be as much as 20 minutes of the episode where Carrie is onscreen saying absolutely nothing, where she’s not speaking at all. That’s how compelling her performance is. Like, you take a scene of when she goes up the hill to free the goat from the fence, and because Carrie is such an amazing actor, you know exactly why she’s doing that, how she feels about this, why she’s putting the beads around her neck. Maybe you can’t articulate that into words, but it emotionally makes sense just because of Carrie’s performance. And she’s also kind of not afraid to be the butt of the joke. When she’s on the phone with Laurie [Amy Brenneman], and Lori is saying, “If you’re calling me to tell you that it’s OK to go with Kevin to the dance, that’s fine. You can go.” And she’s just like, “I do not want to go to the f—ing dance!” It’s really funny. Carrie has to know that that’s a comedic reading, but Nora would not want to be laughed at in that instance — she’s so frustrated. And that’s what I think is really interesting, for someone who is so clearly in control of her own life, she keeps doing these crazy things — whether it be hiring a prostitute to shoot her in the chest or getting the Wu-Tang tattoo or locking all the doors in her house as if Kevin is going to try to get in a window. She does all these irrational, unreasonable things, yet she seems completely and totally sane and under control when she’s essentially behaving like a crazy person. I don’t know how Carrie does that. I think that if you were to ask most people, “Do you think that Nora Durst is crazy?” They would say, “What? No!” But I would like to read you from the list of 10 things that Nora Durst has done and ask you that question again.\n\nWith such a sprawling ensemble cast, what made you move forward with a finale that was so predominantly about Nora and Kevin?\n\nI think that this was a love story. It’s an oversimplification and it could feel a little bit trite, but it is the answer to your question. Obviously, I think from the moment that Kevin looks at Nora when she steps up to the podium and gives her speech in the pilot [it’s there] because the Kevin-Nora romance was such an integral part of Tom’s novel. We knew the final line of Tom’s novel was, “Look what I found,” as Nora’s holding a baby in her arms, and we knew that was going to be the final line of the first season of this show. So, if we’re writing a show where basically the antagonist is not the Guilty Remnant, the antagonist is actually the fear and anxiety of losing the people that you love, and that fear and anxiety basically prevents you from forming new attachments because how could you ever fall in love with somebody and trust somebody not to leave you in a world where the departure could happen again at any moment? That wound would be the most intense and open and seething with Nora Durst, who basically was the statistical anomaly who lost her entire family. Again, it is overly simplistic and almost insulting to say the answer to profound loss is love because clearly that wasn’t enough, right? I mean, she met Kevin, they were in love, they were together for many years, they thought that the problem was Mapleton so they moved to Miracle and, as Jill said, “Wherever you go, there you are.” And they were in Miracle for a number of years, but the time has basically passed. It’s seven years later but she’s still getting tattoos with her kids’ names on them. So, when Mark Linn-Baker shows up and tells her something that she’s pretty convinced is a lie and a hoax, she still gets kind of sucked into it. This is a person who isn’t OK. The ending of that journey had to basically say, how can Nora construct a narrative — whether true or untrue but at least a palatable, believable narrative — where she actually is reunited with her kids and then decides not to be with them or decides that she doesn’t belong there anymore or that they’ve moved on without her? You basically take that elephant, you get that elephant out of the room very gently, and now she feels so guilty about having gone in pursuit of that that she can’t be with Kevin. And now, in classic rom-com structure, Kevin needs to come after her and pretend to be something he’s not. He needs to create a counter-narrative that allows them to start talking about their lives without starting from the place where the most intense pain is. So, if he knocks on her door and she answers it says, “I’m really sorry about what I said in the hotel room,” there’s nowhere to go. But by him saying, “Hey, all those things never happened, want to go to a dance?” I think that that throws her back on her heels. But more importantly, it also uses the popular story beats of a rom-com or a romance even though the characters eventually have to confront the idea that we’re not allowed to start over. This made for a very nice conversation at someone else’s wedding, but now that we danced to Otis Redding, things have to get real. And they do.\n\nThis season, you’ve been switching up the song that plays during the opening credits. Why did you decide to return to “Let the Mystery Be” for this last episode?\n\nWe knew we were going to be changing the theme song every week, and I definitely wanted to play the season one theme song over the season two images, and then I wanted to bring, “Let the Mystery Be” back one last time. I wasn’t sure which was going to be which, so I thought maybe “Let the Mystery Be,” would be OK over the episode seven title sequence, and then the season-one theme song basically plays over the finale. But “Let the Mystery Be” didn’t quite feel right for International Assassin 2, so we flipped them. I wanted there to be a little more of a warning label on the finale going in, which is just like, just to remind you for those of you coming to the end of the finale looking for some level of resolution, whatever that means to you, we’re going to answer some things that we care about — I think it would have been a travesty did we not answer what the fate was of every major character that we cared about on the show. If, for example, we just never addressed what happened to Laurie when she went into the water, that would have been unconscionable. Or did Matt eventually succumb to his leukemia? Yes, he did. What happened to Kevin Sr.? What happened to Jill and Tom? What happened to the Murphys? We owed the answer to all those questions, but then there are going to be other areas [we don’t answer.] One of the questions that keeps popping up is, “I was kind of hoping you would explain why Kevin has the ability to die and come back to life,” and I said, “Oh, I’m sorry you’re disappointed.” Like, I don’t know what else to say in response to that. But I also go, “What does that explanation look like?” I mean, it’s almost like explaining why it is that Superman has powers. It’s like, “Oh, it’s because he’s from the planet Krypton and that’s why he has powers on earth, because of our yellow sun.” What is an explanation for why can Kevin die and come back to life? Who gives that explanation and what does it look like? We weren’t touching that with a 10-foot pole — or a 20-foot ladder in our case.\n\nThe last words spoken in the show are Nora saying, “I’m here.” What is the significance of that line?\n\nSeason one ended with her saying, “Look what I found,” and obviously those words have a meaning beyond the fact that she’s just holding a baby in her arms. “Look what I found,” would seem to suggest that maybe she’s found some purpose, maybe she’s found a tether back to the world. When someone says, “Look what I found,” it’s not just an object or a person, it’s some kind of fundamental truth. And at the end of season two, Nora also has the last line, which is, “You are home.” Well, that home is one that they’ve really only occupied for three weeks or so. There isn’t any furniture in it yet. But I think when she says, “You are home,” she’s like, look at all the people who are in this room. This is your home. But home is obviously an idea more than it is a physical place. We knew that Nora was going to have the last line of dialogue in the final season, and these are always very simple ideas, you know, “Look what I found,” and “You are home.” So it’s like we just started meditating and remembering that one of the things Kevin said back in the pilot when he was in the bar with the young mother who he doesn’t realize is the woman who lost the baby, and he lifts up his beer and he says, “Hey, we’re still here,” and she says, “We sure are.” And HBO actually put, “We’re still here,” as one of the taglines on the season one poster. I think “still here” is actually kind of negative. It’s as if someone was like, “The party is over,” or, “The bar is emptied out.” There’s something kind of sad and pathetic, but when you eliminate the word “still,” there’s something very powerful about it because it’s some indication of, “Yeah, we’re here in this kitchen right now, looking in one-another’s eyes, but we’re also here — we’re present, we’re in the same space.” Here means I’m not longer my psyche, and my emotional being is no longer out there, wondering, searching for things that are there. I am here. That was wildly pretentious, but, again, you started it.\n\nEarly in the episode, we learn that Laurie [Amy Brenneman] is still alive. Was she ever really contemplating suicide?\n\nThe truth of the matter is that there was a real process of discovery for us as writers. I think that when we broke that story in the room, we were all pretty convinced that she had committed suicide. And then Amy Brenneman before she shot the scene was like, “I kind of want to know if I’m killing myself or not,” and I said, “I have to leave some space, but I think I’m about 90 percent sure that she does.” And Amy was like, “OK, I got it. I’m sad, but I got it.” And then we got the dailies of that episode, of her going out there on the boat and playing the scene with Jill and Tom on the phone and then going into the water — and there was something really noble and heroic about all the choices that Amy was making. I’ve never tried to kill myself and I think suicide is a very intense and complicated thing, but in my brain people who are about to kill themselves don’t look like that. And so that was bothersome. Then we also made a discovery writing-wise. When Laurie’s kids called her, why didn’t she tell them that she was in Australia about to go scuba diving if it was her intention to kill herself? Because that’s the elegance of what Nora pitched her, it’s that people will think it was an accident. But if Tom and Jill were to find out, “Wait, we just called mom like half-an-hour before she went into the water and died in a scuba diving accident. Why didn’t she tell us she was in Australia? Why was she going scuba diving on the anniversary of the departure?” It wouldn’t have accomplished what it set out to. So, the more we talked about it, the more we were forced to ask the question, what if Laurie went under the water and maybe it was her intention to potentially kill herself when she went in but when she was under she decided not to? Or maybe she went scuba diving as an affirmation of life — but, man, it sure feels like it makes more sense to us now both emotionally and narratively that she comes up out of the water. The other thing that happened was I watched that scene when Nora gives the speech about the beach ball, and I was like, “I don’t want to squeeze the air out of the beach ball.” Killing Laurie sort of felt that way. And maybe it’s honest and beautiful and poetic and not everybody’s going to make it, but after everything Laurie went through — from being in a loveless marriage to the unborn child inside her disappearing and holding that burden of not telling anybody for so long to joining the Guilty Remnant to leaving the Guilty Remnant to trying to write a book and failing miserably to remarrying John Murphy — should the end result of that be that she kills herself? It just didn’t feel fair to the character. So, she came out of the water and she stayed Nora’s shrink.\n\nWhere did the idea for the goat come from in the wedding scene?\n\nI feel like good finales bookend a series by calling back certain themes and motifs that are introduced in the pilot and are carried through the series. It’s like these are the ingredients, the brief solos that you want to hear before the band leaves the stage. And one of the things The Leftovers is traded very heavily on is animals, and not “spirit animals” but animals as some sort of mystical, magical, interpretive kind of pseudo-religious thing for us to kind of pack all of our belief systems into. In the pilot, it was dogs and the stag, and we used a goat in season two that gets sacrificed. Certainly we used the lion to a very memorable effect in season three, and so we thought, should we return back to the dog idea? It didn’t feel quite right. Kangaroos seem like the obvious way to go in Australia, but maybe that’s too on-the-nose. One of the things that we would do in the writers room this year is that I would assign everybody homework. So [I told] everybody to go home and come back and basically pitch how we should be using animals as symbolic and significant in the finale, and Carly Wray came back and she pitched the idea of the birds as the messages of love idea from the wedding, and then Lila Byock was like, “Do you guys know what a scapegoat is?” And then she basically told that story that Eddie tells in his speech, which is that in ancient times the villagers would all put the sins on the goat and just cast the goat out into the world and then they were relieved of their sins. And I was like, “I like those ideas. Let’s do both those ideas.” That’s what it came from.\n\nPresumably, you had this episode in the can months ago. What’s it been like for you to have to wait this long for everyone to see it?\n\nIt varies from day to day. Last weekend, I was feeling a lot of anxiety, and as we’ve gotten closer to the finale actually airing, I’ve been feeling less anxiety. And it’s not because I’m feeling confidence that everybody’s going to love the finale, it’s just more of the relinquishing of the control that I have over it. And as new agey as it sounds, it’s like, well, what do you think of it? Or if you had a time machine right now and you could get in and go back and you could change anything about the finale — it hasn’t aired yet — what changes would you want to make? If my answer to that is that I would make no changes, I’m pretty cool with it exactly the way that it is…and, look, the reality is that The Leftovers is playing in an incredibly emotional territory that’s very personal to people. It’s taking on issues like belief and loss and grief, and so I have to prepare myself for the fact that there will be a wide range of extrapolations and emotional responses to the finale and I just hope that the people who watch the show and have been watching all the episodes, whether they binge it over the course of the last week or whether they watched the pilot when it initially aired, that they basically feel like — love the finale or hate the finale — that they’re able to assess the series as a whole, you know? Because I think there are some shows that get so dominated by the conversation around the finale, like The Sopranos or Lost or Seinfeld, where it’s sort of like, but what about the 150 episodes before the finale? The finales that tend to get ad nauseam discussed years later are the ones that have seemed to have taken significant risk or tried to do something different and special and memorable. I don’t know if this is a risky finale. It doesn’t feel like a risky finale to me — but it doesn’t feel like a safe one either. I don’t know. I’m not going to get a lot of sleep on Saturday night is the actual answer to your question.\n\nHas your experience with Lost prepared you for a lifetime of having to answer questions about whether everything is the truth or a lie?\n\nYeah, I’m definitely prepared for that. I’ll be honest with you, I don’t think that a lot of people are going to ask me ad nauseam. I think that’s such a concrete question and that I’m doing something this time around that I didn’t do on Lost, which is Carlton [Cuse] and I basically went radio silent for an entire month after the Lost finale aired. We just didn’t do any press, so by the time we got back and we were on the grid again, people’s opinions and misinterpretations had kind of solidified, and that sort of forced us into a defensive posture — not an apologetic posture, but it was sort of like those feelings had already calcified. I went to Italy for a month and while I was in Italy, the show got nominated for a drama series Emmy and the finale got nominated for a writing Emmy against like four episodes of Mad Men, so I was like, “Oh, we’re good!” It worked. [Laughs.] Only over the course of the summer did everyone start telling me how decisive the they-were-dead-the-whole-time thing was, etc. etc. But I don’t think I could have changed people’s opinions of it. Even though Carlton and I wanted to just breathe and have some space without us getting out there to have to explain things, maybe the perception by some is that we were hiding. Maybe the perception by some if that we thought we were above talking about it — and that created a certain level of resentment. I’m just basically The Leftovers finale a lot, not just now to you guys who have already seen it but over the course of next week. We’re going down to Austin and we’ll get in front of the fan. There’s things that I won’t answer but I’m here, to quote Nora and Kevin.\n\nWhat questions in particular don’t you want to have to answer about the finale?\n\nThe big one is, “How literally are we supposed to take Nora’s story?” I don’t want to answer that one. “Is the space that Kevin enters into in the ‘International Assassin’ episode a real space versus a purely psychological space?” Don’t want to answer that one. Those are the two main ones. I’ll pretty much answer anything else.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/06/the_leftovers_finale_3.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/the_leftovers_finale_4.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/the_leftovers_finale.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/the_leftovers_finale.jpg?w=1532&h=862&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/the_leftovers_finale_2.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/the_leftovers_finale_5_0.jpg?w=1024"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/the_leftovers_finale.jpg?w=1024", "keywords": [], "authors": ["Bryn Sandberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/leftovers-series-finale-explained-1010052/", "title": "Damon Lindelof on Balancing Mystery and Closure in ‘The Leftovers’ Finale", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "\"It doesn’t feel like a risky finale to me,\" says the showrunner, \"but it doesn’t feel like a safe one either.\"", "news_keywords": "Damon Lindelof, The Leftovers", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Bryn Sandberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1010052, "title": "Damon Lindelof on Balancing Mystery and Closure in 'The Leftovers' Finale", "published_at": "2017-06-04 19:15:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/the_leftovers_finale.jpg?w=1024", "comment_count": 0, "tags": "The Leftovers", "topics": "TV News", "body": "The Leftovers has closed the book on its final chapter.\r\nThe HBO drama from Damon Lindelof and Tom Perrotta aired its finale Sunday night, and it did so by offering more closure than most viewers had been trained to anticipate — not only for all the major characters but even for the show's biggest mystery. (Note: spoilers abound below, so proceed with caution if you haven’t yet watched \"The Book of Nora.\")\r\nLindelof had long tempered expectations about the finale, telling The Hollywood Reporter last year when he was writing the final script that The Leftovers is in no way a mystery-solving show. \"If the takeaway from Lost was that there was a disgruntled portion of the fan base that said, 'You did not give satisfactory answers to the mysteries,' then I feel somewhat liberated with The Leftovers because that’s off the table,\" he said at the time.\r\nBut in an emotional monologue that concludes the third and final season of the thought-provoking drama, Carrie Coon's character Nora Durst actually provides one possible answer to what happened to the 2 percent of the population that suddenly departed years ago. Whether or not she's telling the truth is up for debate.\r\nSeated across from an aged Kevin (Justin Theroux), Nora explains that years earlier she got into a machine that transported her to a parallel earth where the departed now live. It was the closure she'd always longed for — except that when she found her three children and husband, it was apparent that they were happy and had moved on with their lives. Realizing there was no place for her in their world, she had the creator of the machine send her back home.\r\n\"I knew that if I told you what happened that you would never believe me,\" Nora tells Kevin as she finishes her poignant tale. \"I believe you,\" Kevin assures her, tears streaming down his face. \"You do?\" she asks incredulously. \"Why wouldn't I believe you? You're here,\" he responds before reaching out to grab his former wife's hand. \"I'm here,\" Nora echoes, her mouth slowing turning upward into a smile.\r\nAnd with that, The Leftovers concluded its story, leaving the credibility of Nora's account open to interpretation. \"I definitely feel like there are going to be people out there who watch the show who don’t believe her story,\" says Lindelof, \"and then for a lot of people, it won’t even occur to them to disbelieve it.\"\r\nAhead of the finale's debut, THR chatted with Lindelof about why not revealing the fates of certain characters would be a \"travesty,\" the questions he doesn't want to have to answer about the finale and whether or not he personally believes Nora (hint: he really wants to).\r\n\r\nNow that people have gotten a chance to watch the finale, what's the most surprising question you're getting about it?\r\nI can’t explain why it is surprising to me — I mean, I could explain it but I’m not going to — is why didn't we show the story that Nora is telling as she’s telling it?\r\nWas that ever a consideration in the writers room?\r\nIt was something that was discussed very early on when we first were talking about the ending of the series, but once the storytelling process began and scripts started getting written, we landed on the idea of this season, if not the series, being about people telling stories. And, more important, people telling stories that would either give themselves a degree of comfort or that they believed would give comfort to others. That tradition goes all the way back to season one with Matt at the pulpit, and in season two, with Tom [Chris Zylka] speaking in front of the ex-guilty members like AA meetings, saying that he can give magic hugs. So, there’s always been a tradition on the show of characters delivering monologues that are fantastical or believable or unbelievable stories, with themselves at the center of those stories. They’re told in the first person, and it was sort of like, “Oh, yeah, how could we not end the series with Carrie Coon doing that?\"\r\nWhen did you know that this is how you wanted to end the show?\r\nVery early on. The holdover writers from season two got together in January, and all we talked about was, “What’s the last scene of the finale, and when and where does the finale take place? And what are the things we want to resolve definitively, and what are the things that we’re OK not resolving definitively, etc.” They were both esoteric, enthymematic conversations and then they became much more directed toward the scene we ended up with and we explored different permutations. It was always going to be that Nora tells the story of going through, but there were a couple different permutations of who she was telling that story to — and then it became very obvious to us that it had to be Kevin. That was locked in before we even started breaking the season premiere.\r\nWho were the others that you considered for her telling the story to?\r\nErika Murphy was a contender, and then a grown-up version of Lily who would be maybe a 19- or 20-year-old young woman at the time that this would be taking place. Those were really the only other two contenders, other than Kevin.\r\n\r\nAnd how did you land on it being Kevin?\r\nWell, it isn’t to say that Kevin isn’t an incredibly important character in The Leftovers — of course he is — but I think the idea is that the third and final season was just as much about Nora’s journey as it was about Kevin’s. His journey would resolve in the penultimate episode and then her journey would resolve in the finale. And that’s inevitable for us because she just lost so much more. He’s been suffering in this kind of existential way. He feels like he’s a coward and he feels like he wanted to escape his family. There’s a part of him that will not allow himself to be vulnerable enough to form real connections with people. Those are important but more esoteric, emotional and internal issues. Nora lost her kids and her husband. Of course, he was cheating on her, so f— that guy, but she had a much more tangible thing that she lost. All along we promised that we were never going to resolve where the departed people went, but at the same time, here we are flirting with disaster because this season feels like Nora’s entire story starts with someone coming to her and saying, “There’s a device you can get to inside that is going to transport you to be with those people again.” It seems to be teasing the audience if we told you that we’re never going to resolve where everybody went, and yet Nora is walking down that path with increasingly and rapidly escalating footsteps. So, how are we going to thread that needle? And now you’ve seen how we’ve tried. Whether or not the thread went through the eye perfectly is anyone’s guess, but I’m really happy and proud. I feel like we did not violate the spirit of The Leftovers by doing what we did.\r\nYou offered a bit more closure in the end than you initially let on that you might, although the question of whether or not Nora is telling the truth is left unanswered. How do you think her story will be received by viewers?\r\nAll I’m really willing to say on the subject of that without being like frustratingly and pretentiously obtuse is that Nora told the story. She told the story. I definitely feel like there are going to be people out there who watch the show who don’t believe her story, and then for a lot of people, it won’t even occur to them to disbelieve it. That’s why the answer to the question, “Why didn’t we show Nora’s journey?” is that because if we showed it, it would be undeniable that it were true. Yet, even in shows like The OA, where the whole basis of the series is the characters telling the tale and we are, in fact, seeing that tale unwind, the show is still asking the question, “Is she making all of this up?” For a show that’s based around the idea of belief and the idea that belief can actually bring a tremendous amount of emotional healing and the lack of belief can bring a lot of emotional pain, what is true and what is authentic and what matters —those are all themes and ideas that were in Tom’s book that we tried to bring to the series. I feel like Nora’s story is the culmination of all those ideas.\r\n\r\nDo you believe Nora?\r\nWell, I want to believe her. Let me just put it to you that way. I want to believe her. That’s the most honest answer I can give you.\r\nWere the show's writers divided on how they felt about Nora's story?\r\nYeah, I mean, we’re still discussing it. From when we first talked about it at the beginning of the season to when we talked about it again when we were actually writing the finale to the script of the finale being written and then sitting in the editing room. Once I had a cut that I wanted all the writers to see, they came in and all I’ll say is that people changed their minds once they saw Carrie do it. Both ways. And I would ask you another question. Let’s say that I said one thing like, \"I don’t believe Nora’s story,\" and Carrie Coon says, “I one-thousand percent believe Nora’s story.” Then which is true? Whose intention wins? And what about what [director] Mimi Leder thinks? The reality is that Carrie and Mimi and I never had the conversation that you and I are having now, quite purposefully. We wanted to let Carrie make the choice that felt right to her. I saw her last night and we still haven’t talked about. I haven’t said to her, “Carrie, do you think it’s true?” I don’t want to know what her answer to that question is. You can ask her. But I don’t know. She still hasn’t seen it, by the way.\r\nWhat did she add to the finale as an actor that wasn't on the page?\r\nThere's just an incredible amount of intelligence and depth in Carrie as a human being that always translates to Nora in her performance. And while I’m not entirely always sure I can tell what Nora’s thinking, I know that she is thinking — and she’s thinking about a lot of different things. You can almost feel the subtle, silent moments with her, when the camera’s just holding on her face in terms of what she’s thinking and it’s much more intense than just like, “She’s in distress,” or, “She’s confused.\" I don’t have a stopwatch but what I think is interesting about this finale is that it's a 70-minute episode and there may be as much as 20 minutes of the episode where Carrie is onscreen saying absolutely nothing, where she’s not speaking at all. That’s how compelling her performance is. Like, you take a scene of when she goes up the hill to free the goat from the fence, and because Carrie is such an amazing actor, you know exactly why she’s doing that, how she feels about this, why she’s putting the beads around her neck. Maybe you can’t articulate that into words, but it emotionally makes sense just because of Carrie’s performance. And she's also kind of not afraid to be the butt of the joke. When she’s on the phone with Laurie [Amy Brenneman], and Lori is saying, “If you’re calling me to tell you that it’s OK to go with Kevin to the dance, that’s fine. You can go.” And she’s just like, “I do not want to go to the f—ing dance!” It’s really funny. Carrie has to know that that’s a comedic reading, but Nora would not want to be laughed at in that instance — she’s so frustrated. And that’s what I think is really interesting, for someone who is so clearly in control of her own life, she keeps doing these crazy things — whether it be hiring a prostitute to shoot her in the chest or getting the Wu-Tang tattoo or locking all the doors in her house as if Kevin is going to try to get in a window. She does all these irrational, unreasonable things, yet she seems completely and totally sane and under control when she’s essentially behaving like a crazy person. I don’t know how Carrie does that. I think that if you were to ask most people, “Do you think that Nora Durst is crazy?” They would say, “What? No!” But I would like to read you from the list of 10 things that Nora Durst has done and ask you that question again.\r\n\r\nWith such a sprawling ensemble cast, what made you move forward with a finale that was so predominantly about Nora and Kevin?\r\nI think that this was a love story. It’s an oversimplification and it could feel a little bit trite, but it is the answer to your question. Obviously, I think from the moment that Kevin looks at Nora when she steps up to the podium and gives her speech in the pilot [it's there] because the Kevin-Nora romance was such an integral part of Tom’s novel. We knew the final line of Tom’s novel was, “Look what I found,” as Nora’s holding a baby in her arms, and we knew that was going to be the final line of the first season of this show. So, if we’re writing a show where basically the antagonist is not the Guilty Remnant, the antagonist is actually the fear and anxiety of losing the people that you love, and that fear and anxiety basically prevents you from forming new attachments because how could you ever fall in love with somebody and trust somebody not to leave you in a world where the departure could happen again at any moment? That wound would be the most intense and open and seething with Nora Durst, who basically was the statistical anomaly who lost her entire family. Again, it is overly simplistic and almost insulting to say the answer to profound loss is love because clearly that wasn’t enough, right? I mean, she met Kevin, they were in love, they were together for many years, they thought that the problem was Mapleton so they moved to Miracle and, as Jill said, \"Wherever you go, there you are.\" And they were in Miracle for a number of years, but the time has basically passed. It’s seven years later but she’s still getting tattoos with her kids’ names on them. So, when Mark Linn-Baker shows up and tells her something that she’s pretty convinced is a lie and a hoax, she still gets kind of sucked into it. This is a person who isn’t OK. The ending of that journey had to basically say, how can Nora construct a narrative — whether true or untrue but at least a palatable, believable narrative — where she actually is reunited with her kids and then decides not to be with them or decides that she doesn’t belong there anymore or that they’ve moved on without her? You basically take that elephant, you get that elephant out of the room very gently, and now she feels so guilty about having gone in pursuit of that that she can’t be with Kevin. And now, in classic rom-com structure, Kevin needs to come after her and pretend to be something he’s not. He needs to create a counter-narrative that allows them to start talking about their lives without starting from the place where the most intense pain is. So, if he knocks on her door and she answers it says, “I’m really sorry about what I said in the hotel room,” there’s nowhere to go. But by him saying, “Hey, all those things never happened, want to go to a dance?” I think that that throws her back on her heels. But more importantly, it also uses the popular story beats of a rom-com or a romance even though the characters eventually have to confront the idea that we’re not allowed to start over. This made for a very nice conversation at someone else’s wedding, but now that we danced to Otis Redding, things have to get real. And they do.\r\nThis season, you've been switching up the song that plays during the opening credits. Why did you decide to return to “Let the Mystery Be” for this last episode?\r\nWe knew we were going to be changing the theme song every week, and I definitely wanted to play the season one theme song over the season two images, and then I wanted to bring, “Let the Mystery Be” back one last time. I wasn’t sure which was going to be which, so I thought maybe “Let the Mystery Be,” would be OK over the episode seven title sequence, and then the season-one theme song basically plays over the finale. But “Let the Mystery Be” didn’t quite feel right for International Assassin 2, so we flipped them. I wanted there to be a little more of a warning label on the finale going in, which is just like, just to remind you for those of you coming to the end of the finale looking for some level of resolution, whatever that means to you, we’re going to answer some things that we care about — I think it would have been a travesty did we not answer what the fate was of every major character that we cared about on the show. If, for example, we just never addressed what happened to Laurie when she went into the water, that would have been unconscionable. Or did Matt eventually succumb to his leukemia? Yes, he did. What happened to Kevin Sr.? What happened to Jill and Tom? What happened to the Murphys? We owed the answer to all those questions, but then there are going to be other areas [we don't answer.] One of the questions that keeps popping up is, “I was kind of hoping you would explain why Kevin has the ability to die and come back to life,” and I said, “Oh, I’m sorry you’re disappointed.\" Like, I don’t know what else to say in response to that. But I also go, “What does that explanation look like?” I mean, it’s almost like explaining why it is that Superman has powers. It’s like, “Oh, it’s because he’s from the planet Krypton and that’s why he has powers on earth, because of our yellow sun.\" What is an explanation for why can Kevin die and come back to life? Who gives that explanation and what does it look like? We weren’t touching that with a 10-foot pole — or a 20-foot ladder in our case.\r\n\r\nThe last words spoken in the show are Nora saying, “I’m here.\" What is the significance of that line?\r\nSeason one ended with her saying, “Look what I found,” and obviously those words have a meaning beyond the fact that she’s just holding a baby in her arms. “Look what I found,” would seem to suggest that maybe she’s found some purpose, maybe she’s found a tether back to the world. When someone says, “Look what I found,” it’s not just an object or a person, it’s some kind of fundamental truth. And at the end of season two, Nora also has the last line, which is, “You are home.” Well, that home is one that they’ve really only occupied for three weeks or so. There isn’t any furniture in it yet. But I think when she says, “You are home,” she’s like, look at all the people who are in this room. This is your home. But home is obviously an idea more than it is a physical place. We knew that Nora was going to have the last line of dialogue in the final season, and these are always very simple ideas, you know, \"Look what I found,\" and \"You are home.\" So it's like we just started meditating and remembering that one of the things Kevin said back in the pilot when he was in the bar with the young mother who he doesn’t realize is the woman who lost the baby, and he lifts up his beer and he says, “Hey, we’re still here,” and she says, “We sure are.” And HBO actually put, “We’re still here,” as one of the taglines on the season one poster. I think “still here” is actually kind of negative. It's as if someone was like, \"The party is over,\" or, \"The bar is emptied out.\" There's something kind of sad and pathetic, but when you eliminate the word “still,” there’s something very powerful about it because it’s some indication of, “Yeah, we’re here in this kitchen right now, looking in one-another’s eyes, but we’re also here — we’re present, we’re in the same space.\" Here means I’m not longer my psyche, and my emotional being is no longer out there, wondering, searching for things that are there. I am here. That was wildly pretentious, but, again, you started it.\r\n\r\nEarly in the episode, we learn that Laurie [Amy Brenneman] is still alive. Was she ever really contemplating suicide?\r\nThe truth of the matter is that there was a real process of discovery for us as writers. I think that when we broke that story in the room, we were all pretty convinced that she had committed suicide. And then Amy Brenneman before she shot the scene was like, \"I kind of want to know if I’m killing myself or not,\" and I said, “I have to leave some space, but I think I’m about 90 percent sure that she does.” And Amy was like, “OK, I got it. I’m sad, but I got it.” And then we got the dailies of that episode, of her going out there on the boat and playing the scene with Jill and Tom on the phone and then going into the water — and there was something really noble and heroic about all the choices that Amy was making. I've never tried to kill myself and I think suicide is a very intense and complicated thing, but in my brain people who are about to kill themselves don’t look like that. And so that was bothersome. Then we also made a discovery writing-wise. When Laurie's kids called her, why didn’t she tell them that she was in Australia about to go scuba diving if it was her intention to kill herself? Because that’s the elegance of what Nora pitched her, it’s that people will think it was an accident. But if Tom and Jill were to find out, “Wait, we just called mom like half-an-hour before she went into the water and died in a scuba diving accident. Why didn’t she tell us she was in Australia? Why was she going scuba diving on the anniversary of the departure?” It wouldn’t have accomplished what it set out to. So, the more we talked about it, the more we were forced to ask the question, what if Laurie went under the water and maybe it was her intention to potentially kill herself when she went in but when she was under she decided not to? Or maybe she went scuba diving as an affirmation of life — but, man, it sure feels like it makes more sense to us now both emotionally and narratively that she comes up out of the water. The other thing that happened was I watched that scene when Nora gives the speech about the beach ball, and I was like, “I don’t want to squeeze the air out of the beach ball.” Killing Laurie sort of felt that way. And maybe it’s honest and beautiful and poetic and not everybody’s going to make it, but after everything Laurie went through — from being in a loveless marriage to the unborn child inside her disappearing and holding that burden of not telling anybody for so long to joining the Guilty Remnant to leaving the Guilty Remnant to trying to write a book and failing miserably to remarrying John Murphy — should the end result of that be that she kills herself? It just didn’t feel fair to the character. So, she came out of the water and she stayed Nora's shrink.\r\n\r\nWhere did the idea for the goat come from in the wedding scene?\r\nI feel like good finales bookend a series by calling back certain themes and motifs that are introduced in the pilot and are carried through the series. It's like these are the ingredients, the brief solos that you want to hear before the band leaves the stage. And one of the things The Leftovers is traded very heavily on is animals, and not \"spirit animals\" but animals as some sort of mystical, magical, interpretive kind of pseudo-religious thing for us to kind of pack all of our belief systems into. In the pilot, it was dogs and the stag, and we used a goat in season two that gets sacrificed. Certainly we used the lion to a very memorable effect in season three, and so we thought, should we return back to the dog idea? It didn't feel quite right. Kangaroos seem like the obvious way to go in Australia, but maybe that’s too on-the-nose. One of the things that we would do in the writers room this year is that I would assign everybody homework. So [I told] everybody to go home and come back and basically pitch how we should be using animals as symbolic and significant in the finale, and Carly Wray came back and she pitched the idea of the birds as the messages of love idea from the wedding, and then Lila Byock was like, \"Do you guys know what a scapegoat is?\" And then she basically told that story that Eddie tells in his speech, which is that in ancient times the villagers would all put the sins on the goat and just cast the goat out into the world and then they were relieved of their sins. And I was like, \"I like those ideas. Let’s do both those ideas.\" That’s what it came from.\r\nPresumably, you had this episode in the can months ago. What's it been like for you to have to wait this long for everyone to see it?\r\nIt varies from day to day. Last weekend, I was feeling a lot of anxiety, and as we’ve gotten closer to the finale actually airing, I’ve been feeling less anxiety. And it’s not because I’m feeling confidence that everybody’s going to love the finale, it’s just more of the relinquishing of the control that I have over it. And as new agey as it sounds, it’s like, well, what do you think of it? Or if you had a time machine right now and you could get in and go back and you could change anything about the finale — it hasn’t aired yet — what changes would you want to make? If my answer to that is that I would make no changes, I’m pretty cool with it exactly the way that it is…and, look, the reality is that The Leftovers is playing in an incredibly emotional territory that’s very personal to people. It’s taking on issues like belief and loss and grief, and so I have to prepare myself for the fact that there will be a wide range of extrapolations and emotional responses to the finale and I just hope that the people who watch the show and have been watching all the episodes, whether they binge it over the course of the last week or whether they watched the pilot when it initially aired, that they basically feel like — love the finale or hate the finale — that they’re able to assess the series as a whole, you know? Because I think there are some shows that get so dominated by the conversation around the finale, like The Sopranos or Lost or Seinfeld, where it’s sort of like, but what about the 150 episodes before the finale? The finales that tend to get ad nauseam discussed years later are the ones that have seemed to have taken significant risk or tried to do something different and special and memorable. I don’t know if this is a risky finale. It doesn’t feel like a risky finale to me — but it doesn’t feel like a safe one either. I don’t know. I’m not going to get a lot of sleep on Saturday night is the actual answer to your question.\r\n\r\nHas your experience with Lost prepared you for a lifetime of having to answer questions about whether everything is the truth or a lie?\r\nYeah, I’m definitely prepared for that. I’ll be honest with you, I don’t think that a lot of people are going to ask me ad nauseam. I think that’s such a concrete question and that I’m doing something this time around that I didn’t do on Lost, which is Carlton [Cuse] and I basically went radio silent for an entire month after the Lost finale aired. We just didn’t do any press, so by the time we got back and we were on the grid again, people’s opinions and misinterpretations had kind of solidified, and that sort of forced us into a defensive posture — not an apologetic posture, but it was sort of like those feelings had already calcified. I went to Italy for a month and while I was in Italy, the show got nominated for a drama series Emmy and the finale got nominated for a writing Emmy against like four episodes of Mad Men, so I was like, “Oh, we’re good!” It worked. [Laughs.] Only over the course of the summer did everyone start telling me how decisive the they-were-dead-the-whole-time thing was, etc. etc. But I don't think I could have changed people's opinions of it. Even though Carlton and I wanted to just breathe and have some space without us getting out there to have to explain things, maybe the perception by some is that we were hiding. Maybe the perception by some if that we thought we were above talking about it — and that created a certain level of resentment. I'm just basically The Leftovers finale a lot, not just now to you guys who have already seen it but over the course of next week. We're going down to Austin and we'll get in front of the fan. There's things that I won't answer but I'm here, to quote Nora and Kevin.\r\nWhat questions in particular don't you want to have to answer about the finale?\r\nThe big one is, \"How literally are we supposed to take Nora's story?\" I don't want to answer that one. \"Is the space that Kevin enters into in the 'International Assassin' episode a real space versus a purely psychological space?\" Don't want to answer that one. Those are the two main ones. I'll pretty much answer anything else.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Damon Lindelof on Balancing Mystery and Closure in ‘The Leftovers’ Finale", "url": "https://www.hollywoodreporter.com/tv/tv-news/leftovers-series-finale-explained-1010052/", "description": "“It doesn’t feel like a risky finale to me,” says the showrunner, “but it doesn’t feel like a safe one either.”", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/the_leftovers_finale.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2017-06-04T19:15:00+00:00", "modified_time": "2017-06-05T04:48:16+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Damon Lindelof on Balancing Mystery and Closure in ‘The Leftovers’ Finale", "description": "“It doesn’t feel like a risky finale to me,” says the showrunner, “but it doesn’t feel like a safe one either.”", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/the_leftovers_finale.jpg?w=1532"}}, "movies": [], "publish_date": 1496603700.0, "source": "https://www.hollywoodreporter.com", "summary": ""}