{"url": "fortune.com/2018/03/11/ryan-seacrest-sexual-harassment-allegations-american-idol/", "text": "Ryan Seacrest wants the benefit of the doubt.\n\nAs allegations of extended sexual harassment by a former coworker came to light, the television personality — and the networks who put him on air — want everyone to know that he’s a good, likable guy.\n\n“Throughout my 25 years in the entertainment industry, the majority of my co-workers have been women, and I’ve endeavored to foster a positive work environment of mutual respect and courtesy, as that’s how I believe it should be,” Seacrest said in a statement when allegations against him surfaced. “I’m distraught that anyone or any situation would call that into question. I’m proud of my workplace reputation, and believe my track record will speak for itself.”\n\nWhile other men accused of harassment have been held at arm’s length by their employers, Seacrest has had the full force of industry public relations teams behind him.\n\nBefore he appears on the new American Idol on Sunday, here’s what’s unfolded so far.\n\nThe Ryan Seacrest Harassment Allegations\n\nSeacrest’s allegations came to light on Monday, Feb. 26, after Variety published a detailed account from former stylist, Suzie Hardy, who claimed Seacrest harassed a coworker. Hardy worked at E! between 2007 and 2013.\n\nSeacrest has denied this and his lawyers claim that Hardy asked for $15 million in exchange for her silence.\n\nHardy accused Seacrest of groping her genitals, grinding against her while wearing only underwear and and with an erection, and slapping her bottom so hard that it left a welt for hours, according to Variety.\n\nAn anonymous industry source backed up some of Hardy’s allegations in an interview with Today, and a former E! News employee told Variety that he witnessed the latter two incidents.\n\nAn internal investigation, conducted by a third party hired by E!’s parent company NBC Universal, lasted two months and interviewed Seacrest and Hardy among more than two dozen other witnesses, but found “insufficient evidence to substantiate allegations” against him.\n\nThe details of the investigation have not been made public. Hardy and her lawyers claim that several key witnesses were not interviewed, though the network disputes that assertion.\n\nHow Kelly Ripa and Other Coworkers Responded to Allegations\n\nAs Seacrest was quick to point out, a large portion of his various co-hosts and co-workers are women and many have voiced their support for him.\n\nKelly Ripa went on air to praise her co-host of Live! with Kelly and Ryan.\n\n“You are a privilege to work with and I adore you. Speaking on behalf of all of us here, I know what a easy, professional, great person you are, and I feel very, very lucky to work with you each and every day,” she said to Seacrest before hugging him.\n\nABC’s Scandal star Bellamy Young initially suggested Seacrest shouldn’t host the E! Oscars show, saying it was time “to step aside and let someone of equal talent that is beyond reproach to be in charge.” She retracted her statements promptly the next day and offered an apology, saying she did not have all the information.\n\n“Never has there been a more urgent time to make sure our voices are used for truth, and I failed in that regard Monday night,” she said. “Our word matters. I apologize to Ryan Seacrest.”\n\nJimmy Kimmel, who hosted the Oscars, also defended Seacrest ahead of the awards show, saying, “We should at the very least afford people the opportunity for truth, what the facts of the story are before hanging them out to dry.”\n\nWas Seacrest Snubbed at the Oscars?\n\nStill, rumors swirled that publicists warned their clients to avoid the TV personality after sexual assault allegations against him resurfaced before the awards show.\n\nReports of behind-the-scenes scrambling and the institution of a 30-second delay to shield Seacrest from any embarrassment were denied by E! News.\n\nThe show did seem to be a flop compared to past years though. Fewer people stopped to talk to Seacrest on the Oscars red carpet last weekend. Ratings did indeed fall.\n\nE!’s Live from the Red Carpet lost 35% of its 2017 audience. And while the entire awards show had its lowest ratings ever in 2018, E!’s coverage losses well outpaced those of ABC’s Oscars broadcast, according to the Hollywood Reporter.\n\nBut plenty of stars did visit with Seacrest before the awards and some even offered some support. An exchange between Seacrest and Taraji P. Henson generated speculation that the actress was throwing shade, though she later clarified that her intention was to encourage him.\n\nSeacrest’s Net Worth\n\nFor all the claims that the #MeToo movement may go too far and tarnish the careers of innocent men, Seacrest stands as a decisive counterpoint.\n\nHis Monday morning ratings on Live with Kelly and Ryan following the Oscars were the highest since he’s joined the show. Seacrest returns to host the new American Idol on Sunday, Mar. 11 in a premiere that has been heavily promoted by ABC.\n\nThe network shelled out $150 million in October to resign the Kardashian-Jenner clan for five more seasons of Keeping up with the Kardashians, which makes Seacrest about $15 million each year as the show’s producer.\n\nLast year he also signed a multi-year deal with ABC, just after becoming the permanent co-host of Live with Kelly and Ryan. In addition to his existing contracts for the morning show, American Idol, and the network’s live New Year’s Eve show, Ryan Seacrest Productions will now create scripted content for ABC.\n\nWith all these deals, the 46-year-old’s net worth is now estimated to be $380 million.\n\nWhile many claims of harassment never make it past human resources, the internal investigation does not definitively clear Seacrest’s name in any legal sense or mitigate the motives the network has to keep him on as a successful producer and personality.\n\nWhatever the details of the E! investigation, his producer role on major shows and his status as one of the top-earning celebrities give him significant pull in the industry.", "images": ["https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1242585998-e1665028070836.jpg?w=256&q=75", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243767517-e1665076497696.jpg?w=256&q=75", "https://content.fortune.com/wp-content/uploads/2018/03/ryan-seacrest-american-idol-sexual-harassment-e1520863148594.jpg?resize=1200,600", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243581035-e1665068106964.jpg?w=256&q=75"], "top_img": "https://content.fortune.com/wp-content/uploads/2018/03/ryan-seacrest-american-idol-sexual-harassment-e1520863148594.jpg?resize=1200,600", "keywords": [], "authors": [], "canonical_link": "https://fortune.com/2018/03/11/ryan-seacrest-sexual-harassment-allegations-american-idol/", "title": "How ‘American Idol’ Host Ryan Seacrest Escaped His Sexual Harassment Allegations Unscathed", "meta_data": {"viewport": "width=device-width", "msapplication-TileColor": "#ffc40d", "theme-color": "#ffffff", "description": "American Idol host Ryan Seacrest has escaped unscathed from sexual harassment allegations. Here's how.", "og": {"url": "https://fortune.com/2018/03/11/ryan-seacrest-sexual-harassment-allegations-american-idol/", "type": "article", "title": "How ‘American Idol’ Host Ryan Seacrest Escaped His Sexual Harassment Allegations Unscathed", "description": "American Idol host Ryan Seacrest has escaped unscathed from sexual harassment allegations. Here's how.", "site_name": "Fortune", "image": "https://content.fortune.com/wp-content/uploads/2018/03/ryan-seacrest-american-idol-sexual-harassment-e1520863148594.jpg?resize=1200,600", "width": 1024, "height": 683}, "twitter": {"card": "summary_large_image", "title": "How ‘American Idol’ Host Ryan Seacrest Escaped His Sexual Harassment Allegations Unscathed", "description": "American Idol host Ryan Seacrest has escaped unscathed from sexual harassment allegations. Here's how.", "image": "https://content.fortune.com/wp-content/uploads/2018/03/ryan-seacrest-american-idol-sexual-harassment-e1520863148594.jpg?resize=1200,600", "url": "https://fortune.com/2018/03/11/ryan-seacrest-sexual-harassment-allegations-american-idol/"}, "next-head-count": 32}, "movies": [], "publish_date": 1520726400.0, "source": "http://fortune.com", "summary": ""}