{"url": "www.celebritynetworth.com/richest-businessmen/producers/corey-gamble-net-worth/", "text": "What is Corey Gamble's Net Worth?\n\nCorey Gamble is an American talent manager and television personality who has a net worth of $15 million. Gamble is probably best known for being in a romantic relationship with celebrity mom Kris Jenner. He was reportedly working as Justin Bieber's tour manager when he met the reality star.\n\nEarly Life\n\nCorey Gamble was born on November 8, 1980, in Atlanta, Georgia. He attended Westlake High School, where he was a member of the football team, and his friends called him \"Mr. Dependable\" due to his ability to balance his school work and athletic activities. After graduating in 1999, Corey enrolled at Morehouse College, and he graduated with a degree in Business Management.\n\nCareer\n\nAfter graduating from college, Gamble moved to Los Angeles, California, to try to make a name in the music business. He began working with Scooter Braun, Justin Bieber's manager, who was named one of \"Time\" magazine's 100 Most Influential People in the World in 2013. Corey is the tour manager for Braun's entertainment and marketing company SB Projects, which has represented music stars such as Ariana Grande, Idina Menzel, and Demi Lovato. Since he started dating Kris Jenner, Corey has appeared on her E! reality series, \"Keeping Up with the Kardashians,\" several times, and he appeared on two episodes of Bravo's \"The Real Housewives of Beverly Hills\" in 2020.\n\nPersonal Life\n\nCorey met Kris Jenner in 2014 in Ibiza, Spain, when he attended the 40th birthday party of designer Riccardo Tisci, which was hosted by Jenner's son-in-law Kayne West. Jenner is the mother of Kim, Kourtney, Khloé, and Robert Kardashian and Kylie and Kendall Jenner. Gamble and Jenner reportedly had their first date at Casa Vega restaurant in Sherman Oaks, California, in October 2014, and that month he also joined her in Las Vegas for Kim's birthday. At the time, Corey was 33 years old, and Kris was 58. The following month, the couple went on vacation in Mexico, and paparazzi photographed them engaging in PDA at the airport after returning home.\n\nIn 2018, engagement rumors swirled after Kris appeared on James Corden's \"The Late Late Show\" and was asked, \"You've been spotted wearing a massive diamond ring on your wedding finger. Are you and Corey Gamble engaged?\" during a \"Spill Your Guts Or Fill Your Guts\" segment. Jenner opted to eat a cricket rather than answer the question.\n\nA 2019 episode of \"Keeping Up with the Kardashians\" revealed that Kayne had texted Gamble to ask why none of Kris's family members had met his family, and Khloe stated, \"We tried to get to know him, but he has not been receptive in this whole thing.\" Corey and Kris adopted a puppy, Bridgette, in early 2020, and on a September 2020 episode of \"Keeping Up with the Kardashians,\" Gamble complained, \"Kris is the one that wanted a dog, but I'm doing like, 99.7 percent of all dog duties.\" Corey previously dated Sheree Buchanan, who starred on the VH1 reality series \"Atlanta Exes.\" In 2010, Buchanan was granted a temporary protection order against Gamble due to the fact that he had been following her, calling and texting her repeatedly, and had grabbed her hard enough to leave bruises on her arms and legs.\n\nWatch Collection\n\nCorey Gamble is often photographed wearing very expensive watches, primarily Patek Philippe's. Corey's watch collection is reportedly worth in the low single-digit millions.", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2019/04/Corey-Gamble.jpg", "https://vz.cnwimg.com/wp-content/uploads/2014/11/cg.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2014/11/cg.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-businessmen/producers/corey-gamble-net-worth/", "title": "Corey Gamble Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Corey Gamble is an American talent manager and television personality who has a net worth of $15 million. Gamble is probably best known for being in a romantic relationship with celebrity mom Kris Jenner. He was reportedly working as Justin Bieber's tour ma...", "cnw_share_fb_count": 82, "cnw_share_tw_count": 15, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Corey Gamble Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-businessmen/producers/corey-gamble-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2014/11/cg.jpg", "site_name": "Celebrity Net Worth", "description": "Corey Gamble is an American talent manager and television personality who has a net worth of $15 million. Gamble is probably best known for being in a romantic relationship with celebrity mom Kris Jenner. He was reportedly working as Justin Bieber's tour ma..."}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2021-09-14T20:33:12+00:00", "published_time": "2019-04-02T20:53:31+00:00", "section": "Producers", "tag": "corey gamble worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2014/11/cg.jpg", "title": "Corey Gamble Net Worth", "description": "Corey Gamble is an American talent manager and television personality who has a net worth of $15 million. Gamble is probably best known for being in a romantic relationship with celebrity mom Kris ..."}}, "movies": [], "publish_date": 1554238411.0, "source": "http://www.celebritynetworth.com", "summary": ""}