{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/josh-gad-net-worth/", "text": "Josh Gad Net Worth: Josh Gad is an American actor who has a net worth of $14 million. Gad is best known for playing Elder Cunningham in the hit Broadway musical \"The Book of Mormon\" (which earned him a Tony nomination) and voicing Olaf in Disney's \"Frozen\" franchise. He has appeared in more than 30 films, including \"The Rocker\" (2008), \"Jobs\" (2013), \"Beauty and the Beast\" (2017), and \"Murder on the Orient Express\" (2017). Josh had a regular role on Fox's \"Back to You\" from 2007 to 2008, NBC's \"1600 Penn\" from 2012 to 2013, and FX's \"The Comedians\" in 2015, and he has guest-starred on shows such as \"Party Down\" (2009), \"Californication\" (2011), \"Modern Family\" (2011, 2020), and \"New Girl\" (2012–2015). In 2020, Gad began starring on HBO's \"Avenue 5\" and voicing Birdie on Apple TV+'s \"Central Park,\" which he also co-created and produces.\n\nEarly Life: Josh Gad was born Joshua Ilan Gad on February 23, 1981, in Hollywood, Florida. His parents, Susan and Sam, are from Germany and Afghanistan, respectively, and are both of Jewish descent; they had Josh and his older brothers, Jeff and Jason, together before divorcing in 1987. Susan went on to marry investment advisor Stanford Schwartz, giving Josh a stepbrother and stepsister. Gad studied at the University School of Nova Southeastern University, where he won the National Forensics League National Tournament Championships two years in a row, for Original Oratory in 1998 and Original Oratory and Humorous Interpretation in 1999. After graduating in 1999, he enrolled at the Carnegie Mellon College of Fine Arts, earning a Bachelor of Fine Arts in drama in 2003. Josh also spent a semester at Australia's National Institute of Dramatic Art.\n\nCareer: Gad's first film was 2002's \"Mary and Joe,\" and three years later, he made his small screen debut in an episode of NBC's \"ER\" and his Broadway debut in \"The 25th Annual Putnam County Spelling Bee.\" In 2007, he appeared in the film \"Watching the Detectives\" and landed a main role on the sitcom \"Back to You.\" Josh played news director Ryan Church on the series, which also starred Kelsey Grammer, Patricia Heaton, Fred Willard, and future \"Modern Family\" star Ty Burrell. In 2008, Gad co-starred with Rainn Wilson, Christina Applegate, and Emma Stone in \"The Rocker,\" appeared in the heist drama \"21,\" lent his voice to Fox's \"American Dad!,\" and guest-starred on the CBS series \"Numb3rs.\" From 2009 to 2011, Josh was a correspondent on Comedy Central's \"The Daily Show with Jon Stewart,\" and during this time, he also appeared in the films \"Crossing Over,\" \"Love & Other Drugs,\" and \"Marmaduke\" (voice only) and produced and starred in a web series called \"Gigi: Almost American.\"\n\nIn 2011, Gad returned to Broadway to originate the role of Elder Cunningham in \"The Book of Mormon,\" which won the Tony for Best Musical later that year. The musical, which was created by Trey Parker, Matt Stone, and Robert Lopez, was a huge success and has grossed more than $500 million. Josh left the production in June 2012 to serve as a star and co-executive producer on \"1600 Penn,\" a sitcom he co-created with Jon Lovett and Jason Winer. Also in 2012, he voiced Louis the molehog in the computer-animated film \"Ice Age: Continental Drift,\" which grossed $877.2 million at the box office. In 2013, Gad co-starred with Vince Vaughn and Owen Wilson in \"The Internship,\" portrayed Apple co-founder Steve Wozniak in \"Jobs,\" and voiced snowman Olaf in \"Frozen.\" He would reprise his role in \"Frozen II\" (2019), the short film \"Frozen Fever\" (2015), and the TV special \"Olaf's Frozen Adventure\" (2017). The franchise has been a massive success, with \"Frozen\" grossing $1.280 billion worldwide and \"Frozen II\" bringing in $1.450 billion.\n\nAfter \"Frozen,\" Josh appeared in the films \"Wish I Was Here\" (2014), \"The Wedding Ringer\" (2015) and \"Pixels\" (2015), and in 2017, he starred in another film that made over $1 billion, playing LeFou in \"Beauty and the Beast.\" In 2015, Gad co-starred with Billy Crystal on \"The Comedians,\" competed on \"Celebrity Jeopardy!,\" and guest-starred on \"Sesame Street.\" In recent years Gad has done voicework in numerous projects, including the films \"The Angry Birds Movie\" (2016), \"The Angry Birds Movie 2\" (2019), \"A Dog's Purpose\" (2017), and \"A Dog's Journey\" (2019) and the TV series \"Star Wars Rebels\" (2017), \"South Park\" (2017), and \"Bob's Burgers\" (2018). During the 2020 Coronavirus pandemic, Josh began hosting the YouTube series \"Reunited Apart,\" which reunited the casts of films such as \"Ghostbusters\" and \"Back to the Future\" through video conferencing. In 2020, he also starred in \"Artemis Fowl,\" \"Avenue 5,\" \"Central Park,\" and \"Home Movie: The Princess Bride,\" and he is set to reprise his \"Beauty and the Beast\" role in a Disney+ prequel series that he co-created; he will also be serving as a writer and executive producer on the show.\n\nPersonal Life: Josh married Ida Darvish, who co-starred with him in a 2004 production of David Ives' \"All in the Timing,\" on May 10, 2008. The couple welcomed daughter Ava on December 1, 2010, and daughter Isabella on February 17, 2014. Gad is the godfather of Theo Gabel, the son of Bryce Dallas Howard and Josh's longtime friend Seth Gabel. Though Josh was raised Jewish and Ida is Catholic, he has said that he is spiritual but doesn't consider himself religious.\n\nAwards and Nominations: In 2011, Gad earned a Tony nomination for Best Actor in a Musical for \"The Book of Mormon,\" and he won an Outer Critics Circle Award for Outstanding Actor in a Musical and a Grammy for Best Musical Theater Album. In 2008, he shared the Special Award for Best Ensemble with his \"21\" castmates at the ShoWest Convention, and in 2011, \"Gigi: Almost American\" won a New Media Film Festival Award for Best Web Series. Josh has won several awards for his voiceover work in the \"Frozen\" franchise, including four Behind the Voice Actors Awards (two individual awards and two ensemble awards), two Annie Awards for Outstanding Achievement in Voice Acting in an Animated Feature Production, and a Kids' Choice Award for Favorite Male Voice from an Animated Movie (for both \"Frozen II\" and \"The Angry Birds Movie 2\"). In 2012, he was nominated for an American Comedy Award for Breakout Performer of the Year, and in 2014, he received an Online Film & Television Association award for Best Voice-Over Performance for \"Frozen.\" \"Beauty and the Beast\" earned Gad a Teen Choice Award nomination for Choice: Scene Stealer and an MTV Movie + TV Award nomination for Best Duo (shared with Luke Evans).", "images": ["https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/wp-content/uploads/2013/12/Josh-Gad.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2013/12/Josh-Gad.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/josh-gad-net-worth/", "title": "Josh Gad Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Josh Gad net worth and salary: Josh Gad is an American actor who has a net worth of $14 million. Josh Gad was born", "cnw_share_fb_count": 146, "cnw_share_tw_count": 41, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Josh Gad Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/josh-gad-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2013/12/Josh-Gad.jpg", "site_name": "Celebrity Net Worth", "description": "Josh Gad net worth and salary: Josh Gad is an American actor who has a net worth of $14 million. Josh Gad was born"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2020-11-07T00:06:11+00:00", "published_time": "2020-10-06T00:20:06+00:00", "section": "Actors", "tag": "josh gad worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2013/12/Josh-Gad.jpg", "title": "Josh Gad Net Worth", "description": "Josh Gad net worth and salary: Josh Gad is an American actor who has a net worth of $14 million. Josh Gad was born"}}, "movies": [], "publish_date": 1601943606.0, "source": "https://www.celebritynetworth.com", "summary": ""}