{"url": "https://www.hollywoodreporter.com/news/alec-baldwin-trump-winning-presidential-election-1119319", "text": "Alec Baldwin talked politics during a Monday interview on Howard Stern’s SiriusXM radio show. Naturally, the conversation turned to President Trump — whom Baldwin hopes doesn’t get to serve a second term.\n\nBaldwin — whose portrayal of Trump on Saturday Night Live has drawn Twitter criticism from the president himself but has earned the actor an Emmy — told Stern, “I can only think of a couple people who I think could beat Trump.” When Stern suggested that Baldwin should run for the Oval Office in 2020, the actor confidently replied, “If I ran, I would win. I would absolutely win. I 1,000 percent would win.”\n\nHowever, Baldwin said an official bid is highly unlikely because of his hosting duties on ABC’s Match Game revival. Plus, his wife, Hilaria Baldwin, “would kill” him. “I’ve got to do Match Game! The presidency of the United States or Match Game?” he jokingly asked Stern. “You tell me.”\n\nBaldwin then slipped into his caricature of Trump and revealed his plans to take the summer off should he ever be elected. “I’m gonna take the summer off and be like, ‘Listen everybody, I’m going to East Hampton to relax. Howard and I have to go to Nick & Toni’s,'” he said, garnering laughter from Stern.\n\nWhen Stern brought up the idea of Baldwin running for president as Trump, the 30 Rock alum doubled down on his prior statement: “If I ran for president, I would win! Hands down, I would win. It would be the funniest, most exciting, most crazy campaign.”\n\n“You’re the hope of the Democratic Party,” Stern said, to which Baldwin quickly replied, “I’m not.”\n\nHe elaborated: “The only reason I say that is because I’d love to run for that position to just have things be very common sense. There’s so many things that this country needs to do that are so obvious.”\n\nDuring his chat with Stern, Baldwin emphasized that he’d like to “see a healthy” Republican Party. “I don’t want [House Minority Leader] Nancy Pelosi to run everything either,” Baldwin said of the California Democrat. “I want the Democrats to have a smart opposition to keep them on their toes.”\n\n“I’d like to see the Republican Party get back to [John McCain or Mitt Romney],” he explained to Stern. “I’d like to think that this thing with Trump is a one-off.”\n\nStill, Baldwin believes Trump’s election has had a negative impact on the way Americans view potential candidates. “We buy the presidency now — we vote for the president — like we buy gum or laundry soap,” he said. “It’s all jingoism and all this marketing.”\n\nBaldwin also offered a “theory” about Trump’s history-making summit in Singapore with North Korean dictator Kim Jong Un. “You can almost see Trump’s people saying to Kim Jong Un’s people, ‘We don’t really care if you get rid of the nukes. Let’s just say you are,'” Baldwin said, slipping into his impression of Trump again. “‘It’s politics. Let me go home and say what I need to say to get reelected.'”\n\nBaldwin has hinted that he might be done playing Trump on SNL. In a recent interview with The Hollywood Reporter, he said of the gig, “Every time I do it now, it’s like agony. Agony.”\n\nWatch part of Baldwin’s interview with Stern above.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/4bdc97bf-a2ae-4ca8-9828-ea5b1b39cab4.png?w=1024"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/4bdc97bf-a2ae-4ca8-9828-ea5b1b39cab4.png?w=1024", "keywords": [], "authors": ["Evan Real"], "canonical_link": "https://www.hollywoodreporter.com/news/politics-news/alec-baldwin-trump-winning-presidential-election-1119319/", "title": "Alec Baldwin on Running for President: “I Would Win”", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Alec Baldwin is confident he could beat Donald Trump if he were to run against the president in 2020.", "news_keywords": "Alec Baldwin, donald trump, howard stern", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Evan Real", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1119319, "title": "Alec Baldwin on Running for President: \"I Would Win\"", "published_at": "2018-06-12 07:46:18", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/4bdc97bf-a2ae-4ca8-9828-ea5b1b39cab4.png?w=1024", "comment_count": 0, "tags": "howard stern", "topics": "Politics News", "body": "Alec Baldwin talked politics during a Monday interview on Howard Stern's SiriusXM radio show. Naturally, the conversation turned to President Trump — whom Baldwin hopes doesn't get to serve a second term.\r\nBaldwin — whose portrayal of Trump on Saturday Night Live has drawn Twitter criticism from the president himself but has earned the actor an Emmy — told Stern, \"I can only think of a couple people who I think could beat Trump.\" When Stern suggested that Baldwin should run for the Oval Office in 2020, the actor confidently replied, \"If I ran, I would win. I would absolutely win. I 1,000 percent would win.\"\r\nHowever,  Baldwin said an official bid is highly unlikely because of his hosting duties on ABC's Match Game revival. Plus, his wife, Hilaria Baldwin, \"would kill\" him. \"I've got to do Match Game! The presidency of the United States or Match Game?\" he jokingly asked Stern. \"You tell me.\"\r\nBaldwin then slipped into his caricature of Trump and revealed his plans to take the summer off should he ever be elected. \"I'm gonna take the summer off and be like, 'Listen everybody, I'm going to East Hampton to relax. Howard and I have to go to Nick & Toni's,'\" he said, garnering laughter from Stern.\r\nWhen Stern brought up the idea of Baldwin running for president as Trump, the 30 Rock alum doubled down on his prior statement: \"If I ran for president, I would win! Hands down, I would win. It would be the funniest, most exciting, most crazy campaign.\"\r\n\"You're the hope of the Democratic Party,\" Stern said, to which Baldwin quickly replied, \"I'm not.\"\r\nHe elaborated: \"The only reason I say that is because I'd love to run for that position to just have things be very common sense. There's so many things that this country needs to do that are so obvious.\"\r\nDuring his chat with Stern, Baldwin emphasized that he'd like to \"see a healthy\" Republican Party. \"I don’t want [House Minority Leader] Nancy Pelosi to run everything either,\" Baldwin said of the California Democrat. \"I want the Democrats to have a smart opposition to keep them on their toes.\"\r\n\"I’d like to see the Republican Party get back to [John McCain or Mitt Romney],\" he explained to Stern. \"I’d like to think that this thing with Trump is a one-off.\"\r\nStill, Baldwin believes Trump's election has had a negative impact on the way Americans view potential candidates. \"We buy the presidency now — we vote for the president — like we buy gum or laundry soap,\" he said. \"It’s all jingoism and all this marketing.\"\r\nBaldwin also offered a \"theory\" about Trump's history-making summit in Singapore with North Korean dictator Kim Jong Un. \"You can almost see Trump's people saying to Kim Jong Un’s people, ‘We don’t really care if you get rid of the nukes. Let’s just say you are,'\" Baldwin said, slipping into his impression of Trump again. \"'It’s politics. Let me go home and say what I need to say to get reelected.'\"\r\nBaldwin has hinted that he might be done playing Trump on SNL. In a recent interview with The Hollywood Reporter, he said of the gig, \"Every time I do it now, it's like agony. Agony.\"\r\nWatch part of Baldwin's interview with Stern above.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Alec Baldwin on Running for President: “I Would Win”", "url": "https://www.hollywoodreporter.com/news/politics-news/alec-baldwin-trump-winning-presidential-election-1119319/", "description": "Alec Baldwin is confident he could beat Donald Trump if he were to run against the president in 2020.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/4bdc97bf-a2ae-4ca8-9828-ea5b1b39cab4.png?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-06-12T07:46:18+00:00", "modified_time": "2018-06-12T08:14:04+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Alec Baldwin on Running for President: “I Would Win”", "description": "Alec Baldwin is confident he could beat Donald Trump if he were to run against the president in 2020.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/4bdc97bf-a2ae-4ca8-9828-ea5b1b39cab4.png?w=1280"}}, "movies": [], "publish_date": 1528789578.0, "source": "https://www.hollywoodreporter.com", "summary": ""}