{"url": "https://web.archive.org/web/20170117143202/http://www.aol.com/article/news/2017/01/16/barack-obama-michelle-obama-wishes-she-didnt-have-to-be-married-to-me-while-im-president/21655805/", "text": "Before you go, we thought you'd like these...\n\nFirst lady Michelle Obama has made it clear she's eager to leave the White House, step into the next phase of her life, and even enjoy a simple trip to Target.\n\nWith less than a week until President-elect Donald Trump is sworn in and moves into the White House President Obama is sitting down with multiple news outlets to discuss his final days and office and legacy, and he revealed to 60 Minutes just how eager his wife is to move on.\n\nSEE ALSO: Malia Obama breaks into tears during her father's farewell speech\n\n\"Michelle never fully took to the scrutiny, she's thrived as a first lady, but it's not her preference,\" the outgoing president explained in his interview with the news program. \"She never fully embraced being in the public spotlight, which is ironic given how good she is.\"\n\n\"She used to say, Barack's exactly the kinda guy I want to be president I just wish he didn't want to do it when I was married to him,\" he added.\n\n58 PHOTOS Barack and Michelle Obama through the years See Gallery Barack and Michelle Obama through the years President Barack Obama waves as he walks across the South Lawn with daughter Malia, left, followed by Sasha Obama and first lady Michelle Obama, on their return to the White House, in Washington, Sunday, Jan. 3, 2016, after a family vacation in Hawaii. (AP Photo/Jacquelyn Martin) First lady Michelle Obama, left, and President Barack Obama arrive for an event to thank service members and their families at Marine Corp Base Hawaii, on Friday, Dec. 25, 2015, in Kaneohe Bay, Hawaii. (AP Photo/Evan Vucci) President Barack Obama and first lady Michelle Obama arrive at the 2015 Kennedy Center Honors reception in the East Room of the White House in Washington, Sunday, Dec. 6, 2015. (AP Photo/Jacquelyn Martin) President Barack Obama and first lady Michele Obama walk on the South Lawn of the White House in Washington, Tuesday, Sept. 29, 2015, as they return to the White House after spending three days in New York and the United Nations. (AP Photo/Susan Walsh) President Barack Obama and first lady Michelle Obama arrive at the Congressional Black Caucus Foundationâs 45th Annual Legislative Conference Phoenix Awards Dinner at the Walter E. Washington Convention Center in Washington, Saturday, Sept. 19, 2015, where the president spoke about the challenges facing black women, particularly in the areas of education, employment and criminal justice. ( AP Photo/Jose Luis Magana) President Barack Obama, accompanied by first lady Michelle Obama, left, speaks during an Independence Day celebration on the South Lawn at the White House in Washington, Saturday, July 4, 2015. (AP Photo/Andrew Harnik) President Barack Obama, first lady Michelle Obama and Mrs. Obama's mother Marian Robinson, center, board Air Force One before departure from Andrews Air Force Base, Md., Saturday, June 6, 2015, for Wilmington, Del., to attend the funeral services for former Delaware Attorney General Beau Biden, the vice presidentâs eldest son. Biden died of brain cancer at the age 46. (AP Photo/Jose Luis Magana) President Barack Obama kisses first lady Michelle Obama on the cheek as they announce their âLet Girls Learnâ initiative, Tuesday, March 3, 2015, in the East Room of the White House in Washington. The Obama administration is expanding efforts and directing a variety of federal agencies to work with other countries to help young girls worldwide attend and stay in school. (AP Photo/Jacquelyn Martin) President Barack Obama and first lady Michelle Obama wave before boarding Air Force One at JFK International airport in New York, Thursday, Sept. 25, 2014, en route back to Washington. (AP Photo/Julio Cortez) President Barack Obama speaks from the South Portico as he and first lady Michelle Obama host military families for an Independence Day celebration on the South Lawn at the White House in Washington, Friday, July 4, 2014. (AP Photo/Charles Dharapak) President Barack Obama and first lady Michelle Obama arrive at the White House in Washington, Thursday, May 15, 2014, from a trip to New York City. (AP Photo/Manuel Balce Ceneta) President Barack Obama kisses first lady Michelle Obama as they stand with the Easter Bunny on the Truman Balcony of the White House during the White House Easter Egg Roll on the South Lawn in Washington, Monday, April 21, 2014. Thousands of children gathered at the White House for the annual Easter Egg Roll. This year's event featured live music, cooking stations, storytelling, and of course, some Easter egg rolling. (AP Photo/Carolyn Kaster) President Barack Obama looks at first lady Michelle Obama after he kissed her after she spoke about college education at the Eisenhower Executive Office Building across from the White House in Washington, Thursday, Jan. 16, 2014. The event which is to promote opportunities for students to attend and finish college and university, was attended by college and university presidents and leaders from nonprofits, foundations, governments and businesses. (AP Photo/Charles Dharapak) President Barack Obama and first lady Michelle Obama put their hands over their heart as the National Anthem is played during the Kennedy Center Honors Gala at the Kennedy Center in Washington, Sunday, Dec. 8, 2013. (AP Photo/Manuel Balce Ceneta) President Barack Obama, first lady Michelle Obama, former President Bill Clinton and former President Jimmy Carter arrive at the Let Freedom Ring ceremony at the Lincoln Memorial in Washington, Wednesday, Aug. 28, 2013, to commemorate the 50th anniversary of the 1963 March on Washington for Jobs and Freedom. It was 50 years ago today when Martin Luther King Jr. delivered his \"I Have a Dream\" speech from the steps of the memorial. (AP Photo/Carolyn Kaster) U.S. President Barack Obama, left, and First Lady Michelle Obama wave as they enter State House accompanied by Tanzanian President Jakaya Kikwete, unseen, in Dar es Salaam, Tanzania Monday, July 1, 2013. Basking in an exuberant welcome from streets teeming with well-wishers, President Barack Obama on Monday declared a new era in U.S. relations with Africa based on partnership as opposed to charitable aid. (AP Photo/Ben Curtis) FILE - This Jan. 21, 2013 file photo shows President Barack Obama kissing first lady Michelle Obama during their dance at the Commander-in-Chief Inaugural Ball at the Washington Convention Center in Washington. Nobody would call bangs a new trend, but when the first lady's involved, things take on more significance. In fact, President Barack Obama did call his wife Michelle's new hairdo the most significant event of his second inauguration. (AP Photo/Jacquelyn Martin, File) US President Barack Obama (R) and First Lady Michelle Obama talk as they attends the memorial service for the late Senator Daniel Inouye at the National Memorial Cremetary of the Pacific in Honolulu, Hawaii, December 23, 2012. AFP Photo/Jim WATSON (Photo credit should read JIM WATSON/AFP/Getty Images) President Barack Obama kisses first lady Michelle Obama during the Inaugural parade in the reviewing stand in front of the White House on Pennsylvania Ave., in Washington, Monday, Jan. 21, 2013. Thousands marched during the 57th presidential inauguration parade after the ceremonial swearing-in of Obama. (AP Photo/Gerald Herbert) President Barack Obama, left, gives a thumbs-up as he is joined on stage by first lady Michelle Obama, right, at the end of the last debate against Republican presidential candidate, former Massachusetts Gov. Mitt Romney at Lynn University, Monday, Oct. 22, 2012, in Boca Raton, Fla. (AP Photo/Pablo Martinez Monsivais) THE VIEW - President Barack Obama, the 44th President of the United States, and First Lady Michelle Obama make their first joint appearance on âThe View,â TUESDAY, SEPTEMBER 25 (11:00 a.m.-12:00 noon, ET) on the ABC Television Network. (Show recorded on Monday, September 24, 2012) (Photo by Donna Svennevik/ABC via Getty Images) PRESIDENT BARACK OBAMA, MICHELLE OBAMA CHARLOTTE, NC - SEPTEMBER 06: (L-R) Sasha, First Lady Michelle Obama, President Barack Obama and Malia wave to the crowd at the 2012 Democratic National Convention on September 6, 2012 in Charlotte, North Carolina. (Photo by Lucian Perkins For The Washington Post via Getty Images) U.S. President Barack Obama, left, and first lady Michelle Obama host a kids' 'state dinner' at the White House in Washington, D.C., U.S., on Monday, Aug. 20, 2012. The luncheon, which featured a selection of healthy recipes from the Healthy Lunchtime Challenge, is part of the first lady's 'Let's Move' initiative to combat childhood obesity. Photographer: Pete Marovich/Bloomberg via Getty Images US President Barack Obama and his wife, US First Lady Michelle Obama, are seen on a large screen during the Men's USA Basketball vs Brazil game at the Verizon Center in Washington, DC, July 16, 2012. AFP PHOTO/Jim WATSON (Photo credit should read JIM WATSON/AFP/GettyImages) WASHINGTON, DC - JUNE 27: (AFP OUT) U.S. President Barack Obama and first lady Michelle Obama walk to the South Lawn of the White House on June 27, 2012 in Washington, D.D. The annual picnic was held for members of Congress. (Photo by Kristoffer Tripplaar-Pool/Getty Images) US President Barack Obama and First Lady Michelle Obama kiss prior to Obama speaking to US troops at Third Infantry Division Headquarters at Fort Stewart in Hinesville, Georgia, on April 27, 2012, prior to Obama signing an Executive Order to help US service members and their families make informed decisions about education and to protect them from deceptive targeting by educational institutions. AFP PHOTO/Saul LOEB (Photo credit should read SAUL LOEB/AFP/GettyImages) U.S. President Barack Obama, right, and first lady Michelle Obama wait to greet David Cameron, U.K. prime minister, and his wife Samantha Cameron on the North Portico of the White House in Washington, D.C., U.S., on Wednesday, March 14, 2012. Obama and Cameron showed a united front on finishing the war in Afghanistan and pressing for change in Iran and Syria, seeking to consolidate international support before a North Atlantic Treaty Organization meeting in May. Photographer: Joshua Roberts/Bloomberg via Getty Images US President Barack Obama and First Lady Michelle Obama chat as they walk to the White House in Washington, DC, on December 14, 2011 upon returing from Fort Bragg, North Carolina, where they met US troops. Obama on December 14, honored America's nearly nine years of 'bleeding and building' in Iraq, hailing the 'extraordinary achievement' of a war he once branded 'dumb.'AFP Photo/Jewel Samad (Photo credit should read JEWEL SAMAD/AFP/Getty Images) US President Barack Obama (C) waves as and First Lady Michelle Obama applauds during the Kennedy Center Honors event at the Kennedy Center in Washington, DC, on December 4, 2011. AFP Photo/Jewel Samad (Photo credit should read JEWEL SAMAD/AFP/Getty Images) First Lady Michelle Obama kisses US President Barack Obama after introducing him during a signing ceremony for a bill which provides tax credits to companies to put veterans back to work November 21, 2011 in the South Court Auditorium, next to the White House in Washington, DC. AFP PHOTO/Mandel NGAN (Photo credit should read MANDEL NGAN/AFP/Getty Images) NEW YORK, NY - SEPTEMBER 11: U.S. President Barack Obama (R), first Lady Michelle Obama (2nd R), former President George W. Bush walk past the North Pool of the 9/11 Memorial during the tenth anniversary ceremonies of the September 11, 2001 terrorist attacks at the World Trade Center site, September 11, 2011 in New York City. New York City and the nation are commemorating the tenth anniversary of the terrorist attacks on lower Manhattan which resulted in the deaths of 2,753 people after two hijacked planes crashed into the World Trade Center. (Photo by Jefferson Siegel-Pool/Getty Images) US President Barack Obama and First Lady Michelle Obama arrive for the Congressional Picnic on the South Lawn of the White House in Washington, DC, June 15, 2011. AFP PHOTO / Saul LOEB (Photo credit should read SAUL LOEB/AFP/Getty Images) US President Barack Obama and First Lady Michelle Obama wait to greet Britain's Queen Elizabeth II and Prince Philip, the Duke of Edinburgh, for a reciprocal dinner at the Winfield House in London, on May 25, 2011. Obama and his wife Michelle enjoyed a regal welcome from Queen Elizabeth II, who has met every US president but one since the 1950s. Obama's visit, the second stop on a European tour, comes as Britain seeks to prove its staying power despite fading military might and Washington looks to retool its decades-old alliance with Europe as a catalyst for global action. AFP Photo/Jewel Samad (Photo credit should read JEWEL SAMAD/AFP/Getty Images) US President Barack Obama (L) and First Lady Michelle wave from Air Force One as they departure in Rio de Janeiro, Brazil, March 21, 2011 to Santiago, Chile after two days of visits in Brazil. AFP PHOTO/VANDERLEI ALMEIDA (Photo credit should read VANDERLEI ALMEIDA/AFP/Getty Images) WASHINGTON - MAY 19: First lady Michelle Obama (L) stands with her husband U.S President Barack Obama, as they wait for Mexican President Felipe Calderon and his wife Margarita Zavala to arrive for a State Dinner at the White House on May 19, 2010 in Washington, DC. President Obama welcomed President Calderon to the White House today for an official state visit that is taking place amid tension over immigration politics and Mexico's deadly drug war. (Photo by Mark Wilson/Getty Images) WASHINGTON - MARCH 08: (AFP OUT) U.S. President Barack Obama (R) looks at his wife, first lady Michelle Obama (L), as she speaks during a reception in honor of International Womenï¿½s Day at the East Room of the White House March 8, 2010 in Washington, DC. The reception honored women from around the world and their achievements. (Photo by Alex Wong/Getty Images) Nobel Peace Prize laureate, US President Barack Obama (R) and First Lady Michelle Obama greet the torch parade from the balcony of the Grand Hotel in Oslo on December 10, 2009. US President Barack Obama today accepted the Nobel Peace Prize, uncomfortably acknowledging his role as a leader at war while insisting that conflict can be morally justified. AFP PHOTO/Cornelius Poppe/SCANPIX NORWAY OUT (Photo credit should read JEWEL SAMAD/AFP/Getty Images) WASHINGTON - NOVEMBER 24: First lady Michelle Obama (L) and President Barack Obama walk to the North Portico of the White House to await the arrival of the Indian Prime Minister November 24, 2009 in Washington, DC. U.S. President Barack Obama and first lady Michelle Obama hosted their first State Dinner for Prime Minister Manmohan Singh and his wife Gursharan Kaur of India. (Photo by Brendan Smialowski/Getty Images) WASHINGTON - OCTOBER 02: US President Barack Obama and his wife first lady Michelle Obama walk from Marine One on the south lawn after arriving back at the White House on October 2, 2009 in Washington, DC. President Obama later spoke to the media about his trip to Copenhagen to lend support to Chicago to host the 2016 Summer Olympics games which was announced today to be held in Rio de Janeiro instead. (Photo by Mark Wilson/Getty Images) US President Barack Obama winks at the First Lady Michelle Obama as they wait to welcome leaders to the G20 dinner at the Phipps Conservatory on September 24, 2009 in Pittsburgh, Pennsylvania. AFP PHOTO/Jewel SAMAD (Photo credit should read JEWEL SAMAD/AFP/Getty Images) US President Barack Obama kisses First Lady Michelle Obama prior to speaking at Hradcany Square near Prague Castle in Prague, Czech Republic, on April 5, 2009. The world must deliver 'a strong international response' to North Korea's launch of a rocket, US President Barack Obama said in a speech in Prague on Sunday. AFP PHOTO / Saul Loeb (Photo credit should read SAUL LOEB/AFP/Getty Images) US President Barack Obama (R) and First Lady Michelle Obama (L) dance during their visit to the Western Inaugural Ball on January 20, 2009 at the Washington Convention Center in Washington, DC. AFP PHOTO/ TIM SLOAN (Photo credit should read TIM SLOAN/AFP/Getty Images) President Barack Obama and First Lady Michelle walk the Inaugural Parade route following Obama being sworn in as 44th US president January 20, 2009 in Washington, DC. Obama and Michelle twice stepped from of their limousine and out onto Pennsylvania Avenue to walk down the route taking them to the White House. AFP PHOTO / JIM WATSON (Photo credit should read JIM WATSON/AFP/Getty Images) WASHINGTON - JANUARY 18: President-elect Barack Obama (L) and his wife Michelle Obama arrive at 'We Are One: The Obama Inaugural Celebration At The Lincoln Memorial' January 18, 2009 in Washington, DC. The event includes a diverse array of talent featuring both musical performances and historical readings and an appearance by U.S. President-elect Barack Obama. (Photo by Mark Wilson/Getty Images) CHICAGO - NOVEMBER 04: U.S. President elect Barack Obama and his wife Michelle wave to their supporters after Obama gave his victory speech during an election night gathering in Grant Park on November 4, 2008 in Chicago, Illinois. Obama defeated Republican nominee Sen. John McCain (R-AZ) by a wide margin in the election to become the first African-American U.S. President elect. (Photo by Scott Olson/Getty Images) US Democratic presidential candidate Illinois Senator Barack Obama and wife Michelle cast their votes in the 2008 presidential elections in Chicago, Illinois, November 4, 2008. AFP PHOTO/Emmanuel Dunand (Photo credit should read EMMANUEL DUNAND/AFP/Getty Images) NASHVILLE, TN - OCTOBER 07: Democratic presidential nominee U.S. Sen. Barack Obama (D-IL) (L) kisses his wife Michelle Obama laugh at the end of the Town Hall Presidential Debate at Belmont University's Curb Event Center October 7, 2008 in Nashville, Tennessee. Tonight's debate is the second presidential debate of three, the only one being held in the town hall style with questions coming from audience members. (Photo by Charles Dharapak-Pool/Getty Images) US Democratic presidential candidate Illinois Senator Barack Obama and his wife Michelle embrace during an election day speech at the end of the 2008 Democratic Party primaries, at the Xcel Energy Center in St Paul, Minnesota, on June 3, 2008. AFP PHOTO/Emmanuel DUNAND (Photo credit should read EMMANUEL DUNAND/AFP/Getty Images) Democratic presidential candidate US Senator Barack Obama stands with his wife Michelle during a primary results rally in Raleigh, North Carolina, May 06, 2008. AFP PHOTO/Emmanuel Dunand (Photo credit should read EMMANUEL DUNAND/AFP/Getty Images) EVANSVILLE, IN - APRIL 22: Democratic presidential candidate Sen. Barack Obama of Illinois and his wife Michelle Obama acknowledge the crowd at the Roberts Stadium, April 22, 2008 in Evansville Indiana. Late exit polls showed Obama losing the Pennsylvania primary to rival Sen. Hillary Clinton of New York by ten percentage points. (Photo by Mark Wilson/Getty Images) Democratic presidential candidate US Senator Barack Obama and his wife Michelle during a rally at University of Pittsburgh in Pittsburgh, Pennsylvania, April 21, 2008. Pennsylvania will hold its primary vote on April 22. AFP PHOTO/Emmanuel Dunand (Photo credit should read EMMANUEL DUNAND/AFP/Getty Images) Surrounded by his family and supporters, Democratic presidential hopeful Sen. Barack Obama and wife Michelle Obama proclaim a resounding victory in the South Carolina Democratic primary, Saturday, January 26, 2008, in Columbia, South Carolina. (Photo by Gary O'Brien/Charlotte Observer/MCT via Getty Images) SPRINGFIELD, IL - FEBRUARY 10: Sen. Barack Obama (D-IL) and his wife Michelle wave during a rally in front of the old historic State Capitol building February 10, 2007 in Springfield, Illinois. Obama announced to the crowd that he would seek the Democratic nomination for President. (Photo by Mark Wilson/Getty Images) Senator Barack Obama and Michelle Robinson during The 36th Annual NAACP Image Awards - Arrivals at Dorothy Chandler Pavilion in Los Angeles, California, United States. (Photo by Albert L. Ortega/WireImage) CHICAGO - NOVEMBER 2: Candidate for the U.S. Senate Barack Obama (D-IL) (L) holding his daughter Malia with wife Michelle and youngest daughter Sasha (R) celebrate his victory with supporters over Repulican rival Alan Keyes November 2, 2004 in Chicago, Illinois. Obama was expected to easily defeat Keyes in this first ever senate race featuring two major-party African-American candidates. (Photo by Scott Olson/Getty Images) CHICAGO - NOVEMBER 2: Candidate for the U.S. Senate Barack Obama (D-IL) sits with his wife Michelle and daughters Sasha (L) and Malia (R) in a hotel room as they wait for election returns to come in November 2, 2004 in Chicago, Illinois. Obama is expected to win easily against the Republican candidate Alan Keyes. (Photo by Scott Olson/Getty Images) Democratic candidate for the United States Senate in Illinois, Barack Obama and his wife Michelle Obama wave to the crowd at the Democratic National Convention at the Fleet Center in Boston, Massachusetts, Tuesday, July 27, 2004. (Photo by Jim Rogash/WireImage) Up Next See Gallery Discover More Like This HIDE CAPTION of SEE ALL BACK TO SLIDE SHOW CAPTION\n\nAlthough her tenure in the role has not been without controversy, the first lady has enjoyed relatively high popularity. Polling on the position throughout her time in office found nearly two-thirds of the country had a favorable opinion of her for most of her time in office. She dipped to her lowest point -- 58 percent --shortly before the 2016 Democratic convention, according to Gallup.\n\nDuring his farewell address in Chicago, the outgoing president paid a tearful tribute to his wife.\n\nSEE MORE: Laura Ingraham accuses President Obama of 'crocodile tears' in farewell speech\n\n\"You took on a role you didn't ask for and made it your own with grace and grit and style and good humor,\" he said.\n\nMany people, especially among Democrats, have been clamoring for her to run for office someday -- a plan she has repeatedly shot down.\n\nSEE ALSO: Where is Sasha Obama? First daughter conspicuously missing from Obama's farewell address", "images": ["https://web.archive.org/web/20170117143202im_/https://o.aolcdn.com/aoldotcom-releases/lazyload/blank.gif", "https://web.archive.org/web/20170117143202im_/http://www.blogsmithmedia.com/www.aol.com/assets-hd14d623b64e6dc223c77a49f4074d372/images/header-news.svg?h=b9d152f1cad00df0bceccc337f146d7f", "https://web.archive.org/web/20170117143202im_/http://www.blogsmithmedia.com/www.aol.com/assets-hd14d623b64e6dc223c77a49f4074d372/images/byg-close.svg?h=454dbc3d0a02209152b91c3040c92ace", "https://web.archive.org/web/20170117143202im_/http://www.blogsmithmedia.com/www.aol.com/assets-hd14d623b64e6dc223c77a49f4074d372/images/nav/aol-logo-white.svg?h=f824c828bebad2dc973464159eec6a88", "https://web.archive.org/web/20170117143202im_/https://o.aolcdn.com/aoldotcom-releases/global/spacer.gif", "https://web.archive.org/web/20170117143202im_/https://img.vidible.tv/prod/2017-01/16/587cc477c4d21f658d0c9359_o_F_v1.jpg", "https://web.archive.org/web/20170117143202im_/http://www.blogsmithmedia.com/www.aol.com/assets-hd14d623b64e6dc223c77a49f4074d372/images/breaking-news-newsletter-logo.png?h=7d046df8a442e1e1972769bf6c7e5106", "https://web.archive.org/web/20170117143202im_/http://www.blogsmithmedia.com/www.aol.com/assets-hd14d623b64e6dc223c77a49f4074d372/images/nav/aol-logo-black.png?h=155df79eb51f2b0800b7c5a970c2ddd0", "https://web.archive.org/web/20170117143202im_/https://s.aolcdn.com/aoldotcom-releases/lazyload/blank.gif", "https://web.archive.org/web/20170117143202im_/http://www.aol.com/article/news/2017/01/16/barack-obama-michelle-obama-wishes-she-didnt-have-to-be-married-to-me-while-im-president/21655805/", "https://web.archive.org/web/20170117143202im_/http://o.aolcdn.com/dims-shared/dims3/GLOB/legacy_thumbnail/1028x675/format/jpg/quality/85/http%3A%2F%2Fo.aolcdn.com%2Fhss%2Fstorage%2Fmidas%2Fe90aa213351f322103ca7a4c45acec9f%2F204815798%2FRTSUA4N.jpeg"], "top_img": "https://web.archive.org/web/20170117143202im_/http://o.aolcdn.com/dims-shared/dims3/GLOB/legacy_thumbnail/1028x675/format/jpg/quality/85/http%3A%2F%2Fo.aolcdn.com%2Fhss%2Fstorage%2Fmidas%2Fe90aa213351f322103ca7a4c45acec9f%2F204815798%2FRTSUA4N.jpeg", "keywords": [], "authors": ["Aol Staff"], "canonical_link": "https://web.archive.org/web/20170117143202/http://www.aol.com/article/news/2017/01/16/barack-obama-michelle-obama-wishes-she-didnt-have-to-be-married-to-me-while-im-president/21655805/", "title": "Barack Obama: Michelle Obama wishes she didn't have to be married to me while I'm president", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "p": {"domain_verify": "96bae1739d3231d21abe59a638021d5d"}, "description": "In one of his final interviews, the outgoing president said his wife 'never fully embraced being in the public spotlight.'", "author": "AOL Staff", "og": {"type": "article", "image": "https://web.archive.org/web/20170117143202im_/http://o.aolcdn.com/dims-shared/dims3/GLOB/legacy_thumbnail/1028x675/format/jpg/quality/85/http%3A%2F%2Fo.aolcdn.com%2Fhss%2Fstorage%2Fmidas%2Fe90aa213351f322103ca7a4c45acec9f%2F204815798%2FRTSUA4N.jpeg", "site_name": "AOL.com", "url": "https://web.archive.org/web/20170117143202/http://www.aol.com/article/news/2017/01/16/barack-obama-michelle-obama-wishes-she-didnt-have-to-be-married-to-me-while-im-president/21655805/", "app_id": 183146218394780, "title": "Barack Obama: Michelle Obama wishes she didn't have to be married to me while I'm president", "description": "In one of his final interviews, the outgoing president said his wife 'never fully embraced being in the public spotlight.'"}, "fb": {"app_id": 183146218394780}, "twitter": {"account_id": 66237835, "card": "summary", "site": "@AOL", "title": "Barack Obama: Michelle Obama wishes she didn't have to be married to me while I'm president", "creator": "@AOL", "image": {"src": "http://o.aolcdn.com/dims-shared/dims3/GLOB/legacy_thumbnail/1028x675/format/jpg/quality/85/http%3A%2F%2Fo.aolcdn.com%2Fhss%2Fstorage%2Fmidas%2Fe90aa213351f322103ca7a4c45acec9f%2F204815798%2FRTSUA4N.jpeg"}, "domain": "www.aol.com", "app": {"country": "US", "name": {"googleplay": "Aol App"}, "id": {"googleplay": "com.aol.mobile.aolapp"}, "url": {"googleplay": "http://www.aol.com/article/news/2017/01/16/barack-obama-michelle-obama-wishes-she-didnt-have-to-be-married-to-me-while-im-president/21655805/"}}, "description": "In one of his final interviews, the outgoing president said his wife 'never fully embraced being in the public spotlight.'"}, "robots": "index,follow", "article": {"publisher": "https://www.facebook.com/aol"}, "al": {"android": {"package": "com.aol.mobile.aolapp", "url": "http://www.aol.com/article/news/2017/01/16/barack-obama-michelle-obama-wishes-she-didnt-have-to-be-married-to-me-while-im-president/21655805/", "app_name": "Aol App"}}, "publish-date": "January 16, 2017", "msapplication-TileColor": "#3399ff", "msapplication-TileImage": "http://www.blogsmithmedia.com/www.aol.com/assets-hd14d623b64e6dc223c77a49f4074d372/images/favicon/mstile-144x144.png?h=97a38046e42ae88d385d44315c16415c?v=Kmmv6Rgb5o", "msapplication-config": "http://www.blogsmithmedia.com/www.aol.com/assets-hd14d623b64e6dc223c77a49f4074d372/images/favicon/browserconfig.xml?h=3af9d6a02a9854da3646959922f4fe0c?v=Kmmv6Rgb5o", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1484524800.0, "source": "https://web.archive.org", "summary": ""}