{"url": "https://www.j-14.com/posts/brandon-flynn-gay-142385/", "text": "\n\n\n\nBrandon Flynn is known for playing the complicated character of Justin Foley on the Netflix series 13 Reasons Why and, while his character and his relationship with his on and off again girlfriend Jessica gave fans plenty to talk about, it’s what Brandon just shared about his personal life that has fans feeling so proud.\n\nThe actor took to Instagram to share his thoughts after seeing that someone thought it was a good idea to skywrite “Vote No” in the skies of Sydney while the people of Australia are in the midst of voting whether to legalize same-sex marriage in the country. The actor posted a rainbow flag on Instagram that says “Equality” in the middle of it. In his caption, he explained why seeing this was upsetting for anyone to see, especially members of the LGBTQ community, including himself.\n\n“Just saw the “vote no” message in the sky, looming over Sydney. Thank you for raising money and hiring on a plane to write your lack of support amongst the clouds. I hope your hate and lack of understanding fades, just like those words will. Too many of my friends have been kicked out of their homes, kept in the closet, beat up, killed, ridiculed by church and state, institutionalized… and you are scared that if we vote YES, you won’t be able to show your hate for Us,” Justin wrote. “F—k that. We’ve been scared s—tless our whole lives thanks to all the stigmas that surround Us, stigmas that were set in place by the same kind of people who flew that plane over Sydney. We’ve fought, we’ve come out bravely even in our fear, and you wrote a message in the sky because you’re scared. Equality takes courage, it worries me that too many people in this world lack the balls to stand up for what is right. #f—khate.”\n\nNow that is a truly powerful message anyone can learn from. Brandon subtly writing “Us” confirms that he not only supports LGBTQ rights but also identifies as someone who has dealt with the stigma that unfortunately still exists for people who are in the community. The actor was rumored to be dating his 13 Reasons Why co-star Miles Heizer, who plays Alex Standall, but Miles’ rep confirmed that they are just friends.\n\n“This is a false report. Miles and Brandon are friends from the show but are not dating,” the rep said to Page Six. And since then, the actor has been spotted getting cozy with singer Sam Smith, and the pair looked as happy as ever walking arm in arm, sharing a kiss. So while Brandon didn’t blatantly comment on his own sexuality in that heartfelt IG post, it’s clear he’s sharing his own experiences all in the hopes that equality for everyone will become a reality very soon. And that is beyond commendable.\n\nWatch: Check Out Behind-the-Scenes Photos From Season One of *13 Reasons Why*\n\nLove J-14? Be sure to subscribe to our YouTube channel for fun, exclusive videos with your favorite stars.", "images": ["https://www.j-14.com/wp-content/uploads/2017/09/brandon-flynn.jpg?resize=1200%2C630&quality=86&strip=all", "https://www.j-14.com/wp-content/uploads/2017/09/brandon-flynn.jpg?fit=800%2C510&quality=86&strip=all", "https://www.j-14.com/wp-content/themes/ami-magazines/assets/build/images/placeholders/placeholder-1x1.svg", "https://www.j-14.com/wp-content/themes/ami-magazines/assets/build/images/placeholders/placeholder-16x9.svg"], "top_img": "https://www.j-14.com/wp-content/uploads/2017/09/brandon-flynn.jpg?resize=1200%2C630&quality=86&strip=all", "keywords": [], "authors": ["Jennifer Maldonado"], "canonical_link": "https://www.j-14.com/posts/brandon-flynn-gay-142385/", "title": "13 Reasons Why Brandon Flynn Says He's Part of the LGBTQ Community", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "theme-color": "#ffffff", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Brandon Flynn is known for playing the complicated character of Justin Foley on the Netflix series 13 Reasons Why and, while his character and his", "og": {"locale": "en_US", "type": "article", "title": "13 Reasons Why Brandon Flynn Says He's Part of the LGBTQ Community", "description": "Brandon Flynn is known for playing the complicated character of Justin Foley on the Netflix series 13 Reasons Why and, while his character and his relationship with his on and off again girlfriend...", "url": "https://www.j-14.com/posts/brandon-flynn-gay-142385/", "site_name": "J-14", "updated_time": "2017-10-03T18:23:38+00:00", "image": {"identifier": "https://www.j-14.com/wp-content/uploads/2017/09/brandon-flynn.jpg?resize=1200%2C630&quality=86&strip=all", "secure_url": "https://www.j-14.com/wp-content/uploads/2017/09/brandon-flynn.jpg?resize=1200%2C630&quality=86&strip=all", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/j14magazine", "published_time": "2017-09-21T14:46:00+00:00", "modified_time": "2017-10-03T18:23:38+00:00"}, "author": "Jennifer Maldonado", "twitter": {"card": "summary_large_image", "title": "13 Reasons Why Brandon Flynn Says He's Part of the LGBTQ Community", "description": "Brandon Flynn is known for playing the complicated character of Justin Foley on the Netflix series 13 Reasons Why and, while his character and his relationship with his on and off again girlfriend...", "image": "https://www.j-14.com/wp-content/uploads/2017/09/brandon-flynn.jpg?resize=1200%2C630&quality=86&strip=all", "creator": "@J14Magazine", "site": "@J14Magazine"}, "fb": {"admins": 593583017, "pages": 6338692612}, "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://www.j-14.com/wp-content/uploads/2020/11/android-chrome-144x144-1.png?fit=144%2C144&quality=86&strip=all"}, "movies": [], "publish_date": 1506005160.0, "source": "https://www.j-14.com", "summary": ""}