{"url": "https://www.standard.co.uk/showbiz/celebrity-news/i-support-her-matt-smith-breaks-silence-on-claire-foy-pay-gap-a3820731.html", "text": "M att Smith has broken his silence on the pay disparity between himself and co-star Claire Foy on The Crown, claiming that \"amends\" have been made.\n\nFoy was paid a lower wage than Smith, who played Prince Phillip, despite having the leading role as Queen Elizabeth II in the hit Netflix drama.\n\nSmith has now spoken out, saying he supports “best friend” Foy and suggesting that producers have since rectified the pay gap.\n\nSpeaking at the premiere of his latest film Mapplethorpe he told Hollywood Reporter: “Claire is one of my best friends, and I believe that we should be paid equally and fairly and there should be equality for all.\n\nAnger: Fans were fuming after it was revealed Claire Foy earned less than Matt Smith\n\n“I support her completely, and I'm pleased that it was resolved and they made amends for it because that what's needed to happen. Going forward, I think we should all bear in mind that we need to strive to make this better and a more even playing field for everyone involved — but not just in our industry, in all industries.”\n\nHis comments come weeks after fans of the royal drama launched a petition, calling on Smith to “make up for the sexist pay gap” by donating the difference in his and Foy’s paychecks to The Time’s Up movement which aims to stamp out inequality and harassment in the work place.\n\nThe Crown cast and their real-life counterparts - In pictures 1 /33 The Crown cast and their real-life counterparts - In pictures Queen Elizabeth II Portrayed by Olivia Colman in season 3 Netflix/PA The Queen Mother and Princess Margaret Marion Bailey as the Queen Mother and Helena Bonham Carter as Princess Margaret in season 3 Netflix/Getty Images Princess Anne Erin Doherty as Princess Anne in season 3 Netflix/Getty Images Prince Charles Josh O'Connor as Prince Charles in season 3 Netflix/PA Prince Philip Portrayed by Tobias Menzies in season 3 Netflix/PA Queen Elizabeth II Portrayed by Olivia Colman in season 3 Netflix Prince Charles Portrayed by Josh O'Connor in season 3 Netflix Prince Philip Portrayed by Tobias Menzies in season 3 Netflix Lord Mountbatten Portrayed by Charles Dance in season 3 Netflix The Duke of Windsor Portrayed by Derek Jacobi in season 3 Netflix The Queen Mother Portrayed by Marion Bailey in season 3 Netflix Harold Wilson Portrayed by Jason Watkins in season 3 Netflix Camilla Shand (later Parker Bowles) Portrayed by Emerald Fennell in season 3 Netflix Antony Armstrong Jones, Lord Snowden Portrayed by Ben Daniels in season 3 Netflix Princess Margaret Portrayed by Helena Bonham Carter in season 3 Netflix Queen Elizabeth II Portrayed by Claire Foy in season 1 & 2 Netflix/PA Duke of Edinburgh Portrayed by Matt Smith in season 1 & 2 Netflix/PA Queen Elizabeth and Jackie Kennedy Portrayed by Claire Fore and Jodi Balfour n season 1 & 2 Netflix/Getty Images The Queen Mother Portrayed by Victoria Hamilton in season 1 & 2 Netflix/PA Winston Churchill Portrayed by John Lithgow in season 1 & 2 Netflix/Getty Images Princess Margaret Portrayed by Vanessa Kirby in season 1 & 2 Netflix/Getty Images King George VI Portrayed by Jared Harris in season 1 & 2 Netflix/Getty Images Duke of Windsor Portrayed by Alex Jennings in season 1 & 2 Netflix/Getty Images Antony Armstrong-Jones Portrayed by Matthew Goode in season 2 Netflix/Getty Images Anthony Eden Portrayed by Jeremy Northam in season 1 & 2 Netflix/Getty Images\n\nFoy previously addressed the disparity, saying both herself and Smith found it “odd” to be at the centre of a furore.\n\n“I’m surprised because I’m at the centre of it, and anything that I’m at the centre of like that is very, very odd, and feels very, very out of ordinary,” she told Entertainment Weekly.\n\n“But I’m not [surprised about the interest in the story] in the sense that it was a female-led drama. I’m not surprised that people saw the story and went, ‘Oh that’s a bit odd’.\n\nThe Crown: Tobias Menzies announced as Duke of Edinburgh\n\n“But I know that Matt feels the same that I do, that it’s odd to find yourself at the centre [of a story] that you didn’t particularly ask for.”\n\nShow producers Suzanne Mackie and Andy Harries made the revelation about Foy’s pay during a panel discussion, saying Smith had made more “due to his Doctor Who fame”.\n\nMackie then added: “Going forward, no one gets paid more than the Queen.”\n\nLeft Bank Pictures, which makes The Crown on behalf of Netflix, apologised for the pay disparity and subsequent fall out.\n\nFoy and Smith’s tenures as the royals have finished, with Olivia Colman and Tobias Menzies confirmed to take on Her Majesty and Prince Philip respectively for series three.", "images": ["https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/21/18/crown.jpg?width=968&auto=webp&quality=50&crop=968%3A645%2Csmart", "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/21/18/crown.jpg?width=1200&width=1200&auto=webp&quality=75"], "top_img": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/21/18/crown.jpg?width=1200&width=1200&auto=webp&quality=75", "keywords": [], "authors": ["Emma Powell"], "canonical_link": "https://www.standard.co.uk/showbiz/celebrity-news/i-support-her-matt-smith-breaks-silence-on-claire-foy-pay-gap-a3820731.html", "title": "‘I support her’: Matt Smith breaks silence on Claire Foy pay gap and says The Crown producers 'made amends'", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "description": "Smith confirmed amends have been made in the wake of the revelation", "theme-color": "#FFFFFF", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 193840110715213, "pages": 165348596842143}, "category": "Celebrity News", "sitename": "Evening Standard", "page path": "/showbiz/celebrity-news", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "site_name": "Evening Standard", "updated_time": "2018-04-23T09:21:35.000Z", "title": "‘I support her’: Matt Smith breaks silence on Claire Foy pay gap", "url": "https://www.standard.co.uk/showbiz/celebrity-news/i-support-her-matt-smith-breaks-silence-on-claire-foy-pay-gap-a3820731.html", "type": "article", "description": "Smith confirmed amends have been made in the wake of the revelation", "image": {"identifier": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/21/18/crown.jpg?width=1200&width=1200&auto=webp&quality=75", "secure_url": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/21/18/crown.jpg?width=1200&width=1200&auto=webp&quality=75"}}, "twitter": {"site": "@EveningStandard", "card": "summary_large_image", "description": "Smith confirmed amends have been made in the wake of the revelation", "image": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/21/18/crown.jpg?width=1200&width=1200&auto=webp&quality=75", "title": "‘I support her’: Matt Smith breaks silence on Claire Foy pay gap"}, "article": {"published_time": "2018-04-23T09:21:35.000Z", "modified_time": "2018-04-23T09:21:35.000Z", "section": "Showbiz", "subsection": "Celebrity News", "author_name": "Emma Powell", "content_type": "story", "word_count": 611, "image_count": 2, "embed_count": 2, "video_count": 1, "internal_link_count": 8, "external_link_count": 0}, "date": "2018-04-23T09:21:35.000Z", "author": "Emma Powell", "publisher": "Evening Standard", "vf": {"url": "https://www.standard.co.uk/showbiz/celebrity-news/i-support-her-matt-smith-breaks-silence-on-claire-foy-pay-gap-a3820731.html"}, "keywords": "Matt Smith, Claire Foy, The Crown, Netflix"}, "movies": [], "publish_date": 1524475295.0, "source": "https://www.standard.co.uk", "summary": ""}