{"url": "http://www.chicagotribune.com/entertainment/movies/sc-mov-ready-player-one-rev-02364-story.html", "text": "Of all the frenzied races in Steven Spielberg’s “Ready Player One,” the closest one pits the director’s mastery against the material’s banality. By a whisker, Spielberg wins it.\n\nIf you’re a fan of the 2011 Ernest Cline best-seller, you wouldn’t use “banality,” but you’d have to concede “familiarity” as an acceptable substitute. We’re back in the realm of Young Adult dystopia, in this case (as revised by screenwriter Zak Penn, working with co-adapter Cline) the miserably overcrowded year 2045 in Columbus, Ohio. There, our Young Hero, Wade, played by Tye Sheridan, lives a life the way millions of his fellow citizens are living it. They’re hooked on their virtual-reality devices, and wired for hours and hours at a stretch into the multistrand worlds of the OASIS (Ontologically Anthropocentric Sensory Immersive Simulation), created by the late tech genius played, thank God, by Mark Rylance.\n\nAdvertisement\n\nThe story is “Charlie and the Chocolate Factory,” digitized. The sweetly mad inventor has hidden clues to three keys inside the OASIS, and whoever secures all three becomes heir to a massive fortune. Much of “Ready Player One,” and the artistic reason for Spielberg’s involvement, concerns the ever-shifting parameters and rules and environments within the OASIS. For an hour, “Ready Player One” is terrific fun with a necessary ominous edge. At its heart is a lovelorn teen boy looking for a real connection. Wade’s gaming avatar, a sleek, blonde, tattooed, boy-band-looking dude named Parzival, longs to know the supercool Art3mis in the real world, where she is plain ol’ supercool Samantha, played by Olivia Cooke.\n\nIf the whole of “Ready Player One” were as fluid and exciting as the first action showcase, we’d have a classic. Driving the DeLorean from “Back to the Future,” Wade/Parzival learns the secret to winning the dizzying championship auto race. From there it’s on to the next world, the next race for the next key. The forces of corporate evil conspire against Wade and, eventually, his OASIS posse. Ben Mendelsohn portrays the sniveling face of adversity, and he makes for a surprisingly ineffectual antagonist. Or maybe I’m at the point in my life where I want Rylance to play every available supporting role, not just one or two.\n\nAdvertisement\n\nThe movie runs 140 minutes, which feels overgenerous for the amount and the quality of the narrative at hand. Spielberg juices it, flinging the audience between virtual worlds, and between virtual and real ones. The visual referencing is happily relentless. The holy hand grenade from “Monty Python and the Holy Grail” flies by for a cameo; so does King Kong and “The Breakfast Club” and Chucky from “Child’s Play” and famous emblems of Spielberg’s own movies.\n\nFor a longer section, “Ready Player One” enters a sly re-creation of “The Shining.” There, Wade’s cohort Aech (don’t want to give away the performer; it’s a bit of a spoiler) runs afoul of the blood-gushing elevator and the twins and the beautiful woman in the tub who turns out to be a decaying crone, this time for laughs.\n\nSo it goes. In the later stages of the story, we’re stuck with routine complications and challenges posed by the Mendelsohn character and his ferocious aide played by the infinitely more charismatic Hannah John-Kamen. Spielberg’s control of pacing, rhythm, action dynamics and tonal juggling is so astute that the story of Wade never quite gets lost in all the fly-by jokes and references. Sheridan’s highly skillful, as is Cooke.\n\nBut there’s a big difference between a movie content to surf a tsunami of nostalgia, and science fiction sturdy enough to invent tomorrow’s nostalgia, today. Lest we forget, “E.T.,” “Close Encounters of the Third Kind,” “A.I.” and “Minority Report,” to name four of the director’s achievements, sampled all sorts of established literary and screen classics. “Ready Player One” is a different and more disposable diversion. It’s like a visualization, however immersive and impressive, of movie trivia night down at the local bar.\n\nBut as I say: By a whisker, Spielberg wins the race against his own material.\n\nMichael Phillips is a Tribune critic.\n\nmjphillips@chicagotribune.com\n\nTwitter @phillipstribune\n\n[ RELATED: At South by Southwest, a sneak preview of 'Ready Player One' wows the fans ]\n\n[ Before 'Ready Player One,' the Washington Post: Michael Phillips on Steven Spielberg's newspaper drama ]\n\n[ 'Isle of Dogs': Wes Anderson's desolate canine tale of loyalty ]", "images": ["https://www.chicagotribune.com/resizer/zoF5M3bZvpqao42kMx6DEvGD7Zs=/1200x630/filters:format(jpg):quality(70)/www.trbimg.com/img-5ab9396a/turbine/sc-mov-ready-player-one-rev-02364", "https://www.chicagotribune.com/resizer/92p_pX7_-XsRY7WKx28FZv68Vg0=/1440x1080/filters:format(jpg):quality(70):focal(764x25:774x35)/cloudfront-us-east-1.images.arcpublishing.com/tronc/QRN2U57E7JDVBGZH56WEVUINOQ.jpg", "https://www.chicagotribune.com/resizer/fFM32zJj3LUbI8Avasgg6Ud6src=/1440x1080/filters:format(jpg):quality(70):focal(1726x449:1736x459)/cloudfront-us-east-1.images.arcpublishing.com/tronc/UC56ICML7IUM5D4SMJO75KLKN4.jpg", "https://www.chicagotribune.com/resizer/gsLHPb_o1onaWXBIlOUqWs-ZsQo=/1440x1080/filters:format(jpg):quality(70):focal(701x13:711x23)/cloudfront-us-east-1.images.arcpublishing.com/tronc/7H7KR55BMZFMVCNR6CVNWLMOEI.jpg", "http://www.chicagotribune.com/pf/resources/icons/Menu_Icon.svg?d=87", "https://static.themebuilder.aws.arc.pub/tronc/1657752787005.svg"], "top_img": "https://www.chicagotribune.com/resizer/zoF5M3bZvpqao42kMx6DEvGD7Zs=/1200x630/filters:format(jpg):quality(70)/www.trbimg.com/img-5ab9396a/turbine/sc-mov-ready-player-one-rev-02364", "keywords": [], "authors": [], "canonical_link": "https://www.chicagotribune.com/entertainment/movies/sc-mov-ready-player-one-rev-02364-story.html", "title": "'Ready Player One' review: In Spielberg's dystopia, pop culture saves the day", "meta_data": {"language": "English (United States), en-US", "viewport": "width=device-width, initial-scale=1", "content-id": "4OTFJYKKOBBRRHD7QYDPVYZIGY", "apple-itunes-app": "app-id=383137151, app-argument=http://www.chicagotribune.com/deeplinkid4OTFJYKKOBBRRHD7QYDPVYZIGY", "description": "Even with banal material, a master's visual assurance transcends the cliches in this science-fiction adventure starring Tye Sheridan, Olivia Cooke and Mark Rylance", "twitter": {"description": "Even with banal material, a master's visual assurance transcends the cliches in this science-fiction adventure starring Tye Sheridan, Olivia Cooke and Mark Rylance", "title": "'Ready Player One' review: In Spielberg's dystopia, pop culture saves the day", "image": "https://www.chicagotribune.com/resizer/zoF5M3bZvpqao42kMx6DEvGD7Zs=/1200x630/filters:format(jpg):quality(70)/www.trbimg.com/img-5ab9396a/turbine/sc-mov-ready-player-one-rev-02364", "site": "@chicagotribune", "card": "summary_large_image"}, "og": {"description": "Even with banal material, a master's visual assurance transcends the cliches in this science-fiction adventure starring Tye Sheridan, Olivia Cooke and Mark Rylance", "title": "'Ready Player One' review: In Spielberg's dystopia, pop culture saves the day", "image": "https://www.chicagotribune.com/resizer/zoF5M3bZvpqao42kMx6DEvGD7Zs=/1200x630/filters:format(jpg):quality(70)/www.trbimg.com/img-5ab9396a/turbine/sc-mov-ready-player-one-rev-02364", "type": "article", "site_name": "Chicago Tribune", "url": "https://www.chicagotribune.com/entertainment/movies/sc-mov-ready-player-one-rev-02364-story.html", "locale": "en_US"}, "keywords": "steven-spielberg,mark-rylance", "robots": "noarchive", "distribution": "global", "rating": "general", "googlebot-news": "index", "copyright": "Copyright © 2022, Chicago Tribune", "fb": {"page_id": "5953023255,104061989632161,330360537007411,264870045299,73734231949,53310156364,40762490776,60569705796,121922684499844,182379588445160,62915602634,1987930441432108,119608021389933,745745225518281", "pages": "https://www.facebook.com/chicagotribune", "app_id": 306836229411287, "admins": 100000786395051}, "fb_title": "'Ready Player One' review: In Spielberg's dystopia, pop culture saves the day", "y_key": "cee2fe4077f8d050", "msvalidate.01": "AAC9C18F70AC386BC4DCF4DDF9BF1786", "article": {"publisher": "Chicago Tribune", "tag": "Steven Spielberg,Mark Rylance", "content_tier": "locked"}, "google": "nositelinkssearchbox"}, "movies": [], "publish_date": null, "source": "http://www.chicagotribune.com", "summary": ""}