{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/05/14/fox-picked-up-last-man-standing-after-being-emboldened-by-response-to-roseanne/", "text": "Gift Article Share\n\nThe “Roseanne” Effect has started. Fox confirmed on Monday that the network picked up a new season of “Last Man Standing” — the previously canceled ABC comedy starring Tim Allen — after being “emboldened” by the response to the reboot of “Roseanne” this spring. Wp Get the full experience. Choose your plan ArrowRight Both shows feature 1990s sitcom stars playing lead characters with conservative views who clash with their liberal family members.\n\nWhile executives clarified that they were interested in “Last Man Standing” (produced by its own studio, Twentieth Century Fox Television) long before “Roseanne” debuted in March with a jaw-dropping 18 million viewers, seeing those numbers helped.\n\n“Obviously, I think everyone took a good hard look at the performance of ‘Roseanne.’ It did so well, and it certainly did remind us that we have a huge iconic comedy star in our Fox family in Tim Allen,” said Dana Walden, chairman and chief executive officer for Fox Television Group, on a conference call to announce the network’s new fall 2018 schedule. “[‘Last Man Standing’] is a really funny show.”\n\nShe added that Fox considered picking up the comedy when ABC canceled it last year but couldn’t find the right place on its schedule. Plus, she said, “ABC didn’t really prioritize” the series, and it still earned about 8 million viewers every week, so Fox execs are curious to see what happens when they put marketing muscle behind it.\n\nAdvertisement\n\nThere was an outcry from fans after “Last Man Standing” was canceled in 2017, and many blamed the fact that Allen is a conservative-leaning actor who attended President Trump’s inauguration. Allen, who compared being a non-liberal in Hollywood these days to “1930s Germany,” also hinted that his character’s beliefs (Allen plays Mike Baxter, who hates Obama and political correctness) caused ABC to ax the show.\n\n“I’m not sure that I think that the cancellation had anything to do with politics,” said Gary Newman, chairman and chief executive officer for Fox Television Group; he theorized that ABC was more interested in shows produced by its own studio. “Tim’s personal politics aren’t a big feature on the show. I think if you were to talk to Tim and our showrunners, they would say Mike Baxter is a centrist. … He doesn’t have extreme views, and the show never delved deeply into political views.”\n\nAnother topic on the call: The cancellation of “Brooklyn Nine-Nine,” which sparked intense reaction from fans on social media. (NBC picked up the show about 24 hours after Fox canceled it.)\n\nAdvertisement\n\nWalden said they loved the series and cast, yet “ultimately, we felt like we didn’t have the exact right place to schedule it this year.” (Fox’s schedule has shifted this fall with the addition of Thursday Night Football.) Walden said “Brooklyn Nine-Nine” performed best on Sunday nights after “The Simpsons,” but the network planned to hand that slot to the popular cartoon “Bob’s Burgers.”\n\n“We wanted to give ‘Bob’s Burgers,’ the Emmy-winning huge performer for us, the opportunity to have a plum time period,” she said. “So once we made that decision, it just really limited the opportunities to schedule ‘Brooklyn.’ ”\n\nFox’s new fall series are “The Cool Kids,” a retirement community sitcom executive produced by “It’s Always Sunny in Philadelphia” star Charlie Day, and “Rel,” based on the life of Lil Rel Howery, who starred in “Get Out” and “The Carmichael Show.”\n\nAdvertisement\n\nFALL 2018 PRIME-TIME LINEUP ON FOX\n\nNew shows are in bold.\n\nMONDAY\n\n8 p.m. “The Resident” *\n\n9 p.m. “9-1-1” *\n\nTUESDAY\n\n8 p.m. “The Gifted” *\n\n9 p.m. “Lethal Weapon” *\n\nWEDNESDAY\n\n8 p.m. “Empire”\n\n9 p.m. “Star”\n\nTHURSDAY\n\n8 p.m. NFL Football\n\nFRIDAY\n\n8 p.m. “Last Man Standing”\n\n8:30 p.m. “The Cool Kids”\n\n9 p.m. “Hell’s Kitchen” *\n\nSUNDAY\n\n7 p.m. “NFL on Fox”\n\n7:30 p.m. “The OT”\n\n8 p.m. “The Simpsons”\n\n8:30 p.m. “Bob’s Burgers” *\n\n9 p.m. “Family Guy”\n\n9:30 p.m. “Rel”\n\n* Moved to a new time slot\n\nRead more:\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2014/11/137538_5702_pre.jpg&w=1440"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2014/11/137538_5702_pre.jpg&w=1440", "keywords": [], "authors": ["Emily Yahr"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/05/14/fox-picked-up-last-man-standing-after-being-emboldened-by-response-to-roseanne/", "title": "Fox picked up ‘Last Man Standing’ after being ’emboldened’ by response to ‘Roseanne’", "meta_data": {"description": "Tim Allen's conservative-leaning politics were widely blamed as the reason “Last Man Standing” was axed from ABC last year.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/05/14/fox-picked-up-last-man-standing-after-being-emboldened-by-response-to-roseanne/", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2014/11/137538_5702_pre.jpg&w=1440", "title": "Fox picked up ‘Last Man Standing’ after being ’emboldened’ by response to ‘Roseanne’", "description": "Tim Allen's conservative-leaning politics were widely blamed as the reason “Last Man Standing” was axed from ABC last year."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Fox picked up ‘Last Man Standing’ after being ’emboldened’ by response to ‘Roseanne’", "description": "Tim Allen's conservative-leaning politics were widely blamed as the reason “Last Man Standing” was axed from ABC last year."}, "last_updated_date": "2021-12-03T04:04:14.563Z", "article": {"published_time": "2018-05-14T14:40:17.000Z", "modified_time": "2021-12-03T04:04:14.563Z", "section": "Arts & Entertainment", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 70, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/05/14/fox-picked-up-last-man-standing-after-being-emboldened-by-response-to-roseanne/"}, "movies": [], "publish_date": 1526252400.0, "source": "https://www.washingtonpost.com", "summary": ""}