{"url": "https://secondnexus.com/entertainment/scandal-htgawm-crossover/", "text": "Tonight's highly-anticipated Scandal and How to Get Away with Murder crossover comes after an action-packed episode last Thursday. Olivia Pope has come out the worse for wear after both being shot and resigning from her role as White House Chief of Staff, but also redeemed having sacrificed herself for the president's well-being. Quinn's vendetta against Liv may have finally resolved itself, along with Olivia's relationship with her father, Rowan.\n\nBy the end of the episode, Olivia got all stitched up and drank some wine. Now the question on everyone's mind is: where will she go from here? As Rowan said last episode, \"The giant has fallen, but that doesn't mean the giant is dead.\" In fact, the giant is heading for the Supreme Court.\n\nOlivia & Annalise's Worlds Collide\n\nThe \"How to Get Away with Scandal\" crossover's sneak peek opened with Pope posing a question about crisis management to a college classroom. Annalise Keating of HTGAWM answered correctly, and fans had heart palpitations seeing the two meet for the first time. We learned that Annalise is seeking Olivia's help appealing her class action lawsuit in the highest court in the land.\n\nIn an interview conducted by Entertainment Weekly, Murder creator and producer Pete Nowalk gave a few interesting tidbits of information about the crossover. First, the Scandal hour of the show will feature Annalise's road trip to D.C. to meet Olivia. The Murder hour will follow the two women into the Supreme Court to argue Annalise's judicial reform suit.\n\nScandal has explored Olivia's dark side this season, while Murder's Annalise is on the road to redemption. Nowalk claims that the two are meeting at an opportune time for both of them. \"What’s cool is that they can both help each other get out of this place and dig themselves out of the ditch they’re both in,\" says Nowalk.\n\nThe trouble, it seems, will be their strong personalities. \"That’s the fun of the episode,\" according to Nowalk. \"These are two really unique, strong-minded people [...] but they are both working for something bigger than themselves.\"\n\nWorking Together for Justice\n\nAuthor Natalie Abrams also pointed to a previous issue of EW in which Shonda Rhimes had hinted at the subject of the crossover. Nowalk confirms that the hint was from former Scandal president Fitz Grant's speech about criminal justice reform. It would seem that Olivia and Annalise have always been working toward similar goals.\n\nMost importantly for fans, Nowalk says that we'll be left with \"the feeling of a resolution.\"\n\nThe two hour crossover episode will cover both shows' time blocks, starting with Scandal at 6 p.m. EST and lasting through tonight's How to Get Away with Murder episode from 7-8 p.m. EST.", "images": ["https://assets.rbl.ms/21104600/2000x.png", "https://assets.rbl.ms/21180304/2000x.png", "https://b.scorecardresearch.com/p?cv=2.0&cj=1&c1=2&c2=20567959&c6=Lifestyle&c8=Tonight%2C+How+to+Get+Away+with+Scandal+-+3%2F1%2F2018", "https://assets.rbl.ms/23380198/origin.png", "https://assets.rbl.ms/18212635/2000x.png", "https://assets.rbl.ms/16950974/2000x.png", "https://assets.rebelmouse.io/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNDk2MTM3Ny9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTcwMDA5MTM5N30.9-uQTatAGJUqS20zfmCrrlkYf7sqc3WIFmq_YsCI-eU/img.png?width=210"], "top_img": "https://assets.rebelmouse.io/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNDk2MTM3Ny9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTcwMDA5MTM5N30.9-uQTatAGJUqS20zfmCrrlkYf7sqc3WIFmq_YsCI-eU/img.png?width=210", "keywords": [], "authors": ["Second Nexus Staff"], "canonical_link": "https://secondnexus.com/scandal-htgawm-crossover", "title": "Tonight, How to Get Away with Scandal - 3/1/2018", "meta_data": {"twitter": {"card": "summary", "site": "@"}, "fb": {"app_id": 194454967689857, "pages": 651833651535152}, "og": {"type": "article", "url": "https://secondnexus.com/scandal-htgawm-crossover", "site_name": "Second Nexus", "image": {"identifier": "https://assets.rebelmouse.io/eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNDk2MTM3Ny9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTcwMDA5MTM5N30.9-uQTatAGJUqS20zfmCrrlkYf7sqc3WIFmq_YsCI-eU/img.png?width=210", "width": 210, "height": 2000}, "title": "Tonight, How to Get Away with Scandal - 3/1/2018", "description": "Tonight's highly-anticipated Scandal and How to Get Away with Murder crossover comes after an action-packed episode last Thursday. Olivia Pope has come out the worse for wear after both being shot and resigning from her role as White House Chief of Staff, but also redeemed having sacrificed herself ..."}, "description": "Tonight, How to Get Away with Scandal - 3/1/2018", "referrer": "always", "theme-color": "#647187", "viewport": "width=device-width,initial-scale=1,minimum-scale=1.0,maximum-scale=1.0,user-scalable=no", "article": {"published_time": "2018-03-02T01:03:55+00:00", "modified_time": "2021-10-07T01:19:40+00:00", "author": "https://www.facebook.com/651833651535152"}, "keywords": "ABC, annalise keating, crossover, how to get away with murder, htgawm, kerry washington, olivia pope, scandal, SCOTUS, Shonda Rhimes, Supreme Court, viola davis, White House", "google-site-verification": "D8Vdu7GeWF-BFCa-e72dm1r5DTluFVcJ8NG1IoEeLuo", "pocket-site-verification": "31427e50dd626e483f18db7055a583", "cf-2fa-verify": "2d86094bad054d5"}, "movies": [], "publish_date": 1519952635.0, "source": "https://secondnexus.com", "summary": ""}