{"url": "https://web.archive.org/web/20171001015728/http://www.instyle.com:80/lifestyle/catherine-zeta-jones-casa-zeta-jones-home-decor", "text": "First there was Gwyneth Paltrow’s Goop, then Reese Witherspoon came along with Draper James, and now, Catherine Zeta-Jones is the latest Oscar winner putting the scripts aside to become a full-fledged lifestyle brand.\n\nThis week, Zeta-Jones is launching Casa Zeta-Jones, her first home collection for QVC, bringing her elegant taste and love for interior design to everything from antique lace down comforters to laser-cut napkins. Inspired by her Welsh heritage, with a dash of Old Hollywood influence, the collection plays with luxurious texture (faux fur throws, velvet pillow shams) and a rich color palette (Swedish grey, seaglass blue), to add sophistication to any room.\n\nAhead of the collection’s launch (Thursday, Sept. 28, at 10 a.m. ET on QVC), we got an early preview of the collection last week in N.Y.C. with Zeta-Jones herself.\n\nInStyle: Congrats on Casa Zeta-Jones! Have you always been interested in interior design?\n\nCatherine Zeta-Jones: It’s been a passion of mine for years. I was brought up in the theater, so I was always traveling, picking up Indian saris and beautiful textiles to go in my home. Then 17 years ago, when I was pregnant with my son [Dylan] I started designing furniture. I’ve redone all of our homes, my brother's home, my aunt’s home. I’m a homemaker first and I love creating rooms and environments.\n\nWhy is now the right time to come out with a line?\n\nI’ve been asked for years to stick my name on something and I always said no. I just hadn't met the right partners. The truth is I don't need to do this, but I love to do this. People would always come over to my house and say “You decorated this yourself?” Then a good interior designer friend of mine, Marsha Russell, planted the seed in my head to design a collection.\n\nYour business partner is Daymond John from Shark Tank fame. How did you two meet?\n\nI actually stalked him until he met me! Whenever I would watch him on Shark Tank, I felt like I would like him. I didn’t want to work with someone who would cramp my style. So I called him up and said, ‘I want to do business with you.’ Within four hours, I probably sent him about 25 emails. And that was 19 months ago.\n\nWhat were some of your biggest inspirations for the line?\n\nIt’s inspired by so many things. I've got 17 years of archives that I wanted to channel into one cohesive collection. So I started thinking about pieces that I would want to be around wherever I was living—a country estate, a Manhattan loft, or in Bermuda, where Michael [Douglas] and I raised our kids for 10 years. I wanted the pieces to be versatile enough to fit into any of those locations.\n\nWhat was your favorite part of the process?\n\nSeeing the first sample. And then seeing it in its packaging. I got such a kick out of designing my packaging. When I get something delivered to me, I don't want it in a plastic bag with staples at the side. When I open a brown box, I want there to be something pretty inside. I spent hours choosing the palettes and the fonts.\n\nWhat was the most challenging part?\n\nI have a real editing issue, so editing the collection down was really tough. If I like something, I like it all. This is also why I can’t travel lightly. I always have to have the dress, and the bag, and the shoes with me. It drives my husband crazy.\n\nRedecorating a room can be really intimidating for a lot of people. What advice would you give someone who is unsure of where to start?\n\nDon’t be scared of change. A lot of people think ‘Wow, this is a lot. I'm just going to do everything in beige and cream.’ But what about a pop of orange? I love neutrals, but I love color even more. The goal should always be to create a world that’s elegant and beautiful, but also accessible and comfortable. You have to be able to sit on things.\n\nWhat is one item that can instantly update a room?\n\nA new comforter can completely change the look of a bedroom. I designed a reversible one, so when you turn down the bed you get a subtle contrast. For a living room, I love a beautiful throw. I’ve got a faux fur one that’s dreamy.\n\nYou’ve given us peeks of your beautiful home in upstate New York on Instagram. How would you describe the décor in your house?\n\nI have an older home with contemporary furniture in some rooms and very traditional furniture in other rooms. I like to be able to switch it up. I've got a huge family room with silk draping on the ceilings and two big red Chinese day beds. Then the next room is darker with creams and grays all over. It’s like going from the night club to the spa.\n\nhttps://www.instagram.com/p/BZRUCpug5QX/?hl=en&taken-by=catherinezetajones Shooting some pool. A post shared by Catherine Zeta-Jones (@catherinezetajones) on Sep 20, 2017 at 10:03am PDT\n\nHow does your personal style differ from your décor style?\n\nWith fashion, it’s all about wearing what in for the season. My personal style has always been more classic, and with interiors, I don’t care about trends as much. I want pieces that you can use season after season.\n\nYou were at New York Fashion Week this year with your daughter, Carys. Did she have a good time?\n\nShe’s been asking me to take her to a show forever, but I didn’t want to do it until she was old enough. She sat front row with me at Michael Kors and she was so excited to meet him and see all the models. She was just beside herself.\n\nRELATED: Catherine Zeta-Jones's Daughter Looks So Grown Up At Michael Kors\n\nDoes she love fashion and design as much as you do?\n\nShe loves fashion and she loves my collection. She has the pink jacquard comforter in her room! But really she’s a singer, dancer, and actress. And she just happens to be drop, dead gorgeous with legs that go up to her neck.\n\nWould you ever design a clothing line?\n\nSure. You never know! I’m just loving what I’m doing right now.\n\nThis year also marks the 15th anniversary of your Oscar-winning performance in Chicago. What’s your favorite memory of the experience?\n\nThe whole thing. Musicals in this day and age don't have the same power, so to see something that I worked so hard on come together so beautifully was amazing. And I have it on film for the rest of my life. I’ve done so many other theater pieces that nobody ever saw. But all of the hurting, pain, and hard work was worth it for Chicago. It doesn't usually all come together so sweetly.\n\nWhere do you keep your Oscar today? Is it the ultimate décor piece?\n\nYes! It's in the family library, but I’ve kind of turned it into my office now. I'm the one who likes to lounge in there the most.\n\nKeep scrolling to see some of the pieces from the Casa Zeta-Jones Collection below.", "images": ["https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/320x384/public/images/2017/09/092817-colin-kapernick-donald-trump-lead.jpg?itok=0s7Wzn_o", "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/320x384/public/images/2017/09/bkr_x_swarovski_gif-7_dragged.jpg?itok=dnhuJQ5o", "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/320x384/public/images/2017/09/092517-petco.jpg?itok=vCimnnN6", "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/684xflex/public/images/2017/09/092217-catherine-zeta-jones-lead.jpg?itok=RWnkHPac", "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/320x384/public/images/2017/09/092817-chic-halloween-embed-005.jpg?itok=zG3f__KG", "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/320x384/public/images/2017/09/download-6.jpg?itok=EGHuHtUh", "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/320x384/public/1505841217/091917-wedding-women-lead.jpg?itok=531h2lmo", "https://web.archive.org/web/20171001015728im_/https://www.facebook.com/tr?id=1381046852207528&ev=PixelInitialized", "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/622x350/public/images/2017/09/092217-catherine-zeta-jones-lead.jpg?itok=Qxt1KjIB", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAADsQAAA7EAZUrDhsAAAANSURBVBhXYzh8+PB/AAffA0nNPuCLAAAAAElFTkSuQmCC", "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/684xflex/public/1506091647/092217-catherine-zeta-jones-2.jpg?itok=8wSvukMq", "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/320x384/public/images/2017/09/092717-saudi-woman-driving-lead.jpg?itok=Dk_y63Fe", "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/all/themes/instyle/images/instyle-logo.svg", "https://web.archive.org/web/20171001015728im_/http://googleads.g.doubleclick.net/pagead/viewthroughconversion/1036056483/?value=0&guid=ON&script=0", "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/150x180/public/images/2017/09/092517-flight-attendant-lead.jpg?itok=VBPSqEiA", "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/150x180/public/images/2017/09/092817-drafting-dating.jpg?itok=7lx9O9au", "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/320x384/public/images/2017/09/092217-nasiba-abilova-lead.jpg?itok=HaZdBek9", "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/150x180/public/1474460851/092016-jessi-klein-loft-lead.jpg?itok=GsgnTK4S"], "top_img": "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/622x350/public/images/2017/09/092217-catherine-zeta-jones-lead.jpg?itok=Qxt1KjIB", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20171001015728/http://www.instyle.com/lifestyle/catherine-zeta-jones-casa-zeta-jones-home-decor", "title": "Catherine Zeta-Jones is the Next Major Celeb Lifestyle Guru", "meta_data": {"twitter": {"image": {"src": "http://cdn-img.instyle.com/sites/default/files/styles/622x350/public/images/2017/09/092217-catherine-zeta-jones-lead.jpg?itok=Qxt1KjIB"}, "site": "@InStyle", "title": "Catherine Zeta-Jones Created the Coziest Home Décor Line, and Her Mini-Me Daughter Approves @InStyle", "card": "summary_large_image", "description": "She also reveals where she keeps her Oscar (hint: not the living room)."}, "og": {"site_name": "InStyle.com", "image": "https://web.archive.org/web/20171001015728im_/http://cdn-img.instyle.com/sites/default/files/styles/622x350/public/images/2017/09/092217-catherine-zeta-jones-lead.jpg?itok=Qxt1KjIB", "title": "Catherine Zeta-Jones Created the Coziest Home Décor Line, and Her Mini-Me Daughter Approves", "type": "article", "url": "https://web.archive.org/web/20171001015728/http://www.instyle.com/lifestyle/catherine-zeta-jones-casa-zeta-jones-home-decor", "description": "She also reveals where she keeps her Oscar (hint: not the living room)."}, "fb": {"pages": 18938064984}, "outbrain_image": "http://cdn-img.instyle.com/sites/default/files/styles/320x384/public/1506091647/092217-catherine-zeta-jones-2.jpg?itok=5Qj7Nnz4", "ins": {"channel": "Lifestyle"}, "description": "Catherine Zeta-Jones on the inspiration behind her new home line, Casa Zeta-Jones.", "news_keywords": "catherine zeta jones home decor, casa zeta jones, where to buy catherine zeta jones line, where to buy casa zeta jones, catherine zeta jones shark tank", "generator": "Drupal 7 (http://drupal.org)", "viewport": "width=1020"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}