{"url": "www.inquisitr.com/4780146/miranda-lambert-blake-shelton-hate-each-other/", "text": "It's been more than two years since Miranda Lambert and Blake Shelton got divorced, but the two reportedly still hate each other. The exes appeared to have moved on with their current partners Anderson East and Gwen Stefani, but they still get on each other's nerves. An insider told OK! that the \"Vice\" hitmaker can't stand seeing her ex-husband and his girlfriend flaunt their romance. She despises seeing him look so happy with his sexy lover.\n\nThere is reportedly a lot of frustration between Miranda and Blake, and they are now letting it show. A source claimed that the 34-year-old singer has accused the 41-year-old country superstar of using his The Voice co-star to make her jealous. He allegedly retaliated by telling her that Gwen has everything that she does not. Hollywood Life reportedly reached out to Lambert and Shelton's reps regarding this controversy, but no word from them yet.\n\nThe former power couple of country music has avoided talking about their divorce and instead, use their music to express their feelings. Miranda Lambert and Blake Shelton both claim that they are happy with their current partners Anderson East and Gwen Stefani. However, they still continue to throw shade at each other, which means that they haven't totally moved on.\n\nDuring her concert in South Carolina, Miranda performed her hit song \"Little Red Wagon\" but changed the lyric \"I live in Oklahoma\" to \"I got the hell out of Oklahoma.\" That's where she used to live with her ex-husband. The next day, Blake reportedly retaliated by doing a cover of \"All My Exes Live in Texas\" by George Strait at the Crash My Playa festival, and this could be a diss to his ex-wife who hails from Texas.\n\nMiranda Lambert may not have intentionally slammed Blake Shelton when she changed a line from her song because she expressed how much she wanted to get over her divorce. According to CMT, the Pistol Annies member is ready to face what's coming next. She said in a recent radio interview that The Weight of These Wings was her therapy. The blonde singer claimed that she got through that and is now happy and ready to move on.", "images": ["https://imgb.srgcdn.com/c2fbdf24-a0a4-40f9-ad23-b0cb57bf8766.jpg", "https://imgb.srgcdn.com/d258d2ec-e52b-4489-9950-908cc366bacf.jpg", "https://secure.gravatar.com/avatar/2d6a237ef92afd4dd5eb18a059b10107?s=800", "https://imgb.srgcdn.com/fe42e24b-1fa1-4cf2-b7ef-0bcd25a6f5c9.png", "https://imgb.srgcdn.com/1740626a-9ecf-4723-b66a-d7ca5e1d678c.jpg", "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "https://imgb.srgcdn.com/a5ba8e20-c5b5-4c82-ae2b-4f343261a07b.jpg", "https://imgb.srgcdn.com/6977b3f9-ffc5-44c5-866c-e80c13668077.jpg"], "top_img": "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.inquisitr.com/4780146/miranda-lambert-blake-shelton-hate-each-other/", "title": "Miranda Lambert And Blake Shelton Reportedly Still Hate Each Other, According To 'OK!'", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimal-ui, user-scalable=no", "msapplication-TileImage": "/static/inquisitr/favicon-128x128.png", "robots": "max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Miranda Lambert And Blake Shelton Reportedly Still Hate Each Other, According To 'OK!'", "url": "https://www.inquisitr.com/4780146/miranda-lambert-blake-shelton-hate-each-other/", "site_name": "The Inquisitr", "description": "Miranda Lambert And Blake Shelton Reportedly Still Hate Each Other, According To 'OK!'", "updated_time": "2021-08-16 18:13:43Z"}, "article": {"modified_time": "2021-08-16 18:13:43Z", "published_time": "2018-02-10 04:34:11Z", "section": "Rumors"}, "description": "Miranda Lambert And Blake Shelton Reportedly Still Hate Each Other, According To 'OK!'", "keywords": "Music, Rumors", "twitter": {"card": "summary_large_image"}}, "movies": [], "publish_date": 1518237251.0, "source": "http://www.inquisitr.com", "summary": ""}