{"url": "https://www.etonline.com/eva-longoria-dishes-on-adjusting-to-being-a-new-mom-and-working-exclusive-107366", "text": "Eva Longoria has been a new mom for almost two months, and she says she's having a tough time going back to work after her maternity leave.\n\nThe actress sat down with ET's Brooke Anderson on Saturday to discuss her new romantic comedy, Dog Days, and then on again on Sunday for the premiere at the Westfield mall in Century City, California, and she dished on what it was like to be a working mom for the first time.\n\n\"You know what, it's been [seven] weeks, he's seven weeks old, and I've been with him day and night, not working for seven weeks and it's been the best seven weeks of my life,\" she gushed at the junket. \"I just miss him so much.\"\n\nSaturday was the first time she'd gotten ready for the press since she and her husband, Jose \"Pepe\" Baston, welcomed their adorable baby boy, Santiago, on June 19, and she felt that her baby boy noticed a change.\n\n\"[Today was] the first time I've had hair and makeup in seven weeks and I was breastfeeding him this morning and I think he was like, 'Who are you? Where's my mom?'\" Longoria joked.\n\nThe proud mom couldn't help but gush over her precious progeny, marveling, \"He's a dream, and he's such a good baby. I knock on wood. He's just been so easy, so sweet, we've been really lucky, he's super healthy. It's just been great.\"\n\nHowever, she also acknowledged that the transition back to her life and career in show business is going to be difficult in a lot of new ways.\n\nEva Longoria Shares Sweet Snaps of Son Santiago - See the Pics! This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Eva Longoria Shares Sweet Snaps of Son Santiago - See the Pics!\n\n\"So now comes the part where, as I start returning back to work slowly, [I'm asking], 'How do you balance it all?'\" She said. \"Everybody used to [ask] me, 'How do you do it all? You do so many things? And I was just like, 'Because I don't have kids.' I mean every project was my baby and now I actually have a baby.\"\n\nHowever, the nuances of motherhood aren't something she's found herself struggling with. For Longoria, becoming a mother was something she'd been preparing herself for over the years.\n\n\"When people go, 'Your mother instincts kick in,' that's true. I mean you become a natural,\" Longoria said. \"But I've been a mom to so many in my life already. My nieces, my nephews, girls through my foundation. I'm very well educated in this arena. I mean. I made sure I was, I took every class you could take, I read all the books I watched all the videos, and I still continued to learn.\"\n\nAs ready as she could be, however, there were still a few things she had difficulty with -- including Santiago's nursery.\n\nSpeaking with ET at the premiere on Sunday, Longoria admitted that she and her husband got her son's room ready at the \"last minute.\"\n\nEva Longoria Says She's Having the Opposite of Cravings During First Pregnancy (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Eva Longoria Says She's Having the Opposite of Cravings During First Pregnancy (Exclusive)\n\n\"We had moved, and so the nursery was like the last thing to put together,\" she said. \"I think we finally got it together like three days before he was born, so it was a super tight deadline.\"\n\nAt the premiere, Longoria also reflected on her second day of work in a row, and how much more challenging it's been than she knew.\n\n\"It's been so hard to leave him,\" Longoria shared. \"I kind of had to ease back into work. I've been with him 24 hours a day since he was born, so to leave him for [even] four hours is crazy.\"\n\nIn her upcoming comedy, Dog Days, Longoria plays a woman who is gearing up to become a mom via adoption. It was an experience that Longoria said she related to in a very specific way because she'd just discovered she was expecting in real life when production began.\n\n\"When I was filming this movie I was pregnant. I just found out I was pregnant. And I was so tired,' Longoria recalled. \"So playing a mom [while] I was actually making a baby was interesting and fun.\"\n\n\"Now as I watch the movie that I was pregnant in it, it was just so special,\" she added. \"Nobody knew. And, like, my jeans wouldn’t button and I was like, 'I hope the camera doesn’t see this.'\"\n\nNow that she's welcomed her beloved baby boy, Longoria cannot help but marvel over all his little habits and heartwarming quirks as he grows and develops in his early months.\n\nEva Longoria Gets Her Star on the Hollywood Walk of Fame This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Eva Longoria Gets Her Star on the Hollywood Walk of Fame\n\n\"Everything he does is cute,\" she said. \"His noises he makes, his smile. He's finding his voice, so he makes all these funny [baby noises], you're just like, 'What was that?' He talks a lot. I mean, he just wants to talk and talk.\"\n\nThe one thing she can't wrap her head around is just how quickly he's growing up (even though he's not even two months old just yet).\n\n\"What's amazing is seeing him grow so much from just your breast milk. And I'm like, 'This is crazy! All you're eating is what's coming out of my body and you're just like doubled in size,'\" she shared. \"And it's going way too fast already. I'm like, 'Stop growing!' He's gonna be like 18 and have a job soon.\"\n\nWhile it's clear that Longoria has embraced motherhood with open arms and is adept at navigating the difficulties of having a baby and working in show business, she hasn't put any thought yet in whether or not she and her husband are interested in expanding their family even more.\n\nWhen asked if she would want to have another baby in the future, Longoria brushes off the idea. \"Oh gosh, you know what? Let me recover from this one and I'll let you know,\" she said, adding that it's \"too soon to tell.\"\n\nLongoria's latest comedy, Dog Days, hits theaters Aug. 8.\n\nEva Longoria Gives Birth to Her First Child This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page.\n\nRELATED CONTENT:\n\nEva Longoria's Newborn Son Lands First Magazine Cover With His Glowing Mom\n\nEva Longoria Enjoys 'Morning Cuddles' With Her Newborn Son\n\nEva Longoria Gives Birth to Baby Boy: Find Out His Name and See the First Pic!\n\nRelated Gallery", "images": ["https://media.amlg.io/image-assets/et/et+et_prod-image-566846.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-567234.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-568885.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-569095.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-568774.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-569836.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-566821.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-567243.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-566831.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-10/Kaye_GettyImages-1429667472_300.jpg?h=6c83441f&itok=79-eWDg7", "https://media.amlg.io/image-assets/et/et+et_prod-image-568938.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-566844.png", "https://www.etonline.com/sites/default/files/styles/video_1280x720/public/images/2018-08/eto_evalongoria_080518vp.png.jpg?itok=0tJpm94y", "https://media.amlg.io/image-assets/et/et+et_prod-image-567075.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-10/Screen%20Shot%202022-10-08%20at%202.01.34%20PM.png?h=597e033f&itok=1KV1Fu0Z", "https://media.amlg.io/image-assets/et/et+et_prod-image-567077.png", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2019-01/kanye-kim-gettyimages-1077003424_0.jpg?h=c673cd1c&itok=JUVcjmpO", "https://media.amlg.io/image-assets/et/et+et_prod-image-566814.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-569060.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-568881.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-569082.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-566845.png", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-08/eto_evalongoria_080518vp.png?h=c673cd1c&itok=7F9yUsI_"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-08/eto_evalongoria_080518vp.png?h=c673cd1c&itok=7F9yUsI_", "keywords": [], "authors": ["Zach Seemayer"], "canonical_link": "https://www.etonline.com/eva-longoria-dishes-on-adjusting-to-being-a-new-mom-and-working-exclusive-107366", "title": "Eva Longoria Dishes On Adjusting to Being a New Mom and Working (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "apple-mobile-web-app-capable": "yes", "robots": "index", "description": "The 'Dog Days' actress opened up to ET about her adorable baby boy and getting back to her career after maternity leave.", "keywords": "News, Eva Longoria, Babies & Kids", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/eva-longoria-dishes-on-adjusting-to-being-a-new-mom-and-working-exclusive-107366", "title": "Eva Longoria Dishes On Adjusting to Being a New Mom", "description": "The 'Dog Days' actress opened up to ET about her adorable baby boy and getting back to her career after maternity leave.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-08/eto_evalongoria_080518vp.png?h=c673cd1c&itok=7F9yUsI_", "width": 1280, "height": 720}}, "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "twitter": {"card": "summary_large_image", "description": "The 'Dog Days' actress opened up to ET about her adorable baby boy and getting back to her career after maternity leave.", "site": {"identifier": "@etnow", "id": 23603092}, "title": "Eva Longoria Dishes On Adjusting to Being a New Mom", "creator": "Zach Seemayer‍", "url": "https://www.etonline.com/eva-longoria-dishes-on-adjusting-to-being-a-new-mom-and-working-exclusive-107366", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-08/eto_evalongoria_080518vp.png?h=c673cd1c&itok=7F9yUsI_"}, "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}