{"url": "https://en.wikipedia.org/wiki/The_Best_Years", "text": "No. in\n\nseason No. in\n\nseries Title Canadian air date U.S. air date Production\n\ncode\n\n1 1 \"Vertigo\" May 22, 2007 ( ) June 29, 2007 101\n\nThanks to a scholarship, Samantha Best arrives at Charles University for her first year in residence. With years of poverty and foster-homes behind her she jumps into campus life excited about her future only to learn that she will be expelled if she does not find money for her meal plan. A night out with her room-mate Kathryn, star basketball player Devon and his room-mate John, ends with a tragic and fatal accident. Sam is pressured to keep the details of the accident a secret and risks her, and her newfound friends, being expelled if she comes clean. Her conscience in turmoil, she decides to confess, omitting any involvement of the others. Unknown to Sam, her scholarship benefactress, Dorothy O’Sullivan, comes to her aid – Charles University will pay a steep price if any charges are pressed against Samantha Best.\n\n2 2 \"Notorious\" May 29, 2007 ( ) July 6, 2007 102\n\nDevon is worried about the possible repercussions of Samantha’s confession. Kathryn, also angry, retaliates with a ‘noise war’. When Sam casually mentions her problems to Darryl, the R.A., he makes her life hell by turning her complaint into a dormitory wide noise ban and earning her the nickname ‘narc’. Things escalate when Sam is dyed purple in a shower prank. She quickly hatches a plan to redeem herself by throwing the party of all parties with the help of floor-mates, the slightly geeky Cynthia and late-comer to the floor Noah. When the party has a pitiful turnout, Devon saves the day with a keg of beer and an entourage of students looking for a good time, only for the party to be raided by Darryl and campus security. Meanwhile, Sam’s business professor singles out his purple student and suggests that high grades from her ‘part of town’ are meaningless – she does not belong in his class. And Dawn (Athena Karkanis) auditions for Macbeth, landing the choice role of Lady Macbeth, much to the drama department’s chagrin.\n\n3 3 \"It Should Happen To You\" June 5, 2007 ( ) July 13, 2007 103\n\nSamantha decides that in order to be a success she should rush the sorority that Dorothy O’Sullivan belonged to and is horrified to discover that Kathryn is rushing the same house – there is only room for one. Samantha is an instant hit with Sloane(Ashley Newbrough), the sorority’s president, and membership seems certain. The stakes are high and the competition between her and Kathryn is so fierce that Sam goes the extra mile and pawns her mother’s engagement ring to be able to afford a dress to impress the sorority girls. Kathryn suggests a truce in return for getting her in with Sloane. What Sam does not realize is that Kathryn is actually trying to get in with Sloane’s boyfriend, Beau. Meanwhile, just as things are heating up between Sam and Devon, she has to refuse a date offer as she has sorority obligations. This lands Devon in the arms of a very available and understanding cheerleader, Shannon. Sam loses her chance at sorority membership, a relationship with Devon, and when she goes back to retrieve her mother’s engagement ring from the pawn shop, it is gone.\n\n4 4 \"From Here to Eternity\" June 12, 2007 ( ) July 20, 2007 804\n\nWhen Sam’s business professor announces a Donald Trump-style Apprentice assignment that will see the losing team kicked out of class, she teams up with Noah and they wrack their brains for the ultimate marketing plan. The plan they choose requires Devon’s participation. Although Sam and he are no longer a couple, Devon agrees to help, much to the annoyance of his new girlfriend, Shannon. Their assignment has Samantha and Noah working together around the clock and Samantha starts to wonder if Noah is the guy for her. Noah also starts to have feelings for Sam, but when he confides in Devon, Devon lashes out in a fit of jealousy. Noah sets both of his friends straight. They are not over each other by a long shot. Meanwhile, Kathryn gets closer to Beau, threatening his relationship with Sloane.\n\n5 5 \"Secrets and Lies\" June 19, 2007 ( ) July 27, 2007 105\n\nAfter Sam pulls a drunken Cynthia off the Colony dance floor, she soon realizes that Cynthia is plagued with family problems. Sam is determined to stick by her friend, but suddenly Cynthia starts showing up everywhere she goes. Samantha pleads with her boss Lee to have a night off, hoping Trent will take her shift. Trent and Dawn are trying to talk the boss into dating, but Lee has his own reasons why he has not. The newly united Sam and Devon make a date for Freak Fest, the big Halloween party at Colony, only to have their date interrupted by Cynthia’s arrival in a matching costume. With Devon’s insistence, Sam makes the situation clear and Cynthia reacts by storming off and hooking up with a very unlikely Brandon. A worried Sam arrives back at the dormitory to find a crowd gathered as Cynthia prepares to end her freak status for good.\n\n6 6 \"Girl, Interrupted\" June 26, 2007 ( ) August 3, 2007 106\n\nAfter visiting Cynthia in the hospital, Samantha tries to discover the cause of Cynthia’s breakdown and suicide attempt. Snooping in Cynthia’s room, Sam uncovers a disturbing clue, which points to a deep, dark and well-kept, Song family secret. Meanwhile, Dorothy is going out of town and offers her mansion to Samantha as a quiet study haven. While staying there Sam is stunned to meet Alicia, Dorothy’s estranged and rebellious daughter. When Dorothy arrives back in town and finds something missing from her home, she accuses Sam of the theft. Angry over the accusation, Sam tells Dorothy of Alicia’s visit and confronts her about their disaffected relationship. Samantha accepts Dorothy’s explanation, bringing the two even closer together. Meanwhile, Noah takes a shine to his film professor, who is rumored to have a propensity for hooking up with one attractive male student each year. Noah hopes that he is this term’s chosen one. Dawn’s diva behavior annoys her fellow thespians and if something does not change fast, the show will not go on.\n\n7 7 \"Shadow of a Doubt\" July 3, 2007 ( ) August 10, 2007 107\n\nSamantha’s birthday is ruined by the unexpected return of her Uncle Patrick, the man who abandoned her to the foster system after her parents died. Patrick redeems himself, but Trent cannot help being protective of Sam and a bit suspicious of Patrick’s sudden arrival in her life. After a bit of digging around, Trent’s suspicions are confirmed and he tells Sam that her newly-reformed uncle is not being honest about his recent past. Sam's instincts were right, and this time she is the one to push Patrick out of her life. Meanwhile, Dawn continues to crush on Trent as she gears up for her big opening night of Macbeth but Trent is wrapped up with concern for Sam and is painfully oblivious to the attention. When Dawn and Trent finally make a connection at Sam's birthday party, they leave, only to have Trent walk out on Dawn. Also, Noah and the buff Brandon compete for the romantic attentions of Professor Grant. Noah eventually makes a pass at Grant who welcomes his attention. Kathryn is disturbed by the presence of Beau’s ex, Sloane in his life and worries about losing him, so she makes him a romantic strip video, for his eyes only.\n\n8 8 \"All That Heaven Allows\" July 10, 2007 ( ) September 7, 2007 108\n\nDevon surprises Sam when he tells her he loves her. Sam does not say it back, and admits she is not sure she can. Sam is completely taken aback when her uncle Patrick shows up and tells her he is in desperate need of a kidney transplant and seeking a compatible donor. It seems he had an agenda after all. Devon does not want Sam to help him, it is too dangerous, but the fact that Patrick’s life might depend on her gnaws at Sam. While at work, Trent convinces Samantha to go to the clinic, and at least have a compatibility test. Trent accompanies her for moral support, which upsets Devon. Meanwhile, Noah turns up the heat with Professor Grant and can hardly believe his luck when she agrees to meet him at the dormitory while everyone is at the Macbeth opening. Kathryn is crazed when she hears Beau has lost her strip tape, and discovers that Sloane had access to his fraternity house. Dawn’s performance in Macbeth is a dramatic triumph and the gang all hit Colony for the after party. The party seems to be going well until Kathryn’s missing strip tape is shown on the walls of Colony, and until Dawn walks in on Trent as he kisses Sam in Colony’s back room. Despite the mishap with Trent, Sam tells Devon what he wants to hear, that she loves him, even if she is not sure. Meanwhile, Uncle Patrick discovers that Sam is not donor material.\n\n9 9 \"Reality Bites\" July 17, 2007 ( ) September 7, 2007 109\n\nSam is confused about her feelings for Trent and she still has not told Devon about their kiss. Uncle Patrick keeps calling with what seem to be questions about his pending kidney transplant, and Sam’s compatibility as a prospective donor, but are actually his attempts to reconcile his discovery about Samantha’s past. Dawn is shocked to find she is cut from the play because of her injuries suffered outside of Colony after the opening night party. Already livid with Sam over the Trent kiss, Dawn seals the end of their friendship. She takes her revenge by bringing Sam’s kiss with Trent out in the open, before Sam has a chance to tell Devon about the kiss herself. Sam apologizes, and Devon reveals that it is not the kiss that hurt the most, it is that she kept it a secret from him. Meanwhile, Trent is trying to push Sam into admitting her feelings for him. At the end of a tension-filled night at work, a gang of thugs break into Colony, and lock Sam and an injured Trent into a storage room while they ransack the premises. Devon is filled with anger and jealousy when Sam does not arrive back on time from work. He leaves her a voicemail message that causes Sam to cut him out of her life, once and for all. Also, Patrick surprises Dorothy with his news about Samantha’s past.\n\n10 10 \"Cruising\" July 24, 2007 ( ) September 8, 2007 110\n\nSam is enraged when Professor Fisher makes a case study out of the Crazed College Girls (CCG) CEO, Mick Templeton, who happens to be a former business class student. Kathryn and Shannon are all over the CCG competition which offers an all-expenses paid trip to Cabo. Sam finds this raunch culture degrading at first, but when her Uncle Patrick lets her down one final time, Sam tires of being the ‘good girl’, and agrees to join Kathryn in the CCG competition. Letting loose, leading men on, and dressing sexy is both empowering and fun, and Sam and Kathryn end up being the belles of the CCG ball. But when the competition takes a more exploitative turn, Sam and Kathryn bow out, losing the trip to Cabo, but maintaining their dignity. Returning home the next morning, Sam bumps into Devon coming out of Dawn’s room. Sam heads off in search of her uncle Patrick and she finds him leaving for good and tearfully confronts him. Moved by her pleas, he cracks and tells her the truth about her family history, putting his deal with Dorothy in jeopardy. Meanwhile, Noah confronts Professor Grant about the secrecy of their relationship and eventually stumbles on the truth, that she is married. Noah tells Professor Grant he cannot be the other man, and they are over. Things are complicated when Noah discovers that Professor Grant has left her husband for him.\n\n11 11 \"Guess Who's Coming to Dinner\" July 31, 2007 ( ) September 8, 2007 111\n\nSam and Trent continue to dance around their relationship status, are they a couple, or are they just friends? Trent scores some major points with Sam when he enlists the help of his lawyer father, Avery Hamilton, in Sam’s search for information about her family background. On the surface, Trent seems like perfect boyfriend material, and from a perfect upper-class family. But appearances are deceiving. Trent’s family is anything but healthy. Trent has a vice of his own and when Sam tries to open Trent’s eyes to his addiction, he refuses to listen, leading to an ugly argument at Colony. Trent walks away and ends up hanging with Alicia O’Sullivan and some other drug addicted friends, determined just to “have fun”. The fun comes to a screeching halt, however, when Alicia overdoses. Luckily, level-headed Sam, is there to call 911. Sam draws a line in the sand, either Trent cleans up or he has no chance with her. Meanwhile, a suspicious Professor Fisher puts two and two together, and realizes the “other man” who has ruined his marriage is his star student, Noah Jensen. Also, it becomes pretty clear to Dawn that Devon is dating her just to get back at Samantha.\n\n12 12 \"Five Easy Pieces\" August 7, 2007 ( ) September 9, 2007 112\n\nIt is Charles U’s winter semi-formal, which should be a magical time for Samantha. The event is honoring Dorothy O’Sullivan’s philanthropic work with the school, but everything starts to go wrong. Colony’s liquor license has been revoked for a month after a drug-dealing incident. Sam is suddenly left without a job, or money to pay for her meal plan installments. Just when there seems like no hope, Dorothy offers her a way out: free room and board, living at her mansion. Needless to say, Sam’s friends at Macdonald Hall do not want her to leave, but the offer is too good to pass up, at least until Alicia O’Sullivan opens Sam’s eyes to Dorothy’s deepest secret. The big night arrives, and Sam walks into the ball with Trent on her arm, and a gracious Dorothy ready to show Sam off. Sam even reconciles with Dawn, and finally has her first real kiss with Trent. Sam’s uncle, Patrick Farrell, arrives at the party, seriously ill. He tells Sam that Dorothy promised him a kidney transplant in exchange for his silence, and then did not keep her word. Meanwhile, Kathryn gives an apologetic Beau Beecham one more shot, and lives to regret it when Beau does not realize that no means no. Also, Dawn is offered a role in a movie. Unfortunately, it turns out to be a movie version of Bel Air High, the TV show she went to Boston to escape. Dawn turns it down, but when her heart is broken again, she changes her mind and accepts the role.\n\n13 13 \"Mommy Dearest\" August 14, 2007 ( ) September 9, 2007 113", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Maple_Leaf_%28from_roundel%29.svg/25px-Maple_Leaf_%28from_roundel%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/c/c4/The_Best_Years_intertitle.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/32px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c4/The_Best_Years_intertitle.png/250px-The_Best_Years_intertitle.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/c/c4/The_Best_Years_intertitle.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Best_Years", "title": "The Best Years", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/c/c4/The_Best_Years_intertitle.png", "width": 640, "height": 432}, "title": "The Best Years - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}