{"url": "https://www.cnn.com/2018/04/29/politics/michelle-wolf-whcd-takeaways/index.html", "text": "CNN —\n\nComedian Michelle Wolf’s savage takedown of everyone from President Donald Trump to White House press secretary Sarah Sanders to the media was – and will be – the talk of Saturday Night’s White House correspondents’ dinner in Washington.\n\nSome – mostly on the left – saw it is a speak-truth-to-power moment à la Stephen Colbert’s speech at the 2006 White House correspondents’ dinner. Others – mostly on the right – viewed it as a vile, hate-filled address that was neither funny nor appropriate.\n\nMost journalists in the room – and I was among them – were largely quiet during Wolf’s speech, particularly the second half when she got very personal about Sanders. (No, this does not mean journalists are humorless or can’t laugh at themselves – so save it.)\n\nI took a bunch of my notes on my phone during Wolf’s speech. I thought I’d share them – and expand on them – here. These are in no order other than how they occurred to me. (You can watch the whole speech yourself here.)\n\nWolf had zero interest in playing to the room\n\nIntroducing the “Daily Show” comic, White House Correspondents’ Association President Margaret Talev praised Wolf as someone who was very much not part of the world of Washington. That was seen as a good thing, given that the criticism of Washington and its denizens since the election of Trump is that they/we are deeply out of touch with normal Americans. (A coastal comedian is not exactly “regular” people, but whatever.) I wonder whether Talev thought Wolf’s I-could-care-less-about-any-of-you approach was such a great idea after the comedian’s speech.\n\nMost comedians who speak at the correspondents’ dinner take a fair number of shots at the attendees in the room. But they also play along with theme of the night, which attempts to be a celebration of the free and independent media as well as a chance to shine a light on some of the best journalists in the country.\n\nWolf didn’t do that. She wanted to napalm the room. And she did. Unapologetically.\n\nWolf went for lots of low-hanging fruit\n\nThere are LOTS of way to go after Sanders. I personally think that she is overly antagonistic to the reporters who cover the White House and misleads on the regular. But to make fun of Sanders’ makeup? (“I think she’s very resourceful, like she burns facts and then she uses that ash to create a perfect smokey eye. Maybe she’s born with it, maybe it’s lies,” said Wolf.) Like, really?\n\nI know lots of liberals will – and already have via Twitter – painted the attacks on Sanders as the press secretary getting what she deserved. I don’t subscribe to that idea. Sanders showed up, sat on the dais and played along. She knew she was likely to get made fun of. But she would have no reasonable expectation that Wolf would go after her looks and refer to her as an “Uncle Tom, but for white women who disappoint other white women.”\n\nI’m stunned that Sanders sat five feet away from Wolf and just took it.\n\nBeing funny is one thing. Bullying people because you can is another. And Wolf’s treatment of Sanders was bullying.\n\nAnd, yes, by the way, Trump is a massive bully. Making fun of a disabled reporter, stereotyping ethnic groups, attacking reporters for how they look – all of that stuff is totally and completely unacceptable. And he knows exactly what he is doing, which makes it worse.\n\nBut two wrongs don’t make it right. Because Trump bullied a disabled reporter doesn’t mean Wolf should be able to bully Sarah Sanders. Bullying is bullying. And it’s wrong. Always.\n\nWolf’s criticism of the media was (generally) on point\n\nThe most powerful line of Wolf’s speech, which will inevitably get overshadowed by what she said about Sanders, was this on the media and Trump:\n\n“He has helped you sell your papers and your books and your TV. You helped create this monster and now you are profiting from him.”\n\nThe first sentence there is 100% right. It is absolutely beyond debate that Trump has been good for the news business. The amount of news he creates coupled with the number of people who consume news about him has made cable news and print media more relevant (and profitable) than ever before.\n\nThe second sentence I take some issue with. Yes, cable ran Trump’s primary speeches because he said and did things that no one else would do – and that people would watch. And, yes, when I was at The Washington Post, I wrote about Trump regularly because he said and did things that no one else did.\n\nBut that, to me, is different than “creating” Trump. Donald Trump’s candidacy was formed and sharpened by an angry and embittered GOP electorate who was sick of their own party, of Washington, of the media, of everything. He was rising whether the media covered him wall to wall or not; he was the angry id of the GOP. The media didn’t create that.\n\nThe abortion stuff was beyond the pale\n\nHere’s Wolf’s joke about Vice President Mike Pence’s opposition to abortion: “He thinks abortion is murder which, first of all, don’t knock it ‘til you try it — and when you do try it, really knock it. You know, you’ve got to get that baby out of there.”\n\nDoes anyone think this joke is funny? You can hate abortion and think it is murder. You can feel as though it’s not the government’s business what you do with your body and how you handle your own life. But, does anyone celebrate abortion – even jokingly?\n\nWolf got exactly what she wanted\n\nDon’t be fooled: Wolf knew exactly what she was doing on Saturday night. She knew that the speech – at least in parts – was likely to go over like a lead balloon in the room. And that it would stir huge amounts of controversy in its wake.\n\nTHAT WAS THE POINT.\n\nAsk yourself this: Did the average person know who Wolf was before Saturday night? (I will admit, I did not. And, yes, I know Wolf had never heard of me either.) Search interest in her soared last night and continued to spike Sunday morning, according to Google Trends. She is the talk of every Sunday talk show. She will be a regular topic on cable TV – and late-night TV – this week.\n\nOn a related note, her Netflix series, “The Break With Michelle Wolf” – comes on May 27. She couldn’t buy better publicity for that show than she got with her speech on Saturday night.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/180805230106-stelter-rs-8-5-2018.jpg?q=x_281,y_42,h_782,w_1389,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180423062614-maggie-haberman-4-23.jpg?q=x_21,y_12,h_1045,w_1857,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/170515131851-the-point-with-chris-cillizza-logo-large-169.png?q=h_60,w_264,x_0,y_0/w_1280", "https://media.cnn.com/api/v1/images/stellar/prod/180805121330-kellyanne-conway-04132018-file.jpg?q=x_3,y_221,h_1684,w_2993,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/181007120600-april-ryan-10072018.jpg?q=x_123,y_33,h_962,w_1710,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180902134833-april-ryan-reliable-sources-sept-2.jpg?q=x_414,y_59,h_639,w_1136,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180831154723-trump-bloomberg-canada-off-the-record-sot-vpx-00002028.jpg?q=x_199,y_89,h_867,w_1541,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180722114736-maggie-haberman-rs-7-22-2018.jpg?c=16x9&q=w_250,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/180609131456-trump-speech-at-g7-framegrab3.jpg?q=x_283,y_34,h_739,w_1314,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180219165402-20180219-trump-twitter-composite-generic.jpg?q=x_0,y_0,h_900,w_1599,c_fill/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/181010231718-olivia-nuzzu-ctn.jpg?q=x_245,y_38,h_803,w_1428,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180819165156-trump-attack-on-journalist-baquet-intv-axe-files-vpx-00000502.jpg?q=x_2,y_0,h_1078,w_1915,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180802141815-sanders-acosta-split.jpg?q=x_2,y_0,h_1078,w_1915,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180429075208-michelle-wolf-white-house-correspondents-dinner-0428.jpg?q=x_0,y_124,h_1343,w_2388,c_crop/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/181107124641-bpt101-trump-news-conference-11072018.jpg?q=x_0,y_61,h_1965,w_3492,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180428223514-michelle-wolf-whcd-2.jpg?q=x_2,y_0,h_1078,w_1915,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/171011105543-chris-cillizza.jpg?q=x_0,y_0,h_1440,w_2558,c_fill/h_270,w_480/c_thumb,g_face,w_100,h_100"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/180429075208-michelle-wolf-white-house-correspondents-dinner-0428.jpg?q=x_0,y_124,h_1343,w_2388,c_crop/w_800", "keywords": [], "authors": ["Chris Cillizza"], "canonical_link": "https://www.cnn.com/2018/04/29/politics/michelle-wolf-whcd-takeaways/index.html", "title": "5 takeaways on Michelle Wolf’s hugely controversial speech at the White House correspondents’ dinner", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "5 takeaways on Michelle Wolf's hugely controversial speech at the White House correspondents' dinner | CNN Politics", "description": "Comedian Michelle Wolf's savage takedown of everyone from President Donald Trump to White House press secretary Sarah Sanders to the media was  -- and will be -- the talk of Saturday Night's White House correspondents' dinner in Washington.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180429075208-michelle-wolf-white-house-correspondents-dinner-0428.jpg?q=x_0,y_124,h_1343,w_2388,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2018/04/29/politics/michelle-wolf-whcd-takeaways/index.html", "site_name": "CNN"}, "twitter": {"title": "5 takeaways on Michelle Wolf's hugely controversial speech at the White House correspondents' dinner | CNN Politics", "description": "Comedian Michelle Wolf's savage takedown of everyone from President Donald Trump to White House press secretary Sarah Sanders to the media was  -- and will be -- the talk of Saturday Night's White House correspondents' dinner in Washington.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180429075208-michelle-wolf-white-house-correspondents-dinner-0428.jpg?q=x_0,y_124,h_1343,w_2388,c_crop/w_800", "card": "summary_large_image", "site": "@cnnpolitics"}, "description": "Comedian Michelle Wolf's savage takedown of everyone from President Donald Trump to White House press secretary Sarah Sanders to the media was  -- and will be -- the talk of Saturday Night's White House correspondents' dinner in Washington.", "template_type": "article_leaf", "type": "article", "meta-section": "politics", "meta-branding": "the-point", "theme": "politics", "article": {"published_time": "2018-04-29T14:15:53Z", "modified_time": "2018-04-30T01:38:30Z", "tag": "business and industry sectors, business, economy and trade, government and public administration, journalism and news media, media industry, political events, politics, white house correspondents dinner, donald trump, government bodies and offices, political figures - us, us federal government, white house, abortion, bullying, health and medical, medical treatments and procedures, sexual and reproductive health, society, violence in society, arts and entertainment, comedians and comedy", "publisher": "https://www.facebook.com/CNN"}, "keywords": "business and industry sectors, business, economy and trade, government and public administration, journalism and news media, media industry, political events, politics, white house correspondents dinner, donald trump, government bodies and offices, political figures - us, us federal government, white house, abortion, bullying, health and medical, medical treatments and procedures, sexual and reproductive health, society, violence in society, arts and entertainment, comedians and comedy", "author": "Chris Cillizza", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1524956400.0, "source": "https://www.cnn.com", "summary": ""}