{"url": "https://tvline.com/2018/05/10/greys-anatomy-season-14-episode-23-recap-april-lives/", "text": "Warning: The following contains spoilers for Thursday’s harrowing Grey’s Anatomy.\n\nBefore revealing to Levi and Taryn in Thursday’s Grey’s Anatomy that April was being rushed into the ER, Bailey warned the interns that when they found out who was on the rig, “You’re not gonna lose your minds, you’re gonna hold it together.” Unfortunately, no one gave us that instruction. So I suspect I speak for most of us viewers when I say that, as we watched this singularly upsetting hour of television, we most certainly did lose our minds and did not hold it together. Did Kepner pull through in the end? Keep the tissues handy, and read on…\n\n‘WE’RE NOT GONNA LOSE HER’ | As the penultimate Season 14 episode began, April was fine, sending out invitations to Jolex’s wedding when her ride honked. “It might be too fancy for me to go to,” joked Jo upon receiving the invite. Meanwhile, Amelia rushed to Owen’s because… Betty was back. And she hadn’t relapsed. She was six days clean. Rather than let the teen out of her sight, she took her to work with her for a consult. At the hospital, Arizona gave Bailey her notice; she was leaving to scrub in at Mount Sinai. The chief was not pleased. Turned out, Amelia’s consult was with Geena Davis’ Herman, who cracked that she and Arizona looked swell before admitting that she was still blind as an earthworm. At the coffee cart, Maggie clarified that she and Jackson were attending the wedding together — sort of their first public outing as a couple. Shortly, Matthew came in on an ambulance — he’d rolled his car and was in rough shape. OK, so now we knew for sure who April’s ride had been. But where was she?!? While Jo revealed that she and Alex had a cake-tasting with Kepner at 11, an ambulance raced back to the scene of Matthew’s accident, Owen in tow. At the site, he spotted April unconscious, her lower extremities apparently chilling in a frigid lake. At that very moment, Mer was back at Grey Sloan asking Jackson if he knew where his ex was. When she received Owen’s text, she elected not to fill in Avery, as he was about to go into surgery. By the time the ambulance arrived at Grey Sloan, Owen reported that April was hypothermic, with no pulse and no vitals, and an EMT added that they had no way of knowing how long she’d been down. “I think we lost her,” said another EMT. “No, we didn’t,” replied her friends almost in unison.\n\nRELATED STORIES Grey's Anatomy Preview: EP Maps Out How Bailey Moves Forward After Being Forced to 'Step Away for Her Sanity'\n\nGrey's Anatomy Preview: EP Maps Out How Bailey Moves Forward After Being Forced to 'Step Away for Her Sanity' Did P.D.'s Jay Owe Hailey a Convo? Fave Grey's Newbie? Is Rings of Power Tune a Banger? Early Mole Theories? More Qs!\n\nWhile Mer paged Maggie, Bailey explained to the interns that they had to raise April’s temperature before they could try to jump-start her heart. The team accomplished that by working to pump blood through her body manually. An hour later, with Mer and Maggie still at it, Pierce urged her half sister to tell Jackson. When she ran into Alex in the corridor and he mentioned his appointment with April, Mer burst into tears. (She wasn’t the only one!) In the O.R., as docs took turns pumping blood through Kepner, Alex admitted that he’d hated her at first, because he’d wanted to be more like her. Nurturing, caring, all that good stuff, she just was naturally. “You gotta stop saying ‘was,'” Mer told him. Nearby, Richard operated on Matthew, whose spleen wasn’t looking so good. To feel like she was doing something, anything, Bailey pitched in. “This boy must be cursed,” Webber sighed. He might be onto something there, too. Jackson was fresh out of surgery and informing Jo that he was basically broke when he overheard Casey say they needed all the blood to save Kepner’s life. Not the way he should’ve found out.\n\n‘DON’T TAKE APRIL, PLEASE’ | Bursting into the O.R., Avery learned that April had been there for three hours. Nothing to do but wait. “And pray,” said Owen, asking everyone to do what April would’ve wanted and pray for her. From there, the group waited to see any sign of a heartbeat in April, and Maggie, eventually convinced that she had, began using the EKG paddles on her over and over. Finally, Pierce actually did get a rhythm, and they — and we — breathed a huge sigh of relief. In recovery, Matthew came to and immediately asked about April. At that very moment, Amelia was noting that Kepner’s brainwaves were slow and irregular. As soon as Arizona found out what had happened, she rushed into her friend’s room and explained that April and Matthew had been seeing each other again for months. They’d even fallen back in love. Soon, Ben arrived and was welcomed with a huge hug by Bailey. Overnight, it appeared, April’s friends sat at her bedside. At this point, to my relief, I was thinking, “OK, she’s gonna pull through!” But then it seemed for an awful instant like she was basically brain-dead. Tearfully, Jackson told April that he didn’t just want to believe she was still there, he would believe it. “I’ll do whatever you want,” he then told God. “Don’t take her away, OK?” And at that second, she squeezed his hand — ever so gently — and opened her eyes. Lord, what an emotional roller coaster! As Amelia reported that April’s reflexes were good, Kepner related that she remembered calling 911, feeling warmer and warmer and safer… “And then I was here,” she said, delighting in pointing out to Jackson that “you prayed for me, and it worked.” She quickly added that she hadn’t died and come back — that was Jesus’ jam. Before they all left her to get some rest, April thanked Owen. “You always come and bring me back,” she said. Later, April thanked Maggie, too, for saving her life, and at last she was reunited with Matthew.\n\n‘SO YOU DID BRAIN SURGERY WHILE YOU NEEDED BRAIN SURGERY?’ | During Amelia’s consult on Nicole’s case, Grey Sloan’s former Head of Fetal Surgery complained of headaches and dizziness. She also revealed to Arizona that she’d been keeping tabs on her career and was eager to catch up. Ticked at having been abandoned by her teacher, blind or not, Robbins didn’t appear quite so keen to. When Arizona revealed to Herman that she was going back into peds and leaving behind fetal surgery, her former mentor balked that that was unacceptable. After Nicole’s scan, she ordered Arizona not to even consider quitting fetal surgery. “After blind school, I hit a rough patch,” Nicole said by way of explaining why she’d ghosted Robbins. “I went very, very dark.” But hearing what Arizona had been up to had excited her — Herman had succeeded in downloading into Robbins her whole brain! It made her realize that she could teach and create a whole lot more Arizonas. And “that saved my life,” she said. At the same time, Amelia feared that Nicole’s tumor was back, but she just couldn’t find it, damn it. If the tumor was back, Amelia resolved, she was telling Herman that she’d had a tumor when she operated on Nicole. During a spinal tap on Herman, Arizona and DeLuca learned that Nicole didn’t have a tumor. When Amelia then tried to refer Nicole to Koracick to have her shunt put in, Herman revealed that she’d overheard — while in Tom’s bed! — all about her former doc’s huge, honking tumor. Left alone with Arizona, Herman told her that she’d just gotten a grant and wanted to move forward with the Robbins Herman Center for Women’s Health and launch Arizona’s cart program. “Could we do it in New York?” Robbins said. “We could do it wherever you want,” Nicole replied before asking Arizona to warn her the next time she’s lunging in for an embrace.\n\n‘IT’S GONNA BE SO BEAUTIFUL’ | As the episode came to a close, Betty confessed to Amelia that she hadn’t really been clean for six days and had been too high to miss her son. She’d only come home because she’d been cold. Not surprised, Amelia took her straight to a meeting. When Jackson passed by the chapel on his way out of the hospital with Harriet, he couldn’t help but stop in to say a silent thank you. At home in bed with a snoozing Ben, Bailey appeared to be mulling something over, something big. Jolex looked forward to their wedding; Mer, realizing how lucky she was to have once pulled through a trauma that had been chillingly similar to April’s, took a sweet gaze at Derek’s Post-It wedding vows before placing his cap on top of them in her drawer; and Kepner and Matthew recovered with their hospital beds pushed up against one another.\n\nSo, how did you handle “Cold as Ice”? Relieved much? And since April survived, what do you make of Ellen Pompeo’s remark that the finale is “not easy”? Hit the comments.", "images": ["https://tvline.com/wp-content/uploads/2022/08/october-streaming-2022.jpg?w=280", "https://tvline.com/wp-content/uploads/2018/05/greys-anatomy-season-14-episode-23-ellen-pompeo.png?w=300", "https://www.sportico.com/wp-content/uploads/2022/03/transax-copy.jpg?resize=180,101", "https://tvline.com/wp-content/uploads/2022/10/Rings-of-Power-Morfydd-Clark-Galadriel.jpg?w=620", "https://tvline.com/wp-content/uploads/2018/05/greys-anatomy-season-14-episode-23-caterina-scorsone-jessica-capshaw.jpg?w=300", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://tvline.com/wp-content/uploads/2022/09/teen-wolf-movie-release-date.jpg?w=620", "https://www.indiewire.com/wp-content/uploads/2022/10/GettyImages-1094598354.jpg?resize=180,101", "https://spy.com/wp-content/uploads/2022/10/Defrosting-Tray.jpg?resize=180,101", "https://tvline.com/wp-content/uploads/2018/05/greys-anatomy-season-14-episode-23-sarah-drew.png?w=620&h=420&crop=1", "https://tvline.com/wp-content/uploads/2022/10/chicago-pd.jpg?w=210&h=140&crop=1", "https://tvline.com/wp-content/uploads/2018/05/greys-anatomy-season-14-episode-23-jesse-williams.png?w=300", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-203220h&cg=0&cc=1&ts=noscript", "https://variety.com/wp-content/uploads/2022/10/Fire-Country-Firefighters.jpg?resize=180,101", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://tvline.com/wp-content/uploads/2018/05/greys-anatomy-season-14-episode-23-sarah-drew.png?w=620", "https://tvline.com/wp-content/uploads/2018/05/greys-anatomy-season-14-episode-23-kevin-mckidd.png?w=300", "https://tvline.com/wp-content/uploads/2022/10/wheel-of-time-season-2-teaser-photos.jpeg?w=620", "https://tvline.com/wp-content/themes/pmc-tvline-2014/library/images/follow_us_on_facebook_graphic.png", "https://tvline.com/wp-content/uploads/2022/10/greys-anatomy-chandra-wilson.jpg?w=210&h=140&crop=1", "https://tvline.com/wp-content/uploads/2022/10/fire-country-bode-freddy.jpg?w=630", "https://tvline.com/wp-content/uploads/2022/10/wolf-pack-trailer.jpg?w=620", "https://deadline.com/wp-content/uploads/2022/04/Screenshot-2022-04-18-at-08.52.07.png?resize=180,101"], "top_img": "https://tvline.com/wp-content/uploads/2018/05/greys-anatomy-season-14-episode-23-sarah-drew.png?w=620", "keywords": [], "authors": ["Charlie Mason"], "canonical_link": "https://tvline.com/2018/05/10/greys-anatomy-season-14-episode-23-recap-april-lives/", "title": "Grey's Recap: Did April Survive?", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1.0 maximum-scale=1, user-scalable=no", "p": {"domain_verify": "9ad238c78ee34da2d6d96a41981790d2"}, "description": "Our recap of 'Grey's Anatomy' Season 14, Episode 23, reveals whether April lives or dies. Plus: Geena Davis' return as Dr. Herman.", "news_keywords": "ABC, Grey's Anatomy", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=1377345661", "generator": "WordPress 6.0.2", "author": "Charlie Mason", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "TVLine", "application-name": "TVLine", "content_type": "Article", "post_id": 944385, "title": "<i>Grey's</i> Recap: Did April Survive?", "published_at": "2018-05-10 18:01:48", "image": "https://tvline.com/wp-content/uploads/2018/05/greys-anatomy-season-14-episode-23-sarah-drew.png?w=300&h=208&crop=1", "comment_count": 116, "tags": "Grey's Anatomy", "topics": "Recaps", "body": "Warning: The following contains spoilers for Thursday's harrowing Grey's Anatomy.\r\n\r\nBefore revealing to Levi and Taryn in Thursday's Grey's Anatomy that April was being rushed into the ER, Bailey warned the interns that when they found out who was on the rig, \"You're not gonna lose your minds, you're gonna hold it together.\" Unfortunately, no one gave us that instruction. So I suspect I speak for most of us viewers when I say that, as we watched this singularly upsetting hour of television, we most certainly did lose our minds and did not hold it together. Did Kepner pull through in the end? Keep the tissues handy, and read on…\r\n\r\n\r\n\r\n'WE'RE NOT GONNA LOSE HER' | As the penultimate Season 14 episode began, April was fine, sending out invitations to Jolex's wedding when her ride honked. \"It might be too fancy for me to go to,\" joked Jo upon receiving the invite. Meanwhile, Amelia rushed to Owen's because… Betty was back. And she hadn’t relapsed. She was six days clean. Rather than let the teen out of her sight, she took her to work with her for a consult. At the hospital, Arizona gave Bailey her notice; she was leaving to scrub in at Mount Sinai. The chief was not pleased. Turned out, Amelia's consult was with Geena Davis' Herman, who cracked that she and Arizona looked swell before admitting that she was still blind as an earthworm. At the coffee cart, Maggie clarified that she and Jackson were attending the wedding together — sort of their first public outing as a couple. Shortly, Matthew came in on an ambulance — he'd rolled his car and was in rough shape. OK, so now we knew for sure who April's ride had been. But where was she?!? While Jo revealed that she and Alex had a cake-tasting with Kepner at 11, an ambulance raced back to the scene of Matthew's accident, Owen in tow. At the site, he spotted April unconscious, her lower extremities apparently chilling in a frigid lake. At that very moment, Mer was back at Grey Sloan asking Jackson if he knew where his ex was. When she received Owen's text, she elected not to fill in Avery, as he was about to go into surgery. By the time the ambulance arrived at Grey Sloan, Owen reported that April was hypothermic, with no pulse and no vitals, and an EMT added that they had no way of knowing how long she'd been down. \"I think we lost her,\" said another EMT. \"No, we didn't,\" replied her friends almost in unison.\r\n\r\nWhile Mer paged Maggie, Bailey explained to the interns that they had to raise April's temperature before they could try to jump-start her heart. The team accomplished that by working to pump blood through her body manually. An hour later, with Mer and Maggie still at it, Pierce urged her half sister to tell Jackson. When she ran into Alex in the corridor and he mentioned his appointment with April, Mer burst into tears. (She wasn't the only one!) In the O.R., as docs took turns pumping blood through Kepner, Alex admitted that he'd hated her at first, because he'd wanted to be more like her. Nurturing, caring, all that good stuff, she just was naturally. \"You gotta stop saying 'was,'\" Mer told him. Nearby, Richard operated on Matthew, whose spleen wasn't looking so good. To feel like she was doing something, anything, Bailey pitched in. \"This boy must be cursed,\" Webber sighed. He might be onto something there, too. Jackson was fresh out of surgery and informing Jo that he was basically broke when he overheard Casey say they needed all the blood to save Kepner's life. Not the way he should've found out.\r\n\r\n\r\n\r\n'DON'T TAKE APRIL, PLEASE' | Bursting into the O.R., Avery learned that April had been there for three hours. Nothing to do but wait. \"And pray,\" said Owen, asking everyone to do what April would've wanted and pray for her. From there, the group waited to see any sign of a heartbeat in April, and Maggie, eventually convinced that she had, began using the EKG paddles on her over and over. Finally, Pierce actually did get a rhythm, and they — and we — breathed a huge sigh of relief. In recovery, Matthew came to and immediately asked about April. At that very moment, Amelia was noting that Kepner's brainwaves were slow and irregular. As soon as Arizona found out what had happened, she rushed into her friend's room and explained that April and Matthew had been seeing each other again for months. They'd even fallen back in love. Soon, Ben arrived and was welcomed with a huge hug by Bailey. Overnight, it appeared, April's friends sat at her bedside. At this point, to my relief, I was thinking, \"OK, she's gonna pull through!\" But then it seemed for an awful instant like she was basically brain-dead. Tearfully, Jackson told April that he didn’t just want to believe she was still there, he would believe it. \"I'll do whatever you want,\" he then told God. \"Don't take her away, OK?\" And at that second, she squeezed his hand — ever so gently — and opened her eyes. Lord, what an emotional roller coaster! As Amelia reported that April's reflexes were good, Kepner related that she remembered calling 911, feeling warmer and warmer and safer… \"And then I was here,\" she said, delighting in pointing out to Jackson that \"you prayed for me, and it worked.\" She quickly added that she hadn't died and come back — that was Jesus' jam. Before they all left her to get some rest, April thanked Owen. \"You always come and bring me back,\" she said. Later, April thanked Maggie, too, for saving her life, and at last she was reunited with Matthew.\r\n\r\n\r\n\r\n'SO YOU DID BRAIN SURGERY WHILE YOU NEEDED BRAIN SURGERY?' | During Amelia's consult on Nicole's case, Grey Sloan's former Head of Fetal Surgery complained of headaches and dizziness. She also revealed to Arizona that she'd been keeping tabs on her career and was eager to catch up. Ticked at having been abandoned by her teacher, blind or not, Robbins didn’t appear quite so keen to. When Arizona revealed to Herman that she was going back into peds and leaving behind fetal surgery, her former mentor balked that that was unacceptable. After Nicole's scan, she ordered Arizona not to even consider quitting fetal surgery. \"After blind school, I hit a rough patch,\" Nicole said by way of explaining why she'd ghosted Robbins. \"I went very, very dark.\" But hearing what Arizona had been up to had excited her — Herman had succeeded in downloading into Robbins her whole brain! It made her realize that she could teach and create a whole lot more Arizonas. And \"that saved my life,\" she said. At the same time, Amelia feared that Nicole's tumor was back, but she just couldn’t find it, damn it. If the tumor was back, Amelia resolved, she was telling Herman that she'd had a tumor when she operated on Nicole. During a spinal tap on Herman, Arizona and DeLuca learned that Nicole didn’t have a tumor. When Amelia then tried to refer Nicole to Koracick to have her shunt put in, Herman revealed that she'd overheard — while in Tom's bed! — all about her former doc's huge, honking tumor. Left alone with Arizona, Herman told her that she'd just gotten a grant and wanted to move forward with the Robbins Herman Center for Women's Health and launch Arizona's cart program. \"Could we do it in New York?\" Robbins said. \"We could do it wherever you want,\" Nicole replied before asking Arizona to warn her the next time she's lunging in for an embrace.\r\n\r\n'IT'S GONNA BE SO BEAUTIFUL' | As the episode came to a close, Betty confessed to Amelia that she hadn't really been clean for six days and had been too high to miss her son. She'd only come home because she'd been cold. Not surprised, Amelia took her straight to a meeting. When Jackson passed by the chapel on his way out of the hospital with Harriet, he couldn’t help but stop in to say a silent thank you. At home in bed with a snoozing Ben, Bailey appeared to be mulling something over, something big. Jolex looked forward to their wedding; Mer, realizing how lucky she was to have once pulled through a trauma that had been chillingly similar to April's, took a sweet gaze at Derek's Post-It wedding vows before placing his cap on top of them in her drawer; and Kepner and Matthew recovered with their hospital beds pushed up against one another.\r\n\r\nSo, how did you handle \"Cold as Ice\"? Relieved much? And since April survived, what do you make of Ellen Pompeo's remark that the finale is \"not easy\"? Hit the comments.", "fb": {"pages": 187516444593639}, "fragment": "!", "og": {"type": "article", "title": "Grey's Recap: Did April Survive?", "url": "https://tvline.com/2018/05/10/greys-anatomy-season-14-episode-23-recap-april-lives/", "description": "Warning: The following contains spoilers for Thursday’s harrowing Grey’s Anatomy.", "site_name": "TVLine", "image": {"identifier": "https://tvline.com/wp-content/uploads/2018/05/greys-anatomy-season-14-episode-23-sarah-drew.png?w=620", "width": 620, "height": 420, "alt": "greys anatomy season 14 episode 23 recap april"}, "locale": "en_US"}, "article": {"published_time": "2018-05-11T01:01:48+00:00", "modified_time": "2018-05-11T01:30:06+00:00"}, "twitter": {"site": "@TVLine", "card": "summary_large_image", "title": "Grey's Recap: Did April Survive?", "description": "Our recap of 'Grey's Anatomy' Season 14, Episode 23, reveals whether April lives or dies. Plus: Geena Davis' return as Dr. Herman.", "image": "https://tvline.com/wp-content/uploads/2018/05/greys-anatomy-season-14-episode-23-sarah-drew.png?w=620"}, "msapplication-TileImage": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=270"}, "movies": [], "publish_date": 1525906800.0, "source": "https://tvline.com", "summary": ""}