{"url": "https://stylecaster.com/medalion-rahimi-still-star-crossed/", "text": "Medalion Rahimi should be used to the royal treatment. After all, she’s played princesses on two Shonda Rhimes shows. But, like her characters’ roads to the throne, Rahimi—who currently stars in her second princess role on Rhimes’s latest series, “Still Star-Crossed”—didn’t face an easy path to success.\n\nAs a first-generation Iranian American, Rahimi was bullied for her textured brown hair and light-red freckles, which are natural Iranian traits passed down from her mother and grandmother. And though they’ve become Rahimi’s most complimented features (just take a look at her Instagram), they were also the source of her darkest insecurities growing up. “It’s made me stronger as a person,” she says. “I feel like if people can just wait out adolescence, it does get so much better.”\n\n“ If people can just wait out adolescence, it does get so much better. ”\n\nRaised by two Iranian immigrants who fled Iran in the ’70s to escape a dictatorship, Rahimi spent her childhood crammed into a one-bedroom apartment in the San Fernando Valley with her parents and older brother. While her parents steadily worked their way up—her dad as a dentist; her mom as an attorney—Rahimi’s struggles continued in school.\n\n“I had buck teeth, frizzy hair, freckles, and a retainer,” Rahimi says. “People called me Hermione sometimes, which I loved because I thought she was brave, but they meant it in sort of a mean way.” Along with calling her “metal mouth,” Rahimi’s classmates would make fun of her hair and say her freckles were a sign of disease. “It’s part of the reason why I’m so quiet,” she says. “It’s something I’ve learned to embrace, but it was definitely hard.”\n\nAs a result of the bullying, Rahimi withdrew into herself and made efforts to change her appearance. To hide her hair texture, she braided her hair every day before graduating to a straightener. She even tried shaving parts of her head and dabbled in keratin treatment. When she started using makeup, she did her best to mask her freckles.\n\nRahimi slowly started regaining her confidence at age 12, when she starred as Cha-Cha DiGregorio in a seventh-grade production of Grease—a role she auditioned for on a whim that sparked her passion for acting. “It was a place where I could have a voice,” Rahimi says. “I was such a quiet kid that performing became a time when people would listen to me.”\n\n“ Performing became a time when people would listen to me. ”\n\nAfter a push from a high school drama teacher, Rahimi went on to study theatre at the University of California, Los Angeles before finding an agent and nabbing small parts in the indie world. But she still felt plagued by the insecurities she faced growing up. “I would go to auditions with a full face of makeup and straightened hair, thinking that that’s what people were looking for,” she says.\n\nIt wasn’t until about four years ago, when Rahimi was 21 and dating a man who was raised with a different view of beauty, that her own perspective started to shift. “He grew up in Paris and women there don’t really wear makeup. They are a little bit naturale,” says Rahimi. “He told me to just embrace my natural hair.”\n\nAs a result, Rahimi grew out her natural hair, which was cut short and slightly damaged from the keratin, and toned down her makeup drastically. “I started getting so many nice compliments from women who had incredible hair who were like, ‘I want your hair,’” she says. “You’re telling me you want my hair? It was crazy. I noticed as soon as I stopped doing that was when I really started to book roles, too.”\n\nSoon after, Rahimi scored her big break on Rhimes’s comedy crime-drama show, “The Catch,” playing Princess Zara Al-Salim, a headstrong modern-day Arabian princess. Though the part only lasted three episodes, Rahimi caught Rhimes’s eye, who cast her as a series regular in “Still Star-Crossed,” a multi-ethnic take on Shakespeare’s Romeo and Juliet. In it, Rahimi stars as Princess Isabella, one of five leads of color.\n\nThough the show has faced backlash for straying from the original Romeo and Juliet, Rahimi isn’t concerned about the criticism. “It’s historical fiction, not a historical drama. It doesn’t need to make sense,” she says. “That’s what TV and film is all about—to just put you into a world. [The show] looks more like the world we live in. You don’t go somewhere and just see all one type of person anymore.”\n\nShe appreciates that Rhimes doesn’t play into Hollywood white-washing, something Rahimi’s accustomed to after hearing time and again that casting directors “decided to go a different direction”—a code, she explained, that usually means choosing the blonde, white girl.\n\n“I always loved that Shonda’s shows are so colorful and multiracial,” says Rahimi. “I’ve seen a white woman with brown hair and brown eyes and maybe a bit of a tan play Hispanic or Middle Eastern and put on an accent. I really think [casting directors] should give those opportunities to someone who comes from that culture because they carry it inside of them.”\n\n“ You don’t go somewhere and just see all one type of person anymore. ”\n\nRacial diversity isn’t the only thing Rahimi praises “Still Star-Crossed” for. After regularly playing “ditzy party girls” and “women manufactured by men for men,” she says it’s refreshing to play a complicated, hyper-intelligent princess who, in some ways, is more fit to rule than her brother—but is forced to sit on the sidelines because she’s a woman. Rahimi sees plenty of parallels between the sexism in the show and America in 2017.\n\n“The U.S. could’ve had a woman in power after our last election,” she says. “Maybe [Hillary Clinton] wasn’t the best option, but she was better than the current option. There was a lot of prejudice because she was a woman. That relates fully to the show. Even though it’s set in the 1700s, it’s still prevalent today and definitely an issue.”\n\nAs the daughter of Iranian immigrants, Rahimi feels particularly fired-up about the Trump Administration, especially after the recent travel ban against six Muslim-majority countries, including Iran. “The U.S. was built on immigrants and [the ban] is insane to me,” Rahimi says. “I think a lot of people are upset, even the people whose beliefs were in line with the Republican party and the conservatives. This is more than that; it’s about humanity.”\n\nRahimi is using her voice as an Iranian-American actress to combat the bill by making phone calls, sending letters, and attending town hall meetings. On a less political level, Rahimi–who dreams of diversifying the beauty industry away from “European Anglo-American-looking girls”—is passionate about reshaping the way all young girls, not just those of Middle Eastern descent, see themselves while growing up.\n\n“I’m happy with who I am. I think a princess has to be confident,” Rahimi says. “It’s so important to just be who you are. It’s good to embrace our differences. We shouldn’t all look the same. This world would be so boring.”", "images": ["https://stylecaster.com/wp-content/uploads/2022/09/Rachel-Aven-The-Bachelorette.png?w=120&h=120&crop=1", "https://stylecaster.com/wp-content/uploads/2017/07/medalionrahimilioneldeluy_img4816.jpg?w=670", "https://stylecaster.com/wp-content/uploads/2017/07/medalion-rahimi-still-star-crossed-2.jpg?w=670", "https://stylecaster.com/wp-content/uploads/2022/09/queen-elizabeth-ii-1.png?w=120&h=120&crop=1", "https://stylecaster.com/wp-content/uploads/2022/09/jeffrey-dahmer.png?w=120&h=120&crop=1", "https://trc.taboola.com/1394147/log/3/unip?en=page_view", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=146467699155455&ev=PageView&noscript=1", "https://stylecaster.com/wp-content/uploads/2017/07/medalion-rahimi-feat.jpg", "https://stylecaster.com/wp-content/uploads/2017/07/medalion-rahimi-still-star-crossed.jpg?w=670", "https://stylecaster.com/wp-content/uploads/2017/05/1-Square.jpg?resize=%2C", "https://stylecaster.com/wp-content/uploads/2017/07/lioneldeluymedalionrahimi2.jpg?w=670", "https://stylecaster.com/wp-content/uploads/2022/09/king-charles-prince-harry-meghan-markle.jpg?w=120&h=120&crop=1", "https://stylecaster.com/wp-content/uploads/2022/09/Jeffrey-Dahmer-2.jpg?w=120&h=120&crop=1"], "top_img": "https://stylecaster.com/wp-content/uploads/2017/07/medalion-rahimi-feat.jpg", "keywords": [], "authors": ["Jason Pham"], "canonical_link": "https://stylecaster.com/medalion-rahimi-still-star-crossed/", "title": "How Medalion Rahimi Overcame Bullying to Become Shondaland’s Next Muse", "meta_data": {"description": "Iranian-American actress Medalion Rahimi talks 'Still Star-Crossed,' diversity in Hollywood, natural beauty, and Donald Trump's Muslim ban.", "keywords": "medalion rahimi, still star-crossed, diversity, beauty, donald trump, muslim, ban, iran", "msvalidate.01": "7A34A1C1904BAFB83691E8B3718CA9A2", "article": {"publisher": "https://www.facebook.com/stylecaster", "published_time": "2017-07-28T20:00:49+00:00", "modified_time": "2018-11-04T16:12:33+00:00", "author": "Jason Pham", "section": "Entertainment", "tag": "Shonda Rhimes"}, "google-site-verification": "yB_5UwT5pPNnn93Mba5HIaFkNtbrafDQWP_Rj34Iw08", "news_keywords": "diversity, Shonda Rhimes", "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "generator": "WordPress 6.0.2", "author": "Jason Pham", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "StyleCaster", "application-name": "StyleCaster", "og": {"site_name": "StyleCaster", "type": "article", "locale": "en_US", "url": "https://stylecaster.com/medalion-rahimi-still-star-crossed/", "title": "How Medalion Rahimi Overcame Bullying to Become Shondaland’s Next Muse", "description": "The Iranian-American actress talks natural beauty, diversity in Hollywood, and Trump’s Muslim ban.", "image": {"identifier": "https://stylecaster.com/wp-content/uploads/2017/07/medalion-rahimi-feat.jpg", "width": 960, "height": 540}}, "fb": {"app_id": 134683123322801, "pages": 48566051011, "article_style": "scdefault"}, "twitter": {"card": "summary_large_image", "site": "@stylecaster", "creator": "@stylecaster", "title": "How Medalion Rahimi Overcame Bullying to Become Shondaland’s Next Muse", "description": "The Iranian-American actress talks natural beauty, diversity in Hollywood, and Trump’s Muslim ban.", "image": "https://stylecaster.com/wp-content/uploads/2017/07/medalion-rahimi-feat.jpg", "account_id": 55678606}}, "movies": [], "publish_date": 1501272049.0, "source": "https://stylecaster.com", "summary": ""}