{"url": "https://www.usatoday.com/story/life/entertainthis/2018/03/06/hilarie-burton-jeffrey-dean-morgan-welcome-miracle-baby-honest-post-fertility/401730002/", "text": "Hilarie Burton, Jeffrey Dean Morgan welcome 'miracle baby' in honest post about fertility\n\nShow Caption Hide Caption Hilarie Burton, Jeffrey Dean Morgan share photos of 'miracle baby' Jeffrey Dean Morgan and Hilarie Burton‘s newborn baby girl is the picture of adorable perfection in a new photo collage shared to her mom’s Instagram account. Time\n\nHilarie Burton and Jeffrey Dean Morgan have happy baby news to share - on Feb. 16, they welcomed a baby girl named George Virginia.\n\nBut Burton took to her Instagram announcement mindfully, couching her excitement with a supportive message to others struggling with fertility.\n\nThe former One Tree Hill actress began dating Morgan in 2009, and in 2010 they welcomed their first child, a son named Augustus. The couple married in 2014 and on Tuesday, Burton revealed it took her five years to carry a second child to term.\n\n\"There's something I really want to say to all the women out there who are trying,\" said Burton, before getting into the details of George Virginia's arrival. \"It took a long time for Jeffrey and I to have this baby. The first time I got pregnant, it took a year and a half. I surprised him on Christmas with baby Seahawk booties. We cried. We celebrated. We picked out names. And we lost that baby.\"\n\nBurton says more heartbreaking losses follows, and as she struggled, the actress would internalize the news of other people's babies being born.\n\nI just couldn’t be more proud. Or lucky. Xxxjd https://t.co/HRQfOzthlS — Jeffrey Dean Morgan (@JDMorgan) March 6, 2018\n\n\"Every morning of the five years it took us, I'd open my computer at the kitchen table and see the news and I'd grow bitter over the endless parade of celebrities showing off their bumps and babies. I'd weep out of jealousy for how easy it was for them. Didn't they know something could go wrong? Didn't they know that there were other women out there struggling? It pained me to see the corporate sponsored baby showers and magazine covers capitalizing on this human miracle that wasn't happening for us.\"\n\nDuring this pregnancy, she said, she was cautious. \"I didn't want to celebrate for fear of jinxing it. I didn't want a baby shower. I checked her heartbeat every day, up until the day she was born. And now that she is here, I just stare at her in wonder all day. I see her in her daddy's arms and I don't take any of it for granted. She screams bloody murder and I smile because she is so wildly alive.\"\n\nIn sharing news of her daughter's birth, Burton's message to other women trying to get pregnant is to stay hopeful.\n\n\"Now that folks know she's here, I don't want her birth to cause any other woman to weep at her kitchen table. If anything, my wish is that she would restore hope for others. Fertility is a fickle thing. And for the other couples out there who have had dark days, we want to introduce our miracle baby to you and send you our love and support in finding yours.\"\n\nBurton closed: \"Please meet George Virginia Morgan. She was born February 16th. Her daddy delivered her. We love her very much.\"", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/-mm-/3f90504cd514befc3aa9c4cfb31d9052f745254f/c=0-585-3634-2638/local/-/media/2018/03/06/USATODAY/USATODAY/636559656138387648-XXX-ENTERTAINMENT-69TH-ANNUAL-EMMY-AWARDS-20170917-93876617.JPG?auto=webp&format=pjpg&width=1200", "https://media.gannett-cdn.com/29906170001/29906170001_5746243123001_5746229324001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/3f90504cd514befc3aa9c4cfb31d9052f745254f/c=0-585-3634-2638/local/-/media/2018/03/06/USATODAY/USATODAY/636559656138387648-XXX-ENTERTAINMENT-69TH-ANNUAL-EMMY-AWARDS-20170917-93876617.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Andrea Mandell"], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2018/03/06/hilarie-burton-jeffrey-dean-morgan-welcome-miracle-baby-honest-post-fertility/401730002/", "title": "Hilarie Burton, Jeffrey Dean Morgan welcome 'miracle baby' in honest post about fertility", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/entertainthis/2018/03/06/hilarie-burton-jeffrey-dean-morgan-welcome-miracle-baby-honest-post-fertility/401730002/life/entertainthis", "theme-color": "#ffffff", "og": {"type": "article", "title": "Hilarie Burton, Jeffrey Dean Morgan welcome 'miracle baby' in honest post about fertility", "description": "Hilarie Burton and husband Jeffrey Dean Morgan have struggled with fertility for five years, Burton shared in a candid post Tuesday.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/3f90504cd514befc3aa9c4cfb31d9052f745254f/c=0-585-3634-2638/local/-/media/2018/03/06/USATODAY/USATODAY/636559656138387648-XXX-ENTERTAINMENT-69TH-ANNUAL-EMMY-AWARDS-20170917-93876617.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Hilarie Burton and husband Jeffrey Dean Morgan have struggled with fertility for five years, Burton shared in a candid post Tuesday.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1520294400.0, "source": "https://www.usatoday.com", "summary": ""}