{"url": "www.barstoolsports.com/boston/power-ranking-meghan-markles-shitshow-family-members/", "text": "There is only one thing I hate more than royalty and weddings. And that is a Royal Wedding. Why anyone would have more than a passing interest in a fake fairy tale Disney Princess marriage to someone who’s only claim to fame is their ancestors once had real power because their blood was considered purer than everyone else’s by fucking wizards is absolutely beyond me.\n\nAnd believe me, I know first hand what Royal Wedding fascination is all about. The Irish Rose – like every woman I know and, judging by the TV coverage, every gay gentleman in the UK – lives for these things. And not just the contemporary ones. If Amazon is streaming a British period piece where the whole plot is some long-dead king trying to marry someone who’ll give him a male heir? Trust me, she’s binged it while I’m down in the basement watching Rick and Morty. So to say the Meghan Markle-Prince Harry nuptials are her Super Bowl would be doing it a disservice. It’s her Super Bowl if the two coaches were going off after the game on a honeymoon to have sex and try to get pregnant with the quarterback of the Super Bowl 25 years from now. The stakes are that high. All that said, there is one thing that will get me interested in any wedding: Family drama. I do not want to be invited to your wedding or anyone else’s, thanks. I’ve had my fill of them and I’m all done. As a comic buddy of mine puts it, getting a wedding invitation is like getting an unexpected bill in the mail. But give me the promise of some old bad blood bubbling up to the surface and exploding like Kilauea all over the bridal party’s formalwear and I am all in. I was once at a rehearsal dinner at a fancy, landmark restaurant where the bride’s sisters literally landing haymakers on each other and pearls were rolling around on the floor of the dining room. I once watched the groom’s father fall off the wagon for the first time in years, get into a beef with the brother of the bride over who got to take home the centerpiece and drop a “motherfucker” on him. That’s the stuff that will make anybody tolerate your lame toasts and your first dance to Michael Buble. And so, in that vein, I’m happy that the Markle family has come along to totally steal this otherwise tedious affair, horrify the House of Windsor and give the fawning, Royal-worshipping British tabloids a healthy dose of good, old fashioned American dysfunction. They have been a prime example of us sharing our culture with the country that gave birth to us. And to that end, my power rankings of the shitshows in Meghan Markle’s family: 5. Her ex-husband, Trevor Engelson\n\nEven though he’s got possibly the most British sounding name since Neville Longbottom, Engelson is from Long Island. He’s also not nearly as bad as her actual blood relations. But he’s a TV producer who was developing a sitcom about an American woman who leaves her husband to marry a British prince. That is, until she reportedly was “deeply upset” over the whole, you know, having her personal life turned into The Fresh Princess of London thing in order to make him a buck. So, apparently out of still having feelings for his ex, he canceled the project. Until after the wedding. Then it’s full steam ahead. 4. Her ex-sister-in-law, Tracy Dooley Meghan’s half-brother’s ex-wife flew all the way to London from Oregon for the big day, with her two sons and the girlfriend of one of them in tow. And hauling 13 pieces of luggage. Which might come in handy if any of them were actually invited to the wedding, but they are not. Instead, they’re in town to be expert commentators on TV. Think Johnny Weir and Tara Lipinski covering the Kentucky Derby. Although Johnny and Tara probably know more about handicapping thoroughbreds than either of them know about their ex-husband/father’s estranged half sister. Extra White Trash points to the one nephew who took an international flight in a tank top. Because there’s nothing more appealing than being in a pressured metal tube with some dude’s uncovered sweaty armpits.\n\n3. Meghan’s dad, Thomas Markle, Sr. By now everyone knows this story. The tabloids get hold of a photo of the Father of the Bride searching his daughter’s wedding in an internet cafe, but sitting at a weirdly sideways angle. The Father of the Bride getting measured for a suit. By a kid who looks like he’s in high school and at a shop that looks more like it sells Arts & Crafts supplies than men’s clothes … … as the Brits at the Ministry for Telling the Press What They’re Allowed to Talk About ordered the paparazzi to leave the poor old hermit alone. Until it turned out he arranged for the photos in order to make a few bucks. Now he’s not going to the wedding, claiming he’s having surgery from a heart attack which was caused by: 2. Her half-brother, Thomas Markle, Jr.\n\nQuoting from his open letter to Prince Harry, which he posted two weeks before the ceremony: Dear Prince Harry,\n\nIt’s not too late, Meghan Markle is obviously not the right woman for you”. … [She is a] “jaded, shallow, conceited woman that will make a joke of you and the royal family heritage. … “I’m confused why you don’t see the real Meghan that the whole world now sees. Meghan’s attempt to act the part of a princess like a below C average Hollywood actress is getting old.” Though to be fair to him, Tom, Jr. did apologize. And then immediately said he’d like to be invited. And to be fair to humanity, he was arrested in January for holding a loaded gun to his girlfriend’s head so he can go fuck a corpse. 1. Her half-sister, Samantha Grant Markle You’d naturally assume that a mother of three stricken with MS and in a wheelchair would be a sympathetic figure. But in Samantha Grant Markle’s case you’d be way off. Think Samuel L. Jackson in Unbreakable. [SPOILER] A devious, criminal mastermind plotting only to feed his own insatiable lust for power. If you’ll pardon my unfortunate turn of a phrase, she was not about to take something like her half-sister’s wedding to a prince sitting down. Even if the two haven’t talked in over seven years. So to cash in on this attention whore windfall, she changed her name back to Markle. Dyed her hair to match Meghan’s. And wrote a book which is no doubt the heartfelt memoirs of their loving relationship called, The Diary of Princess Pushy’s Sister. She too, can’t figure out why she didn’t get an invite and will tell anyone willing to stick a camera and a mic in front of her how hacked off she is about getting snubbed by someone she hates so much. If I had a sister 1/10th as insufferable as this queef, I’d change my last name to her old name, just to distance myself from her.\n\nHonorable Mention: This loser. It doesn’t technically count because he only almost pretend dated Meghan’s fictional mother on a sitcom that was never watched by anyone I know. But you know somewhere he’s talking like they’re best friends in the world. And I’d rather live the rest of my life stranded on an island with the extended Markle family than spend a minute listening to him. @jerrythornton1\n\n\n\n", "images": ["http://www.barstoolsports.com/static/images/logo.png", "https://chumley.barstoolsports.com/wp-content/uploads/2018/05/24/jerrythornton1.jpg?width=64&height=64", "https://chumley.barstoolsports.com/wp-content/uploads/2018/05/16/Markles.jpg", "http://www.barstoolsports.com/static/images/download-play-store.svg", "http://www.barstoolsports.com/static/images/logo-chicks.png", "https://chumley.barstoolsports.com/wp-content/uploads/2018/05/16/Tracy-Dooley.jpg", "http://www.barstoolsports.com/static/images/download-app-store.svg", "https://chumley.barstoolsports.com/union/2022/10/07/9436751A-2AF4-484A-A294-4AEAD3247FF0.d0cd606e.jpeg", "https://cdn.barstoolsports.com/wp-content/uploads/2018/05/16/1ffc9ccb472a9a4-822x617.jpg", "https://chumley.barstoolsports.com/union/2020/06/15/15bda283.png", "https://chumley.barstoolsports.com/union/2022/10/04/7SKymz4w.43bcbab8.jpg"], "top_img": "https://cdn.barstoolsports.com/wp-content/uploads/2018/05/16/1ffc9ccb472a9a4-822x617.jpg", "keywords": [], "authors": ["Jerry Thornton"], "canonical_link": "https://www.barstoolsports.com/blog/996943/power-ranking-meghan-markles-shitshow-family-members", "title": "Power Ranking Meghan Markle's Shitshow Family Members", "meta_data": {"viewport": "width=device-width, initial-scale=1", "apple-itunes-app": "app-id=456805313", "fb": {"app_id": 167901609887021, "pages": 348156187501}, "twitter": {"app": {"name": {"iphone": "Barstool", "ipad": "Barstool"}, "id": {"iphone": 456805313, "ipad": 456805313}}, "site": "@barstoosports", "card": "summary_large_image", "creator": "@jerrythornton1", "title": "Power Ranking Meghan Markle's Shitshow Family Members", "description": "There is only one thing I hate more than royalty and weddings. And that is a Royal Wedding. Why anyone would have more than a passing interest in a fake fairy tale Disney Princess marriage to someone ...", "image": {"identifier": "https://cdn.barstoolsports.com/wp-content/uploads/2018/05/16/1ffc9ccb472a9a4-822x617.jpg", "alt": "Power Ranking Meghan Markle's Shitshow Family Members"}}, "description": "There is only one thing I hate more than royalty and weddings. And that is a Royal Wedding. Why anyone would have more than a passing interest in a fake fairy tale Disney Princess marriage to someone ...", "title": "Power Ranking Meghan Markle's Shitshow Family Members", "author": "Jerry Thornton", "date": "2018-05-16T20:30:04.000Z", "news_keywords": "meghan markle, prince harry, royal wedding, samantha markle, thomas markle, jerry thornton", "article": {"publisher": "barstoolsports"}, "og": {"url": "https://www.barstoolsports.com/blog/996943/power-ranking-meghan-markles-shitshow-family-members", "type": "article", "title": "Power Ranking Meghan Markle's Shitshow Family Members", "description": "There is only one thing I hate more than royalty and weddings. And that is a Royal Wedding. Why anyone would have more than a passing interest in a fake fairy tale Disney Princess marriage to someone ...", "image": "https://cdn.barstoolsports.com/wp-content/uploads/2018/05/16/1ffc9ccb472a9a4-822x617.jpg"}, "next-head-count": 33}, "movies": [], "publish_date": null, "source": "http://www.barstoolsports.com", "summary": ""}