{"url": "https://en.wikipedia.org/wiki/Arya_Stark", "text": "Character in A Song of Ice and Fire\n\nFictional character\n\nArya Stark is a fictional character in American author George R. R. Martin's A Song of Ice and Fire epic fantasy novel series, and its television adaptation Game of Thrones, where she is portrayed by English actress Maisie Williams. She is a prominent point-of-view character in the novels with the third most viewpoint chapters, and is the only viewpoint character to have appeared in every published book of the series.\n\nIntroduced in 1996's A Game of Thrones, Arya is the third child and youngest daughter of Lord Ned Stark and his wife Lady Catelyn Stark. She is tomboyish, headstrong, feisty, independent, disdains traditional female pursuits, and is often mistaken for a boy. She wields a castle-forged steel smallsword named \"Needle\" forged by Mikken the blacksmith of Winterfell, as a parting gift from her half-brother Jon Snow, and is trained in the Braavosi style of sword fighting by Syrio Forel.\n\nArya is among the most popular characters in the series. Williams' performance has received critical acclaim. Williams was twice nominated for a Emmy Award for Outstanding Supporting Actress in a Drama Series in 2016 and 2019.[1] She and the rest of the cast were nominated for Screen Actors Guild Awards for Outstanding Performance by an Ensemble in a Drama Series in 2011, 2013, 2014, 2015, 2016 and 2017.\n\nCharacter [ edit ]\n\nArya was born in 289 AC (\"After (Aegon's) Conquest\") as the third child and youngest daughter of Lord Eddard and Lady Catelyn Stark of Winterfell, the ruling liege of the North, and is nine years old at the beginning of the book series and 11 in season 1 of the show. She has five siblings: an older brother Robb, an older sister Sansa, two younger brothers Bran and Rickon, and an older illegitimate half-brother, Jon Snow. Through her mother, she is also first cousin to Robert Arryn, the lord paramount of The Vale; and the niece of Edmure Tully, the lord paramount of the Riverlands.\n\nArya is left-handed and talented in sums and housekeeping. In contrast to her older sister Sansa, who is more praised for favoring activities traditionally befitting a noblewoman, Arya shows no interest in the ladylike dancing, singing and sewing, and revels in outdoor activities and exploring, and is an excellent horserider. She is described as \"wolf-blooded\", blunt, impulsive and \"always difficult to tame\" by her mother Catelyn, proven to be a constant source of headache for her household tutor Septa Mordane, and given the nickname \"Arya Underfoot\" by the guards of Winterfell. Socially an outcast, she is particularly close to her bastard half-brother Jon Snow, who encourages her and gives her a smallsword as a parting gift.[2] The sword, which Arya names \"Needle\" after her dreaded embroidery lessons, is well suited to her slender build and favoring the Braavosi \"Water Dance\" (fencing) style of swordplay which emphasizes speed and agility with quick thrusting attacks. Throughout her travels, Arya displays great resourcefulness and cunning and also becomes increasingly ruthless.\n\nArya is the only one out of her full-siblings to inherit the Stark features of lean athletic physique, brown hair, grey eyes and long face (for which she was teased as \"Horseface\" by Sansa's companions), and is said to resemble her late aunt Lyanna in both looks and temperament.[3] At the start of the series, she is prepubescent and generally regarded as messy and plain-looking, and often mistaken for a boy; but there are multiple instances in the books comparing her (favorably) to the famously beautiful Lyanna,[3] and frequently catching the eyes of men (to the point of harassment) when her body starts to develop later in the series. She is also a powerful skinchanger, developing purely on her own instinct the ability to telepathically control her direwolf Nymeria when sleeping (even from a different continent), as well as a psychic bond with a street tomcat in Braavos.[4]\n\nStorylines [ edit ]\n\nNovels [ edit ]\n\nA Game of Thrones [ edit ]\n\nCoat of arms of House Stark\n\nArya adopts one of the direwolf cubs that her brothers Robb and Jon discovered in the wild, and names her \"Nymeria\" after a legendary Rhoynish warrior queen. She travels with her father, Eddard, to King's Landing when he is made Hand of the King. Before she leaves, her half-brother Jon Snow has a Braavosi-style smallsword made for her as a parting gift, which she names \"Needle\" after her least favorite ladylike activity.\n\nWhile taking a walk together, Prince Joffrey and her sister Sansa happen upon Arya and her friend, the low-born butchers son Mycah, sparring in the woods with broomsticks. Arya defends Mycah from Joffrey's torments and her direwolf Nymeria helps Arya fight off Joffrey, wounding his arm in the process. Knowing that Nymeria will likely be killed in retribution, Arya chases her wolf away;[5] but Sansa's direwolf Lady is killed in Nymeria's stead and Mycah is hunted down and killed by Sandor Clegane, Joffrey's bodyguard.[6]\n\nIn King's Landing, her father discovers Arya's possession of Needle, but instead of confiscating it he arranges for sword fighting lessons under the Braavosi swordmaster Syrio Forel, who teaches her the style of fighting known as \"water dancing\". After her father's arrest, Syrio is killed protecting her and Arya narrowly escapes capture. In her escape, she kills her first person, a stable hand who was going to turn her in to the queen, Cersei Lannister. She later witnesses the public execution of her father before falling under the protection of the Night's Watch recruiter Yoren.\n\nA Clash of Kings [ edit ]\n\nArya escapes King's Landing with Yoren and his party of recruits where she pretends to be a boy named Arry; on the road, she clashes with the other Night's Watch child recruits Lommy, Gendry, and Hot Pie, but eventually befriends them.[7] On the way, the party is attacked by Amory Lorch when Yoren refuses to yield Gendry, who is actually a bastard son of the late King Robert, to the Lannisters. The Night's Watch convoy is overrun and massacred, but Arya and the other children escape through a tunnel. Before escaping, she rescues three prisoners locked in a wagon cage, among them a mysterious man named Jaqen H'ghar.[8]\n\nArya and her friends are later captured by Ser Gregor Clegane and taken to Harrenhal as slave laborers.[9] After witnessing the torture and death of her fellow prisoners, Arya begins nightly reciting the names of the people upon whom she wishes to exact revenge. At Harrenhal she re-encounters Jaqen, now under the employ of the Lannisters, who offers to kill for her any three people she names;[10] whereupon she names two people who hurt her at Harrenhal. When Jaqen asks her to name the last target, Arya extorts him to help her free northern prisoners by naming Jaqen himself as the third person. In order to get Arya to retract the name, Jaqen stages a massive prison riot that overwhelms the Lannister garrison. Afterwards, Jaqen offers to take Arya with him, but Arya expresses a wish to go home, so he gives Arya a strange Braavosi iron coin to ensure her induction into his guild, the Faceless Men, and tells her to remember the passphrase \"Valar Morghulis\" (\"All men must die\" in High Valyrian) before leaving. The next morning Roose Bolton captures the castle, and Arya becomes his personal cupbearer. Eventually, Arya escapes Harrenhal with her friends Gendry and Hot Pie after killing a guard.[11]\n\nA Storm of Swords [ edit ]\n\nWhile Arya and her companions are making their way north, she begins dreaming of her lost direwolf, Nymeria.[4] Later, she and her companions are discovered by the guerrilla group, the Brotherhood Without Banners, and is recognized as Arya Stark.[12] At the Brotherhood's secret base, Arya encounters Sandor Clegane, where she accuses him of Mycah's murder; but the Hound survives a trial by combat and is released.[13]\n\nArya eventually escapes the Brotherhood alone, but is captured by the Hound,[14] who plans to return her to her family for a ransom.[15] They reach the Twins just as her brother and mother are killed during the Red Wedding, and Sandor knocks her unconscious to prevent her from being killed.[16] A few nights later, Arya skinchanges into Nymeria during sleep and pulls her mother's corpse out of the river for the Brotherhood to find. Later, Sandor plans to ransom her to her aunt Lysa at the Vale, but is unable to proceed due to the weather, so he decides to instead take her to her great-uncle Brynden Tully. On the way to Riverrun, they encounter two men on Arya's death list, Tickler and Polliver, who were both Gregor Clegane's men-at-arms at Harrenhal. In the ensuing fight, Arya personally stabs Tickler to death and reclaims her sword Needle from Polliver's corpse, but Sandor is severely injured. When Sandor becomes gravely ill from his wounds, Arya refuses to kill him and abandons him to die under a tree by the Trident river. She travels to the port town Saltpan and gains passage to Braavos on a merchant galleass, Titan's Daughter, by presenting the ship's captain with the iron coin that Jaqen gave her along with the Valyrian phrase \"Valar Morghulis.\"[17]\n\nA Feast for Crows [ edit ]\n\nArriving in Braavos, Arya makes her way to the headquarters of the Faceless Men, the House of Black and White,[18] where she is initiated into the guild by a priest in charge, whom she calls \"the Kindly Man\". The Kindly Man orders her to dispose of all her past possessions, and she complies by throwing them all in the river but still secretly hides her sword Needle, which is the one thing reminding her of sweet childhood memories. For her training, Arya adopts the identity of \"Cat of the Canal\", a street child who helps sell seafood, and continues having increased and more frequent vivid wolf-dreams, which further prevents her from discarding her old identity.[19] During her training, she briefly meets, and saves, Samwell Tarly and later murders the Night's Watch deserter Dareon.[20] After admitting her unauthorized killing to her mentor, she is given a cup of \"burnt-tasting\" milk to drink; and the next morning, she wakes up blind.[21]\n\nA Dance with Dragons [ edit ]\n\nArya remains blind in the service of the House of Black and White for half a year. She continues to dream through the eyes of her direwolf Nymeria, but speaks of it to no one. While she is blind, Arya wanders the streets of Braavos under the identity of \"Beth\", a blind beggar girl, and becomes better at sensing without her eyes, as well as lying and detecting the lies of others.[22]\n\nAfter skinchanging into a stray tomcat that followed her back to the temple, Arya is able to identify the Kindly Man as the person who sneak-attacks her with a stick every night and later surprise-hits him. For this achievement, she passes the test and regains her vision,[22] and is given her first assassination assignment. When she successfully poisons a crooked insurance salesman without rousing any suspicion or collateral damage, the Kindly Man gives Arya an acolyte's robe and assigns her to begin her first apprenticeship inserted within a theatrical group.[23]\n\nThe Winds of Winter [ edit ]\n\nAn excerpt chapter from the yet-to-be-published sixth book of the series, named \"Mercy\", was released on George R. R. Martin's official website on March 27, 2014.[24][25] In the chapter, Arya assumes the identity of an apprentice stage actress under the alias Mercedene (or \"Mercy\" for short). She performs in a Braavosi theatrical play, The Bloody Hand, a dramatized parody of the recent Westerosi political events in King's Landing, in which she plays a maiden who is the rape victim of the titular evil dwarf Hand (a demonized version of Tyrion Lannister).\n\nWhen the Westerosi treasurer Harys Swyft arrives in Braavos with an envoy to negotiate with the Iron Bank for loans, Arya's theatre group is employed to perform the play to entertain the guests. As the play is about to begin Arya recognizes one of the envoy guards as Rafford (also known as Raff the Sweetling), a former subordinate of Gregor Clegane who killed her injured friend Lommy. She seduces Rafford and lures him to her own room, before slicing his femoral artery, rendering him unable to walk. When Rafford begs for a healer, Arya cuts his throat in the same fashion as he had killed Lommy and throws his corpse into a canal. She heads back to perform the play, knowing this murder will most likely ruin her Mercedene identity.\n\nFamily tree of House Stark [ edit ]\n\nTelevision series [ edit ]\n\nLeft: Arya's\n\nRight: The costumes worn by Arya and her companion Sandor Clegane in the TV series Game of Thrones. Arya's smallsword \"Needle\" as shown in the TV series.The costumes worn by Arya and her companion Sandor Clegane in the TV series\n\nArya Stark is portrayed by English actress Maisie Williams in the television adaption of the book series, this being Williams' first role as an actress.[26] Williams was chosen from among 300 actresses across England.[27]\n\nSeason 1 [ edit ]\n\nArya accompanies her father Ned and her sister Sansa to King's Landing. Before their departure, Arya's half-brother Jon Snow gifts Arya a sword which she dubs \"Needle\". On the Kingsroad, Arya is sparring with a butcher's boy, Mycah, when Sansa's betrothed Prince Joffrey Baratheon attacks Mycah, prompting Arya's direwolf Nymeria to bite Joffrey. Arya shoos Nymeria away so she is not killed, but is furious when Sansa later refuses to support her version of events. Mycah is later killed by Joffrey's bodyguard Sandor \"The Hound\" Clegane, earning him Arya's hatred. Ned arranges for Arya to have sword lessons with the Braavosi Syrio Forel, who later defends her from Ser Meryn Trant after Joffrey ascends to the throne and kills the Stark household. Arya flees the Red Keep, accidentally killing a stable boy in her escape, hiding out as a beggar in the streets of King's Landing. Ned is eventually taken to the Great Sept of Baelor to face judgment; he spots Arya in the crowd, and alerts the Night's Watch recruiter Yoren to her presence. Yoren prevents Arya from witnessing Ned's execution and has her pose as a boy, \"Arry\", to avoid detection as she joins Yoren's recruits traveling north to Castle Black.\n\nSeason 2 [ edit ]\n\nThe recruits are attacked by Lannister soldiers under Ser Amory Lorch, who have been ordered by Cersei Lannister to kill Robert Baratheon's bastard Gendry, who is part of the party. Needle is confiscated by a soldier, Polliver, who uses it to kill Arya's friend Lommy Greenhands (who Arya later claims is Gendry). The recruits are taken to Harrenhal, where Tywin Lannister recognises Arya is a girl instead of a boy and takes her as his cupbearer. Jaqen offers to kill three people for Arya as reward for saving his life and those of his cellmates during the attack; Arya picks Harrenhal's torturer The Tickler and Ser Amory. When Arya is unable to have Tywin killed before his departure, she has Jaqen help her, Gendry and her friend Hot Pie escape. Jaqen offers to take Arya to Braavos to join the Faceless Men assassin guild, and although she declines he gives her an iron coin that will allow her to obtain passage to Braavos.\n\nSeason 3 [ edit ]\n\nArya, Gendry, and Hot Pie encounter Thoros of Myr, a Red Priest who is a member of the Brotherhood Without Banners, a group of men sent by Ned to restore order in the Riverlands. As Thoros takes them to the Brotherhood's hideout they encounter the Hound, a captive of other Brotherhood men. The Hound is brought before the Brotherhood's leader, Ser Beric Dondarrion, and after Arya accuses him of Mycah's murder Beric sentences him to trial by combat. The Hound wins, to Arya's fury, and is released by Dondarrion. Arya is further enraged when the Brotherhood sells Gendry to Melisandre. She escapes the Brotherhood soon afterward only to be captured by the Hound, who intends to take her to The Twins to ransom her to her brother Robb. However, as they arrive the Freys betray the Starks and slaughter their forces, with Arya barely escaping the massacre. In the aftermath of their escape, Arya encounters a Frey soldier bragging about his role in desecrating Robb's corpse. Arya stabs the soldier to death, marking the first time she has deliberately killed another person.\n\nSeason 4 [ edit ]\n\nArya and the Hound encounter Polliver in a tavern; Arya reclaims Needle and uses it to kill Polliver to avenge Lommy. They also encounter Rorge and Biter, Jaqen's fellow prisoners, and Arya kills Rorge after recalling he had threatened to rape her. The Hound takes Arya to the Vale to ransom her to her aunt Lysa Arryn, only to be turned away at the Bloody Gate when they are informed that Lysa has apparently committed suicide. Returning from the Bloody Gate, they are approached by Brienne of Tarth, who had sworn to Catelyn Stark to take Arya to safety. Distrusting Brienne's allegiances, the Hound attempts to kill her but Brienne defeats the Hound and he is seemingly mortally wounded. Arya manages to hide from Brienne in the confusion, and after Brienne leaves, Arya takes the Hound's silver, leaving him to die. She then encounters a Braavosi captain, who offers her passage to Braavos after she gives him the iron coin.\n\nSeason 5 [ edit ]\n\nArya arrives in Braavos and is accepted into the House of Black and White by a man who wears Jaqen H'ghar's face. After impressing Jaqen with her ability to lie undetected by convincing a terminally ill girl to drink poison, Arya is given the assignment of assassinating a corrupt insurance salesman. However, she is distracted from her mission by the arrival in Braavos of Ser Meryn Trant. Assuming the identity of the girl she had poisoned, Arya disguises herself as a prostitute and infiltrates a brothel, where she kills Meryn. However, when she returns to the House of Black and White she is caught by Jaqen, who chides that Arya has not dissociated from her identity and that as a result wearing another person's face will poison her. Arya is subsequently struck blind.\n\nSeason 6 [ edit ]\n\nA blind Arya is forced to beg on the streets of Braavos. Her fellow acolyte, the Waif, arrives daily to attack her. Eventually, Jaqen brings Arya back to the House of Black and White and restores her vision. She is tasked to assassinate an actress named Lady Crane but seeing Lady Crane is a decent person, Arya has a change of heart at the last minute and warns Lady Crane of the attempt on her life. The Waif witnesses this disobedience and is given permission by Jaqen to kill Arya. Aware that she is now in danger, Arya retrieves her sword Needle from its hiding place. She arranges for passage out of Braavos but is stabbed by the Waif and barely escapes. Lady Crane nurses Arya back to health, but the Waif reappears, kills Lady Crane and pursues a recovering Arya. Arya leads the Waif to her quarters underneath Braavos and extinguishes the candle in the room, using her experience fighting blind to give her the upper hand and kill the Waif. Arya removes the Waif's face and adds it to the Hall of Faces before telling an impressed Jaqen that she is Arya Stark, and returns to Westeros.\n\nArya travels to the Twins, assuming the identity of a servant girl. She kills Lord Walder Frey's sons, Black Walder Rivers and Lothar Frey, before cooking them in a pie that she serves to Walder Frey. After revealing her subterfuge and her true identity to Walder, she cuts his throat, avenging her brother Robb, her mother Catelyn and the northern army murdered at the Red Wedding.\n\nSeason 7 [ edit ]\n\nTaking the face of Walder Frey, Arya gathers the men of House Frey for a feast before killing them all with poisoned wine. Arya then journeys south, intending to travel to King's Landing to assassinate Cersei (now Queen of the Seven Kingdoms following the extinction of House Baratheon). However, Arya changes her mind after learning from Hot Pie that Jon has ousted House Bolton from Winterfell and has been crowned King in the North, and decides to return to her ancestral home. Along the way, she encounters a wolf pack led by her long-lost direwolf Nymeria. Nymeria recognizes Arya, but she has grown feral and turns away when Arya asks her to return North with her.\n\nArriving at Winterfell, Arya finds that Jon has traveled to Dragonstone but is reunited with Sansa and Bran. Bran reveals his knowledge of Arya's kill list through greenseeing and presents her with a Valyrian steel dagger, which had been given to him by Littlefinger. Arya is also reunited with Brienne, who continues to serve the Starks, and manages to equal the female warrior during sparring despite her smaller size.\n\nLittlefinger seeks to increase his influence on Sansa by driving a wedge between the Stark sisters. To this end, he allows Arya to witness him receiving a confidential message obtained from Maester Luwin's records. Arya breaks into Littlefinger's quarters to steal the message, which is a plea sent by Sansa following Ned's imprisonment to Robb imploring him to bend the knee to Joffrey. Outraged, Arya confronts Sansa and is unconvinced by her explanation that she did so to try and save Ned's life. Later, Arya catches Sansa looking at her collection of faces and threatens Sansa before leaving.\n\nSome time later, Sansa summons Arya to the great hall and begins an accusation of treason and murder. However, the accusation is directed towards Littlefinger, whose crimes have been discovered by Bran's greenseeing. Despite Littlefinger's pleas for mercy, Sansa sentences Littlefinger to death and Arya cuts his throat with the Valyrian steel dagger thus avenging her family and getting justice. The Stark sisters later resolve their differences, and acknowledge that the Starks must stay together to survive winter.\n\nSeason 8 [ edit ]\n\nArya reunites with Jon, Gendry, and the Hound, who have all journeyed to Winterfell with Daenerys Targaryen's forces to make a stand against the approaching White Walkers. Arya asks Gendry, who is forging dragonglass into weapons, to make her a special dragonglass staff. When Gendry gives it to Arya, he tells her he is the bastard son of Robert Baratheon. Aware of their chances of dying in the upcoming battle and Arya wanting to experience sex, Arya and Gendry sleep together. Later that night, Arya hears the signal alerting her that the White Walkers' army has arrived.\n\nArya fights in the battle against the dead with the Hound and Beric Dondarrion. Beric sacrifices himself to allow Arya and the Hound to escape the wights. A battered Arya sprints through the corridors of Winterfell and encounters Melisandre, who suggests to Arya that she is meant to kill the Night King. In the Godswood, just as the Night King is about to kill Bran, Arya sneaks up and stabs the Night King with the Valyrian steel dagger Bran gave her. Upon killing the Night King, the White Walkers and wights are all destroyed.\n\nIn the aftermath of the battle, Gendry is legitimised as a Baratheon by Daenerys and proposes to Arya. Arya declines, as she does not want the life of a lady. Sansa and Arya tell Jon they don't trust Daenerys, but Jon defends her. Arya learns that Jon is the son of her aunt, Lyanna Stark, and Rhaegar Targaryen after Jon swears her and Sansa to secrecy about his true parentage.\n\nArya journeys south to King's Landing with the Hound to kill Cersei. The two infiltrate the Red Keep with the civilians Cersei is using to deter Daenerys' attack. Despite the city's surrender to Daenerys, she lays waste to the populace atop of Drogon. The Hound seeks out his brother, the Mountain, in his quest for revenge against his brother but urges Arya to leave and give up her own quest for revenge to avoid a life consumed by it. Arya sincerely thanks the Hound, calling him 'Sandor'. She tries and fails to save the smallfolk as Daenerys burns the city. Arya narrowly survives the attack. In the aftermath, Arya is reunited with Jon and she warns that he and the Starks are not safe from Daenerys while Tyrion says Daenerys is now the people's biggest threat. Jon tries but is unable to dissuade Daenerys from further destruction and ultimately assassinates her. He is imprisoned. Weeks later, Arya joins the other lords and ladies of Westeros in a council to decide who shall lead the Seven Kingdoms. Bran is chosen as king, though Arya abstains from voting as Sansa declares the North's independence. Arya, Sansa, and Bran bid Jon farewell as he is exiled.\n\nArya reveals that she is leaving Westeros to see what lies west of the continent. She embarks on her voyage aboard a Stark ship and reflects on her family.\n\nAnti heroine [ edit ]\n\nArya can be regarded as an anti heroine,[28] Sophie Heawood of The Guardian described Arya's eight season character arc as a journey \"from cute little sister to ruthless serial killer (of 64 victims)\", and said that Arya was \"the serial killer everyone's rooting for.\"[29] A young character who witnesses both the unfair execution of her father and the immediate aftermath of her mother and brother's murder (including the parading of the latter's desecrated corpse), Arya works her way through a revenge death list of names of those responsible for killing all the people she cared about.[30][31][32] After six seasons of battling alone she reunites with her family as a weapons expert and trained assassin.[33][34] When the expected heroes and armies of the living appear defeated in the longest battle scene in film and television history, Arya Stark is the hero that saves the entire fictional continent of Westeros by using her prowess as an assassin to kill the Night King (the \"god of death\") which causes the simultaneous eradication of his vast undead army.[35][36][37][38] Arya killing the Night King was nominated for the 2020 BAFTA TV Awards under the \"Must-see moment\" category.[39]\n\nReception and awards [ edit ]\n\nArya is among the most popular characters in either version of the series.[40][41] Williams' performance in Game of Thrones has received critical acclaim, particularly in the second season for her work opposite veteran actor Charles Dance (who played Tywin Lannister) when Arya served as Tywin's cupbearer.[42]\n\nWilliams has received several award nominations for her portrayal of Arya. For her performance in the series she received two Portal Awards for Best Supporting Actress and Best Young Actor in 2012,[43] an EWwy Award for Best Supporting Actress in a Drama Series in 2014,[44] and a Saturn Award for Best Performance by a Young Actor in a Television Series in 2015.[45]\n\nWilliams was nominated for a Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series in 2016 and 2019.[46] Other nominations include the Portal Award for Best Young Actor in 2011,[47] the SFX Awards for Best Actress in 2012 and 2015,[48][49] the Gold Derby TV Awards for Breakthrough Performer of the Year in 2012,[50] the Young Artist Award for Best Performance in a TV Series by a Supporting Young Actress in 2013,[51] the EWwy Award for Best Supporting Actress in a Drama Series in 2015,[52] and the Saturn Award for Best Performance by a Young Actor in a Television Series in 2016.[53]\n\nPopularity and cultural impact [ edit ]\n\nThe personal forename Arya is an existing real world name for both sexes of Sanskrit and Persian origins long used in South Asia.[54][55] Following the start of the TV series, in 2012, the name Arya became the fastest-rising baby girl's name in the U.S., jumping in popularity from 711th to the 413th position, largely due to the popularity of Williams' character \"Arya Stark\".[56][57] The name maintained its popularity in 2019. It was ranked 92 in the U.S. and its variation Aria was listed at 20.[58][59] The name also entered the top 200 most commonly used names for baby girls born in England and Wales in 2017.[60][61][62]\n\nThe 2017 international hit \"Look What You Made Me Do\" by American singer-songwriter Taylor Swift was partially inspired by Williams's Arya, with the line \"I've got a list of names and yours is in red, underlined\" inspired by her kill list, and Canadian rapper Drake thanked Arya Stark for killing the Night King during his acceptance speech at the 2019 Billboard Music Awards.[63][64] Williams was also one of ten actors from Game of Thrones featured in character in a collection of Royal Mail first class postage stamps. The set which celebrates British contributions towards the show was released to the UK Post Office in January 2018.[65][66][67]\n\nArya Stark appears as a playable character in the 2022 platform fighting game MultiVersus, with Maisie Williams vocally reprising her role.\n\nReferences [ edit ]\n\nThis article incorporates text available under the CC BY-SA 3.0 license.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/b/bf/CC_BY-SA_icon_80x15.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Global_thinking.svg/10px-Global_thinking.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Game_of_Thrones_Oslo_exhibition_2014_-_Arya%27s_and_the_Hound%27s_costumes.jpg/283px-Game_of_Thrones_Oslo_exhibition_2014_-_Arya%27s_and_the_Hound%27s_costumes.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/A_Song_of_Ice_and_Fire_arms_of_House_Stark_running_direwolf_white_scroll.png/150px-A_Song_of_Ice_and_Fire_arms_of_House_Stark_running_direwolf_white_scroll.png", "https://upload.wikimedia.org/wikipedia/en/thumb/3/39/Arya_Stark-Maisie_Williams.jpg/220px-Arya_Stark-Maisie_Williams.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Maisie_Williams_%2819647942976%29_%28cropped%29.jpg/170px-Maisie_Williams_%2819647942976%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/3/39/Arya_Stark-Maisie_Williams.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/3/39/Arya_Stark-Maisie_Williams.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Arya_Stark", "title": "Arya Stark", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/3/39/Arya_Stark-Maisie_Williams.jpg", "width": 640, "height": 861}, "title": "Arya Stark - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}