{"url": "http://time.com/5137456/kate-upton-paul-marciano-interview/", "text": "As with so many other #MeToo moments, it began with a tweet. On Jan. 31, supermodel Kate Upton wrote, “It’s disappointing that such an iconic women’s brand @Guess is still empowering Paul Marciano as their creative director #metoo.” In an interview with TIME, Upton detailed her claims against Marciano, co-founder and former CEO of Guess, who she says assaulted and began harassing her during her first professional modeling campaign when she was 18.\n\nHarassment has plagued the fashion industry for decades, but allegations have often been ignored. Many models work as independent contractors and have few legal protections; last month lawmakers introduced a bill in New York that would hold designers, retailers and agencies accountable for abuses.\n\nIn a statement to TIME, Marciano called Upton’s accusations “absolutely false” and “preposterous.” “I have never been alone with Kate Upton,” he said. “I have never touched her inappropriately. Nor would I ever refer to a Guess model in such a derogatory manner.”\n\nHe added: “I fully support the #metoo movement. At the same time, I will not allow others to defame me and tarnish my reputation. I have pledged to Guess and its Board of Directors my full support and cooperation with a fair and impartial investigation.” A representative from Guess declined to comment.\n\nPhotographer Yu Tsai says he witnessed the harassment Upton describes and corroborated details of her allegations.\n\nTIME: What happened with Paul Marciano?\n\nKate Upton: After the first day of shooting the Guess Lingerie campaign [on July 25, 2010], Paul Marciano said he wanted to meet with me. As soon as I walked in with photographer Yu Tsai, Paul came straight up to me, forcibly grabbed my breasts and started feeling them — playing with them actually. After I pushed him away, he said, “I’m making sure they’re real.”\n\nDespite doing everything I could physically do to avoid his touch throughout the meeting, he continued to touch me in a very dominating and aggressive way, grabbing my thighs, my arms to pull me closer, my shoulders to pull me closer, my neck, my breasts, and smelling me. He then told Yu Tsai to leave us alone. I was able to send a quick text to Yu Tsai asking him to stay. He did, but that did not stop Paul’s constant grabbing. I was extremely shaken, surprised and scared.\n\nAt one point he forcibly grabbed the back of my head so that I could not move and started kissing my face and my neck. I remember not wanting to say “Get off of me” because I didn’t want to open my mouth to say anything because I didn’t want him to be able to put his tongue in my mouth. I had two options: do everything I could to wiggle away and avoid his pursuit, or punch the CEO of Guess. So I decided to just wiggle away.\n\nThen Paul insisted that he walk me up to my hotel room. I immediately declined. The only thing I was thinking is if he touches me like that in public, I can’t imagine what he’d try to do in private. Thankfully, Yu Tsai stepped in and insisted he’d do it. I was so relieved and felt like I had barely escaped.\n\nThe next Guess shoot I worked on was about a month later. As soon as I went up to my hotel room, Paul started calling me asking to come up and see how my room is. I politely declined several times.\n\nHe continued to insist. He said he was already in the hotel lobby. He even called my room from the hotel lobby desk. After several denials, I just turned off my phone and locked the door and tried to get some sleep. I was terrified. All I could think was if he was able to get into my room it would not be good.\n\nThe next day, I learned that I had been fired from the shoot. Someone had called my agency to say I had gotten fat and would not be needed on set [that day]. I was devastated, especially because at this point no one from Guess had even seen me.\n\nBut Guess continued asking you to work with them after that.\n\nI talked to Yu Tsai about how scared I was and said I couldn’t do it anymore. I couldn’t shoot anymore if this was how it was going to work. We came up with a plan that anytime Paul invites himself to my room, I would text Yu Tsai to be there so that I was never alone in a room with him. I was still very nervous and scared because clearly Paul was comfortable with touching me in front of him. But Yu Tsai assured me that he would look out for me, so that’s what we did.\n\nAfter that, Paul was reaching out to me constantly, always in communication about my next shoot. But I wouldn’t officially be booked until a few days before the actual shoot. It made me feel that if I cut off communication with him, I wouldn’t be booked again. Paul’s texting increased, telling me how excited he was to see me, that he wanted me to change in front of him so he could see my naked body getting into his clothes. He asked if I thought of him when I was posing sexy on set.\n\nAll the language he used was extremely dominant and possessive. At one point, to avoid Paul coming to set, I told him my boyfriend was going to be there. He was absolutely furious at that. It was an emotional and non-stop battle of games, power struggles and creative avoidance tactics.\n\nThen in what seemed to be retaliation, Yu Tsai was fired from the next shoot, which was Guess Jeans [between Sept. 30 and Oct. 2, 2010]. That’s when I worked with the photographer Ellen von Unwerth. Paul’s behaviors became much more aggressive without Yu Tsai there as a buffer. My denials to Paul had to be much more direct. Then I was told the morning of the shoot I was not needed on set and was fired again. I believe that Ellen insisted that I come anyway.\n\nEllen and I rode together on the way back to the hotel. I remember her asking me if I was friends with Paul because he seemed to really like me. I wasn’t sure how much was safe to reveal, so I told her that I appreciated the opportunities Paul had given me to be a part of his campaign, but I think that maybe he liked me a little too much.\n\nWhen we arrived at the hotel, Paul came right up to me, grabbed me hard by my arm and insisted he was taking me to dinner, just him and I, to celebrate the campaign. Ellen picked up on this, literally grabbed my other arm, and invited herself by saying she was so excited to celebrate the campaign with us. Paul told her she was not invited to dinner, and I felt like she saved me by pulling me away from him and jokingly walking me to the elevator, saying, “Well if I’m not going, Kate’s not going.” I have always been so grateful to Ellen for doing that. [A representative for von Unwerth said she supported Upton but did not recall the particular incident.]\n\nAfter that he was extremely upset. I had a final shoot [in May of 2011], and he was outwardly rude and degrading the entire time. He said I was “disgusting” and started telling people how unprofessional I was by spreading rumors that I was drunk on set and partying every night, which of course I wasn’t. I was then told to leave because Paul had said, “Get that fat pig off my set.”\n\nWhat happened after you stopped working with Guess in 2011?\n\nI went on to be extremely successful because of my Sports Illustrated cover. Guess Jeans reached out to my agency and offered me their campaign again in 2012. Typically, Guess pays well below industry standards since they like to say they like to launch young models’ careers. But for this campaign, they offered me $400,000, which at the time was their highest paying offer ever.\n\nI remember I had an internal struggle over this offer. I was hoping after my consistent denials and successful career, that Paul would treat me with professionalism. But as we got closer to the shoot date, Paul began texting that he would make sure to be on set. He told me that I wasn’t allowed to bring my boyfriend. I just couldn’t do it. I refused the campaign. I couldn’t accept the money. I walked away about a week before the shoot was scheduled.\n\nHow did the experience impact you?\n\nIt took a huge toll on my confidence and self-worth. I wanted to quit modeling. I constantly blamed myself after it happened: What am I doing to invite someone to treat me like that or grab me like that? I wondered if it was how I was presenting myself or what I was wearing. I started slumping my shoulders to hide my breast size, wearing baggy clothes, started despising my own body.\n\nOver time, you minimize and internalize your experiences. You chalk it up to, “This is how it is.” And you go through this gut-wrenching struggle of, “How much of myself am I required to sacrifice?” I got through it because of the strong support of my family and close friends.\n\nI’m sick of being silenced and expected to sweep everything under the rug. I’m sick of being expected to laugh off these aggressive advances and accept the power imbalances that exist. I’m sick of being expected to endure all of this while being polite and professional through it all.\n\nPaul used his power to make me feel insecure and powerless, but I’m not going to let him intimidate me anymore. These men think they are untouchable, but times are changing.\n\nOn a fashion shoot, is it clear how you can report abuse?\n\nNo, not at all. You have no idea who to tell. And you’re constantly told about the models who are O.K. with this behavior and how successful they are. So you’re pressured to be O.K. with it.\n\nWhat needs to change about the industry to prevent these abuses of power?\n\nThe culture of complacency and tolerance in our industry needs to stop. People know what is going on and have previously accepted it. And we can’t always require the victims to be the ones to speak up and tell their story because the victims only know their one story. The people around in the corporate offices or around the harassers every day know of every time they do this. They’re the ones who need to speak out.\n\nAlso, right now, everyone around models is incentivized to tell them not to ruffle any feathers. If the models don’t get paid, the agencies and managers and everyone around them doesn’t get their cut. Agencies need to be stronger when they hear these stories. They’re saying, “Oh, Kate’s not O.K. with this” and bringing in the next model. The next model needs to know why I’m not O.K. with this.\n\nThe response from some [to this movement] has been, “It’s not that bad” or “other men are much worse than him” or “at least it wasn’t rape.” Those are unacceptable statements. That’s our only line? At least he didn’t rape her? That’s a scary office to be in.\n\nWe shouldn’t have to take a step back to a time when women weren’t invited to networking events or one-on-one meetings. I don’t want an environment where women can only work with women or vice versa. Good men do exist. I’m very lucky to know that because of my wonderful husband and father and brother. But we need to make sure we’re hiring men with respect for women — not their bodies, but their minds and professionalism.\n\nSome harassers in fashion have defended themselves by saying that the lines are blurred when you’re shooting a sexy photo.\n\nHonestly, fashion is not any different from any industry. When I come on set, I’m very professional, everyone around me is very professional. Not even stylists touch my body without my consent. They ask me before they do.\n\nNobody has a right over my body just because they view me as sexy or a sex icon. I think people need to be educated on the definition of consent. I don’t think there are any blurred lines in this. I don’t think you should be touching people at the workplace, and I don’t think you should be sexually speaking to a model as they’re doing their profession.\n\nI’m not thinking of any man while I’m on a shoot. The reason I’m there and the reason I’m feeling sexy is because I’m empowering myself. This is my body and my workplace. I am just doing my job.\n\nWrite to Eliana Dockterman at eliana.dockterman@time.com.", "images": ["http://time.com/img/icons/metamask.png", "https://api.time.com/wp-content/uploads/2021/02/black-history-movies-01.jpg?quality=85&w=160&h=106&crop=1", "https://api.time.com/wp-content/uploads/2018/02/kate-upton-guess-me-too.jpg?quality=85&w=1200&h=628&crop=1", "https://api.time.com/wp-content/uploads/2018/02/kate-upton-guess-me-too.jpg?quality=85&w=2405", "http://time.com/img/loading-circle.gif", "https://api.time.com/wp-content/uploads/2018/02/gigi-hadid-nyfw.jpg?quality=85&w=160&h=106&crop=1", "http://time.com/img/icons/crypto-wallet.png", "http://time.com/img/icons/wallet-connect.png"], "top_img": "https://api.time.com/wp-content/uploads/2018/02/kate-upton-guess-me-too.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Eliana Dockterman"], "canonical_link": "https://time.com/5137456/kate-upton-paul-marciano-interview/", "title": "Kate Upton Details Alleged Harassment by Guess' Paul Marciano", "meta_data": {"robots": "max-image-preview:large", "format-detection": "telephone=no", "viewport": "width=device-width, initial-scale=1", "description": "Kate Upton says Guess co-founder Paul Marciano groped and harassed her when she was 18. In a new interview, she details her accusations.", "og": {"title": "'I'm Not Going to Let Him Intimidate Me Anymore.' Kate Upton Speaks Out on Alleged Harassment by Guess Co-Founder", "type": "article", "site_name": "Time", "url": "https://time.com/5137456/kate-upton-paul-marciano-interview/", "description": "The supermodel says Paul Marciano repeatedly groped and harassed her when she was 18", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/02/kate-upton-guess-me-too.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5137456/kate-upton-paul-marciano-interview/", "description": "Kate Upton says Guess co-founder Paul Marciano groped and harassed her when she was 18. In a new interview, she details her accusations.", "media": "https://api.time.com/wp-content/uploads/2018/02/kate-upton-guess-me-too.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5137456/kate-upton-paul-marciano-interview/", "title": "'I'm Not Going to Let Him Intimidate Me Anymore.' Kate Upton Speaks Out on Alleged Harassment by Guess Co-Founder", "description": "The supermodel says Paul Marciano repeatedly groped and harassed her when she was 18", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/02/kate-upton-guess-me-too.jpg?quality=85&w=1200&h=628&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}, "recaptcha-key": "6LfZrtgZAAAAAJ8n221oa1YgG6cVvoOPgamCm6oT"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}