{"url": "https://www.vulture.com/2018/03/this-is-us-chronological-timeline.html", "text": "Photo-Illustration: Vulture/Photos by NBC and Ron Batzdorff/NBC/NBCU Photo Bank/Getty Images\n\nOver six seasons, NBC’s weepy family drama This Is Us presented the multigenerational saga of the Pearsons, a family full of people with an affinity for emotional speeches and nice, long cries. It was a saga that continually expanded, connected, and circled back through the past, present, and future until its very last episode. Keeping a timeline like that straight can feel like an overwhelming task. Honestly, who has time to think about dates and what happened before that other thing when there is so much crying to be done?\n\nAdmittedly, me. I do. I’ve recapped 106 episodes of this show, so I figure I might as well put all that Pearson knowledge to good use, sorting out all the major This Is Us moments chronologically. I’ve added actual dates where I can, but for some of them, I had to make my best guess. Know that investigation of facial hair length is a real and wonderful thing.\n\nAdditions from the final season are noted with a ➽.\n\nJack Pearson’s grandfather arrives in New York City.\n\nAs Kevin explains, the man has a son who has a son who has the Big Three. So he’s the dude who is to blame for all the crying. Mystery solved.\n\nWilliam Hill’s father dies overseas and leaves behind a pregnant war widow.\n\nBut not before singing the sweetest version of “You Are My Sunshine.” It’s obvious where Young William gets his musical talent.\n\nWilliam Hill is born.\n\nHe’s born with the gift of poetry, and eventually uses it to achieve minor success while in a cover band with his cousin Ricky. It is the first “almost” and “could’ve been” in a life full of them. Raise your hand if you downloaded William’s song “We Can Always Come Back to This” and listened to it on repeat. And if you didn’t, don’t judge.\n\nOctober 18, 1948 (11:58 p.m., if you want to be exact): Nicky Pearson is born.\n\nAlmost immediately, Jack Pearson takes full responsibility for keeping his younger brother safe from life in general, and their angry, abusive dad (who wasn’t always that way!) specifically. Mr. Pearson grows more awful by the day, and is especially tough on Nicky, and so Jack spends most of his childhood standing up for his mother and brother. Jack is superman, Nicky always in need of rescuing.\n\nThe Pearsons are just out there slicing ice cream like it’s cake.\n\nIt’s one of the few childhood memories involving Stanley that the Pearson brothers can look back on fondly.\n\nRebecca watches a woman stare at John Singer Sargent’s Madame X at the Met.\n\nRebecca’s only around 8 or 9 years old here, but the image of this woman staring at a painting stays with her.\n\n➽ The Rivas family moves from Puerto Rico to East Liberty, Pittsburgh.\n\nWe don’t know the exact year Miguel started his life in the U.S., but he’s old enough to immediately feel as though he’s been split in two, a feeling that stays with him for the rest of his life.\n\nStanley ruins baseball, driving, and probably fatherhood for Jack.\n\nNot only is Stanley a monster when it comes to Jack’s baseball dreams, but he gets so drunk at one of his games that he forces the kid to drive them home in one of the most white-knuckle rides of Jack’s life.\n\nWilliam moves to Pittsburgh.\n\nHe promises his cousin that he’ll be back once he tends to his sick mother, but we all know that never happens. This is a huge move which sets into motion … well, everything.\n\nRebecca rocks bangs, smashes the patriarchy.\n\nAfter years of watching her mother serve her father, Rebecca has zero time for high-school home-economics class and instead joins shop class. She’ll meet her high-school boyfriend Alan there — poor Alan gets dumped by Rebecca multiple times.\n\nSummer 1969: Man walks on the moon; Nicky has a whirlwind romance that ends in heartbreak\n\nInspired by Neil Armstrong’s incredible feat, Nicky asks his crush and co-worker Sally out. They fall in love, but when she asks him to travel across the country with her, he balks. He’s scared of rejection, scared of leaving his parents alone together, just scared of everything, really.\n\nThanksgiving 1969: Jack and Nicky have the best day ever.\n\nJack and Nicky escape another truly terrible Thanksgiving and instead use Nicky’s football-bet winnings to buy and eat five pounds of shrimp. They end the night with Nicky explaining the devastatingly romantic meaning behind Leonard Cohen’s “So Long, Marianne,” and the brothers promise to make this evening their new Thanksgiving tradition for years to come. Things don’t work out as planned.\n\nDecember 1, 1969: Nicky gets drafted into the Vietnam War.\n\nNicky’s birth date gets pulled fifth in the lottery, so there’s no question he’ll be going over to fight. Jack attempts to help Nicky flee to Canada, but ultimately, Nicky decides he’s not running from this. He becomes a medic in the army and things go bad fast.\n\n1970: Jack enlists in order to save his brother.\n\nRemember when we said Jack was superman? We are not lying. After receiving a distressing letter from Nicky, Jack decides to enlist, even though he was considered a 4F (unfit for war) because of his irregular heartbeat. (Jack has heart problems — hmmm, where have we heard this before? Hint: the future.) Jack gives a speech while in his underwear at the doctor’s office about having to at least be in the same place as Nicky because that’s what brothers do. People across America are confused about how to feel throughout this scene.\n\nFall 1971: Staff Sergeant Jack Pearson learns a calming trick that will come in handy in the future.\n\nAfter tragedy befalls Jack’s unit, his friend Robinson, who has to be airlifted out after losing his foot, holds Jack’s face and tells him to breathe in order to calm down — something he’ll use when his son Randall starts having anxiety as a child. Yes, there are a few things Jack doesn’t come up with on his own.\n\nNovember 1971: Jack finds Nicky and takes him under his care.\n\nNicky is struggling — he’s been “Article-15’d” for dangerous behavior and is not happy to see his brother. He wants to be left alone. That’s not really in Jack’s DNA, so he pleads with Nicky’s CO to let him take his brother back to the ville he’s stationed at for two weeks and try to straighten him out. The CO is no match for an impassioned Jack Pearson speech and allows it.\n\nThanksgiving 1971: Jack receives a very important piece of jewelry.\n\nJack’s time with Nicky is not going well. When a Vietnamese boy in the ville gets injured, Nicky refuses to help him and chides Jack when he does. On the one hand, the incident reveals just how far gone Nicky is, but on the other, the mother of the boy gives Jack her necklace — a Buddhist symbol of purpose — that becomes very important in the Pearson family mythology.\n\nA nightmare situation takes place in Vietnam and the Pearson brothers are never the same.\n\nOne morning, while high, Nicky befriends a boy in the ville and accidentally blows him up with a grenade. He’s too shocked to explain what happened before he’s medevaced out of Vietnam and lands in a vet hospital for a while. Jack believes his brother did it on purpose and never forgives him. He tells everyone Nicky died in the war. Which, emotionally speaking, isn’t wrong.\n\nJack returns from the Vietnam War.\n\nHe’s forced to take a series of odd jobs that are at times deflating, and even turns to some high-stakes card-playing, but all of this leads to one very important moment …\n\nDecember 23, 1972: Jack and Rebecca meet!\n\nThe world may remember this date for the Immaculate Reception in the AFC divisional playoffs, but This Is Us fans know it as the night Jack heard Rebecca singing “Moonshadow” and shrugged off a potential life of crime because he fell in love at first sight (sound?). They go on a horrible first date that Jack saves in the end (doesn’t he always?) by telling her that she feels like home to him. It’s all very swoony and they have their first kiss and Rebecca is super into it. Thank goodness, right?\n\nJack moves his mother out of their house as his father’s abuse gets worse.\n\nUnfortunately, this probably doesn’t stick. There are also some historical inaccuracies happening here, in case you’re into that sort of thing: This is supposed to be the day after Jack and Rebecca’s date on December 23, but the trees in Pittsburgh are very green, there’s like one Christmas wreath to be found, and Jack’s dad is watching Nixon sign the first SALT agreement at the May 1972 summit in Moscow. Come on This Is Us, get your timelines straight!\n\nJack and Rebecca do the dishes together for the first time.\n\nJack and Rebecca doing the dishes together is iconic, you guys.\n\nJack and Rebecca take a road trip to Los Angeles.\n\nThis is not just any road trip, this is the road trip. After like a week of knowing each other, they decide to drive across the country together (kids, don’t do this), they have sex for the first time, Jack’s PTSD reveals itself, Jack calls Rebecca “Bec,” they certainly DO NOT find Joni Mitchell’s Laurel Canyon home, and Rebecca decides she wants to be wherever Jack is. Then she makes him cry for the first time in a long time by singing to him. Jack and Rebecca forever.\n\n➽ Jack moves his mom to her cousin Debbie’s in Ohio.\n\nThey make a standing appointment for a 6 p.m. Sunday phone call.\n\nThe most momentous occasion on this timeline: Jack and Miguel meet!\n\nWhen Jack needs a sport coat for dinner with the Malones at their country club, he walks into a suit store only to be helped by none other than his future BFF Miguel. Miguel lets him borrow the jacket for the dinner when Jack tells him he can’t afford it. We don’t deserve Miguel Rivas.\n\nJack meets Rebecca’s parents.\n\nOh wow, this is a roller-coaster event: On the one hand, Jack talking about protecting his brother from the monster in his bedroom, opening up a miniscule amount about Vietnam, and confirming that he’s going to be in Rebecca’s life for a while really wins Rebecca over — you can practically see her falling in love right there in front of that country-club lobster. On the other hand, after the meal, Mr. Malone tells Jack no way, no how is he ever getting close to his daughter. Game on, Malone.\n\n➽ Miguel gets a job at Lundy.\n\nHe has to use the name “Mike Rivers” to do it, but Lundy does become an important fixture in the Pearson family history.\n\n➽ Jack forces Rebecca and Miguel to find a way to be friends.\n\nJack maybe does too good of a job at this, if you know what I’m saying.\n\nJack plays golf with Rebecca’s dad and tells him he is definitely marrying his daughter.\n\nSurprisingly, this does not go well at all.\n\nJack dumps Rebecca because he’s poor.\n\nOkay, so Mr. Malone does get to Jack, but thanks to a surprise pep talk from Mrs. Malone, Rebecca goes after her man and they have an epic makeout in the middle of an auto shop. “Rebecca Malone, I love you. Don’t you ever forget it,” Jack says. You’ll learn later why his word choice is devastating.\n\nNicky makes a failed attempt to reconcile with his brother.\n\nHe gathers up all his strength to meet Jack at a party for one of their lieutenants, but never makes it out of the parking lot after realizing that Jack is moving forward with his life. It’s quietly devastating, as is so much of Nicky’s life!!\n\nJack preps a very Jack proposal; Miguel reveals himself to be the best best friend on the planet.\n\nAs if we needed more evidence that Miguel Rivas is a real sweetheart: He not only spends his day helping Jack recreate his and Rebecca’s first date so that Jack can propose, but when Rebecca’s dad becomes a real dick about it, as he is wont to do, it’s Miguel who stands up for his buddy and tells Mr. Malone that he doesn’t know how lucky he is that his daughter is marrying someone like Jack. That’s our Migs!\n\nLaurel’s older brother Jackson dies in Vietnam, she is forever changed.\n\nWe aren’t told exactly when Jackson DuBois goes to Vietnam, but afterward, Laurel DuBois deals with her grief by walking into the lake in front of her Aunt Mae’s house and screaming out her feelings. This ritual puts her directly in the path of a Vietnamese refugee named Hai who she falls madly in love with before having to run away from her life in New Orleans.\n\nMay 16, 1976: Jack and Rebecca tie the knot at City Hall.\n\nFlower crowns. Facial hair. Vows that make you believe in true love again. What were you expecting?\n\nJack and Rebecca celebrate their first anniversary in a very Jack and Rebecca way.\n\nIt’s basically a Pearson tradition now: Rebecca does something nice, and then Jack does something that blows Rebecca’s thing out of the water. This time they go bowling and Rebecca gives Jack a nicely bound journal of his doodlings. Jack turns the bowling alley into their own private dance floor.\n\nWilliam turns to drugs after losing his mother.\n\nSweet, soft-spoken William falls hard for Randall’s mother and pain-numbing drugs. Oh, William.\n\nJack gives Rebecca some red dish towels for Christmas.\n\nThe real gift is the bracelet inside those red dish towels, but the towels are much more important to our story. The towels are death.\n\nJanuary 20, 1980: Rebecca gets knocked up in a bar bathroom after Super Bowl XIV.\n\nProbably not the only time Terry Bradshaw has acted as an aphrodisiac.\n\nWilliam and Laurel await the birth of their son and attempt to get clean.\n\nThey seem so happy here!\n\nJack and Rebecca learn they’re having triplets, proceed to freak out.\n\nIn order to be a provider for his growing family, Jack does the unthinkable and goes to his estranged father for money so he can afford a house in which the eventual family of five will fit. Meanwhile, we have to watch Jack be mistreated by this awful man again. Not a fun time for anyone involved.\n\nJack and Rebecca have their first meal in their new house.\n\nJack fights a pigeon — his greatest enemy — and reveals a squeal one might never have suspected to come out of our mustachioed baritone.\n\nJack and Rebecca’s friendly neighbors gift them a slow cooker.\n\nTHE MURDER WEAPON HAS ARRIVED.\n\nAnother Jack and Rebecca anniversary extravaganza!\n\nOn their fourth anniversary, Rebecca gives Jack a hammer engraved with his name and Jack one-ups his wife by … giving her a piano. Like, we love the guy, but also we hate him, right?\n\nLaurel gives birth to Randall and then overdoses.\n\nIn a tragic turn of events, William believes Laurel is dead as the EMTs work to revive her and so runs off with their newborn son, panics, and leaves him at a fire station. William walks around for a long time after that and never learns that Laurel survives and is taken to a hospital.\n\nAugust 31, 1980: Happy 36th birthday, Jack Pearson! And welcome to the world, Big Three!\n\nFor the big day in 1980, Jack receives a gross banana-nut muffin/Twinkie-filling cupcake concoction, a pseudo lap dance from his pregnant wife, and the most intense roller coaster of emotions in experiencing the elation at the birth of his children, the devastating loss of one child, and the hopefulness in recovery brought by finding baby Randall in need of a family. This is a very big day.\n\nDr. K and Firefighter Joe find ways to heal.\n\nThanks to the divine intervention of the Pearson family, Dr. K can finally move on from his paralyzing grief over the loss of his wife and goes on a very cute date with a very cute lady from the neighborhood. Firefighter Joe, realizing the baby dropped off at the station will not solve his marital problems, does the right thing by little Randall and then goes home to start rebuilding his marriage.\n\nRebecca meets Randall.\n\nJack was all in the moment he laid eyes on baby Randall, but Rebecca needed convincing. Eventually, she has a chat with that little man — the first of so many lovely heart-to-hearts between them — and she is in love. So are we.\n\nA tense first family car ride!\n\nJack has to drink booze to survive the ride home from the hospital, Rebecca is teetering between her grief after losing a child and her fear of being a terrible mother because of it, but both assure one another that they will be better than their own parents. That’s nice because their own parents were pretty terrible. (No offense, Mrs. Pearson!)\n\nLaurel is arrested for drug possession.\n\nLaurel suffers tragedy after tragedy: She’s arrested at the hospital and eventually sentenced to five years in prison, she’s unable to get ahold of William to tell him where she is, due to overcrowding she’s moved to a prison across the country, and due to deep guilt and shame, she never tries to contact William again. Always remember this show could easily be titled Everyone Is Sad.\n\nRebecca meets William.\n\nUnable to connect with her adopted newborn, Rebecca seeks out the man she believes to be his biological father. He’s in a very bad way, but still offers some helpful advice: Rebecca should give the baby his own name, not the name meant for the baby she lost. He 1also hands her a book of poetry by his favorite poet, Dudley Randall. You see where this is going, yes?\n\nIt’s the Big Three’s first birthday — and Mom and Dad aren’t doing so hot.\n\nJack and Rebecca are having trouble dealing with their grief over losing Kyle a year ago, so they pay Dr. K a surprise visit and beg him for advice. He obliges! It’s a speech all about wrapping tragedy and joy together. He should write a book or something, the man is very wise.\n\nThe Pearsons officially adopt Randall.\n\nIt’s not easy, but one year and an arts-and-crafts family photo later, Randall belongs to Jack and Rebecca in their hearts and in the eyes of the law. Speaking of eyes, are yours welling up, too?\n\nWilliam gets arrested for possession, but gets a reprieve.\n\nA kindly judge is tired of seeing the same story play out over and over, and he wants to give William a chance to get clean and tell a different story. It works, mostly! William gets clean, stays clean, and because of this, he’s around when a certain biological child comes knocking.\n\nMiguel jokes that Jack Pearson can never die and it’s really not funny, sir.\n\nWhile Jack’s signing a life insurance policy, he makes Miguel promise that should something happen to him, he’d look after Rebecca and the kids. Oh boy, does that have some layers.\n\nJack takes a desk job to make more money.\n\nOn one hand, it is soul crushing. On the other, Jack looks nice in an Oxford and tie.\n\nKate loves fireflies?\n\nIt’s why Rebecca gives her the nickname “Bug.”\n\nThe Pearson boys go to a taping of Mister Rogers’ Neighborhood.\n\nAt the time it just seemed like a fun thing to do because Randall is obsessed with the show. Looking back, the outing is fraught with interactions between the three Pearson boys that would have long-lasting effects.\n\nMay 15, 1985: Dynasty airs its fifth-season finale, “The Royal Wedding,” better known as the “Moldavian Massacre” episode.\n\nThe country can’t stop talking about it, but Rebecca has to record it since she is raising triplets. No spoilers, please!\n\nAbout a week later: Rebecca discovers Jack taped over her recording, terrifies her children.\n\nThe tiny Big Three hear mom and dad fighting and are worried they aren’t in love any more. To prove that of course they are in love, they have a family wedding in the living room. They all promise to love each other forever. When you get over the no-context “family wedding” and focus on the sentiment of everyone pledging to love each other, the sentiment is less weird.\n\nLaurel moves back to New Orleans.\n\nOh, Laurel. She finds her way back to New Orleans and lives with her Aunt Mae. She runs into Hai a lot at the farmer’s market, but he is married now and she is consumed by the tragedies that have befallen her.\n\n➽ January 28, 1986: The Challenger explosion.\n\nJack and Rebecca have to navigate death with their kids for the first time, and while Rebecca’s especially worried about Kevin’s non-reaction, Jack’s all like, Oh, it’s fine, no way he’ll be a 40-year-old man still talking about the Challenger explosion — and, well, joke’s on him.\n\n➽ Jack’s mom dies.\n\nEmotionally devastating for Jack, emotionally devastating for us, emotionally devastating for Cat Benatar.\n\n➽ May 16, 1986: Jack and Rebecca’s tenth anniversary, a babysitter’s nightmare.\n\nRebecca gets trashed at dinner, the kids lock their babysitter in the bathroom because she’s mean to Kate, and Rebecca is soothed by the fact that no matter what, her kids will take care of each other.\n\n➽ The pool opens!\n\nThat local pool hosts a bevy of formative Pearson moments. That pool has done so much for us.\n\n➽ Jack’s porn-stache is born!\n\nDepressed about the routine of her life, Rebecca gets the Princess Diana haircut, and it is … not great. To make her feel better, Jack shaves his beard but leaves his mustache, and it is … surprisingly hot. The man can work a ’stache, people!\n\nJack promises Rebecca he’ll be a “12” for her, melts hearts everywhere.\n\nAfter Rebecca gives Jack an ultimatum that he stop the drinking or else, Jack gets his act together, makes a big romantic speech, and wins Rebecca’s forgiveness. He also gives her that moon necklace — you know, the one she promises to never take off. This is all lovely and swoony, but almost immediately Jack gets a call from his boss and the real-world stressors that lead to him hitting the bottle don’t seem to care much about a big, romantic speech.\n\nThe Pearsons buy a shiny new Jeep Grand Wagoneer (because salesmen are helpless against a good Jack Pearson speech).\n\nThis may also be a bit of a continuity error. When the Pearsons buy the car, Rebecca is wearing the moon necklace. But Jack already has the Wagoneer the day he goes boxing and to the talent show, which seems to be the same day as the morning Jack gives Rebecca her necklace. Since the Pearsons have suffered enough, let’s say the talent show is a different day than the “I’ll be a 12 for you” speech, okay?\n\nJack visits Little Kate at school, all humans weep.\n\nIt’s a very intense conversation! Little Kate knows something is up with her dad, so she grabs his face! Jack talks to her about marrying the luckiest guy in the world and that he’ll be there! Spoiler: HE WILL NOT BE THERE.\n\nJack takes up boxing in order to fight his drinking problem.\n\nHot Sad Dads box, it’s just their thing.\n\nThe Pearsons attend an extremely awkward school talent show.\n\nLittle Kate is so intimidated by her mother’s talent and overbearing enthusiasm, she gives up singing without even trying. Meanwhile, everyone thinks it’s cool for Kevin to do a terrible Mr. T impression. Sophie likes it, so that’s something.\n\nMay 27, 1988: “Weird Al” Yankovic releases “Lasagna,” delights the Pearsons.\n\nDelights all of us, really.\n\nJuly 1988: There’s a heat wave in Pittsburgh, and the Pearsons meet Yvette.\n\nThe gang heads to the local pool for a healthy dose of drama. Randall makes friends with some of the other Black kids at the pool, but one of the mothers, Yvette, doesn’t warm up to Rebecca and her parenting style very easily. Don’t worry, though — they become buddies!\n\nJack’s dad dies.\n\nIt happens while Jack is off on a Be Nicer to Your Brother, Kevin Camping Trip. Rebecca and Kate head to the nursing home, where Rebecca meets her father-in-law, Stanley, for the first time. They reach Jack before Stanley passes, but he wants nothing to do with his dad. Rebecca has to tell Stanley that Jack isn’t coming — she also mentions that Jack is a great father, despite what Stanley did to him. That’s Rebecca for you, harsh but truthful.\n\nJack gives up dreams of his own company so Randall can go to private school.\n\nPlans for Big Three Homes construction company are shoved in the bottom of a drawer when it’s clear Randall needs the challenge of a prestigious private school. The kid solves Rubik’s cubes, for goodness sake!\n\nJack teaches Randall how to tie a tie.\n\nWe are all grateful for this.\n\nThe Pearson Thanksgiving traditions begin.\n\nCreepy guys named Pilgrim Rick and gas station hot dogs covered in fake cheese have never seemed so lovely.\n\nRebecca meets William, the sequel.\n\nSo important, so sad. It brings to light Rebecca’s greatest fear: that Randall could, at any moment, be taken away from Jack and Rebecca. Her fierce need to protect her family is understandable, but it doesn’t make the look of heartbreak on William’s face easier to take when he receives Rebecca’s letter denying him any interaction with Randall. What Rebecca doesn’t know is that William follows her home that day. He almost knocks on the door, but thanks to three little bikes on the front lawn, he decides it’s not right to inject himself into Randall’s life. What a different story this would’ve been if the Big Three had put their bikes away LIKE THEY ARE SUPPOSED TO. Kids, am I right?\n\nRandall joins a dojo, Jack proves that push-ups can make humans cry.\n\nJust kidding! We’ve always known they can do that.\n\nDecember 24, 1989: Kate needs an appendectomy.\n\nLooky here: Dr. K turns up again, this time needing comfort from the Pearsons instead of the other way around. Both Kate and Dr. K make it out just fine. Rebecca’s right: Nothing bad ever happens on Christmas Eve!\n\nLittle Toby helps his mom through her depression.\n\nWe learn that depression runs in Toby’s family and also that he does a great Rodney Dangerfield impression.\n\nAugust 31, 1990: The Big Three celebrate the big 1-0.\n\nIt is a day of partying in which Rebecca and Jack learn that Randall is the most self-aware and self-assured 10-year-old on the planet, that Kate has some issues with her friends but not with voguing, and that Kevin (Parker Bates) is madly in love with Kate’s best friend, Sophie.\n\nWinter 1990–91: The Big Three get the chicken pox and Rebecca outs her mother as a racist.\n\nRebecca’s mother is the worst!\n\nFebruary 1992: Jack sees Nicky for the last time.\n\nAfter receiving multiple postcards from his estranged brother, Jack goes to see Nicky for the first time since Vietnam, but still does not want to hear Nicky’s side of things. Jack can see Nicky is truly hurting, but his desire to protect his family from some of his demons is stronger than his desire to help his brother. He makes a choice and sticks to it. Nicky never sees Jack again.\n\nRebecca learns how thoughtful Kevin is.\n\nYou’d think a mother would know this about her son, but it takes an afternoon waiting in line to have John Smiley sign his rookie card to do so. This affects their relationship for the rest of their lives.\n\nThe Pearsons go to the cabin for the first time.\n\nEqually important: This is when Randall gets his glasses. It’s also when Jack tells Kate that she’s his most favorite-looking person in the world and the world collectively rains down tears. And it’s the time when Kevin gets a snuggle session from his mother after feeling like the fifth wheel of the family. Kevin may not remember this, but we do. WE DO.\n\nMay 16, 1992: The kids beat Jack at his own gift-giving game.\n\nIt feels like the “first time at the cabin” should come after this, since the Big Three had clearly been out of school for a while in that episode, but Randall already has his glasses in this one! Alas, it cannot be. Anyway, the Big Three throw their parents an anniversary party complete with a meteor shower. Grand gestures run in the family. Jack tells Rebecca that he doesn’t “need an anniversary to see [her]” because he “[sees her] every day.” I immediately begin searching for a mustachioed boyfriend with an affinity for flannel.\n\nThe Big Three go to their first school dance.\n\nSometime in 1992, the Big Three go to their first school dance and Kevin gets his first kiss from Sophie.\n\nLittle Beth (sorry, Bethany) is accepted into an elite ballet academy.\n\nOur little island girl, “who danced before she walked,” has some big dreams.\n\nJack teaches Randall how to box, makes us all cry again.\n\nBy my calculations, this Moment in Pearson History doesn’t exactly seem to fit. When Jack secretly teaches Randall how to box, Rebecca clearly states that the Big Three are 12. Maybe Rebecca is rounding up? That would mean it’s still pretty close to August, and yet Randall doesn’t have his glasses — glasses he was wearing in the anniversary episode from May 1992, when the kids were 11. Maybe Randall gets contacts as a child? Teen Randall doesn’t wear glasses. Is this the biggest mystery of This Is Us? But if they are 12, that puts Randall in seventh grade and Randall wanting to be his father’s son-son doesn’t quite match up with his other seventh-grade narrative of exploring his identity as a black man in this world. Also, that bookcase Jack builds for all of Randall’s seventh-grade books is nowhere to be found. Anyway, it could just be plot inconsistency, but my brain hurts and I’m going to have a rest and think about Jack teaching Rebecca how to box before making out.\n\nThe Pearsons have an eventful day at the pool ahead of seventh grade.\n\nKate has her first kiss (go, Stewart!); Kevin wonders if he’s a good person after deliberately humiliating Randall in front of his friends; Jack teaches Kevin about the Pearson men being “complicated”; Rebecca faces the fact that her kids are growing up and want nothing to do with her; and we, oh, we are treated to the best of all: Jack singing “Rump Shaker” while in a bathing suit. A blessed day!\n\nRandall starts seventh grade and meets Mr. Lawrence.\n\nCory Lawrence is the only black teacher Randall’s ever had, and he wants to impress him. He becomes a mentor. Jack, per usual, feels threatened.\n\nMiguel saves Jack’s ass when Jack is almost fired for messing up at work.\n\nThe purest love on this show is cemented.\n\nJack teaches Randall to golf.\n\nJack hates golf. Jack isn’t very good at golf. But after seeing Randall take an interest in Tiger Woods, thanks to Mr. Lawrence, Jack wants to relate more to his son. He wants Randall to be prepared for a life that will surely involve wheelin’ and dealin’ on the golf course.\n\nFall 1993: The Pearsons bury a time capsule at the cabin.\n\nKate buries a game of MASH, Kevin buries a picture of him and Sophie, Randall picks a puzzle piece, Jack makes a recording about how much he hearts Rebecca, and Rebecca secretly buries a sketch Jack drew of his dream house to build near the cabin — something he never gets a chance to do because life is cruel.\n\nThe Pearsons spend the day in NYC!\n\nThis whirlwind day starts with people yelling at each other while on public transportation and ends with a cheesy horse-drawn carriage ride in Central Park, but the big takeaway is that Rebecca doesn’t get to go to the Met to see Madame X and vows she will next time. Oh, the other takeaway is that Jack stinks at directions.\n\nJack does his best Hanz and Franz impression.\n\nIt’s because Kevin joined the football team and Jack’s teaching his son about getting ripped in one’s garage.\n\nJack threatens Kevin’s football coach in a public bathroom!!\n\nOkay, this is more about Jack and Kevin bonding when Kevin goes to quarterback camp — and Kevin realizing that his father is really always there for him — but come on, Jack quietly but frighteningly telling Kevin’s coach to stop calling his son stupid is the highlight.\n\n➽ The Pearsons have a regular Saturday.\n\nIt’s Rebecca’s dream: A Saturday with nowhere to go. Jack teaches the boys how to shave and about collecting moments, and while they may not understand either of those things very well at first, one day they will. One day they will!!\n\nMadison’s mom leaves her forever.\n\nShe does give her some nice earrings, though. Does that make up for abandoning her with a father who does not know love?\n\nRebecca has a cancer scare and Jack introduces The Tree into the Pearson family history.\n\nRebecca ends up being fine, but not before Jack brings her to “his favorite tree” to calm her down. Of course, he made up the whole story about The Tree and only selected it because it was closest to a payphone, so they could wait there for her test results. It’s very cute and becomes an enduring part of the Pearson family story.\n\nRebecca joins her old band.\n\nShe feels alive again! Jack just feels threatened.\n\nKevin and Randall’s sibling rivalry boils over during a high-school football game.\n\nAll Randall wants is the love and respect of his brother. All Kevin wants is to be left alone in his new basement bachelor pad. Teen Kevin is so mean! Not even Teen Randall’s offering of Yoo-hoo and Pop-Tarts melt his brother’s icy exterior.\n\nMiguel gets a divorce.\n\nThe news from Miguel throws both Jack and Rebecca into a bit of a spiral. Okay, it’s mostly just Jack, who realizes he and Rebecca have been getting complacent and he needs to fight for his marriage before he loses it. Rebecca, on the other hand, finds it upsetting but not upsetting enough to make her rethink her next big decision …\n\nRebecca decides to go on tour with her band.\n\nAlongside her ex-boyfriend Ben, no less. Jack is less than enthused and his jealousy pushes him back to the bottle. Things are going downhill fast, people!\n\nRebecca leaves for her tour and Jack goes after her.\n\nIt sounds romantic until you realize Jack is completely drunk as he hops in the car to drive all the way to Cleveland to make things right with his wife. Hold me.\n\nRebecca and Jack decide to separate.\n\nAfter an intense screaming match in which Rebecca admits to feeling like a ghost in her own life and Jack calls her “music career” ridiculous, they decide it is best to take a breather. They gather the Big Three for a family meeting and ruin diner breakfasts forever.\n\nRebecca and Jack decide not to separate.\n\nIt doesn’t take long for Rebecca to show up at Miguel’s door looking for her husband. They are Jack and Rebecca, dammit! They don’t give up on each other. That unconditional support will prove useful now that Jack admits he’s been drinking again. He’s an alcoholic and he needs help. Rebecca gets her reluctant husband in the car and promises him that in a few months, everything will be better. Spoiler alert: It will not.\n\nJack goes to Alcoholics Anonymous.\n\nIt’s a lot like Hot Sad Dad Boxing, but it may actually stick this time.\n\nRebecca pulls a Jack Pearson on Jack Pearson.\n\nThings are still rocky for the world’s most romantic couple, and since her man is struggling these days, Rebecca fills the role of Swooniest Person to Ever Swoon and takes Jack on a romantic date to get the ol’ fire going. At first, it bombs. But Jack finally begins to open up to Rebecca about some of the pain he’s feeling, and the two chat in the car. Then they do other stuff in the car. Jack Pearsoning always works!\n\nWelcome, Louie the Dog!\n\nJack and Rebecca find a stray dog outside of their home. He is cute in an “I’m so ugly and mangy please love me” sort of way.\n\nKevin shatters his knee and his dream.\n\nKevin had a plan: Go to college to play football and then go pro. When he gets hurt during a high-school game and told he’ll never play again, it’s heartbreaking — even if the kid can be an ass. The only one who can really comfort him is his dad. Jack! If Jack could take on his son’s pain for him, he would. He passes on the Buddhist necklace he got while in Vietnam. That necklace is only halfway through its journey.\n\nRebecca discovers Kate secretly wants to go to Berklee School of Music for singing.\n\nRebecca also discovers that her daughter really, really resents her.\n\nRandall visits Howard University and has never been happier.\n\nSeriously, did you see how big that kid’s smile was while he was standing in the middle of the campus library? A LIBRARY. We know Randall’s a nerd and all, but still. He finally found a place where he felt normal.\n\nBeth’s dad dies, and so do her dreams of being a ballerina.\n\nBeth is around 17 when all of this goes down, and losing her dad affects her enormously — although you wouldn’t know it from the way the Big Three act around her in the present. More than one person can have a sad Dead Dad story!\n\nIt’s Jack’s last Thanksgiving.\n\nHe and Miguel have a touching heart-to-heart about Miguel not giving up on being part of his kids’ lives. Is this their last BFF chat? Oh dear Lord, this is sad!\n\nFamily mall trip!\n\nIt’s an eventful afternoon: We learn about Kate’s eating disorder, Randall asks Allison out with a Magic 8-Ball, Kevin realizes the sacrifices Jack has made for him, and Rebecca and Jack forget to pick up batteries for the smoke detectors in the house. That last one really hurts.\n\nJack and his Katie girl share some diner fries.\n\nIt’s only days before Jack will die, so the conversation — one about how much Jack believes in his daughter and how much she lights up when she talks about music — will stick with Kate for a long time. And that diner will become a sort-of limbo for her because of it.\n\nJanuary 25, 1998: Super Bowl XXXII becomes everyone’s least favorite Super Bowl.\n\nJack and Rebecca spend the day getting shamed by a surly Kevin, ignored by Randall who skips the game to take Allison to see Titanic (and get his first kiss!), and Jack reminds his daughter that she is the most beautiful girl in the world. Oh, then Jack places a red dish towel next to a faulty slow cooker and the Pearson house goes up in flames while the family is sleeping. Real cool day.\n\nJanuary 26, 1998: The Pearson house burns down … and Jack dies.\n\nJack is the superhero we always knew he was. He runs through fire to get Rebecca, Randall, and Kate safely out of the house and then goes back in to save Louie the Dog and some family mementos. It looks like he’s fine, but he goes to the hospital to get his burns checked out, and never leaves. While Rebecca is on the phone in the waiting room, Jack Pearson has a heart attack due to smoke inhalation complications and dies.\n\nJanuary 31, 1998: The Pearsons honor Jack exactly how he would’ve wanted.\n\nOkay, so the funeral starts out very tense—especially between Randall and Kevin—but after a visit from Dr. K, things turn around. Rebecca takes the kids to The Tree to scatter Jack’s ashes, and then she tells them that Jack had bought them all tickets to a Bruce Springsteen concert for that night. Jack loved the Boss. It just feels right.\n\nThings are very bleak at the Pearson house, and Randall has the worst prom experience in history.\n\nEveryone is just so sad! Rebecca can barely function, Kate is eating her feelings, Kevin is drinking his, and Randall has to hold the family together. Miguel makes good on his promise to look after Jack’s family, but not even he can fix Randall having to deal with his girlfriend’s racist father. Randall decides to defer going to Howard even though it is his greatest dream. Look what you did, Jack!\n\nSome rando dad who knows Jack just died hits on Rebecca in a RadioShack.\n\nHis name is Matt, and he reminds us that women can’t catch a break.\n\nMay 1998: The Big Three graduate!\n\nIt’s a horrible time for everybody since Kate has no college plans, she’s mad at Kevin for going to NYC to be an actor, Rebecca’s crying outside of school gymnasiums, and no one’s paying attention to Randall being valedictorian. It was a rough year. Hey, at least Rebecca — at Miguel’s insistence — starts grief counseling. That’s something, right?\n\nRandall and Beth bump into each other at the Carnegie Mellon new-student mixer.\n\nTHEY DON’T EVEN KNOW.\n\nKevin helps Randall score a date with Beth.\n\nAh, the infamous phone call we heard talk about but didn’t get to see until season three. Kevin and Randall won’t truly bond until years later, but this is a nice foundational moment for the always-at-odds brothers. I mean, Kevin’s advice is horrible, but it kind of works.\n\nRandall and Beth go on a disastrous first date.\n\nWithin ten minutes, Randall’s told Beth his entire life story and doesn’t spare any details. She is rightfully terrified, but eventually his charm wins her over.\n\nIt’s Parents Weekend at CMU!\n\nRebecca forces Randall to have lunch with Beth and Carol Clarke, which in turn helps Beth realize that Randall truly sees her, lemon slice and all, and they start dating. So I guess we have Rebecca to thank for R&B productions really getting off the ground. And Carol helps Rebecca realize she can move forward in her life after the loss of her husband. So I guess we have Carol to thank for Rebecca not remaining in a fetal position on her floor for the rest of her life. Thanks, ladies!\n\nKate gets a job at a record store and meets Marc.\n\nHe quickly becomes controlling and possessive because Kate Pearson cannot have nice things.\n\nKevin and Sophie get married!\n\nHe tells his mother on an answering machine, if you can even believe this child.\n\nRebecca and Kate move out of the Apartment of Sadness and into a new home.\n\nThe first dinner party, celebrating the newlyweds, is sort of a disaster thanks to Kevin and Sophie being cheesy as hell, Rebecca not knowing how to cook Cornish game hens after all these years, and Marc showing up to be weird. The evening is saved, however, by Miguel giving Rebecca a nice speech about being patient with her grief and Rebecca starting a Princess Bride sing-along.\n\nRebecca reenters the workforce.\n\nWith a huge assist from Randall, who is basically keeping his mother alive at this point.\n\nRandall says the phrase, “Résumés are my jam.”\n\nOh, Randall.\n\nMarc turns out to be emotionally abusive and toxic and just the World’s Worst Boyfriend.\n\nAfter he kicks Kate out into the freezing cold on the way to the Pearson Cabin because he gets insanely angry at her for not quitting her job when he tells her to, they “make up,” until later when he gets angry again and locks her out of the cabin in the snow. Thankfully, Rebecca’s spidey-sense tells her something’s wrong and she and the Pearson boys arrive and kick Marc to the curb.\n\nRebecca, Randall, and Beth head to New York for Kevin’s acting showcase.\n\nKevin tries to set Rebecca up with his acting teacher, Kirby. Just when you think these two beautiful people might make out, Rebecca is reminded of Jack and runs away. I mean, it’s only been a little over a year at this point, but good on Kevin for trying. (Randall does not share this sentiment.)\n\nKate has an abortion.\n\nShe almost tells Marc about it, but her first time seeing him since their breakup only reminds her that he is horrible, so she keeps it a secret from everyone in her life for decades.\n\nKevin moves to Los Angeles at the behest of his agent, ignoring sage advice from Randall.\n\nRandall tells his brother that moving to L.A. will most definitely jeopardize his marriage. Kevin dismisses his brother’s warning. Kevin regrets this.\n\nRandall and Beth celebrate their six-month anniversary.\n\nSix-month anniversaries are a thing — Randall and K-Ci & JoJo say so.\n\nRandall visits Kevin in L.A.\n\nTheir emotional issues both as individuals and within their relationship are fully on display, as evidenced by their physical fight on the street, but never actually dealt with, as evidenced by their verbal fight on the front lawn decades later.\n\nKate takes a job at the diner.\n\nShe’s consumed by her grief and so takes a job at the diner where she and Jack had one of their last heart-to-hearts, days before his death. She’ll work there for nine years, stuck in a purgatory of her own making.\n\nRebecca brings the Big Three back to the cabin.\n\nKevin makes a Jerry Maguire–inspired declaration of love to his wife, Sophie, about how in the end, it will always be the two of them. Rebecca encourages Beth to believe in herself and take that big urban planning firm internship. Rebecca also begins to think about thinking about possible love in her future and tells Miguel as much. So, like, a lot of big decisions being made at the cabin here.\n\n➽ Miguel takes Rebecca to speed dating; she begins seeing a real snoozefest.\n\nIt’s Matt, the PTA guy who hit on her in RadioShack that one time! Miguel is immediately not a fan (surprise, surprise!), and Kate calls her mother a slut, so that’s a super-fun reentry into the dating world after tragically losing the love of your life.\n\n➽ Kevin admits to cheating on Sophie days before Thanksgiving.\n\nThey end up getting divorced, Kate and Sophie’s friendship ends, and Beth begins her thesis on how all Pearson Thanksgivings are “dramatic as hell.”\n\n➽ Miguel asks, “Brine not?”\n\nAnswer me!\n\n➽ Rebecca and Miguel turn Taboo into a game of sexual tension that is so awkward Miguel must flee to Houston.\n\nOkay, that’s not why he moves to Houston, but it’s not not why, you know? Everyone can see Rebecca and Miguel are in love with each other, but they are still too afraid to go there. Miguel has been hanging around only because of Rebecca, but it is torture. Also his kids are in Houston. He breaks the news on Rebecca’s front porch, in a teary-eyed speech in which he tells her she is his favorite person. They do not kiss here, and it is a damn travesty.\n\n➽ The Big Three get trapped in the now-closed pool (R.I.P.!).\n\nKevin is a drunk who thinks he messes everything up, Kate is aimless and depressed, and Randall wants to be president one day.\n\nRandall and Beth get engaged!\n\nIt takes several attempts, and surprisingly it is not body rolls to Jagged Edge’s “Let’s Get Married” that win Beth over, but assurance from Rebecca that Randall would never let Beth lose herself in their relationship. Beth is scared that Randall has the power to charm her into giving up what she wants. She should be!\n\nDeja is born.\n\nHer mom Shauna is just 16 and relies on her grandma to take care of her and Deja, but when grandma dies, things really go downhill.\n\nRandall and Beth have a backyard wedding!\n\nKevin’s plus-one is an awful soul patch. May it stay in the past, where it belongs!\n\nOctober 31, 2008: Welcome to the world, Tess Pearson!\n\nYou were named after a ceiling fan.\n\nThe saddest game ever is invented!\n\nWhen Tess is just 3 months old, Randall and Beth invent their “worst-case-scenario game.” It wasn’t fun then, it isn’t fun now.\n\nKate and Kevin decide it’s time to get their lives together.\n\nFor Kate, that means she’s going to stop sleeping with married men, eating fast food while sitting outside the old Pearson house, and move to Los Angeles to live with her brother. Kevin is going to join an improv group. You would think Kate’s plan is the sound one, but it’s Kevin who ends up getting cast in a successful television show and making millions. Go figure.\n\n➽ Rebecca reconnects with Miguel on Facebook and then IRL.\n\nThey haven’t seen each other since Miguel moved to Houston. Facebook messages turn into long phone calls, which turn into dinner when Miguel is in town. Rebecca waited eight years — she isn’t waiting any more — so she kisses that fool right after he tells her leaving her made him feel homesick. They take things slow but not that slow.\n\nDeja visits Philadelphia with her mom and grandmother.\n\nHold on to the memories of Boathouse Row and water ice, Tater Tot!\n\nToby gets divorced and becomes suicidal.\n\nThings get rough for Mr. Damon, but he bounces back and eventually crosses paths with Kate Pearson!\n\nWilliam meets Jesse.\n\nWe don’t yet know how long these two dated, but gosh darn, is their first meeting on Thanksgiving cute. They fall for each other pretty quickly. That happens when “a nice boy offers you pie,” right, William?\n\n2011: Kevin films the “Untitled Hot Babysitter Pilot.”\n\nHere’s the big secret about the soon-to-be megastar of the hit TV series The Manny: In this moment, he doesn’t even know if he wants to act. But then he makes a baby laugh, and Kevin’s entire life changes.\n\n➽ 2012: Rebecca and Miguel get married.\n\nWe don’t see the wedding, but we do hear their bilingual vows, and it’s very lovely.\n\n2013: Laurel and Hai reconnect, and it is the most bittersweet.\n\nBitter because Laurel has an aggressive tumor and will only live for two more years, sweet because these two found each other again after all this time.\n\nDeja enters the foster-care system.\n\nBefore she cuts her hand and Child Protective Services spot some red flags, Deja is watching The Manny, so this is pre-Kevin’s breakdown. She spends a lot of time being moved from home to home (and bed to bed) until she is reunited with her mother … and unfortunately, her mother’s deadbeat boyfriend.\n\n➽ May 2015: Laurel dies.\n\nHai is by her side, and as always, she’s thinking of the son she loved but never got to know.\n\nAugust 31, 2016: Happy 36th birthday, Kevin, Kate, and Randall!\n\nWelcome to the big twist, everyone else!\n\nKevin goes full Jerry Maguire on the set of The Manny.\n\nHe doesn’t know the human head weighs eight pounds, but he does know he deserves more than a character whose basic function is to take off his shirt while tending to a child.\n\n➽ Madison gets dumped by David, a man she was really in love with, then heads to a weight support group.\n\nShe meets Kate and a lifelong friendship is born! Just kidding, it takes a while for Kate to warm up to Madison, who is, uh, a lot.\n\nKate meets Toby.\n\nShe cannot fall for a person like Toby right now, but guess what? She totally does.\n\nRandall knocks on William’s door.\n\nWilliam says it best: That was some thing Randall did, knocking on his door. After a lifetime of searching, Randall finally tracks down his birth father and bangs on his door, looking to confront the man who gave him up. Randall wants to heal his own wounds, but little does he know, he’s saving William from giving in to his drug addiction one last time. Of course, the timing isn’t exactly perfect, since William is dying of cancer and only has a few months left. It’s not the first unfair thing in Randall’s life, nor will it be the last.\n\nSterling K. Brown calls Mandy Moore “mommy.”\n\nAll of our lives are forever changed.\n\nRebecca meets William, part three.\n\nThis time with 100 percent more wrinkles! Rebecca wants William to keep their secret just a little bit longer, until she finds the right time to tell Randall. Girl, there will never be a right time to tell your son you’ve been lying to him about his birth father for his entire life.\n\nKate introduces Toby to Jack’s ashes.\n\nThe three of them watch the Steelers game together. Kate won’t say much about her father’s death, which eventually becomes a big problem for Toby, which eventually becomes a big problem for everyone else. Give the girl some space, dude!\n\nKevin finally calls Randall his brother.\n\nIt happens during a physical fight in the middle of New York City, but still, it is all Randall has ever wanted from Kevin. Let the fraternal healing begin!\n\nWilliam accidentally tells Beth that he’s met Rebecca.\n\nIn all fairness to William, he and Beth are totally high and he is moved by the poetry of Dudley Randall. But of course, Beth and Randall’s marriage is based on trust and not keeping secrets from one another, so she is in a tough spot. She tries to get Rebecca to tell Randall, but Rebecca doesn’t move fast enough.\n\nNovember 24, 2016: Randall teaches us that a Thanksgiving Dad is a Hot Dad.\n\nThe greatest lesson to come out of This Is Us.\n\nKevin and Olivia Maine kiss.\n\nOlivia is dark and twisty inside, but Kevin seems very into it. He calls the kiss one of the greatest of his life, but I’m pretty sure she was just in it for the pumpkin pie.\n\nKevin lets Miguel be Pilgrim Rick.\n\nOf the three Pearson kids, Kevin’s relationship with stepdad Miguel is the most fraught. This not-so-small gesture of letting Miguel participate in Jack’s Thanksgiving tradition is a huge step for their relationship.\n\nKate dumps Toby and decides to get gastric bypass surgery.\n\nToby giving up on his diet is too much temptation for Kate to handle at the moment. She needs to focus on herself, so she kicks him to the curb. After a not-so-near-death experience on a plane, Kate decides life is too short and she wants to start living her best life immediately. Gastric bypass surgery, it is!\n\nRandall discovers that Rebecca and William knew each other.\n\nWhen Randall goes to William’s apartment to grab some music recordings that are part of his birth father’s Thanksgiving traditions, he happens upon Rebecca’s letter, which reveals her decision to never tell Randall about William. Randall confronts Rebecca at the Thanksgiving dinner table, tearing apart one of the most important relationships in his life.\n\nRandall trips hard at the family’s cabin and chats with his dead father.\n\nHallucination Jack takes Randall’s face into his hands and tells his son that he was never a choice, he was a fact. He also tries to show Randall that Rebecca was constantly fighting to protect her family. Maybe that could offer some explanation as to her choices. Even in hallucinatory form, Jack Pearson is wonderful.\n\nWilliam tells Randall why he never came looking for him.\n\nWho knew kids’ bicycles could be so moving?\n\nWilliam reconnects with his great love, Jesse.\n\nThese two guys! Jesse was heartbroken when William left to live at Randall’s without telling him, but is willing to forgive him as long as William promises not to shut him out anymore. Jesse wants as much time with him as William has left. Aww!\n\nKevin and Sloane decide to self-produce The Back of an Egg.\n\nKevin’s big shot at becoming a Serious Theater Actor almost slips away when Olivia Maine goes MIA but, terrible title be damned, the show must go on!\n\nDecember 24, 2016: Toby collapses in Randall’s living room.\n\nToby flies out to New Jersey to try and win back Kate with a very lovely speech, but hours later he collapses to the floor. So it turns out Rebecca was wrong — bad things do happen on Christmas Eve!\n\nKate and Toby get engaged.\n\nAfter Toby makes it through a second heart surgery, Kate unloads all of her feelings on the guy, assuming he is asleep. He’s not. He hears everything she says, including that part about wanting to marry him. He’d marry the hell out of her, too. And thus, an engagement!\n\nWilliam tells Randall he wants to stop his chemo treatments.\n\nIt is the beginning of the end.\n\nKate puts gastric bypass surgery on hold and goes to fat camp.\n\nWhile in an aerobic drumming class (!), Kate has an emotional breakthrough and realizes that her weight issues are very much tied to the death of her father and her inability to deal with her grief and guilt. Don’t knock aerobic drumming class until you try it.\n\nKevin makes a grand, romantic gesture to win back … his ex-wife?\n\nKevin and his childhood sweetheart Sophie divorced after he moved to Los Angeles and cheated on her, and they haven’t seen each other in 12 years. She’s hesitant, but he wins her over by taking her to their old haunts and professing his love for her in a dramatic speech. He really is his father’s son!\n\nRandall teaches William how to drive.\n\nRandall begrudgingly gives his father the gift of his perfect day: driving a cool car while wearing a new pair of shades, sipping on his favorite drink (an egg cream) with the music up and the windows down. What a cool cat that William Hill is.\n\nRandall has an anxiety-induced breakdown on Kevin’s opening night.\n\nThe mounting pressure at work, the pile of responsibilities at home, not to mention the emotional stress of watching his birth father slowly die after just meeting him all becomes too much for Randall. He becomes paralyzed with stress in his own office. Thankfully, Kevin realizes what’s happening and rushes to his brother’s rescue — even though it means ditching opening night of his play. Brothers come first, finally.\n\nRandall and William take a road trip to Memphis, where William dies cradled by his son.\n\n“Roll all your windows down, Randall. Crank up the music. Grow out that fro. Let someone else make your bed.” Be right back, need to go slide down a wall while ugly crying.\n\nRandall forgives Rebecca.\n\nThe Pearsons honor William’s memory with a plethora of breakfast foods, balloons, and confetti, and a nice stroll through the neighborhood while wearing fedoras. During this walk, Rebecca stops her son to once again say how sorry she is that she kept William from him, denying Randall more time with his birth father. She did it because she was scared, but she knows how selfish that was. It was enough time to know William loved him, Randall tells her. And that’s enough. This new peacefulness also seems to be in honor of William’s memory.\n\nKevin has a second shot at opening night.\n\nHe finally makes his big stage debut with The Back of an Egg’s opening night redux, and it is quite the success. Almost unbelievably, Ron Howard happens to be in the audience that night and he calls Kevin to offer him a part in his next movie. Too bad he just told Sophie that he realized he moved to New York City to be with her and that he won’t mess this up a second time. Sounds like some drama is afoot!\n\nKate (almost) opens up about Jack’s death.\n\nWilliam’s memorial brings on another swell of emotions for Kate regarding Jack’s death. It’s Randall who encourages her to finally deal with her grief by talking about it with the people she loves … including Toby. Later, Kate tells Toby that she has such a hard time talking about Jack’s death because it was all her fault.\n\nRandall quits his job.\n\nWilliam’s greatest gift to his son was showing him that life is short and we should enjoy every moment we have. With that in mind, Randall shows up at work and tells his awful co-workers that he’s had enough. It is a brave new world for Randall Pearson.\n\nRandall decides to adopt.\n\nRandall wants to adopt a baby to honor both his fathers, but Beth has a different idea: If they’re going to adopt, she wants to take in an older child who has been rejected by the world. A child who really needs them. It honestly is the better way to honor Jack and (especially) William. They’re going to become foster parents.\n\nThe world is forced to watch a grown man crawl around in a diaper.\n\nBy which we mean, the Pearson clan attends a very special taping of The Manny. No one knows why Kevin would want to do this, or why The Manny would allow him to do this, but we’ll go with it because it means all of our Pearsons are together in Los Angeles.\n\nKate has her first real singing gig!\n\nShe sings “Landslide” as Rebecca looks on with pride and maybe a tiny bit of jealousy. Rebecca is the last person Kate wants to see in the crowd, and afterward she basically tells her mother that she hates her for existing. You don’t know the whole story, Kate! Get off her perfectly postured back!\n\nDeja arrives!\n\nBeth and Randall’s first foster child arrives with a lot of emotional baggage. Even Mr. Type A, always-follow-the-plan Randall Pearson finds the transition difficult. There’s hair and hygiene issues, and a general unwillingness to connect on Deja’s part. She’s only 12, but the girl has been through a lot. Maybe Randall’s willingness to throw down at a bowling alley on her behalf will win her over.\n\nKevin injures his knee on set, begins his descent toward rock bottom.\n\nThe flare up of his old football injury and his co-star Sylvester Stallone’s insisting Kevin talk about his father dredges up a whole lot of emotion that he has worked his entire life to keep stuffed down. He begins taking pain pills to numb, well, everything. Things are about to get very bleak for Kevin Pearson.\n\nKate is pregnant!\n\nLike most major life events, the news is exciting and wonderful but also terrifying. We’re all (cautiously) happy for Kate, but sad for ourselves because it means we have to watch Toby do a Flashdance routine in a coffee shop to a Hootie and the Blowfish song. None of that is made up, and it all seems very, very Toby.\n\nThe Pearson brothers attend a charity gala.\n\nKevin embarrasses himself and Sophie as he spirals further down with his addiction, while Randall reaches a turning point with Deja. She has a very sweet crush on Kevin, so Randall agrees to take her to the event, where he learns about her rough time in other foster homes and why she flinches around Randall. If you’re keeping track, the evening is a loss for Kevin, but a major win for his brother.\n\nKevin breaks up with Sophie.\n\nOn the very stoop where not too long ago he wooed the love of his life back with a grand gesture of swoony words. Salt, meet wound.\n\nKate has a miscarriage.\n\nIt’s devastating, but there are some silver linings: First, it bonds Kate and Rebecca together, and oof, did they need some bonding. The pain also makes Kate stronger — she’s not going to let this break her or her relationship with Toby. Finally, Kate and Toby decide they want to try again once they’re ready. It keeps the dream alive that Kate will have a little boy named Jack. We need that, show.\n\nKevin has a breakdown on the lawn of a one-night stand.\n\nIf you think that sentence is rough, try this one: While trying to get a prescription for fentanyl using a script he stole from that one-night stand, he realizes he lost his dad’s necklace — the one thing he has left of his father. As if visits back to your old high school weren’t bad enough on their own.\n\nThe Pearsons say good-bye to Deja.\n\nShe isn’t with Randall and Beth long before the charges against her mother are dropped and Deja returns home, but man, did she become a part of the family.\n\nKevin gets arrested for a DUI.\n\nPost-breakdown, Kevin heads to Randall’s house to FINALLY ask for help, but news of Kate’s miscarriage steals his thunder. He chugs some vodka and goes for a ride instead. Poor little Tess, who is hiding the backseat of Kevin’s car, has to watch her uncle hit rock bottom. Can someone finally get this guy some help?\n\nThe Pearsons have an intense family-therapy session.\n\nKevin wants Rebecca to admit that Randall is her favorite and he goads her until she breaks down and tells him that it was easier to love Randall. Let’s never go back to this therapy room, okay? The revelation does, at least, bring the Big Three closer, and helps to heal Kevin and Rebecca’s relationship, which is a good thing because …\n\nKevin moves in with Rebecca and Miguel!\n\nKevin begins to see both his mother and Miguel in a new light. Kevin and Rebecca have never been closer. Kevin and Miguel have never been more, hmm, let’s say cordial? Kevin is trying! Also, Kevin is privy to all the LaCroix his heart desires. Not a bad deal, really.\n\nKate and Madison become friends and go wedding dress shopping.\n\nThey do not, thankfully, start a podcast.\n\nRandall decides he wants to buy William’s old building and turn it into a business venture with Beth.\n\nThe first day does not go well, but R&B Properties will survive.\n\nRandall delivers this gutting line about his father: “He’s been gone longer than we had him.”\n\nJust when you think you’re done crying.\n\nKate adopts a dog for her and Toby.\n\nThe dog is named Audio and he is adorable. Still, the memories of Louie and Jack’s death loom large. But again, the cuteness.\n\nKevin makes amends.\n\nThe saddest talk is with Sophie, as he says what seems to be a very final good-bye. The most surprising is with Dr. Charlotte, who returns Kevin’s necklace, PRAISE BE. And the most heartbreaking is with his dad: Kevin can’t actually apologize to his dad, but he makes the best of it by going to The Tree to tell Jack that he’s going to make him proud. It might not be the right tree, but the sentiment is very nice.\n\nFebruary 4, 2018: Super Bowl LII\n\nThe Philadelphia Eagles win! Okay, some other things also happen: Rebecca makes Jack’s favorite lasagna, Mr. McGiggles dies (R.I.P.), Kate almost loses the only video she has of her father (you know, the one where he beams with pride and love while watching her sing), and Randall has a very sweet conversation with Tess about always being her No. 1. In that last one, Randall promises Tess that they’ll have dinner together once a week at her office when she is all grown up and fancy. It doesn’t feel like a monumental conversation, but it really is.\n\nDeja arrives at the Pearson house.\n\nShe needs money to get the heat turned back on and didn’t know where else to go. Randall and Beth continue to worry.\n\nVegas, baby.\n\nThe Big Three and their people head to Vegas for Kate and Toby’s simultaneous-but-definitely-not-together bachelorette and bachelor parties. Kate and Beth bond. Kevin finds out that his movie may change his life. Randall can’t shake the feeling that something is wrong with Deja.\n\nBeth and Randall find Deja and Shauna asleep in their car.\n\nThey’ve been evicted, so Beth and Randall invite them to stay at their house for a while. After Shauna sees how happy Deja is, she decides to leave … and give up all parental rights. Deja does not take it well.\n\nSomebody’s getting married! It’s Kate and Toby.\n\nThe KaToby wedding arrives, as coordinated by Kevin and Randall. They are delights. But before Kate can walk down the aisle at the family cabin in her gorgeous dress, she has something to do: She needs to let go of Jack, at least a little bit. She goes out into the woods and sits on the tree stump she used to share with her dad, and tells him she needs to make room for Toby. She finally spreads Jack’s remaining ashes, and then Kevin and Randall walk her down the aisle. She isn’t the only Pearson experiencing some catharsis, though: Rebecca and Kate discuss their issues head-on and have a misty-eyed makeup. Kevin uses his toast time to get himself, Kate, Randall, and Rebecca to finally release that deep breath it feels like they’ve been holding in since Jack died. Nice sentiment, but weird wedding toast.\n\nDeja gets upset at the wedding.\n\nEven a conversation with Beth’s very nice cousin Zoe about not hating the people who love you can’t stop Deja from taking out her anger on Randall’s car windshield. This does not bode well for the future.\n\nKevin and Zoe meet by the wedding punch bowl and start dating.\n\nWhat a hot couple. Beth does not approve.\n\nDeja gives Randall the best 38th birthday gift.\n\nAnd we’re not just talking about those slick Nike sneakers she makes her biological father give her as payment for abandoning her — she tells Randall and Beth that they can formally adopt her. It took a lot of therapy and even more running to get to this place, but it pays off!\n\nPeople love Hill 400!\n\nAccording to Rebecca it has a 95 percent rating on Rotten Tomatoes, and even NPR’s Terry Gross is into it. It’s her probing questions that send Kevin on a hunt to learn more about his father’s time in Vietnam.\n\nKate and Toby are successful with IVF.\n\nThere are several setbacks and Toby makes the boneheaded decision to quit his antidepressants cold turkey in hopes of upping his sperm count. Toby falls back into a depression, but Kate ends up pregnant and their relationship is stronger than ever.\n\nRandall discovers that the Other Big Three (Beth, Miguel, and Toby) have a group text.\n\nNot like we’re jealous or anything.\n\nRandall decides to run for Philadelphia City Council.\n\nAfter visiting the rec center near William’s building and learning some hard truths about the neighborhood from William’s friend Chichi, Randall is compelled to do something about it: He’s going to run for city council. Never mind that he and his family live in Alpine, New Jersey (he signed William’s lease, so), he’s going to defeat the longtime incumbent Councilman Brown.\n\nBeth gets fired.\n\nPoor Beth! She loses her job of 12 years, and realizes that William was right — she needs to tell Randall that she can’t be the strong one right now. She is not okay.\n\nWe learn that The Manny is the No. 1 show in South Korea.\n\nJust a fun fact we should all be aware of!\n\nRandall hires a campaign manager and a field director.\n\nThe campaign manager is a nice, politically active Korean-American from the neighborhood named Jae-won and the field director is Beth. They don’t get along.\n\nKevin meets Robinson.\n\nHe learns that his father was definitely not “just a mechanic” in the war. Robinson can’t answer any questions about Jack’s brother, but he does hand Kevin a photo of Jack with a Vietnamese woman wearing the Very Important Necklace that Jack gave to Kevin. There’s a mystery to solve!\n\nKevin and Zoe go to Vietnam.\n\nKevin has a lot to learn about what happened to his dad and uncle during the war, but he also has a lot to learn about his girlfriend. She confides in him that she was sexually abused by her father, and the two admit that they are falling deeply in love with each other.\n\nThanksgiving 2018: Randall appears only in his undies at a time when the world really needed it.\n\nWe are forever grateful that a Thanksgiving Dad is a Hot Dad.\n\nThanksgiving 2018: Miguel attempts to make amends with his kids; they are dicks.\n\nMiguel has tried to stay in Andy and Amber’s lives, but they’ve made it very difficult. All of this leads to an extremely tense Thanksgiving dinner in which he ends up valiantly defending Rebecca and their relationship. Everyone realizes Miguel is a wonderful, gorgeous human and perhaps, one day, he and his kids can rebuild what they lost.\n\nTess comes out.\n\nFirst, she tells Kate on Thanksgiving 2018, but makes it clear she isn’t ready to tell her parents. Tess realizes that Kate told Rebecca — since Kate lives so far away, she wanted someone looking after Tess. It seems like a shitty thing for an aunt to do, but it all works out in the end! Rebecca gives Tess a beautiful speech about what keeping a secret can do to you (she would know!), and it inspires Tess to come out to Randall and Beth. They are, as you may have guessed, wonderful with the entire thing.\n\nKate decides to go back to college.\n\nIt’s time for her to make some changes — to the bursar’s office!\n\nRandall makes his failing campaign his top priority, sleeps on the couch.\n\nRandall wins his debate against Councilman Brown, but campaign manager Jae-won informs him that based on polling, there’s just no way he can win this thing. Beth sees it as a blessing, Randall sees it as a challenge. Beth asks him to give up the politics and focus on family, but Randall refuses. So, he’ll be sleeping on the couch from now on. Mom and Dad!\n\nKate and Toby learn they’re having a boy!\n\nIf they don’t name this kid Jack, heads will roll.\n\nKevin’s trip to Vietnam ends with a surprising revelation.\n\nNo one at the ville recognizes Jack or the woman wearing the necklace and Kevin resigns himself to returning home having learned nothing. But wait! Thanks to a resourceful hotel proprietor, he learns one very huge, startling thing: There’s no record of Nicholas Pearson dying in the Vietnam War.\n\nOld Nick Pearson brings his mail back to his trailer.\n\nNicky is alive.\n\nRandall wins the election!\n\nHe’s very excited, but no one else, perhaps even including the audience, is. At least he and Beth seem okay … for now.\n\nKevin and Zoe move in together!\n\nWho knew a John Stamos keychain would be so emotionally stirring?\n\nThe Pearsons go on a road trip to find their long-lost uncle.\n\nAlthough not a complete disaster, it doesn’t go well. Nicky is finally able to tell them the story of what really happened in Vietnam, although, he discovers, he’ll never be able to tell his brother. Rebecca gets to meet Jack’s brother, so that’s nice. But Nicky is an alcoholic and very depressed and doesn’t want any help from Jack’s kids. Kevin tries to persuade him otherwise, and although he doesn’t get to save Nicky in any way, the door is left open for the future.\n\nKevin relapses.\n\nFinding his uncle in that state and grappling with the thought that Jack kept him a secret all those years is enough to make anyone feel helpless and lost, so Kevin starts drinking again while alone in Nicky’s trailer.\n\nNicky starts going to therapy at the local VA.\n\nHe may have played it cool with his nephew, but Kevin really got under his skin, and Nicky makes an attempt at putting his life back together. With the help of his therapist, Dr. Ruiz, he really makes some progress!\n\nBeth figures out what she wants to be when she grows up!\n\nAfter a very cathartic visit to her mother’s, Beth realizes that she only felt truly alive when she was dancing — so she becomes a dance teacher. Great for Beth, but it puts an intense strain on her marriage.\n\nKate graduates! But then goes into premature labor! While in the car with her drunk brother!\n\nThe most dramatic winter-mester graduation ever! Kevin’s drinking is outed and Kate goes into labor at only 28 weeks. Never a dull moment with the Pearsons.\n\nBaby Jack Pearson Damon is born!\n\nAfter a long, excruciating wait in which some grievances are aired, Kate gives birth to baby Jack. He has a long road ahead of him, which scares the hell out of Toby, but Kate is all over it. Plus, Rebecca and Miguel decide to move to Los Angeles to help Kate. That should be super helpful and not at all suffocating.\n\nBeth and Randall hit the lowest of lows in their marriage.\n\nIt gets very intense there for a while, but eventually they decide they’re going to move to Philadelphia, where Randall can still be city councilman and Beth is going to open her own dance studio. They’re betting on themselves, baby.\n\nKevin and Zoe come to an impasse in their relationship.\n\nZoe never wants to have kids. Kevin goes along with that for, like, an afternoon because he loves her, but she can see how badly he wants to be a dad. She’ll never change her mind on this, and so there’s no hope for them. Zoe moves out.\n\nCassidy Sharp returns from deployment; it does not go well.\n\nWe do not know when or for how long Cassidy was deployed in Afghanistan. We do, however, know that she has done multiple tours. We also know that when she returns in 2019, her marriage is fraught, she is suffering from PTSD, and hits her son, Matty, out of frustration. She finds herself in group therapy at the local VA.\n\nKevin moves back to Los Angeles!\n\nPost-Zoe-breakup, Kevin decides he wants to be where the action is: in L.A. with Kate, Toby, Rebecca, Miguel, and Baby Jack. Again: super helpful and not suffocating at all!\n\nBaby Jack is diagnosed as blind.\n\nKate refuses to be anything but positive — her son will have a great, big life.\n\nRandall and Beth Pearson move to Philadelphia.\n\nThis is not downsizing, folks.\n\nNicky relapses.\n\nHis therapist is transferred and he feels abandoned, so he starts drinking again, and eventually throws a chair through the window of a group-therapy meeting being attended by Cassidy Sharp.\n\nMalik Hodges meets Deja Pearson at a backyard barbeque.\n\nDeja smiles for the first time in history.\n\nToby gets secretly super into CrossFit.\n\nAs if this dude could be any more annoying, now he’s CrossFit Toby. He’s losing a ton of weight, while Kate is stress-eating, and it’s all causing a rift in their marriage.\n\nKate meets her neighbor, Gregory.\n\nHe is recovering from a stroke, and she begins to go on walks around the block with him and Baby Jack.\n\nKevin gives up a new movie to go to Bradford, Pennsylvania, and help Uncle Nicky.\n\nNicky doesn’t want his help, but since when has that ever stopped Kevin?\n\nCassidy asks Kevin if he was in Who’s the Boss?\n\nIt remains devastatingly hilarious.\n\nThe Manny is canceled!\n\nSure, this sends Kevin into a tailspin, but has anyone checked on Morris Chestnut? Think about Morris Chestnut!\n\nThe Clarke School of Dance opens!\n\nSure, the place is all stunk up by a dead opossum, but at least it’s not a family of dead opossums, right? And sure, Beth and Randall learn that 14-year-old Deja wants to date a boy with a baby, but maybe for now just focus on the fact that Beth’s dreams are coming true?\n\nKevin really digs in during his stay in Bradford.\n\nHe buys a fancy trailer so he can live next to Nicky while they await his hearing, and he promises Cassidy that he’s going to help her get back together with her husband, Ryan. Of course they end up sleeping together first, but he does make good on his promise eventually!\n\nTess has a panic attack.\n\nBeth teaches her husband and daughter that La Croix isn’t just a refreshing beverage. It’s here that she also begins to suspect Randall might be headed toward another breakdown, what with the leg tapping and ten-mile running and working extra late hours. He refuses to get any help.\n\nNicky cuts ice cream like cake for Kevin.\n\nNot only does he tell a heartbreaking story about buying his trailer for his One True Love but never going after her, he also tells Kevin about how his dad would slice ice cream like a cake for him and Jack when they were kids, something Jack used to do for Kevin. He’s just opening up so much!\n\nRandall and Kevin send Kate and Baby Jack a gift.\n\nIt’s their family piano! And it’s full of pictures of Kate and her old boyfriend Marc, who definitely was abusive somehow and now those memories are dredged up. The gift is not the best.\n\nToby calls Miguel “Miggy Stardust.”\n\nOkay, he can stay now.\n\nRandall pretends to be bad at golf to win over fellow councilmen. As if.\n\nNo way, no how could Randall Pearson ever willingly play a sport he’s bad at. He’s great at golf, thanks to his father’s insistence that he learn to play. He’s so good, in fact, that he knows exactly how to pretend to be bad enough to endear himself to fellow golfers on the City Council. The man has allies now. Thanks, Dad!\n\nDeja and Malik go on an epic first date, become the cutest couple on this show.\n\nThese two lovebirds skip school so Malik can take Deja on a proper tour of Philadelphia and help her believe she is worthy of love. It is the sweetest. Though she disparages cheesesteaks, I will overlook it because everyone deserves to be seen the way Deja is seen.\n\nThe Pearsons have the Hodges over for the world’s most awkward dinner.\n\nEach blames the other’s kid for being a bad influence, some hostile words regarding class are exchanged, but in the end, after a heartfelt speech from Deja, Beth, Randall, Kelly, and Darnell agree to let the kids see each other as long as there is a chaperone. Oh, and we learn about Beth’s secret Pantry Wine! A true gift.\n\nCassidy delivers the harshest truth of this entire series.\n\n“Not all of us have to talk about our dead dads all the time,” she tells Kevin after he comments that she’s never spoken about her father. Boy, oh, boy. Cassidy saw the Pearsons; Cassidy knows the Pearsons.\n\nNicky has his court hearing!\n\nAfter Kevin fixes Nicky’s tie, Nicky gives a gorgeous little speech about how throwing that chair was the best thing to happen to him because it got him sober and brought his nephew into his life. Nicky avoids prison and is finally turning his life around. Anyway, I’m crying about it. Our Nicky!\n\nCassidy reunites with her family.\n\nWell, she is allowed to sit down at a diner with Ryan and Matty, even though she’s signed the divorce papers. It seems like they are poised for reconciliation, but who knows.\n\nRandall notices his mother is having more than a few mental slipups when she arrives in Philly.\n\nHe and Rebecca have a blowout fight when Randall calls her on it, and implies that he’s the actual parent figure in this relationship.\n\nThanksgiving 2019: The Pearsons descend on Philadelphia, drama ensues.\n\nShauna comes to see Deja, which upsets Beth, but it ends up bringing Deja and Beth closer together. Kevin helps Tess come out to her classmates. Kate discovers that Toby is complaining about her to his CrossFit friends, especially someone named “LadyKryptonite.” After Nicky realizes Jack didn’t completely erase him from his life once he hears Randall tell the “So Long, Marianne” story, he tells the story of his and Jack’s perfect Thanksgiving and introduces the tradition of Thanksgiving Shrimp. Rebecca, after leaving all day to see a movie, confides to Randall that he was right and she needs to see a doctor, but to keep it between them. This is all before we’ve even had pie!\n\nDecember 31, 2019: Randall doesn’t care if the New Year’s Eve ball’s about to drop, he has doctor’s appointments to schedule!\n\nRandall has taken his mother’s care into his own hands and decides to let Miguel know about an appointment with the best doctor in Los Angeles while the rest of his family is literally counting down to 2020. This is why people complain about Randall.\n\nRebecca is diagnosed with mild cognitive impairment.\n\nMore testing is to be done, but she wants to keep this between herself, Miguel, and Randall for now. Anyone who has watched even a little television knows that’s going to be An Issue.\n\nKate throws Toby a Margaritaville-themed birthday party, their marriage falls apart.\n\nI’m not saying the two things are related, but I am saying that at this party Kate learns Lady Kryptonite kissed her husband AND Toby admits that their son makes him sad. It is no Cheeseburger in Paradise, if you get me.\n\nRandall finds an armed man breaking into his home.\n\nIt sends him hurtling toward another breakdown when he becomes obsessed with the new security system he intalls, has to keep his mother’s diagnosis a secret, and fights a mugger in a parking lot all in the same week!\n\nSophie’s mom, Claire, dies.\n\nKevin goes to the funeral — Claire was a big fan of his — and tries to help Sophie deal with her grief. They finally watch the end of Good Will Hunting, which seems like they’re saying good-bye to their relationship, but some of us will hold out hope because we don’t like them apples, not one bit.\n\nKate, Rebecca, and Baby Jack attend a retreat for families with blind children.\n\nKate brings Rebecca because Toby is the worst, but it ends up being a great thing: Rebecca gives Kate sage marriage advice, tells her daughter about her diagnosis, and most important, Rebecca and Kate duet to Alanis Morrisette’s “Ironic” at karaoke night. It is a time.\n\nKevin sleeps with Madison.\n\nNo one is surprised about this except Kate.\n\nThe Big Three realize they’re the Sad Three and head to the family cabin to have feelings together.\n\nHere, Kevin learns the truth about Rebecca, Randall realizes he really needs therapy, and they all have a good cry listening to Jack’s tape after they unearth their time capsule. Kevin also takes the drawing of Jack’s dream house and makes some plans.\n\nRandall finally goes to therapy!\n\nIn just one session, Dr. Leigh gets Randall to admit that he thinks he is the only person who can hold the Pearsons together. She is a blessing sent to us all!\n\nKevin and Rebecca’s fun day out!\n\nKevin is helping Rebecca live out her carpe diem dreams by taking her to Joni Mitchell’s old Laurel Canyon house where she sings us all a little tune. The day takes a wild swing, however, when they have to go get Rebecca’s test results and learn she has Alzheimer’s.\n\nAfter receiving devastating news, Miguel suggests he and Rebecca unwind by watching Borat.\n\nNever forget.\n\nRandall calls a “code red” sibling video chat.\n\nHe’s found a nine-month long Alzheimer’s clinical trial in St. Louis and he wants everyone on board with making Rebecca go. He has zero time for Kevin’s misgivings about it. This will not end well.\n\nRebecca, Kevin, and Randall head to NYC for Kevin’s M. Night Shyamalan movie premiere.\n\nKevin’s trying to give his mother one great day, but Randall can’t help himself and so brings up the clinical trial to Rebecca in the middle of the movie premiere party. Kevin and Randall have a huge fight about Randall’s inability to trust anyone else with their mother’s care and also slams him with a dig about how Kevin’s funding all of their mom’s treatment. Things get tense and then Rebecca runs away!\n\nRebecca finally gets to see Madame X at the Met again.\n\nShe tells her sons that she doesn’t have a lot of time left, and what little time she has she wants to spend it joyfully and with her family. She’s not doing the trial. Kevin agrees. Randall seethes.\n\nRandall guilt-trips his mother into going to the clinical trial.\n\nAfter an illuminating therapy session in which his visions of what his life would’ve been like if Jack had survived the fire actually tell him that he has a lot of underlying resentment toward Rebecca for lying to him about William (yes, he needed a therapist to figure that out!), he tells Dr. Leigh that he refuses to reopen those wounds with Rebecca. He can’t lose his mother and he will do anything to make sure he doesn’t. And so he calls her and reminds her that he’s been a good son, he’s forgiven her for a lot of things, and has never asked for anything in return. He’s asking her to do this clinical trial. How can she say no?\n\nIt’s Baby Jack’s first birthday!\n\nIt starts out like a normal first-birthday party, with a baby eating cake and adults taking lots of pictures of that baby eating cake, but then it turns into a Pearson party, which means Rebecca tells everyone her news about the clinical trial, Kevin figures out it was Randall who made her change her mind, and the two brothers say pretty much the most awful things you could think of and completely sever their relationship. Party -favor bags for all Pearson parties should be filled to the brim with ibuprofen and tissues.\n\nMadison is pregnant with Kevin’s children.\n\nMadison is pregnant with twins, and thanks to a very sensitive OB/GYN (the gynos on this show truly go above and beyond) who tells her not to give up on the father without trying, she tells Kevin the news. He’s all in — he wants to be a father and thinks maybe the great love story he’s been looking for is the one he’ll have with his kids. This should be fun.\n\nKate and Toby decide they want to adopt!\n\nAfter visiting the NICU on Jack’s birthday, and Toby seeing how meaningful it is to have siblings via the Pearsons, Mr. and Mrs. Damon decide they’d like to give Jack a sibling. They’re going to start the adoption process.\n\nAugust 2020: The Big Three turn 40, but there is very little to celebrate.\n\n﻿Rebecca suffers an incident in relation to her meds mixing with an antihistamine and it gives everyone a glimpse as to what the future probably has in store for them. Meanwhile, in the wake of George Floyd’s death, Randall has been processing some unspoken issues he’s been burying since his childhood in relation to being a Black man raised by a white family, and has pretty much avoided speaking to his family since Baby Jack’s birthday. It’s this incident, on their 40th birthday, that brings the Big Three back into each other’s orbits.\n\nKevin proposes to Madison\n\nAfter Madison has a scary fall (everyone is okay!), Kevin realizes he doesn’t want to lose this little family he’s creating — he proposes and Madison says yes.\n\nKate and Toby get a match at the adoption agency.\n\nA pregnant woman named Ellie is having a girl and wants Toby and Kate as the adoptive parents. The three adults end up getting very close and things get tricky.\n\nMiguel plants apple seeds outside the cabin for Rebecca.\n\nHe promises her that she’ll see those seeds grow into a big, beautiful tree one day, regardless of her diagnosis.\n\nRandall accidentally strips on his city council livestream!\n\nIt’s honestly all for the best, because (1) the national attention puts him in the path of Hai, his birth mother’s great love, and (2) he looks great. That councilman’s got abs, ya know what I mean?\n\nKate decides to confront Marc about how toxic he was and opens up to Toby about her abortion.\n\nMarc is still very much a dick, so he isn’t the most receptive to Kate trying to take her power back from him, but it is a healing confrontation on the Pearson end of things.\n\nKevin takes a role on a Jordan Martin Foster film.\n\nOoof, Foster is a pretentious weenie.\n\nRandall and Beth travel to New Orleans to meet Hai and learn the story of Randall’s birth mother.\n\nIt’s both a tragic and healing time. Randall ends it with a nice scream in the lake and by the time they are making their way home, Beth can see Randall has a lightness to him. Oh, and they become owners of Laurel’s lake house, so that’s fun!\n\nMadison goes into labor six weeks early, sings “MMMBop” with Randall.\n\nKevin’s stuck trying to get home from his movie set in Vancouver, Madison is freaking out about being alone at the hospital, so Randall and Beth — on their drive home from New Orleans — stay on video chat with her until he shows up. Randall proceeds to distract Madison from her contractions with a little ’90s throwback sing-a-long. This feels on-brand!\n\nKevin ditches a Robert De Niro film, saves a man from a burning car, sweet talks his way onto a plane without I.D., and makes it to Los Angeles in time for the birth of his twins, Nicholas and Frannie.\n\nIs this the wildest entry on this timeline? Discuss!\n\nBaby Hailey is born!\n\nBirth mom Ellie decides she wants nothing to do with Kate and Toby after the birth, which is hard for the Damons to hear, but they need to move forward with their expanding family.\n\nKevin and Madison drive the twins home and Kevin has a very intense dream about his father.\n\nThe timeline loves a Dream Jack appearance! This one tells Kevin to go after what he wants and he decides he wants to fully be there for his family, so he re-proposes to Madison. That’s two proposals, no ring yet, if you’re keeping track.\n\nToby gets laid off.\n\nIt’s a tough blow for the Tobester, who then has to deal with feelings of inadequacy for not being able to provide for his family and resentment toward Kate once she goes to work and he becomes a stay-at-home dad.\n\nOh, right, Kate gets a job, meets Phillip!\n\nShe takes a teaching assistant job at the music school where they take Baby Jack. She loves it. The teacher she’s assisting, a grumpy English guy named Phillip, is not as enthusiastic about the whole thing … at first.\n\nWelcome to the world, Isaac!\n\nIsaac is Randall’s basil plant and we cherish him.\n\nNicky travels across the country to tell two cute babies that they are his moon.\n\nGod, Nicky will just break your heart in every era, won’t he? He’s so moved that Kevin would name one of his kids after him that he spends weeks working up the courage (and getting vaccinated, of course) to get on a plane for the first time since leaving Vietnam and come visit. The journey is arduous — it includes one especially hairy moment when the snow globes he spent weeks building for Nick and Frannie break at the airport — but worth it. Jack would be so proud!!\n\nNicky and Miguel plan a rehearsal dinner together, Nicky does not understand the beauty of small plates.\n\nThe planning is a disaster since Nicky uses any moment he can to make digs at how Miguel stole Jack’s wife, until Miguel finally has enough and sets him straight. Eventually, Nicky calls Miguel to apologize and the two make amends. Maybe Jack’s best friend and brother can become friends in their own right? Maybe??\n\nRandall and Kevin begin to mend fences while on a sidewalk in Philadelphia.\n\nThe two have an intense heart-to-heart in which many grievances are aired, Kevin admits that some of his jealousy issues were tied up with race, and Randall apologizes for saying that their dad was ashamed of Kevin. It will take time to fully heal, but this was a great, honest step forward.\n\nDe Niro agrees to reshoots for the movie Kevin walked out on.\n\nJust wild that De Niro is playing a real part in this timeline, huh?\n\nBeth officially closes her dance studio.\n\nAnd yet another dance dream dashed for dear Beth.\n\nKevin finally sees his movie with Foster in its entirety, and it is terrible.\n\nKevin fears for the future of his career, and it is even worse than he imagines: He now has a reputation for on-set blowups and walkouts. Running into Zoe during a meeting with his agents and her making a passing comment about how he compromises on what he wants all the time doesn’t help his general emotional state at that time, either.\n\nToby’s dad comes to fix a pipe, drops an astute if not obvious metaphor.\n\nEven within one afternoon, Toby’s dad can sense that Toby is stuffing down all of his emotions (especially in regards to staying home with the kids) and eventually those emotions will come bursting out like water in a broken pipe. Beware, all!\n\nSophie calls Kevin to congratulate him on getting the life he always wanted; Kevin spirals.\n\nAnd it all takes place during the saddest bachelor party in the history of bachelor parties! Kevin eventually deletes Sophie’s number from his phone and insists that he is madly in love with Madison and not just marrying her because she’s the mother of his children.\n\nNicky starts internet-stalking Sally Brooks.\n\nWill Nicky learn to love again?\n\nToby secretly contemplates a job offer in San Francisco.\n\nYou know he knows this is a bad idea but he does it anyway.\n\nKate throws Madison a bachelorette party that might shed some light on imminent Kevison issues.\n\nDuring a pretaped “Newlywed Game” activity, Kevin can’t answer the question about what his and Madison’s future looks like long-term and although Madison assures her bff Kate that she is wildly happy in her relationship, she can’t help but fixate on the panic in Kevin’s face in that video.\n\nRebecca apologizes to Randall for robbing him of his birth parents, and that chapter of the R&R saga is finally closed.\n\nThere are so! many! tears!\n\nMalik gets accepted to Harvard.\n\nDeja seems terrified as to what this means for their relationship.\n\nKate tells Toby to take that job in San Francisco because they can weather anything together.\n\nShe will not be quitting her job because (1) she loves it and (2) Phillip refuses to accept her resignation because she’s so dang good at her job.\n\nMadison calls off the wedding.\n\nShe knows Kevin doesn’t really love her that way and she also knows she deserves something real.\n\nRebecca asks Kevin to build the house at the cabin Jack designed for her.\n\nKevin’s new chapter begins!\n\n➽ Kevin joins The Manny reboot as the dad character, and Madison starts dating Elijah from her book club.\n\nKevin’s new chapter is a little sad!\n\n➽ Nicky, Rebecca, and Miguel go on a road trip to find Sally Brooks!\n\nThere is no romantic rekindling, but it allows Nicky to move on with his life. Rebecca, too! She decides she isn’t dead yet — she wants to enjoy the time she has. Also everyone agrees Miguel has amazing hair.\n\n➽ Deja sneaks off to Boston to see Malik.\n\nShe loses her v-card and is very in love, but Mom and Dad do not care about love when they find out about the lying.\n\n➽ Nicky heads back to Pennsylvania and flirts with a flight attendant named Edie.\n\nOhhhh, this is a cute development …\n\n➽ Rebecca starts teaching Baby Jack the piano.\n\nThis is also cute!\n\n➽ Kevin breaks ground on Jack’s house.\n\nHe tasks both Nicky (who is very in love with Edie!) and Cassidy with managing the project.\n\n➽ Deja informs her parents she’s quitting high school to move to Boston with Malik.\n\nShe’s hilarious, isn’t she? Randall tells Malik that if he really loved Deja, he’d let her go — this isn’t what’s best for her, and they all know it.\n\n➽ Beth takes the job at the dance conservatory.\n\nShe also starts a scholarship program for low-income and marginalized groups. It goes very well.\n\n➽ Kate makes amends with Sophie.\n\nThelma and Louise become friends again!\n\n➽ Pearson Thanksgiving 2022!\n\nToby gets mad at Kate for feeding Jack sweet-potato casserole, and it becomes abundantly clear to the entire family that all KaToby does is fight now. More importantly, Rebecca makes a big speech to her three children: She informs them that Miguel is in charge of her medical decisions — if Miguel dies before her, then Kate is in charge (that one is a shocker) — and she demands that none of her children make their lives smaller because of this disease. They are ordered to proceed with their lives. “I’m your mother, and I’m sick, and I’m asking you to be fearless.” Everyone cries, Moore should be overnight-shipped an Emmy for this scene.\n\n➽ Big Three Homes is born!\n\nAfter spending time with Cassidy (and getting an intimate look at her mental-health situation) and the crew of veterans she hired to build Kevin’s house, Kevin gets an idea to start a nonprofit that hires vets for construction crews. Jack would weep into his mustache if he saw this!!\n\n➽ Kate and Toby have the worst weekend in San Francisco imaginable.\n\nKate heads up there to save her marriage, but it just makes things worse. Toby is happier than he’s ever been, but Kate doesn’t recognize him anymore. He gives her an ultimatum: Their family needs to move to San Fran if they want any shot of surviving. She responds by calling Phillip and asking for an available teaching position at her school.\n\n➽ Deja runs away to see Malik (again)!\n\nNo one knows how she escaped the cabin in the woods and got on a bus to Boston, but the girl did it. Perhaps being fueled by the anger of learning Randall planted the seed in Malik’s head that they should break up was enough.\n\n➽ Randall and Rebecca and many tears go on a sweet road trip together.\n\nRebecca refuses to let Randall head up to Boston to collect his daughter alone and forces him to take his time with the drive. They drink dive-bar wine, take lots of selfies, and Randall tells his mom he’s going to run for senator and is going to win. Rebecca is so proud! She tells him he’s her hero. Honestly, just throw me into the gross motel pool, there is nothing left for me here!\n\n➽ Deja and Malik break up.\n\nIt’s for the best, but Randall reminds Malik that just because it’s over now doesn’t mean it’s over forever.\n\n➽ It’s Rebecca and Miguel’s tenth anniversary, and it is doozy.\n\nI wish I had time to talk about Kevin’s wildly perfect impression of his mother, but bigger drama calls us: Baby Jack gets out of the house on his own and winds up walking all the way to the park. It’s Rebecca who realizes where he’s gone and races after him! Jack needs stitches and Kate and Toby scream things at each other on their godforsaken lawn of misery that they can never take back, and Toby has a tense standoff against the Big Three, but other than that, things are pretty chill.\n\n➽ Kate and Toby go to couples therapy.\n\nIt does not go well.\n\n➽ Sixteen months later: Kate and Toby call it quits.\n\nAfter a dinner gone wrong in which Toby invokes the name of the Jack Pearson, KaToby ends things for good this time. Kate seems at peace with it almost immediately. For Toby, it takes a little longer.\n\n➽ Kate and Phillip karaoke to “Tubthumping” together, and everything changes.\n\nAh, yes, Chumbawamba’s “Tubthumping,” the song that launched 1,000 great romances. Kate and Phillip make an emotional connection the day she signs her divorce papers, and eventually, they end up on a date in which Phillip shares his deep, dark trauma with Kate, and they fall in love.\n\n➽ Phillip proposes to Kate.\n\nHe uses Tween Baby Jack and Hailey, and it is very sweet.\n\n➽ It’s Kate and Phillip’s engagement party!\n\nThere’s more tub-thumping, an awkward run-in between Kevin and Sophie which signals that Kevin is very much still in love with his ex-wife, Randall is in the middle of his senatorial campaign, and Rebecca’s health is deteriorating.\n\n➽ Kevin and Sophie reconnect the night before Kate’s wedding.\n\nSophie’s divorced, Kevin is waiting for his one great love, and after a sunset walk through a vineyard, it is painfully obvious they are still so in love with each other. They almost have sex in Kevin’s hotel room, but it’s scary!\n\n➽ It’s Kate and Phillip’s wedding day!\n\nSure, sure, it’s a big day for the bride and groom, but Kevin steals his sister’s thunder when he and Sophie — thanks to a little push from Rebecca and Senator Randall Pearson — finally realize they are meant to be together. Oh, and Rebecca sings the theme song to This Is Us, and everyone bawls their eyes out. A good wedding all around!\n\n➽ Rebecca and Miguel move into the house Kevin built for his mom.\n\nRebecca really needs full-time care at this point, but Miguel takes his wedding vows seriously. So seriously that he neglects a lot of his own health issues to be there for Rebecca.\n\n➽ The Big Three tell Miguel they love him.\n\nAFTER EVERYTHING!!! I AM STILL CRYING ABOUT THIS!!\n\n➽ Miguel reconnects with his kids.\n\nThanks to Kevin Pearson, of all people!\n\n➽ Miguel dies.\n\nAnd Rebecca gets yet another dead-husband tree to add to her list when the family scatters some of his ashes at the apple tree he planted for her (the rest are scattered in Puerto Rico by Kevin and Miguel’s son, Andy).\n\n➽ Kevin and Sophie move into the house with Rebecca.\n\nIt’s really a no-brainer after a long “family meeting” between the Big Three. They don’t want to leave her there alone, and her wishes were to live in that house. Kevin knows he’s been a pain in the ass most of his life, and he wants to do this for his mom. They spend several years there taking care of her, fielding visits from the rest of the family to help out, and buying so much walnut-shrimp takeou", "images": ["https://pyxis.nymag.com/v1/imgs/237/367/21942b4c365fe4ba5d872df6a87443ea65-This-Is-Us-Chronology.rhorizontal.w1100.jpg", "https://pyxis.nymag.com/v1/imgs/e33/6e7/aed044d06bd5c293490430f400dc112e41-2022Cov4x5-AsianAmericaPkg.w240.jpg", "https://pyxis.nymag.com/v1/imgs/93d/dd4/6993359860ee6cc420bb272619119c2cdf-elon-musk-settlement.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/237/367/21942b4c365fe4ba5d872df6a87443ea65-This-Is-Us-Chronology.1x.rsocial.w1200.jpg", "https://www.vulture.com/media/components/customer-alert-banner/close_x.svg", "https://www.vulture.com/media/components/customer-alert-banner/alert.svg", "https://pyxis.nymag.com/v1/imgs/5ea/81e/4d3b39a96107c321338c0c9a25557bd47f-zarifa-ghafari.2x.rsquare-zoom.w75.jpg", "https://www.vulture.com/media/components/customer-alert-banner/double_chevron.svg", "https://pyxis.nymag.com/v1/imgs/fd4/409/28254d99ceca593534b46a52a9e49b452b-RISSI-AND-MIKO-SET-1152022.2x.rsquare-zoom.w75.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/237/367/21942b4c365fe4ba5d872df6a87443ea65-This-Is-Us-Chronology.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Maggie Fremont"], "canonical_link": "https://www.vulture.com/article/this-is-us-chronological-timeline.html", "title": "Everything That Happened on This Is Us in Chronological Order", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "parsely-tags": "this is us, tv, meet the pearsons, nbc, family dramas, timelines, vulture section lede, tv recaps, finales, vulture homepage lede, featuretype:tv recap, featuretype:list or roundup", "og": {"title": "Everything That Happened on This Is Us in Chronological Order", "url": "https://www.vulture.com/article/this-is-us-chronological-timeline.html", "description": "Six seasons of twisty family drama, untwisted.", "image": "https://pyxis.nymag.com/v1/imgs/237/367/21942b4c365fe4ba5d872df6a87443ea65-This-Is-Us-Chronology.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Everything That Happened on This Is Us in Order", "description": "Six seasons of twisty family drama, untwisted.", "image": "https://pyxis.nymag.com/v1/imgs/237/367/21942b4c365fe4ba5d872df6a87443ea65-This-Is-Us-Chronology.2x.rsocial.w600.jpg", "card": "summary_large_image", "creator": "@magsfre", "site": "@vulture"}, "article": {"published_time": "2022-05-24T22:30:00.000-04:00", "tag": "this is us, tv, meet the pearsons, nbc, family dramas, timelines, vulture section lede, tv recaps, finales, vulture homepage lede", "publisher": "https://www.facebook.com/Vulture"}, "description": "A timeline of all the major Pearson family moments in NBC’s ‘This is Us,’ from very beginning through the series finale, in chronological order.", "robots": "max-image-preview:large", "sailthru.tags": "this is us, tv, meet the pearsons, nbc, family dramas, timelines, vulture section lede, tv recaps, finales, vulture homepage lede", "author": "Maggie Fremont", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://assets.nymag.com/media/sites/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1653445800.0, "source": "https://www.vulture.com", "summary": ""}