{"url": "https://www.hollywoodreporter.com/live-feed/roseanne-canceled-at-abc-racist-tweet-1115412", "text": "ABC, in a stunning move, has decided to cancel its Roseanne revival following star Roseanne Barr’s racist tweet Tuesday.\n\n“Roseanne’s Twitter statement is abhorrent, repugnant and inconsistent with our values, and we have decided to cancel her show,” ABC Entertainment president Channing Dungey said Tuesday.\n\nEarly Tuesday, star, head writer and executive producer Barr attacked Valerie Jarrett, a senior adviser to former President Barack Obama, in a since-deleted tweet in which she said “Muslim brotherhood & planet of the apes had a baby=vj.” Barr subsequently apologized: “I apologize to Valerie Jarrett and to all Americans. I am truly sorry for making a bad joke about her politics and her looks. I should have known better. Forgive me — my joke was in bad taste.”\n\nWalt Disney Co. CEO Bob Iger also weighed in on the decision to cancel Roseanne: “There was only one thing to do here, and that was the right thing,” he tweeted.\n\nAdded executive producer Tom Werner, whose company Carsey-Werner exec produced the original Roseanne and its revival: “I support ABC’s decision to cancel the show in the wake of Roseanne Barr’s most recent reprehensible tweets. Our goal was to promote constructive discussion about the issues that divide us. It represented the work of hundreds of talented people. I hope the good work done is not totally eclipsed by these abhorrent and offensive comments, and that Roseanne seeks the help she so clearly needs.”\n\nShowrunner Bruce Helford added in a statement of his own: “On behalf of all the writers and producers, we worked incredibly hard to create an amazing show. I was personally horrified and saddened by the comments and in no way do they reflect the values of the people who worked so hard to make this the iconic show that it is.”\n\nBarr’s tweet prompted a massive outcry across social media, with thousands condemning the actress-comedian’s comments and calling on ABC to cancel her series. The Disney-owned network’s decision to cancel the comedy marked the first time the network has taken action in response to one of Barr’s controversial tweets.\n\nAxing the Roseanne revival was no small decision for ABC. The rebooted comedy debuted its nine-episode run midseason and finished as the TV season’s No. 1 scripted series on all of broadcast. Roseanne had been averaging a 5.5 rating among adults 18-49 and 19.3 million viewers with live-plus-3 lifts. With a full week of time-shifting, those numbers climbed to a 6.4 rating in the key demo and 22.1 million viewers. Either way, Roseanne was the highest-rated and most watched series of the broadcast season, eclipsing NBC’s This Is Us and CBS’ The Big Bang Theory — which had been in a heated battle for top status.\n\nIn response to Barr’s tweet, co-star and exec producer Sara Gilbert — who was the driving force behind the revival — blasted her longtime friend and colleague. “Roseanne’s recent comments about Valerie Jarrett, and so much more, are abhorrent and do not reflect the beliefs of our cast and crew or anyone associated with our show. I am disappointed in her actions to say the least,” she wrote on Twitter. “This is incredibly sad and difficult for all of us, as we’ve created a show that we believe in, are proud of, and that audiences love — one that is separate and apart from the opinions and words of one cast member.” Wanda Sykes, who served as a consultant on season one, also tweeted Tuesday that she would not be returning to the series following Barr’s racist tweet.\n\nRoseanne was slated to return in the fall for an expanded 11th season of 13 episodes as ABC looked to build on the show’s momentum. In a victory lap of sorts, Barr was the centerpiece of ABC’s upfront presentation to Madison Avenue ad buyers earlier this month. The revival was part of a larger effort by Dungey — broadcast’s lone African-American network topper — to cater to the underserved community who turned out in force to elect Donald Trump. The success of the Roseanne revival has prompted other broadcast networks to pick up a wave of multicamera comedies in a larger push to program for middle America. (To that end, Fox revived Tim Allen comedy Last Man Standing a year after ABC’s cancellation.)\n\nRoseanne has never shied away from taking on timely and controversial subjects. In the spirit of its original run, which had a history of addressing larger political and social issues, the revival famously opened its new season with an episode that explored the country’s divisive response to President Trump, whom Barr has publicly supported. The storyline between Roseanne Conner and her sister, Jackie (Laurie Metcalf), was designed to reflect the debate among Trump’s working-class base and spur a larger discussion. The May 22 season finale, likewise, set the stage to explore a larger debate about health care in America.\n\nThe reboot also found itself under the microscope earlier this season when a one-off joke taking aim at fellow ABC comedies Black-ish and Fresh Off the Boat was blasted as being “reductive” and “belittling.”\n\nFor his part, Helford stressed ahead of and during the Roseanne revival that he hoped viewers would be able to separate the show from Barr’s politics. “We never set out to be a show about politics. We set out to be a show about the Conners and how the current political climate affects the family,” he told The Hollywood Reporter. “We made a point of not mentioning names in the beginning, and I believe we will probably maintain that same thing. There is no agenda here, in any direction. The idea is to present all sides of the dialogue. Making it specific like that isn’t necessary. That’s not what we’re doing. We’re not talking about the personalities involved. We’re talking about the effects of all the politics on the lives of people like the Conners.” Helford served as showrunner on an early season of Roseanne before he was fired by the actress. He was poised to return as season 11’s lone showrunner after Whitney Cummings opted to not return.\n\nABC’s decision to cancel Roseanne leaves the network with a major hole on its schedule as the series was set to open its Tuesday lineup at 8 p.m. ABC now heads into the 2018-19 broadcast season without TV’s No. 1 series and without prolific showrunner Shonda Rhimes, who exited last year for a deal with Netflix.\n\nBarr returned to Twitter late Tuesday with an apology to the writers, cast and crew who all lost their jobs Tuesday (and a plug for an upcoming interview): “Don’t feel sorry for me, guys!! — I just want to apologize to the hundreds of people, and wonderful writers (all liberal) and talented actors who lost their jobs on my show due to my stupid tweet. I will be on Joe Rogan’s podcast friday,” she wrote.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/05/148352_3912_-_h_2018.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/148352_3912_-_h_2018.jpg?w=1296&h=730&crop=1", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/148352_3912_-_h_2018.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/roseanne-canceled-at-abc-racist-tweet-1115412/", "title": "‘Roseanne’ Canceled at ABC Following Racist Tweet", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "ABC has canceled 'Roseanne' following Roseanne Barr's racist tweet.", "news_keywords": "ABC, Roseanne, Roseanne Barr", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1115412, "title": "'Roseanne' Canceled at ABC Following Racist Tweet", "published_at": "2018-05-29 10:47:48", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/148352_3912_-_h_2018.jpg?w=1024", "comment_count": 0, "tags": "Roseanne Barr", "topics": "TV News", "body": "ABC, in a stunning move, has decided to cancel its Roseanne revival following star Roseanne Barr's racist tweet Tuesday.\r\n\"Roseanne's Twitter statement is abhorrent, repugnant and inconsistent with our values, and we have decided to cancel her show,\" ABC Entertainment president Channing Dungey said Tuesday.\r\nEarly Tuesday, star, head writer and executive producer Barr attacked Valerie Jarrett, a senior adviser to former President Barack Obama, in a since-deleted tweet in which she said \"Muslim brotherhood & planet of the apes had a baby=vj.\" Barr subsequently apologized: \"I apologize to Valerie Jarrett and to all Americans. I am truly sorry for making a bad joke about her politics and her looks. I should have known better. Forgive me — my joke was in bad taste.\"\r\nWalt Disney Co. CEO Bob Iger also weighed in on the decision to cancel Roseanne: \"There was only one thing to do here, and that was the right thing,\" he tweeted.\r\nAdded executive producer Tom Werner, whose company Carsey-Werner exec produced the original Roseanne and its revival: \"I support ABC's decision to cancel the show in the wake of Roseanne Barr's most recent reprehensible tweets. Our goal was to promote constructive discussion about the issues that divide us. It represented the work of hundreds of talented people. I hope the good work done is not totally eclipsed by these abhorrent and offensive comments, and that Roseanne seeks the help she so clearly needs.\"\r\nShowrunner Bruce Helford added in a statement of his own: \"On behalf of all the writers and producers, we worked incredibly hard to create an amazing show. I was personally horrified and saddened by the comments and in no way do they reflect the values of the people who worked so hard to make this the iconic show that it is.\"\r\n\r\n\r\nBarr's tweet prompted a massive outcry across social media, with thousands condemning the actress-comedian's comments and calling on ABC to cancel her series. The Disney-owned network's decision to cancel the comedy marked the first time the network has taken action in response to one of Barr's controversial tweets.\r\nAxing the Roseanne revival was no small decision for ABC. The rebooted comedy debuted its nine-episode run midseason and finished as the TV season's No. 1 scripted series on all of broadcast. Roseanne had been averaging a 5.5 rating among adults 18-49 and 19.3 million viewers with live-plus-3 lifts. With a full week of time-shifting, those numbers climbed to a 6.4 rating in the key demo and 22.1 million viewers. Either way, Roseanne was the highest-rated and most watched series of the broadcast season, eclipsing NBC's This Is Us and CBS' The Big Bang Theory — which had been in a heated battle for top status.\r\nIn response to Barr's tweet, co-star and exec producer Sara Gilbert — who was the driving force behind the revival — blasted her longtime friend and colleague. \"Roseanne's recent comments about Valerie Jarrett, and so much more, are abhorrent and do not reflect the beliefs of our cast and crew or anyone associated with our show. I am disappointed in her actions to say the least,\" she wrote on Twitter. \"This is incredibly sad and difficult for all of us, as we've created a show that we believe in, are proud of, and that audiences love — one that is separate and apart from the opinions and words of one cast member.\" Wanda Sykes, who served as a consultant on season one, also tweeted Tuesday that she would not be returning to the series following Barr's racist tweet.\r\n\r\nRoseanne was slated to return in the fall for an expanded 11th season of 13 episodes as ABC looked to build on the show's momentum. In a victory lap of sorts, Barr was the centerpiece of ABC's upfront presentation to Madison Avenue ad buyers earlier this month. The revival was part of a larger effort by Dungey — broadcast's lone African-American network topper — to cater to the underserved community who turned out in force to elect Donald Trump. The success of the Roseanne revival has prompted other broadcast networks to pick up a wave of multicamera comedies in a larger push to program for middle America. (To that end, Fox revived Tim Allen comedy Last Man Standing a year after ABC's cancellation.)\r\nRoseanne has never shied away from taking on timely and controversial subjects. In the spirit of its original run, which had a history of addressing larger political and social issues, the revival famously opened its new season with an episode that explored the country's divisive response to President Trump, whom Barr has publicly supported. The storyline between Roseanne Conner and her sister, Jackie (Laurie Metcalf), was designed to reflect the debate among Trump's working-class base and spur a larger discussion. The May 22 season finale, likewise, set the stage to explore a larger debate about health care in America.\r\nThe reboot also found itself under the microscope earlier this season when a one-off joke taking aim at fellow ABC comedies Black-ish and Fresh Off the Boat was blasted as being \"reductive\" and \"belittling.\"\r\n\r\nFor his part, Helford stressed ahead of and during the Roseanne revival that he hoped viewers would be able to separate the show from Barr's politics. \"We never set out to be a show about politics. We set out to be a show about the Conners and how the current political climate affects the family,\" he told The Hollywood Reporter. \"We made a point of not mentioning names in the beginning, and I believe we will probably maintain that same thing. There is no agenda here, in any direction. The idea is to present all sides of the dialogue. Making it specific like that isn't necessary. That's not what we're doing. We're not talking about the personalities involved. We're talking about the effects of all the politics on the lives of people like the Conners.\" Helford served as showrunner on an early season of Roseanne before he was fired by the actress. He was poised to return as season 11's lone showrunner after Whitney Cummings opted to not return.\r\nABC's decision to cancel Roseanne leaves the network with a major hole on its schedule as the series was set to open its Tuesday lineup at 8 p.m. ABC now heads into the 2018-19 broadcast season without TV's No. 1 series and without prolific showrunner Shonda Rhimes, who exited last year for a deal with Netflix.\r\nBarr returned to Twitter late Tuesday with an apology to the writers, cast and crew who all lost their jobs Tuesday (and a plug for an upcoming interview): \"Don't feel sorry for me, guys!! — I just want to apologize to the hundreds of people, and wonderful writers (all liberal) and talented actors who lost their jobs on my show due to my stupid tweet. I will be on Joe Rogan's podcast friday,\" she wrote.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Roseanne’ Canceled at ABC Following Racist Tweet", "url": "https://www.hollywoodreporter.com/tv/tv-news/roseanne-canceled-at-abc-racist-tweet-1115412/", "description": "ABC has canceled ‘Roseanne’ following Roseanne Barr’s racist tweet.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/148352_3912_-_h_2018.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-05-29T10:47:48+00:00", "modified_time": "2018-05-31T13:08:40+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Roseanne’ Canceled at ABC Following Racist Tweet", "description": "ABC has canceled ‘Roseanne’ following Roseanne Barr’s racist tweet.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/148352_3912_-_h_2018.jpg?w=1296"}}, "movies": [], "publish_date": 1527590868.0, "source": "https://www.hollywoodreporter.com", "summary": ""}