{"url": "https://www.etonline.com/chris-harrison-on-his-next-big-step-and-if-well-get-another-bachelor-out-of-paradise-exclusive", "text": "In August, Bachelor Nation’s godfather added one more line to his resume: restaurateur.\n\nChris Harrison and his partners opened Steam Theory Brewing in his hometown of Dallas, Texas, where Bachelorfans can dine and enjoy cocktails like The Final Rose Palmer and The Matchmaker. The longtime host spoke to ET about his next big step, and of course, a big summer hit: season five of Bachelor in Paradise.\n\nET: Between four Bachelor franchise shows and Who Wants to Be a Millionaire? you’re pretty busy! Why also take on a restaurant?\n\nChris Harrison: This is a complete passion project, which is something you should never do as an investment, so I apologize to my money manager! It was something that came about after my grandmother passed away. She was obviously near and dear to my heart. A few years ago I was back home for her funeral and I ran into an old family friend, Michael Weinstein, who’s an amazing chef in Dallas. We started talking about him finally taking over his own restaurant, and I got involved. It was the right time and the right place. I’ve always wanted to have a restaurant; I love food, I love wine and I wanted to do it with friends and family back home in Dallas. … Now I’ll have a place to take everybody! It’s an exciting venture.\n\nSo do Bachelor alumni get a special discount?\n\nThere is a Bachelor discount for some in the family. Some I might charge double.\n\nOverall, how much is Bachelor Nation part of Steam Theory Brewing?\n\nThere will be some Easter eggs and some nods to The Bachelor, Bacheloretteand Bachelor in Paradise; some drinks named after them. It’s a little tip of the cap to some of the silly things that I get made of fun for every Monday night! It’ll be fun. I don’t want to beat anybody over the head; this isn’t a \"themed\" restaurant, we have an incredible chef and an award-winning brewmaster. It’s about the beers, the food, the environment. But at the same time, I know some Bachelor family members and fans will come in, so there will be a little something there.\n\nTell us about the menu.\n\nIt’s going to be seasonal and very farm-to-table. The menu and beers will rotate because what you want to eat in Dallas when it’s 100 degrees, maybe an amazing compressed watermelon salad, is not what you’ll want to eat come December. So our menu will change with the season and our brewmaster will change the beers along with that. People can come back over and over because it’ll keep being a different experience.\n\nChris Harrison\n\nShould fans be at all worried that a new project means you might stop hosting Bachelor shows soon?\n\nThe worst financial mistake you could ever make is opening a restaurant, so this should assure everyone I’ll be hosting longer than I even intended to! Really, I don’t even care how great this place does, I just really wanted to be a part of it. It was all about karma, timing, family, friends and setting down more roots in Dallas. I hope it does well, and it has so far.\n\nSo many Bachelor Nation alumni live in Dallas now! You had Sean and Catherine Lowe, Rachel Lindsay and Raven Gates all at the opening. How does it feel to have them in your hometown?\n\nI don’t get to see them too much! When I’m home in Dallas I have so many people to see, family and friends ... So it was really fun to have their familiar faces at the opening. My family and my Bachelor family!\n\nWe have to ask you about Bachelor in Paradise. Did you have any nerves about how this season would do considering it was the first one since the scandal last summer?\n\nI think it’s a great season. It has all the trappings of what Paradise is supposed to be; it’s silly, funny, dramatic, there are love triangles, there are love squares; I think we even have a pentagon. … There weren’t any lingering effects from a year ago because we’d already shot two other seasons of Bachelor and Bachelorette. A lot of water has gone under the bridge since then. It was just nice to get back to Paradise and get it back to where it was. It’s fun, summer TV.\n\nThere has been a lot of Colton Underwood and Tia Booth so far. Some fans have questioned Colton’s intentions, while some have called for him to be the Bachelor. If he’s single at the end of Paradise, what would you think of Colton as Bachelor?\n\nIf he’s single, Colton would be a very interesting Bachelor. We look at a lot of things when picking the Bachelor, and good TV and good story is a lot of it. Colton has all that in spades. There’s the, \"Is he ready for this?\" angle with Tia, and is that still hanging over him? Obviously, we’ll see how that plays out in Paradise. Then there’s the virgin angle. We have this guy who was brought to tears during \"Men Tell All\" about dealing with this. If he’s willing to put that on display as the Bachelor, I would find that fascinating in this day and age. … The women having to deal with that -- I think it would be a fascinating story. And that’s a lot of what makes a good Bachelor. It’s a compelling argument if he’s single and willing to do it.\n\nWho are you loving to watch?\n\nI’m excited that everyone is getting to see Jordan. … There is a sincerity and a side to Jordan, and you’ve only seen the tip of the iceberg. I’m interested to see everyone’s reaction and opinion to him after this is all over. He’s goofy, but he’s in on the joke. I’m anxious for people to keep seeing this other side of Jordan.\n\nAnyone you wish had gotten more time in Paradise?\n\nBibiana! I say this to only a few people on Paradise each year, to people who I’ve gotten to know more. If I was rooting for somebody who I really wanted this to work for, it was Bibiana. … The timing and the numbers just didn’t work out for her. I saw someone [on social media] bring up an interesting idea: some kind of \"judges’ save\" like they do on American Idol, maybe there needs to be a Chris Harrison save where I can walk in and give someone an extra week!\n\nSpeaking of social media, Bachelorette Becca Kufrin ran into some issues this season with her fiance, Garrett, and some controversial \"likes\" on Instagram. Has that changed the franchise’s policies for contestants’ social media accounts at all?\n\nWell, those policies are way above my pay grade. As far as I know, there’s nothing being instituted beyond what’s been in place.\n\nFormer Bachelor Ben Higgins told ET he actually got a hold of an iPad in his hotel room and looked up his final women on social media ahead of hometowns in secret! Is that something you’d consider instituting; allowing the lead to look up their final few on social media?\n\nThat’s actually a great idea! Maybe I’ll take credit for it. That would be interesting. Say the Becca-Garrett situation happened during filming, maybe I would bring that to the lead and ask if they cared. It could happen in the future!\n\nThere have been some reports that Ben passed on being the Bachelor this season. Can you speak to that?\n\nI will say for a fact that he was never offered to be the Bachelor … Maybe he took his name out of the running, but he definitely didn’t turn down being the Bachelor. But hey, that’s not to say he won’t be!\n\nSo, when will we find out who our next Bachelor is?\n\nVery soon! It has to be; it’s only a matter of weeks because we go into production.\n\nBachelor in Paradise airs Monday and Tuesday nights on ABC.\n\nChris Harrison Weighs In On All Possible Candidates For Next 'Bachelor' (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page.\n\nRELATED CONTENT:\n\nChris Harrison Breaks Down Possible Candidates for the Next Bachelor (Exclusive)\n\nChris Harrison Thought 'Bachelor in Paradise' Would End After Season 4 Scandal (Exclusive)\n\nChris Harrison on 'The Bachelorette' Scandals -- and Why Lincoln Wasn’t Invited to ‘Men Tell All’ (Exclusive)\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-08/GettyImages-1240426139.jpg?h=05c564aa&itok=Dkqb34Us", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-10/GettyImages-1243560296.jpg?h=27af8da9&itok=n9B1yPno", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-08/harrison.jpg?h=c673cd1c&itok=MykfCmMG", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-08/harrison.jpg?h=c673cd1c&itok=q8FdU0om", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2018-08/harrison2.jpg?itok=R8G1Klmn", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2022-07/Michelle-Young-Nayte-Olukoya-Getty-1237390121.jpg?h=1ac718a2&itok=NmebzYJX"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-08/harrison.jpg?h=c673cd1c&itok=MykfCmMG", "keywords": [], "authors": ["Lauren Zima"], "canonical_link": "https://www.etonline.com/chris-harrison-on-his-next-big-step-and-if-well-get-another-bachelor-out-of-paradise-exclusive", "title": "Chris Harrison on His Next Big Step and If We'll Get Another Bachelor Out of 'Paradise' (Exclusive)", "meta_data": {"article": {"opinion": "false"}, "apple-mobile-web-app-capable": "yes", "robots": "index", "standout": "https://www.etonline.com/chris-harrison-on-his-next-big-step-and-if-well-get-another-bachelor-out-of-paradise-exclusive", "description": "He recently opened a restaurant in Dallas!", "keywords": "News, Chris Harrison, The Bachelor, Bachelor In Paradise, The Bachelorette", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/chris-harrison-on-his-next-big-step-and-if-well-get-another-bachelor-out-of-paradise-exclusive", "title": "Chris Harrison on His Next Big Step and the new Bachelor (Exclusive)", "description": "He recently opened a restaurant in Dallas!", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-08/harrison.jpg?h=c673cd1c&itok=MykfCmMG", "width": 1280, "height": 720}}, "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "twitter": {"card": "summary_large_image", "description": "He recently opened a restaurant in Dallas!", "site": {"identifier": "@etnow", "id": 23603092}, "title": "Chris Harrison on His Next Big Step and the new Bachelor (Exclusive)", "creator": "Lauren Zima‍", "url": "https://www.etonline.com/chris-harrison-on-his-next-big-step-and-if-well-get-another-bachelor-out-of-paradise-exclusive", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-08/harrison.jpg?h=c673cd1c&itok=MykfCmMG"}, "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}