{"url": "https://en.wikipedia.org/wiki/The_Real_Housewives_of_Orange_County", "text": "California-based reality television series in the United States\n\nThe Real Housewives of Orange County (abbreviated RHOC) is an American reality television series that premiered on Bravo on March 21, 2006. It has aired sixteen seasons and focuses on the personal and professional lives of several women residing in Orange County, California.\n\nThe cast of the upcoming season will consist of Tamra Judge, Heather Dubrow, Shannon Storms Beador, Gina Kirschenheiter and Emily Simpson; Taylor Armstrong will join in a \"friend of\" capacity.\n\nThe show's success has led for the development of The Real Housewives franchise and similar spin-off series based in numerous states across the United States, as well as numerous installments internationally.\n\nThe success of the show has resulted in two spin-offs; Date My Ex: Jo & Slade and Tamra's OC Wedding.\n\nCurrent cast\n\nMain\n\nFriend of\n\nOverview and casting\n\nVicki Gunvalson appeared as a main cast member during seasons 1-13, making her the longest-tenured cast member of the series\n\nSeasons 1–3\n\nIn April 2005, The Real Housewives was ordered by American television network Bravo.[2] The show’s working title was “Behind The Gates,” and was intended to follow a documentary format. It was renamed as The Real Housewives of Orange County in January 2006.[3] Show creator Scott Dunlop said that it was originally planned to be set in a single gated community in Coto de Caza, California.[4] The show was inspired by scripted soap operas Desperate Housewives and Peyton Place, and would document the lives of upper-class women who \"lead glamorous lives in a Southern California gated community where the average home has a $1.6 million price tag and residents include CEOs and retired professional athletes.\"[3]\n\nThe first season premiered on March 21, 2006, and starred Kimberly Bryant, Jo De La Rosa, Vicki Gunvalson, Jeana Keough and Lauri Peterson (then Waring). Bryant left after the first season. Tammy Knickerbocker joined the cast for the second season which premiered on January 16, 2007. Bryant appeared as a guest. After the second season, De La Rosa exited the series as a regular cast member. The third season premiered on November 6, 2007, which featured Tamra Judge (then Barney) as the latest housewife, while Quinn Fry joined the cast in the sixth episode.[5][6] Bryant and De La Rosa returned as guests. Knickerbocker and Fry left the main cast after the third season.\n\nSeasons 4–8\n\nGretchen Rossi was introduced in the fourth season premiere on November 25, 2008. Peterson made her final appearance as a main cast member in the third episode. While Lynne Curtin joined the cast in the fourth episode.[7][8] Bryant and De La Rosa made their final guest appearance during the season finale. While Knickerbocker returned as a guest. Keough's final season as a full-time cast member, season five premiered on November 5, 2009. After Keough left the show as a full-time cast member, Alexis Bellino was added to the main cast.[9][10][11] Fry, Knickerbocker and Peterson returned as a guest. Curtin left after the fifth season.\n\nThe sixth season which premiered on March 6, 2011, introduced Peggy Tanous as the newest housewife and friend of the housewives Fernanda Rocha.[12] Keough returned in a friend of the housewives status, while Curtin, Fry, and Knickerbocker appeared as guests. Heather Dubrow joined the cast in the seventh season which premiered on February 7, 2012. Keough and Tanous appeared as a guest, while Sarah Winchester was featured as a friend of the housewives. On April 1, 2013, the eighth season premiered and the cast was joined by Lydia McLaughlin. Peterson also appeared as a friend of the housewives in the eighth season.[13] Bellino, McLaughlin, Rossi and Peterson departed after the season.\n\nSeasons 9–13\n\nThe ninth season premiered on April 14, 2014, and introduced Shannon Storms Beador and Lizzie Rovsek as the new housewives. While Danielle Gregorio joined as friend of the housewives.[14] The tenth season which premiered on June 8, 2015, saw Rovsek as a friend of the housewives,[15][16] and Meghan King joining the cast. Curtin, Keough and Knickerbocker made guest appearances in the season.[17][18]\n\nThe eleventh season premiered on June 20, 2016. It featured Kelly Leventhal (then Dodd) joining the cast and Keough making a guest appearance.[19] Dubrow exited the series after the season.[20] McLaughlin returned for the show's twelfth season which premiered on July 10, 2017.[21] Peggy Sulahian joined as the latest housewife, while Keough, Rossi and Rovsek made guest appearances.[22] After the season concluded, O'Toole King, McLaughlin and Sulahian left the show.[23][24][25]\n\nGina Kirschenheiter and Emily Simpson joined the cast for the thirteenth season, which premiered on July 16, 2018.[26]\n\nSeasons 14–present\n\nThe fourteenth season premiered on August 6, 2019. Braunwyn Windham-Burke joined as a cast member, while Gunvalson was demoted to a \"friend of the housewives\" status.[27] King and Bellino both appeared in a guest capacity.[28][29] Gunvalson and Judge both left the series in January 2020.[30] Filming for the show was paused between March and July 2020 due to the COVID-19 pandemic in the United States.[31][32]\n\nThe fifteenth season premiered on October 14, 2020, with Elizabeth Lyn Vargas joining the cast.[33] Keough served as a narrator in the opening of the season premiere.[34] Rovsek appeared as a guest in the fifth episode.[35] The season served as the final season for Dodd, Windham-Burke and Vargas.\n\nThe sixteenth season premiered on December 1, 2021, with Beador, Kirschenheiter and Simpson returning, along with former housewife Dubrow, new housewives Jen Armstrong and Noella Bergener joining the main cast; Nicole James appeared as a friend of the housewives, departing halfway through the season.[36][37] Keough and Rovsek also had guest appearances during the season. The reunion was taped on March 10, 2022.\n\nFollowing the conclusion of the sixteenth season, Armstrong and Bergener announced their exits from the show on July 8, 2022.[38] On July 20 of the same year, Judge announced her return to the franchise.[39] The following month, it was announced former Beverly Hills star Taylor Armstrong had joined the cast as a friend of the housewives.[40]\n\nTimeline\n\nMain cast members Cast Members Seasons 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 Kimberly Bryant Main Guest Jo De La Rosa Main Guest Vicki Gunvalson Main Friend Jeana Keough Main Friend Guest Guest Guest Lauri Peterson Main Guest Friend Tammy Knickerbocker Main Guest Guest Quinn Fry Main Guest Tamra Judge Main Lynne Curtin Main Guest Guest Gretchen Rossi Main Guest Alexis Bellino Main Guest Peggy Tanous Main Guest Heather Dubrow Main Main Lydia McLaughlin Main Main Lizzie Rovsek Main Friend Guest Guest Shannon Storms Beador Main Meghan King Edmonds Guest Main Guest Kelly Dodd Main Peggy Sulahian Main Gina Kirschenheiter Main Emily Simpson Guest Main Braunwyn Windham-Burke Main Elizabeth Lyn Vargas Main Jen Armstrong Guest Main Noella Bergener Guest Main Friends of the housewives Fernanda Rocha Guest Friend Sarah Winchester Guest Friend Danielle Gregorio Friend Nicole James Friend\n\nEpisodes\n\nThe Real Housewives of Orange County episodes Season Episodes Originally aired Average\n\nViewers First aired Last aired 1 8 March 21, 2006 ( ) May 9, 2006 ( 2006-05-09 ) TBA 2 10 January 16, 2007 ( ) March 20, 2007 ( 2007-03-20 ) TBA 3 12 November 6, 2007 ( ) January 29, 2008 ( 2008-01-29 ) TBA 4 15 November 25, 2008 ( ) June 11, 2009 ( 2009-06-11 ) TBA 5 17 November 5, 2009 ( ) March 11, 2010 ( 2010-03-11 ) TBA 6 16 March 6, 2011 ( ) June 20, 2011 ( 2011-06-20 ) 1.94 7 23 February 7, 2012 ( ) July 24, 2012 ( 2012-07-24 ) 1.90 8 22 April 1, 2013 ( ) September 1, 2013 ( 2013-09-01 ) 1.89 9 21 April 14, 2014 ( ) September 8, 2014 ( 2014-09-08 ) 1.75 10 24 June 8, 2015 ( ) November 12, 2015 ( 2015-11-12 ) 1.77 11 21 June 20, 2016 ( ) November 21, 2016 ( 2016-11-21 ) 1.80 12 21 July 10, 2017 ( ) November 27, 2017 ( 2017-11-27 ) 1.70 13 21 July 16, 2018 ( ) December 9, 2018 ( 2018-12-09 ) 1.42 14 23 August 6, 2019 ( ) December 26, 2019 ( 2019-12-26 ) 1.32 15 16 October 14, 2020 ( ) January 27, 2021 ( 2021-01-27 ) 1.04 16 19 December 1, 2021 ( ) April 27, 2022 ( 2022-04-27 ) 0.85\n\nBroadcast history\n\nThe Real Housewives of Orange County airs regularly on Bravo in the United States;[41] most episodes are approximately forty-two minutes in length,[42] and are broadcast in standard definition and high definition.[43] Since its premiere, the series has alternated airing on Monday, Tuesday, Wednesday, Thursday and Sunday evenings and has been frequently shifted between the 8:00, 9:00, and 10:00 PM timeslots.[41]\n\nSpin-offs\n\nDate My Ex: Jo & Slade became the first spin-off from The Real Housewives of Orange County; the dating game show documented De La Rosa as she began dating after moving to Los Angeles, where potential suitors were regularly surveyed by Smiley. It premiered on June 30, 2008, and ended on September 8, 2008, after broadcasting nine episodes during its first and only season.[44]\n\nAfter becoming engaged to Judge in February 2013,[45] Barney was commissioned to star in the three-part spin-off special Tamra's OC Wedding.[46] It highlighted the preparations for their nuptials and was broadcast from September 2, 2013, until September 16, 2013.[46]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Emojione_2744.svg/16px-Emojione_2744.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Emojione_1F34A.svg/16px-Emojione_1F34A.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Emojione_1F34F.svg/16px-Emojione_1F34F.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Emojione_1F341.svg/16px-Emojione_1F341.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Emojione_1F48E.svg/16px-Emojione_1F48E.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Emojione_1F33A.svg/16px-Emojione_1F33A.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/90/THE_REAL_HOUSEWIVES_OF_ORANGE_COUNTY_LOGO_NEW.png/250px-THE_REAL_HOUSEWIVES_OF_ORANGE_COUNTY_LOGO_NEW.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Emojione_1F3A1.svg/16px-Emojione_1F3A1.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Emojione_2B50.svg/16px-Emojione_2B50.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/RealHousewives2OCVALaunchApr09.jpg/220px-RealHousewives2OCVALaunchApr09.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Emojione_1F379.svg/16px-Emojione_1F379.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Vicki_Gunvalson_2009_cropped.jpg/170px-Vicki_Gunvalson_2009_cropped.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Emojione_1F338.svg/16px-Emojione_1F338.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Emojione_1F351.svg/16px-Emojione_1F351.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/9/90/THE_REAL_HOUSEWIVES_OF_ORANGE_COUNTY_LOGO_NEW.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Emojione_1F68B.svg/16px-Emojione_1F68B.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/9/90/THE_REAL_HOUSEWIVES_OF_ORANGE_COUNTY_LOGO_NEW.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Real_Housewives_of_Orange_County", "title": "The Real Housewives of Orange County", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/9/90/THE_REAL_HOUSEWIVES_OF_ORANGE_COUNTY_LOGO_NEW.png", "width": 640, "height": 210}, "title": "The Real Housewives of Orange County - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}