{"url": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-august-carpool-karaoke-watch-will-smith-and-1502295571-htmlstory.html", "text": "‘True Detective’ season three, starring Oscar winner Mahershala Ali, is officially confirmed at HBO By Sarah Rodman Mahershala Ali accepting his Oscar for “Moonlight.” The actor will star in the third season of the HBO drama “True Detective” (Marcus Yam / Los Angeles Times) During the HBO executive session at the summer edition of the Television Critics Assn. press tour, programming president Casey Bloys confirmed reports that “Moonlight” Oscar winner Mahershala Ali would star in a third season of “True Detective.” Although he was mum at the time on when it might happen, he did say that he had read five scripts and thought they were “terrific.” Thursday night, the premium pay cabler released a statement officially confirming that the series will indeed return for a third installment. While no episode count or premiere date was included in the release, an enclosed synopsis stated that the next iteration of the show “tells the story of a macabre crime in the heart of the Ozarks, and a mystery that deepens over decades and plays out in three separate time periods.” Ali will star as Wayne Hays, a state police detective from northwest Arkansas. (Ali follows in the footsteps of season one stars, and continuing executive producers, Matthew McConaughey and Woody Harrelson, and season two’s Colin Farrell and Vince Vaughn. No word yet on whether he’ll have a partner.) The show will once again be helmed by creator Nic Pizzolatto, who penned all the episodes of the upcoming series, save the fourth, which he co-wrote with David Milch (“Deadwood,” “NYPD Blue”). He will share directing duties with fellow executive producer Jeremy Saulnier (“Blue Ruin.”) “I’m tremendously thrilled to be working with artists at the level of Mahershala and Jeremy,” said Pizzolatto in a statement. “I hope the material can do justice to their talents, and we’re all very excited to tell this story.” Bloys noted that “Nic has written truly remarkable scripts. With his ambitious vision and Mahershala Ali and Jeremy Saulnier aboard, we are excited to embark on the next installment of ‘True Detective.’ ” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nNewly reopened Angels Flight has long been a popular L.A. shooting location By Mark Olsen It’s among the more unusual landmarks in Los Angeles, a short, steep railway that gets people up and down a single hill. So it makes sense that Angels Flight has been featured in many movies and television shows over the years. Angels Flight resumed regular service Thursday after being closed since 2013 (it did operate for one day of shooting on “La La Land”). It remains to be seen if it starts to appear again in movies and television shows. (Not that it ever really stopped.) Speaking to The Times at last year’s Toronto International Film Festival, “La La Land” star Ryan Gosling reflected on the use of historic locations in the movie. “This was an opportunity to show an L.A. that’s still there.... You’ve got to squint your eyes a little, but there are still places in L.A. that are still part of the golden years of Los Angeles when Hollywood was in its heyday,” Gosling said. “I lived around the corner for a long time from Angels Flight and Grand Central Market, although I never got to ride Angels Flight because it had been shut down,” Gosling added. “Those places are still there... these gems that are there, and we were able to shoot them one by one.” Angels Flight reopened on Thursday. (Myung J. Chun / Los Angeles Times) The small piece of land next to the top of Angels Flight, known as Angels Knoll, was also prominently featured in “(500) Days of Summer.” The location has appeared in a wide variety of movies over the years, as early as 1916’s “Good Night, Nurse,” 1918’s “Up She Goes” and 1920’s “All Jazzed Up.” It has also had high-profile cameos in “Act of Violence” (1949), “M” (1951), “Kiss Me Deadly” (1955), “The Exiles” (1961), “The Incredibly Strange Creatures Who Stopped Living and Became Mixed-Up Zombies” (1963) -- all the way up to to 2011’s “The Muppets” and last year’s “La La Land.” And on television, Angels Flight has been seen on “Perry Mason,” “Dragnet” and the recent series “Bosch.” READ MORE: Angels Flight: How it works and what it’s been through in its 100-year history Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nJamie Foxx announces telethon for Harvey relief By Libby Hill (Andrew Krech / News & Record via Associated Press) A new stream of celebrity support for victims of Hurricane Harvey opened Wednesday, as Jamie Foxx announced that a telethon fundraiser is in the works. In an Instagram post where the actor revealed his own donation of $25,000 to GlobalGiving, Foxx also shared preliminary plans for the upcoming benefit. “From a fellow Texan, my heart goes out. My prayers go out,” Foxx, from Terrell east of Dallas, said. “September 12 we have a telethon that we’re doing. We’ll give you more details, so we can raise as much money as we can for everybody down there.” View Instagram post Scooter Braun, talent manager and mastermind of One Love Manchester, is helming the event along with rapper and Houston native Bun B. TMZ reported that Foxx, Reese Witherspoon, Blake Shelton, Hilary Duff and Michael Strahan are all involved with the project, with commitments from the four major broadcast networks to air the special for an hour on Sept. 12. In an interview with TMZ, Bun B said that fellow Houston natives Beyoncé and Jim Parsons are high on his wish list for the telethon. The outlet also reported that Bun B would only want President Trump’s presence if it was via a show of unity with other former presidents. Solange also announced Wednesday that she will be holding a benefit show at Boston’s Orpheum Theatre on Sept. 28. Featuring the Sun Ra Arkestra, the performance is titled “Orion’s Rise” and all proceeds will go to Hurricane Harvey relief. View Instagram post Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nGwyneth Paltrow’s love life? Yeah, she admits she’s screwed up plenty of relationships By Libby Hill Gwyneth Paltrow takes full responsibility for her romantic failings. She admitted as much in a recent interview with the podcast Girlboss Radio, during which Paltrow went deep on some of her lost loves. “Oh, my god, I’ve [screwed] up so many relationships, so many,” Paltrow said. “I’m actually a pretty good friend and a good sister and a daughter and a mother, but I am at my potentially most vulnerable … in the romantic slice of the pie. So it’s taken me a lot of work to get to the place where I have a good romantic relationship.” Paltrow “consciously uncoupled” from ex-husband Chris Martin in 2014 after 10 years of marriage and has been romantically linked to “American Horror Story” creator Brad Falchuk for the past three years. On Girlboss Radio, Paltrow sent a shout-out to former beau Brad Pitt, whom she dated from 1994 through 1997, and was at one point engaged to. “I [screwed] that up, Brad,” Paltrow said. Paltrow also delved into her experiences as founder and CEO of her lifestyle brand Goop, sharing that once she’s in the boardroom with investors, no one cares if she’s a celebrity. “I go into the room, and for the first 90 seconds, I’m Gwyneth Paltrow,” she said. “And they’re like, ‘Oh, my god, my wife loves you .... And then, about 90 seconds later, I’m just getting grilled like anyone else.” But she doesn’t get offended; she relishes the challenge. “It was such a beautiful chapter of my life when I started raising [venture capital financing], because it knocked me down so many pegs. I was like, ‘Oh, I’m, like, no one. I’m nothing. This [stuff] is real.’ I have to know the most granular aspects of my business and be able to defend it. The celebrity just completely drains out of the room. It’s irrelevant,” she said. Paltrow’s full conversation with Sophia Amoruso can be streamed at Girlboss. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nLongtime ‘Simpsons’ composer Alf Clausen fired from the show after 27 years By Randall Roberts When the 29th season of “The Simpsons” premieres in the fall, it will, for the first time in decades, be doing so without its longtime musical contributor, Alf Clausen. Clausen, who composed the Fox animated show’s incidental music, was told that the show was looking for “a different kind of music” moving forward, according to Variety. Clausen confirmed his firing via Twitter. Thank you for all of the support...unfortunately, the news is true... https://t.co/jBQH0b40cz — Alf Clausen (@TheAlfClausen) August 31, 2017 The composer’s orchestral scores supported the family’s foibles since the show’s primitively drawn early days. And although “The Simpsons” theme song was penned by Danny Elfman, the sonic feel of the series has been defined by Clausen’s grandiose, often epic productions. He’s responsible for scoring Mr. Burns’ breakout “See My Vest” moment and crafted the tunes for the Springfield musical theater company’s “A Streetcar Named Desire” adaptation. Ditto “The Planet of the Apes” musical. In short, nearly every classic music moment of “The Simpsons” has featured Clausen’s fingerprints. On Twitter, fans thanked Clausen for his work while expressing outrage at the circumstances surrounding his departure. “Fired over the phone, yet,” wrote one user. Clausen quickly corrected him with a one-word reply: “Email ...” On Thursday, producers for “The Simpsons” issued a statement to Variety. It stressed that Clausen will continue to contribute to the series: “We tremendously value Alf Clausen’s contributions to ‘The Simpsons’ and he will continue to have an ongoing role in the show. We remain committed to the finest in music for ‘The Simpsons,’ absolutely including orchestral.” The statement concluded: “This is the part where we would make a joke but neither Alf’s work nor the music of ‘The Simpsons’ is treated as anything but seriously by us.” Update, 1:16 p.m.: This story was updated with a statement from “The Simpsons.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nInstead of statues, Trevor Noah and Roy Wood Jr. have another idea for honoring Confederate history By Chris Barton With the country still reeling from the harrowing impact of Hurricane Harvey in Texas, Wednesday night’s “Daily Show” looked at one of the summer’s ongoing controversies: Confederate monuments. Occasionally setting aside the show’s usual comedic tone, Trevor Noah enlisted correspondent Roy Wood Jr. to consider whether these statues honor Southern heritage, as their supporters claim, or the nation’s history and lingering problem with racism. After showing a montage of guests on network news shows who reminded viewers that these statues were erected during the Jim Crow era, decades after the Civil War, Wood equated slavery to another tragedy. “It’s like if a woman got out of an abusive relationship and then she had to keep pictures of her ex up in her house to remember the time,” a straight-faced Wood explained. “No, I don’t need pictures to remember pain.” “People say, ‘We want to remember the history of the Civil War,’” Noah added. “There’s an easier way to remember what happened in the Civil War: Just walk around in the South. And if you see free black people, then you know what happened.” Watch the segment above. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nGloria Gaynor sings to Texas’ Harvey victims: ‘You will survive’ By Christie D’Zurilla (Astrid Stawiarz / Getty Images) Gloria Gaynor wants people affected by Harvey to know they will survive, and she’s communicating that message through a new version of the song that has defined her career. Gaynor, whose “I Will Survive” became an anthem over the years, rewrote the 1978 disco hit to reach out to victims in Texas and posted her rendition on social media Wednesday. “Hi, my neighbors in Texas,” she said in a video shot while she sat at a piano she was about to play. “This is Gloria Gaynor with a song that hopefully will cheer you up just a little bit.” @SylvesterTurner @rashivats @SallyMacFox26 @TheRitaGarcia @kaitlinmonte @ChrisdyannUribe @MsCoCoDominguez @JMartinFOX26 TX WILL SURVIVE 💪🏽❤️ pic.twitter.com/FCNOnDr85o — Gloria Gaynor (@gloriagaynor) August 30, 2017 Here are the tweaked lyrics, for those who don’t want to hit “play” with the sound on. First we were afraid\n\nWe were petrified\n\nThinking Texas couldn’t live\n\nWith floodwaters this high\n\nWe know you spent plenty of time\n\nPreparing for this hurricane\n\nWho could’ve known that it would come\n\nWith so much devastating rain\n\nBut we will strive\n\nAnd you’ll survive\n\nWith all our love and help and prayers\n\nWe will stay strongly by your side\n\nWe are your neighbors tried and true\n\nWe’ll do all we can for you\n\nAnd you’ll survive\n\nYou will survive, you will survive Similarly on Monday night, Coldplay unleashed a new original song written after the band was forced to cancel its Friday show in Houston with Hurricane Harvey bearing down. “This is a new song, and we’ll never play it again,” frontman Chris Martin told an audience in Miami. “It’s a once-off. It’s called ‘Houston.’ We’re going to sing it in Miami for everybody here, and then we’re going to send it over there to everyone who missed the show.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nLeonardo DiCaprio Foundation donates $1 million to Harvey recovery By Christie D’Zurilla (Kirk McKoy / Los Angeles Times) Leonardo DiCaprio has stepped up with a $1-million donation to aid the victims of Hurricane Harvey, now a tropical storm, which has dumped historic levels of rain on the Gulf Coast over the last several days. United Way Worldwide announced Wednesday that it has started the United Way Harvey Recovery Fund with a seven-figure donation from the Leonardo DiCaprio Foundation. The money — 100% of it, according to the charity — will go to help victims of flooding with mid- and long-term recovery over the coming years. There are 23 United Ways that operate in the path of the storm, which made landfall Aug. 24. “We are incredibly grateful for the generosity of Leonardo DiCaprio and his foundation,” United Way Worldwide President and CEO Brian Gallagher said in a statement. “Responding to Hurricane Harvey requires the best of all of us — and that’s what this gift represents.” DiCaprio has been urging support of the United Way and American Red Cross this week on his Twitter account and retweeting stories talking about Harvey and climate change. Di Caprio’s foundation “has been committed to climate-related issues and environmental projects since 1998,” Terry Tamminen, president and CEO of the foundation, said in a statement. “We support efforts to build climate resilient communities and protect vulnerable wildlife and ecosystems across the planet, and have supported disaster relief and victim funds in the past. We hope others will step up and support the United Way and other organizations.” Earlier this week, Sandra Bullock, who has a home in Texas, gave $1 million to the American Red Cross, repeating the lump-sum generosity she showed after the 2011 earthquake and tsunami in Japan and the Sept. 11 terrorist attacks in the U.S. Ellen DeGeneres was also in the seven-figure donation tier. The comic and talk-show host dropped $1 million in the relief bucket on Wednesday via J.J. Watt’s foundation. The effort by the Houston Texans’ star player topped $10 million on Thursday, with Watt chronicling its progress all week via videos on social media. Update, 8:50 a.m.: This post was updated with information about DeGeneres’ donation to Watt’s fund. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nA Star Is Born: Chris Tucker turns 45 today By Los Angeles Times Staff (Iris Schneider / Los Angeles Times) I had a dream as a kid: I wanted to be big, big like Richard [Pryor] and Eddie [Murphy]. I imagined it. I studied it. I had a passion. — Chris Tucker, 2001 FROM THE ARCHIVES: In a Big Rush Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\n‘Springsteen on Broadway’ was born to run, is extended through February By Libby Hill Bruce Springsteen’s solo shows on Broadway have been extended through February, just hours after the original run sold out. (Greg Allen / Invision/Associated Press) Good news for Bruce Springsteen fans who were locked out of purchasing tickets Wednesday morning for his upcoming run of shows on Broadway. Ticketmaster announced that “Springsteen on Broadway,” an intimate stage experience that launches in October and features the rock legend performing solo, will be extending for 10 additional weeks. Originally scheduled to close in November, the show was extended through February after the original block of tickets sold out in a matter of minutes Wednesday. \"#SpringsteenBroadway has been EXTENDED!” the ticket outlet tweeted, with a follow-up tweet explaining that fans who had previously registered to purchase tickets will not have to register again. #SpringsteenBroadway has been EXTENDED!\n\nMore information coming today.\n\nThere will NOT be any additional codes released for today's onsale. pic.twitter.com/xGY3rj3Yrl — Ticketmaster (@Ticketmaster) August 30, 2017 #SpringsteenBroadway extended run information ⬇️\n\n🚨YOU DO NOT HAVE TO REGISTER AGAIN!🚨\n\nNEW #VerifiedFan registration: https://t.co/2xNBBhcVES pic.twitter.com/FT3mLaTLPV — Ticketmaster (@Ticketmaster) August 30, 2017 Springsteen will be performing at New York City’s Walter Kerr Theater, which houses fewer than 1,000 seats. To curtail ticket scalping, Ticketmaster relied on its Verified Fan program. The program forces fans to register to even have an opportunity to purchase tickets and are limited to two tickets per purchase. For all of Ticketmaster’s efforts, resale sites already are flooded with “Springsteen on Broadway” tickets, with some reaching $10,000 apiece. Fans interested in trying their luck for the second batch of performance dates will need to register with Ticketmaster Verified Fan by Sept. 3 (at 7 p.m. Pacific). Tickets will be available for purchase 10 a.m. Pacific on Sept. 7. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nSandra Bullock donates $1 million to Harvey relief efforts By Libby Hill Sandra Bullock donated $1 million to the American Red Cross for storm relief. (Wally Skalij / Los Angeles Times) With the Gulf Coast still battling the aftereffects of Tropical Storm Harvey, celebrities continue to come forward to help with relief efforts for the humanitarian crisis. Sandra Bullock, who has a home in Texas, donated $1 million to the American Red Cross’ emergency efforts, the organization confirmed to The Times on Wednesday. “We are so thankful for the overwhelming and generous response from those who want to help those affected by this devastating storm,” Elizabeth Penniman, vice president of communications for American Red Cross national headquarters, said in an email. “Massive disasters like Hurricane Harvey create many critical and immediate needs, so we are heartened by donations like this – which allow us to provide immediate shelter, food and comfort to thousands in need,” Penniman continued. “The entertainment community has been so supportive to the Red Cross in response to this devastating disaster, and we are so grateful.” Bullock is just the latest star who has donated to recovery efforts in Texas. The Kardashian family pledged $500,000 to the Salvation Army and Red Cross on Tuesday. Kevin Hart also spearheaded a celebrity-driven fundraising campaign on Crowdrise that has brought in more than $1 million for the Red Cross. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nCorinne Olympios wants DeMario Jackson to know she doesn’t blame him for anything By Christie D’Zurilla Corinne Olympios doesn’t have any hard feelings toward DeMario Jackson, the fellow “Bachelor in Paradise” cast member who was with her at the center of a scandal that shut down production on the reality TV series in June. “I don’t blame DeMario. I never pointed fingers at DeMario. I never said a bad word about DeMario,” the 25-year-old told host Chris Harrison in an early-August taped interview that aired Tuesday night on ABC. She and Jackson haven’t spoken since production was halted after allegations of misconduct were made by a producer, leading to an investigation of what happened during a period when, Olympios now says, she was blacked out. “I was almost a little bit nervous to talk to [DeMario], because he did run to the media and I didn’t want to add fuel to the fire,” she said. Before she had a chance to collect her thoughts, he was out there and “so on the defensive,” she said. “He was doing his thing and I didn’t want to get messed up in that. ... I can’t help but feel like maybe he felt like I thought he did something to me.” Jackson did not do anything bad, she insisted. Seeing him start crying in a clip from his own interview with Harrison, which had aired on the show last week, Olympios welled up a bit too. “It was hard for me to go through something like that. I know exactly how he feels. The media wants to paint you a certain way that you know you’re just not,” she said. Olympios told Harrison the same things she had said in a Tuesday morning interview with “Good Morning America” about blacking out from drinking too much and mixing alcohol with medication. However, she didn’t directly address her “I am a victim” statement that was released at the height of the scandal. On “GMA,” she said she meant she was a victim of the media. Regarding “Bachelor in Paradise” with Harrison, she simply talked about how awful it was to have so many people acting like they had been there or were suddenly experts on her life. “To even get up and go get eggs at the grocery store ... my face was all over every magazine and I had to check out and everyone’s staring,” Olympios said. “You’re looking at them and it’s like, ‘I’m not what you’re thinking right now.’” Then, near the end of the interview, she shared one big wish. “Obviously hindsight is 20/20,” she said, “and I wish it could have been handled differently.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nTomi Lahren finds new home at Fox News By Libby Hill Conservative firebrand Tomi Lahren is again gainfully employed after being fired from Glenn Beck’s The Blaze in March. On Wednesday, Lahren announced via her Facebook page that she is joining the Fox News team as a contributor. “This exciting new step will allow me to give voice to all the America-loving patriots who have had my back since day one,” Lahren wrote. “I will remain a solid and passionate advocate for you.” Though 25-year-old Lahren has made television appearances before -- including a contentious appearance on “The Daily Show With Trevor Noah” -- much of her career has been in digital media. She hosted “On Point With Tomi Lahren” for One America News Network, and her “Final Thought” videos have garnered her over 4.4 million Facebook followers. In addition to her role as a contributor, Lahren will also have a “signature role” on a Fox News digital product in development, according to a press release issued by the network. Lahren makes her debut on Wednesday’s edition of “Hannity” at 7 p.m. PDT. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nTrevor Noah is shocked — shocked — by the latest revelations about Trump and Moscow By Robert Lloyd Even as the Earth offers humanity another taste of its weather future — and President Trump keeps Sheriff Joe Arpaio out of jail and North Korean missiles fly over Japan — late-night TV hosts have disappeared from their chairs as if it were August in France. Trevor Noah is on the job, though, hosting “The Daily Show.” Tuesday night, he had some mirthful words about the ongoing investigation into the Trump campaign’s Russian affairs. Specifically, he reflected on the revelation of a letter of intent, signed by POTUS himself, to build a Trump Tower skyscraper in Moscow — and make it the tallest building in the world — despite Trump’s repeated claims to have no business, no interests, no nothing in Russia. “How can one person lie so big? HOW?” Noah asked, amazedly. “It’s like if your friend said he had never heard of Mumford and Sons and then one day you see the album cover and you’re like, wait a minute, you’re Mumford.” Were those connections “strictly business, or were they getting out on the votey-votey action? That’s not clear yet,” he said. What was clear is that a typically dubious character was at the center of it — namely Felix Sater, a Russian-born real estate developer once convicted of stabbing a man in the neck and face with the stem of a broken margarita glass. “Of all the glasses to stab someone with, a margarita glass is the worst,” Noah said. “You’re literally putting salt into the wounds.” There was also a conviction for Sater’s involvement in a $40-million stock fraud, Noah added, which came as no surprise to the host. “You never trust someone with a cat name. If a human goes by Felix or Whiskers or Mittens, you should probably just stay away.” There were emails, of course; there are always emails. “Buddy, our boy can become President of the USA and we can engineer it. I will get all of Putin’s team to buy in on this,” Sater wrote to Trump’s personal lawyer, Michael D. Cohen. “This buddy boy email may not be the smoking gun for Trump,” Noah concluded, “but what it could end up being is the broken taillight — the thing that gives law enforcement the excuse they need to look into Trump’s trunk. “And we all know,” he said, as a picture of the golfing president’s derriere appeared over his shoulder, “he’s got a lot of junk in that trunk.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nJury president Annette Bening addresses lack of female representation at Venice Film Festival By Nardine Saad (Claudio Onorati / Associated Press) Though there aren’t as many women represented at this year’s Venice Film Festival as she would like, jury president Annette Bening believes “things are changing.” The four-time Oscar nominee, whose film credits include “American Beauty,” “The Kids Are All Right,” “20th Century Women” and “Bugsy,” addressed the lack of female directors Wednesday during the 74th annual Venice Film Festival‘s opening press conference. (Only one of the 21 films in competition is directed by a woman this year.) “As women, we have to be sharp, shrewd and creative in what we choose to make. Sexism does exist and there is no question about it. But things are changing,” the actress said at the opening press conference, according to Variety. “The more we can make films that speak to everybody, the more we will be regarded as filmmakers,” she added. Bening, the first woman to chair the jury in more than a decade, said she knew of both veteran and rookie filmmakers struggling to get their movies made “whether they are men or women.” She said the industry has “a long way to go, in terms of parity” but was confident that the “direction we’re going is positive.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nA Star Is Born: Lisa Ling turns 44 today By Los Angeles Times Staff (Al Seib / Los Angeles Times) [People have said to me], ‘When you were in the world’s largest slum [in India], you could almost smell what it was like by your expression.' It’s not that I’m trying to force myself on the viewer. I’m just their eyes and ears. I think our work is quite pure. — Lisa Ling, 1997 FROM THE ARCHIVES: Taking news personally Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nIn wake of Charlottesville strife, Virginia Film Festival to host director Spike Lee as special guest By Josh Rottenberg Director Spike Lee photographed in 2015. (Ricardo DeAratanha / Los Angeles Times) As the city of Charlottesville, Va., and the nation as a whole continues to grapple with the violent racial strife that erupted earlier this month, the Virginia Film Festival announced on Tuesday that it will host filmmaker Spike Lee as a special guest at the upcoming festival as part of a program around the legacy of slavery. Lee, who has tackled thorny issues of race throughout his career, will present his Oscar-nominated documentary “4 Little Girls” about the 1963 bombing of a Baptist church in Birmingham, Ala., that claimed the lives of four African American girls, an act of white supremacist terrorism that marked a pivotal moment in the civil rights movement. “We have for many years been interested in bringing Spike Lee to the Virginia Film Festival as he remains one of the most talented, innovative, and socially conscious filmmakers in our world today,” said Jody Kielbasa, director of the film festival and vice provost for the arts at the University of Virginia. “We first reached out to Mr. Lee in the spring to include him in our upcoming collaboration with Montpelier, and of course, the recent events in Charlottesville have made his participation more compelling, relevant and vital.” The festival program will also include a short film titled “I Can’t Breathe” that combines footage of the 2014 chokehold death of Eric Garner during his arrest by a New York City police officer with footage of the death of Radio Raheem under similar circumstances in Lee’s 1989 film “Do the Right Thing. The program is part of a larger collaboration with Montpelier, the Virginia plantation of President James Madison, who owned more than 100 slaves, that will explore both how the legacy of slavery continues to affect the lives of African Americans and how they are depicted in film and other media. The 30th annual Virginia Film Festival will run from Nov. 9 to 12 in Charlottesville. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nJerry Seinfeld recaps childhood in Netflix’s first ‘Jerry Before Seinfeld’ trailer By Nardine Saad The first trailer for Netflix’s stand-up special “Jerry Before Seinfeld” has arrived, and it’s a madcap recap of Jerry Seinfeld’s humble beginnings, quirky family dynamics and bits of everyday observations. The teaser opens with Johnny Carson introducing the iconic comic in 1981 during his debut on “The Tonight Show.” Then it showcases the sitcom star back at the mike at the Comic Strip, the famous New York comedy club where he launched his career. Throwback photos, videos and interviews with Seinfeld are woven throughout. “He’s back where he began,” the title reads, “doing what he loves.” The original comedy special is the first of two stand-up specials Seinfeld will deliver in his massive deal with the streaming giant. (The deal also includes the entirety of his “Comedians in Cars Getting Coffee” catalog and 24 new episodes of the Emmy-nominated talk show, which will launch later this year.) Seinfeld and Netflix teased to the special last week with several clips posted on Instagram and a close-up look at the numerous legal pads scrawled with handwritten jokes he’s kept from the 1970s. “Jerry Before Seinfeld” begins streaming Sept. 19. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nKermit the Frog finds his new voice in Matt Vogel By Nardine Saad The new Kermit the Frog has arrived and he’s following his dreams -- literally. New Muppeteer Matt Vogel made his vocal debut as the iconic frog on Monday in a “Muppet Thought of the Week” video posted on YouTube. “Dreams are how we figure out where we want to go. Life is how we get there,” he says in the brief clip. “I’m headed this way.” The veteran voice actor has worked on “Sesame Street” and also operates the Muppets Floyd, Constantine and Sweetums. He is only the third puppeteer to take on Kermit the Frog full time since the character was created in 1955. He replaced former puppeteer Steve Whitmire, who began work on “The Muppet Show” in 1978 and inherited the role of Kermit when creator Jim Henson died in 1990. Whitmire was dismissed over concerns about his “repeated unacceptable business conduct over a period of many years and he consistently failed to address the feedback,” the Muppets Studio said at the time. Whitmire claimed he was fired in October 2016 and kept quiet about it until Vogel was announced as his replacement in July. It was his “opinionated communication style” that earned him his walking papers, he said. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nTrevor Noah says Trump’s pardon of Sheriff Arpaio renders courts powerless By Nardine Saad “The Daily Show” host Trevor Noah broke down former Arizona Sheriff Joe Arpaio’s presidential pardon on Monday, explaining how President Trump’s decision undermines the judicial branch of government. The controversial Maricopa County lawman, who was convicted of criminal contempt of court for violating Latinos’ rights, earned himself a thuggish reputation as a sheriff, Noah said, citing his agency’s use of tent cities, stun guns, jail overcrowding and numerous cases of inmate deaths and police brutality. But those were “just his extracurriculars,” Noah said. “It turns out his full-time job is racism.” The 85-year-old Arpaio was found guilty in July of defying a 2011 court order barring officers from stopping and detaining Latino motorists to check their immigration status. “As much as Sheriff Arpaio presented himself as anti-illegal immigrants, it turned out really he was just anti being a decent human being,” Noah said. When the president of the United States steps in and pardons someone’s contempt conviction, he’s essentially rendering the courts powerless. — ‘Daily Show’ host Trevor Noah His abuses hurt inmates and taxpayers, costing the state $142 million in legal fees, settlements and compliance costs, Noah said. Other things they could have spent that money on? “Schools, roads or they could have just paid Conor McGregor and Floyd Mayweather to just punch Arpaio in the face.” But Noah made the point that Trump’s decision completely undercut the judiciary. “Remember how the three branches of government are supposed to be equal? Well, convicting someone of contempt is the one and only way the judicial branch can put muscle behind its decisions. So when the president of the United States steps in and pardons someone’s contempt conviction, he’s essentially rendering the courts powerless,” he said. Watch the full segment above. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nWatch Coldplay dedicate new song to Harvey victims -- and vow never to play it again By Randall Roberts (Jens Meyer / Associated Press) On Monday night in Miami, Coldplay’s Chris Martin drew attention to the victims of Tropical Storm Harvey by unveiling a new song called “Houston” -- and then vowed never to play it again. The band, which was forced to cancel its Houston show days earlier due to the storm, wrote the song as the region was enduring historic flooding. After acknowledging that he and the band all “grew up loving country music, and, of course, that’s kind of what we think of when we go to Texas,” Martin asked the crowd to bear with them. “This is a new song, and we’ll never play it again,” Martin said. “It’s a once-off. It’s called ‘Houston.’ We’re going to sing it in Miami for everybody here and then we’re going to send it over there to everyone who missed the show.” Vowing to return to Houston, Martin and band huddled and tentatively started a twangy little number. “I’m dreaming of when I get back to Houston,” sang Martin, replete with a touch of Johnny Cash-ian twang. Describing it as “that city where they send you into space,” Martin crooned of “Corpus Christi, Harris County, Galveston,” of “a harmony that hums down there in Houston,” and urged the region to “keep on keeping on.” Merle Haggard it wasn’t (and everyone’s a critic), but the performance drew huge applause from fans and went viral on Tuesday morning. Coldplay’s quick-turnaround ditty is hardly the first to document such deluges. Johnny Cash’s “Three Feet High and Rising” occurred in real time as a family struggled to keep dry. In Charley Patton’s “High Water Everywhere,” the country blues singer recalled the lives lost in the Great Flood of 1927, which consumed the Mississippi Delta and spawned dozens of songs: “Oh, Lordy, women is groaning down / Oh, Lordy, women and children sinking down,” Patton sang. “I couldn’t see nobody home, and was no one to be found.” Below is another song about the flood of ’27: Bessie Smith’s “Backwater Blues.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nCorinne Olympios on ‘Bachelor in Paradise’ scandal: ‘I was really a victim of the media’ By Christie D’Zurilla (Frazer Harrison / Getty Images) Corinne Olympios says medication, the booze and the media were key players in June’s production-stopping “Bachelor in Paradise” scandal and its aftermath. Calling the situation “just really unfortunate,” she said Tuesday on “Good Morning America” that she doesn’t remember anything that happened. Seeing video of what transpired on the first day of production on the looking-for-love reality show was “like watching not-me,” she said. “I’m watching someone else.” On that day, Olympios and fellow cast member DeMario Jackson allegedly wound up in the pool or hot tub together in a situation that a producer thought went too far. Allegations of “misconduct” were made, and production shut down the next day for an investigation that ultimately determined nothing untoward had happened. The show, sans Corinne and DeMario, premiered its fourth season Aug. 14, a week later than originally planned. “I did drink, too much, I definitely understand that,” Olympios said. “But I was also on a medication that severely blacks you out and impairs your judgment and messes with your balance, that I didn’t know you were not supposed to not drink on, and so it really just caused a horrible, horrible blackout. It was like I went under like anesthesia and then just like woke up.” She’s now weaning off the medication, she said, and cutting down on her drinking. But in explaining her provocative official statement that she was “a victim” living out her “worst nightmare,” Olympios revealed her specific definition of victimhood, which had little or nothing to do with consent, which was a hot topic throughout the scandal. “I was really a victim of the media,” Olympios said. “It was just, all of a sudden people became an expert on the situation and on what happened, and it was like, I’m still trying to figure out exactly what happened. It was just horrible to deal with. “It got really, really bad. ...,” she added. “The things people say are just insane.” When the remaining “Paradise” cast met as a whole on the first episode of the season, their sympathies seemed to lie with Jackson as they worried about the long-term effects the scandal would have on him and any future career opportunities, especially given the lingering racial issues of alleged misconduct between a white woman and a black man. However, they were quick to say they were not “slut-shaming” Olympios either. Jackson spoke last week on “Bachelor in Paradise,” sitting down with host Chris Harrison to give his take on what happened. Here’s a taste of that, courtesy of “GMA”: Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nVictoria’s Secret Fashion Show heads to Shanghai this year By Nardine Saad Angels will fly over the Great Wall of China in November as the Victoria’s Secret Fashion Show heads to Shanghai for the first time. Supermodels Adriana Lima, Alessandra Ambrosio, Behati Prinsloo, Candice Swanepoel, Lily Aldridge and more will strut their stuff for the annual lingerie extravaganza, Victoria’s Secret and CBS said in a statement on Tuesday. The iconic pre-holiday show — replete with teensy underwear and massive angel wings — is usually filmed in New York, but Miami, Los Angeles and London have also hosted the scantily clad runway walk. The broadcast will air on CBS on Nov. 28 and will be shown in more than 190 countries. Models Elsa Hosk, Jasmine Tookes, Josephine Skriver, Lais Ribeiro, Martha Hunt, Romee Strijd, Sara Sampaio, Stella Maxwell and Taylor Hill will also walk in this year’s show. Musical performers will be announced at a later date, the statement said. Ni hao, China! This year's #VSFashionShow is headed to Shanghai. Watch it Nov 28, 10/9C on @CBS. Learn more: https://t.co/AHWHWjKOCI pic.twitter.com/tgIVJs7Lsr — Victoria's Secret (@VictoriasSecret) August 29, 2017 Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nA Star Is Born: William Friedkin turns 82 today By Los Angeles Times Staff (Carolyn Cole / Los Angeles Times) I love the experience of making films. I love the mud. I love the dirt. I love all the inconveniences. That’s why you do it. If you do it because you’re looking to be the Great American film maker, you’re liable to experience disappointment. — William Friedkin, 1989 FROM THE ARCHIVES: The Exorcisms of William Friedkin Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nTaylor Swift’s ‘Look What You Made Me Do’ video bashes another YouTube record By Randy Lewis Taylor Swift’s official video for her first new music in three years, “Look What You Made Me Do,” has blasted through the existing YouTube record for most views tallied during its first 24 hours of release. The clip logged 43.2 million views since the video was posted Sunday evening. That far surpasses the record set in 2013 by Korean pop star Psy’s “Gentleman,” which racked up 36 million views in its first day. It also hasn’t slowed interest in Swift’s previously released lyric video for the same song, which set a record for lyric video viewership by drawing 19 million views in the first 24 hours. That version has now surpassed 47 million views in less than four days. Both videos have generated flurries of debate and analysis among Swift’s fans and her dissenters, the former seemingly outnumbering the latter by a margin of nearly 5 to 1. Likes have surpassed the 1 million mark, while dislikes stood at 232,000 at the 24-hour mark. The song is the first single from her forthcoming album “Reputation,” due Nov. 10. It will be Swift’s sixth studio album. Each of her last three albums sold more than 1 million copies during the first week of release. Swift is the only artist with that achievement to her credit. Update Aug. 29, 10:30 a.m.: This post has been updated with the finalized 24-hour viewer total. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nWatch the ‘Game of Thrones’ cast and crew break down some of Season 7’s best scenes By Tracy Brown “Game of Thrones” Season 7 may have concluded Sunday, but there is still plenty left for fans to unpack before “Thrones\"-withdrawal sets in. Along with all the burning questions left in the wake of the season finale, HBO has left us with some behind-the-scenes videos from this season’s most epic moments. The production magic of “Game of Thrones” is undeniable and it extends to beyond special effects dragons. From Arya donning Walder Frey’s face to dole out her brand of vengeance to Daenerys walking into Dragonstone for the first time, there is plenty to explore from just the first episode alone. The video above dives deep into what it took to craft the Season 7 premiere, including how Cersei’s fancy new giant map came to be. Of course, plenty of fans are probably still contemplating the latest episode and what Jon and Dany’s new level of intimacy means going into the final season. Can this be how the actual prince that was promised is conceived? And if you were a bit squicked out by the pair’s developing relationship, you’re not alone. Unlike Jon and Daenerys, Emilia Clarke and Kit Harington are definitely aware that they are both Targaryens. “For us as actors it’s just weird,” said Clarke in a video about the coupling. “The reality of what they are to each other.” In fact, the actors had more facial expressions and sound effects to convey their feelings about this union than words. Watch in the video below. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nEd Skrein leaves ‘Hellboy’ after ‘whitewashing’ furor By Christie D’Zurilla (Jordan Strauss / Associated Press) Ed Skrein will not play Maj. Ben Daimio in a reboot of “Hellboy,” the English actor said Monday, noting that when he accepted the role he didn’t know that in the comics the character was of mixed Asian descent. Just a week ago, Skrein had tweeted his excitement over taking on the role. Backlash — in the form of “whitewashing” allegations — ensued. “It is clear that representing this character in a culturally accurate way holds significance for people, and that to neglect this responsibility would continue a worrying tendency to obscure ethnic minority stories and voices in the Arts,” the 34-year-old “Deadpool” actor said in a statement announcing that he had changed his mind about portraying Daimio. Calling it a “moral” decision, he said he was sad to leave the movie but hoped his action would make a difference in making equal representation in the arts a reality. David Harbour, the “Stranger Things” actor slated to play Hellboy, tweeted, “Hey internet. Thank you for your voices. An injustice was done and will be corrected. Many thanks to @edskrein for doing what is right.” Mike Mignola, who created the Hellboy comics, also thanked Skrein on Monday and said the move was “very nicely done.” Hey internet. Thank you for your voices.\n\n\n\nAn injustice was done and will be corrected.\n\n\n\nMany thanks to @edskrein for doing what is right.😈👊🙏 https://t.co/tUvP6YibgG — David Harbour (@DavidKHarbour) August 28, 2017 In addition to Harbour, the 2018 version of the story so far stars Milla Jovovich as Nimue, Ian McShane as Professor Broom and Alice Monaghan as Sasha Lane, according to IMDb. Neil Marshall, who among other things has helmed episodes of “Game of Thrones” and “Westworld,” is set to direct. The Daimio character didn’t appear in the 2004 or 2008 Guillermo del Toro films based on the “Hellboy” comics. Here’s Skrein’s full explanation: pic.twitter.com/8WoSsHXDFO — Ed Skrein (@edskrein) August 28, 2017 Updated, 2:39 p.m.: This story was updated with comments from Harbour and Mignola. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nKathy Griffin and Anderson Cooper are super-friends no more By Libby Hill Anderson Cooper and Kathy Griffin (Rob Kim / Getty Images) What began as a tasteless joke at the expense of President Trump continues to have real-life consequences for comedian Kathy Griffin. In an extensive interview with The Cut, Griffin admitted that her 17-year friendship with Anderson Cooper, with whom she co-hosted CNN’s New Year’s Eve gig for a decade, ended in the wake of the Trump controversy. In May, Griffin publicized a photo shoot that featured her holding a bloodied imitation severed head bearing a strong resemblance to the president. The backlash was immediate and largely bipartisan, as many saw the images as glorifying violence and furthering political division. Griffin quickly apologized for the misstep but the damage had been done, with condemnation from the White House, investigation by the Secret Service and the loss of several jobs, including her CNN gig. On May 30, Cooper tweeted his disapproval of Griffin’s artistic expression, calling it “disgusting and completely inappropriate,” and Griffin admitted at a June 2 news conference that Cooper’s comments hurt her. For the record, I am appalled by the photo shoot Kathy Griffin took part in. It is clearly disgusting and completely inappropriate. — Anderson Cooper (@andersoncooper) May 31, 2017 In July, Cooper appeared on Bravo’s “Watch What Happens Live With Andy Cohen” and stated that he and Griffin were still friends. “Yeah, we’re still friends, and look I said what I said about — I didn’t think what she said was appropriate, but I wish her the best and I hope she bounces back,” he stated. But Griffin claimed that at that point, nearly two months after the fact, she had yet to hear from Cooper privately. In reality, it wasn’t until Aug. 10 that Cooper finally reached out to Griffin in a series of text messages, CNN confirmed to The Cut — at which point Griffin informed him that their friendship was over. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nIn ‘One Mississippi’ Season 2 trailer, Tig Notaro prays for the gay to stay By Christie D’Zurilla Tig Notaro’s “One Mississippi” is coming back for a second season, one in which her character is getting used to life back in her small Mississippi hometown. Season 1 of the Amazon Prime Video series took viewers through a fictionalized series of events that echoed Notaro’s own life: a potentially deadly intestinal illness, breast cancer, a double mastectomy, the unexpected death of her beloved mother and a romantic breakup. Yup, it’s a dark comedy. In Season 2, L.A. transplant “Tig” is navigating her new environs, including strategizing about how to proceed with a crush on “Straight Kate” and dealing with some well-meaning, pray-the-gay-away critics of her radio show. Plus, there’s her stepfather’s whole dishwasher drill to contend with, not to mention the story line that has to do with sexual assault. The new season of “One Mississippi” starts streaming Sept. 8. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nWatch Frank Ocean’s lyric video for new song ‘Provider’ By Randall Roberts As is his wont these days, R&B superstar Frank Ocean unveiled a new song, “Provider,” his own way: during the newest installment of Blonded Radio, the Apple Music/Beats 1 radio show he hosts and curates. The ballad’s a meditation that name-checks Aphex Twin, shoegaze, Talking Heads, “Jaws,” Patagonia sportswear and Stanley Kubrick, and moves through verses without much regard for structure. Immediately following the Sunday premiere, Ocean dropped the lyric video on his website. Featuring a souped-up mini-boombox retrofitted with bigger speaker cones and a Velcro-attached machete, the clip suggests an owner getting ready to hunt prey while using “Provider” as the lure. Ocean hasn’t uploaded the clip to YouTube, but you can listen and watch on his blonded.co website. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\n‘Gone With the Wind,’ deemed ‘insensitive,’ has been pulled from a Memphis theater By Christie D’Zurilla “Gone With the Wind” will not be shown in the future by a Tennessee theater that decided it was “insensitive” to many in the local community. The 1939 movie, which marked the first Oscar win by a black actor, depicts a romanticized view of slavery and life on a Southern plantation before, during and after the Civil War. “Gone With the Wind,” which won 10 Academy Awards in 1940, including for best picture, had been shown by the Orpheum Theatre Group for years as part of an annual Summer Movie Series, according to Memphis’ Commercial-Appeal. At times, it was screened more than once a year, the paper said. This year, however, a different climate prevailed. “The recent screening of ‘Gone With the Wind’ at the Orpheum on Friday, Aug. 11, 2017, generated numerous comments,” Brett Batterson, president of the theater group, said Friday in a statement (via the New York Times). “The Orpheum carefully reviewed all of them. As an organization whose stated mission is to ‘entertain, educate and enlighten the communities it serves,’ the Orpheum cannot show a film that is insensitive to a large segment of its local population.” The majority of Memphis residents are black, according to the U.S. Census Bureau. The screening happened, coincidentally, on the day before a rally of white nationalists that turned violent in Charlottesville, Va. — a rally that has been followed by a national conversation about whether to purge monuments to Civil War generals and soldiers from public spaces. In an interview with the Commercial-Appeal, Batterson said the appropriateness of screening “Gone With the Wind” had been discussed “every year,” but “the social media storm this year really brought it home.” By Monday, comments on social media, including on the Facebook post announcing the screening, had shifted in large part to defense of “Gone With the Wind” as a product of its time that, despite its romanticized portrayal of the Old South and of slavery, was still part of movie history and worth showing on a big screen. The Orpheum did not respond Monday to The Times’ requests for comment. Hattie McDaniel’s Oscar win for supporting actress was a significant first but was also “loaded with a lot of political and racial issues given that the film was the classic archetype of the Mammy,” said Adilifu Nama, associate professor of African American Studies at Loyola Marymount University, speaking to The Times in 2014. McDaniel’s role of Mammy “is fundamentally a subservient role and is part of a film that is a Southern racial fantasy,” Nama said. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nTaylor Swift gets petty and Pink talks pretty in the must-see moments from MTV’s Video Music Awards By Libby Hill Were you too busy watching [spoiler] revealed as [spoiler] on Sunday night’s “Game of Thrones” finale to watch MTV’s Video Music Awards? Fear not! We’ve gathered up four must-see moments from the socially conscious affair (and one lackluster video debut from Taylor Swift) to keep you in the loop. Pink’s PowerPoint presentation It was a banner night for singer Pink, who received the Michael Jackson Video Vanguard Award for her body of work and used the occasion to share an anecdote about her daughter Willow. Recently, Pink stated, her daughter referred to herself as “the ugliest person she knew” and complained that she looked like a boy with long hair. At first, the “Raise Your Glass” singer was taken aback by her daughter’s words but soon swung into action, compiling an elaborate PowerPoint presentation about the history of androgynous rock stars, including Michael Jackson, David Bowie and Annie Lennox. Pink relayed a simple sentiment that most of us could learn a lot from: “So, baby, girl, we don’t change. We take the gravel and the shell and we make a pearl.” Logic talks emotions Plenty of artists used the VMAs stage to speak passionately about issues they care about, but few did so as extensively as rapper Logic. After his performance of “1-800-273-8255\" with Khalid and Alessia Cara, the title of which is the phone number of the National Suicide Prevention Lifeline, Logic talked about mental health and equality. Beginning at 3:50 in the above video, Logic first thanked the audience for giving him a platform to discuss the important issue of mental health. He then quickly pivoted to other pressing social issues including discrimination, sexism and domestic violence. “I don’t give a damn if you’re black, white or any color in between,” Logic said. “I don’t care if you’re Christian, you’re Muslim, you’re gay, you’re straight, I am gonna fight for your equality because I believe that we are all born equal, but we are not treated equally and that is why we must fight.” Jared Leto honors Chester Bennington Logic’s performance and subsequent speech were particularly moving given the past year’s loss of two rock musicians to suicide – Linkin Park’s Chester Bennington and Soundgarden’s Chris Cornell. Jared Leto, an Academy Award winner and frontman of Thirty Seconds to Mars, spoke about both men at Sunday’s ceremony. “MTV asked me to come here to say a few words about Chester and the late, great, Chris Cornell, two artists I had the absolute pleasure of touring with,” Leto said of the two singers who were also close friends. “Chester said of Chris, ‘Your voice was joy and pain and anger and forgiveness, love and heartache, all wrapped up into one,” Leto recalled. Leto also recounted his own memories of Bennington. “I think about his heart,” Leto said. “And I remember his voice. At once ferocious and delicate, that voice will live forever.” Fifth Harmony gets shady Despite the pleas for equality and the heartfelt speeches, there was still plenty of time for pettiness at the VMAs, as evidenced by Fifth Harmony‘s performance. As the group took the stage to perform its latest single, “Angel,” a mystery fifth member appeared in the lineup before being unceremoniously yanked offstage as the song began. What appeared as an inexplicable stunt to the uninitiated was likely a shady reference to former Fifth Harmony frontwoman Camila Cabello, who exited the group in December to pursue a solo career. It wasn’t so much that Cabello’s departure stung her former colleagues but that she reportedly failed to inform them of her decision before announcing it to the world. Oops. Also Taylor Swift Unless you were in a coma for the whole of last week, you probably heard that Taylor Swift announced the release date for her upcoming album, “Reputation,” as well as releasing the first single, “Look What You Made Me Do.” It’s fine. Sunday night, Swift debuted the video for “Look What You Made Me Do.” It is also fine. This has been your daily Taylor Swift update. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nKevin Hart, Beyoncé and Drake lead charge for Hurricane Harvey flood relief By Nardine Saad (Liz O. Baylen / Los Angeles Times) As Harvey lashed southeastern Texas over the weekend, celebrities rallied for the relief effort. Comedian Kevin Hart led the charge Sunday night, donating $25,000 and challenging his celebrity friends to donate to the Red Cross amid catastrophic flooding in the Lone Star State. “I think we’ve participated in a lot of challenges on the Internet, some meaningful, some meaningless, but we’ve all done them. I’ve been a person that’s partaken in several of them,” Hart said in an Instagram video. “At this point, this is a serious matter,” he continued. “I think the people are in bad shape and they need help. I’m going to lead the charge and step up in this way.” The “Jumanji” star called on his co-star Dwayne Johnson, comics Steve Harvey, Chris Rock, Dave Chappelle and Jerry Seinfeld, as well as musicians Jay-Z, Beyoncé and Justin Timberlake to make donations and tag someone else to do the same. At that point, Houston native Beyoncé and Kelly Rowland of Destiny’s Child had already posted notes about their hometown on Instagram, sending thoughts and prayers to the state that launched their careers. View Instagram post View Instagram post The deluge of support continued with country star Chris Young. “The Man I Want to Be” singer posted an emotional YouTube video about his certainty that his Texas home was destroyed and concern for his friends and family in the state. He donated $100,000 to relief efforts to a GoFundMe campaign to benefit the Red Cross. Harvey, one of the worst natural disasters in the state’s history, slammed onshore Friday as a Category 4 hurricane, then weakened to a tropical storm on Saturday, dropping up to 24 inches of rain on Houston in 24 hours. The National Weather Service reported that at least five people had died as of Sunday evening, but that number was expected to increase as the floodwaters recede. More than 30,000 people across the Gulf Coast are likely to seek temporary shelter as the tropical storm continues to drench southeastern Texas and Louisiana with heavy rains and surging floodwaters, The Times reported. Toronto native Drake, who has lived in Houston for the last eight years, said that he and DJ Future the Prince are working with local relief groups “to aid and assist the people of Texas in anyway we can and in the most immediate way possible.” “I also want to thank all the men and women of service and volunteers for their courageous efforts to help people in need,” the rapper said on Instagram. “I encourage everyone to do what they can to assist the people of Texas knowing whatever effort you can make to help will go a long way.” View Instagram post Also, during the MTV Video Music Awards Awards on Sunday, host Katy Perry touched upon the catastrophic event. She too urged viewers to donate to the Red Cross. “All of us here at the VMAs are sending love to the people of southeastern Texas and everyone affected by Hurricane Harvey right now,” Perry said onstage. “We’re praying for your safety in the days to come and we stand with you as you rebuild because we’re all in this together.” According to the Houston Chronicle, more than 15 inches of rain could fall on several more southeastern Texas cities. Corpus Christi, where Harvey first made landfall, saw upward of 20 inches of rain in two days. By Monday morning, up to 40 inches of rain had fallen on northeast Houston. Another 20 inches were expected Monday before Tropical Storm Harvey travels farther east. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nSusan Bro, mother of slain Charlottesville protester Heather Heyer, announces anti-hate foundation at the MTV VMAs By Randall Roberts (Chris Pizzello/Invision/AP) During an evening filled with defiant messages against racism, homophobia and body shaming, the mother of Heather Heyer announced some concrete actions to further the cause. Susan Bro, whose daughter was killed two weeks ago during protests in Charlottesville, Va., has worked through her grief by speaking out against racism, and took a further step by creating the Heather Heyer Foundation. Describing it as “a nonprofit organization that will provide scholarships to help more people to join Heather’s fight against hatred,” Bro requested that viewers visit the new site “to help me make Heather’s death count.” Added Bro: “Heather never marched alone. She was always joined by people from every race and every background in this country.” Bro was introduced by Robert Lee IV -- a descendant of Confederate Gen. Robert E. Lee -- who said his ancestor has became of idol of white supremacy and hate. Lee went on to describe racism as America’s “original sin.” He went on to ask all of those with privilege to confront white supremacy and racism “head-on.” Watch his speech below. “I call on all of us with privilege and power to confront racism and white supremacy head-on\" - Robert Lee IV #VMAs pic.twitter.com/ko4SM9VnaU — MTV (@MTV) August 28, 2017 Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nWatch Pink’s inspiring MTV VMA speech to individuality By Randall Roberts In receiving her Video Vanguard award at the MTV VMAs on Sunday at the Forum -- the show’s equivalent of a lifetime achievement trophy -- the pop star Pink told a story about a conversation she’d recently had with her young daughter. They were driving to school and her daughter said, “Mama, I’m the ugliest girl I know.” Pink replied, “Huh?” “And she was like, ‘Yeah, I look like a boy with long hair.’” Pink said that she immediately thought, “My god, you’re 6. Where is this coming from?” The artist and mom didn’t lecture her daughter. Instead, said Pink: “I went home and made a PowerPoint presentation for her, and in that presentation were androgynous rock stars and artists that live their truth; are probably made fun of every day of their lives and carry on and wave their flag; and inspire the rest of us. “These are artists like Michael Jackson and David Bowie and Freddie Mercury and Annie Lennox and Prince and Janis Joplin and George Michael, Elton John, so many artists.” Pink said that her daughter’s eyes glazed over, but Pink pressed her about why she felt that way about herself. “‘What do you think I look like?’ She said, ‘You’re beautiful.’” The pop singer explained that she gets critiqued, too. “They say I look like a boy or I’m too masculine or I’m too -- I have too many opinions. My body is too strong. “I said to her, ‘Do you see me growing my hair?’ She said ‘No Mama.’ I said, ‘Do you see me changing my body?’ She said, ‘No Mama.’ Do you see me changing the way I present myself to the world? ‘No Mama.’ Do you see me selling out arenas all over the world. ‘Yes Mama.’ “OK baby girl. We don’t change. We take the gravel and the shell and we make a pearl. And we help other people to change so that they can see more kinds of beauty.” Added Pink in closing: “To all the artists here, I’m so inspired by you. Thank you for being your true selves and for lighting the way for us.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nWatch Jared Leto offer touching tribute to Chris Cornell and Chester Bennington at the MTV VMAs By Randall Roberts In a moving tribute to two fallen musicians, the actor and musician Jared Leto honored the lives of Chris Cornell of Soundgarden and Chester Bennington of Linkin Park at the MTV VMAs on Sunday. Cornell and Bennington committed suicide in 2017, and Leto was friends with both. “In 1976 in Phoenix, Ariz., a child was born. He was precocious, full of life, and determined, and grew up to become the singer of one of the greatest rock bands in the history of music,” Leto said. “His name was Chester Bennington, and the band is Linkin Park.” Leto added that MTV asked him to say a few words about Bennington and Cornell, who he described as “two artists that I had the absolute pleasure of touring with. They were close friends with one another -- Chester even singing the cover of the classic ‘Hallelujah’ at Chris’ funeral.” Recalling Bennington’s words at Cornell’s funeral service, Leto said: “Chester said of Chris, ‘Your voice was joy and pain and anger and forgiveness, love and heartache all wrapped up into one.’ Just weeks later, Chester himself was gone. Chester was my friend. As he was to so many. Witnessing his life taught me important things -- especially about working relentlessly, pursuing dreams and being kind and caring while doing it.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nKodak Black, Lil Uzi Vert and more steal the MTV VMA spotlight By Gerrick Kennedy Kodak Black arriving at the MTV VMAs. (Jordan Strauss / Invision / Associated Press) The line near a concession stand inside the Forum minutes before the MTV VMAs kicked off on Sunday was lengthy, but no one was waiting on food or drinks. Instead, a dozen or so folks waited patiently to get a selfie with Kodak Black, who high-fived and posed with as fans fumbled with smartphones. The VMAs are typically rife with heavyweights (Kendrick Lamar, Katy Perry, etc.) but this year’s ceremony looked to tap into the wide scene of rising acts that have been dominating streaming services and social media all summer. Before the telecast even began Lil Uzi Vert clinched a major win, taking the trophy for song of summer for “XO Tour Llif3\" and he later joined Ed Sheeran for the tune, no doubt the night’s most surprising collaboration. Meanwhile, Khalid’s pre-show medley could have easily anchored the main show while reality star turned breakout rap sensation Cardi B was another highlight of the pre-show festivities. Her viral hit “Bodak Yellow” rattled throughout the Forum during nearly every commercial break. Fifth Harmony later made its debut at the VMAs with an explosive main stage performance of “Down,” a song that also won the award for pop video. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nJack Antonoff is living his best life at the MTV VMAs By Mikael Wood Jack Antonoff performs onstage during the 2017 MTV Video Music Awards pre-show. (Joshua Blanchard / Getty Images) Has anyone at MTV’s Video Music Awards had more screen time so far than Jack Antonoff? First the A-list producer and songwriter turned up on the night’s pre-show ceremony for a performance with his band Bleachers. Then he introduced Lorde by noting that he’d seen her eat gas-station sushi during the two years they spent together working on her album “Melodrama.” He also accepted the award for best collaboration — for Taylor Swift and Zayn’s “I Don’t Wanna Live Forever (Fifty Shades Darker),” which he helped create — because the singers couldn’t be there. But Antonoff’s best moment? Obviously the candid reaction shot in which he was shown “casually eating a banana,” as his girlfriend, Lena Dunham, described it on Twitter. My boyfriend just casually eating a banana at the VMAs is a good reminder of why we've been at it half a decade — Lena Dunham (@lenadunham) August 28, 2017 Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nWatch Taylor Swift’s bold ‘Look What You Made Me Do’ video, which premiered during the MTV VMAs By Randall Roberts Taylor Swift’s new video for “Look What You Made Me Do,” which premiered during the 2017 MTV VMAs on Sunday night, features her dressed as a zombie, a diamond-drenched queen, a red-dressed seductress, a car-crash victim, a bird in a cage, a kitty-masked thief with a baseball bat, a biker chick wearing studded leather and a whip-snapping dominatrix. As she poses and pretends, Swift makes a not-so-veiled reference to her ongoing feud with Kim Kardashian and Kanye West, getting all combative behind the microphone as a feather-light melody jumps behind her. The video premiered during a ceremony hosted by pop star and avowed Swift nemesis Katy Perry. Perry didn’t introduce the clip, a hint that the two probably still aren’t besties. Inside the Forum, the video premiered on multiple big screen TVs rose that from the stage, and Perry was nowhere in sight. As the clip seems to be winding down, the music fades. But Swift hasn’t fully made her point. In its final moments arrive a dozen-odd versions of Swift standing in front of a black private jet with the name of her new album, “Reputation,” scrawled on it. The many Swifts start bickering and referencing the various criticisms that have been lobbied at her over the years. “Stop making that face, it’s so annoying,” the zombie Swift says, a nod to what some believe is the exaggerated excitement the artist shows when she wins awards. A young version of Swift interrupts with an innocent “Y’all!” but is shot down by an embittered Swift: “Oh stop acting like you’re so nice. You’re so fake!” Standing in the center of the line is Swift seemingly dressed as she was at the 2009 VMAs, when West interrupted her victory speech to decry Beyoncé's loss. Holding her VMA trophy, she says, “I’d like very much to be excluded from this narrative,” both a nod to to the musical “Hamilton” and a repeat of a phrase Swift posted on social media in wake of controversy resulting from West’s song “Famous.” In that 2016 tune, he he boasted that “I made that [profanity] famous” and, therefore, that he and Swift “might still have sex.” The other Swifts reply in unison: “Oh shut up!” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nKendrick Lamar opens 2017 VMAs with fiery performances of ‘DNA’ and ‘Humble’ By Randall Roberts Wearing a red scarf on his head and a poofy winter coat onstage, Compton rapper Kendrick Lamar opened the 2017 MTV VMAs needing neither. Within a few minutes of launching with “DNA” a dancer center stage burst into flames. You could almost feel the heat simmering through the screen. “I was born like this, since one like this,” Lamar rapped. “Immaculate conception/I transform like this, perform like this.” Perform he did, moving into a second track, “Humble,” from his recent album “Damn.” Shedding the coat, he stood in front of a fiery backdrop grid that burned as dancers scaled it. As they did so, Lamar rapped, “My left stroke just went viral/Right stroke put lil’ baby in a spiral.” It was the opening shot of a VMAs in which politics and protest may end up taking center stage. Indeed, moments later presenter Paris Jackson drew a rousing applause when she denounced the racism and hatred propogated by white supremacists and neo-Nazis. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nHeidi Klum, Jack Antonoff and others stand in support of transgender military service members at VMAs By Randall Roberts View Instagram post As the 2017 Video Music Awards were approaching, the Gay & Lesbian Alliance Against Defamation (GLAAD) was out in full force at the Forum. Its president and CEO, Sarah Kate Ellis, walked the red carpet along with her invited guests: six transgender members of the military. The action came in the wake of President Donald Trump’s direction to the Pentagon on Friday, as reported in The Times, “to ‘return to the long-standing policy and practice’ barring military service by transgender individuals.” Praising MTV as a pioneering advocate for the LGBTQ community, Ellis said in a statement, “Throughout all the tweets, memos, and speculation, brave transgender Americans are still serving their country and defending the freedoms of this nation while meeting the same rigorous standards of their peers. We are proud to stand with them.” Posing in support: musicians and celebrities including Jack Antonoff (Bleachers), supermodel Heidi Klum, actor-comedian Billy Eichner and others, who stood alongside transgender service members including Jennifer Peace, Logan Ireland, Sterling James Crutcher and Akira Wyatt, as well as trans veterans Laila Ireland and Brynn Tannehil. Also joining them was LGBTQ philanthropist August Getty, who in his other life is a fashion designer responsible for Miley Cyrus’s red carpet dress. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nMTV VMAs return to Southern California with an overwhelmingly impressive setup By Gerrick Kennedy Cardi B performing at the pre-show for the MTV VMAs. (Chris Pizzello / Invision / Associated Press) After heading to the East Coast last year, the MTV VMAs have returned to Southern California. And tonight at the Forum in Inglewood, it was clear that the network decided to go big — huge really. Upon arrival to the venue it appeared that the scale of this year’s show was unlike anything MTV had done in recent history. A structure that looked like a space shuttle swallowed the lot in front of the venue, and stars such as Cardi B and Big Freedia could be seen pumping through the red carpet (it’s a deep shade of blue this year). Inside the Forum, the stage took up the entirety of the venue’s ground floor. The imprint of the stage was impressive, even overwhelming in size as a maze of catwalks and secondary stages traced the floor, all of which was outlined by hundreds of glowing triangles and projection screens. It made for a futuristic playground of geometric glowing shapes that show opener Kendrick Lamar put to use immediately as he emerged from the center of the venue for the explosive “DNA,” strutting through half of the venue before making it to the main stage. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nTaylor Swift breaks YouTube record with ‘Look What You Made Me Do’ video By Randy Lewis Taylor Swift set a YouTube record with the lyric video for her new single “Look What You Made Me Do,” tallying 19 million views in just the first 24 hours. That’s more than double the previous first-day record for a lyric video, which was set in February by the lyric video for the Chainsmokers’ “Something Just Like This” featuring Coldplay, which registered 9 million views upon its release. It’s also the best 24-hour figure Swift has logged, besting the first-day result for her 2015 official video for “Bad Blood,” which attracted 17 million views, and has since totaled more than 1.1 billion views. As of Sunday morning, the tally for “Look What You Made Me Do” had surpassed 35 million. It sets the stage for the premiere tonight of Swift’s official video for the new single, which will be introduced during the MTV Video Music Awards Ceremony, taking place at the Forum in Inglewood. The overall record for viewership in the first 24 hours for any music video belongs to Adele, who registered 27.7 million views in 2015 at the premiere of the official video for her song “Hello.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nWhy William Friedkin called Tobe Hooper’s ‘Texas Chain Saw Massacre’ an Umami Burger of a movie By Mark Olsen Director Tobe Hooper, who died in Los Angeles on Saturday at age 74, created many movies and TV shows during his long career — including stepping to helm the filming of “Poltergeist” when Steven Spielberg was contractually banned from directing other films during the production of “ET: The Extra Terrestrial.” Hooper’s most admired film, of course, was 1974’s “The Texas Chain Saw Massacre.” In 2014, on the occasion of the film’s 40th anniversary, “The Exorcist” director William Friedkin interviewed Hooper before an overflow audience at Los Angeles’ Vista theater. During the engaging conversation, Friedkin called Hooper “one of the sweetest, nicest guys I’ve ever known.” And then added, “So I often wonder where this stuff comes from.” Hooper talked about purposely pitting his actors against each other to keep the on-screen tension high, how an unlikely pair of albums — Elton John’s “Goodbye Yellow Brick Road” and Lou Reed’s “Berlin” — inspired him during the writing of the screenplay, and about “how damn strong women are,” referring to the resilent character played by Marilyn Burns. “She’s just not going to die.” At one point, Friedkin provocatively asked, “Do you think this is a work of art?” Hooper first asked, “Should I be modest?” before responding with a salty confirmation, “It’s a ... work of art.” The Times’ Mark Olsen was there for the interview. At the end of his article, there’s this affirmation of the film from Friedkin: “No 3-D, no CGI, welcome to this Umami Burger of a movie.” Read on to find his reasoning. Read More Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nCinefamily suspends all activities in wake of sexual misconduct allegations By Sonaiya Kelley The Cinefamily on Fairfax Avenue in Los Angeles. (Lawrence K. Ho / Los Angeles Times) Following the resignations Tuesday of two leadership figures at Cinefamily, the Los Angeles independent film venue has announced that it is temporarily suspending all activities to “allow for the investigation and necessary restructure of management and the board.” “Recently, claims were made alleging improper behavior by one of more members of the organization,” reads a release posted on the organization’s website and social media pages. “The Board of Directors of The Cinefamily has no tolerance for any form of behavior that does not conform to the high standards demanded by our members and staff and that of common human decency.” The letter also says that Cinefamily is bringing on “an independent third party, Giles Miller at Lynx Insights & Investigations, to conduct a thorough investigation” into the allegations. View Twitter post A spokesperson for the theater could not immediately be reached for comment. The announcement comes in the wake of two high profile exits: co-founder and executive creative director, Hadrian Belove, and vice president of its board of directors, Shadie Elnashai, resigned on Tuesday following allegations of sexual misconduct. The exits were announced in postings on Cinefamily’s social media accounts. “In light of recent events, Shadie Elnashai has resigned from Cinefamily’s Board of Directors and Hadrian Belove has resigned as the Executive Creative Director of Cinefamily,” read the statement. Addressing the anonymous allegations in a post to his personal Facebook account following his resignation, Belove described the email’s contents as “demonstrable lies and half-truths, and allegations without known victims.” It is not clear whether screenings currently scheduled will still run, and there has been grumbling by monthly billed members as to whether or not automated charges will be suspended or cancelled. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\n‘The Texas Chain Saw Massacre’ director Tobe Hooper dies in Los Angeles at 74 By Associated Press Tobe Hooper, the horror-movie pioneer whose low-budget sensation “The Texas Chain Saw Massacre” took a buzz saw to audiences with its brutally frightful vision, has died. He was 74. The Los Angeles County coroner’s office says Hooper died Saturday in Sherman Oaks. It was reported as a natural death. Hooper and contemporaries like George Romero crafted some of the scariest nightmares that ever haunted moviegoers. He directed 1982’s “Poltergeist” from a script by Steven Spielberg and was behind the 1979 miniseries “Salem’s Lot,” based on the Stephen King novel. Read More Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nIs Taylor Swift trying to turn off her listeners? By Mikael Wood We can skip the rundown of Taylor Swift’s feud with Kanye West, right? Less than 24 hours after the world’s biggest pop star unleashed her new single on a waiting commentariat, I’m already exhausted by the idea of having to read (let alone write) yet another rehash of this deeply tiresome conflict. But you know who’s not over it? Taylor Swift. In “Look What You Made Me Do” — released online Thursday night as the lead single from a new album, “Reputation,” due in November — the singer sounds positively fired up as she takes whack after brutal whack at the rapper who once interrupted her at an awards show. (Swift doesn’t name West, to be clear, but with her reference to a “tilted stage,” she doesn’t need to.) “I don’t like your perfect crime / How you laugh when you lie,” she seethes over a throbbing electronic groove, “You said the gun was mine / Isn’t cool — no, I don’t like you.” Later in the tune, which Swift created with Jack Antonoff, she pretends to answer a phone call from someone evidently looking for “the old Taylor” — the sucker, you presume, who might’ve let bygones be bygones. But she can’t come to the phone, Swift tells the caller. “Why?” she adds. “Oh, ’cause she’s dead.” What’s surprising about “Look What You Made Me Do” — beyond the harsh industrial production that makes it feel like Swift’s response to her enemy’s “Yeezus” — is that it suggests the singer no longer cares (or is no longer able to tell) what pop fans want. Swift rose to superstardom by anticipating listeners’ desires; she knew just when to pivot from acoustic guitars to sleek synthesizers, from the fairy-tale romance of early hits like “Love Story” to the more grown-up depiction found on her last album, 2014’s smash “1989.” On tour behind that record, she spent a good portion of her show every night telling the members of her audience how closely she’d been paying attention to them. But dredging up Taylor v. Kanye again? I mean, I can’t be the only one who’s sick of this topic — something Swift would’ve known a few years ago without even having to think about it. OK, so she hardly lacks for company among A-listers eager to cook expired beef. Earlier this summer Katy Perry revived her ancient tussle with Swift — I believe it had something to do with backup dancers? — for “Swish Swish.” But Perry’s song takes delight in its own pettiness, whereas “Look What You Made Me Do” just makes me think of President Trump whining endlessly about fake news. (Crediting Right Said Fred for the song’s supposed debt to “I’m Too Sexy” is funny in writing, but the inspiration adds little humor to the dour music.) Maybe Swift isn’t aiming for me, though. Maybe this polarizing song is meant to galvanize her base — which, sure enough, is rhapsodizing about the track on social media — even at the expense of the wider world she’s dominated for much of the last decade. If that’s her play, it’s a wild one, especially coming after her powerful testimony during the recent trial regarding her alleged sexual assault at the hands of a Denver radio DJ. In court, Swift appeared driven to speak with a voice loud enough for others. Now, just days later, she seems uninterested in that job. Have we ever seen a pop star so happily give up a portion of her following? That’s an idea I’m not tired of considering. Maybe “Reputation” will take it up. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nConcerts by Coldplay, other acts canceled as Hurricane Harvey nears Texas By August Brown Coldplay performs at the Rose Bowl in Pasadena in 2016. (Michael Owen Baker / For The Times) As the potentially devastating Hurricane Harvey approaches the Texas coast, major acts including Coldplay, Lady Antebellum and Mary J. Blige have canceled or rescheduled their Houston-area concerts. Coldplay on Friday postponed a show scheduled for NRG Stadium in Houston. “We really wanted to play tonight, but sitting here all together watching the news about the storm, we feel that we can’t ask anyone to put their safety at risk. So, sadly, we will have to postpone,” the band wrote. Live Nation Houston said ticket-holders would be updated when there was further information. “We urge all fans in the area to stay safe,” it said. A makeup date has not yet been scheduled. The country trio Lady Antebellum canceled its Sunday show at the Cynthia Woods Mitchell Pavilion in the Woodlands, citing the storm. Blige postponed her Friday show at the Smart Financial Centre at Sugar Land. The venue announced that the concert had been rescheduled to Sept. 19. The Category 3 storm, which would be the first major hurricane to hit the United States since 2005, is expected to make landfall in coastal Texas on Saturday morning, bringing 100-mph winds and up to 35 inches of rain in some areas. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\n‘Bachelor’ couple Nick Viall and Vanessa Grimaldi break off their engagement By Christie D’Zurilla (Leon Bennett / Getty Images) Nick Viall and Vanessa Grimaldi, who got engaged on the most recent season of “The Bachelor,” have — “with a great amount of heartbreak” — called the whole thing off. “We gave this relationship our all and we are saddened that we did not get the fairytale ending we hoped for,” they said Friday in a statement to E! News. The relationship lasted five months after the proposal aired on the Season 21 finale of “The Bachelor” in March. The two said in their statement that they’re parting “with love and admiration” for one another. The silver lining to what they called a difficult decision? This means Nick is potentially available for yet another TV stint in the “Bachelor/Bachelorette” franchise. That as-yet-imaginary gig would be his fifth ride on the looking-for-love roller coaster. In Bachelor Nation, it’s always good to dream. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nMila Kunis, Ashton Kutcher settle lawsuit over website’s photos of their kids By Nardine Saad (Michael Nelson / EPA) Ashton Kutcher and Mila Kunis’ legal battle with British website MailOnline has been settled. The “Two and a Half Men” actor, the “Bad Moms” actress and the outlet “have reached a satisfactory resolution of their legal action” regarding the publication of photos of their children, their legal representatives said in a joint statement to The Times on Friday. The couple, who starred in “That ‘70s Show” together years before they began dating, took the website’s publisher, Associated Newspapers, to London’s High Court in July 2015 over two articles featuring their daughter, who was 1 at the time. The U.K.'s MailOnline.com published images of Wyatt taken during a private family outing to the beach. A paparazzo used a long-lens camera to obtain the images, and the couple said they were unaware the photos were being taken. They claimed that the photos breached the Data Protection Act and were used for the unauthorized promotion of clothing on the website. [T]hey have reached a satisfactory resolution of their legal action, which includes an agreement to pixelate photographs of their daughter, Wyatt, their son, Dimitri, and any future children they should have together. — Joint statement from Kutcher, Kunis and the MailOnline announcing their lawsuit settlement Per the agreement announced Friday, the outlet will “pixelate photographs of Kutcher’s and Kunis’ daughter, Wyatt, their son, Dimitri, and any future children they should have together.” The settlement is the latest legal blow to MailOnline and its associated newspaper, the Daily Mail. (The U.S. version of the website, DailyMail.com, is run by a separate news team.) In April, the tabloid’s parent company settled a libel suit with First Lady Melania Trump over an article it ran in the paper and online that suggested she may have once worked as an escort. In July 2014, George Clooney lambasted the Daily Mail in a USA Today op-ed that accused it of “making up stories” in the wake of an article it published about his mother-in-law. He got an apology and an acknowledgement that the story was inaccurate. That same month, Angelina Jolie reportedly threatened to take legal action after it published a video that claimed to show her under the influence of heroin in the 1990s. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nTaylor Swift’s ‘Look What You Made Me Do’ lyrics: Let the analysis begin By Randy Lewis As if there were any doubt as to the level of interest in Taylor Swift’s first new music in three years, her first single from her forthcoming album, “Reputation,” has been blowing up since it premiered Thursday night. The lyric video for “Look What You Made Me Do” had logged more than 7 million views as of 9:30 a.m. Friday. Additionally, Swift tweeted that the official video for the song will premiere Sunday during the MTV Video Music Awards ceremony. For those who want to dig in and attempt to decode what and to whom the “I don’t like you” references might refer, here are the full lyrics to the song: ‘Look What You Made Me Do’ FIRST VERSE I don’t like your little games Don’t like your tilted stage The role you made me play Of the fool, no, I don’t like you I don’t like your perfect crime How you laugh when you lie You said the gun was mine Isn’t cool, no, I don’t like you PRE-CHORUS But I got smarter, I got harder in the nick of time Honey, I rose up from the dead, I do it all the time I’ve got a list of names and yours is in red, underlined I check it once, then I check it twice, oh! CHORUS Ooh, look what you made me do Look what you made me do Look what you just made me do Look what you just made me do Ooh, look what you made me do Look What you made me do Look what you just made me do Look what you just made me do SECOND VERSE I don’t like your kingdom keys They once belonged to me You ask for a place to sleep Locked me out and threw a feast (what?) The world goes on, another day, another drama, drama But not for me, not for me, all I think about is karma And then the world moves on, but one thing’s for sure Baby, I got mine, but you’ll all get yours PRE CHORUS REPEATS But I got smarter, I got harder in the nick of time Honey, I rose up from the dead, I do it all the time I’ve got a list of names and yours is in red, underlined I check it once, then I check it twice, oh! CHORUS REPEATS Ooh, look what you made me do Look what you made me do Look what you just made me do Look what you just made me do Ooh, look what you made me do Look what you made me do Look what you just made me do Look what you just made me do THIRD VERSE I don’t trust nobody and nobody trusts me I’ll be the actress starring in your bad dreams I don’t trust nobody and nobody trusts me I’ll be the actress starring in your bad dreams I don’t trust nobody and nobody trusts me I’ll be the actress starring in your bad dreams I don’t trust nobody and nobody trusts me I’ll be the actress starring in your bad dreams (Look what you made me do) (Look what you made me do) ANSWERING MACHINE INTERLUDE “I’m sorry, the old Taylor can’t come to the phone right now.” “Why?” “Oh ’cause she’s dead!” CHORUS REPEATS Ooh, look what you made me do Look what you made me do Look what you just made me do Look what you just made me do Ooh, look what you made me do Look what you made me do Look what you just made me do Look what you just made me do Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nPatty Jenkins isn’t surprised James Cameron doesn’t get ‘Wonder Woman’ By Tracy Brown “Wonder Woman” director Patty Jenkins has some words about James Cameron’s comments on the Amazonian warrior goddess: Of course he doesn’t get it. Following the “Avatar” director’s claims that “Wonder Woman” is a “step backwards” for women, Jenkins responded in a tweet that Cameron’s thoughts are “unsurprising” because he “is not a woman.” In an interview with the Guardian, Cameron threw some shade on “Wonder Woman’s” success by trying to compare Diana Prince to Sarah Connor from his “Terminator” franchise. \"[Sarah Connor] was strong, she was troubled, she was a terrible mother, and she earned the respect of the audience through pure grit,” Cameron said. Nothing like the “objectified” “beauty icon” he considers Wonder Woman to be. Jenkins points out that Cameron’s narrow qualifications for what makes a “good” female hero are restrictive and not at all progressive. “If women have to always be hard, tough and troubled to be strong, and we aren’t free to be multidimensional or celebrate an icon of women everywhere because she is attractive and loving, then we haven’t come very far have we,” Jenkins wrote. Jenkins also insisted that there should be room for all types of female lead characters and that women themselves should be the judge of these “icons of progress.” “There is no right and wrong kind of powerful woman,” she wrote. Read Jenkins’ full statement below. pic.twitter.com/8zkJXHLCJW — Patty Jenkins (@PattyJenks) August 25, 2017 Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nJames Cameron thinks ‘Wonder Woman’s’ success is ‘misguided’: ‘She’s an objectified icon’ By Nardine Saad (Anne Cusack / Los Angeles Times) James Cameron isn’t here for “Wonder Woman’s” blockbuster success. In fact, the moviemaker calls the much-loved superhero flick (“Wonder Woman” is currently at 92% on Rotten Tomatoes) a step back from the female heroes he created in the ‘80s and ‘90s. It appears that the “Titanic” and “Terminator 2\" director, whose films often put tough women at the center of the action, doesn’t think that Gal Gadot’s character was complicated or groundbreaking enough to merit so much acclaim -- $800 million at the worldwide box office aside. “All of the self-congratulatory back-patting Hollywood’s been doing over ‘Wonder Woman’ has been so misguided. She’s an objectified icon, and it’s just male Hollywood doing the same old thing!” Cameron said in an interview with the Guardian. All of the self-congratulatory back-patting Hollywood’s been doing over ‘Wonder Woman’ has been so misguided. She’s an objectified icon, and it’s just male Hollywood doing the same old thing! — Filmmaker James Cameron on ‘Wonder Woman’ The director, who was cast in the article as softened and evolved from his “bone-crushing” early movie-making days, believes that “Wonder Woman” was “a step backwards.” (Don’t get him wrong, he did like Patty Jenkins’ summer blockbuster -- the first-ever feature-film incarnation of the DC Comics heroine and the highest-grossing live-action film directed by a woman -- just not enough to let it pass without throwing a little shade Diana Prince’s way.) “Backwards” in comparison with Cameron’s complex Sarah Connor character from the “Terminator” franchise. “Sarah Connor was not a beauty icon. She was strong, she was troubled, she was a terrible mother, and she earned the respect of the audience through pure grit. And to me, [the benefit of characters like Sarah] is so obvious. I mean, half the audience is female!” Cameron said. The three-time Oscar wi", "images": ["https://ca-times.brightspotcdn.com/dims4/default/8029cc5/2147483647/strip/true/crop/900x506+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb9%2Fe4%2Fcd6539078ecd1669b4e1f83b52ff%2F900x506", "https://ca-times.brightspotcdn.com/dims4/default/1101c0d/2147483647/strip/true/crop/800x450+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2Fb6%2F4f496073006cc431e476b9a9ff71%2Fla-et-mg-ed-skrein-20170828", "https://ca-times.brightspotcdn.com/dims4/default/6afbe3d/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F46%2F2d%2F6074ec3b7488c4533bafae6e350b%2Fla-et-mg-carly-waddell-and-evan-bass-20170807", "https://ca-times.brightspotcdn.com/dims4/default/b33a9fd/2147483647/strip/true/crop/2048x1414+0+0/resize/1200x829!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbb%2Fb7%2F42e2390e89034e5680202863d8f0%2Fimg-599bfd22-turbine-la-et-alexander-skarsgard-photo", "https://ca-times.brightspotcdn.com/dims4/default/ab47eaf/2147483647/strip/true/crop/2048x1321+0+0/resize/1200x774!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe3%2Fa2%2F4ef31678a721f53ee90af7c43ecc%2Flat-et-tswift-wre0056506676-20170814", "https://ca-times.brightspotcdn.com/dims4/default/a8e16ac/2147483647/strip/true/crop/682x1024+0+0/resize/1200x1802!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc5%2F1b%2F1d21261e687f04f2e116b1d2314e%2Fimg-59837efb-turbine-la-actor-treat-williams-20170803", "https://ca-times.brightspotcdn.com/dims4/default/4aacddf/2147483647/strip/true/crop/2048x1466+0+0/resize/1200x859!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F18%2F78%2Fc97ce6326b718569e91227c3ede8%2Fla-steve-20170226", "https://ca-times.brightspotcdn.com/dims4/default/656925f/2147483647/strip/true/crop/2000x1408+0+0/resize/1200x845!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F7f%2F2c%2F2c89aa543fdd3a7507793389131a%2Fimg-59916ad9-turbine-la-et-robert-redford-photo", "https://ca-times.brightspotcdn.com/dims4/default/1e63f14/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F0b%2F03%2Fcaa52421502d95f9f37414c0c445%2Fla-1502218535-q39gi0r8us-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/e0925a2/2147483647/strip/true/crop/800x450+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F57%2F6c%2Fbf2f4d5e6a2b8069e30a004914f7%2Fla-1475678496-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/30e7e91/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ffd%2F4f%2F9171036754950c460a2bc3efd38d%2Fimg-5810e054-turbine-la-1477501017-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/559d7cc/2147483647/strip/true/crop/800x450+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb2%2F2d%2F243dcbc9acbbfe263289c8236549%2F16x9", "https://ca-times.brightspotcdn.com/dims4/default/06d6c64/2147483647/strip/true/crop/2048x1354+0+0/resize/1200x793!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F68%2F03%2F75852d20efc9146f5317daa2680c%2Fimg-59a585b7-turbine-la-et-ms-chris-martin-20170829", "https://ca-times.brightspotcdn.com/dims4/default/7adf210/2147483647/strip/true/crop/1024x675+0+0/resize/1200x791!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ffe%2F1b%2F0fcc4930c4c6841e7ce3754a78f8%2Fimg-597fb120-turbine-la-billy-bob-thornton-in-1996-20170731", "https://ca-times.brightspotcdn.com/dims4/default/6a11960/2147483647/strip/true/crop/1024x682+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F5d%2F16%2F2df673980705d564fb2b67842143%2Fimg-59a87905-turbine-la-angels-flight-20170831", "https://ca-times.brightspotcdn.com/dims4/default/7af3c7e/2147483647/strip/true/crop/1527x890+0+0/resize/1200x699!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ffa%2F80%2F06eab0e5d185892c5cea5d79be01%2Fimg-58a3c3c5-turbine-la-mhamilton-1487127563-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/c870ee8/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fad%2F03%2F13cd5c44e24b2bf5de3043174e5c%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/12924b7/2147483647/strip/true/crop/2048x1122+0+0/resize/1200x657!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F10%2Fce%2Fb41e4443796bc573039e81435ed3%2Fimg-59a85937-turbine-la-et-st-jamie-foxx-20170831", "https://ca-times.brightspotcdn.com/dims4/default/983051e/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fae%2F00%2F4d65e4e32596025c7212346afa74%2Fimg-5918e44e-turbine-la-et-ms-wango-tango-2017-concert-photos-004", "https://ca-times.brightspotcdn.com/dims4/default/3c6cb7a/2147483647/strip/true/crop/2048x1399+0+0/resize/1200x820!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F3b%2F49%2F35de66e2f2b8828ea70ef3a70c66%2Fimg-51bbbe47-turbine-la-et-ms-macarthur-park-lyrics-20130615-001", "https://ca-times.brightspotcdn.com/dims4/default/5b40c96/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F5e%2F2c%2Fd14eb5afb172a9dc4380bdefbda0%2Fimg-598d9678-turbine-la-et-ca-halle-berry-photo", "https://ca-times.brightspotcdn.com/dims4/default/31ad3da/2147483647/strip/true/crop/2048x1622+0+0/resize/1200x950!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fef%2F9e%2Fe39af1d0bbbd0a14213ccebb53d7%2Flat-et-myeoh-la0004366616-20170803", "https://ca-times.brightspotcdn.com/dims4/default/f461ffc/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb3%2F50%2Ffb97f9488fffcc1d94f2bbf45662%2Fla-dlewis-1482262453-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/ae8364c/2147483647/strip/true/crop/2000x1379+0+0/resize/1200x827!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F7c%2Fd2%2F3ac0dc47eeb9f35adaf6eaad4aed%2Fimg-599aa65b-turbine-la-et-dave-chappelle-photo", "https://ca-times.brightspotcdn.com/dims4/default/d89276e/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe2%2F79%2Fd97e061e1b57b8cbc7071947c212%2Fimg-597b072e-turbine-la-et-chuck-d-photo", "https://ca-times.brightspotcdn.com/dims4/default/db8791b/2147483647/strip/true/crop/1024x682+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F63%2Fc6%2Fd652526e4bed06df453eebcc4a33%2Fla-et-mn-pink-thanks-for-sharing-alecia-moore-001", "https://ca-times.brightspotcdn.com/dims4/default/f9bb51b/2147483647/strip/true/crop/2048x1394+0+0/resize/1200x817!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F68%2F7f%2Fa776f0163236f626ca2115f798bb%2Fimg-5982f134-turbine-la-et-james-gunn-photo", "https://ca-times.brightspotcdn.com/dims4/default/be77252/2147483647/strip/true/crop/2000x1415+0+0/resize/1200x849!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F69%2F76%2Fa5657620e587910a371d37c01b8f%2Fimg-598426fc-turbine-la-et-juanes-photo", "https://ca-times.brightspotcdn.com/dims4/default/fc18e14/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Faf%2F34%2F5c4ff10e2c2db549ca1c32c8a775%2Fla-1501965174-z6hsexhkvg-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/96c3d4a/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6d%2F86%2F437304ead0e1fd145d0891ca474e%2Fimg-57d02dfa-turbine-la-1473261164-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/d6978ca/2147483647/strip/true/crop/2048x1478+0+0/resize/1200x866!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Faf%2F80%2F6bd3e1dcd7678dc736b3bde98d4f%2Fla-et-mg-casey-affleck-summer-phoenix-split-se-001", "https://ca-times.brightspotcdn.com/dims4/default/e405371/2147483647/strip/true/crop/2048x1151+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F88%2Fdb%2F89200979d336a814b0ba941e7b27%2Flat-et-melliott-la0004073968-20170821", "https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "https://ca-times.brightspotcdn.com/dims4/default/3379382/2147483647/strip/true/crop/800x450+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F08%2F53%2Fa15a9dd5938ce6bdc526328c8c73%2Fla-et-mg-chrissy-teigen-20170822", "https://ca-times.brightspotcdn.com/dims4/default/09e2fc4/2147483647/strip/true/crop/2048x1151+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd9%2F50%2F10bb4594193e3fcb59ac402e943d%2Fla-1504049040-wylv4cftvk-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/45b240d/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa4%2Fff%2F8a0a497783d03b3fa54271accbfb%2Fla-et-mg-kathy-griffin-performs-in-l-a-20170531", "https://ca-times.brightspotcdn.com/dims4/default/31764e7/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F09%2Fa9%2Fc67cd0e401b405fe53eec72e7999%2Fimg-59843e47-turbine-la-et-viola-davis-photo2", "https://ca-times.brightspotcdn.com/dims4/default/6404575/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F52%2F48%2F77b776f3539b1b85e68f2116c1f2%2Fimg-598a5299-turbine-la-et-glen-campbell-grammys-2012-photo", "https://ca-times.brightspotcdn.com/dims4/default/e603143/2147483647/strip/true/crop/2048x1151+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F70%2F4c%2F0728b2e8d29f2a8d3f8863d9e439%2Fla-1500681966-mz5o56xgfo-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/1524c3a/2147483647/strip/true/crop/900x506+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F17%2Ff5%2Fbfbba533ddff301eb9748ac8553b%2F900x506", "https://ca-times.brightspotcdn.com/dims4/default/bb713c5/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd5%2F67%2F9acd080bef918201db111c22ac35%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/b8c7f76/2147483647/strip/true/crop/2000x1125+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe9%2F73%2F4d220a72c25a72caedba65f6a5c6%2F2000", "https://ca-times.brightspotcdn.com/dims4/default/cf58ebe/2147483647/strip/true/crop/1895x1066+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6f%2F80%2F53a237393f14f07db8a504394c07%2Fimg-597fd2d9-turbine-la-1501549269-gpspr3z6z3-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/31c5e85/2147483647/strip/true/crop/2048x1391+0+0/resize/1200x815!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc9%2F30%2Ffa67c3b3960e2b6d8d861dff627a%2Flat-et-tswift-wre0056503607-20170814", "https://ca-times.brightspotcdn.com/dims4/default/fe4d579/2147483647/strip/true/crop/2008x1129+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F31%2F63%2F05b226d8d8046d3324e78672a6df%2Fla-et-mg-billy-joel-in-concert-new-york-city-20170822", "https://ca-times.brightspotcdn.com/dims4/default/6c66136/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff8%2F8b%2F6d1aec74c61e05e55aae7f80445e%2Fla-et-pee-wee-photo", "https://ca-times.brightspotcdn.com/dims4/default/514d53f/2147483647/strip/true/crop/2048x1363+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F89%2F9b%2F30f1f1ffb3c064bee42880df21e6%2Fla-et-ms-kesha-true-colors-drluke-zedd-20160429", "https://ca-times.brightspotcdn.com/dims4/default/415e4e8/2147483647/strip/true/crop/2048x1521+0+0/resize/1200x891!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2f%2F26%2F8cce66160f680943a139010c0c7f%2Fimg-598d9ef9-turbine-la-et-debra-messing-photo", "https://ca-times.brightspotcdn.com/dims4/default/a04583a/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff4%2Ff1%2F15eb375c11755d16f76383fe8083%2Fimg-546d1fc3-turbine-lat-mg-angelinajolie-wre0024103553-20141117", "https://ca-times.brightspotcdn.com/dims4/default/b1db248/2147483647/strip/true/crop/2000x1333+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fde%2F10%2Fd2d6ada64661fc104b358637d2b6%2Fimg-56e09c65-turbine-lat-gcampbell-lq5a11nc20110824134434", "https://ca-times.brightspotcdn.com/dims4/default/2783b41/2147483647/strip/true/crop/2048x1672+0+0/resize/1200x980!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fef%2F07%2F0cec2b029e9fb18a56538280fd28%2Fimg-5988c2ba-turbine-la-beyonce-left-and-prince-right-20170807", "https://ca-times.brightspotcdn.com/dims4/default/4c8b13c/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc2%2Fc3%2F603d015bc4f030c3a857ae14e059%2Fimg-58fa97c9-turbine-la-ca-2015-celebrity-pictures-305", "https://ca-times.brightspotcdn.com/dims4/default/9c5f85b/2147483647/strip/true/crop/2048x1434+0+0/resize/1200x840!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8d%2F8e%2F09fd4e13433ca0c39b969291a086%2Flat-star-mstewart-la0004876093-20170728", "https://ca-times.brightspotcdn.com/dims4/default/085774d/2147483647/strip/true/crop/2048x1499+0+0/resize/1200x878!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F22%2Fe9%2F6f28ca3bfdca13c04a27ce983186%2Fla-ol-taylor-swift-spotify-youtube-streaming-d-001", "https://ca-times.brightspotcdn.com/dims4/default/01cc5d8/2147483647/strip/true/crop/609x342+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6c%2Fd9%2F86b423bb95e820397bdadb687c5c%2Fla-1502036896-jzjimlu6og-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/790dc5f/2147483647/strip/true/crop/2048x1367+0+0/resize/1200x801!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F15%2Fd8%2Fb32acd4d40f8c554ebd262818a60%2Fla-et-coldplay-at-the-rose-bowl-photos-2016082-006", "https://ca-times.brightspotcdn.com/dims4/default/8cf6f36/2147483647/strip/true/crop/2048x1232+0+0/resize/1200x722!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F44%2F0d%2Ff6649c537958760144f28e6429e5%2Fimg-5996d51d-turbine-la-et-serj-tankarian-photo", "https://ca-times.brightspotcdn.com/dims4/default/1966010/2147483647/strip/true/crop/2048x1367+0+0/resize/1200x801!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8e%2Fdf%2F4e9d629f05679f3193b7973702e3%2Flat-et-mmoore-wre0056530030-20170816", "https://ca-times.brightspotcdn.com/dims4/default/0839af0/2147483647/strip/true/crop/2048x1367+0+0/resize/1200x801!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa9%2Fbf%2F5afe5d4aece72bc5ff42aba63c8e%2Flat-et-tswift-wre0056403461-20170810", "https://ca-times.brightspotcdn.com/dims4/default/0dfa14e/2147483647/strip/true/crop/1999x1124+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F3c%2Fa6%2F94f5158ebddd2dde226c2c82b6f3%2Fla-1502044734-q4jwdbbv8u-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/abe4f59/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fde%2Ff6%2F6792df592283719d1c9a9f5f8ffc%2Fla-et-hc-mahershala-ali-oscars-20170226", "https://ca-times.brightspotcdn.com/dims4/default/b35b706/2147483647/strip/true/crop/2048x1151+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fed%2F14%2F7989b825bc4dc3e2af98a213d60d%2Fimg-59798678-turbine-la-1501136500-vqnwbiucjq-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/f9a4b1e/2147483647/strip/true/crop/2048x1281+0+0/resize/1200x751!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc2%2Fcf%2Ff5902e80b394c40fb709c706803c%2Fimg-58a6303f-turbine-lat-la-me-barbaraeden-la0005451526-20170216", "https://ca-times.brightspotcdn.com/dims4/default/6ddc27b/2147483647/strip/true/crop/800x450+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa4%2F44%2F0fd781f9f24f6956437a13aaf00c%2F800x450", "https://ca-times.brightspotcdn.com/dims4/default/aac9229/2147483647/strip/true/crop/1870x1262+0+0/resize/1200x810!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F72%2F8f%2Fde772ed9afefe2f77f390f7ba488%2Fimg-59a013c0-turbine-la-et-shania-twain-photo", "https://ca-times.brightspotcdn.com/dims4/default/13900d9/2147483647/strip/true/crop/2048x1375+0+0/resize/1200x806!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F06%2Fd9%2F865932d2dcba5de24a1d1ed08026%2Fla-et-hc-game-of-thrones-stark-women-20170827", "https://ca-times.brightspotcdn.com/dims4/default/a3c1048/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe6%2F66%2Fa0e4aadcaa39536bba122bb6d406%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/442a1c7/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8d%2F64%2F4b377665a6d6ff0578139978d546%2Fla-et-mg-james-corden-and-chester-bennington-20170809", "https://ca-times.brightspotcdn.com/dims4/default/3bd2e4a/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8b%2Fe7%2Fd0cfd16322ac616738b9c210e7f8%2Fla-et-ms-wango-tango-2017-concert-photos-004", "https://ca-times.brightspotcdn.com/dims4/default/9477db0/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F65%2Fc3%2F559c5001cb1e50eb6bb7f12c725f%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/1be01a5/2147483647/strip/true/crop/1024x575+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F66%2F25%2Fd098d0adb38949af2b502b2ca67a%2Fla-1501782526-40qhubvit4-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/0eb1308/2147483647/strip/true/crop/2048x1462+0+0/resize/1200x857!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F89%2F0e%2F62e31afa46240530b29dbea87858%2Fla-et-ms-r-kelly-forum-review-20151011", "https://ca-times.brightspotcdn.com/dims4/default/a7ae6ce/2147483647/strip/true/crop/2048x1502+0+0/resize/1200x880!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd9%2Fd0%2F995d8ff377c8d3a6fa55356d52b1%2Fimg-5984399f-turbine-la-et-banderas-photo", "https://ca-times.brightspotcdn.com/dims4/default/8fa4df6/2147483647/strip/true/crop/1024x575+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F14%2F19%2F3c01e50f4ae14cb51c8892be7507%2Fla-mcgarvey-1486693893-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/fa91fa2/2147483647/strip/true/crop/2048x1527+0+0/resize/1200x895!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fee%2F3c%2F9f764895edd3c2c270ef4d751fc7%2Flat-et-rwood-wre0044617726-20170807", "https://ca-times.brightspotcdn.com/dims4/default/5b95fdc/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbf%2Fce%2Fb20fbb13db339b0ae27773f4fef3%2Fimg-5712b8f5-turbine-la-la-et-st-louis-ck-wre0036915310-20160228", "https://ca-times.brightspotcdn.com/dims4/default/af377ef/2147483647/strip/true/crop/1024x682+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ffb%2F69%2Fbfa35a680b045114f110349b80f8%2Fla-mbernardin-1480640506-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/f38458a/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F99%2F24%2Fb8ee579c509f5538c598f42ac94a%2Fla-et-hc-james-cameron-recalls-wannabe-filmmak-001", "https://ca-times.brightspotcdn.com/dims4/default/100564b/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F09%2F98%2F3bf9f03cda5cffb1c0d0e52c11c2%2Fla-1501914187-q2dx8b9dnt-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/a8b3f5f/2147483647/strip/true/crop/2048x1347+0+0/resize/1200x789!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F1e%2F65%2F1b39eba601385583bce493e41ddf%2Flat-et-tswift-wre0056349036-20170809", "https://ca-times.brightspotcdn.com/dims4/default/6e39dff/2147483647/strip/true/crop/2048x1361+0+0/resize/1200x797!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ffb%2F6c%2Fde4693d119022f9b084e98513ebc%2Fimg-59934495-turbine-la-et-st-michael-yancy-20170815", "https://ca-times.brightspotcdn.com/dims4/default/b13202b/2147483647/strip/true/crop/2048x1319+0+0/resize/1200x773!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F53%2F80%2Ff42cdb1d0487ded4d073770b8e5c%2Flat-et-tswift-wre0056347224-20170808", "https://ca-times.brightspotcdn.com/dims4/default/ae2dec1/2147483647/strip/true/crop/2048x1452+0+0/resize/1200x851!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F5f%2Fb6%2Ff93449c4d93522edde7b4b0cdfb3%2Fla-et-ms-the-smiths-lead-singer-morrissey-20151007", "https://ca-times.brightspotcdn.com/dims4/default/3148e68/2147483647/strip/true/crop/600x350+0+0/resize/1200x700!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbf%2F26%2Faf83cd4137d47778c750ff6c8832%2Fimg-52b20cff-turbine-la-et-st-anderson-cooper-and-kathy-griffin-tea-001", "https://ca-times.brightspotcdn.com/dims4/default/47bc670/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F87%2F4c%2F962f80c8b12579f781926888e833%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/52720bf/2147483647/strip/true/crop/2040x1362+0+0/resize/1200x801!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fda%2Fe7%2Fbe9be5c4fd853773df44021c5dcd%2Fimg-59a3e1bb-turbine-la-et-lisa-ling-photo", "https://ca-times.brightspotcdn.com/dims4/default/ac7c545/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc9%2F29%2Fabae8394a92c756d6e2fc70834cb%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/3405552/2147483647/strip/true/crop/682x1024+0+0/resize/1200x1802!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F23%2Fb2%2F77ff81fc18db6c286e499b90b590%2Fimg-59934591-turbine-la-oprah-winfrey-and-partner-stedman-graham-20170815", "https://ca-times.brightspotcdn.com/dims4/default/7c2e8fa/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F4a%2F8c%2F1ea33f18c2d5595d84844ef37e67%2Fimg-583c76ac-turbine-la-dlewis-1480357576-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/6340d1b/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc2%2F1e%2Fda0144ed348dbcae2e732bacd93b%2Flat-sp-tiger-woods-lindsey-vonn-20150503", "https://ca-times.brightspotcdn.com/dims4/default/15ce3e0/2147483647/strip/true/crop/800x450+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F66%2F12%2F29a5f0da6564f28e98b2233e6108%2Fla-et-mg-vanessa-grimaldi-and-nick-viall-20170825", "https://ca-times.brightspotcdn.com/dims4/default/d775086/2147483647/strip/true/crop/2000x1125+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd3%2Fa8%2Fb8fce5e58440e69d9f9bfebd2146%2F2000", "https://ca-times.brightspotcdn.com/dims4/default/41dfc26/2147483647/strip/true/crop/1884x1225+0+0/resize/1200x780!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F0b%2F9c%2F8594049cab28600eb26426ca93c3%2Fimg-59a3eb43-turbine-la-et-chris-tucker-photo", "https://ca-times.brightspotcdn.com/dims4/default/9c0e696/2147483647/strip/true/crop/2048x1434+0+0/resize/1200x840!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F1f%2F74%2F61b6d822238379193325c5f0547d%2Flat-et-tswift-la0036621861-20170814", "https://ca-times.brightspotcdn.com/dims4/default/f77a327/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F7f%2Fc6%2F83a8cfc32e1a406ccaa149183236%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/f491426/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe8%2Fd4%2F39ac402682b716f66c0fed3a9e9a%2Flat-et-tswift-wre0056431453-20170811", "https://ca-times.brightspotcdn.com/0e/c6/b86a8b4b43a793259deb28a32a56/latlogoinverse.svg", "https://ca-times.brightspotcdn.com/dims4/default/bb8688b/2147483647/strip/true/crop/1024x682+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F62%2Fe4%2F14f2ba6f8d82914dfe09530c585a%2Fimg-59837f8d-turbine-la-cast-of-everwood-20170803", "https://ca-times.brightspotcdn.com/dims4/default/ed0dae5/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6c%2Ff9%2F30379a540423a13a389c8d75b57e%2Fla-et-2017-mtv-video-music-awards-pre-show-jack-photo", "https://ca-times.brightspotcdn.com/dims4/default/7983ec2/2147483647/strip/true/crop/2048x1363+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ffe%2F13%2Fba1ef97079251f46ef19e3cd1735%2Fimg-5991663e-turbine-la-et-robert-de-niro-chair-photo", "https://ca-times.brightspotcdn.com/dims4/default/86a5dce/2147483647/strip/true/crop/1024x683+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc9%2Fbf%2F64d87b3015839ba3b22ba05aa96e%2Fla-et-mn-leonardo-dicaprio-to-star-in-inarritu-001", "https://ca-times.brightspotcdn.com/dims4/default/9d70ec7/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fee%2F42%2F15f4cd17622f71aa2893abd648b8%2Fla-1502345182-i573earog1-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/c68e88b/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fcc%2F98%2F27b22ba887e7185e59d587f04045%2Fla-emmy-awards-2016-benioff-20160918", "https://ca-times.brightspotcdn.com/dims4/default/4927d09/2147483647/strip/true/crop/2048x1402+0+0/resize/1200x821!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F7a%2F54%2F73d1cacfb69f58f13badd719b1fc%2Fimg-598d9009-turbine-la-et-john-slattery-photo", "https://ca-times.brightspotcdn.com/dims4/default/bfc33cf/2147483647/strip/true/crop/1200x800+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fba%2F49%2F22c49d13a2fdb90d0dc0978c62c2%2Fla-et-pregnancy-and-parenthood-hollywood-pictu-067", "https://ca-times.brightspotcdn.com/dims4/default/fa001c6/2147483647/strip/true/crop/2048x1378+0+0/resize/1200x807!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F49%2F0f%2Fda2a4305e9317a71a4957534885c%2Fimg-5988a5af-turbine-la-amy-schumer-20170807", "https://ca-times.brightspotcdn.com/dims4/default/bd63ffc/2147483647/strip/true/crop/2048x1336+0+0/resize/1200x783!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ffa%2Fc6%2F690863bb7a43395a51db2b1af74f%2Fla-et-ms-susan-bro-heather-heyer-20170827", "https://ca-times.brightspotcdn.com/dims4/default/2ae8006/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F87%2F36%2F14442e8ac94c1cfedc5e7c37a89d%2Fla-ca-jc-patti-smith-20151004", "https://ca-times.brightspotcdn.com/dims4/default/b3e6c6c/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F93%2Fb0%2F60c605e6738853c3173d49c5c6b6%2Fla-et-mg-usher-raymond-iv-20170807", "https://ca-times.brightspotcdn.com/dims4/default/ccd48e8/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F1e%2Fa2%2Ff2e2f067f084abf7ae90ab8257ad%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/2a9423b/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F5b%2F17%2Fc2b6368a6535d8ae896ad8e19eb2%2Fla-1502349860-g7566d5mm8-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/e135269/2147483647/strip/true/crop/682x1024+0+0/resize/1200x1802!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F78%2Fbf%2F2441880ca1ad2d846fbea9271eba%2Fimg-5997553e-turbine-la-randy-newman-20170818", "https://ca-times.brightspotcdn.com/dims4/default/3bece3e/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fcc%2F0b%2F5f51498e26bdf379d9e9ce90af2d%2Fla-et-mg-corinne-olympios-of-the-bachelor-20170614", "https://ca-times.brightspotcdn.com/dims4/default/44a8921/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F56%2F75%2F99cd71c10291ccba6df5386ab327%2Fimg-597fb016-turbine-la-1501540369-sjq7mzmcbr-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/91fe4ab/2147483647/strip/true/crop/2048x1366+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F47%2F3f%2F980579a53b64786157bd88c62184%2Fla-dick-gregory-20170820", "https://ca-times.brightspotcdn.com/dims4/default/a6c9735/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F35%2F6b%2Fa8f3f2931d06516e0d32b19e2e93%2Fimg-597911c3-turbine-la-1501106622-5t82w9vtlu-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/8adda9e/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F92%2F02%2Fbb7e4e1f9ac1253e991d49569443%2Fimg-5873df8b-turbine-la-et-j-k-rowling-donald-trump-20170109", "https://ca-times.brightspotcdn.com/dims4/default/c78862d/2147483647/strip/true/crop/2048x1480+0+0/resize/1200x867!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F27%2Ffe%2F7390ad6fec3f4f6e81370ad2a084%2Fimg-597b1390-turbine-la-et-charlie-xcx-photo", "https://ca-times.brightspotcdn.com/dims4/default/133f0bd/2147483647/strip/true/crop/2048x1684+0+0/resize/1200x987!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9f%2F4a%2F3ca054962c9fd7d4170eadb41cd7%2Flat-et-ctheron-la0005510208-20170803", "https://ca-times.brightspotcdn.com/dims4/default/597d9b4/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F26%2F6c%2F666ea11fb5540cda83aaa57ecb9e%2Fla-1497658488-zt3045sx53-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/e001b52/2147483647/strip/true/crop/2048x1367+0+0/resize/1200x801!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F17%2Faa%2Fcf1369ee4a44392aea18a6cf96b8%2Fimg-59a33b91-turbine-la-et-tobe-hooper-photo", "https://ca-times.brightspotcdn.com/dims4/default/8f70ed7/2147483647/strip/true/crop/600x338+0+0/resize/1200x676!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F70%2F4c%2F1afe42445ea378449aab79f8fac5%2F600x338", "https://ca-times.brightspotcdn.com/dims4/default/06e528d/2147483647/strip/true/crop/1024x575+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F26%2F8f%2Fc4c12e9a8e21cebcdb957771e9c5%2Fla-1502216319-edf7bqo8k3-snap-image", "https://ca-times.brightspotcdn.com/a6/d6/eea0f1094fb281dbea09e0aa79cd/art-caltimes-trademark-3x.png", "https://ca-times.brightspotcdn.com/dims4/default/24eee6e/2147483647/strip/true/crop/1920x1080+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2c%2F53%2F17b18859d9557bb87ea06bf4f169%2Fla-et-ms-hard-summer-gary-richards", "https://ca-times.brightspotcdn.com/dims4/default/6983ee4/2147483647/strip/true/crop/1719x1648+0+0/resize/1200x1150!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fac%2Ff8%2F16883724e766e791b5f16d4fac08%2Fimg-59915fdb-turbine-la-et-madonna-2004-photo", "https://ca-times.brightspotcdn.com/dims4/default/2ff4130/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F76%2F01%2F1b27225cfa478ef90b7072ffc404%2Fla-et-mg-elon-musk-and-amber-heard-20170809", "https://ca-times.brightspotcdn.com/dims4/default/b74dd28/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9a%2F62%2F01554108d4769e489b669066e537%2Fla-et-mg-chris-pratt-and-anna-faris-20170807", "https://ca-times.brightspotcdn.com/dims4/default/aa7a8e1/2147483647/strip/true/crop/2048x1423+0+0/resize/1200x834!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F60%2F91%2F33ee021655a8d3c76d2dfcc17de6%2Fla-et-st-elisabeth-moss-20170816", "https://ca-times.brightspotcdn.com/dims4/default/0f1a063/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F74%2F24%2F5fcc079482e4abe4ef0538f6a8f0%2Fla-et-mg-file-robin-thicke-and-april-love-geary-expecting-a-baby-20170818", "https://ca-times.brightspotcdn.com/dims4/default/98e2338/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2c%2Fce%2F067b03a75e32cc2bea63c73378fb%2Fimg-55a856aa-turbine-la-et-mg-blake-lively-breast-feeding-instagram-001", "https://ca-times.brightspotcdn.com/dims4/default/5d269fb/2147483647/strip/true/crop/2048x1436+0+0/resize/1200x841!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ffe%2F83%2Fd39dfdd8dfd66335271de4e4f6a5%2Flat-et-slee-wre0057259611-20170823", "https://ca-times.brightspotcdn.com/dims4/default/932c755/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F22%2F51%2F2a6104c3aef2cff8ff95328d1099%2Fla-1501788344-smc3eet1p0-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/65e76b1/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F03%2Fa3%2F66e537f6aa12c319c22ffb313305%2Fimg-58b3d94f-turbine-la-et-mn-oscars-2017-winners-room-pictures-015", "https://ca-times.brightspotcdn.com/dims4/default/93c7c36/2147483647/strip/true/crop/2048x1367+0+0/resize/1200x801!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F4d%2Fd9%2F5007ed401659e35abc3494f425c7%2Fimg-59a0168e-turbine-la-et-william-friedkin-photo", "https://ca-times.brightspotcdn.com/dims4/default/a59ed83/2147483647/strip/true/crop/2048x1582+0+0/resize/1200x927!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdd%2F1a%2F27f2252674a32983f3741a442ffa%2Flat-et-abening-wre0058143040-20170830", "https://ca-times.brightspotcdn.com/dims4/default/b864dee/2147483647/strip/true/crop/2048x1503+0+0/resize/1200x881!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa2%2Fd4%2Fcd520dfc16438690b3102c1e3127%2Fimg-59844913-turbine-la-et-casey-affleck-photo", "https://ca-times.brightspotcdn.com/dims4/default/54ec7e4/2147483647/strip/true/crop/2048x1490+0+0/resize/1200x873!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F30%2Fb0%2Fde463f25f90b9e231cd1666f0ad6%2Flat-et-slee-wre0057259610-20170823", "https://ca-times.brightspotcdn.com/dims4/default/b332ca9/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F76%2F53%2Feab213714f0561c873108166bdb2%2Fimg-599338bf-turbine-la-et-st-oprah-20170815", "https://ca-times.brightspotcdn.com/dims4/default/a9a2c96/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F26%2F25%2F269d2d464b68fa26a69bf18c05cf%2Flat-et-dhoffman-la0004795356-20170803", "https://ca-times.brightspotcdn.com/dims4/default/b92578a/2147483647/strip/true/crop/2048x1437+0+0/resize/1200x842!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F78%2F32%2F9d5d358bbf4bdd756cfeb1e4ee7b%2Flat-et-tswift-wre0056405298-20170811", "https://ca-times.brightspotcdn.com/dims4/default/5a6e295/2147483647/strip/true/crop/2048x1400+0+0/resize/1200x820!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F92%2Fdb%2F8b0aa270aed309e9a646878b427a%2Flat-mg-debra-messing-will-grace-wre0011749082-20131007", "https://ca-times.brightspotcdn.com/dims4/default/581cdb2/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd0%2Fef%2Fc8944570ddc19020751755b2e7a8%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/a7480c2/2147483647/strip/true/crop/2048x1363+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F17%2F57%2F85d6c77316d5e1c1a6f792d17ceb%2Fimg-5997406f-turbine-la-et-st-la-ca-0501-kristen-wiig-20170818", "https://ca-times.brightspotcdn.com/dims4/default/847f724/2147483647/strip/true/crop/1024x680+0+0/resize/1200x797!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F7a%2F1b%2F5e64e354fa413204ce36613eb4a0%2Fla-1501698018-ug51xgb57o-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/1ffc327/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F34%2F87%2F12feed40e9d390689d5159444c52%2Fla-et-mg-gloria-gaynor-20170831", "https://ca-times.brightspotcdn.com/dims4/default/8bb251e/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F33%2F72%2Ff49f89ead1daca49442ec07afaa6%2Fla-et-sean-spicer-20170206"], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-august-2017-htmlstory.html", "title": "Today in Entertainment: Jamie Foxx announces Hurricane Harvey relief telethon; ‘Simpsons’ fires longtime composer Alf Clausen", "meta_data": {"og": {"title": "Today in Entertainment: Jamie Foxx announces Hurricane Harvey relief telethon; 'Simpsons' fires longtime composer Alf Clausen", "url": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-august-2017-htmlstory.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "url": "https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "LA Times logo"}, "description": "Here's what's new and interesting in entertainment and the arts:Newly reopened Angels Flight has long been a popular L.A. shooting locationJamie Foxx announces telethon for Hurricane Harvey reliefGwyneth Paltrow admits she's screwed up plenty of relationshipsLongtime 'Simpsons' composer Alf Clausen…", "site_name": "Los Angeles Times", "type": "website"}, "twitter": {"card": "summary_large_image", "description": "Here's what's new and interesting in entertainment and the arts:Newly reopened Angels Flight has long been a popular L.A. shooting locationJamie Foxx announces telethon for Hurricane Harvey reliefGwyneth Paltrow admits she's screwed up plenty of relationshipsLongtime 'Simpsons' composer Alf Clausen exits the show after 27 yearsFirefighter who resuscitated Princess Diana remembers her final moments on 20th anniversary of her deathInstead of statues, Trevor Noah and Roy Wood Jr. have another idea for honoring Confederate history", "site": "@latimes", "title": "Today in Entertainment: Jamie Foxx announces Hurricane Harvey relief telethon; 'Simpsons' fires longtime composer Alf Clausen"}, "fb": {"app_id": 134435029966155, "pages": 5863113009}, "robots": "max-image-preview:large", "viewport": "width=device-width,initial-scale=1", "description": "Here's what's new and interesting in entertainment and the arts:Newly reopened Angels Flight has long been a popular L.A. shooting locationJamie Foxx announces telethon for Hurricane Harvey reliefGwyneth Paltrow admits she's screwed up plenty of relationshipsLongtime 'Simpsons' composer Alf Clausen exits the show after 27 yearsFirefighter who resuscitated Princess Diana remembers her final moments on 20th anniversary of her deathInstead of statues, Trevor Noah and Roy Wood Jr. have another idea for honoring Confederate history", "brightspot.contentId": "0000016c-68c4-d4d6-a16e-eaef181a0000", "brightspot.cached": "false"}, "movies": [], "publish_date": null, "source": "https://www.latimes.com", "summary": ""}