{"url": "https://en.wikipedia.org/wiki/Justin_Brescia", "text": "American television personality (born 1982)\n\nJustin Robert Brescia (born March 11, 1982), also known by his nickname Justin Bobby, is an American television personality.\n\nIn 2007, he came to prominence after being cast as a supporting position in the reality television series The Hills, which chronicled the lives of Lauren Conrad, Audrina Patridge, Whitney Port, and Heidi Montag.[1] During its production, Brescia and Patridge became involved in an on-again/off-again relationship. Consequentially, it became a central focus of the series since its third season, and was carried through each subsequent season. Brescia and Patridge met while he was working as a hairdresser for the band Maroon 5.[2]\n\nHe is the vocalist, guitarist and percussionist for the Austin, Texas-based band, BobbyrocK[3]\n\nBiography [ edit ]\n\nIn 2006, MTV developed the reality television series The Hills as the spin-off of Laguna Beach: The Real Orange County. It originally chronicled the lives of Lauren Conrad, who appeared on its predecessor, her housemate Heidi Montag, and friends Audrina Patridge and Whitney Port.[4]\n\nBrescia launched a line of vegan and non-toxic hair care and styling products in the summer of 2012 called BRUSH by Justin Bobby Brescia. The products were featured on Amazon and designed for professional use.[5] Brescia highlighted his product line in his professional hair salons.\n\nAt the 2018 MTV Video Music Awards, MTV announced a reboot of The Hills entitled The Hills: New Beginnings, slated to premiere in 2019. Brescia was announced as part of the cast of the new series.[6][7][8] In 2021, Brescia made his acting debut in the film The Chimera Effect, currently in post-production, and contributed music to the film Room 9.\n\nReferences [ edit ]\n\nJustin Brescia at IMDb", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Justin_Brescia", "title": "Justin Brescia", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "Justin Brescia - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}