{"url": "https://www.elitedaily.com/p/taylor-swifts-tonight-show-performance-was-so-emotional-itll-have-you-sobbing-5462983", "text": "Taylor Swift performed on The Tonight Show Starring Jimmy Fallon on Monday, Nov. 13, and the video is emotional on its own. But one of the show's employees revealed some more details about her performance through a Twitter thread last night, and it will make you sob. Last night was Fallon's first night back on the show following the death of his mother, Gloria Fallon, on Nov. 4. Fallon paid an emotional tribute to his mother during the show, during which he revealed some private things about his relationship with his mother that make Taylor Swift's Tonight Show performance even more of a tearjerker. In the memorial to his mother on the show, Fallon said through tears,\n\nWhen we were little, my mom would take us to the store — me and my sister — and we would hold hands. And she would squeeze my hand three times and say, 'I love you.' And I would squeeze back, 'I love you too.' And last week, I was in the hospital, and I just grabbed her hand and I squeezed, 'I love you.' I just knew we were in trouble.\n\nIt was a moving moment. When Swift performed later in the show, she sat at a piano and sang \"New Year's Day,\" which is the last song on Reputation and one of the most emotional on the album. It's a romantic song with lines like, \"Hold on to the memories, they will hold on to you,\" and \"Don't read the last page, but I stay when it's hard, or it's wrong, or we're making mistakes.\" But the most emotional moment in this performance came when Swift sang the \"New Year's Day\" lyrics that say, \"You squeeze my hand three times in the back of the taxi.\" Having heard Fallon's story about his mother squeezing his hand three times, there wasn't a dry eye in the house when this coincidence happened.\n\nFollowing Swift's performance, one of the Tonight Show writers and producers, Mike DiCenzo, tweeted his thread revealing Swift agreed to perform that night completely last-minute out of an act of kindness for Fallon.\n\nIn a series of tweets, DiCenzo said,\n\nI'm sure today was especially tough for Jimmy. The fact that he came out, stood there, and did a normal monologue for the crowd is a testament to how strong he is.\n\nBut at the desk, you could hear his voice break when talking about our musical guest Taylor Swift, and that's because he knew what he was about to say...\n\nJimmy's words about his mom were beautiful. \"Mom, I'll never stop trying to make you laugh. I love you.\" I was crying. We all were.\n\nThe story about his mom squeezing his hand 3 times to say \"I love you\" when he was a kid, and then him squeezing her hand in the hospital - he hadn't told any of us that story... More on that in a second.\n\nFirst, a quick word about Taylor Swift. She was not scheduled to do our show today. But we wanted something special for this first show back, so we asked her on a complete whim, since she had been in town doing SNL. She said yes with zero hesitation.\n\nShe sang \"New Year's Day.\" No one had heard it. Suddenly she sings the line, \"Squeeze my hand 3 times in the back of the taxi.\" I nearly gasped. Tears. I think everyone in the audience started sobbing.\n\nI could see Jimmy silhouetted at his desk dabbing his eyes with a tissue. We all lost it. It was a beautiful coincidence in a beautiful performance. \"Hold on to your memories, they will hold on to you,\" Taylor sang.\n\nThat hug between Jimmy and Taylor after the song was 100% real emotion. Whatever you think of Taylor, she did something beautiful for Jimmy and our show today, and we're forever grateful.\n\nIt was a moving performance, and fans loved it.\n\nSwift was in New York this past weekend as the musical guest on Saturday Night Live hosted by Tiffany Haddish, where she performed \"...Ready For It?\" and \"Call It What You Want.\" The end of The Tonight Show showed Fallon running through the crowd giving high fives to the audience members which, according to DiCenzo, was added in because it was Gloria Fallon's favorite part of every episode.", "images": ["https://imgix.bustle.com/uploads/image/2017/11/14/c6586af3-a00a-4964-a720-814c933e2a12-screen-shot-2017-11-14-at-71718-am.png?w=374&h=207&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/9/28/b0f43f37-1fd9-4607-9040-390f9b68c1e7-f7819749-01e9-4a30-8d29-0d948716e7b7-getty-1418888016.jpeg?w=138&h=138&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/9/26/02fa0add-3382-4344-89c6-a701d27bc64b-getty-1243395808.jpg?w=138&h=138&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2017/11/14/c6586af3-a00a-4964-a720-814c933e2a12-screen-shot-2017-11-14-at-71718-am.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2022/10/5/6376db86-d033-4190-bcea-0976d51d275e-getty-1243081800.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.456&fp-y=0.3218", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/uploads/image/2017/11/14/c6586af3-a00a-4964-a720-814c933e2a12-screen-shot-2017-11-14-at-71718-am.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/taylor-swifts-tonight-show-performance-was-so-emotional-itll-have-you-sobbing-5462983", "title": "The Story Behind Taylor Swift’s Surprise ‘Tonight Show’ Performance Is So Emotional", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image", "creator": "@kellixboyle"}, "article": {"publisher": "https://www.facebook.com/EliteDaily"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/taylor-swifts-tonight-show-performance-was-so-emotional-itll-have-you-sobbing-5462983", "type": "article", "title": "The Story Behind Taylor Swift’s Surprise ‘Tonight Show’ Performance Is So Emotional", "description": "Taylor Swift performed on The Tonight Show Starring Jimmy Fallon on Monday, Nov. 13, and the video is emotional on its own. But one of the show's employees revealed some more details about her performance through a Twitter thread last night, and it…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2017/11/14/c6586af3-a00a-4964-a720-814c933e2a12-screen-shot-2017-11-14-at-71718-am.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Taylor Swift performed on The Tonight Show Starring Jimmy Fallon on Monday, Nov. 13, and the video is emotional on its own. But one of the show's employees revealed some more details about her performance through a Twitter thread last night, and it…"}, "movies": ["https://www.youtube.com/embed/U8QV5fa7xa4", "https://www.youtube.com/embed/gjXrm2Q-te4"], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}