{"url": "https://www.inquisitr.com/4479415/olivia-munn-putting-aaron-rodgers-family-drama-behind-her-she-is-caught-getting-cozy-with-trevor-noah/", "text": "Olivia Munn is already moving on with her life. Following the end of her relationship with NFL star Aaron Rodgers, the actress is reportedly dating a new man. Has Munn already put Rodgers' family drama behind her?\n\nRadar Online reports that Munn was caught getting extra cozy with Trevor Noah this past weekend. The two allegedly met up twice over the extended weekend, including a romantic lunch in East Village. The actress donned heels, a camo jacket, and a leopard pattern romper for the outing while the comedian wore a casual blue outfit. The two appeared more than happy during their lunch, though it isn't clear if they are actually dating.\n\nMunn has not been spotted with other men since her breakup with Rodgers. The two parted ways because Rodgers was reportedly tired of all her drama. Munn went on a romp with her girlfriends after the split and looked content living the single life. Rodgers and Munn have not commented on their breakup, though an insider told E! Online that both parties are coping well with the split.\n\nThe source explained how their relationship had been on shaky ground for months prior to the breakup. Olivia Munn and Aaron Rodgers, however, tried to make things work even though they knew a split was bound to happen. Fortunately, it sounds like they are both moving on and doing well.\n\n[caption id=\"attachment_3913226\" align=\"alignnone\" width=\"395\"] Aaron Rodgers and Olivia Munn [Image by Jason Merritt/Getty Images][/caption]\n\nIn fact, Rodgers was recently spotted at the wedding of his Green Bay Packers teammate, Randall Cobb, and looked happier than ever. Of course, with Munn officially out of the picture, Rodgers has plenty of options at his disposal, though sources claim that he's a pretty picky guy when it comes to women.\n\nAs far as Munn's romantic life is concerned, the insider believes that she will not settle with anyone until she knows for sure their romance will last. Munn and Rodgers dated for over three years before calling it quits and were rumored to be on the verge of an engagement.\n\n\"Olivia is not going to settle till she feels like this is the man she will end up with,\" the source shared. \"Her eyes are open and she is very open to dating. She is good!\"\n\nWhile Munn and Rodgers' relationship is over, the insider didn't rule out a possible reconciliation. For now, however, the two are taking a break and are not planning on getting back together.\n\nTell us! Do you think Olivia Munn and Aaron Rodgers have any hope of a reconciliation? Let us know in the comments below.\n\n[Featured Image by Dimitrios Kambouris/Getty Images]", "images": ["https://imgb.srgcdn.com/d258d2ec-e52b-4489-9950-908cc366bacf.jpg", "https://secure.gravatar.com/avatar/5ed34468ceaaad942f0b4277ee61d2b2?s=800", "https://imgb.srgcdn.com/fe42e24b-1fa1-4cf2-b7ef-0bcd25a6f5c9.png", "https://imgb.srgcdn.com/1740626a-9ecf-4723-b66a-d7ca5e1d678c.jpg", "https://imgb.srgcdn.com/28fd1ecd-acc0-48fc-be3b-21a0f5ef3d90.jpg", "http://www.inquisitr.com/wp-content/uploads/2017/01/aaron-rodgers-brother-1.jpg", "https://imgb.srgcdn.com/a5ba8e20-c5b5-4c82-ae2b-4f343261a07b.jpg", "https://imgb.srgcdn.com/6977b3f9-ffc5-44c5-866c-e80c13668077.jpg", "https://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png"], "top_img": "https://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.inquisitr.com/4479415/olivia-munn-putting-aaron-rodgers-family-drama-behind-her-she-is-caught-getting-cozy-with-trevor-noah/", "title": "Olivia Munn Putting Aaron Rodgers Family Drama Behind Her! She Is Caught Getting Cozy With Trevor Noah", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimal-ui, user-scalable=no", "msapplication-TileImage": "/static/inquisitr/favicon-128x128.png", "robots": "max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Olivia Munn Putting Aaron Rodgers Family Drama Behind Her! She Is Caught Getting Cozy With Trevor Noah", "url": "https://www.inquisitr.com/4479415/olivia-munn-putting-aaron-rodgers-family-drama-behind-her-she-is-caught-getting-cozy-with-trevor-noah/", "site_name": "The Inquisitr", "description": "Olivia Munn Putting Aaron Rodgers Family Drama Behind Her! She Is Caught Getting Cozy With Trevor Noah", "updated_time": "2021-08-16 18:13:43Z"}, "article": {"modified_time": "2021-08-16 18:13:43Z", "published_time": "2017-09-06 09:37:09Z", "section": "Celebrities"}, "description": "Olivia Munn Putting Aaron Rodgers Family Drama Behind Her! She Is Caught Getting Cozy With Trevor Noah", "keywords": "Celebrities", "twitter": {"card": "summary_large_image"}}, "movies": [], "publish_date": 1504690629.0, "source": "https://www.inquisitr.com", "summary": ""}