{"url": "https://www.etonline.com/tv/215671_exclusive_ozzy_lusth_on_witnessing_jeff_varner_out_zeke_smith_on_survivor_the_reaction_was_shock", "text": "Last week's episode of Survivor: Game Changers was a big moment for Jeff Varner and Zeke Smith, but also one for the rest of the Nuku tribe -- including Ozzy Lusth.\n\nThe four-time Survivor player was sitting right next to Varner when he outed Smith as transgender during tribal council, and nearly 10 months later, can still recall the intense \"shock\" he felt that night.\n\n\n\nEXCLUSIVE: Inside Jeff Varner's Decision to Out Zeke Smith at Tribal Council, What Viewers Didn't See\n\n\"The reaction was one of shock. Just being in tribal council, and having somebody basically, you know, change the course of somebody's life in such a dramatic way. You can only feel that sort of shock, and then once it sinks in, there's anger,\" Lusth told ET over the phone on Thursday. \"There's resentment, there's a lot of sadness, and, you know, it's a shame that Varner felt like he had to stoop to that level.\"\n\nCBS\n\nFans were also shocked by the moment Varner decided to out Smith on national television. \"There is deception here. Deceptions on levels, Jeff, that these guys don't even understand,\" Varner said in an attempt to avoid his own elimination. \"Why haven't you told anyone that you're transgender?\"\n\nAfter minutes of blank stares, Smith finally responded with an eloquent speech about metamorphosis, and how he hopes the experience is one that viewers will be able to learn from -- something that Lusth applauds.\n\n\"The feeling of shock has died down and I think that you just have to use something like this as an opportunity to... it was a tough thing for Zeke to have to deal with, but, you know, he signed up to be on a nationally syndicated television show, and he's going be seen by millions of people worldwide, and there's always the potential of that happening,\" he said. \"And he was ready for that.\"\n\n\n\nEXCLUSIVE: Jeff Varner Tearfully Admits He's Been in Therapy Since Outing Zeke Smith on 'Survivor'\n\n\"Zeke was able to turn this into an amazing positive, and be that voice for something that really needs a strong, positive voice at this point in our history,\" he added. \"We need to all reflect, as human beings, on how we treat each other. We need to grant the rights, the equal rights, the civil rights, that everybody deserves across the board, and I hope that this is just a learning lesson for all the people who maybe don't know a trans person in their life, and maybe have never met a gay person in their life, that we're all people, and we all deserve equal respect and equal rights.\"\n\n'Survivor' Contestant Jeff Varner Thought He Was in a 'Good Place' With Zeke Smith After Outing Him This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page.\n\nThis week's episode saw Smith reveal to the rest of his Survivor competitors after the merge that he was transgender -- but Lusth said that being transgender didn't so much make him a target for elimination as his amazing story.\n\n\"No [his being trans wasn't a conversation after he shared the news], not really. I mean, the only thing that you have to think at this point is, 'Wow, what a crazy story. He's gone through such a crazy transformation, and if he makes it to the end, it's going to be hard not to give him the money, and not to vote him the winner,' so, you know, that's what he has going against him now,\" he explained. \"And sadly, that's going to be something that's going to be really hard to overcome.\"\n\nHali Ford, who was voted out during Wednesday's first episode, while Lusth was voted out second, agreed.\n\n\n\nEXCLUSIVE: 'Survivor' Castaway Jeff Varner 'Devastated' to Be Fired From Job After Outing Fellow Contestant Zeke Smith\n\n\"I think it speaks to how much we just think of Zeke as a person, that him being transgender had nothing to do with the vote. It was just not at all in the conversation. We had that one time when we were all gathered around, but then it was all about strategy,\" she recalled, noting that it was her plan to eliminate Smith anyway. \"I wanted Zeke out, actually, because I saw him as a big player, and I was trying to get the numbers with Brad, Sierra, Debbie, me, Troyzan, Michaela and Aubry, hopefully. That was my plan. And I thought Zeke was a good target, Zeke or Ozzy, but no one was really open to Ozzy. So, for me, it was purely strategic, and had nothing to do with any of that drama.\"\n\n\"I think Cirie is a nurse, and she could tell by scars, but [none of us had any idea he was trans]. I mean, as far as I know, people just took him as he presented himself to be,\" she continued. \"I surely did.\"\n\nAt the end of the day, Ford said she was \"really proud\" of Smith for how he handled the situation.\n\n\"I really felt for Zeke, because it's the core of his narrative, like, his life story for the past however many years, and it's just so close to his heart and his identity, that I hate that he had to be exposed in such a jarring way,\" she said. \"No one should have to go through that, so, you know, I was really proud for how he handled it. I thought he was really gracious and strong.\"\n\n\n\nWATCH: Zeke Smith on Forgiving Jeff Varner After 'Survivor' Outing: 'I Didn't Want Him to Feel the Pain That I Had'\n\n\"I think it would be cool to see Zeke up there [in the final three]. He's definitely a power player,\" Ford confessed. \"I think he's pretty good strategically, and I'd like to see him go far, even though I was trying to get him out.\"\n\nSurvivor airs Wednesdays at 8 p.m. ET/PT on CBS.\n\nSee how Smith reacted to his outing the morning after tribal council -- and how he broke the news to the rest of the cast -- in the video below.", "images": ["https://media.amlg.io/image-assets/et/et+et_prod-image-566846.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-08/GettyImages-1240426139.jpg?h=05c564aa&itok=Dkqb34Us", "https://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-04/1280_108343_D19740b.jpg?itok=-ed69iHj", "https://media.amlg.io/image-assets/et/et+et_prod-image-570487.png", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-04/ozzy_vidpic_042017_1280Copy2.jpg?itok=QJTUjIF9", "https://media.amlg.io/image-assets/et/et+et_prod-image-566171.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-566831.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-567063.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-566844.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-566606.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-570848.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-566481.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-567075.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-565964.png", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-10/Screen%20Shot%202022-10-08%20at%2011.17.16%20AM.png?h=22ea39b5&itok=NjZh8lt3", "https://media.amlg.io/image-assets/et/et+et_prod-image-567077.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-565995.png", "https://www.etonline.com/sites/default/files/styles/video_1280x720/public/images/2017-04/ozzy_vidpic_042017_1280Copy2.jpg?itok=fdm0iYm3", "https://media.amlg.io/image-assets/et/et+et_prod-image-566814.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-566818.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-566845.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-569827.png", "https://media.amlg.io/image-assets/et/et+et_prod-image-566030.png"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-04/ozzy_vidpic_042017_1280Copy2.jpg?itok=QJTUjIF9", "keywords": [], "authors": ["Jennifer Drysdale"], "canonical_link": "https://www.etonline.com/tv/215671_exclusive_ozzy_lusth_on_witnessing_jeff_varner_out_zeke_smith_on_survivor_the_reaction_was_shock", "title": "EXCLUSIVE: Ozzy Lusth on Witnessing Jeff Varner Out Zeke Smith on 'Survivor': 'The Reaction Was Shock'", "meta_data": {"article": {"opinion": "false"}, "apple-mobile-web-app-capable": "yes", "robots": "index", "description": "The four-time 'Survivor' player told ET that he hopes the episode will be a 'learning lesson.'", "keywords": "TV, News, Survivor", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/tv/215671_exclusive_ozzy_lusth_on_witnessing_jeff_varner_out_zeke_smith_on_survivor_the_reaction_was_shock", "title": "EXCLUSIVE: Ozzy Lusth on Witnessing Jeff Varner Out Zeke Smith on 'Survivor': 'The Reaction Was Shock'", "description": "The four-time 'Survivor' player told ET that he hopes the episode will be a 'learning lesson.'", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-04/ozzy_vidpic_042017_1280Copy2.jpg?itok=QJTUjIF9", "width": 1280, "height": 720}}, "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "twitter": {"card": "summary_large_image", "description": "The four-time 'Survivor' player told ET that he hopes the episode will be a 'learning lesson.'", "site": {"identifier": "@etnow", "id": 23603092}, "title": "EXCLUSIVE: Ozzy Lusth on Witnessing Jeff Varner Out Zeke Smith on 'Survivor': 'The Reaction Was Shock'", "creator": "Jennifer Drysdale", "url": "https://www.etonline.com/tv/215671_exclusive_ozzy_lusth_on_witnessing_jeff_varner_out_zeke_smith_on_survivor_the_reaction_was_shock", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-04/ozzy_vidpic_042017_1280Copy2.jpg?itok=QJTUjIF9"}, "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}