{"url": "https://web.archive.org/web/20160523154310/http://vulturehound.co.uk/2016/05/all-men-must-die-but-we-are-not-men-game-of-thrones-s06e03/", "text": "‘All men must die, but we are not men’ – Game of Thrones (S06E03)\n\nDespite the whoring and arguably gratuitous nudity in ‘Book of the Stranger’, this week’s episode was refreshingly positive for female characters, and ranks alongside ‘Home’ in quality and story progression.\n\nIt makes sense to begin at the beginning: specifically the long awaited Sansa-John reunion. A sensible decision by the writers to forego yet another ‘missed them by that much’ moment helped spark life into the plot of the North, and saved this particular sub-plot from becoming any more farcical. It was a warm moment – it felt almost inevitable that somebody’s head or genitalia would roll across the screen at some point. Thankfully not.\n\nApparently Jon’s been listening to Elliott Smith songs on repeat since his resurrection and thinking about the human condition, as the hurting hero seemed averse to any further violence, even to save his own family. Enter Sansa. Who knows what should be credited for the maturation of the Stark girl – there are plenty of qualifying tragedies in her arc – but she was on impressive form. Her stern persuasiveness ensured that viewers will eventually get to see ‘Bastardbowl’ – the internet’s preferred nomenclature for any battle between Snow and Bolton. Unfortunately, given her new found confidence, it would be unsurprising to see Sansa finally meet her maker(s) this season. For now, though, her transformation is welcome.\n\nNot to be overshadowed, Brienne shone at Castle Black, too. Melisandre and Ser Davos played no real part in the episode, besides being in receipt of Brienne’s barbs regarding her execution of Stannis. There was overt sexual tension between herself and Tormund, too, in a quasi-fetish dinner scene.\n\nThe next stop for ‘Book of the Stranger’ was somewhere in the proximity of the Vale. Little Finger’s falcon will hopefully peck out the eyes of the endlessly irritating young lord, Robin. Flippancy aside, the decision to ‘help’ Sansa and Jon in their battle versus Ramsay revealed little in terms of motive, other than that Baelish must see success in the future of House Stark.\n\nOn to Meereen, where Tyrion appeared to badly misrepresent his new queen. Making peace with the masters of Slaver’s Bay may have been diplomatic, but is unlikely to endear himself to Danaerys, and received dreadful feedback from Grey Worm and Missandei.\n\nJorah was frankly pathetic in this episode as his greyscale caught up with him, and the unbearably smug Daario played bodyguard for his love rival as a result. Having traveled so far, it nicely summarised the episode that, rather than being slung over their shoulders, Danaerys chose self-determination and relegated the two noble soldiers to doormen.\n\nIn much the same way as Sansa, Margaery was the stronger sibling in King’s Landing. Not to fall prey to the silver tongue of the High Sparrow, she instead attempts to manipulate him, reciting verses from The Seven-Pointed Star. Sent, she believes, to break her brother, she instead encourages him to stay strong. Sadly, these attempts may have been in vain; indeed, it looks to have been the High Sparrow’s intention for her instead to be broken by her brother, sucked in by his weakness.\n\nWith Tommen being manipulated every which way by everybody and their dog in King’s Landing, Lady Tyrell’s decision to introduce her army to the fray was encouraging. With her actions and Cersei’s we saw yet more decisiveness on the part of the show’s female characters.\n\nA short visit to the Iron Islands saw Theon returning to his sister (who he previously unceremoniously pleasured, much to her amusement). After a frosty introduction, where Yara told her brother stop being such a wimp, Theon lent his support to her claim to the throne.\n\nBack across the sea, Ramsay sat in Winterfell, badly peeling an apple. Enter Osha, who tried to seduce and assassinate him, only to find her own neck irrigating the cobbled ground. This was an anti-climax in her arc, as her lengthy disappearance quickly became non-existence. Nevertheless, it was a typically belligerent death for the Wildling, as she displayed her loyalty for one last time. In other news, Ramsay sent a threatening letter to Jon Snow which read like an homage to a cyber bully.\n\nThe resurgence of the Khaleesi which brought about the end of the episode was a relief, in as much as it injected life into her story line (ironically through a lot of death). It has been described as cathartic and climactic, but it did not really deserve such high praise. While the scene itself played well, there had been so little substance in the build-up that it felt sudden, as opposed to a culmination. A few unseemly rape jokes were not enough to develop this story of vengeance. Nonetheless, the event will serve as a catalyst, as Danaerys may well command the biggest army in the Seven Kingdoms. It can only be a matter of time until she travels to Westeros.\n\n4.5/5\n\nDir: Jeremy Bodeswa\n\nScr: David Benioff, George R.R. Martin, D.B. Weiss\n\n\n\nCast: Peter Dinklage, Nikolaj Coster-Waldau, Lena Headey, Emilia Clarke, Kit Harrington, Liam Cunningham, Carice Van Houten, Sophie Turner, Maisie Williams, John Bradley, Hannah Murray, Art Parkinson, Natalia Tena.\n\n\n\nPrd: David Benioff, George R.R. Martin, D.B. Weiss, Duncan Muggoch, Peter Welter-Soler\n\n\n\nMusic: Ramin Jawadi\n\nEpisode Number: 4 of 10\n\nShare this: Twitter\n\nFacebook\n\nGoogle\n\nPinterest\n\nTumblr\n\n", "images": ["https://web.archive.org/web/20160523154310im_/http://vulturehound.co.uk/wp-content/uploads/2016/03/latest-issue.jpg", "https://web.archive.org/web/20160523154310im_/http://i0.wp.com/vulturehound.co.uk/wp-content/uploads/2016/05/GreatWhiteBite_005.jpg?fit=496%2C330", "https://web.archive.org/web/20160523154310im_/http://vulturehound.co.uk/images/vulturehound-logo.jpg", "https://web.archive.org/web/20160523154310im_/http://i0.wp.com/vulturehound.co.uk/wp-content/uploads/2016/05/vulturehound-11.jpg?fit=590%2C320", "https://web.archive.org/web/20160523154310im_/http://vulturehound.co.uk/images/twitter.jpg", "https://web.archive.org/web/20160523154310im_/http://vulturehound.co.uk/images/facebook.jpg", "https://web.archive.org/web/20160523154310im_/http://i0.wp.com/vulturehound.co.uk/wp-content/uploads/2016/05/RAW_09012014mm_1795.jpg?fit=543%2C330", "https://web.archive.org/web/20160523154310im_/http://i1.wp.com/vulturehound.co.uk/wp-content/uploads/2016/05/wheatus.jpg?fit=539%2C330", "https://web.archive.org/web/20160523154310im_/http://i0.wp.com/vulturehound.co.uk/wp-content/uploads/2016/05/dany1_0-e1463433700806.jpg?resize=636%2C356", "https://web.archive.org/web/20160523154310im_/http://i1.wp.com/vulturehound.co.uk/wp-content/uploads/2016/04/The-Trust-645x369.jpg?fit=577%2C330", "https://web.archive.org/web/20160523154310im_/http://vulturehound.co.uk/wp-content/uploads/2016/05/dany1_0-e1463433700806.jpg", "https://web.archive.org/web/20160523154310im_/http://vulturehound.co.uk/images/followus.jpg", "https://web.archive.org/web/20160523154310im_/http://i0.wp.com/vulturehound.co.uk/wp-content/uploads/2016/05/banksy.jpg?fit=542%2C330", "https://web.archive.org/web/20160523154310im_/http://i0.wp.com/vulturehound.co.uk/wp-content/uploads/2016/05/londonprint.jpg?fit=553%2C330", "https://web.archive.org/web/20160523154310im_/http://vulturehound.co.uk/wp-content/uploads/2016/03/vulturehound-ad-download.gif", "https://web.archive.org/web/20160523154310im_/http://2.gravatar.com/avatar/8cf926e8f83d3b6264a0a09966e2684a?s=100&d=http%3A%2F%2Fvulturehound.co.uk%2Fwp-content%2Fuploads%2F2016%2F03%2Fvh-logo.jpg&r=g", "https://web.archive.org/web/20160523154310im_/http://i0.wp.com/vulturehound.co.uk/wp-content/uploads/2016/05/7.jpg?resize=636%2C367", "https://web.archive.org/web/20160523154310im_/http://vulturehound.co.uk/wp-content/uploads/2016/04/vh-sc-android.gif", "https://web.archive.org/web/20160523154310im_/http://i1.wp.com/vulturehound.co.uk/wp-content/uploads/2016/05/little-finger.png?resize=636%2C367", "https://web.archive.org/web/20160523154310im_/http://i2.wp.com/vulturehound.co.uk/wp-content/uploads/2016/05/the-rise-and-rise-of-street-art.jpg?fit=546%2C295"], "top_img": "https://web.archive.org/web/20160523154310im_/http://vulturehound.co.uk/wp-content/uploads/2016/05/dany1_0-e1463433700806.jpg", "keywords": [], "authors": ["James Wann"], "canonical_link": "https://web.archive.org/web/20160523154310/http://vulturehound.co.uk/2016/05/all-men-must-die-but-we-are-not-men-game-of-thrones-s06e03/", "title": "» ‘All men must die, but we are not men’ – Game of Thrones (S06E03) Vulture Hound Magazine", "meta_data": {"google-site-verification": "Q1xoAVX-IlkuBs2hKPVYK3NbuusiNHvaypa-gnA9sQo", "viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no", "generator": "WordPress 4.5.2", "og": {"image": {"identifier": "https://web.archive.org/web/20160523154310im_/http://i0.wp.com/vulturehound.co.uk/wp-content/uploads/2016/05/7.jpg?fit=4928%2C3280", "width": 4928, "height": 3280}, "site_name": "Vulture Hound Magazine", "type": "article", "locale": "en_US", "url": "https://web.archive.org/web/20160523154310/http://vulturehound.co.uk/2016/05/all-men-must-die-but-we-are-not-men-game-of-thrones-s06e03/", "title": "‘All men must die, but we are not men’ – Game of Thrones (S06E03)", "description": "Despite the whoring and arguably gratuitous nudity in 'Book of the Stranger', this week's episode was refreshingly positive for female characters, and ranks alongside 'Home' in quality and story progression. It makes sense to begin at the beginning: specifically the long awaited Sansa-John reunion. A sensible decision by the writers to forego yet another 'missed…"}, "fb": {"app_id": 394720393880366}, "article": {"published_time": "2016-05-16T22:17:36+00:00", "modified_time": "2016-05-16T22:17:36+00:00", "author": "http://vulturehound.co.uk/author/james-wann/", "section": "reviews", "tag": "Sophie Turner"}}, "movies": [], "publish_date": 1463437056.0, "source": "https://web.archive.org", "summary": ""}