{"url": "https://www.indiewire.com/2017/09/marvel-tv-shows-inhumans-gifted-punisher-runaways-netflix-abc-hulu-fox-fx-1201881821/", "text": "A look at the state of the Marvel television, which continues to rapidly expand with both hits and misses.\n\nMarvel has planted its seeds far and wide over the past few years in the television landscape, but that volume has so far yielded mixed results.\n\nWhile rival DC has found success by focusing on familiar franchises like “The Flash,” “Arrow,” “Supergirl,” and the Batman origins tale on “Gotham,” Marvel has been a bit more stingy with its marquee characters. For example, ABC’s “Marvel’s Agents of S.H.I.E.L.D.” lives in the world of the Avengers, yet never became a hit partly because it focused on lesser-known characters.\n\nBut that’s not always a hindrance. Many of Marvel’s Netflix series, especially “Jessica Jones,” have been critically acclaimed partly because they felt like they hadn’t been overly mined previously. It takes a visionary showrunner, in this age of so many superhero tales, to bring a fresher take to the genre and keep interest high.\n\nQuality control and maintaining narrative vigor are the biggest obstacles in this adaptation game, as Marvel’s TV titles have ranged from auteur-driven gems to cartoonish duds. Right now, ABC and Fox have two new Marvel series, “Inhumans” and “The Gifted,” premiering this weekend, while cable and streaming outlets also have new projects on deck.\n\nRelated Rosario Dawson Walks Back Comments About Jon Bernthal's Punisher Return: 'I Can't Be Trusted'\n\nMarvel Announces Auction for 'The Punisher,' 'The Defenders' Props Related Oscars 2023: Best Makeup and Hairstyling Predictions\n\nOscars 2023: Best Actress Predictions\n\nHere’s a look at the current state of Marvel TV, and what’s on the horizon that could change the climate:\n\nABC\n\n”Agents of S.H.I.E.L.D.”: The series had a rough early start, until its connection to the Marvel Cinematic Universe was confirmed — which later even included a crossover from Sif (Jaimie Alexander) of “Thor” fame. But as the series began to hit its stride, “S.H.I.E.L.D.” didn’t need to rely on its cinematic cousins to bolster its storytelling and cred anymore. Season 4 was one of the show’s strongest in storytelling but lowest in ratings, and Variety reported that ABC wanted to end the series — but that Disney demanded more. “S.H.I.E.L.D.” will return for a fifth season, shifting from Tuesdays to Fridays, after “Inhumans” (see below) vacates its slot.\n\nABC\n\n”Inhumans”: As the title indicates, this show is about the descendants of alien beings who look humanoid (but aren’t!) and live on the moon. Despite a big push, including a limited IMAX premiere ahead of its actual debut on Friday (8 p.m. ET, ABC), the series earned low critical marks — perhaps the worst yet of any Marvel show. It’s perhaps no coincidence that “Inhumans” was created by Scott Buck, who was also behind the equally panned “Iron Fist.” In “Inhumans,” Buck came up wiht a show that IndieWire deemed “legitimately the worst Marvel adaptation of the year.” ABC canceled “Agent Carter,” and instead we got this?!\n\nNetflix\n\n”Daredevil”: As the elder statesman of the Netflix bunch, “Daredevil” set the bar high for Marvel on the streaming service, thanks to a stellar first season kickstarted by Drew Goddard and finished by “Spartacus” mastermind Steven S. DeKnight. While its second season, showrun by Marco Ramirez and Douglas Petrie, lost some of the show’s narrative oomph, “Daredevil” still introduced viewers to the intriguing Frank Castle. The blind lawyer-by-day, vigilante-by-night still has meaning for fans, and already has a Season 3 in the works.\n\n”Jessica Jones”: Melissa Rosenberg brought this series to life, a show some would argue is perhaps the strongest Marvel series so far, thanks to its confident voice and storytelling. The show’s intensely feminist story involves Jessica Jones (Krysten Ritter) dealing with trauma from her time with the fiendish and yet charismatic Kilgrave (David Tennant), making for nuanced and compelling viewing. All episodes of Season 2 of will be directed by women.\n\n”Luke Cage”: Cheo Hodari Coker was the showrunner with vision who gave this series its unique flavor, setting the action and heart in Harlem. Lots of action, tons of Easter eggs, a killer soundtrack, and plenty of humor made this a joy to watch, although it did slip in later episodes as storytelling had to stretch in order to fill all 13 episodes. A second season will premiere in 2018.\n\n”Iron Fist”: This is the first of the Netflix Marvel series to really falter and draw significant criticism. Although Asian communities had hoped that the series would race-bend the original story to make the protagonist Asian, Danny Rand remained a white dude who would outdo Asians at their own game — whether it was through martial arts, speaking Mandarin or walking barefoot through the city. Scott Buck ultimately subjected “Iron Fist” to cliched and cartoonish storytelling.\n\n”The Defenders”: The miniseries brought all four previously introduced Netflix Marvel heroes together, but according to Variety, it was Netflix’s least-viewed Marvel series in its debut month. Filled with the heroes and supporting characters from each of their respective shows, the eight-episode series was perhaps a bit too bloated with players. Viewers may have also faced superhero fatigue, as the disappointing “Iron Fist” had debuted only a few months before.\n\n”The Punisher”: After blasting his way into “Daredevil” Season 2, Frank Castle made such an impression that he earned himself his very own spinoff series. “Hannibal” executive producer and writer Steve Lightfoot was named showrunner, which bodes well for the series that should delve deeper into The Punisher’s dark psyche. “The Punisher” will be released sometime in Fall 2017.\n\nFX\n\nFX\n\n”Legion”: Although this isn’t supposed to necessarily be a part of the bigger MCU, it’s worth pointing to as an example of how to do a Marvel series that doesn’t feel like everything else out there. This is owed to Noah Hawley, who was able to do justice to the Coen Bros. with his take on “Fargo.” Translating the trippy interior of a man’s chaotic psyche is ambitious and daunting, but against all odds, it worked. Dan Stevens led a criminally under-recognized cast which embodied plenty of kookiness while not skimping on depth and heart. The critics have been on board, but it’s about time the rest of the world tuned in. “Legion” will return for a second season in 2018.\n\n”Deadpool”: Can Donald Glover do it all? So far, the answer has been “yes.” The “Atlanta” Emmy winner and hip-hop superstar, a.k.a. Childish Gambino, will adapt the foul-mouthed superhero property as an animated project for FXX along with his brother Stephen Glover, who had also nabbed an Emmy nom for writing on “Atlanta.” It’s still too early to get any sort of idea how this will turn out, but judging by Glover’s track record and how well this sensibility fits his brand, there’s reason to be optimistic.\n\nHulu\n\nHulu\n\n”Runaways”: Hot off of winning Emmys for “The Handmaid’s Tale,” Hulu is hoping to take some of that must-see magic to its latest adaptation, based on this complex yet young-skewing Marvel franchise. “Runaways,” about a bunch of teens who discover that their parents are supervillains, comes from “The O.C.’s” Josh Schwartz and Stephanie Savage, who know a thing or two about finding young and compelling ensemble casts. Early buzz is looking pretty good for what promises to be one of the most diverse series in the MCU.\n\nFox\n\n”The Gifted”: Connected to “X-Men,” the Fox series premiering Monday (9 p.m. ET) takes an outsider’s perspective by slowly entering the world where mutants are being hunted down. Stephen Moyer and Amy Acker play parents who discover that their two kids are mutants, and therefore must join the Mutant Underground to evade the government, while Jamie Chung, Emma Dumont, Sean Teale, and Blair Redford are just a few of the stars who will portray the mutants on the run. Early critical reaction for the show, from creator Matt Nix, has been encouraging.\n\nFox\n\nFreeform\n\nCloak and Dagger: Based on the Bill Mantlo and Ed Hannigan comics, the Joe Pokaski-led series will focus on two runaways who gain powers when a criminal chemist tests a drug on them. Gina Prince-Bythewood directs the pilot. It’s still too early to know what to expect, but comics fans are speculating that this may cross over with Hulu’s “Runaways.” “Cloak and Dagger,” expected to air in 2018, has actually been in development since 2011, back when Freeform was still known as ABC Family.\n\n”New Warriors”: ”Cougar Town’s” Kevin Biegel is showrunner on this series, which should stand out from the pack because it’s a superhero comedy. Young people make up this Avengers-style team that consists of Squirrel Girl, Mister Immortal, Night Thrasher, Speedball, Microbe, and Debrii. The series will be released in 2018.\n\nPassed Over/in Development Purgatory\n\n”Most Wanted”: This “S.H.I.E.L.D.” spinoff featuring Morse and Hunter was passed over twice by ABC.\n\n”Damage Control”: This comedy about an overworked, underpaid clean-up crew who deals with the aftermath of superhero conflicts was supposed to come out sometime during the 2016-2017 season, but never did.\n\n”Untitled John Ridley Project”: ”American Crime’s” John Ridley had been developing a super-secret Marvel project, but at the Television Critics Association press tour, ABC president Channing Dungey couldn’t confirm where he was in the process.\n\n“Untitled Hellfire Club”: Before Fox had settled on “The Gifted,” a project based on the “Hellfire Club” had been in development but did not move forward.\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://www.indiewire.com/wp-content/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://www.indiewire.com/wp-content/uploads/2017/09/runaways_alex.jpg?w=117&h=82&crop=1", "https://www.indiewire.com/wp-content/uploads/2017/09/runaways_gert.jpg?w=117&h=82&crop=1", "http://www.indiewire.com/wp-content/uploads/2017/05/tg-s1_pilot-sc39-rg_0072-v4_hires1.jpg?w=780", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "https://secure.gravatar.com/avatar/61a5ad83f96889954ddd44d216e1a879?s=96&d=mm&r=g", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "http://www.indiewire.com/wp-content/uploads/2017/09/runaways_pride1.jpg?w=780", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "http://www.indiewire.com/wp-content/uploads/2017/09/147065_062717-061.jpg?w=780", "https://www.indiewire.com/wp-content/uploads/2017/09/marvel-shows-1.jpg?w=780", "http://www.indiewire.com/wp-content/uploads/2017/02/legion-kiss-kiss-boom.gif?w=640", "http://www.indiewire.com/wp-content/uploads/2017/08/002_gt_103_unit_05488r4.jpg?w=780", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.indiewire.com/wp-content/uploads/2017/09/marvel-shows-1.jpg?w=780", "keywords": [], "authors": ["Hanh Nguyen"], "canonical_link": "https://www.indiewire.com/2017/09/marvel-tv-shows-inhumans-gifted-punisher-runaways-netflix-abc-hulu-fox-fx-1201881821/", "title": "Marvel’s Plan for TV Domination: Which Shows Pack a Punch, Take a Leap, or Fall Flat on Their Faces", "meta_data": {"msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "A look at the state of the Marvel television, which continues to rapidly expand with both hits and misses.", "news_keywords": "Marvel's Inhumans, Marvel's Runaways, The Gifted, The Punisher", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 6.0.2", "author": "Hanh Nguyen", "theme-color": "#ffffff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "IndieWire", "application-name": "IndieWire", "content_type": "Article", "post_id": 1201881821, "title": "Marvel's Plan for TV Domination: Which Shows Pack a Punch, Take a Leap, or Fall Flat on Their Faces", "published_at": "2017-09-29 09:00:27", "image": "https://www.indiewire.com/wp-content/uploads/2017/09/marvel-shows-1.jpg?w=300", "comment_count": 2, "tags": "The Punisher", "topics": "Television", "body": "Marvel has planted its seeds far and wide over the past few years in the television landscape, but that volume has so far yielded mixed results.\r\n\r\nWhile rival DC has found success by focusing on familiar franchises like \"The Flash,\" \"Arrow,\" \"Supergirl,\" and the Batman origins tale on \"Gotham,\" Marvel has been a bit more stingy with its marquee characters. For example, ABC's \"Marvel's Agents of S.H.I.E.L.D.\" lives in the world of the Avengers, yet never became a hit partly because it focused on lesser-known characters.\r\n\r\nBut that's not always a hindrance. Many of Marvel's Netflix series, especially \"Jessica Jones,\" have been critically acclaimed partly because they felt like they hadn't been overly mined previously. It takes a visionary showrunner, in this age of so many superhero tales, to bring a fresher take to the genre and keep interest high.\r\n\r\nQuality control and maintaining narrative vigor are the biggest obstacles in this adaptation game, as Marvel’s TV titles have ranged from auteur-driven gems to cartoonish duds. Right now, ABC and Fox have two new Marvel series, “Inhumans” and “The Gifted,” premiering this weekend, while cable and streaming outlets also have new projects on deck.\r\n\r\n\r\n\r\nHere’s a look at the current state of Marvel TV, and what’s on the horizon that could change the climate:\r\nABC\r\n”Agents of S.H.I.E.L.D.”: The series had a rough early start, until its connection to the Marvel Cinematic Universe was confirmed — which later even included a crossover from Sif (Jaimie Alexander) of “Thor” fame. But as the series began to hit its stride, \"S.H.I.E.L.D.\" didn’t need to rely on its cinematic cousins to bolster its storytelling and cred anymore. Season 4 was one of the show's strongest in storytelling but lowest in ratings, and Variety reported that ABC wanted to end the series — but that Disney demanded more. “S.H.I.E.L.D.” will return for a fifth season, shifting from Tuesdays to Fridays, after “Inhumans” (see below) vacates its slot.\r\n\r\n\r\n\r\n”Inhumans”: As the title indicates, this show is about the descendants of alien beings who look humanoid (but aren’t!) and live on the moon. Despite a big push, including a limited IMAX premiere ahead of its actual debut on Friday (8 p.m. ET, ABC), the series earned low critical marks — perhaps the worst yet of any Marvel show. It's perhaps no coincidence that \"Inhumans\" was created by Scott Buck, who was also behind the equally panned “Iron Fist.” In \"Inhumans,\" Buck came up wiht a show that IndieWire deemed “legitimately the worst Marvel adaptation of the year.” ABC canceled “Agent Carter,” and instead we got this?!\r\nNetflix\r\n”Daredevil”: As the elder statesman of the Netflix bunch, “Daredevil” set the bar high for Marvel on the streaming service, thanks to a stellar first season kickstarted by Drew Goddard and finished by “Spartacus” mastermind Steven S. DeKnight. While its second season, showrun by Marco Ramirez and Douglas Petrie, lost some of the show's narrative oomph, \"Daredevil\" still introduced viewers to the intriguing Frank Castle. The blind lawyer-by-day, vigilante-by-night still has meaning for fans, and already has a Season 3 in the works.\r\n\r\n\r\n\r\n”Jessica Jones”: Melissa Rosenberg brought this series to life, a show some would argue is perhaps the strongest Marvel series so far, thanks to its confident voice and storytelling. The show's intensely feminist story involves Jessica Jones (Krysten Ritter) dealing with trauma from her time with the fiendish and yet charismatic Kilgrave (David Tennant), making for nuanced and compelling viewing. All episodes of Season 2 of will be directed by women.\r\n\r\n”Luke Cage”: Cheo Hodari Coker was the showrunner with vision who gave this series its unique flavor, setting the action and heart in Harlem. Lots of action, tons of Easter eggs, a killer soundtrack, and plenty of humor made this a joy to watch, although it did slip in later episodes as storytelling had to stretch in order to fill all 13 episodes. A second season will premiere in 2018.\r\n\r\n\r\n\r\n”Iron Fist”: This is the first of the Netflix Marvel series to really falter and draw significant criticism. Although Asian communities had hoped that the series would race-bend the original story to make the protagonist Asian, Danny Rand remained a white dude who would outdo Asians at their own game — whether it was through martial arts, speaking Mandarin or walking barefoot through the city. Scott Buck ultimately subjected \"Iron Fist\" to cliched and cartoonish storytelling.\r\n\r\n”The Defenders”: The miniseries brought all four previously introduced Netflix Marvel heroes together, but according to Variety, it was Netflix’s least-viewed Marvel series in its debut month. Filled with the heroes and supporting characters from each of their respective shows, the eight-episode series was perhaps a bit too bloated with players. Viewers may have also faced superhero fatigue, as the disappointing \"Iron Fist\" had debuted only a few months before.\r\n\r\n\r\n\r\n”The Punisher”: After blasting his way into “Daredevil” Season 2, Frank Castle made such an impression that he earned himself his very own spinoff series. “Hannibal” executive producer and writer Steve Lightfoot was named showrunner, which bodes well for the series that should delve deeper into The Punisher’s dark psyche. \"The Punisher\" will be released sometime in Fall 2017.\r\nFX\r\n\r\n\r\n”Legion”: Although this isn’t supposed to necessarily be a part of the bigger MCU, it’s worth pointing to as an example of how to do a Marvel series that doesn’t feel like everything else out there. This is owed to Noah Hawley, who was able to do justice to the Coen Bros. with his take on “Fargo.” Translating the trippy interior of a man’s chaotic psyche is ambitious and daunting, but against all odds, it worked. Dan Stevens led a criminally under-recognized cast which embodied plenty of kookiness while not skimping on depth and heart. The critics have been on board, but it’s about time the rest of the world tuned in. “Legion” will return for a second season in 2018.\r\n\r\n\r\n\r\n”Deadpool”: Can Donald Glover do it all? So far, the answer has been “yes.” The “Atlanta” Emmy winner and hip-hop superstar, a.k.a. Childish Gambino, will adapt the foul-mouthed superhero property as an animated project for FXX along with his brother Stephen Glover, who had also nabbed an Emmy nom for writing on “Atlanta.” It’s still too early to get any sort of idea how this will turn out, but judging by Glover's track record and how well this sensibility fits his brand, there's reason to be optimistic.\r\nHulu\r\n\r\n\r\n”Runaways”: Hot off of winning Emmys for “The Handmaid’s Tale,” Hulu is hoping to take some of that must-see magic to its latest adaptation, based on this complex yet young-skewing Marvel franchise. \"Runaways,\" about a bunch of teens who discover that their parents are supervillains, comes from “The O.C.’s” Josh Schwartz and Stephanie Savage, who know a thing or two about finding young and compelling ensemble casts. Early buzz is looking pretty good for what promises to be one of the most diverse series in the MCU.\r\nFox\r\n”The Gifted”: Connected to “X-Men,” the Fox series premiering Monday (9 p.m. ET) takes an outsider’s perspective by slowly entering the world where mutants are being hunted down. Stephen Moyer and Amy Acker play parents who discover that their two kids are mutants, and therefore must join the Mutant Underground to evade the government, while Jamie Chung, Emma Dumont, Sean Teale, and Blair Redford are just a few of the stars who will portray the mutants on the run. Early critical reaction for the show, from creator Matt Nix, has been encouraging.\r\n\r\n\r\nFreeform\r\nCloak and Dagger: Based on the Bill Mantlo and Ed Hannigan comics, the Joe Pokaski-led series will focus on two runaways who gain powers when a criminal chemist tests a drug on them. Gina Prince-Bythewood directs the pilot. It’s still too early to know what to expect, but comics fans are speculating that this may cross over with Hulu’s “Runaways.” \"Cloak and Dagger,\" expected to air in 2018, has actually been in development since 2011, back when Freeform was still known as ABC Family.\r\n\r\n\r\n\r\n”New Warriors”: ”Cougar Town’s” Kevin Biegel is showrunner on this series, which should stand out from the pack because it’s a superhero comedy. Young people make up this Avengers-style team that consists of Squirrel Girl, Mister Immortal, Night Thrasher, Speedball, Microbe, and Debrii. The series will be released in 2018.\r\nPassed Over/in Development Purgatory\r\n”Most Wanted”: This “S.H.I.E.L.D.” spinoff featuring Morse and Hunter was passed over twice by ABC.\r\n”Damage Control”: This comedy about an overworked, underpaid clean-up crew who deals with the aftermath of superhero conflicts was supposed to come out sometime during the 2016-2017 season, but never did.\r\n”Untitled John Ridley Project”: ”American Crime’s” John Ridley had been developing a super-secret Marvel project, but at the Television Critics Association press tour, ABC president Channing Dungey couldn't confirm where he was in the process.\r\n“Untitled Hellfire Club”: Before Fox had settled on “The Gifted,” a project based on the “Hellfire Club” had been in development but did not move forward.", "fb": {"pages": 9800035481}, "fragment": "!", "og": {"type": "article", "title": "Marvel’s Plan for TV Domination: Which Shows Pack a Punch, Take a Leap, or Fall Flat on Their Faces", "url": "https://www.indiewire.com/2017/09/marvel-tv-shows-inhumans-gifted-punisher-runaways-netflix-abc-hulu-fox-fx-1201881821/", "description": "A look at the state of the Marvel television, which continues to rapidly expand with both hits and misses.", "site_name": "IndieWire", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2017/09/marvel-shows-1.jpg?w=780", "width": 780, "height": 482, "alt": "\"Runaways,\" \"Inhumans,\" \"The Gifted\""}, "locale": "en_US"}, "article": {"published_time": "2017-09-29T13:00:27+00:00", "modified_time": "2017-09-29T09:55:40+00:00"}, "twitter": {"site": "@indiewire", "card": "summary_large_image", "title": "Marvel’s Plan for TV Domination: Which Shows Pack a Punch, Take a Leap, or Fall Flat on Their Faces", "description": "A look at the state of the Marvel television, which continues to rapidly expand with both hits and misses.", "image": "https://www.indiewire.com/wp-content/uploads/2017/09/marvel-shows-1.jpg?w=780"}, "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": [], "publish_date": 1506690027.0, "source": "https://www.indiewire.com", "summary": ""}