{"url": "https://www.bustle.com/p/kate-bosworths-drugstore-hormonal-acne-solution-cleared-up-her-skin-its-actually-affordable-8601938", "text": "There is one thing that you cannot escape no matter how famous you are — acne. But, just like you, celebs looking to soothe their skin it on a budget. As E! News found, Kate Bosworth uses primrose oil to curb her hormonal acne. The ingredient is all nature, affordable, and available on Amazon Prime. Basically, if you're going to try only one celeb-fix, let this little one-a-day pill be it.\n\nThere have been some intense acne solutions from the stars. Kim Kardashian swears by that intense vampire facial and Karlie Kloss even dunks her head in ice water, but Bosworth's is a whole lot easier. According to the star's Instagram, primrose oil minimizes blemishes and helps with oily skin.\n\n\"For me, this is an incredible lifesaver when it comes to minimizing blemishes and breakouts, particularly during hormonal times,\" Kate said in an Instagram stories video, according to E! News.\n\nThe best part of it all is that primrose oil is super affordable. According to the product description on Amazing, it's a one-a-day pill that contains \"important omega-6 fatty acid Gamma-Linolenic Acid.\" Oh, and it will only set you back $12 on Amazon Prime. Get your wallets ready, because this isn one skin solution that you can't afford not to try out.\n\nAlberto E. Rodriguez/Getty Images Entertainment/Getty Images\n\nHormonal acne is stubborn. It's more than just oil build-up. It's an imbalance of hormones that the body is trying to balance out, according to Ann Marie Gianni, an organic skincare brand.\n\n\"Our body balances our hormones delicately to keep everything flowing smoothly, the brand writes on its website. \"When the hormone balance is offset, the body has to work around it and make due with what it has.\"\n\nThat's where primrose oil comes in. According to Glamour's interview with dermatologist Elizabeth K. Hale, M.D., the all-natural oil is great to add into your skincare routine if you're looking to ease hormonal acne. Although she does also note that it's not the only thing that you'll need.\n\n\"I love evening primrose oil. It's a plant extract that comes from the seeds of a wildflower. It's not only emollient (hydrating) but a powerful anti-irritant, which means it will have a significant anti-inflammatory effect on the skin.\"\n\nHale also notes that it's good to check with your doctor before using the product, since the fatty acids in primrose oil can affect certain medications negatively.\n\nThe benefits of primrose oil go way beyond acne too. Although it is known to clear up acne, it's also been linked to easing eczema, improve overall skin health, and help relieve PMS symptoms, according to Healthline. With all of the benefits and the affordable price tag, you might as well give it a try.\n\nIf you're not an Amazon Prime member, there are plenty of other places to pick up the all-natural fix. You can buy it in pill form from GNC for $13.99 or from The Ordinary in oil form for $10.\n\nIt's nothing new to celebrities, either. According to Grazia, Miranda Kerr is also a fan of the ingredient. \"I like to wear rosehip oil at night,\" Kerr said according to the publication. \"It's full of that many antioxidants and it really workd on a cellular level to rejuvinate the skin - I put it on at night and I wake up glowing.\"\n\nChristopher Polk/Getty Images Entertainment/Getty Images\n\nNo matter how you want to add it into your skincare routine, it's pretty darn affordable. You almost can't afford to not try this product. Just remember to check in with your doctor before you start taking it in pill form.\n\nThere are plenty of fads out there, but this is one all-natural ingredient that will never go out of style — especially with all of its benefits.", "images": ["https://imgix.bustle.com/uploads/shutterstock/2022/9/30/1d81b508-9c09-4060-85ee-d27d812a8568-shutterstock-1675856272.jpg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.4373&fp-y=0.5453", "https://imgix.bustle.com/uploads/getty/2018/3/26/1a5419d5-7047-4038-9ca6-4f9091235921-getty-883397080.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2018/3/26/b6021f8b-39b7-422f-be4e-6861e2ef0cea-getty-883395420.jpg?w=414&h=621&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/4/4609f004-05d0-4487-84e6-71a8ed37bb42-headertemplate_split-1-2001.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2018/3/26/1a5419d5-7047-4038-9ca6-4f9091235921-getty-883397080.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2022/9/23/35478af6-dbc2-4197-b2a4-45cc1a8df8b5-5_so_glassy_flat_691.jpg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.484&fp-y=0.508", "https://imgix.bustle.com/uploads/image/2018/3/26/ffb6d21f-8fc0-4da3-9145-c70d9506cbe0-91jsg98ni6l_sy679_.jpg?w=330&h=590&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/9/30/ec4d60f1-f9ba-44c3-bdd5-7fc58f2a9a4e-jackiexdeepica__campaign-image_final8.jpg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.4987&fp-y=0.3022", "https://imgix.bustle.com/uploads/getty/2018/3/26/7dfb9aab-cf52-4deb-938e-b9a4eab46b62-getty-937937778.jpg?w=414&h=514&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/3/26/1a5419d5-7047-4038-9ca6-4f9091235921-getty-883397080.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/kate-bosworths-drugstore-hormonal-acne-solution-cleared-up-her-skin-its-actually-affordable-8601938", "title": "Kate Bosworth's Drugstore Hormonal Acne Solution Cleared Up Her Skin & It's Actually Affordable", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@KMBorovic"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/kate-bosworths-drugstore-hormonal-acne-solution-cleared-up-her-skin-its-actually-affordable-8601938", "type": "article", "title": "Kate Bosworth's Drugstore Hormonal Acne Solution Cleared Up Her Skin & It's Actually Affordable", "description": "There is one thing that you cannot escape no matter how famous you are — acne. But, just like you, celebs looking to soothe their skin it on a budget. As E! News found, Kate Bosworth uses primrose oil to curb her hormonal acne. The ingredient is all…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/3/26/1a5419d5-7047-4038-9ca6-4f9091235921-getty-883397080.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "There is one thing that you cannot escape no matter how famous you are — acne. But, just like you, celebs looking to soothe their skin it on a budget. As E! News found, Kate Bosworth uses primrose oil to curb her hormonal acne. The ingredient is all…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}