{"url": "https://www.bustle.com/p/lauren-conrad-isnt-worried-about-giving-birth-because-she-recognizes-just-how-strong-women-are-62992", "text": "It's totally understandable why a pregnant woman may be concerned about giving birth, especially if they are a soon-to-be first-time mom. The fact that you will soon deliver a human being has to be extremely nerve-racking, not to mention stressful. However, there are some women who are totally chill about it. For example, Lauren Conrad isn't worried about giving birth to her first child, a son, who she is expecting with her husband, William Tell.\n\nAs the July cover star for Fit Pregnancy and Baby, the former star of The Hills opened up about her birth plan when she goes into labor. \"Last night I ordered a book on putting together a birth plan,\" she said. \"My main concern is doing whatever’s right in the moment. My friends have said, 'Have a plan, but don’t be so committed that you’re unwilling to change if you need to.'\"\n\nEven though she is planning and thinking ahead about the day she goes into labor, the 31-year-old has the most carefree attitude when it comes to giving birth. Actually, it's quite refreshing and might even inspire other women who may be frightened about labor (and the pain) to stay positive. Per Conrad, \"I’m not worried about the pain that comes with giving birth. Maybe I’m just naive, but it’s pretty low on my list of concerns. I feel like women have been doing this forever.\"\n\nThat response says a lot — and not only about the fashion designer. Her outlook seems to be her way of saying, \"If women give birth every day, well, so can I.\" It also goes to show you that Conrad recognizes women's strength. Women are powerful and amazing individuals who deliver children on a daily basis. If you really think about the entire process of pregnancy, labor, and delivery, it is beyond amazing — and so are the women who do it.\n\nI, myself, don't have children nor have I ever been pregnant, but I imagine that Conrad's words will resonate with other women are going through a similar journey. The fact that Conrad knows she and other pregnant women are forces to be reckoned with is empowering.\n\nI don't know about you, but I've never heard someone discuss giving birth quite like Conrad. Women often express how nervous they are about labor, which makes absolute sense. There is a lot to think about when it comes to it. So to hear how the Kohl's designer feels makes me (someone who doesn't plan on having a baby anytime soon, but hopes to one day) look at labor completely differently — and in a less scary way.\n\nI'd like to thank Conrad for reminding me and other women that being conscious of your strength as a woman is something we should do all the time and not just during pregnancy.", "images": ["https://imgix.bustle.com/uploads/image/2022/9/22/81e6c4e0-7376-49ff-adfc-062b89350099-meganrapinoe_header.jpg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5013&fp-y=0.4231", "https://imgix.bustle.com/uploads/image/2022/9/30/d7b2162b-52fe-4d22-b787-dc312fe4dceb-28-melaniec-teaser.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/2017/6/7/517943642.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2022/9/26/77baec7d-57f2-45b4-8a57-fde3830eef81-getty-1422358476.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/2017/6/7/517943642.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2022/10/5/61021776-06ce-42f6-a04a-826bbfff5acf-kardashians_air202_prod201_screengrab_09rt.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/2017/6/7/517943642.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/lauren-conrad-isnt-worried-about-giving-birth-because-she-recognizes-just-how-strong-women-are-62992", "title": "Lauren Conrad Isn't Worried About Giving Birth, Because She Recognizes Just How Strong Women Are", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@AllysonKoerner"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/lauren-conrad-isnt-worried-about-giving-birth-because-she-recognizes-just-how-strong-women-are-62992", "type": "article", "title": "Lauren Conrad Isn't Worried About Giving Birth, Because She Recognizes Just How Strong Women Are", "description": "It's totally understandable why a pregnant woman may be concerned about giving birth, especially if they are a soon-to-be first-time mom. The fact that you will soon deliver a human being has to be extremely nerve-racking, not to mention stressful.…", "image": {"identifier": "https://imgix.bustle.com/2017/6/7/517943642.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "It's totally understandable why a pregnant woman may be concerned about giving birth, especially if they are a soon-to-be first-time mom. The fact that you will soon deliver a human being has to be extremely nerve-racking, not to mention stressful.…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}