{"url": "https://www.theguardian.com/us-news/2016/oct/18/hillary-clinton-why-hate-unlikeable-us-election", "text": "There is – and perhaps there always will be – a dedicated group of people who don’t know Hillary Clinton personally, but nonetheless hate her.\n\nWhether they are truly a “vast rightwing conspiracy” (as Clinton called them in 1998) or just many in number and conservative in outlook, there’s no arguing that they exist or that they continue to try to influence public opinion on the Democratic nominee.\n\n\n\nBut even if people consider themselves savvy enough to reject the strangest conspiracy theories (sample claims include that she is a mass-murderer, a closeted lesbian faking her 40-year marriage, a member of the Illuminati and/or an agent of the devil himself), there seems little doubt that an undercurrent of hostility spanning decades has had an impact upon how she is viewed.\n\nClinton’s unfavorability rating may not be as low as Donald Trump’s, but in an election year which has frequently degenerated into name-calling, she has attracted invective from both the left and the right. Polls have frequently cited the public view that she is not trusted, while Trump has rallied his supporters with the “Crooked Hillary” epithet.\n\nHer links to Wall Street, her missing emails and her supposed responsibility for the security failures that contributed to the attack on the Benghazi consulate are the ostensible reasons for some deeply personal attacks in 2016. But the roots of hostility towards her go much deeper.\n\nCraig Shirley, a Ronald Reagan biographer and historian who spent decades as a conservative political consultant, said that, when Hillary Clinton arrived in Washington DC as first lady, “she came from Little Rock with a reputation already established” as “such a militant feminist, difficult to deal with”.\n\nHe noted that she faced hostility in Arkansas politics and media when Bill Clinton was first elected governor, because she kept her maiden name.“Here she comes, the feminist from Wellesley and Yale,” Shirley explained of the supposedly prevailing attitude of the time, “down to Little Rock and brings her attitudes with her”.\n\nThere’s something about her manner, persona, voice, smirk that just grates on a lot of people Craig Shirley, conservative political consultant\n\nSo by the time she arrived on the national stage in 1991, during Bill Clinton’s presidential campaign, the then-still-mostly-male press corps already had an idea of who they understood Hillary Clinton to be – a potential liability to her husband’s political career whose feminism and ambition were a bit unseemly.\n\n\n\nAnd, as she noted in her first autobiography, she gave them plenty of material with which to support that narrative. First, there was her much-maligned “I’m not sitting here some little woman standing by my man like Tammy Wynette” comment in response to a reporter’s assertion that she and her husband had “some sort of understanding and arrangement” about his infidelity.\n\nThen, her out-of-context “I suppose I could have stayed home and baked cookies” comment, which came in response to attacks, which the Clintons denied, by now-California governor Jerry Brown that she had only been a successful lawyer because her husband had steered business to her firm, implying that she should have confined herself to being a ceremonial first lady.\n\nAnd then, of course, came the scandals in which she was involved: Whitewater, a money-losing land deal in which she’d invested for their retirement with two friends who managed the investment illegally; and Travelgate, in which she – contrary to the then-normal practice of leaving the business of the White House to the president’s staff – was said to have ordered the firing of the head of the travel office, who coincidentally was popular with the mostly-male White House press corps whose travel he arranged.\n\nPresident Bill Clinton takes his oath of office, accompanied by Hillary Rodham Clinton, in 1993. Photograph: Everett/Rex/Shutterstock\n\nThe key question raised about Whitewater and Travelgate was not whether Clinton had done anything actually wrong, but whether she had used illegal means to try to keep the media from finding out. The Starr investigation, which eventually resulted in Bill Clinton’s impeachment, found that she had not, but by that time her reputation was established as someone unfriendly to the media who also maybe did not do the right thing.\n\nThis business of people ‘not liking’ her is shaped ... by what we think people in authority ought to look like Elaine Kamarck, Brookings Institution fellow\n\nShirley conceded that “the press pounded on her” first in Arkansas and then in Washington, but did not believe that affected her relationship with the media, or that it was a driving factor in people’s attitudes towards her. “There’s something about her manner, persona, voice, smirk that just grates on a lot of people,” he said. “People don’t like to be talked down to, and she has a terrible habit of talking down to people, with that smirk.”\n\nHowever, Elaine Kamarck, a senior fellow at the Brookings Institution who served in Bill Clinton’s administration, said she did not think that people’s dislike of Hillary Clinton is her own fault. “This business of people ‘not liking’ her is shaped by expectations, by television, by what we think people in authority ought to look like, and not who she actually is,” she said.\n\n\n\n“She is absolutely as likable, or more likable, than many male politicians,” she said. But while it is rare that people will compare a male politician they do not like to their fathers Kamarck noted that Clinton “reminds people of their mothers, or the schoolteacher they didn’t like.” (References to a “nagging wife” and “bitchy wife” are also common.)\n\n“I think there’s some misogyny in that,” said Kamarck, noting that it’s exceedingly common for men who don’t hew to conventional standards of attractiveness to be on television or pursue political careers, while women are more likely to be granted that visibility when they are younger and if they meet traditional beauty standards.\n\n“We will overcome this but, right now, the world is accustomed to saying old men are fine, they’re strong, they’re wise,” she added. “Old women, we’re not so sure.”", "images": ["https://i.guim.co.uk/img/media/76db89a96aa5d27b9601044fb4d99ceab3365a35/154_409_4319_2591/master/4319.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTYucG5n&enable=upscale&s=fad4827ad02827d94e7c83887811dfea", "https://i.guim.co.uk/img/media/76db89a96aa5d27b9601044fb4d99ceab3365a35/154_409_4319_2591/master/4319.jpg?width=465&quality=85&dpr=1&s=none", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Hillary+Clinton%2CUS+elections+2016%2CUS+news%2CUS+politics%2CBill+Clinton", "https://i.guim.co.uk/img/media/1730dcf51637b7ecd2cb110469e0b4b3e5eee999/0_79_2544_1528/master/2544.jpg?width=445&quality=85&dpr=1&s=none"], "top_img": "https://i.guim.co.uk/img/media/76db89a96aa5d27b9601044fb4d99ceab3365a35/154_409_4319_2591/master/4319.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTYucG5n&enable=upscale&s=fad4827ad02827d94e7c83887811dfea", "keywords": [], "authors": ["Megan Carpentier"], "canonical_link": "https://www.theguardian.com/us-news/2016/oct/18/hillary-clinton-why-hate-unlikeable-us-election", "title": "Why do people dislike Hillary Clinton? The story goes far back", "meta_data": {"description": "A sense of untrustworthiness has haunted the Democrat this election, but the roots of hostility against her are much deeper", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#052962", "og": {"url": "http://www.theguardian.com/us-news/2016/oct/18/hillary-clinton-why-hate-unlikeable-us-election", "image": {"identifier": "https://i.guim.co.uk/img/media/76db89a96aa5d27b9601044fb4d99ceab3365a35/154_409_4319_2591/master/4319.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTYucG5n&enable=upscale&s=fad4827ad02827d94e7c83887811dfea", "height": 720}, "title": "Why do people dislike Hillary Clinton? The story goes far back", "description": "A sense of untrustworthiness has haunted the Democrat this election, but the roots of hostility against her are much deeper", "type": "article", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/megan-carpentier", "publisher": "https://www.facebook.com/theguardian", "modified_time": "2017-07-14T18:31:06.000Z", "section": "US news", "published_time": "2016-10-18T12:05:18.000Z", "tag": "Hillary Clinton,US elections 2016,US news,US politics,Bill Clinton"}, "al": {"ios": {"url": "gnmguardian://us-news/2016/oct/18/hillary-clinton-why-hate-unlikeable-us-election?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287}, "twitter": {"dnt": "on", "app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"googleplay": "guardian://www.theguardian.com/us-news/2016/oct/18/hillary-clinton-why-hate-unlikeable-us-election", "iphone": "gnmguardian://us-news/2016/oct/18/hillary-clinton-why-hate-unlikeable-us-election?contenttype=Article&source=twitter", "ipad": "gnmguardian://us-news/2016/oct/18/hillary-clinton-why-hate-unlikeable-us-election?contenttype=Article&source=twitter"}}, "card": "summary_large_image", "creator": "@megancarpentier", "image": "https://i.guim.co.uk/img/media/76db89a96aa5d27b9601044fb4d99ceab3365a35/154_409_4319_2591/master/4319.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTYucG5n&s=17f48be0749038b01a1db860cf8f9180", "site": "@guardian"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1476745200.0, "source": "https://www.theguardian.com", "summary": ""}