{"url": "https://www.independent.co.uk/arts-entertainment/films/news/hereditary-trailer-peter-rabbit-screening-children-traumatised-australia-horror-film-a8324896.html", "text": "Get our free weekly email for all the latest cinematic news from our film critic Clarisse Loughrey Get our The Life Cinematic email for free Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nThe Life Cinematic email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nAustralian cinemagoers who had taken their children to watch Peter Rabbit were left ashen faced after the projectionist mistakenly showed the trailer for terrifying new horror film Hereditary.\n\nThe Sydney Morning Herald reported that Event Cinemas in the Perth sububurb of Innaloo accidentally showed a preview of the film – billed as “the scariest horror in years” – which struck panic in both children and parents gathered in the audience.\n\nNoticing the furore, cinema staff eventually turned off the trailer and apologised to customers by offering them complimentary tickets.\n\n“It was dreadful,” one audience member recounted. “Very quickly you could tell this was not a kid’s film. Parents were yelling at the projectionist to stop, covering their kids’ eyes and ears. A few went out to get a staff member but she was overwhelmed and didn’t really know what to do. Some parents fled the cinema with their kids in tow.”\n\nEvent Cinemas is currently investigating how the error was made.\n\n27 horror films that will actually terrify you Show all 27 1 /27 27 horror films that will actually terrify you 27 horror films that will actually terrify you The Orphanage (2007) Directed by J.A. Bayona J.A. Bayona Both my selections on this list mark the two instances in which I've actively cried in a cinema out of fear, if you can believe that's possible. Though J.A. Bayona's ghostly tale is a beautiful throwback to Gothic conventions, which lace its hauntings with powerful emotions and warnings, that kid with the sack on its head traumatised me for life. Worse, I came back home and remembered the flat I'd newly moved in to had a cupboard with no key, and no clue as to what may be contained inside; considering what's eventually found to be hiding in the basement of The Orphanage - yeah, I didn't sleep that night - Clarisse Loughrey 27 horror films that will actually terrify you Invasion of the Body Snatchers (1956) Directed by Don Siegel Don Siegel Another film that doesn't rely upon (or need) special effects to make you a bit scared to turn the telly off when you've finished watching it. So disturbing in fact that the studio insisted the ending was changed to make it less dark before it was released. The 1978 remake is very good too - Jon Di Paolo 27 horror films that will actually terrify you House of Usher (1960) Directed by Roger Corman Roger Corman I'm a huge fan of Roger Corman's House of Usher (1960), the first in a series of Edgar Allan Poe adaptations the schlock producer made with the gloriously hammy Vincent Price. The latter stars as Roderick Usher, a sickly aristocrat living in queasy isolation with his sister in the crumbling mansion of the title. Corman's Poe films became increasingly formulaic and campy but this one really delivers - Joe Sommerlad 27 horror films that will actually terrify you The Exorcist (1973) Directed by William Friedkin William Friedkin There have been countless movies about demonic possession but none of them have managed to be quite as memorable as William Friedkin's The Exorcist. This film has received as much critical acclaim as it has attention from terrified audiences decade after decade. Every sequence will offset your internal rhythm while scenes of a disfigured little girl (Linda Blair's Regan) crawling on the ceiling will haunt you for many nights to come - Zlata Rodionova 27 horror films that will actually terrify you The Texas Chainsaw Massacre (1974) Directed by Tobe Hooper Tobe Hooper I am living proof that Tobe Hooper's seminal horror should not be watched at the age of 11; between the horrifying dinner table scene - where the cries of Marilyn Burns' Sally are laughed at by her cannibalistic captors - and that final shot of Leatherface (Gunnar Hansen) flailing his chainsaw about aimlessly in the air, The Texas Chainsaw Massacre is the horror film I would least like to watch again - Jacob Stolworthy 27 horror films that will actually terrify you The Shining (1980) Directed by Stalney Kubrick Stalney Kubrick This Stanley Kubrick classic doesn't necessarily fit into the horror box but for audiences chasing a real sense of unease, The Shining fits the bill. Based on Stephen King's novel of the same name, the film tells the story of the Torrance family who hole up in an isolated hotel for the closed winter season. Things take a macabre turn as an evil presence begins to influence father Jack (Jack Nicholson) to undertake a murderous rampage. In typical Kubrick style, nothing is as it seems - Megan Townsend 27 horror films that will actually terrify you The Watcher in the Woods (1980) Directed by John Hough John Hough I really enjoy watching horror films even though they never scare me; that's not including The Watcher in the Woods, of course. Yes - Disney film The Watcher in the Woods. There's just something inherently unsettling about the film's frequent use of mirrors that freaked me out and the way writing and apparitions suddenly appear in them. Who knew a Disney film could give you nightmares for weeks? - Richard Williams 27 horror films that will actually terrify you Brazil (1985) Directed by Terry Gilliam Terry Gilliam Every Halloween I consider wearing one of the hideous baby face masks from Brazil and every year I chicken out for fear of my reflection. A sinister Michael Palin is also extremely disorientating. But nothing beats the sinking dread of a tyrannical, behemoth bureaucracy swallowing you whole and turning your dreams into nightmares. Having said that, Brazil is also my favourite film - Joe Vesey-Byrne 27 horror films that will actually terrify you Candyman (1992) Directed by Bernard Rose Bernard Rose I was waaay too young when I first saw Bernard Rose’s Candyman and it still scares me to this day. It’s the story of a PhD student (Virginia Madsen) who visits an impoverished Chicago tenement building to investigate an urban myth whispered among the residents about a hook-handed ghost stalking the corridors. Naturally, she soon realises the phantom is all too real…. Philip Glass’s delicate music box score is eerie indeed and Tony Todd utterly mesmerising in the lead. Candyman manages to be both sincerely frightening and an important statement about the legacy of slavery and the injustices still endured by Black America, as relevant now as it was in 1992. Say his names three times before the mirror, I dare you - Joe Sommerlad 27 horror films that will actually terrify you Screamers (1995) Directed by Christian Duguay Christian Duguay Screamers is based on a Philip K Dick story, and his trademark other-worldliness and fascination with the dark side of AI/human nature give it some genuinely chilling twists. Plus there's robots with sharp blades that tear out of the ground and chop you to bits - Jon Di Paolo 27 horror films that will actually terrify you Scream (1996) Directed by Wes Craven Wes Craven Okay, hear me out. Scream might not be a high-quality film or achieve anywhere near the art of modern indie horrors being made on a fraction of the budget, but its antagonist still haunts me and I'll tell you why: zombies don't scare me, demons don't scare me, ghosts don't scare me, but humans do. None of horror's clichéd evil beings are as terrifying as a human on a murderous rampage with no apparent motive. Ghostface is gangly, awkward, fallible and all the scarier for it. The way he runs around like a toddler, blindingly slashing at the air, is chilling and an unwelcome reminder that, if you did die at the hands of a psychopath, it wouldn't involve a cinematic, well-placed spike but a floundering struggle - Christopher Hooton Sportsphoto Ltd./Allstar 27 horror films that will actually terrify you Funny Games (1997) Directed by Michael Haneke Michael Haneke Whilst not the first film that comes to mind when considering the horror genre, this film for me is as scary as it gets. At first, the violence seems irrational and nihilistic, but the most terrifying thing about Michael Haneke’s Austrian psychological thriller about two men who randomly torture a middle-class family in their idyllic vacation home is the fact that we become the driving force behind the horror. Breaking down the fourth wall (spoilers ahead), one of the oh-so-polite psychopaths rewinds a scene that doesn’t go his way, and gives us a much more gruesome ending to the film, otherwise, as he says straight to camera: “we’d all be deprived of our pleasure - Kirsty Major 27 horror films that will actually terrify you Ringu (1998) Directed by Hideo Nakata Hideo Nakata Make no mistake: if the Hollywood version of Ring is a decent remake, the Japanese original is far more petrifying. There is just something inexplicable about Asian horror films rooted in Japanese folklore and ghost stories that makes them far creepier. Watching it for the very first time is like living a nightmare; as Sadako crawls out of the well, you’ll find yourself automatically pushing against the back of the sofa in the hope she will not eventually end up in your living room. The movie put me off watching TV and picking up the phone for a couple of weeks, at least - Zlata Rodionova Photograph: Allstar/Omega 27 horror films that will actually terrify you Mulholland Drive (2001) Directed by David Lynch David Lynch For me the scariest moment in any movie ever has to be from David Lynch's Mulholland Drive. The scene happens around 10 minutes into the film but is sold bold and confident in it's ability to scare you it actually tells you exactly how it is going to do so. By using dream logic, distorted sound and strange camera movements, the scene transports you into a nightmare, turned reality for one of the characters in the scene. These five minutes are exhausting to behold but it is a masterclass in how to effectively use the jump scare. This segment perfectly encapsulates the rest of this beautiful, confusing and surreal movie as you never know what lies around the corner on Mulholland Drive - Greg Evans 27 horror films that will actually terrify you The Others (2001) Directed by Alejandro Amenábar Alejandro Amenábar This chiller doesn't rely on CGI or special effects to be scary - it's all about building tension through old-fashioned dramatic tricks and it does it brilliantly. Nicole Kidman delivers an absolute tour de force and it is riveting and affecting as well as liable to make you jump out of your seat - Jon Di Paolo 27 horror films that will actually terrify you Dark Water (2002) Directed by Hideo Nakata Hideo Nakata One of the horror films that still scares the heck out of me. It’s by Hideo Nakata, who made the equally as scary The Ring. Hollywood did a remake with Jennifer Connelly in 2005, but there is definitely something about the original Japanese version that leaves you with a haunting feeling - Mars El Brogy 27 horror films that will actually terrify you Signs (2002) Directed by M. Night Shyamalan M. Night Shyamalan Seeing that alien for the first time as he gets unceremoniously booted from a Brazilian kids birthday party still gets me, just as it did when I ran from the room the first time I saw it. I still resent that broadcaster's blatant flouting of TV dogma by playing so much tension-inducing build up before the action itself - Charlie Atkin 27 horror films that will actually terrify you Paranormal Activity (2009) Directed by Oren Peli Oren Peli The only film I’ve ever watched where I considered switching off halfway through out of sheer terror. The tension ratchets up endlessly as the ‘found footage’ style adds to the claustrophobia. A decision was made long ago never to watch it again - Tom Embury-Dennis Or: a cautionary tale for leaving your leg dangling out of your bed. Injecting fresh life into the found-footage formula, the first Paranormal Activity managed to induce chills the world over by the simple - and rather frugal - use of a static camera set up by couple Katie and Micah, all in the hope they can learn what's going 'bump' in the night. With every new nighttime scene - each displaying more demonic hauntings than the last - your sounds of terror will become more audible. - Jacob Stolworthy Available on Netflix 27 horror films that will actually terrify you Black Swan (2010) Directed by Darren Aronofsky Darren Aronofsky Guaranteed to make your skin crawl, Darren Aronofsky's 2010 take on classic ballet Swan Lake is a textbook example of psychological horror. Ballerina Nina (Natalie Portman) lands the coveted role of the Swan Princess, only to find she cannot engage with her evil alter-ego - the Black Swan. When Nina attempts to engage with her dark-side, she loses herself altogether - Megan Townsend 27 horror films that will actually terrify you V/H/S (2012) Directed by Various Various The rising crop of horror filmmakers (Adam Wingard and Ti West included) teamed up to make V/H/S, an anthology film comprised of six disturbing vignettes; if one doesn't scare you senseless, it's a sure bet the next will. The opening two linger in my memory, each taking familiar concepts - a night out with your pals and a honeymoon - and adding a slant of depravity that'll chill you to the core. Next time someone tells you they \"like you,\" run a mile - Jacob Stolworthy 27 horror films that will actually terrify you Oculus (2013) Directed by Mike Flanagan Mike Flanagan Psychological thrillers can be terrifying enough as they are, but throw in a spooky supernatural storyline and you'll have nightmares for days (or at least, I did). Oculus tells the story of a woman determined to clear her brother's name in the brutal murder of their parents. The siblings suspect supernatural forces are at play, with an antique mirror being at the root of all the evil. Suffice to say, the first thing I did as soon as I got home from the cinema was to throw a blanket over the giant mirror sitting in my room - you know, just in case - Chantal DaSilva 27 horror films that will actually terrify you It Follows (2014) Directed by David Robert Mitchell David Robert Mitchell David Robert Mitchell's synth-encrusted nightmare shows sound's essential role in the genre. It Follows premises itself on the very simple idea that something is out there, something indistinguishable from your fellow man, except that they're always headed straight for you. No matter where you may be, and no matter where you may run to. A figure walking down the street may seem ordinary at first, but Disasterpeace's score here turns that image into paralysing fright. Seeing this in the cinema, tucked up right next to the loudspeaker as the synths reached their climax and blood pooled the screen, unashamedly made me cry like a kid left behind in a shopping mall - Clarisse Loughrey Available on Netflix 27 horror films that will actually terrify you Green Room (2015) Directed by Jeremy Saulnier Jeremy Saulnier Patrick Stewart isn’t the first name that comes to mind when I think of horror; but 2015’s Green Room left me terrified; suspense from start to finish with an uncharacteristically dark turn from Stewart as detached neo-Nazi leader Darcy Banker - Ronan O'Shea Available on Netflix 27 horror films that will actually terrify you The Invitation (2015) Directed by Karyn Kusama Karyn Kusama “You look great”. “ I've started this new class, it's changed my life.” We've all been there. A dinner party with old friends, someone you deliberately haven't seen in a while proselytizing about their latest fad diet, class, or retreat. The Invitation takes that a step further: Will takes his new partner for dinner at his ex-wife's house, joining a cast of friends who haven't seen each other since he lost his son over a year ago. As the wine flows, and two new guests join the old crew, Will begins to realise that they've been brought here for another reason all together - Kirsty Major Available on Netflix 27 horror films that will actually terrify you Under the Shadow (2016) Directed by Babak Anvari Babak Anvari For anyone who has seen Under the Shadow, it should come as no surprise that Iranian-born Babak Anvari’s film is Britain’s Oscar entry for best Best Foreign Language Film. Though short in length (a brief 74 mins), every scene drips with intensity. The 80s set film follows a mother and her young daughter as they struggle with a demon haunting their apartment’s building in war-torn Iran. Alongside the nightmarish torment of the Djinn, the building is being bombed by militant forces, meaning the threat comes from both inside and out, culminating in one of the year’s best horror films - Jack Shepherd Available on Netflix 27 horror films that will actually terrify you The Witch (2016) Directed by Robert Eggers Robert Eggers The Witch is set in 17th contrary New England and follows a family banished from their Puritan plantation. When the youngest suddenly disappears, the blame falls upon Anya Taylor-Joy’s young character, though she knows something more is at play. As the film progresses, stranger and stranger things start to happen, all with a heavy twang of religious imagery. The jump scares may not be frequent but the atmosphere is utterly terrifying - Jack Shepherd 27 horror films that will actually terrify you Raw (2017) Directed by Julia Ducournau Julia Ducournau All good horror reflects our deepest collective fears back at us, and Raw gives us this with a side of human flesh. Justine is a first-year veterinary student, who at once fasts and purges, lets loose and withdraws, scaling the highs and lows that coming of age brings. She throws herself with abandon at human flesh, both literally and metaphorically - with an older sister whose destructive behaviour leaves her with little in the way of a role model to help navigate her newly burgeoning desires - Kirsty Major\n\nHereditary stars Toni Collette, Gabriel Byrne, Alex Wolff and Ann Dowd. It follows a woman’s unravelling of increasingly terrifying secrets about her family’s ancestry following the death of her mother. The film picked up steam after its premiere at Sundance Film Festival where it has since been deemed “the most traumatically terrifying horror movie in ages”. It will be released in the UK and US in June.\n\nSome have theorised that the mishap could have been a publicity stunt for the film’s release, but The Independent could not verify this.\n\nSubscribe to our writers' new podcast 'The LOST Boys' here.\n\nFollow Independent Culture on Facebook", "images": ["https://www.independent.co.uk/img/pixels-player-logo.svg", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/04/27/09/hereditary-toni-collette.jpg?quality=75&width=1200&auto=webp", "https://www.independent.co.uk/img/logo-white-out.svg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/04/27/09/hereditary-toni-collette.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Jacob Stolworthy"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/films/news/hereditary-trailer-peter-rabbit-screening-children-traumatised-australia-horror-film-a8324896.html", "title": "Panicked families flee cinema as trailer for 'scariest horror film in years' Hereditary shown in Peter Rabbit screening", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "'Parents were yelling at the projectionist to stop, covering their kids’ eyes and ears'", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "News", "sitename": "The Independent", "page path": "/arts-entertainment/films/news", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2018-04-30T08:09:26.000Z", "site_name": "The Independent", "title": "Panicked families flee cinema as terrifying horror trailer is shown before Peter Rabbit screening", "url": "https://www.independent.co.uk/arts-entertainment/films/news/hereditary-trailer-peter-rabbit-screening-children-traumatised-australia-horror-film-a8324896.html", "type": "article", "description": "'Parents were yelling at the projectionist to stop, covering their kids’ eyes and ears'", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/04/27/09/hereditary-toni-collette.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/04/27/09/hereditary-toni-collette.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2018-04-30T08:09:26.000Z", "modified_time": "2018-04-30T08:09:26.000Z", "section": "Culture", "subsection": "Film", "author_name": "Jacob Stolworthy", "content_type": "story", "word_count": 528, "image_count": 1, "embed_count": 2, "video_count": 1, "internal_link_count": 2, "external_link_count": 4}, "date": "2018-04-30T08:09:26.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "vf": {"owner": "viafoura-id:11000176299319"}, "twitter": {"title": "Panicked families flee cinema as terrifying horror trailer is shown before Peter Rabbit screening", "site": "@Independent", "card": "summary_large_image", "description": "'Parents were yelling at the projectionist to stop, covering their kids’ eyes and ears'", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/04/27/09/hereditary-toni-collette.jpg?quality=75&width=1200&auto=webp"}, "keywords": "Hereditary,Peter Rabbit,Toni Collette,Ann Dowd,Internal"}, "movies": [], "publish_date": 1525075766.0, "source": "https://www.independent.co.uk", "summary": ""}