{"url": "https://www.hollywoodreporter.com/live-feed/miley-cyrus-defends-retracting-apology-vanity-fair-portrait-1107850", "text": "Miley Cyrus doesn’t worry about yesterday. She doesn’t even care about tomorrow. And she certainly isn’t losing any sleep over a scantily clad photo of herself published 10 years ago.\n\nEarlier this week, the pop singer retracted her apology for a controversial photo published in Vanity Fair back in 2008. Her curt Twitter retort still stands: “IM NOT SORRY. Fuck YOU.” But there’s more.\n\nIn a Tuesday night interview on Jimmy Kimmel Live!, Cyrus took a swipe at the New York Post, the POTUS, and everyone who points the finger of shame. “I never really keep track of the years that have gone by since something like this,” she said, with a nod to a printout of the resurfaced Post headline about the photo shoot.\n\n“A lot of things have changed and I think the conversation has changed a lot…. Sure, some people thought I did something wrong in their eyes. But I think it was really wrong of someone to put on top of someone that this is my shame and that I should be ashamed of myself,” she continued. “It’s not a nice thing to tell someone they should be ashamed of themselves. Except Donald Trump.”\n\nShe also recounted the photo session when, at the age of 15, Cyrus worked with renowned photographer Annie Leibovitz for the Vanity Fair feature. “There was nothing sexualized about this on set,” the former Hannah Montana star said. “It was every one’s poisonous thoughts and minds that ended up turning this into something that wasn’t meant to be. So actually, I should not be ashamed, they should be.”\n\nCyrus covered a lot of turf during her Q&A with Kimmel, from the thin line between “hoarding” and “collecting,” her special packet of peanuts, living with Liam Hemsworth and her “new projects” in Los Angeles. She kept those plans under wraps, but they’re apparently so important, she gave up smoking pot (her “first true love”) to “stay focused.”\n\nCheck out more clips from Miley’s appearance below.\n\nThis article originally appeared on Billboard.com.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/05/miley_cyrus_on_fk_you_tweet_taking_back_apology_screen_shot2_0.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/miley_cyrus_on_fk_you_tweet_taking_back_apology_screen_shot2_0.jpg?w=1024", "keywords": [], "authors": ["Lars Brandle Billboard"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/miley-cyrus-defends-retracting-apology-vanity-fair-portrait-1107850/", "title": "Miley Cyrus Defends Retracting Apology for Controversial Vanity Fair Portrait", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "\"It’s not a nice thing to tell someone they should be ashamed of themselves,\" Cyrus told Jimmy Kimmel about being pressured to apologize for exposing the skin of her back at age 15.", "news_keywords": "Jimmy Kimmel, Jimmy Kimmel Live!, Late-Night TV, Miley Cyrus", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lars Brandle Billboard", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1107850, "title": "Miley Cyrus Defends Retracting Apology for Controversial Vanity Fair Portrait", "published_at": "2018-05-02 09:12:01", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/miley_cyrus_on_fk_you_tweet_taking_back_apology_screen_shot2_0.jpg?w=1024", "comment_count": 0, "tags": "Miley Cyrus", "topics": "TV News", "body": "Miley Cyrus doesn’t worry about yesterday. She doesn’t even care about tomorrow. And she certainly isn't losing any sleep over a scantily clad photo of herself published 10 years ago.\r\nEarlier this week, the pop singer retracted her apology for a controversial photo published in Vanity Fair back in 2008. Her curt Twitter retort still stands: \"IM NOT SORRY. Fuck YOU.\" But there’s more. \r\nIn a Tuesday night interview on Jimmy Kimmel Live!, Cyrus took a swipe at the New York Post, the POTUS, and everyone who points the finger of shame. \"I never really keep track of the years that have gone by since something like this,\" she said, with a nod to a printout of the resurfaced Post headline about the photo shoot.  \r\n\"A lot of things have changed and I think the conversation has changed a lot.... Sure, some people thought I did something wrong in their eyes. But I think it was really wrong of someone to put on top of someone that this is my shame and that I should be ashamed of myself,\" she continued. \"It’s not a nice thing to tell someone they should be ashamed of themselves. Except Donald Trump.\"\r\nShe also recounted the photo session when, at the age of 15, Cyrus worked with renowned photographer Annie Leibovitz for the Vanity Fair feature. \"There was nothing sexualized about this on set,\" the former Hannah Montana star said. \"It was every one’s poisonous thoughts and minds that ended up turning this into something that wasn’t meant to be. So actually, I should not be ashamed, they should be.\"\r\nCyrus covered a lot of turf during her Q&A with Kimmel, from the thin line between \"hoarding\" and \"collecting,\" her special packet of peanuts, living with Liam Hemsworth and her \"new projects\" in Los Angeles. She kept those plans under wraps, but they’re apparently so important, she gave up smoking pot (her \"first true love\") to \"stay focused.\"\r\nCheck out more clips from Miley’s appearance below.\r\n\r\n\r\n\r\nThis article originally appeared on Billboard.com.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Miley Cyrus Defends Retracting Apology for Controversial Vanity Fair Portrait", "url": "https://www.hollywoodreporter.com/tv/tv-news/miley-cyrus-defends-retracting-apology-vanity-fair-portrait-1107850/", "description": "“It’s not a nice thing to tell someone they should be ashamed of themselves,” Cyrus told Jimmy Kimmel about being pressured to apologize for exposing the skin of her back at age 15.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/miley_cyrus_on_fk_you_tweet_taking_back_apology_screen_shot2_0.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-05-02T09:12:01+00:00", "modified_time": "2018-05-02T11:40:17+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Miley Cyrus Defends Retracting Apology for Controversial Vanity Fair Portrait", "description": "“It’s not a nice thing to tell someone they should be ashamed of themselves,” Cyrus told Jimmy Kimmel about being pressured to apologize for exposing the skin of her back at age 15.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/miley_cyrus_on_fk_you_tweet_taking_back_apology_screen_shot2_0.jpg?w=1280"}}, "movies": [], "publish_date": 1525252321.0, "source": "https://www.hollywoodreporter.com", "summary": ""}