{"url": "https://web.archive.org/web/20160509132143/https://www.royal.uk/the-duchess-of-cambridge", "text": "About The Duchess of Cambridge The Duchess of Cambridge, born Catherine Elizabeth Middleton, married Prince William at Westminster Abbey in April 2011. Their Royal Highnesses have two children, Prince George and Princess Charlotte. The family's official residence is Kensington Palace, but Their Royal Highnesses also spend part of the year living on the Sandringham Estate in Norfolk. As well as undertaking royal duties in support of The Queen, both in the UK and overseas, The Duchess devotes her time to supporting a number of charities and organisations. Children's mental health The Duchess of Cambridge is a committed champion of issues related to children’s mental health and emotional wellbeing. Her Royal Highness has worked to bring wider public attention to the fact that issues facing children today such as addiction, poverty, abuse, neglect, loss and illness of family members, can have a long-lasting and traumatic impact if left unsupported. In particular she has highlighted the need for open and honest conversations about the subject to try and combat stigma, and also the importance of early intervention mental health support for young people, to tackle these issues at the earliest possible stage, so that children have the brightest possible futures, as they deserve. It is our duty, as parents and as teachers, to give all children the space to build their emotional strength and provide a strong foundation for their future The Duchess of Cambridge Addiction Through her work with Action on Addiction, The Duchess of Cambridge was struck by the fact that children of addicts are twice as likely to go on to become addicts themselves. In 2013, The Duchess of Cambridge launched M-PACT Plus, an initiative to support children, parents and families affected by parental drug and alcohol misuse, with the aim of providing early specialist support to children to prevent these inevitable outcomes. The project involves training school staff to identify children affected by a parent's drug or alcohol misuse. It then brings families together to work with trained practitioners. The project was convened at Her Royal Highnesses request by her own charity The Royal Foundation of The Duke and Duchess of Cambridge and Prince Harry. Children's palliative care The Duchess of Cambridge is a committed supporter of children’s hospices and wider palliative care, which provides a vital lifeline to children and families affected by life-limiting conditions. Through her Royal engagements, charitable patronages and in speeches, she has worked to bring wider public attention to the hospice movement, and the holistic services they offer to families. The Duchess of Cambridge has been publicly involved in this area since she became Royal Patron of East Anglia’s Children’s Hospices (EACH) in January 2012. She has supported their major fundraising efforts to build a new children's hospice The Nook, in Norfolk. Royal patronages The Duchess is Patron of eight organisations, where she feels her support can make a difference. These broadly reflect her interests in supporting the most vulnerable families and young people, promoting opportunities though sport, and showcasing national institutions. As their Royal Patron, The Duchess will back their key projects and initiatives, spotlight their work through her programme of official engagements and where appropriate by convening organisations to work in support of each other. The Royal Foundation of The Duke and Duchess of Cambridge and Prince Harry In addition to supporting charities and organisations, The Duchess of Cambridge like her husband and Prince Harry is able to direct her own philanthropic work through The Royal Foundation of The Duke and Duchess of Cambridge and Prince Harry. The Royal Foundation develops programmes and charitable projects based on the interests of Their Royal Highnesses by working with organisations which are already making a proven impact in their respective fields. The Royal Foundation provides additional investment, mentoring, support and partnerships for these programmes, and lends its own profile and leverage to enhance the effect of their good work.\n\n\n\nBiography The Duchess of Cambridge became a member of the Royal Family in 2011, upon her marriage to Prince William. Since that time, she has taken on Royal duties in support of The Queen through engagements at home and overseas, alongside a portfolio of charitable work and patronages. The Duchess's charitable work is driven by a personal desire to help make a difference in some key areas, where she feels her support can help. In recent years, The Duchess has drawn attention to the importance of supporting the mental health and emotional wellbeing of children, the impact of addiction on children and families, and the necessary measures to support children suffering from family breakdown. Early life Catherine Elizabeth Middleton was born to Michael and Carole Middleton at the Royal Berkshire Hospital, Reading, on 9 January 1982. The Duchess is the eldest of three children. The Duchess of Cambridge was christened at the parish church of St. Andrew’s Bradfield in Berkshire on 20 June 1982. In May 1984, at the age of two, The Duchess moved with her family to Amman in Jordan, where her father worked for two and a half years. Her Royal Highness attended a nursery school in Amman from the age of three. Education In September 1986, the Middletons returned to their home in West Berkshire, and Her Royal Highness started at St. Andrew’s School in Pangbourne, where she remained until July 1995. The Duchess went on to Marlborough College in Wiltshire, where she studied Chemistry, Biology and Art at A-level. Her Royal Highness also took part in sport on behalf of the school, playing tennis, hockey and netball and participating in athletics, particularly high jump. Leaving Marlborough College in July 2000, The Duchess of Cambridge undertook a gap year in which she studied at the British Institute in Florence, undertook a Raleigh International programme in Chile, and crewed on Round the World Challenge boats in the Solent. In 2001, The Duchess enrolled at the University of St. Andrews, Fife, from where she graduated in 2005 with a 2:1 in History of Art. Her Royal Highness continued with her interest in sport at University, playing hockey for the University team. The Duchess first met The Duke of Cambridge when studying at the University. Family life On 29 April 2011, Prince William and Miss Catherine Middleton were married at Westminster Abbey. The couple are now known as The Duke and Duchess of Cambridge. They have two children; a son, George Alexander Louis, born on 22 July 2013 and a daughter, Charlotte Elizabeth Diana, born on 2 May 2015. Their official residence is at Kensington Palace.\n\nSupporting The Queen The Duchess of Cambridge works in support of The Queen in carrying out Royal duties both at home and overseas. She has been hugely inspired by the leadership The Queen has provided for over 60 years and will continue to play her part in supporting and celebrating The Queen in the UK and around the Commonwealth wherever possible. The Duchess of Cambridge supports The Queen and the Royal Family in a number of ways. Her Royal Highness regularly undertakes Royal engagements in towns and cities across the United Kingdom, joining The Queen and other members of The Royal Family on occasions. She also plays a full role at annual Royal events. These include: • Garden Parties at Buckingham Palace\n\n• Celebrating The Queen's official birthday at Trooping the Colour\n\n• Joining members of the Royal Family in welcoming State Visits to the UK\n\n• The Remembrance Day ceremony at the Cenotaph in Whitehall, London Remembrance The Duchess of Cambridge joins her husband and members of the Royal Family to lead moments of national commemoration for the two World Wars in Europe. Together The Duke and Duchess of Cambridge attended the 70th anniversary of the D-Day landings in Arromanches in June 2014 where they met veterans and their families. They also led the August 2014 services commemorating the centenary of the First World War in Liege, joining Prince Harry at a service in Saint Symphorien cemetery near Mons, Belgium. Royal tours The Duchess of Cambridge has carried out a number of overseas visits with her husband including to Realm and Commonwealth nations on behalf of The Queen, or to undertake an official tour to represent Britain at the request of the Government. The Duchess's first official overseas tour was to Canada in July 2011. For their second tour, in 2012 The Duke and Duchess of Cambridge visited Malaysia, Singapore, Solomon Islands and Tuvalu as part of Her Majesty The Queen's Diamond Jubilee year celebrations. The Duke and Duchess of Cambridge, with Prince George, then visited New Zealand and Australia in Spring 2014, followed by New York in December 2014. The Duke and Duchess will visit India in Spring 2016. National sporting events The Duchess of Cambridge, herself a keen sportswoman, also represents the Royal Family at major national sporting events to reflect the nation's support, in particular when Great Britain is acting as the host nation of a major event. Along with Prince Harry, The Duke and Duchess of Cambridge were Official Ambassadors for Team GB and Paralympic GB in the lead up to, and during, the 2012 Olympic and Paralympic Games. Again at the Commonwealth Games in Glasgow in 2014, Their Royal Highnesses joined the thousands of fans watching the sports at the venues and also meeting the athletes. They joined forces again in 2014 to witness the spectacular Tour de France Grand Depart in Yorkshire, where they signaled the start of the race, and in 2015 supported Prince Harry in his role as President of the Rugby World Cup. The Duchess is a keen tennis fan and also regularly attends the Wimbledon Championships, including the men's final in 2014, and the semi-final in 2015.\n\n", "images": ["https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/dscf7029.jpg?itok=TfIUsuyj", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/pa-26091464.jpg?itok=77ZVsxkj", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/feature/img-20160501-wa0001_wm.jpg?itok=zBy4fSFH", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/jonyy.jpg?itok=wiFF5nTB", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/huff.jpg?itok=cOJliR7I", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/feature/prince-george.jpg?itok=IEDRnnoi", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/eagles-nest-5.jpg?itok=kDYUJBmI", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/all/themes/tbm/_assets/img/crest.png", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/feature/supporting-hospice.jpg?itok=6RiEDnvx", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/feature/duchess-sport.jpg?itok=ONip4RuH", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/pa-22478971.jpg?itok=PSyU6Hb7", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/feature/charities-forum-2.jpg?itok=_cblrB8G", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/heads.jpg?itok=32YTmIcP", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/featured_image_hero_mobile/public/images/biography/pa-25555222.jpg?itok=_zZBfAJq", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/india3.jpg?itok=V7f-Rdpa", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/ukinindia_meeting.jpg?itok=oWiPH0M5", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_2x2/public/images/thumbnails/insta2.jpg?itok=mONJFs5F", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/bhutan-2.jpg?itok=_oNn3kjg", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/cd2016.jpg?itok=Y3G8KMp3", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/duchess-magic-garden.jpg?itok=pUuo60Cb", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_2x2/public/images/gallery-preview/pa-26091464.jpg?itok=T-VDRwlT", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/all/themes/tbm/_assets/img/crest_white.png", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/images/biography/pa-25555222.jpg", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_2x2/public/images/thumbnails/obama_3.jpg?itok=SJpD_Xn6", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/vogue100-doc-2-for-online.jpg?itok=nRy0s-GK", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/all/themes/tbm/_assets/img/Crest_logo.png", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/all/modules/custom/tbm_ajaxify/ajaxify.gif", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/place2be_4.jpg?itok=zZJT-dh-", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/feature/childrens-mental-health.jpg?itok=Dk1LI6dW", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/india4.jpg?itok=FhUIpe96", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_4x2/public/images/news/india2.jpg?itok=woXES8ok", "https://web.archive.org/web/20160509132143im_/https://pbs.twimg.com/profile_images/724184960995844096/W5IDweMs_normal.jpg", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/grid_2x2/public/images/biography/pa-25555222.jpg?itok=44vz_9Sz", "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/styles/featured_image_hero/public/images/biography/pa-25555222.jpg?itok=Zp4_q75a"], "top_img": "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/images/biography/pa-25555222.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20160509132143/https://www.royal.uk/the-duchess-of-cambridge", "title": "The Duchess of Cambridge", "meta_data": {"description": "The Duchess of Cambridge, born Catherine Elizabeth Middleton, married Prince William at Westminster Abbey in April 2011. Their Royal Highnesses have two children, Prince George and Princess Charlotte. The family's official residence is Kensington Palace, but Their Royal Highnesses also spend part of the year living on the Sandringham Estate in Norfolk. As well as undertaking royal duties in support of The Queen, both in the UK and overseas, The Duchess devotes her time to supporting a number of charities and organisations.", "abstract": "The Duchess of Cambridge, born Catherine Elizabeth Middleton, married Prince William at Westminster Abbey in April 2011. Their Royal Highnesses have two children, Prince George and Princess Charlotte. The family's official residence is Kensington Palace, but Their Royal Highnesses also spend part of the year living on the Sandringham Estate in Norfolk. As well as undertaking royal duties in support of The Queen, both in the UK and overseas, The Duchess devotes her time to supporting a number of charities and organisations.", "generator": "Drupal 7 (http://drupal.org)", "og": {"site_name": "The Royal Family", "type": "article", "title": "The Duchess of Cambridge", "url": "https://web.archive.org/web/20160509132143/https://www.royal.uk/the-duchess-of-cambridge", "description": "The Duchess of Cambridge, born Catherine Elizabeth Middleton, married Prince William at Westminster Abbey in April 2011. Their Royal Highnesses have two children, Prince George and Princess Charlotte. The family's official residence is Kensington Palace, but Their Royal Highnesses also spend part of the year living on the Sandringham Estate in Norfolk. As well as undertaking royal duties in support of The Queen, both in the UK and overseas, The Duchess devotes her time to supporting a number of charities and organisations.", "updated_time": "2016-04-07T17:12:12+01:00", "image": {"identifier": "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/images/biography/pa-25555222.jpg", "url": "https://www.royal.uk/sites/default/files/images/biography/pa-25555222.jpg"}}, "twitter": {"card": "summary", "creator": {"identifier": "@BritishMonarchy", "id": 36042554}, "title": "The Duchess of Cambridge", "url": "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/the-duchess-of-cambridge", "description": "The Duchess of Cambridge, born Catherine Elizabeth Middleton, married Prince William at Westminster Abbey in April 2011. Their Royal Highnesses have two children, Prince George and Princess Charlotte. The family's official residence is Kensington Palace, but Their Royal Highnesses also spend part of the year living on the Sandringham Estate in Norfolk. As well as undertaking royal duties in support of The Queen, both in the UK and overseas, The Duchess devotes her time to supporting a number of charities and organisations.", "image": "https://web.archive.org/web/20160509132143im_/https://www.royal.uk/sites/default/files/images/biography/pa-25555222.jpg"}, "article": {"published_time": "2016-02-18T11:11:49+00:00", "modified_time": "2016-04-07T17:12:12+01:00"}, "dcterms.title": "The Duchess of Cambridge", "dcterms.creator": "Kirsty.Oram", "dcterms.description": "The Duchess of Cambridge, born Catherine Elizabeth Middleton, married Prince William at Westminster Abbey in April 2011. Their Royal Highnesses have two children, Prince George and Princess Charlotte. The family's official residence is Kensington Palace, but Their Royal Highnesses also spend part of the year living on the Sandringham Estate in Norfolk. As well as undertaking royal duties in support of The Queen, both in the UK and overseas, The Duchess devotes her time to supporting a number of charities and organisations.", "dcterms.date": "2016-02-18T11:11+00:00", "dcterms.type": "Text", "dcterms.format": "text/html", "dcterms.language": "und", "dcterms.identifier": "https://www.royal.uk/the-duchess-of-cambridge", "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "dcterms.created": "18. February 2016 - 11:11", "dcterms.modified": "2016-04-07T17:12+01:00"}, "movies": ["//web.archive.org/web/20160509132143if_/https://www.youtube.com/embed/rwMGcH-zYDY"], "publish_date": 1455793909.0, "source": "https://web.archive.org", "summary": ""}