{"url": "https://www.visaliatimesdelta.com/story/entertainment/arts/2018/11/21/lion-king-set-roar-when-stops-central-valley/1853147002/", "text": "'Disney's The Lion King' set to roar when it stops in the Central Valley\n\nThere’s something special about being a lion. Especially when the lion gets to spend eight times a week on a stage and travel around the country.\n\nNia Holloway and Jared Dixon are headed to the William Saroyan Theatre for a two-week stint playing two of the lead roles in “Disney’s The Lion King.” The show runs from Nov. 28 through Dec. 9, with tickets ranging from $35 to $129.\n\nThey’re part of a tradition that has been around for nearly their entire lives, performing in a show that more than 90 million people have seen since it first took to the stage in 1997, bringing to life the 1994 animated movie of the same name.\n\nMore: Gala of the Royal Horses will prance into Tulare County Fairgrounds\n\nFamily-friendly Coyote Entertainment Center coming to Tachi Palace on Nov. 30\n\nVisalia's Cellar Door 2.0: Pop-up kitchen, craft cocktails and (of course) lots of music\n\nVisalia Players hit a comedic bullseye with 'Escanaba in Da Moonlight'\n\nThe show features puppets and costumes on an epic scale, with all the animals of the Serengeti parading through the theater and across the stage in a theatrical extravaganza that, under Julia Taymor’s direction, changed forever what people conceived of could be done on stage.\n\nFor Holloway, the role of adult Nala (another actress plays the young Nala) changed her life. She auditioned for the role while she was in high school—when she was technically still too young to play the role. She went to the auditions anyway and ended up being cast as the youngest person to ever play the role.\n\nShe spent her senior year on the road and has been with the show ever since, for four years.\n\n“Lion King has made me a stronger person and performer,” Holloway said. “My family has said I’ve gone to Lion King College. It is truly an experience onstage that has helped me become the person I want to be.”\n\nShe said traveling the U.S. and Canada has given her experiences she would not have had otherwise, including seeing how the show affects people and getting to experience people’s gratitude for what the show inspires in them.\n\nNala, the young lioness who inspires Simba and convinces him to come back and fulfill his destiny after he has run away from the Pridelands, feeling responsible for the death of his father, has a powerful role in the musical and Holloway said it was a good fit for her from the beginning.\n\n“I really fit into the role because Nala was originally designed to be a teenage princess warrior, and at 17, I felt like Nala in my real life,” Holloway said. “As I’ve grown into it and become a young woman, I think my Nala has become more and more grounded. She’s very strong and grounded as I have come into my womanhood.”\n\nHolloway said her character is one that inspires young people, and that she truly appreciates the responsibility of providing such a role model. Nala is also a character that has taught her things.\n\n“Nala has taught be to be both strong and soft at the same time,” said Holloway. “Nala is a princess warrior who is very strong and driven, but at the same time, she has a vulnerable side. She is very compassionate even while she gets things done.\n\n“Nala is a role model for men and women because she is such a young powerhouse. This is especially true for millennials who are the ones getting things done and making change. She is someone who inspires them, is close to them and they can relate to.”\n\nDixon is just joining the Lion King cast—he’s been with the show for only two months, most of that in rehearsals. He took on the role of Simba after performing in such shows as “The Color Purple,” “In the Heights,” “Cruel Intentions,” “Violet,” “Hairspray,” “Sister Act” and “Hello Again.”\n\nYet, he said being a lion isn’t that different from the human roles he’s been playing.\n\n“The Lion King crew really did a great job of making the characters realistic and playable in live theater,” Dixon said. “I put the same amount of emotion in being Simba that I do human characters. He’s not one note. He is a volatile character. He’s very dynamic emotionally and I get to play my happiest self and my saddest self. It’s a journey of a role.”\n\nDixon said the role’s biggest challenge is a mental one, even with its high physical demands. He describes it as constantly playing chess with himself, trying to decide whether to go bigger or smaller with each emotional choice while always trying to live within the realm of believability.\n\n“I see how my body responds to choices, how the audience responds and how other actors respond,” said Dixon. “They do a really great job of training everyone on the physical vocabulary of the show. Everyone has their own physicality that mirrors their animal.”\n\nAt 30 years old, Dixon said the Lion King has always been a part of his consciousness. He loved it as a kid and saw it on stage when he was 8, the year the musical first opened.\n\n“It opened my eyes to the possibilities of theater,” Dixon said. “This show is groundbreaking. When it was done, it had never been done before. The innovation and creation really changed theater and it changed my mind about how theater can be more than three-dimensional.”\n\nWhile the spectacle and wonder of the show with its huge masks, African-inspired costumes, and memorable music crashed onto the scene and snagged the show six Tony awards, including best musical, both Holloway and Dixon say it is the story that keeps people filling the theaters in what in 2014 became the top-earning title in box office history, surpassing the record previously held by “The Phantom of the Opera.”\n\n“The story of Simba being a young cub who has to take on responsibility, the circle of life, it is just truly a universal story,” said Holloway. “It doesn’t matter where you came from or what age you are. You can come and watch something that respects the world. It’s just beautiful.”\n\nDixon said that even though our world has changed over the past 30 years, the show continues to be relevant and continues to speak to people.\n\n“Millions of people return for a reason,” he said. “There is something for everyone in this show, from the youngest child to the oldest child, and we’re all children in some way. The story spans across so many different ideas and concepts, that it is still relevant. It still speaks to people. We are all partaking in something that is greater than ourselves, that speaks to our humanity through animals.”\n\nIf you go\n\nWhat: “Disney’s The Lion King”\n\nWhere: Saroyan Theatre\n\nWhen: Nov. 28-Dec. 9\n\nTickets: $35 to $129\n\nInformation: https://fresno.broadway.com/", "images": ["https://www.gannett-cdn.com/-mm-/9287dd6098844f6174989ef6df8c85524b1ef7dc/c=0-171-897-678/local/-/media/2017/05/04/TXNMGroup/ElPaso/636295099236691842-6-Dashaun-Young-Simba-Disney.-Photo-by-Joan-Marcus.jpg?auto=webp&format=pjpg&width=1200"], "top_img": "https://www.gannett-cdn.com/-mm-/9287dd6098844f6174989ef6df8c85524b1ef7dc/c=0-171-897-678/local/-/media/2017/05/04/TXNMGroup/ElPaso/636295099236691842-6-Dashaun-Young-Simba-Disney.-Photo-by-Joan-Marcus.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Usa Today Network"], "canonical_link": "https://www.visaliatimesdelta.com/story/entertainment/arts/2018/11/21/lion-king-set-roar-when-stops-central-valley/1853147002/", "title": "'Disney's The Lion King' set to roar when it stops in the Central Valley", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=566363893, app-argument=https://www.visaliatimesdelta.com/story/entertainment/arts/2018/11/21/lion-king-set-roar-when-stops-central-valley/1853147002/entertainment/arts", "theme-color": "#ffffff", "og": {"title": "'Disney's The Lion King' set to roar when it stops in the Central Valley", "description": "\\", "site_name": "Visalia Times-Delta", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/9287dd6098844f6174989ef6df8c85524b1ef7dc/c=0-171-897-678/local/-/media/2017/05/04/TXNMGroup/ElPaso/636295099236691842-6-Dashaun-Young-Simba-Disney.-Photo-by-Joan-Marcus.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "description": "\\", "twitter": {"site": "@vtdnews", "creator": "@vtdnews", "card": "summary_large_image"}}, "movies": [], "publish_date": 1542758400.0, "source": "https://www.visaliatimesdelta.com", "summary": ""}