{"url": "https://www.npr.org/2018/05/14/605265626/nprs-summer-movie-guide-27-films-coming-your-way", "text": "NPR's Summer Movie Guide: 27 Films Coming Your Way\n\nEnlarge this image toggle caption Annapurna Pictures/Disney Pixar/Sanja Bucko, Warner Bros. Pictures/Hopper Stone, SMPSP/Lucasfilm Ltd./Universal Pictures and Amblin Entertainment and Legendary Pictures Productions Annapurna Pictures/Disney Pixar/Sanja Bucko, Warner Bros. Pictures/Hopper Stone, SMPSP/Lucasfilm Ltd./Universal Pictures and Amblin Entertainment and Legendary Pictures Productions\n\nNot so very long ago, everyone agreed when Summer Movie Season kicked off. There was no subjectivity involved. It was dictated by the calendar: Memorial Day weekend meant the arrival of the big tentpole movies that would proceed to bust blocks over the course of the sultry summer months. Simple.\n\nBut all that has changed. The start of Summer Movie Season has been creeping earlier and earlier for years now, and when Bob Mondello, Linda Holmes and I, alongside the rest of NPR's movie team, looked at the 2018 release schedule, we had a decision to make. Even though the release of the mighty Marvel slugfest Avengers: Infinity War seems like the most logical start of popcorn movie season, we just couldn't bring ourselves to call any film debuting in April a summer movie. We will die on this hill! This far, no further!\n\nInstead, we picked May 18 — the day Deadpool 2 blasts into theaters, reeking of cordite and irony — as the official beginning of Summer Movie Season. A distinction without a difference, you say? Perhaps, but bear with us.\n\nBelow, we offer a glimpse of the summer movies we're most looking forward to and/or expect people to be talking about.\n\nAs ever, the Summer Movie Season is dominated by sequels and special effects. But if you're prepared to look for them, you'll find some smaller, quirkier films flying beneath the radar. — Glen Weldon\n\nNote: This year's release calendar seems unusually volatile — several premiere dates have shifted and continue to do so. But as of publishing, here's what the schedule looks like.\n\nBook Club (May 18): A great quartet of actresses (Diane Keaton, Jane Fonda, Candice Bergen, Mary Steenburgen) headline this comedy about a book club that gets back into a romantic mood after reading Fifty Shades Of Grey. It sounds ridiculous, but if that is a hook for an ensemble romantic comedy with a high-octane cast of women who are all 65 and older, it will be trying something new. — Linda Holmes\n\nEnlarge this image toggle caption Melinda Sue Gordon/Paramount Pictures Melinda Sue Gordon/Paramount Pictures\n\nDeadpool 2 (May 18): Plans for a sequel were announced before the original, flamboyantly vulgar, determinedly foul-mouthed Deadpool was even released. Ryan Reynolds plays the wisecracking, fast-healing titular mercenary; trash-talking trainwreck T.J. Miller is his bartending best bud; and Josh Brolin (who signed a four-pic deal) plays his nemesis, Cable, a time-traveling cybernetic mutant soldier. — Bob Mondello\n\nSolo: A Star Wars Story (May 25): Directors Phil Lord and Chris Miller were famously kicked off this film and replaced with Ron Howard, leaving some (well, me) to wonder whether the film — essentially Han Solo's origin story — will retain any of their goofy humor. The trailer assuages some of that worry, as does the sight of Donald Glover rocking Lando Calrissian's smooooth cerulean-cape couture. — Glen Weldon\n\nHow To Talk To Girls At Parties (June 1): John Cameron Mitchell (Hedwig And The Angry Inch, Shortbus) directs this adaptation of a Hugo Award-nominated short story by Neil Gaiman. In 1977 London, a kid (Alex Sharp) goes to a party and meets a nice young alien (Elle Fanning), and the two proceed to get their punk on. The trailer looks fittingly anarchic, and Nicole Kidman plays a punk priestess named Queen Boadicea, so, I mean. — Glen Weldon\n\nAlex Strangelove (June 8): At this writing, we don't know a lot about the latest film from writer/director Craig Johnson (The Skeleton Twins). It's a comedy about a teenager (Daniel Doheny) whose quest to lose his virginity takes an unexpected turn. (\"Unexpected\" is reportedly studio PR-speak for \"gay.\") Love, Simon took up a lot of gay-teen oxygen earlier this year, by virtue of its major-studio provenance. But Johnson's track record suggests Alex Strangelove will prove quirkier — and more palpably queer. —Glen Weldon\n\nOcean's 8 (June 8): Sandra Bullock, Mindy Kaling, Sarah Paulson, Awkwafina, Rihanna and a bunch of other women rob Anne Hathaway at the Met Gala? Yes, please. The Ocean's movies have been hit or miss, but if they can get close to the rewatchability of the first Clooney/Pitt model, they'll be the best summer popcorn you could ask for. — Linda Holmes\n\nEnlarge this image toggle caption Barry Wetcher/Warner Bros. Pictures Barry Wetcher/Warner Bros. Pictures\n\nWon't You Be My Neighbor? (June 8): Oscar-winning documentary filmmaker Morgan Neville turns his lens on Mr. Rogers in his lovingly made film. With unprecedented access to the family of the beloved children's television host, Neville explores the values and driving forces behind one of public broadcasting's enduring stars. — Nina Gregory\n\nGotti (June 15): He has the accent, and he can snarl with the best; it was only a matter of time before John Travolta would play a crime boss. To this: In this oft-delayed epic, he is John Gotti, kingpin of the Gambino crime family who ruled the Gambino roost for decades, avoiding justice for so long that he earned the moniker \"The Teflon Don.\" — Bob Mondello\n\nTag (June 15): This comedy looks like it might share some tonal DNA with The Hangover, as a group of friends reunite over the years to play a never-ending game of tag. Jeremy Renner, Jon Hamm, Hannibal Buress, Jake Johnson, Ed Helms, Leslie Bibb, Rashida Jones and Isla Fisher star. In other words: a lot of people we already know are funny, plus Jeremy Renner! -- Linda Holmes\n\nIncredibles 2 (June 15): The first Incredibles movie is the best superhero movie ever made (fight me) and will likely remain so forever (come at me). It's the purest distillation of the sense of fun and wonder that so many superhero films performatively reject. Who knows if Pixar will be able to reproduce that feat of cinematic alchemy, but they've got all the same ingredients — the entire voice cast is back, as is writer/director Brad Bird. — Glen Weldon\n\nSuperFly (June 15): Director X (formerly Little X) of hip-hop video fame helms a remake of the 1972 blaxploitation flick that was perhaps best known for its gazillion-selling soundtrack. Trevor Jackson plays drug dealer Youngblood Priest, a swoon-worthy leading role originally played by Ron O'Neal. Lex Scott Davis is his main squeeze. -- Bob Mondello\n\nEnlarge this image toggle caption Quantrell D. Colbert/CTMG/Sony Pictures Entertainment Quantrell D. Colbert/CTMG/Sony Pictures Entertainment\n\nJurassic World: Fallen Kingdom (June 22): When Jurassic World's long-dormant volcano comes roaring to lava-licious life, Chris Pratt and Bryce Dallas Howard decide to form a Dinosaur Rescue League. I mean, who wouldn't? Much running and screaming ensue. -- Bob Mondello\n\nUncle Drew (June 29): The premise is that a young guy (Lil Rel Howery) has to recruit a team of old men — played by NBA legends in old-age makeup — to play alongside his Uncle Drew (Kyrie Irving) in a big neighborhood game. This is such a stupendously strange idea for a comedy that I cannot wait to see it. Stars include Shaquille O'Neal, Nate Robinson, Chris Webber, Lisa Leslie, Reggie Miller, J.B. Smoove and an up-and-coming comedy actress you just might have heard of by the name of Tiffany Haddish. -- Linda Holmes\n\nAnt-Man and the Wasp (July 6): Before Thor: Ragnarok, 2015's Ant-Man was the Marvel movie that leaned hardest into a comedic tone. Given star Paul Rudd's comic chops, that was no surprise. What was surprising was how effective the film proved by dropping superhero tech into a ground-level, low-stakes heist plot. Ant-Man wasn't perfect — it didn't give co-star Evangeline Lilly enough to do, for example — but that much will be rectified in the sequel, when Lilly's character suits up. -- Glen Weldon\n\nEnlarge this image toggle caption Film Frame/Marvel Studios Film Frame/Marvel Studios\n\nSorry To Bother You (July 6): When down-and-out Cassius Green (Lakeith Stanfield) gets a job as a telemarketer, he quickly realizes that adopting a \"white voice\" is the key to professional success — but at a big personal cost. This sci-fi comedy is full of big ideas, handled in ways that feel fresh and inventive. Director Boots Riley will take you on an insane journey, helped along by a sharp-as-nails Tessa Thompson (as Cassius' artistic girlfriend), Steven Yeun (as the suave labor organizer Squeeze) and Armie Hammer (as a drugged-up, sinister boss). — Mallory Yu\n\nDon't Worry, He Won't Get Far On Foot (July 13): The title — a cartoon caption, spoken by a cowpoke as he looks at an empty wheelchair in the desert — reflects the sardonic take of Gus Van Sant's biopic on the post-accident attempts at sobriety of cartoonist John Callahan (Joaquin Phoenix). Callahan was left quadriplegic after a car crash but drew himself a new lease on life. Rooney Mara, Jonah Hill and Jack Black come along for the ride. -- Bob Mondello\n\nEnlarge this image toggle caption Scott Patrick Green/Courtesy of Amazon Studios Scott Patrick Green/Courtesy of Amazon Studios\n\nEighth Grade (July 13): With his feature film debut, comedian Bo Burnham has painted a snappy, tender portrait of an age that most of us might rather forget. Eighth Grade tells the story of 13-year-old Kayla (Elsie Fisher) as she navigates the tumultuous final weeks of junior high in the age of Instagram. For Kayla, that means struggling with mean girls, an embarrassingly supportive dad, an undervisited YouTube channel and plenty of adolescent body drama. It's an awkward but ultimately sweet homage to life and love in the time of puberty. — Alexi Horowitz-Ghazi\n\nSkyscraper (July 13): It wouldn't be an action-movie season without Dwayne \"The Rock\" Johnson running off a crane and leaping in a way that in reality would result in certain death but that in a movie results in a spectacular safe landing! (You can see it in the trailer.) I'm not here to tell you it's more than it appears. I'm here to tell you it's probably exactly as it appears. It comes out on July 13, so perhaps on the hottest day of the summer, you can sit with an Icee, forget your troubles and see The Rock save his family. — Linda Holmes\n\nBlindspotting (July 20): Collin (Daveed Diggs) is days away from finishing his probation when he witnesses a police shooting. Diggs and Rafael Casal wrote and star in this movie set in their hometown of Oakland, Calif., a city in the grips of gentrification. Director Carlos López Estrada offers a stylish, timely look at issues of race, class and changing cities. -- Nina Gregory\n\nEnlarge this image toggle caption Ariel Nava/Lionsgate Ariel Nava/Lionsgate\n\nFar From the Tree (July 20): This is a fascinating documentary look at how families deal with children who are not what they expected. Andrew Solomon wrote the best-seller on which the film is based, having been told by his parents that his gayness was a defect. Forty years later, he has seen that \"defect\" transformed into an identity, which leads him to look at other differences (autism, dwarfism) and ask how society decides what to cure and what to celebrate. -- Bob Mondello\n\nMamma Mia! Here We Go Again (July 20): Look, no one is saying that 2008's film adaptation of the ABBA jukebox musical was, you know, good — but its gorgeous Greek-island setting was great to look at, the cast seemed to be having a ball and there were those songs, after all (24 in all). The sequel kills off Meryl Streep and casts Lily James as a young version of her character in flashback. Also: Cher plays the Streep character's mother. Cher is 71, Streep is 68. Break into response groups and discuss. — Glen Weldon\n\nMission: Impossible — Fallout (July 27): Ethan Hunt (Tom Cruise) has been betrayed by his own government so often you never know what he is going to d ... oh, hell, sure you know: He is going to hang off cliffs and helicopters, race around world capitals on a BMW R nineT motorcycle, get drowned, burned and pummeled, and do enough of his own stunts to get seriously injured (a leap to a rooftop got him hospitalized during filming). -- Bob Mondello\n\nTeen Titans Go! To The Movies (July 27): Cartoon Network's funny, frenetic and freewheeling animated series about DC Comics' team of teenage superheroes who live together in a giant T (long story) finally goes Hollywood. The show's animation is bright and fizzy, but it's the writing, grounded in a deep — and deeply irreverent — love of these characters, that makes it all work. The movie's plot involves the Titans getting their big break in Hollywood; look for lots of film parodies. -- Glen Weldon\n\nThe Spy Who Dumped Me (Aug. 3): Another summer comedy that could go in a variety of directions but at least starts with a good cast. This one stars Mila Kunis and Kate McKinnon in what seems to be a James Bond sendup that begins when Kunis' ex-boyfriend (Justin Theroux) turns out to be something other than what he appeared. We can only hope it might recapture some of the BFF action comedy power we got from The Heat. -- Linda Holmes\n\nCrazy Rich Asians (Aug. 17): Director Jon Chu adapts the first novel of Kevin Kwan's hugely successful trilogy in a film starring Constance Wu (Fresh Off the Boat), Michelle Yeoh, Henry Golding, Awkwafina, Jimmy O. Yang and others. Any popular novel adaptation would be big news, but there are so few studio films with largely Asian and Asian-American casts that this one will particularly stand out. — Linda Holmes\n\nJuliet, Naked (Aug. 17): Juliet, Naked began life as a Nick Hornby novel in 2009. Interestingly, while Hornby has become a highly successful screenwriter adapting other people's works (he wrote the screenplays for Brooklyn, Wild and An Education), he didn't write the screenplay here. Instead, it was written by Tamara Jenkins, Evgenia Peretz and Phil Alden Robinson (Field of Dreams). Here, Ethan Hawke plays a musician whose biggest fan (Chris O'Dowd) has imperiled his relationship with his girlfriend (Rose Byrne) over his fandom. — Linda Holmes\n\nPapillon (Aug. 24): Two of prestige television's leading men, Charlie Hunnam (Sons of Anarchy) and Rami Malek (Mr. Robot) star in this remake of the Steve McQueen/Dustin Hoffman drama about two men who meet in prison and dream of escape. I saw it at the Toronto Film Festival, and while it didn't make an enormous splash there, both of the leads are quite good and the story remains a compelling one. — Linda Holmes\n\nNicole Cohen produced this story.", "images": ["https://media.npr.org/assets/img/2018/05/03/bc02890-822r4_wide-78a4035a510d34303da049400c9ea7cc26809981-s1100-c50.jpg", "https://media.npr.org/assets/img/2022/09/23/invisibilia_tile_npr-network-01_sq-2382fccb673e33b6a484c55ddf092554dc1dd2fe-s100-c100.jpg", "https://media.npr.org/assets/img/2018/04/30/superfly-dom-df-00157_r_rgb_wide-0aefccb5c7638cdafc2e38aad6453b36d723b9da-s1100-c50.jpg", "https://media.npr.org/assets/img/2018/04/30/summer-movie-composite-3_wide-bf690f972c9266d860a39e35cee15b09cdb3b1a7-s1100-c50.jpg", "https://media.npr.org/chrome_svg/music-logo-light.svg", "https://media.npr.org/chrome_svg/npr-logo.svg", "https://media.npr.org/assets/img/2022/09/23/planet-money_tile_npr-network-011_sq-931aa24b5dd8a691a73c0f0aa2541322c8104add-s100-c100.jpg", "https://media.npr.org/assets/img/2018/04/30/o8-11265r_wide-99f63ec1f300ba0d41851a5a8c7aa1f6efb3c423-s1100-c50.jpg", "https://media.npr.org/assets/img/2018/04/30/4d-1byiyi_wide-117b827f994203e506e31cad38d5cf406badabe2-s1100-c50.jpg", "https://media.npr.org/chrome/programs/logos/up-first.jpg?version=2", "https://media.npr.org/chrome/programs/logos/morning-edition.jpg", "https://media.npr.org/assets/img/2018/04/23/mlu-19833_r1_sq-4985a4bc656de7dc376498258be8d067708b224a-s100-c15.jpg", "https://media.npr.org/assets/img/2019/03/07/lindaholmes_sq-6a7868287e9c1fd66b113de0a51d12d1c5e53379-s100-c85.jpg", "https://media.npr.org/chrome/programs/logos/fresh-air.png", "https://media.npr.org/assets/img/2022/09/22/book-of-the-day_tile_npr-network-01_sq-624a7585e5bbea1a1294f5da2f5a96927829ad1c-s100-c100.jpg", "https://media.npr.org/assets/img/2022/09/23/life-kit_tile_npr-network-01_sq-200388bae100cab944ffa3655e7f3119e026d305-s100-c100.jpg", "https://media.npr.org/assets/img/2018/04/30/cbl-08564_r2_wide-1f55f5b8c1db2391716e46f6ac9e7d11d27bf5f1-s1100-c50.jpg", "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesun_sq-4a03b35e7e5adfa446aec374523a578d54dc9bf5-s100-c85.png", "https://media.npr.org/assets/img/2011/12/30/bobmondello_60_sq-d8647d0477c52ceb5e5193a0e239338cac7d95a1-s100-c85.jpg", "https://media.npr.org/chrome_svg/music-logo-dark.svg", "https://media.npr.org/assets/img/2019/02/26/we_otherentitiestemplatesat_sq-cbde87a2fa31b01047441e6f34d2769b0287bcd4-s100-c85.png", "https://media.npr.org/branding/series/pop-culture-happy-hour/branding_main-79966c98409c74455e9bc9e5b129fb4f2c980178-s1000-c100.png", "https://media.npr.org/assets/img/2019/03/21/npr_glenn_weldon_001_sq-2f907d1edc55d90534a7ab6e9e1e388a3c9a3853-s100-c85.jpg", "https://media.npr.org/chrome/programs/logos/all-things-considered.png", "https://media.npr.org/assets/img/2018/04/30/summer-movie-composite-3_wide-bf690f972c9266d860a39e35cee15b09cdb3b1a7-s1400-c100.jpg", "https://media.npr.org/assets/img/2018/04/30/don-t-worry-he-won-t-get-far-on-foot-001_dont_unit_00005r_rgb_wide-c33769cf44efaff52ba68e22f4a91211bb492bea-s1100-c50.jpg"], "top_img": "https://media.npr.org/assets/img/2018/04/30/summer-movie-composite-3_wide-bf690f972c9266d860a39e35cee15b09cdb3b1a7-s1400-c100.jpg", "keywords": [], "authors": ["Glen Weldon", "Linda Holmes", "Bob Mondello"], "canonical_link": "https://www.npr.org/2018/05/14/605265626/nprs-summer-movie-guide-27-films-coming-your-way", "title": "NPR's Summer Movie Guide: 27 Films Coming Your Way", "meta_data": {"google-site-verification": "1VqzbDm4ukeFVHOoq5LjIKA2fVKZD-EYv8cXZhKXSfU", "robots": "noarchive,index,follow,max-image-preview:large", "apple-itunes-app": "app-id=324906251, app-argument=https://www.npr.org/2018/05/14/605265626/nprs-summer-movie-guide-27-films-coming-your-way", "Rating": "General", "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "date": "2018-05-14", "description": "As ever, the Summer Movie Season is dominated by sequels and special effects. But if you're prepared to look for them, you'll find some smaller, quirkier films flying beneath the radar.", "og": {"title": "NPR's Summer Movie Guide: 27 Films Coming Your Way", "url": "https://www.npr.org/2018/05/14/605265626/nprs-summer-movie-guide-27-films-coming-your-way", "type": "article", "description": "As ever, the Summer Movie Season is dominated by sequels and special effects. But if you're prepared to look for them, you'll find some smaller, quirkier films flying beneath the radar.", "image": "https://media.npr.org/assets/img/2018/04/30/4d-1byiyi_wide-117b827f994203e506e31cad38d5cf406badabe2-s1400-c100.jpg", "site_name": "NPR.org"}, "fb": {"app_id": 138837436154588, "pages": 10643211755}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "title": "NPR's Summer Movie Guide: 27 Films Coming Your Way", "site": "@NPR", "domain": "npr.org", "image": {"src": "https://media.npr.org/assets/img/2018/04/30/summer-movie-composite-3_wide-bf690f972c9266d860a39e35cee15b09cdb3b1a7-s1400-c100.jpg"}}}, "movies": [], "publish_date": 1526252400.0, "source": "https://www.npr.org", "summary": ""}