{"url": "https://www.bustle.com/p/the-pretty-little-liars-cast-is-just-as-emotional-over-the-series-finale-as-fans-are-photos-67064", "text": "It's hard to believe that after seven seasons of torture (for both the characters and fans), Pretty Little Liars is officially coming to an end. The drama created by I. Marlene King has certainly brought a lot to the small screen, including a series focusing on a group of young woman, which shows that a predominantly female cast can do great things when given the chance. It definitely is a sad day, but not just for fans. The PLL cast is emotional about the series finale, too.\n\nEven though the cast wrapped last October, June 27 is still a sad time for them. The series has been a huge part of their lives. To know that the two-hour finale will be the last episode of PLL to air has to be somewhat difficult. On the other hand, they also have to be breathing a sigh of relief in knowing they no longer have to keep quiet about show secrets or what's to come in the future. But, overall, they all are understandably emotional.\n\nMany of the Freeform stars have taken to social media to express how much PLL has meant them, to reminisce about the good old days, to thank fans for making the show a huge success, and to, of course, say goodbye. If you're not ready to bid PLL adieu, then you probably won't be able to handle these posts. You might want to read the following with a box of tissues.\n\nIan Harding\n\nFirst of all, this is probably the best picture there is of Harding as Ezra Fitz, right? Just look at that cheesy smile. Fans will probably also appreciate his caption, which partly reads, \"This picture was taken in between takes of the noir episode and pretty much sums up how I want to remember my experience on PLL: looking classy while having the most hilarious time of my life.\" He's also shared a few other behind-the-scenes pictures on Instagram, so be sure to check those out.\n\nSasha Pieterse\n\nBased on her lengthy response, it's clear that Pieterse will never forget her time as Alison DiLaurentis. In between talking about how the end is a \"bittersweet moment,\" she sweetly thanked the fans, saying, \"You have made every second possible, worth it, gratifying, touching, and especially memorable. We truly shot every season, episode, scene, and second for you. You will always have a place in my heart.\"\n\nTroian Bellisario\n\nLike Pieterse, Bellisario had a lot to say on Instagram. \"Being Spencer Hastings in this crazy world is something I still don't quite understand, but I know it was a rare and beautiful gift,\" she wrote. \"A gift that will continue to give for the rest of my days on this Earth. And I wanted to say THANK YOU to all of the people who gave it to me.\" Well, fans most likely want to thank Bellisario for bringing Spencer to life, right?\n\nLucy Hale\n\nWow. They look so little, don't they? Hale found it best to express her feelings with a short post, because saying goodbye to something that means so much to her has actually left her \"speechless.\" As she said, \"For me to be speechless says a lot, but I'm finding it hard to find the words to express my gratitude to every single person that made this show a success.\" That's something probably many fans can relate to.\n\nKeegan Allen\n\nLeave it to Allen to say goodbye with a post dedicated to the women of the show. \"As we all say goodbye to @prettylittleliars tomorrow, let's take the time to honor these powerful women that brought all of us together. ALL of us.\" That's right, the show wouldn't be anything without the women.\n\nShay Mitchell\n\nIf you're a Beatles fan, then you should like Mitchell's Instagram very much. \"The streets of Rosewood will always feel like home,\" she began her post. \"I will hold each of these girls close to my heart always, as I will Emily. She changed me as a person and I will never be able to say thank you enough.\" It's probably safe to say that many viewers are thankful for Emily, as well.\n\nAshley Benson\n\nThis photo shared by Benson is almost too much to handle. Do you see the tears in their eyes? To know that they appreciate the fans so much means a lot.\n\nJanel Parrish\n\nParrish's Instagram is one that deserves a round of applause. \"To these ladies...I'll miss working alongside such beautiful and powerful women,\" she beautifully wrote. \"You are all fearless warriors, my sisters.\" Amen, Janel. Amen.\n\nVanessa Ray\n\nLike Parrish, Ray gets what PLL is all about. \"Thank you to all of the amazing @prettylittleliars fans for watching this show about extraordinary women.\" Enough said.\n\nI. Marlene King\n\nDo you need a tissue yet?\n\nPLL, you will be missed.", "images": ["https://imgix.bustle.com/uploads/image/2022/10/7/5d8f0698-b98b-460f-86bb-87733a815208-164650_6498_rv3.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2022/10/7/ee2c977e-15a4-4dce-b29a-4ca9be003046-met0002_101_comp_ste_v0002_r709_bw_8fe3b57a.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/7/242ace90-a761-407f-a76d-5201e9586714-screenshot-2022-10-07-at-180650.png?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/4/bc073da7-054f-4474-9c19-edcb8ba59535-rpaz_s1_ut_210709_gramat_00445_r3_700.JPG?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2017/6/27/10ac1f6a-85c5-444b-8db8-49cf47bacb59-getty-479428213.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2017/6/27/10ac1f6a-85c5-444b-8db8-49cf47bacb59-getty-479428213.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/6/27/10ac1f6a-85c5-444b-8db8-49cf47bacb59-getty-479428213.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/the-pretty-little-liars-cast-is-just-as-emotional-over-the-series-finale-as-fans-are-photos-67064", "title": "The 'Pretty Little Liars' Cast Is Just As Emotional Over The Series Finale As Fans Are — PHOTOS", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@AllysonKoerner"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/the-pretty-little-liars-cast-is-just-as-emotional-over-the-series-finale-as-fans-are-photos-67064", "type": "article", "title": "The 'Pretty Little Liars' Cast Is Just As Emotional Over The Series Finale As Fans Are — PHOTOS", "description": "It's hard to believe that after seven seasons of torture (for both the characters and fans), Pretty Little Liars is officially coming to an end. The drama created by I. Marlene King has certainly brought a lot to the small screen, including a series…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/6/27/10ac1f6a-85c5-444b-8db8-49cf47bacb59-getty-479428213.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "It's hard to believe that after seven seasons of torture (for both the characters and fans), Pretty Little Liars is officially coming to an end. The drama created by I. Marlene King has certainly brought a lot to the small screen, including a series…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}