{"url": "https://www.elle.com/culture/movies-tv/a18696919/sabrina-reboot-guide/", "text": "Everything old is new again, if the latest TV reboot craze is to be believed. We have Netflix to thank for a lot of these redos: from '80s family classic Full House's return with Fuller House to early-aughts pop culture staple Gilmore Girls, revisited for the four-part Gilmore Girls: A Year in The Life, and now, everyone’s favorite teenage witch is returning to screens.\n\nNetflix has now greenlit two seasons of a Sabrina the Teenage Witch reboot, based largely on the Archie Comics series The Chilling Adventures of Sabrina. We did some digging to find out all there is to know about the reboot ahead of its release.\n\nThe show will stream on Netflix.\n\nThe as of yet titled Sabrina series was initially developed as a series for the CW, but last December, Netflix confirmed that the reboot is heading to the streaming service instead. \"Sabrina is coming to Netflix and she might just out-brood Jughead. Don't @ me about talking cats (yet),\" the streaming service announced on Twitter.\n\n\n\n\n\nNetflix greenlit two straight-to-series seasons of the Sabrina project, which means fans won't have to wait long between seasons.\n\nHere's the very cool, spooky, retro-style art:\n\nThe Riverdale showrunner is penning the new series.\n\nRiverdale showrunner and chief executive officer of Archie Comics Roberto Aguirre-Sacasa has signed on to pen the upcoming Sabrina series. In addition to writing it, Aguirre-Sacasa will direct and produce the series, and he will be joined by fellow Riverdale collaborators Greg Berlanti, Sarah Schechter, Jon Goldwater, and Lee Toland Krieger.\n\nIt will be called Chilling Adventures of Sabrina.\n\nAguirre-Sacasa confirmed that the show will have a similar name as the comics. He tweeted in May that the show will officially be called Chilling Adventures of Sabrina, along with a photo of the titular character.\n\nThe new trailers are scary as hell.\n\nOn October 3, Netflix released a trailer that showed Sabrina's teenage dilemma in all its weird, witchy, scary goodness.\n\nThen, we got a terrifying look at Salem, who comes through Sabrina's window one dark night, and is definitely not just your average cat:\n\nIt's premiering just in time for Halloween.\n\nAccording to the official CAOS Instagram account, we'll be meeting the new Sabrina and co. on October 26. The post features multiple \"Sabrina\" look-a-likes on some sort of stage, wearing Letterman jackets that spell out the premiere date. Does this mean we may be getting a musical episode à la Riverdale?\n\n\n\nNetflix left this comment on the post: \"Omg I've never wanted summer to end as much as I do now. Can not wait.\"\n\nCouldn't have said it better myself.\n\nThe show will feature new faces.\n\nMelissa Joan Hart, who played the titular heroine in the original says she feels “indifferent” about the new direction of the show but may still be interested in finding her “fit” in the new series in the future. But the show has nabbed a new actress to carry on the title character's legacy. Mad Men's Kiernan Shipka will play Sabrina while Australian actress Miranda Otto (Homeland) will take on the role of Aunt Zelda Spellman and English actress Lucy Davis (Wonder Woman) will play Aunt Hilda Spellman.\n\nRoss Lynch and Nate Richert. Getty + Erik Tanner + ABC // Getty Images\n\nWe knew that Sabrina's love interest, Harvey Kinkle, would be making a comeback. Aguirre-Sacas tweeted a page of the Sabrina script last October, which confirmed our hopes. This time around, he'll be played by former Disney star Ross Lynch, who recently showed us his dark side in My Friend Dahmer.\n\nLynch is already leaning into his new persona. Just like the Riverdale stars dyed their hair to match their iconic characters, he recently changed his look from platinum blonde to dark brown (like the original Harvey). He even took it a step further and changed his Instagram profile picture to the cartoon version of his character, from Sabrina: The Animated Series.\n\nActor Ross Lynch changed his Instagram profile image to the cartoon version of Harvey Kinkle. Instagram\n\nIn this version of the show, Harvey is the son of a coal miner, Deadline reports, and he is blissfully unaware of Sabrina's powers (just like in the original show). It sounds like he'll still be the all-American high school boy we loved in the original; Harvey was played by Nate Richert in the '90s version.\n\nOther cast members include Chance Perdomo, who will introduce the new character of Sabrina's cousin Ambrose to the world, and Michelle Gomez as Sabrina's teacher Mary Wardell. One more clue about the show's dark side comes with the casting of Richard Coyle as Father Blackwood. According to Deadline, Blackwood is a high priest in the Church of Night, and has dark secrets that may set him up as a villain.\n\nSalem, the family's wise-talking cat, was played by a puppet and voiced by Nick Bakay in the original series. It looks like he's going to be a real kitty this time, though:\n\nChilling Adventures of Sabrina's official Twitter account released some creepy footage of Sabrina's famous black cat on September 4, and it's pretty clear that Sabrina fans won't be seeing the same sarcastic talking cat in the reboot's Salem.\n\n\"Here kitty kitty,\" reads the caption on the thermal-filtered clip. The show's Twitter account also called him \"the best demon a witch could ask for.\" In the original Sabrina series, Salem was a witch sentenced to live as a cat, so it looks like Sabrina's feline companion will be very different in 2018.\n\nPrudence, Sabrina's adversary, will be played by Tati Gabrielle, who stars in CW's apocalyptic drama The 100. Deadline describes Prudence as the \"beautiful and cunning\" ringleader of the Weird Sisters and will apparently harbor a \"deep, personal, and possibly life-threatening grudge\" against the titular teenage witch.\n\nThe reboot will be nothing like the original family comedy.\n\nThe beloved '90s sitcom was a light-hearted family comedy but the new reboot departs from its comedy roots and veers towards dark thriller territory, much like its companion series Riverdale. Aguirre-Sacasa said the new version \"is a darker, more macabre version of Sabrina.\"\n\nLynch confirmed the new vibe in an interview with Entertainment Tonight. Despite not having seen the original sitcom he studied up on Aguirre-Sacasa's vision with the latest comics and says that the show will follow that style. \"Our show is really different,\" he said comparing it to the original.\n\nDon't get your hopes up for a Sabrina/Riverdale crossover.\n\nDespite delivering what appeared to be a back door pilot in Riverdale's \"Chapter Twenty: Tales from the Darkside,\" and hinting at the creepy nature of the neighboring city, Sabrina's hometown of Greendale, Lynch says we shouldn't expect the two shows to overlap.\n\n\"There's no talks of a crossover right now, [and] I don't know if there ever would be one because the shows are on different networks,\" Lynch told Entertainment Tonight. But he followed up by saying, \"Anything's possible.\"\n\nMelissa Joan Hart gave the new series her stamp of approval.\n\nSequels and reboots are often frowned upon but Melissa Joan Hart supports Netflix's Sabrina reboot and gave it her stamp of approval while speaking to Entertainment Weekly earlier in February. \"I think they’re doing it in a smart way—change it up, don’t make it the same,\" she offered. \"If you’re going to do the same show, it probably would fall on its face, but I think what they’re doing is probably the smartest way to reboot something.”\n\nAnd Twitter approves as well.\n\nThe Sabrina Instagram account is worth keeping an eye on.\n\n@sabrinanetflix has a moody tone, full of pentagrams and blood-red moons, further reinforcing the fact that this isn't the same Sabrina we remember. Right now, it's counting down the days until the show's premiere with new photos every day.\n\nShipka makes multiple appearances in character and shares a message to fans:\n\nSneak peek photos reveal some very dark magic happening in the woods.\n\nNetflix blessed Sabrina fans with newly released screen grabs on August 13—and they will only make you more excited. One photo shows Sabrina channeling her inner Little Red Riding Hood in a dark wood carrying what appears to be a bell in one hand and a log in the other (???). The second photo pictures Sabrina looking a little vulnerable in a white slip during some kind of witchy ceremony.\n\nNetflix\n\nNetflix\n\nThe first episode will be about Sabrina's \"Dark Baptism\"—a witch's version of a Sweet Sixteen.\n\nPer an interview with Vulture, Kiernan Shipka revealed that the first episode of the show will take place on the eve of Sabrina's 16th birthday. But instead of cake and candles, the Spellman family will celebrate Sabrina's Dark Baptism, in which she's expected to sign her name in Satan’s book and renounce her mortality. Shipka didn't divulge whether or not Sabrina embraces satanic witchcraft with full force, but she did hint that it's safe to assume Sabrina will combat an inner moral struggle.\n\nSabrina will be proudly feminist.\n\nShipka told Vulture that Sabrina will run a club at her (mortal) high school called the Women’s Intersectional Cultural and Creative Association (WICCA), and the feminist fury doesn't stop there. Part of Sabrina's struggle with pledging herself to Satan (as her aunts expect her to do) is that it kind of, sort of feels like embracing the patriarchy.\n\n“I have reservations about saving myself for the Dark Lord,\" Sabrina says in one episode. \"Why does he get to decide what I do or don’t do with my body?”\n\n\n\nThe reboot will reprise all of your favorite characters, including Aunt Hilda, Aunt Zelda, and Harvey Kinkle.\n\nThe Chilling Adventures of Sabrina might be a *touch* darker than the original Teenage Witch series, but fans of the OG Sabrina will still see some familiar faces in the reboot. Per Mashable, the Netflix series will include Aunts Hilda and Zelda (Lucy Davis and Miranda Otto) as Sabrina's guardians.\n\nLucy Davis as Aunt Hilda. Dean Buscher/Netflix\n\nMiranda Otto as Aunt Zelda. Diyah Pera/Netflix\n\nThe Chilling Adventures of Sabrina also revives everyone's favorite oblivious teenage heartthrob, Harvey Kinkle (Ross Lynch). Just like in the original, Harvey is Sabrina's mortal high-school boyfriend, whom she's expected to renounce (along with her own mortality) during the first episode, which takes place during Sabrina's \"Dark Baptism\" ceremony (i.e. a witch's Sweet 16).\n\nRoss Lynch as Harvey Kinkle. Diyah Pera/Netflix\n\nNerisha Penrose Beauty Commerce Editor Nerisha is the beauty commerce editor at ELLE.com, covering all things beauty (and fashion and music). She has a penchant for sneakers and nude lip glosses, and spends way too much time re-watching 90s sitcoms.", "images": ["https://hips.hearstapps.com/hmg-prod/images/screen-shot-2022-07-25-at-11-17-40-am-1658762275.png?crop=0.418xw:1.00xh;0.236xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/emma-d-arcy-1665164132.jpg?crop=0.668xw:1.00xh;0.245xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/elle-sarbina-the-teenage-witch-harvey-1521062162.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/sabrina2-embed-1534170242.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/blonde-01-41-16-09-1-1664575541.jpg?crop=0.755xw:1.00xh;0.123xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/caos-vertical-teenagedream-pre-us-1539274869.jpg?crop=1xw:0.6056666666666667xh;center,top&resize=1200:*", "https://hips.hearstapps.com/vidthumb/images/2019-elle-songassociation-ep93-lewiscapaldi-jp-cm-kk-v3-ap-v2-1575927996.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/luckiest-girl-alive-jessica-knoll-1665088185.jpg?crop=0.5xw:1xh;center,top&resize=180:*", "https://www.elle.com/_assets/design-tokens/elle/static/images/logos/network-logo.a5366f4.svg", "https://hips.hearstapps.com/hmg-prod/images/elle-sabrina-teenawge-witch-kirnan-shipka-getty-1519666208.jpg?crop=0.5xw:1xh;center,top&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/cas-101-unit-00741r-1537201743.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/tmc-107-unit-04108r-1665178520.jpg?crop=0.668xw:1.00xh;0.151xw,0&resize=180:*", "https://hips.hearstapps.com/vidthumb/fc847fa5-f55a-482c-8732-63048541a5b3/thumb_1920x1080_00002_1664987006_12835.jpg?crop=0.5625xw:1xh;center,top&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/sabrina-embed-1534170271.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/tml-105-js-01374rt-1664382829.jpg?crop=1.00xw:0.668xh;0,0.0833xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/elm100122cethomas-001-1-1663357851.jpg?crop=1xw:1xh;center,top&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2018-03-22-at-2-08-08-pm-1521742122.png?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/cas-107-unit-00984r-1537201650.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/dragons-hotd-1-1663005412.png?crop=0.502xw:1.00xh;0.259xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/hp2-ff-021-1656430894.jpg?crop=0.454xw:1.00xh;0.293xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/cas-101-unit-00396r4-1537201962.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/ciw-unit-12862-r-jpg-1664898600.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/harvey-sadler-emma-d-arcy-leo-hart-1664752895.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=180:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/caos-vertical-teenagedream-pre-us-1539274869.jpg?crop=1xw:0.6056666666666667xh;center,top&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.elle.com/culture/movies-tv/a18696919/sabrina-reboot-guide/", "title": "Chilling Adventures of Sabrina Cast, Spoilers, Air Date", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Sabrina TV Show Netflix Reboot Guide - Chilling Adventures of Sabrina Cast, Spoilers, Air Date", "description": "Sabrina's back soon on Netflix and a lot more different than you remember. It's been years since we last saw the teen witch and her two aunts on the screen, and here's what you need to know about the show.", "keywords": "Sabrina, sabrina the Teenage Witch, Melissa Joan Hart, sabrina season 3, sabrina news, sabrina tv show, sabrina release date, sabrina spoilers, sabrina cast, sabrina theories, sabrina predictions, chilling adventures of sabrina", "theme-color": "#000000", "og": {"site_name": "ELLE", "title": "Salem Is Absolutely Terrifying in Netflix's 'Sabrina' Reboot", "description": "This kitty will give you nightmares.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/caos-vertical-teenagedream-pre-us-1539274869.jpg?crop=1xw:0.6056666666666667xh;center,top&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.elle.com/culture/movies-tv/a18696919/sabrina-reboot-guide/", "type": "article"}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "section": "Movies & TV 2022", "modified_time": "2021-11-29T19:11:25Z", "published_time": "2018-10-11T16:04:00Z"}, "twitter": {"site": "@ELLEmagazine", "image": "https://hips.hearstapps.com/hmg-prod/images/caos-vertical-teenagedream-pre-us-1539274869.jpg?crop=1xw:0.6056666666666667xh;center,top&resize=640:*", "card": "summary_large_image"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/caos-vertical-teenagedream-pre-us-1539274869.jpg?crop=0.825536598789213xw:1xh;center,top&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/caos-vertical-teenagedream-pre-us-1539274869.jpg?crop=0.825536598789213xw:1xh;center,top&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/caos-vertical-teenagedream-pre-us-1539274869.jpg?crop=0.825536598789213xw:1xh;center,top", "auto-publish": "timely", "sailthru.excerpt": "Everything old is new again, if the latest TV reboot craze is to be believed. We have Netflix to thank for a lot of these redos: from '80s family classic Full House's return with Fuller House to early-aughts pop culture staple Gilmore Girls, revisited for the four-part Gilmore Girls: A", "sailthru.tags": "culture,Culture,movies-tv,Movies & TV 2022", "sailthru.date": "2018-10-11 16:04:00", "sailthru.socialtitle": "Salem Is Absolutely Terrifying in Netflix's 'Sabrina' Reboot", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 46}, "movies": [], "publish_date": 1539273840.0, "source": "https://www.elle.com", "summary": ""}