{"url": "https://www.independent.co.uk/extras/indybest/fashion-beauty/best-serums-for-face-dry-skin-sensitive-oily-dehydrated-2016-a7171461.html", "text": "Sign up to our free weekly newsletter for insider tips and product reviews from our shopping experts Sign up for our free IndyBest email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyBest email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nPacked full of active ingredients, serums are one of the most vital steps of your skincare routine – particularly when it comes to anti-ageing.\n\nWith many not realising their importance, these skincare saviours are the ones often left out of your regimen. Yet, it’s such a simple step – nestling neatly between your toner and moisturiser, these potent formulas do so much more than a regular moisturiser.\n\nGiven the strength and density of the crucial ingredients in their make-up, they can perform skin-saving miracles – targeting fine lines, wrinkles, hyperpigmentation, dark spots and dullness – to ultimately achieve a more youthful look.\n\nYou’ll want to look for serums with ingredients rich in vitamins, minerals and antioxidants. Serums with these tend to offer a more natural attempt at plumping, firming, and stimulating collagen production. It’s also worth looking out for green tea, berries and marine-inspired skincare.\n\nWe also recommend using products that contain hyaluronic acid and retinol. The former not only hydrates the skin but simultaneously adds a smoothing and plumping effect, while the latter is considered the best anti-ageing ingredient around.\n\nRead more:\n\nRetinol gets to work on the surface of the skin, focusing on skintone and texture, as well as going deeper and stimulating cell renewal. However, exercise caution as those with sensitive or dry skin might find this causes irritation or flakiness.\n\nYou should also pay close attention to the texture of your serum. The lighter and faster to absorb it is, the easier it will be to add into your skincare routine. Plus, for those who have sensitive or oily skin, having a lighter-weight serum will definitely be a bonus as you’ll want to minimise the feeling of the products you’re piling on your face.\n\nStill, with so many brands putting their best foot forward, it’s hard to know which is the best. So, we’ve narrowed it down to the top 14, taking into account the different skincare anti-ageing concerns that each serum addressed.\n\nThe best anti-ageing serums of 2022 are:\n\nBest overall – Elemis pro-collagen super serum elixir: £53, Elemis.com\n\n– Elemis pro-collagen super serum elixir: £53, Elemis.com Best for improving texture – Charlotte Tilbury Charlotte’s magic serum crystal elixir: £60, Charlottetilbury.com\n\n– Charlotte Tilbury Charlotte’s magic serum crystal elixir: £60, Charlottetilbury.com Best vitamin C serum – Kiehl’s powerful-strength line-reducing concentrate: £54, Selfridges.com\n\n– Kiehl’s powerful-strength line-reducing concentrate: £54, Selfridges.com Best retinol serum – TempleSpa trufflelixir anti-ageing retinol serum: £80, Templespa.com\n\n– TempleSpa trufflelixir anti-ageing retinol serum: £80, Templespa.com Best for those in their 50s – Estée Lauder advanced night repair: £82, Boots.com\n\n– Estée Lauder advanced night repair: £82, Boots.com Best for sensitive skin – Dr. Levy Switzerland booster serum: £266.50, Facethefuture.co.uk\n\n– Dr. Levy Switzerland booster serum: £266.50, Facethefuture.co.uk Best for fine lines – Skin Generics retinol anti-aging serum: £27.99, Amazon.co.uk\n\n– Skin Generics retinol anti-aging serum: £27.99, Amazon.co.uk Best for pigmentation – Osmosis MD rescue epidermal repair serum: £109, Shop.dermoi.com\n\n– Osmosis MD rescue epidermal repair serum: £109, Shop.dermoi.com Best for mature skin – Comfort Zone sublime skin serum: £80, Lookfantastic.com\n\n– Comfort Zone sublime skin serum: £80, Lookfantastic.com Best for plumping – RéVive intensité complete anti-ageing serum: £380, Harrods.com\n\n– RéVive intensité complete anti-ageing serum: £380, Harrods.com Best for dull skin – Skin Woof premium vitamin C radiance serum: £23.95, Skinwoof.com\n\n– Skin Woof premium vitamin C radiance serum: £23.95, Skinwoof.com Best gentle serum – Verso super facial serum: £88, Thegroomingclinic.com\n\n– Verso super facial serum: £88, Thegroomingclinic.com Best for inflammation – Goldfaden MD needle-less line smoothing concentrate: £100, Spacenk.com\n\n– Goldfaden MD needle-less line smoothing concentrate: £100, Spacenk.com Best value for money – Sienna X the retinol serum: £33.00, Beyondbeautiful.com\n\n– Sienna X the retinol serum: £33.00, Beyondbeautiful.com Best for wrinkles – Elemis ultra smart pro-collagen complex 12 serum: £131.95, Allbeauty.com\n\nElemis pro-collagen super serum elixir, 15ml Best: Overall As a serum with a silk-like texture, this felt so hydrating from the moment it was applied. With hyaluronic acid locking in a level of nourishment, it also helps reduce the visibility of fine lines and wrinkles. Initially it felt a little oilier than some of the other serums, however, it was fast-absorbing and left no stickiness on our skin. It’s also a serum with a gorgeous scent and we felt so relaxed during this part of the skincare regimen. Key ingredients in this super serum include a high percentage of padina pavonica and red seaweed, as well as tri-peptides and African birch bark. It’s good value for how much this serum packs in, however, it must be noted it is at least half the size of some of the other serums we tested. But a little goes a long way and this potent blend is definitely small but mighty. Buy now £53 Elemis.com {{#hasItems}} Price comparison {{#items}} {{ merchant }} £{{ price }} Buy now {{/items}}\n\nCharlotte’s magic serum crystal elixir, 30ml Best: For improving texture We immediately liked how easy this serum was to use. The addition of a pipette ensures the solution is clean, easy and efficient to apply while the product itself is silky, lightweight and not at all oily. It also smells divine and immediately relaxed us while feeling refreshing. Plus, in the hours after applying, our skin felt amazing – practically soft to the touch. This serum contains polyglutamic acid (a hydrating hero), as well as replexium, which is Charlotte Tilbury’s peptide duo for laser-focus wrinkle targeting. It has been created to completely rejuvenate your face, offering visibly younger skin with daily use. The serum also contains sqisandryl – an antioxidant berry that improves the vitality of the skin. Our skin was left glowing, and it also showed a significant improvement in texture. Buy now £60 Charlottetilbury.com {{#hasItems}} Price comparison {{#items}} {{ merchant }} £{{ price }} Buy now {{/items}}\n\nKiehl’s powerful strength line-reducing concentrate serum, 50ml Best: Vitamin C serum Even though we used this serum more sparingly than others, we still noticed a difference in our skin. Creamy in texture, it melted in effortlessly and left skin visibly brighter, reduced the size of our pores and helping create an overall more even skin tone. That effect stayed for hours and even held up under make-up. However, a word of caution – this serum contains 12.5 per cent of vitamin C and we found that our skin tingled slightly upon application. That sensation didn’t last for long, mind, but as it’s not something that agrees with all skin types we recommend building up your usage. Plus, while we’d always recommend following up with a decent SPF cream, it’s all the more important here. Once you get your dosage right though we promise you’ll be left with beautifully moisturised and hydrated skin. Buy now £54 Selfridges.com {{#hasItems}} Price comparison {{#items}} {{ merchant }} £{{ price }} Buy now {{/items}}\n\nTempleSpa trufflelixir anti-ageing retinol serum, 30ml Best: Retinol serum Even though there was a slight stickiness and a tingling sensation upon our first application, this product immediately felt amazing on our skin. Soft and light in texture with a beautiful scent, this high-performance formula promotes both long and short-term results. The brand maintains that this serum treats the skin at a cellular and epidermal level to brighten it. Plus, it aims to reduce the signs of ageing by smoothing, firming and plumping all in one go. We also noted that when we didn’t apply make-up afterwards, our skin stayed silky smooth for hours. It is a little pricier than some of the brand’s other products – its “be firm” serum is more than £30 cheaper (£40, Templespa.com) – but we’re still won over. Buy now £80 Templespa.com {{#hasItems}} Price comparison {{#items}} {{ merchant }} £{{ price }} Buy now {{/items}}\n\nEstée Lauder advanced night repair, 50ml Best: For those in their 50s Compared to the other oil-based serums on this list, this was slightly lighter in colour. As well as its translucency, we noticed that it didn’t have a fragrance, and it was quite a bit stickier to touch. That said, upon regular use, our skin definitely felt more hydrated and was visibly plumper. It aims to blur the skin, making it look smoother in appearance, and address fine lines and wrinkles. We definitely think it delivers and thought our skin looked much clearer and healthy-looking. An added benefit of the advanced night repair is that the serum formula is also designed to act as an anti-pollutant, with the brand claiming it protects from environmental damages as well as blue light from our screens. It may be pricey, but as it addresses additional skin woes we hadn’t considered, we don’t mind splashing the cash. Buy now £82 Boots.com {{#hasItems}} Price comparison {{#items}} {{ merchant }} £{{ price }} Buy now {{/items}}\n\nDr. Levy Switzerland booster serum, 30ml Best: For sensitive skin Arguably the ultimate anti-ageing serum, this product from Dr. Levy is packed with a potent blend of hyaluronic acid, aloe vera and a vitamin complex the brand says is guaranteed to improve your skin. It was one of the lightest in texture serums we tested. It features a plant-derived stem-cell extract which is said to work to stimulate skin’s collagen production. It takes around 6 to 8 weeks for results to show, but we also immediately noticed how radiant our skin became after just one use. Although the price tag might be offputting to some, we found it went above and beyond the call of duty. So if your budget stretches to it, we’d recommend this in a heartbeat, especially to those with sensitive skin. Buy now £266.50 Facethefuture.co.uk {{#hasItems}} Price comparison {{#items}} {{ merchant }} £{{ price }} Buy now {{/items}}\n\nSkin Generics retinol anti-aging serum, 30ml Best: For fine lines This serum from Skin Generics is a great bargain that delivers excellent results. It promotes the synthesis of collagen, hyaluronic acid and elastin to reduce wrinkles and fine lines. It also contains retinol as an active ingredient – with 2 per cent of a vitamin A derivative, along with ingredients such as vitamin C and Hawaiian algae. We didn’t find this to be as lightweight in texture as some of the other serums, but it did absorb quickly nonetheless. While an excellent price, those with sensitive skin should exercise caution as the mixture of vitamin C and retinol did cause our skin a little irritation. It didn’t last long, however, and we just made sure to use a more nourishing and lightweight moisturiser on top. This serum is currently out of stock, but we hope to see more of it soon. Buy now £27.99 Amazon.co.uk {{#hasItems}} Price comparison {{#items}} {{ merchant }} £{{ price }} Buy now {{/items}}\n\nOsmosis MD rescue epidermal repair serum, 30ml Best: For pigmentation This repair serum is true to its name – it really did rescue and repair our skin. We noticed a change after the first application. It went on so easily, making skin feel silky smooth from the start, and it absorbed quickly. We immediately noticed a difference in the size of our pores and could see a significant amount of brightening. In addition to focusing on smoothing skin texture and fixing pigmentation, it’s also a great option for those of you suffering from sensitivity or other skin concerns such as rosacea and acne. The one downside to this product was, unlike other anti-ageing serums which either smelled amazing or were fragrance-free, this one had a slightly clinical or chlorine-like scent. However, the results were very promising for this serum. Buy now £109 Shop.dermoi.com {{#hasItems}} Price comparison {{#items}} {{ merchant }} £{{ price }} Buy now {{/items}}\n\nComfort Zone sublime skin serum, 30ml Best: For mature skin Our first thought when applying this anti-ageing serum was that the texture felt great when hitting our skin and there was a pleasant smell to it. However, it must be noted that this serum wasn’t as fast-absorbing as others we tested and our skin didn’t feel as immediately hydrated. This was a surprise, given the blend of micro and macro hyaluronic acid, however this can be easily resolved by using a particularly nourishing moisturiser. We’d perhaps recommend this serum for those with more mature skin, as it did a wondrous job of making our face feel noticeably firmer and tightened upon each use. Our skin also did look and feel plumper. Buy now £80 Lookfantastic.com {{#hasItems}} Price comparison {{#items}} {{ merchant }} £{{ price }} Buy now {{/items}}\n\nRéVive intensité complete anti-ageing serum, 30ml Best: For plumping This serum was absorbed quickly upon application, getting straight to work on softening the appearance of fine lines and wrinkles thanks to what the brand calls its “line-relaxing complex”. Its cellular filling complex is what helps re-establish shape and elasticity, visibly plumping and re-contouring skin. We found it to be an excellent product, making our skin feel instantly smooth. We did notice an improvement in finer lines and our skin felt noticeably more hydrated which, in turn, positively affected its appearance. The drawback with this product is its price as, as fantastic as it was, it is rather expensive – particularly if you were to implement it into your daily skincare routine. We must admit that it is hard to assess whether this serum delivered particularly better results than those at a third of the price. Buy now £380 Harrods.com {{#hasItems}} Price comparison {{#items}} {{ merchant }} £{{ price }} Buy now {{/items}}\n\nSkin Woof premium vitamin C radiance serum, 30ml Best: For dull skin A newer brand to the table, Skin Woof’s vitamin C radiance serum contains hyaluronic acid, vitamin A, and sea buckthorn oil – all designed to reduce dullness. We certainly noticed a bright and healthy glow to our skin and we also quite liked its gel base. Light in fragrance and texture, we found it easily absorbed into our skin. The cheapest of the anti-ageing serums we tested, this brand proves you can achieve more youthful-looking skin without spending the earth. This particular serum is great for reducing the appearance of acne scars and pigmentation too, in addition to minimising pores. And if were to try this serum and fall in love, Skin Woof offers a subscription option, making it even more affordable. Buy now £23.95 Skinwoof.com {{#hasItems}} Price comparison {{#items}} {{ merchant }} £{{ price }} Buy now {{/items}}\n\nVerso super facial serum, 30ml Best: Gentle serum Out of the retinol-based products, this one appealed to us more, given the higher concentration of retinol in the serum’s makeup. Verso’s Super Facial Serum uses retinyl retinoate (which is said to be stronger than retinol), meaning its power to work magic and make your skin appear more youthful-looking is stronger. It is also said to cause less irritation to the skin and we found it to also be a gentler version of the beloved vitamin A product. We found no stinging as we applied this serum and our skin wasn’t left feeling at all dry. However, the texture of the product overall was a little thick for our liking. We must say, however, we weren’t particularly impressed by any changes to the texture of our skin, gaining the sense that the visible effects of this anti-ageing serum aren’t efficient as some of the other products we tried and tested. A great serum product to add between your toner and moisturiser each day and night, however it showed us limited results which would lead us to question its higher end price point. Buy now £88 Thegroomingclinic.com {{#hasItems}} Price comparison {{#items}} {{ merchant }} £{{ price }} Buy now {{/items}}\n\nGoldfaden MD needle-less line smoothing concentrate, 30ml Best: For inflammation Despite most anti-ageing serums taking weeks to give noticeable results, we were drawn to the fact that we were able to see a small improvement after just a week with this formula. Upon initial application, there was a warm, burning sensation, but we weren’t too concerned due to the product’s proclaimed “need-less” concept. There was no visible irritation to our skin at all, but if tingling concerns you, this is not the right product. We’d also recommend those with sensitive skin steer clear, as it might make you nervous upon each application. That being said, ingredients such as seaweed ensured the serum was packed full of vitamins and minerals, as well as hyaluronic acid to help the skin retain moisture and stay supple. We also liked the fact that there is red tea extract in the serum, as this ingredient is said to act as an anti-inflammatory agent, assist with brightening and aid the reduction of fine lines and wrinkles. Buy now £100 Spacenk.com {{#hasItems}} Price comparison {{#items}} {{ merchant }} £{{ price }} Buy now {{/items}}\n\nSienna X the retinol serum, 20ml Best: Value for money Sienna X’s serum features 0.3 per cent pure retinol, making this a great product if topical vitamin A is what you’re looking for. We were really looking forward to trying it because of its potent formula, however, as effective an ingredient as retinol is, it is not advisable if you have sensitive skin. This meant there was slight irritation and redness to our skin upon application. It didn’t go away as quickly and seamlessly as the slight tingling with other serums we tried. However, this serum is very good value for money given the high concentration of its ingredients and, should you not suffer from skin sensitivity, it could be the one for you. Buy now £33 Beyondbeautiful.com {{#hasItems}} Price comparison {{#items}} {{ merchant }} £{{ price }} Buy now {{/items}}", "images": ["https://static.independent.co.uk/2021/04/08/17/Anti%20ageing%20serums%20indybest.jpg?quality=75&width=1200&auto=webp", "https://static.independent.co.uk/2021/04/08/17/Anti%20ageing%20serums%20indybest.jpg?quality=75&width=982&height=726&auto=webp"], "top_img": "https://static.independent.co.uk/2021/04/08/17/Anti%20ageing%20serums%20indybest.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Amira Arasteh"], "canonical_link": "https://www.independent.co.uk/extras/indybest/fashion-beauty/skincare/best-anti-aging-serum-uk-a9419156.html", "title": "Best anti-ageing serum 2022: For wrinkles and fine lines", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "Whether you’re 50, 40 or any age, get your skin looking youthful with these best anti-ageing serums from Charlotte Tilbury, Estée Lauder, Elemis and more", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "Skincare", "sitename": "The Independent", "page path": "/extras/indybest/fashion-beauty/skincare", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2022-01-13T16:43:52.000Z", "site_name": "The Independent", "title": "Anti-ageing serums that target wrinkles, dark spots and dullness", "url": "https://www.independent.co.uk/extras/indybest/fashion-beauty/skincare/best-anti-aging-serum-uk-a9419156.html", "type": "article", "description": "Whether you’re 50, 40 or any age, get your skin looking youthful with these best anti-ageing serums from Charlotte Tilbury, Estée Lauder, Elemis and more", "image": {"identifier": "https://static.independent.co.uk/2021/04/08/17/Anti%20ageing%20serums%20indybest.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/2021/04/08/17/Anti%20ageing%20serums%20indybest.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2022-01-13T16:43:52.000Z", "modified_time": "2022-01-13T16:43:52.000Z", "section": "Extras", "subsection": "IndyBest", "author_name": "Amira Arasteh", "content_type": "story", "word_count": 377, "image_count": 1, "embed_count": 0, "video_count": 0, "internal_link_count": 2, "external_link_count": 0}, "date": "2022-01-13T16:43:52.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "Anti-ageing serums that target wrinkles, dark spots and dullness", "site": "@Independent", "card": "summary_large_image", "description": "Whether you’re 50, 40 or any age, get your skin looking youthful with these best anti-ageing serums from Charlotte Tilbury, Estée Lauder, Elemis and more", "image": "https://static.independent.co.uk/2021/04/08/17/Anti%20ageing%20serums%20indybest.jpg?quality=75&width=1200&auto=webp"}, "keywords": "anti ageing,indybest,Internal"}, "movies": [], "publish_date": 1642092232.0, "source": "https://www.independent.co.uk", "summary": ""}