{"url": "https://www.yahoo.com/entertainment/allison-mack-faces-sex-cult-charges-seagram-heiress-3-others-arrested-191442683.html", "text": "Allison Mack arrives at the U.S. Eastern District Court in New York for a bail hearing in relation to sex-trafficking charges. (Photo: Jemal Countess/Getty Images)\n\nAllison Mack is facing additional legal trouble for her alleged role in a sex-cult scandal that has catapulted the former Smallville star into headlines in recent months.\n\nThe actress was charged with racketeering conspiracy Tuesday stemming from her involvement in Nxivm; she has already been charged with sex trafficking, sex trafficking conspiracy, and conspiracy to commit forced labor for allegedly helping to run a sex cult within the self-help group, according to federal prosecutors.\n\nNxivm founder Keith Raniere, who is awaiting trial on the same three earlier counts, was also charged with racketeering conspiracy, as were four other members. Co-founder Nancy Salzman and her daughter, Lauren; longtime bookkeeper Kathy Russell; and billionaire heiress Clare Bronfman were arrested Tuesday on a superseding indictment. Bronfman is the heiress to the Seagram’s liquor fortune and allegedly was one of Nxivm’s key financiers.\n\nAccording to the U.S. Attorney’s Office for the Eastern District of New York, the racketeering conspiracy involves “an array of crimes, including identity theft, extortion, forced labor, sex trafficking, money laundering, wire fraud and obstruction of justice.”\n\nYahoo Entertainment received a copy of the indictment, which claims the four aforementioned women, along with Mack, made up Raniere’s “inner circle.” The documents state that “they comprised the second-highest level within the DOS ‘pyramid’ and that, other than Raniere, they wielded the most power within DOS.”\n\nDOS, which is short for a Latin phrase that roughly translates as “Master Over Slave Women,” refers to the women-branding secret sorority within Nxivm. Lauren Salzman and Mack are each referred to as “a first-line master in DOS” in the indictment and allegedly recruited women to serve as Raniere’s sex slaves.\n\n“As alleged, this long-running conspiracy crossed multiple avenues of criminal activity, which included, among other things, electronic monitoring; identity theft; extortion; victim smuggling; and illegal trafficking of a victim after a period of unlawful confinement. The details of these alleged crimes become more and more grim as we continue to dig deeper into the conduct of this organization and its intended mission,” stated William Sweeney, the assistant director in charge of the FBI’s New York field office. “Today’s superseding indictment highlights our commitment to bringing justice to Nxivm’s many victims.”\n\nStory continues\n\nThe indictment contains new allegations in the ongoing case, but one of the more disturbing accusations involves Raniere and Lauren Salzman. They are accused of trafficking a former sexual partner of Raniere’s for “labor and services.”\n\n“The victim was confined to a room in Clifton Park, New York, for nearly two years as punishment for having romantic feelings for a man who was not Raniere,” according to prosecutors. “The victim was told that if she left the room she would be sent to Mexico without any identification documents. As threatened, she was driven to Mexico and her family was instructed by co-conspirators, including Lauren Salzman, not to send the victim her identification documents.”\n\nBronfman, Russell, and the Salzmans all pleaded not guilty when arraigned in federal court Tuesday. If convicted, the defendants face up to 20 years in prison for racketeering conspiracy, forced labor conspiracy, and wire fraud conspiracy charges, as well as a maximum of 15 years of imprisonment for the identity theft conspiracy charge.\n\nRaniere and Mack are already facing mandatory minimum sentences of 15 years, and up to life imprisonment, on related charges of sex trafficking and sex trafficking conspiracy. They have pleaded not guilty. The 35-year-old actress is currently out on $5 million bond, but is on house arrest. In June, Raniere was deemed a flight risk and was denied bail.\n\n\n\nRead more from Yahoo Entertainment:", "images": ["https://s.yimg.com/rz/p/yahoo_entertainment_en-US_h_w_entertainmentv2.png", "https://s.yimg.com/ny/api/res/1.2/7JOOHnw2N_SFubWRzMV56A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTM0MjtoPTQ4/https://s.yimg.com/os/creatr-uploaded-images/2020-12/d7f38f00-340b-11eb-b7bf-540525a865da", "https://s.yimg.com/uu/api/res/1.2/jJF_DMuTn30SuZL4UXrgCQ--~B/aD05MDc7dz0xMDI0O2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/518bd32ccc9da4445649bd42a6afe8b5", "https://sb.scorecardresearch.com/p?c1=2&c2=7241469&c5=1197800334&c7=https%3A%2F%2Fwww.yahoo.com%2Fentertainment%2Fallison-mack-faces-sex-cult-charges-seagram-heiress-3-others-arrested-191442683.html&c14=-1", "https://s.yimg.com/rz/p/yahoo_entertainment_en-US_h_p_entertainmentv2.png", "https://s.yimg.com/ny/api/res/1.2/wrQFMkVYYhNC5k7IjcCEhw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTg1MA--/https://s.yimg.com/uu/api/res/1.2/jJF_DMuTn30SuZL4UXrgCQ--~B/aD05MDc7dz0xMDI0O2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/518bd32ccc9da4445649bd42a6afe8b5", "https://s.yimg.com/ny/api/res/1.2/QYv2d1jDDB2z1DZ0urUo0g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTgwO2g9ODA-/https://s.yimg.com/os/creatr-uploaded-images/2019-09/222e35f0-de29-11e9-bdbf-dab7faeea558", "https://s.yimg.com/cv/apiv2/default/20190501/placeholder.gif"], "top_img": "https://s.yimg.com/uu/api/res/1.2/jJF_DMuTn30SuZL4UXrgCQ--~B/aD05MDc7dz0xMDI0O2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/518bd32ccc9da4445649bd42a6afe8b5", "keywords": [], "authors": [], "canonical_link": "https://www.yahoo.com/entertainment/allison-mack-faces-sex-cult-charges-seagram-heiress-3-others-arrested-191442683.html", "title": "Allison Mack faces more sex-cult charges as Seagram heiress, 3 others are arrested", "meta_data": {"oath": {"guce": {"consent-host": "guce.yahoo.com"}}, "news_keywords": "Allison Mack, Nxivm, sex trafficking, Clare Bronfman, racketeering conspiracy, Lauren Salzman, Kathy Russell, superseding indictment, sex slaves, sex cult, forced labor", "twitter": {"title": "Allison Mack faces more sex-cult charges as Seagram heiress, 3 others are arrested", "description": "Allison Mack is facing additional legal trouble for her alleged role in a sex-cult scandal that has catapulted the former Smallville star into headlines in recent months.", "site": "@Yahoo", "dnt": "on", "image": {"identifier": "https://s.yimg.com/uu/api/res/1.2/jJF_DMuTn30SuZL4UXrgCQ--~B/aD05MDc7dz0xMDI0O2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/518bd32ccc9da4445649bd42a6afe8b5", "src": "https://s.yimg.com/uu/api/res/1.2/jJF_DMuTn30SuZL4UXrgCQ--~B/aD05MDc7dz0xMDI0O2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/518bd32ccc9da4445649bd42a6afe8b5"}, "card": "summary_large_image"}, "og": {"title": "Allison Mack faces more sex-cult charges as Seagram heiress, 3 others are arrested", "url": "https://www.yahoo.com/entertainment/allison-mack-faces-sex-cult-charges-seagram-heiress-3-others-arrested-191442683.html", "description": "Allison Mack is facing additional legal trouble for her alleged role in a sex-cult scandal that has catapulted the former Smallville star into headlines in recent months.", "type": "article", "image": {"identifier": "https://s.yimg.com/uu/api/res/1.2/jJF_DMuTn30SuZL4UXrgCQ--~B/aD05MDc7dz0xMDI0O2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/518bd32ccc9da4445649bd42a6afe8b5", "width": 1024, "height": 907}}, "al": {"android": {"url": "yahoo://article/view?uuid=6eb90ba7-8e03-3454-b024-a8e498f20143&src=web", "app_name": "Yahoo", "package": "com.yahoo.mobile.client.android.yahoo"}, "ios": {"url": "yahoo://article/view?uuid=6eb90ba7-8e03-3454-b024-a8e498f20143&src=web", "app_name": "Yahoo", "app_store_id": 304158842}}, "description": "Allison Mack is facing additional legal trouble for her alleged role in a sex-cult scandal that has catapulted the former Smallville star into headlines in recent months."}, "movies": [], "publish_date": null, "source": "https://www.yahoo.com", "summary": ""}