{"url": "https://people.com/human-interest/does-this-photo-prove-amelia-earhart-survived-her-final-flight/", "text": "A recently-discovered photograph is turning the mystery surrounding Amelia Earhart’s 1937 disappearance on its head, leading a handful of experts to believe the celebrated aviator and women’s rights role model actually survived her final flight — and was captured by the Japanese.\n\nShortly after midnight on July 2, 1937, Earhart climbed into her Lockheed Electra at an airfield in Papua New Guinea and took off into the dark, muggy night.\n\nTogether with her navigator Fred Noonan, the 39-year-old pilot flew east toward Howland Island, a tiny sliver of land in the central Pacific Ocean, on the final leg of her boldest aeronautical adventure to date – circumnavigating the globe along the equator in a marathon 29,000-mile flight.\n\nAnd then suddenly, she vanished.\n\n“Gas is running low,” Earhart said in what’s believed to be her final radio broadcast to a Coast Guard cutter assisting with her navigation. “Have been unable to reach you by radio. We’re flying at 1,000 feet.”\n\nThe mystery of what happened to Earhart and Noonan has gone unanswered for 80 years.\n\nNow Shawn Henry, a former executive assistant director of the FBI – and the History Channel – have come forward with the two-hour documentary Amelia Earhart: The Lost Evidence that premieres on Sunday, July 9 at 9 p.m. ET and attempts to answer this question.\n\nLes Kinney/National Archives/HISTORY\n\nArmed with a recently-discovered photograph purportedly taken of Earhart days after she crash-landed on a remote South Pacific atoll, Henry offers up a startling theory of a government cover-up that runs counter to the widely-accepted idea that she died after her plane ran out of fuel and crashed into the ocean.\n\n“This absolutely changes history,” says Henry, who led a team of investigators examining a range of evidence, including plane parts found on a remote Pacific island consistent with the aircraft Earhart was flying.\n\n“I think we proved beyond a reasonable doubt that she survived her flight and was held prisoner by the Japanese on the island of Saipan, where she eventually died.”\n\nLes Kinney/National Archives/HISTORY; (Graphic)Nok Acharee\n\nThe theory that the Japanese military could be responsible for the disappearance of the two aviators – who they “may have believed were American spies,” says Henry – has been floating around for decades.\n\nBut it’s the discovery of a black-and-white photograph – unearthed by retired U.S. Treasury Agent Les Kinney in 2012 and revealed for the first time in the documentary – that suddenly makes the theory more plausible, adds the former FBI boss.\n\n‘Top Secret’ File\n\nA longtime Earhart buff who has spent thousands of hours combing through government records, Kinney discovered the photo in a “formerly top secret” file in the National Archives.\n\n“It was misfiled,” he tells Henry in the documentary, referring to the photo which depicts two blurry images on a dock believed to be Noonan and Earhart – who stares out at a nearby ship with her back turned to the camera. “That’s the only reason I was able to find it.”\n\nWATCH: Does This Photo Prove Amelia Earhart Survived Her Final Flight?\n\nBy the time Earhart embarked on her around-the-world flight, the Japanese controlled many of the islands in the South Pacific that she and Noonan were flying on this final leg of their adventure.\n\nKinney insists that any document that directly refers to Earhart as a Japanese prisoner was long ago “purged” from official files to hide the fact that the government knew Earhart was a prisoner and did nothing about it, including one report that totaled more than 130 pages.\n\nNY Daily News Archive/Getty\n\nKinney’s undated photograph came from an Office Of Naval Intelligence file, he says, and was meticulously examined and evaluated by two of the nation’s top forensic photo analysts, using extensive recognition and proportional comparison technology.\n\n“I can say with more than 99.7 percent confidence that the photo is authentic and untouched,” explains digital forensic analyst Doug Carner.\n\nFacial recognition expert Kent Gibson, who compared known images of Noonan and Earhart with the individuals photographed on the dock, believes it’s “likely” they are the two lost aviators.\n\n“There’s nothing that points me in another direction,” says Gibson, who adds that the figure believed to be Earhart has the “same prominent, athletic shoulders as Amelia” and the same “short, bobbed hair.”\n\nCrash site investigator and former fighter pilot Dan Hampton traveled with Henry to the remote Mili atoll, where it’s believed Earhart crash-landed after flying roughly 850 miles off course during her flight to tiny Howland Island. From there she planned to refuel then continue on Hawaii.\n\nWith her fuel tanks nearly empty, he believes she was forced to land on the rocky, coral-strewn atoll in the Marshall Islands.\n\nIslanders have long maintained that the two flyers crash-landed there. And twisted scraps of aluminum found near the atoll decades later were tested and determined to be consistent with the same grade of metal used in planes from the 1930s.\n\n“I’ve never seen a reef you could land an airplane on until I went out there,” says Hampton, who insists he was initially skeptical of claims that Earhart survived her flight.\n\nVanished Without a Trace\n\nAfter her disappearance, the government launched what at the time became the largest ever sea and air search. American vessels, however, weren’t allowed into the Japanese-controlled Marshall Islands.\n\nNo trace of the flyers or their plane was ever found.\n\nDays after their alleged crash landing, Henry believes Earhart and Noonan, along with their plane, were picked up by the Japanese military and taken roughly 200 miles to Jaluit Island, where Kinney’s photograph — which contains the caption: “MARSHALL ISLANDS, JALUIT ATOLL, JALUIT ISLAND. JALUIT HARBOR.” — was later snapped on the dock.\n\nAP\n\nForensic analyst Carner identified the ship that the individual presumed to be Earhart appears to be staring at as the Koshu Maru, a Japanese cargo ship.\n\nBehind the ship on a barge is an object resembling an airplane that Gibson calculated to be 38 feet long. Records show that Earhart’s Lockheed Electra measured 38.7 feet long.\n\nThe Koshu Maru is believed to have transported the flyers nearly 2,000 miles to the island of Saipan.\n\nIn the televised special Henry interviews a former islander, now in her 90s and living in California, who is described as “the last living eyewitness” to have seen Earhart and Noonan after their crash.\n\nHenry and his team traveled to the now-crumbling, vine-choked prison cell in Saipan where they believe Earhart spent her final two years before dying in 1939, possibly from malaria or dysentery.\n\nNot so fast, says Dorothy Cochrane, curator for the Smithsonian National Air and Space Museum’s Aeronautics Department, who insists that she’s never seen any “definitive evidence” to suggest that the pair survived their final flight.\n\nCochrane, who as of press time had not yet seen the History Channel special, describes the idea that Earhart was taken prisoner by the Japanese as a “ridiculous theory.”\n\nShe also insists that she’s “not aware of any missing government records [on Earhart] that could be a game changer.”\n\nHenry stands by his team’s findings, but acknowledges that Kinney’s photograph and their other discoveries open up countless new questions about Earhart and Noonan’s fate.\n\n“It is not clear why the U.S. [government] might want to cover up what happened to Amelia,” he says.\n\n“If in fact she was spying on the Japanese, the government may not have wanted the American public to know they put ‘America’s sweetheart’ in that situation and she was captured.”", "images": ["https://people.com/thmb/bFr37osJqlDXzWEmQEm63UBK9e8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/amelia-earhart-14-dc1bd08b9e4d458f870d8f3df20793f8.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/-mYsME3XHSGP9xcdOOla9xQGG_o=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/amelia-earhart-13-4ee02f46a567460181b40b1ecb732130.jpg", "https://people.com/thmb/gWVVnK18pEGKssXnqqGC4Cn_qog=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/miley-cyrus-1-ddba795f1c2e486a8b10e78796328d1e.jpg", "https://people.com/thmb/AA7HaSuISiZZ-Sz9ZgqpUKFyhqI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(709x0:711x2)/amelia-earhart-12-3f3a4936d65b4848acb4674a9c0937ac.jpg", "https://people.com/thmb/68BDm-DCLRfhYZTR02KY-1CWY7U=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/diana-cover-435-1-d461ce9a4f0742efb5e162bbc74b35d0.jpg", "https://people.com/thmb/9drSUYFw3kHn3XO3KGm9egexaWI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/gettyimages-1161352-2000-6b088f4eb7dd4bd2a60fd60a6e1328e0.jpg", "https://people.com/thmb/3wbryw2zVlBRSjDRcNYrVgfAO_A=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(299x0:301x2)/malaysia-mh370-600x450-b64347283f0e49f995ad19a76a9ffea1.jpg", "https://people.com/thmb/7glbKzB7mX-ImWBTlFPkAWFkfMQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(479x539:481x541)/Books-July-2022-reviews-02-072022-955dc89822604b20a453872752d96b08.jpg", "https://people.com/thmb/8cJmVZc7Ok6w5_4Wwxc14qmMsU4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/people_generic-1885945d8bd544778fbbf4be88a63f00.jpg", "https://people.com/thmb/T00sf9SLJmYp0ImaZDgdmOtds0Y=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/amelia-graphic-1-3027b6af71364677bf3606a753123454.jpg", "https://people.com/thmb/ARTfb_83JW7oXCOJmPH5h_dknbE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(847x0:849x2)/amelia-earhart-6-4063fffa66b14a4c8c49d124b06234cb.jpg", "https://people.com/thmb/ayuvpU-QF74Xo_6Y2at4EpgLnGY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/amelia-tout-8631b5b7838f422f80de28aff2b0acba.jpg", "https://people.com/thmb/3ilW8qHixuOJKM6XqtpFLPUwRZA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/amelia-earhart-10-1-bebd1f85c9f841c48a4761ff34249137.jpg", "https://people.com/thmb/3EeMp0VbjvmG0yUhJrHoaT7hj8s=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/amelia-earhart-435-287c4d7f18fb437881343205fb88a5d0.jpg", "https://people.com/thmb/ykoY0-Y8HMSJ9HkJIdzOoY0kCdE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(299x0:301x2)/amelia-earhart-600-1-1c9e0ae74eb7447face2174a1cc4090d.jpg", "https://people.com/thmb/orzWVa-3S4q269DILekFdDLuelk=/800x520/filters:fill(auto,1)/amelia-tout-8631b5b7838f422f80de28aff2b0acba.jpg", "https://people.com/thmb/8zGkm6bNggd9k3yDrQ9rafnlS48=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(374x0:376x2)/3_16_98_750x1000-faa6d386f6d54dfea754e38be1ff47f1.jpg", "https://people.com/thmb/xVSuDp2s3EG6XF2Ei8T_DIHbkY0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(299x0:301x2)/amelia-earhart-600-482f5a1786214fd4b1b2a632bf8dca65.jpg", "https://people.com/thmb/ATN0-nz4zyMSUXOK-9dh0QO8KYo=/75x75/filters:no_upscale():max_bytes(150000):strip_icc()/IMG_2372-copy-38978371708e48f0be304e2d0402ee22.jpg"], "top_img": "https://people.com/thmb/orzWVa-3S4q269DILekFdDLuelk=/800x520/filters:fill(auto,1)/amelia-tout-8631b5b7838f422f80de28aff2b0acba.jpg", "keywords": [], "authors": ["Johnny Dodd", "People Editorial Guidelines"], "canonical_link": "https://people.com/human-interest/does-this-photo-prove-amelia-earhart-survived-her-final-flight/", "title": "Does This Photograph Prove Amelia Earhart Survived Her Final Flight", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "A recently-discovered photograph is turning the mystery surrounding Amelia Earhart's 1937 disappearance on its head", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Johnny Dodd", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/human-interest/does-this-photo-prove-amelia-earhart-survived-her-final-flight/", "title": "Does This Photograph Prove Amelia Earhart Survived Her Final Flight", "description": "A recently-discovered photograph is turning the mystery surrounding Amelia Earhart's 1937 disappearance on its head", "image": "https://people.com/thmb/orzWVa-3S4q269DILekFdDLuelk=/800x520/filters:fill(auto,1)/amelia-tout-8631b5b7838f422f80de28aff2b0acba.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Does This Photograph Prove Amelia Earhart Survived Her Final Flight", "description": "A recently-discovered photograph is turning the mystery surrounding Amelia Earhart's 1937 disappearance on its head", "image": "https://people.com/thmb/orzWVa-3S4q269DILekFdDLuelk=/800x520/filters:fill(auto,1)/amelia-tout-8631b5b7838f422f80de28aff2b0acba.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}