{"url": "https://en.wikipedia.org/wiki/Gypsy_(TV_series)", "text": "No. Title Directed by Written by Original release date\n\n1 \"The Rabbit Hole\" Sam Taylor-Johnson Lisa Rubin June 30, 2017 ( )\n\nJean is a therapist who seems to have it all: a handsome loving husband named Michael, an adorable daughter named Dolly, and a lovely house in Connecticut. One of her patients is Sam, who has been struggling to move on from his ex-lover, Sidney. Crossing her professional boundary, Jean seeks out Sidney in a coffee shop, where she works, called The Rabbit Hole. Introducing herself as Diane and lying about her occupation, she begins to build a relationship with Sidney. Jean's other patients include Claire, an overbearing mother who desperately wants to reunite with her estranged daughter, and a dysfunctional young girl called Allison.\n\n2 \"Morgan Stop\" Sam Taylor-Johnson Lisa Rubin June 30, 2017 ( )\n\nJean tries to juggle her fascination with Sidney and her parental duties. Meanwhile, Michael and his assistant, Alexis, develop a strange relationship. Jean tracks down Claire's estranged daughter, Rebecca, who complains about her overbearing mother, making Jean question Claire's version of the story. Her boss reminds Jean that their job is to work with what their patients bring to the room. He also informs her that a hospitalized former patient of Jean's, Melissa, has been making serious accusations about what Jean did to her life. Later, Jean meets up with Sidney in a club, but their night out is interrupted by a call from Dolly, which almost exposes Jean's true identity. Jean rushes home where she and Michael connect, him unaware of her night's activities.\n\n3 \"Driftwood Lane\" Scott Winant Story by : Jessica Mecklenburg\n\nTeleplay by : Jessica Mecklenburg & Lisa Rubin June 30, 2017 ( )\n\nJean takes Michael on a surprise date in the city, during which she asks him whether he would ever have an affair. Their adventurous night out finishes in the bedroom. Prompted by a flashback involving her mother and Sidney, Jean checks in on Allison. At a birthday party for Dolly, Jean seems to be constantly on edge. The tension reaches its peak when she snaps at another parent at the party, which later leads to an argument with Michael. He thinks she made Dolly's party about herself, while Jean feels she is treated like she is invisible in her home. After the argument, Jean takes off in the middle of the night under the pretense of a work-related emergency.\n\n4 \"309\" Scott Winant Story by : Jonathan Caren\n\nTeleplay by : Jonathan Caren & Lisa Rubin June 30, 2017 ( )\n\nMichael grows suspicious of Jean's movements, while his own professional relationship with Alexis crosses over into something more personal. Jean reconnects with Sidney, who tells her that she has always been attracted to older women. Jean makes contact with Rebecca again and tries to encourage her to talk to Claire. When Sam shares with Jean that he has arranged to meet with Sidney, Jean tries to manipulate him into canceling the date. Later, Jean has her own lunch date with Sidney, who, unbeknownst to Jean, has also invited Sam to join. Jean realizes this and storms away before Sam shows up. Jean also visits Allison and tries to rescue her from an abusive relationship.\n\n5 \"The Commune\" Alik Sakharov Sean Jablonski June 30, 2017 ( )\n\nContinuing with her unorthodox methods, Jean roleplays as Sidney during her session with Sam and then takes Allison to an NA meeting. The latter practice, it turns out, is encouraged by her boss. Sam runs into an ex of his, Emily, and apologizes to her. Michael becomes more suspicious of Jean after she refuses to tell him the passcode for her cellphone. Sidney and Jean have a confrontation, with Sidney telling \"Diane\" she is scared and \"Diane\" telling Sidney that she is manipulative. Jean later visits a commune Claire's daughter, Rebecca, has moved in with, where she is forced to share some of her secrets. Meanwhile, Michael spends the evening with a divorced friend, which makes him realize he does not want to end up like him. Inspired by the meeting of Rebecca's commune, Jean finds Sidney and shares a passionate kiss with her, telling her she is not scared; however, Larin spots her as she desperately tries to run away.\n\n6 \"Vagabond Hotel\" Alik Sakharov Story by : Sneha Koorse\n\nTeleplay by : Sneha Koorse & Lisa Rubin June 30, 2017 ( )\n\nAfter Jean and Michael spend a night together at a hotel, Jean invites Sidney for a breakfast date. Sidney then invites Jean along on an errand, which, to Jean's horror, turns out to be stealing Sam's dog from his apartment; Jean is further horrified to discover that Sam has a gun. Immediately thereafter, Sam books an emergency session with Jean in order to vent his anger; he also says that he is going to start dating Emily again. Allison's abusive boyfriend shows up insisting he join Allison's session. Emboldened by Jean's support, Allison tells him that he is not good for her. On his way out, he makes a vague threat to Jean. Later, when Jean and Sidney are out, Jean suddenly collapses and passes out, suspecting she might have been drugged by Allison's boyfriend.\n\n7 \"Euphoria\" Victoria Mahoney Lisa Rubin June 30, 2017 ( )\n\nAs Michael heads off to Texas accompanied by Alexis and a male colleague, Jean prepares for \"the full Sidney experience\". After drinks in a bar, they head to Sidney's apartment, where they throw back tequila shots and get high. Down in Texas, Michael is having a boozy night with Alexis. The episode cuts between both pairs playing Truth or Dare, inching closer and closer to crossing the line. Jean probes Sidney about her relationship with Sam and, when Sidney is not looking, deletes his messages and number from Sidney's phone. Meanwhile, Alexis dares Michael to take a midnight dip in the hotel pool, after which they retire to his room for a night cap. Ultimately, Michael resists Alexis' not-so-subtle advances and calls it a night. Jean, on the other hand, fortified by liquid courage and drugs, goes to bed with Sidney.\n\n8 \"Marfa\" Victoria Mahoney Jonathan Caren & Lisa Rubin June 30, 2017 ( )\n\nSidney grows suspicious of Jean, wanting to know more about who she really is. Jean is horrified to learn from Claire that Rebecca wants to have a session with her, so she sets out to stop it. Michael is questioned by his boss if he and Alexis slept together the previous weekend. Meanwhile, Larin questions Jean's increasingly distant behavior. Sam tells Jean about his sex life with Emily, to which Jean begins asking increasingly personal questions about his sex with Sidney. \"Diane\" visits Rebecca and convinces her to cut Claire off. Michael is told that Alexis wants the office to know she loves him. Jean puts Allison in \"Diane\"'s Upper West Side apartment, where she finds and begins to listen to Jean's tapes. Michael and Sidney meet when he visits the coffee shop, alarming Jean. Sidney uploads a photo of herself and Jean to social media after promising not to. Jean reignites her sex life with Michael by using techniques Sam used on Sidney, and tells him to never go to the coffee shop again.\n\n9 \"Neverland\" Coky Giedroyc Sean Jablonksi & Jessica Mecklenburg June 30, 2017 ( )\n\nAllison's mother shows up at Jean's office, saying she has not seen or heard from her daughter in days. Jean is shocked and refuses to offer any details; she later lies to her colleagues about what Allison's mother was doing there, but they do not buy it. Sam tells Jean that he thinks she keeps pushing Sidney on him so she can continue to control him, telling her that their sessions are over. Meanwhile, Michael confronts Alexis about starting a false rumor about what they did in Texas, admitting that he does have feelings for her. Sidney nervously tells Jean that Sam is engaged to Emily and that she is afraid everyone in her life, including Jean, is leaving her. Jean calls Sam and asks to meet. Before Dolly's play, Jean receives a call from an unknown number but does not answer it. At the end of the play, Jean hears a voicemail from a frantic Allison, urging her to quickly call her back; she is soon informed that Allison is missing.\n\n10 \"Black Barn\" Coky Giedroyc Lisa Rubin June 30, 2017 ( )", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/4/44/Gypsy%2C_season_one_poster.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/44/Gypsy%2C_season_one_poster.jpg/250px-Gypsy%2C_season_one_poster.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/4/44/Gypsy%2C_season_one_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Gypsy_(TV_series)", "title": "Gypsy (TV series)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/4/44/Gypsy%2C_season_one_poster.jpg", "width": 640, "height": 949}, "title": "Gypsy (TV series) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}