{"url": "https://deadline.com/2017/05/new-girl-final-season-details-cancellation-avoided-fox-1202094465/", "text": "The upcoming eight-episode seventh and final season of Fox’s New Girl, which was picked up yesterday, will feature a time jump. But before we get to that and other details about Season 7, let’s look back at the wild past few days when the comedy series went from a shoo-in for a 13-episode final season to the brink of cancellation to an eight-episode renewal.\n\nNew Girl has been an important show for Fox and sibling 20th TV: It was the network’s first big comedy hit in a long time, it became the first big SVOD sale of a current broadcast comedy series to Netflix for a reported $900,000 an episode, and six seasons in it continues to be Fox’s highest-rated comedy series. So when the Season 6 finale came and went last month, everyone assumed the comedy was getting one more chapter for a proper sendoff. But as broadcast series renewals and cancellations started rolling in midway through last week, a shocker hit the rumor mill — New Girl was getting canceled. While the show did not officially get the ax, it came very, very close to it.\n\nI hear that was because of various reasons (for instance, star Zooey Deschanel is on maternity leave having just given birth to her second child), most if not all main cast members would not be able to return to work until the fall. With the logistical challenges, no space on the midseason schedule and a Season 6 finale that tied in a bow so many loose ends, the network leaned heavily toward not going with a seventh season.\n\nThat’s when I hear creator/executive producer Liz Meriwether made a last-minute call and pitched a final-season arc that turned the tide. I hear it features a time jump, with Season 7 picking up three years after the Season 6 finale, in which Jess (Deschanel) and Nick (Jake Johnson) rekindled their romance, Cece (Hannah Simone) and Schmidt (Max Greenfield) became expectant parents, and Winston (Lamorne Morris) called his father.\n\nI hear Season 7 would feature major milestones for all main characters over the period of one year, including a big one in the series finale.\n\nI hear that pitch got everyone excited. Fox’s midseason schedule was revisited. After some discussions, the network’s executives were able to find a stretch of eight weeks for New Girl. Next, the actors’ deals had to be renegotiated to lower their guarantees from 13 to eight. When that was also done, with not a minute to spare, New Girl was officially renewed Sunday, just a day before Fox’s upfront presentation.\n\nSo, after a roller-coaster final stretch, a show with a long and successful history on Fox will get a proper send-off from the network and give fans a chance to say goodbye, instead of an after-the fact cancellation.", "images": ["https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png", "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://deadline.com/wp-content/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://deadline.com/wp-content/uploads/2017/05/new_girl_s6finale.jpg", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1"], "top_img": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png", "keywords": [], "authors": ["Nellie Andreeva"], "canonical_link": "https://deadline.com/2017/05/new-girl-final-season-details-cancellation-avoided-fox-1202094465/", "title": "‘New Girl’: Final Season Details & How Last-Minute Renewal Was Clinched", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "How Fox's New Girl went from a shoo-in for a 13-episode final season to the brink of cancellation to an eight-episode renewal.", "news_keywords": "Fox, New Girl, Zooey Deschanel", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=533209613", "generator": "WordPress 6.0.2", "author": "Nellie Andreeva", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Deadline", "application-name": "Deadline", "content_type": "Article", "post_id": 1202094465, "title": "'New Girl': Final Season Details & How Last-Minute Renewal Was Clinched", "published_at": "2017-05-15 19:28:51", "image": "https://deadline.com/wp-content/uploads/2017/05/new_girl_s6finale.jpg?w=296&h=166&crop=1", "comment_count": 17, "tags": "Zooey Deschanel", "topics": "TV", "body": "The upcoming eight-episode seventh and final season of Fox's New Girl, which was picked up yesterday, will feature a time jump. But before we get to that and other details about Season 7, let's look back at the wild past few days when the comedy series went from a shoo-in for a 13-episode final season to the brink of cancellation to an eight-episode renewal.\r\n\r\nNew Girl has been an important show for Fox and sibling 20th TV: It was the network's first big comedy hit in a long time, it became the first big SVOD sale of a current broadcast comedy series to Netflix for a reported $900,000 an episode, and six seasons in it continues to be Fox's highest-rated comedy series. So when the Season 6 finale came and went last month, everyone assumed the comedy was getting one more chapter for a proper sendoff. But as broadcast series renewals and cancellations started rolling in midway through last week, a shocker hit the rumor mill -- New Girl was getting canceled. While the show did not officially get the ax, it came very, very close to it.\r\n\r\nI hear that was because of various reasons (for instance, star Zooey Deschanel is on maternity leave having just given birth to her second child), most if not all main cast members would not be able to return to work until the fall. With the logistical challenges, no space on the midseason schedule and a Season 6 finale that tied in a bow so many loose ends, the network leaned heavily toward not going with a seventh season.\r\n\r\n\r\n\r\n\r\n\r\nThat's when I hear creator/executive producer Liz Meriwether made a last-minute call and pitched a final-season arc that turned the tide. I hear it features a time jump, with Season 7 picking up three years after the Season 6 finale, in which Jess (Deschanel) and Nick (Jake Johnson) rekindled their romance, Cece (Hannah Simone) and Schmidt (Max Greenfield) became expectant parents, and Winston (Lamorne Morris) called his father.\r\n\r\nI hear Season 7 would feature major milestones for all main characters over the period of one year, including a big one in the series finale.\r\n\r\nI hear that pitch got everyone excited. Fox's midseason schedule was revisited. After some discussions, the network's executives were able to find a stretch of eight weeks for New Girl. Next, the actors' deals had to be renegotiated to lower their guarantees from 13 to eight. When that was also done, with not a minute to spare, New Girl was officially renewed Sunday, just a day before Fox's upfront presentation.\r\n\r\nSo, after a roller-coaster final stretch, a show with a long and successful history on Fox will get a proper send-off from the network and give fans a chance to say goodbye, instead of an after-the fact cancellation.", "fb": {"pages": 105558754896}, "onesignal": "wordpress-plugin", "fragment": "!", "og": {"type": "article", "title": "‘New Girl’: Final Season Details & How Last-Minute Renewal Was Clinched", "url": "https://deadline.com/2017/05/new-girl-final-season-details-cancellation-avoided-fox-1202094465/", "description": "The upcoming eight-episode seventh and final season of Fox’s New Girl, which was picked up yesterday, will feature a time jump. But before we get to that and other details about Season 7, let…", "site_name": "Deadline", "image": {"identifier": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png", "width": 511, "height": 511}, "locale": "en_US"}, "article": {"published_time": "2017-05-16T02:28:51+00:00", "modified_time": "2017-05-18T19:23:29+00:00"}, "twitter": {"site": "@DEADLINE", "creator": "@DeadlineNellie", "card": "summary_large_image", "title": "‘New Girl’: Final Season Details & How Last-Minute Renewal Was Clinched", "description": "How Fox's New Girl went from a shoo-in for a 13-episode final season to the brink of cancellation to an eight-episode renewal."}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1494901731.0, "source": "https://deadline.com", "summary": ""}