{"url": "www.gobankingrates.com/net-worth/celebrities/kanye-west-net-worth/", "text": "How Much Kanye West Is Worth As He Turns 45?\n\nMediaPunch/Shutterstock / MediaPunch/Shutterstock\n\nThere’s no question Kanye West is a very rich man. The only question is just how much wealth the rapper, fashion designer and entrepreneur has amassed. As West turns 45 on June 8, he is worth $2 billion, according to Forbes. Or, as estimated by Celebrity Net Worth, he’s worth $6.6 billion. Either way, West is a success story. Read More: 10 Richest People in the World\n\nLearn: Best Cities To Retire on a Budget of $1,500 a Month He’s also a father of four children, shared with ex-wife Kim Kardashian. And he can sometimes be confusing or controversial. Last October, he legally changed name to Ye (pronounced yay). He once claimed to be $53 million in debt before asking Facebook founder, Mark Zuckerberg, to invest $1 billion in him and his ideas. He briefly entered the 2020 presidential race. And once Kardashian went public with her new boyfriend, Pete Davidson of “Saturday Night Live” fame, West trolled them both on social media. Whatever his net worth, it’s clear that West has built an enormous fortune from a combination of business ventures after breaking into the music scene with his 2004 debut album, “The College Dropout.” However, you might be surprised by just how much more than music contributes to his overall wealth as we dive into how the world-famous entrepreneur got his start.\n\nEarly Life and Rise to Music Stardom\n\nBorn Kanye Omari West on June 8, 1977, in Atlanta. West lived with his parents, Ray and Donda West, for three years until their divorce. He and his mother then relocated to Chicago and even lived in China for a year when Kanye was 10, a period he has said had a huge impact on his life. Donda played a tremendous role as both his mother and manager, publishing the book “Raising Kanye: Life Lessons from the Mother of a Hip-Hop Superstar” just six months before her passing in November 2007 due to surgery complications.\n\nMake Your Money Work Better for You\n\nThe American rapper, producer, fashion designer and entrepreneur began his music career in 2000 as a producer for Jay-Z’s Roc-A-Fella Records, working with artists like Alicia Keys, John Legend and Janet Jackson. In 2002, West was in a severe car crash that left his jaw wired shut and inspired the track “Through the Wire,” which featured on “The College Dropout.” The album was titled appropriately, as West had dropped out of Chicago’s American Academy of Art to pursue music.\n\nPoll: Do You Think the Baby Formula Shortage Will End Soon?\n\nThe album received 10 Grammy nominations and a certified triple platinum in the U.S, making West a star. With his newfound fame, he continued to release albums: “Late Registration” in 2005, “Graduation” in 2007, “808s & Heartbreak” in 2008, “My Beautiful Dark Twisted Fantasy” in 2010, a collaboration album with Jay-Z titled “Watch the Throne” in 2011, “Yeezus” in 2013, “The Life of Pablo” in 2016, “Ye” in 2018 and “Jesus is King” in 2019. He added “Donda,” named for his late mother, to the collection in 2021, marking his 10th solo album.\n\nMake Your Money Work Better for You\n\nWest is no stranger to accolades, either. He boasts 21 Grammys and 70 Grammy nominations, as well as his albums “Yeezus” and “The Life of Pablo” both reaching the No.1 position on the Hot 200 Billboard chart.\n\nWest has produced music for the likes of 6ix9ine, XXXTentacion, Lil Pump, Chance the Rapper, Kid Cudi and Teyana Taylor. Even so, his musical endeavors account for just part of his wealth. Forbes lists him as No. 5 on its 2022 list of highest-earning celebrities at $235 million, based largely on the success of his Yeezys line of sneakers for Adidas.\n\nFashioning a Career\n\nWest’s career in the fashion industry started from a sneaker collaboration project between Nike and himself — Air Yeezys — which launched in 2007. The cult following for West’s designs quickly grew and eventually lead to a 10-year contract with Nike’s rival company Adidas in 2013. Two years later, the Yeezy Boost 350 sneaker was born, which created an insane resale value. The coveted shoes skyrocketed in price online, which sneaker-heads lapped up like milk from a spoon.\n\nMake Your Money Work Better for You\n\nThe iconic sneakers placed Kanye in a world of his own, and consumers haven’t tired of them. According to Footwear News, the Adidas Yeezy Boost 350 V2 “Beluga 3.0” will release this fall.\n\nIn June 2020, West’s Yeezy fashion brand signed a 10-year partnership with Gap to develop clothing for adults and children. Forbes reported that the first Yeezys for the Gap, a jacket and a hoodie, sold out quickly in 2021 and left Gap wanting more offerings. Gap sales of Yeezy products hit $1 billion in the first year of the deal, Forbes said. The Yeezy Gap Engineered by Balenciaga collection debuted this spring. It’s a collection of separates, sweats and outerwear, all largely in grays and blacks.\n\nKim Kardashian Split\n\nWest and Kim Kardashian West announced their split in February 2021 after several public meltdowns and Twitter rants from the artist, in which he compared his life to the Jordan Peele horror movie “Get Out.” The pair had long fought over where they should live and raise their family of four, with West choosing the sanctuary of his 4,524-acre Wyoming ranch and Kim preferring the sprawling hills of Los Angeles, near her large immediate family.\n\nA California judge declared them legally divorced in March 2022, but some financial issues and custody of their four children — North, Saint, Chicago and Psalm — had yet to be settled. Despite Kim selling out her stake in Yeezy earlier this year, Kanye still has holdings in Kim’s lounge and shapewear brand, Skims.\n\nAlthough the settlement has not been finalized, Kardashian reportedly will keep their estate in Hidden Hills, California, near her family, and West will keep the property in Wyoming. While West has a home in Malibu, California, he bought a $4.5 million house across the street from Kim to be near his children, he told Hollywood Unlocked in January. “My solace comes from seeing my kids and getting a solid schedule. That’s why I even got the house,” he said.\n\nOther Business Ventures\n\nKanye has always lived by the motto “Dream Big,” like when he tried to run for president in 2020. However, this has occasionally ended with some of his business ventures failing through the years, including his travel company, Kanye Travel Ventures, a fast-food chain venture with Fatburger and, most recently, his ties to the nonprofit Donda House.\n\nWest has long been philanthropic; in 2011 he and fellow rapper Che “Rhymefest” Smith co-created the nonprofit charity Donda House in his hometown of Chicago to honor his late mother. The charity became the center of a controversy in 2018 when Rhymefest tweeted at rapper Drake for support, stating Kanye abandoned the project.\n\nKim Kardashian took to Twitter to blast Rhymefest, saying he would no longer be featured on Kanye’s album at the time, “Ye.” This backlash came after the nonprofit released a statement in May 2018 that the charity was unable to secure funding for construction and was distancing itself from Kanye West due to his public support of President Donald Trump. The nonprofit quickly rebranded after the incident to Art of Culture, Inc. and separated its ties from Kanye altogether.\n\nWest’s latest venture is Donda Sports, which will represent athletes in their endeavors on and off the field, including with endorsements for apparel, shoes and more. Jaylen Brown of the Boston Celtics and Aaron Donald of the Los Angeles Rams were among the first athletes to sign.\n\nMore From GOBankingRates\n\nJami Farkas contributed to the reporting for this article.", "images": ["https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/best-banks-2021/spinner-solid.svg.gzip", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/fortune.png", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/best-banks-2021/times-light.svg.gzip", "https://cdn.gobankingrates.com/wp-content/uploads/2022/09/close_img.png", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/icon-right-arrow-blue.svg.gzip", "https://cdn.gobankingrates.com/wp-content/uploads/2022/09/Retireatanyage9-22navimage.jpg", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/gbr-logo.svg.gzip", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/msn.png", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/aol.png", "http://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/img/logo-zergnet.png", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/time-money.png", "https://cdn.gobankingrates.com/wp-content/uploads/2022/04/300x250-V2.png", "https://cdn.gobankingrates.com/wp-content/uploads/2021/06/Untitled-design-1.png?w=352&quality=75", "https://cdn.gobankingrates.com/wp-content/uploads/2021/07/image_6487327-2-150x150.jpg", "https://cdn.gobankingrates.com/wp-content/uploads/2021/06/newsletter-cta-bg-desktop.png?w=653&quality=1", "https://cdn.gobankingrates.com/wp-content/uploads/2022/06/shutterstock_editorial_12847842e112-scaled.jpg?w=675&quality=75", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/cbs.png", "https://cdn.gobankingrates.com/wp-content/uploads/2022/01/version2-300x250.png.png", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/cnn-money.png", "https://cdn.gobankingrates.com/wp-content/uploads/2022/06/shutterstock_editorial_12847842e112-scaled.jpg", "https://cdn.gobankingrates.com/wp-content/uploads/2021/06/The-GBR-Closer-icon.png"], "top_img": "https://cdn.gobankingrates.com/wp-content/uploads/2022/06/shutterstock_editorial_12847842e112-scaled.jpg", "keywords": [], "authors": ["Katherine Hoey", "About The Author", "Katherine Hoey Is A Freelance Journalist Currently Living In Miami. The Long Island Native Graduated With A Ba The School Of Journalism At Stony Brook University. She Won The Folio Award The Fair Media Council For Best Use Of Instagram.", "Learn More"], "canonical_link": "https://www.gobankingrates.com/net-worth/celebrities/kanye-west-net-worth/", "title": "How Much Kanye West Is Worth As He Turns 45?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, shrink-to-fit=no", "robots": "max-image-preview:large", "description": "There's no question Kanye West is a very rich man. The only question is just how much wealth the rapper, fashion designer and entrepreneur has amassed. As West turns 45 on June 8, he is worth $2...", "keywords": "GOBankingRates,celebrities,net worth", "og": {"title": "How Much Kanye West Is Worth As He Turns 45?", "type": "article", "url": "https://www.gobankingrates.com/net-worth/celebrities/kanye-west-net-worth/", "image": "https://cdn.gobankingrates.com/wp-content/uploads/2022/06/shutterstock_editorial_12847842e112-scaled.jpg", "site_name": "GOBankingRates", "description": "Kanye is on his way to being the richest Black man in America."}, "article": {"published_time": "2021-01-14T16:34:23Z", "modified_time": "2022-06-08T04:01:26Z"}, "twitter": {"card": "summary_large_image", "title": "How Much Kanye West Is Worth As He Turns 45?", "description": "Kanye is on his way to being the richest Black man in America.", "image": "https://cdn.gobankingrates.com/wp-content/uploads/2022/06/shutterstock_editorial_12847842e112-scaled.jpg"}, "google-site-verification": "UM4IRrnbuHbpidFzGcubzUTnYM2nSbbsENyWzajsLtg", "p": {"domain_verify": "5c213d8c1e1470fb2409d7569153017a"}, "msvalidate.01": "835EF260572EA20ACFC7CE1547620982", "fb": {"pages": 191525857260}, "original-source": "https://www.gobankingrates.com/net-worth/celebrities/kanye-west-net-worth/", "thumbnail": "https://cdn.gobankingrates.com/wp-content/uploads/2022/06/shutterstock_editorial_12847842e112-scaled.jpg", "msapplication-TileImage": "https://cdn.gobankingrates.com/wp-content/uploads/2017/04/cropped-gbr-logo_go_site_id-270x270.png"}, "movies": [], "publish_date": 1610642063.0, "source": "http://www.gobankingrates.com", "summary": ""}