{"url": "https://variety.com/2017/tv/news/cbs-tca-1202512241/", "text": "CBS’ new top programming executives addressed the network’s struggles with onscreen diversity Tuesday — including the recent controversy over the departure of two Asian actors from “Hawaii Five-0.”\n\n“We love both those actors and did not want to lose them,” CBS Entertainment president Kelly Kahl said at the Television Critics Association press tour on Tuesday. “We made very, very strong attempts to keep them and offered them a lot of money to stick around.”\n\nIn June, actors Daniel Dae Kim and Grace Park exited “Hawaii Five-O.” As Variety reported at the time, the actors had been seeking equal pay with stars Alex O’Loughlin and Scott Caan, but failed to reach deals with CBS Television Studios, which produces the series.\n\nThe departure of the show’s only two series regulars of Asian descent over a salary dispute involving the pay scale of their white co-stars sparked criticism of CBS on social media and in the press.\n\nKahl did not go into details of the negotiation, saying, “In my mind it was purely a business transaction.” He characterized the departure of veteran actors as natural for a show entering its eighth season. “It’s happened on ‘CSI,’ it’s happened on ‘Grey’s Anatomy,’ it’s happened on ‘Law and Order: SVU.'”\n\nKahl appeared at TCA alongside senior executive vice president Thom Sherman. The two fielded multiple questions about the network’s poor record with diversity in front of and behind the camera, with one reporter noting that CBS has failed to put a new series with a female lead on the air for two seasons running.\n\n“We had six pilots with female leads and the way things turned out those pilots were not deemed to be as good as the pilots that were picked up,” Sherman said.\n\nSherman and Kahl did not handle the development slate that led to the upcoming season’s crop of new shows. Kahl, a 21-year veteran of the network and its longtime scheduling chief, was named CBS entertainment president in May. His promotion came with the departure of Glenn Geller, who stepped down as the network’s top programming executive following a mild heart attack suffered in March. As part of the restructuring, Sherman was recruited from sister network the CW to head programming under Kahl.\n\nReporters also grilled Kahl and Sherman on CBS’ casting department, which is staffed entirely by white casting directors, and how it has affected the onscreen diversity or lack thereof in CBS’ series.\n\n“I personally don’t think that has anything to do with it,” Kahl said, adding of the casting department, “They’re fantastic at what they do,” and noting that it has “cast many diverse roles in the past.”\n\nPressed on why the department is staffed entirely by white casting directors, Sherman said, “They’ve been together for a long time. That’s the department as its been. But we are cognizant of the issue. We hear you, and we will be looking to expand the casting department.”\n\nAs his predecessors have, Kahl defended CBS’ diversity record and promised it would continue to improve.\n\n“We can debate the pace of the change, but there is change happening at CBS,” Kahl said, noting an overall uptick in diverse series regulars in recent years. “Every single drama on our air has at least one diverse regular character.”\n\nHe added, “We said in the past that we’re going to do better, and we are doing better.”", "images": ["https://variety.com/wp-content/themes/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://variety.com/wp-content/uploads/2017/08/kelly-kahl-thom-sherman.jpg?w=681&h=383&crop=1", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://variety.com/wp-content/uploads/2017/08/kelly-kahl-thom-sherman.jpg?w=1000", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif"], "top_img": "https://variety.com/wp-content/uploads/2017/08/kelly-kahl-thom-sherman.jpg?w=1000", "keywords": [], "authors": ["Daniel Holloway"], "canonical_link": "https://variety.com/2017/tv/news/cbs-tca-1202512241/", "title": "CBS Chiefs: ‘Hawaii Five-0’ Actors Were Offered ‘a Lot of Money to Stick Around’", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://variety.com/wp-content/themes/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "CBS' programming execs addressed the network's struggles with diversity including the controversy over the departure of two Asian actors from 'Hawaii Five-0.'", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199, "pages": 12616252196}, "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202512241, "author": "Daniel Holloway", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-08-01T12:20:40"}, "pmc-tag": "CBS,Hawaii Five-0,TCA", "title": "CBS Chiefs: ‘Hawaii Five-0’ Actors Were Offered ‘a Lot of Money to Stick Around’", "pageclass": "article", "pmc-vertical": "tv", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress 6.0.2", "author": "Daniel Holloway", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Variety", "application-name": "Variety", "content_type": "Article", "post_id": 1202512241, "title": "CBS Chiefs: 'Hawaii Five-0' Actors Were Offered 'a Lot of Money to Stick Around'", "published_at": "2017-08-01 12:20:40", "image": "https://variety.com/wp-content/uploads/2017/08/kelly-kahl-thom-sherman.jpg?w=1000", "comment_count": 35, "tags": "TCA", "topics": "News", "appeared_in_print": "No", "body": "CBS' new top programming executives addressed the network's struggles with onscreen diversity Tuesday — including the recent controversy over the departure of two Asian actors from \"Hawaii Five-0.\"\r\n\r\n\"We love both those actors and did not want to lose them,\" CBS Entertainment president Kelly Kahl said at the Television Critics Association press tour on Tuesday. \"We made very, very strong attempts to keep them and offered them a lot of money to stick around.\"\r\n\r\nIn June, actors Daniel Dae Kim and Grace Park exited \"Hawaii Five-O.\" As Variety reported at the time, the actors had been seeking equal pay with stars Alex O’Loughlin and Scott Caan, but failed to reach deals with CBS Television Studios, which produces the series.\r\n\r\nThe departure of the show's only two series regulars of Asian descent over a salary dispute involving the pay scale of their white co-stars sparked criticism of CBS on social media and in the press.\r\n\r\nKahl did not go into details of the negotiation, saying, \"In my mind it was purely a business transaction.\" He characterized the departure of veteran actors as natural for a show entering its eighth season. \"It's happened on 'CSI,' it's happened on 'Grey's Anatomy,' it's happened on 'Law and Order: SVU.'\"\r\n\r\n\r\n\r\nKahl appeared at TCA alongside senior executive vice president Thom Sherman. The two fielded multiple questions about the network's poor record with diversity in front of and behind the camera, with one reporter noting that CBS has failed to put a new series with a female lead on the air for two seasons running.\r\n\r\n\"We had six pilots with female leads and the way things turned out those pilots were not deemed to be as good as the pilots that were picked up,\" Sherman said.\r\n\r\nSherman and Kahl did not handle the development slate that led to the upcoming season's crop of new shows. Kahl, a 21-year veteran of the network and its longtime scheduling chief, was named CBS entertainment president in May. His promotion came with the departure of Glenn Geller, who stepped down as the network's top programming executive following a mild heart attack suffered in March. As part of the restructuring, Sherman was recruited from sister network the CW to head programming under Kahl.\r\n\r\nReporters also grilled Kahl and Sherman on CBS' casting department, which is staffed entirely by white casting directors, and how it has affected the onscreen diversity or lack thereof in CBS' series.\r\n\r\n\"I personally don't think that has anything to do with it,\" Kahl said, adding of the casting department, \"They're fantastic at what they do,\" and noting that it has \"cast many diverse roles in the past.\"\r\n\r\nPressed on why the department is staffed entirely by white casting directors, Sherman said, \"They've been together for a long time. That's the department as its been. But we are cognizant of the issue. We hear you, and we will be looking to expand the casting department.\"\r\n\r\nAs his predecessors have, Kahl defended CBS' diversity record and promised it would continue to improve.\r\n\r\n\"We can debate the pace of the change, but there is change happening at CBS,\" Kahl said, noting an overall uptick in diverse series regulars in recent years. \"Every single drama on our air has at least one diverse regular character.\"\r\n\r\nHe added, \"We said in the past that we're going to do better, and we are doing better.\"", "fragment": "!", "og": {"type": "article", "title": "CBS Chiefs: ‘Hawaii Five-0’ Actors Were Offered ‘a Lot of Money to Stick Around’", "url": "https://variety.com/2017/tv/news/cbs-tca-1202512241/", "description": "CBS’ new top programming executives addressed the network’s struggles with onscreen diversity Tuesday — including the recent controversy over the departure of two Asian actors from &#82…", "site_name": "Variety", "image": {"identifier": "https://variety.com/wp-content/uploads/2017/08/kelly-kahl-thom-sherman.jpg?w=1000", "width": 1000, "height": 563, "alt": "Kelly Kahl Thom Sherman"}, "locale": "en_US"}, "article": {"published_time": "2017-08-01T19:20:40+00:00", "modified_time": "2017-08-01T19:46:10+00:00"}, "twitter": {"site": "@variety", "creator": "@gdanielholloway", "card": "summary_large_image", "title": "CBS Chiefs: ‘Hawaii Five-0’ Actors Were Offered ‘a Lot of Money to Stick Around’", "description": "CBS' programming execs addressed the network's struggles with diversity including the controversy over the departure of two Asian actors from 'Hawaii Five-0.'", "image": "https://variety.com/wp-content/uploads/2017/08/kelly-kahl-thom-sherman.jpg?w=1000"}}, "movies": [], "publish_date": 1501615240.0, "source": "https://variety.com", "summary": ""}