{"url": "https://www.mjsbigblog.com/ryan-seacrest-on-gut-wrenching-accusation-dwts-tour-bus-accident.htm", "text": "Reminder: The Voice season 14 Knockout Rounds are filming today at Universal Studios. The Top 20 will be revealed!\n\nRyan Seacrest: What Happened After I Was Wrongly Accused of Harassment – In November, I received a letter from a lawyer representing a former show stylist. She claimed that I mistreated her more than a decade ago when we worked together. This arrived during an unprecedented public reckoning by women in our industry and beyond, courageously coming forward to share their stories, many of them heartbreaking. These women sought to bring attention to the systemic gender inequality that has occurred for decades. I was — and am — amazed at their bravery. To have my workplace conduct questioned was gut-wrenching. I’ve always aimed to treat all of my colleagues with honesty, respect, kindness and compassion. Yet, I knew, regardless of the confidence I had that there was no merit to the allegations, my name would likely soon appear on the lists of those suspected of despicable words and deeds. The pressures of our overflowing newsfeeds would insist on it. – Read more at The Hollywood Reporter\n\nDWTS members ‘fine’ after being involved in 50-car pile-up in Iowa – Cast and crew of “Dancing with the Stars: Live! Light Up The Night” are OK after being involved in a 50-car pile-up caused by severe weather conditions in Iowa, officials said. Iowa State Patrol Sgt. Nathan Ludwig said roughly 50 vehicles were involved in a weather-related crash on Interstate 35 in Ames on Monday. About half a dozen people were critically injured, and at least one person died as a result of the wreck. A spokesperson for “Dancing with the Stars: Live! Light Up The Night” said one of the tour buses transporting cast and crew of the show was involved in the accident. All cast and crew members were said to be “fine,” with some recovering from minor injuries, the press release stated. Monday night’s show at Stephens Auditorium in Ames was canceled for the safety and health of the cast and crew, the spokesperson said. – Read more at ABC7\n\nJessica Meuse Named Best Female Artist Finalist In 14th Annual IAMA Awards – Jessica Meuse has been included on the Best Female Artist Finalist List in the 14th Annual IAMA (International Acoustic Music Awards). Her forthcoming original song, “Novocain,” was entered into the competition and it will be included on her upcoming 2018 full-length album release on Warrior Records. The IAMA will be announcing their top winners on February 7th. “Being on the list of IAMA Best Female Artists Finalists is an honor and I’m very thankful for the opportunity to be a part of this year’s awards,” noted Jessica. “Having my new composition, ‘Novocain,’ on the list is one of the best ways to kick off 2018 and I’m excited to see how things turn out on February 7!” – Read more at Einnews.com\n\nFort Wayne’s Addison Agen recording her next album at Sweetwater – Addison Agen begins work this week on recording her second album, and she’ll be doing it at Sweetwater. Fans may get their hands on it by this spring. The expiration date has passed for all NBC recording contract obligations associated with being a contestant on “The Voice,” so she is free to make her own recording arrangements, Addison, 16, said during an interview Friday with News-Sentinel.com. “They (Sweetwater) have become a big part of my team,” Addison said. She plans a 10-song album that Sweetwater said should be released this spring. – Read more at News-Sentinel.com\n\nPlano Musician Ron Bultongez to Appear on “American Idol” – When the reboot of “American Idol” returns to television on March 11, a Plano musician may be seeking your votes. Local singer/songwriter Ron Bultongez has confirmed he auditioned in front of the celebrity judges, but cannot say how far along in the competition he got. He traveled to L.A. on Jan. 21 for the TV show and is still there, performing in local venues. Tonight he was finally allowed to announce his big news on social media. Ron has been performing live throughout Plano and DFW for the past few years. Planoites might recognize him from recurring performances in our Downtown Plano Art & Wine Walks. He cites his biggest musical influences as Michael Jackson, Jimi Hendrix, James Bay, John Mayer, Aquilo and Kanye West, and he released his “Thank You Plano” EP at the end of 2017. – Read more at Plano Magazine.com\n\nSt. Louis singers showing up on upcoming seasons on ‘The Voice,’ ‘American Idol’ – It looks like St. Louis singers will have a real presence on the reboot of “American Idol” in March on ABC and the return of “The Voice” in February on NBC. Promos are revealing some familiar faces on the scene. – Read more at St. Louis Dispatch\n\nPop star Jacquie Lee talks to Yahoo Music about mental health, self-care, and her experience being on The Voice\n\nKelly Clarkson Talks Vacationing Without Kids for Super Bowl: ”I’m Panicked!” – “This is legit the first time they’re not with me,” said the “Since You’ve Been Gone” singer. “It’s because they’re not allowed in any of the shows because you have to be 21 and over. I didn’t want them just sitting in a hotel.” The “Stronger” singer added, “My husband was like, ‘Yeah we should probably just leave them back home!’ He’s like a dude who is like, ‘Let’s have a date night!'” “We did get really good sleep last night,” confessed the well-rested mom, who rocked the tailgate show. – Read more at EOnline\n\nLuke Bryan, a Speaker of the Heart – “I think it’s about just being me and carving out who I am as a television personality. I am still having to segue from being just a singer to being on television,” Bryan said. “In my path of judging, I’ve learned to be more blunt. “My style will be polite, critical, but it will evolve through the show,” he said, “and you will see me grow as a judge as I am more comfortable saying the word ‘no.’ I’m not an over-thinker. I’m a speaker of the heart.” – Read more at CMT.com\n\nWATCH NOW: Lauren Alaina explains why Luke Bryan is the perfect “American Idol” judge – “Everyone’s asked me if I think he’s gonna be a good judge…and I absolutely do because he’s been so good to me,” she told ABC Radio. “It’s been such a crucial few years of my career and he’s really been supportive, and the advice he gives is amazing.” Lauren’s toured with Luke several times, and she says he’d sometimes take her aside and give her some guidance. “For him to take time to do that just shows that he cares about new talent and people,” she explained. “And I think those are really good things for a judge to have.” – See the Video at ABCNewsRadio\n\nKaty Perry: ‘I Don’t Want to Hold On to Childhood Trauma Anymore’ – It’s not easy for me. I was saying the other day that Simon Cowell was my favorite judge because he’s very straight-to-the-point. Most people who are at home watching American Idol—you know, eating food and going about their lives—are thinking either, This person can sing, or, This person can’t. And Simon was that kind of judge. Simon could be mean, because he’s an executive and a man. But you reverse the role, and all of a sudden you’re a bitch. So I’m cautious. People also come in with their stories. And before they even sing one note, they’ll say something like, “I’m homeless,” and that will impact the way you perceive them. But if they really can’t sing, the personal story has to come second. I hope that I don’t get turned into “the bitch” because of that, but I also know that the music industry does not need just another singer. – Read more at Glamour\n\nLeah LaBelle Had a ‘God-Given Gift’: Producer Andreao ‘Fanatic’ Heard Remembers Late Singer, Talks Plans for Her Unreleased Music – Heard blames “the business side of the industry” for him and LaBelle ultimately parting ways. He says that Labelle was “trapped” once her debut singles didn’t do well and that she’d given up hope on her music career. “The whole purpose of us making music is to touch people and make people feel something,” he said. “I thought we were able to do that with the music that we created, but then the business got in the way.” – Read more at Billboard.com\n\nSinger James Arthur Opens Up About Why He’s ‘Not Just the Guy With an Acoustic Guitar’ – Writing his next big hit. Singer James Arthur is in the studio working on his highly anticipated third album and giving Us Weekly some details on how his time in the studio is coming along. “[It’s] my happy place. I love being in the studio again and coming up with new ideas and concepts,” he tells Us. “I think the new album and sound will be quite different to my last album. I like experimenting and trying new things.” – Read more at Us Magazine\n\nFormer Philadelphia Eagles long snapper Jon Dorenbos will get Super Bowl ring – The long snapper won the hearts of fans in Philadelphia with his personality and magic tricks that led him to appear on America’s Got Talent. He spent 11 years in Philadelphia before he was traded to New Orleans. A New Orleans Saints team doctor discovered he needed surgery to treat an aortic aneurysm back in September and he underwent surgery at UPenn in October. Dorenbos was invited to the Super Bowl by Eagles owner Jeffrey Lurie. “Had I played, I’d die. If you can’t play in it, this is the next best way to enjoy it,” Dorenbos told The Advocate . “Mr. Lurie called me and said he wants me to be a part of it, said I was here a long time and he said ‘We’re going to win this, and you’re going to get a ring.” – Read more at FOX29", "images": ["https://www.mjsbigblog.com/wp-content/uploads/2022/08/118742_2478b-678x381.jpg", "https://www.mjsbigblog.com/wp-content/uploads/2018/01/The-Bachelor-2018-ARIE-LUYENDYK-JR..jpg", "https://secure.gravatar.com/avatar/455653fe2cbff64e10171e81e425b647?s=125&d=blank&r=pg", "https://www.mjsbigblog.com/wp-content/uploads/2022/10/image-678x381.png", "https://www.mjsbigblog.com/wp-content/uploads/2018/02/Carrie-Underwood-Super-Bowl-open.jpg", "https://www.mjsbigblog.com/wp-content/uploads/2022/07/Harry-Styles-Late-Night-Talking-Music-Video-678x381.jpg", "https://www.mjsbigblog.com/wp-content/uploads/2018/01/Ryan-Seacrest-American-Idol-Hollywood-Week-1.jpg", "https://www.mjsbigblog.com/wp-content/uploads/2022/06/MS-episode-2038-678x381.jpg"], "top_img": "https://www.mjsbigblog.com/wp-content/uploads/2018/01/Ryan-Seacrest-American-Idol-Hollywood-Week-1.jpg", "keywords": [], "authors": ["Mj Santilli", "About Mj Santilli", "Founder", "Editor Of Mjsbigblog.Com", "Home Of The Awesomest Fan Community On The Net. I Love Cheesy Singing Shows Of All Kinds", "Whether Reality Or Scripted.", "I Adore American Idol", "But Also Love The Voice", "Glee", "X Factor"], "canonical_link": "https://www.mjsbigblog.com/ryan-seacrest-on-gut-wrenching-accusation-dwts-tour-bus-accident.htm", "title": "Headlines: Ryan Seacrest on Gut Wrenching Accusation, DWTS Tour Bus Accident", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Headlines: Ryan Seacrest on \"Gut Wrenching\" sexual harassment accusation, DWTS Tour bus involved in 50 car pileup, Addison Agen begins album for spring release.", "og": {"locale": "en_US", "type": "article", "title": "Headlines: Ryan Seacrest on Gut Wrenching Accusation, DWTS Tour Bus Accident", "description": "Headlines: Ryan Seacrest on \"Gut Wrenching\" sexual harassment accusation, DWTS Tour bus involved in 50 car pileup, Addison Agen begins album for spring release.", "url": "https://www.mjsbigblog.com/ryan-seacrest-on-gut-wrenching-accusation-dwts-tour-bus-accident.htm", "site_name": "mjsbigblog", "image": {"identifier": "https://www.mjsbigblog.com/wp-content/uploads/2018/01/Ryan-Seacrest-American-Idol-Hollywood-Week-1.jpg", "width": 640, "height": 427, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/mjsbigblog", "published_time": "2018-02-06T10:58:46+00:00", "modified_time": "2018-02-06T18:29:25+00:00"}, "author": "mj santilli", "twitter": {"card": "summary_large_image", "creator": "@mjsbigblog", "site": "@mjsbigblog"}, "fb": {"pages": 149167088472346}, "google-site-verification": "wdTD6pJAxAL5RV6bl6UFLJnMpNriD1vZNzZpCgHcAho", "p": {"domain_verify": "8d7ab242a64f52b929d2d8d2fa55fa52"}, "msapplication-TileImage": "https://www.mjsbigblog.com/wp-content/uploads/2017/03/cropped-mjsbigblog-icon-2-270x270.jpg"}, "movies": [], "publish_date": 1517914726.0, "source": "https://www.mjsbigblog.com", "summary": ""}