{"url": "www.inquisitr.com/4762190/robert-pattinson-2018-kristen-stewarts-ex-reportedly-flirting-with-kylie-minogue-bella-hadid-and-katy-perry/", "text": "Many fans were shocked when it was first confirmed that Robert Pattinson ended his relationship with FKA Twigs after many years of dating. Speculation about the former couple's breakup sparked after the Twilight actor said that he was \"kind of\" engaged to the \"Pendulum\" singer during an appearance on The Howard Stern Show in July 2017. New reports suggest that the former beau of Kristen Stewart is now ready to move on from the English musician.\n\nRumors have it that Robert Pattinson is exclusively seeing Kylie Minogue. A mutual pal reportedly set up Kristen Stewart's ex-boyfriend and the \"Can't Get You out of My Head\" songstress in December 2017. It was even claimed that Kylie brought the Twilight actor to her Melbourne flat.\n\n\"They have a lot in common and seem to like each other a lot.\"\n\nAside from Kylie Minogue, Robert Pattinson was also linked to Bella Hadid lately. The Cosmopolis star and Gigi Hadid's younger sister sparked romance rumors after they were allegedly spotted getting flirty with each other at the recent Dior Homme Menswear show in Paris. HollywoodLife shared that Robert and Bella \"make a good looking couple\" while posing for photos at the event. The publication shared that brief encounter possibly \"hints at a new relationship.\"\n\nEarlier this week, an unnamed Wonderwall source claimed that Robert Pattinson was seen kissing Katy Perry in Los Angeles. Together with their pals, the former Twilight star and the \"Roar\" singer reportedly had dinner at Taix French Restaurant in Echo Park on Friday, Feb. 26. The eyewitness claimed that Robert and Katy were \"making out,\" adding that they look like a real couple.\n\nPrior to the most recent claim, Robert Pattinson and Katy Perry have repeatedly denied the reports saying that they are dating. The duo has emphasized that they are just close to each other. \"He's my bud, I'm like his big sister,\" the \"Thinking of You\" hitmaker previously said.\n\nWhile these dating reports could be true, Gossip Cop has already debunked these rumors. The news outlet stated that Robert Pattinson and Kylie Minogue had not developed a romance despite the dating reports. An unnamed tipster also revealed to the publication that the former beau of Kristen Stewart did not cozy up with Bella Hadid and described the claim as \"wrong\" and \"dumb.\"", "images": ["https://imgb.srgcdn.com/d258d2ec-e52b-4489-9950-908cc366bacf.jpg", "https://www.inquisitr.com/wp-content/uploads/2020/07/Ashley-Benson.jpg", "https://imgb.srgcdn.com/fe42e24b-1fa1-4cf2-b7ef-0bcd25a6f5c9.png", "https://secure.gravatar.com/avatar/7203b89913763ccf66c16beb9c3a7020?s=800", "https://imgb.srgcdn.com/1740626a-9ecf-4723-b66a-d7ca5e1d678c.jpg", "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "https://imgb.srgcdn.com/a5ba8e20-c5b5-4c82-ae2b-4f343261a07b.jpg", "https://imgb.srgcdn.com/6977b3f9-ffc5-44c5-866c-e80c13668077.jpg"], "top_img": "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.inquisitr.com/4762190/robert-pattinson-2018-kristen-stewarts-ex-reportedly-flirting-with-kylie-minogue-bella-hadid-and-katy-perry/", "title": "Robert Pattinson 2018: Kristen Stewart's Ex Reportedly Flirting With Kylie Minogue, Bella Hadid And Katy Perry", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimal-ui, user-scalable=no", "msapplication-TileImage": "/static/inquisitr/favicon-128x128.png", "robots": "max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Robert Pattinson 2018: Kristen Stewart's Ex Reportedly Flirting With Kylie Minogue, Bella Hadid And Katy Perry", "url": "https://www.inquisitr.com/4762190/robert-pattinson-2018-kristen-stewarts-ex-reportedly-flirting-with-kylie-minogue-bella-hadid-and-katy-perry/", "site_name": "The Inquisitr", "description": "Robert Pattinson 2018: Kristen Stewart's Ex Reportedly Flirting With Kylie Minogue, Bella Hadid And Katy Perry", "updated_time": "2021-08-16 18:13:43Z"}, "article": {"modified_time": "2021-08-16 18:13:43Z", "published_time": "2018-01-30 13:44:16Z", "section": "Rumors"}, "description": "Robert Pattinson 2018: Kristen Stewart's Ex Reportedly Flirting With Kylie Minogue, Bella Hadid And Katy Perry", "keywords": "Rumors", "twitter": {"card": "summary_large_image"}}, "movies": [], "publish_date": 1517319856.0, "source": "http://www.inquisitr.com", "summary": ""}