{"url": "en.wikipedia.org/wiki/Meghan,_Duchess_of_Sussex", "text": "Member of the British royal family and former actress (born 1981)\n\n\"Duchess of Sussex\" redirects here. For the title, see Duke of Sussex\n\nMeghan, Duchess of Sussex ( ; born Rachel Meghan Markle; August 4, 1981) is an American member of the British royal family and former actress. She is the wife of Prince Harry, Duke of Sussex, the younger son of King Charles III.\n\nMeghan was born and raised in Los Angeles, California. Her acting career began at Northwestern University; her last and most significant screen role was that of Rachel Zane for seven seasons (2011–2018) in the American TV legal drama Suits. She also developed a social media presence. This included The Tig (2014–2017) lifestyle blog which garnered recognition for her fashion sense and led to the creation and release of two clothing lines in 2015–2016. During The Tig period, Meghan became involved in charity work focused primarily on women's issues and social justice. She was married to American film producer Trevor Engelson from 2011 until their divorce in 2013.\n\nMeghan retired from acting upon her marriage to Prince Harry in 2018 and became known as the Duchess of Sussex. They have two children, Archie and Lilibet Mountbatten-Windsor. In January 2020, the pair stepped down as working royals and later settled in California. In October 2020, they launched Archewell Inc., an American public organization that focuses on non-profit activities and creative media ventures. In the following years, she released a picture book for children, The Bench, and launched a Spotify podcast, Archetypes. Meghan and Harry filmed a highly publicized interview with Oprah Winfrey, which was broadcast in March 2021.\n\nEarly life and education\n\nRachel Meghan Markle[1] was born on August 4, 1981, at West Park Hospital in Canoga Park, Los Angeles, California.[2] She identifies as mixed race, often answering questions about her background with \"My dad is Caucasian and my mom is African American. I'm half black and half white.\"[3] Her parents separated when she was two years old and divorced four years later.[4][5][6] Markle's father, Thomas Markle Sr. (born 1944),[7] is an Emmy Award winning television lighting director and director of photography. Notably, he worked as a director of photography and lighting for General Hospital and Married... with Children, and Meghan occasionally visited the set of Married with Children as a child.[8][9]\n\nGrowing up in Los Angeles,[10] Markle attended Hollywood Little Red Schoolhouse.[11][12] At age 11, she and her classmates wrote to Procter & Gamble to gender-neutralize a dishwashing soap commercial on national television.[13] She was raised as a Protestant,[14] but she graduated from L.A.'s Immaculate Heart High School, an all-girl Catholic school.[15] Markle took part in plays and musicals at the school, where her father helped with lighting.[16] During her teenage years, she worked at a local frozen yogurt shop and later as a waitress and babysitter.[17][18] She also volunteered at a soup kitchen in Skid Row, Los Angeles.[19][20] In 1999, she was admitted to Northwestern University (NU) in Evanston, Illinois, where she joined Kappa Kappa Gamma sorority.[21][22] With other members of Kappa Kappa Gamma, Meghan did volunteer work with the Glass Slipper Project. After her junior year, she secured an internship as a junior press officer at the American embassy in Buenos Aires, with the help of her uncle Michael Markle,[23] and considered a political career.[24][25] However, she did not score high enough in the Foreign Service Officer Test to proceed further with the US State Department,[26] and returned to NU. She also attended a study abroad program in Madrid.[22] In 2003, Markle earned her bachelor's degree with a double major in theater and international studies from Northwestern's School of Communication.[24][26]\n\nActing career\n\nAccording to Markle, she had some difficulty getting roles early in her career due to being \"ethnically ambiguous\" because \"I wasn't black enough for the black roles and I wasn't white enough for the white ones.\"[27] To support herself between acting jobs, she worked as a freelance calligrapher and taught bookbinding.[8][28] Her first on-screen appearance was a small role as a nurse in an episode of the daytime soap opera General Hospital,[29][30] a show for which her father served as a lighting director.[31] Markle had small guest roles on the television shows Century City (2004), The War at Home (2006) and CSI: NY (2006).[30] For her role in Century City, she told the casting directors that she was a SAG-AFTRA member when she was not, but after being cast the employers were obliged to help her join the union according to the Taft–Hartley Act.[32] She also did several contract acting and modeling jobs, including a stint as a \"briefcase girl\" on the US-version of the game show Deal or No Deal.[8] She appeared in Fox's series Fringe as Junior Agent Amy Jessup in the first two episodes of its second season.[33]\n\nMarkle appeared in small roles in the films Get Him to the Greek, Remember Me (produced by her then-partner Trevor Engelson) and The Candidate in 2010 and the film Horrible Bosses in 2011.[34] She was paid $187,000 for her role in Remember Me and $171,429 for her role in the short film The Candidate.[35] In July 2011, she joined the cast of the USA Network show Suits through to late 2017 and the seventh season. Her character, Rachel Zane, began as a paralegal and eventually became an attorney.[36] While working on Suits, she lived for nine months each year in Toronto.[37][38] Fortune magazine estimated that she was paid $50,000 per episode, amounting to an equivalent annual salary of $450,000.[39]\n\nPersonal life\n\nFamily relationships\n\nMeghan is now estranged from her father and paternal half-siblings, Samantha Markle and Thomas Markle Jr.[40][41] She has a close relationship with her mother, Doria Ragland (born 1956).[42][43]\n\nEarly relationships and first marriage\n\nMarkle and American film producer Trevor Engelson began dating in 2004.[44][45] They were married in Ocho Rios, Jamaica on September 10, 2011.[46] They separated after approximately 18 months and concluded a no-fault divorce in August 2013,[47] citing irreconcilable differences.[48] Markle's subsequent live-in relationship with Canadian celebrity chef and restaurateur Cory Vitiello ended in May 2016 after almost two years.[49]\n\nSecond marriage and motherhood\n\nMarkle and Prince Harry on Christmas Day 2017\n\nIn July 2016, Markle began a relationship with Prince Harry,[50][51] a grandson of Queen Elizabeth II. In November, the prince directed his communications secretary to release a statement on his behalf to express personal concern about pejorative and false comments made about his girlfriend by mainstream media and internet trolls.[52][53] Later on, in a letter to a British media regulator Markle's representatives complained about the harassment from journalists.[54] In September 2017, Markle and Prince Harry first appeared together in public in Toronto at the Invictus Games, of which Harry is founding patron.[55][56]\n\nMeghan Markle's engagement to Prince Harry was announced on November 27, 2017, by Harry's father Charles III (then the Prince of Wales).[57] The announcement was greeted with enthusiasm by the British media, and prompted generally positive comments about having a mixed-race person as a member of the royal family,[58] especially in regard to Commonwealth countries with populations of blended or native ancestry.[59] Markle announced that she would retire from acting,[60][61] and her intention to become a British citizen.[62]\n\nCarriage procession through streets of Windsor, May 2018\n\nIn preparation for the wedding, the Archbishop of Canterbury, Justin Welby, baptized Markle and confirmed her into the Church of England on March 6, 2018.[63] The private ceremony, performed with water from the River Jordan, took place in the Chapel Royal at St James's Palace.[63] The marriage ceremony was held on May 19 at St George's Chapel, Windsor Castle.[64] Her wedding dress was designed by the British designer Clare Waight Keller.[65] Markle later revealed that there was a private exchange of vows three days before with the Archbishop of Canterbury in the couple's garden.[66] However, this private exchange of vows was not an official legally recognized marriage.[67][68] It was reportedly agreed in advance that excess funds generated from the BBC broadcast of the wedding ceremony would go to a charity chosen by the newlywed couple.[69] In April 2020, Feeding Britain (which provides food packages to families in food poverty) was nominated to receive £90,000 from the BBC.[70]\n\nAfter the wedding, the Duke and Duchess lived at Nottingham Cottage within the grounds of Kensington Palace in London.[71] They later moved to Frogmore Cottage in the Home Park of Windsor Castle.[72][73] The Crown Estate refurbished the cottage at a cost of £2.4 million, paid out of the Sovereign Grant, with the Duke later reimbursing expenses beyond restoration and ordinary maintenance.[74][75] Meghan gave birth to a son, Archie Mountbatten-Windsor, on May 6, 2019.[76] The Duke and Duchess of Sussex's office moved to Buckingham Palace and officially closed on March 31, 2020, when the Sussexes withdrew from undertaking official royal engagements.[77][78] After some months in Canada and the United States, the couple bought a house in June 2020 on the former estate of Riven Rock in Montecito, California,[79] where they own a chicken coop with hens rescued from a factory farm.[80] The next month, Meghan suffered a miscarriage.[81] She gave birth to a daughter, Lilibet Mountbatten-Windsor, on June 4, 2021.[82] The Duke and Duchess own a Labrador named Pula, and two Beagles named Guy and Mamma Mia.[83][84] Meghan previously owned a Labrador-German Shepherd cross named Bogart, which was rehomed with a friend in Canada due to its inability to travel as a result of old age.[85]\n\nPolitical views\n\nMembers of the British royal family are politically neutral by convention.[86] However, Markle was politically vocal before marrying Prince Harry. At age 10, she and her friends reportedly campaigned against the Gulf War.[19] Decades later, she backed Hillary Clinton during the 2016 United States presidential election and publicly denounced the opponent and eventual winner, Donald Trump. In the same year, when the referendum on the United Kingdom's membership of the European Union resulted in favor of Brexit, Markle expressed her disappointment on Instagram.[87] In 2017, Markle recommended the book Who Rules the World? by left-wing intellectual Noam Chomsky on her Instagram account.[88]\n\nMeghan married Prince Harry in May 2018. In July 2018, Irish Senator Catherine Noone tweeted that the Duchess was \"pleased to see the result\" of the Irish referendum on legalizing abortion. Meghan received criticism for potentially breaching the protocol that prohibits royals from interfering in politics;[89] Noone deleted her tweet and emphasized that her statement was misleading and \"the Duchess was not in any way political\".[89]\n\nAfter she returned to the United States and as an eligible voter, she released a video with her husband encouraging others to register for the 2020 United States presidential election on National Voter Registration Day. Some media outlets took it as an implicit endorsement of the Democratic candidate, Joe Biden, which prompted then-President Trump to dismiss their messaging at a press conference.[90] In October 2021, she penned an open letter to Senate Majority Leader Chuck Schumer and House Speaker Nancy Pelosi, advocating for paid leave for parents.[91] Her remarks were met by backlash from Republican representatives Jason Smith and Lisa McClain, who found her statement \"out of touch\" and criticized her interference with American politics while utilizing her British royal titles.[92] Meghan has reportedly lobbied senators from both parties on the issue of paid family leave, including Democratic senators Patty Murray and Kirsten Gillibrand, as well as Republican senators Shelley Moore Capito and Susan Collins.[93][94] She has also publicly spoken in support of federal voting protections.[95] In February 2022, she voiced her support for the Supreme Court nomination of Ketanji Brown Jackson, stating \"Judge Jackson's nomination has opened new ground for women's representation at the highest level of a judicial system that for too long has tilted against the very community she hails from\".[96] In June 2022, she publicly supported Moms Demand Action, an organization which campaigns for safer gun laws in the US.[97] In the same month, in an interview with Jessica Yellin for Vogue, Meghan criticized the Supreme Court of the United States's decision that abortion is not a protected constitutional right, and voiced her support for the proposed Equal Rights Amendment.[98]\n\nPublic life\n\nRoyal duties\n\nMarkle greeting the public in Belfast , March 2018\n\nAfter becoming engaged, Markle's first official public appearance with Prince Harry was at a World AIDS Day walkabout in Nottingham on December 1, 2017.[99][100] On March 12, the 2018 Commonwealth Day service at Westminster Abbey was the first royal event she attended with the Queen.[101] On March 23, Harry and Meghan made an unannounced day visit to Northern Ireland.[102] In total, Markle attended 26 public engagements prior to the wedding.[103] Meghan's first official engagement after marriage was on May 22, when she and her husband attended a garden party celebrating the charity work of Charles III (then Prince of Wales).[104]\n\nIn July 2018, Meghan's first official trip abroad as a royal was to Dublin, Ireland, alongside Harry.[105][106] In October 2018, the Duke and Duchess traveled to Sydney, Australia for the 2018 Invictus Games.[107] This formed part of a Pacific tour that included Australia, Fiji, Tonga and New Zealand.[108][109] As representatives of the Queen, the couple were greeted warmly by crowds in Sydney, and the announcement of Meghan's pregnancy hours after their arrival delighted the public and media.[109][110] During their visit to Morocco in February 2019, the Duke and Duchess focused on projects centered on \"women's empowerment, girls' education, inclusivity and encouragement of social entrepreneurship\".[111] Meghan also participated in her husband's work as youth ambassador to the Commonwealth, which included overseas tours.[112][113]\n\nAs part of establishing a separate office from Kensington Palace in 2019, the Duke and Duchess created an Instagram social media account, which broke the record for the fastest account at the time to reach a million followers.[114] In July 2019, the Duchess's security team were criticized for creating an empty zone of about 40 seats around her at Wimbledon where she was watching a match between Serena Williams and Kaja Juvan.[115] In August 2019, Meghan and her husband were criticized by environmental campaigners for using private jets regularly when taking their personal trips abroad, which would leave more carbon footprint per person compared to commercial planes. The criticism was in line with similar criticism faced by the royal family in June 2019, after it was claimed that they \"had doubled [their] carbon footprint from business travel\".[116][117]\n\nThe Duchess of Sussex visits ActionAid in South Africa, 2019\n\nIn September and October 2019, a Southern African tour included Malawi, Angola, South Africa and Botswana. Archie traveled with his parents, making it \"their first official tour as a family\".[118]\n\nStepping back\n\nIn January 2020, Meghan and Harry returned to the UK from a vacation in Canada and announced that they were stepping back from their role as senior members of the royal family, and would balance their time between the United Kingdom and North America.[119][120] A statement released by the Palace confirmed that the Duke and Duchess were to cease to undertake royal duties as representatives of the Queen, and would therefore no longer receive the relevant financial support.[121] The couple would retain their HRH styles but not use them.[121] The formal role of the Duke and Duchess was subject to a twelve-month review period, ending in March 2021. Meghan's final solo engagement as a senior royal was a visit to Robert Clack School on March 7, 2020, in Dagenham ahead of International Women's Day.[122] She and Harry attended the Commonwealth Day service at Westminster Abbey on March 9, 2020, which was their last engagement as a couple before they officially stepped down on March 31. Two years later, they made their first official appearance in the UK in June 2022 while attending the Platinum Jubilee National Service of Thanksgiving.[123]\n\nThey visited the UK and Germany in September 2022 for a number of charity events in Manchester and Düsseldorf.[124]\n\nOn September 8, 2022, while Meghan and Harry were in London preparing to attend a charity event, Queen Elizabeth II died at Balmoral Castle in Scotland. The couple chose not to attend the charity event that night, with Meghan staying in London and her husband traveling to Balmoral.[125] On September 10, 2022, the Prince and Princess of Wales were joined by the Duke and Duchess of Sussex at Windsor to view the tributes to the Queen and spent time talking to the crowds. This was the first time since March 2020 that the two couples had been seen together.[126]\n\nFurther career and investments\n\nIn summer 2019, before announcing their decision to step down in January 2020, Meghan and her husband were involved in talks with Jeffrey Katzenberg, the founder of the now-defunct streaming platform Quibi, over a possible role in the service without gaining personal profits, but they eventually decided against joining the project.[127] In September 2019, it was reported that the couple had hired New York-based PR firm Sunshine Sachs, which represented them until 2022.[128][129][130] In June 2020, they signed with the Harry Walker Agency, owned by media company Endeavor, to conduct paid public speaking engagements.[131] In September 2020, the Sussexes signed a private commercial deal with Netflix \"to develop scripted and unscripted series, film, documentaries, and children programming for the streaming service\".[132] In October 2020, the couple hosted a special episode of Time 100 Talks with the theme being on \"Engineering a Better World\".[133] In December 2020, it was announced that Meghan had invested in Clevr Blends, a coffee company based in Southern California.[134][135] In the same month, Meghan and Harry signed a multi-year deal with Spotify to produce and host their own programs through their audio producing company, Archewell Audio.[136] A holiday special was released by the couple on the service in December 2020,[137] while Meghan's podcast, titled Archetypes, premiered in August 2022.[138][139]\n\nThe Bench, a picture book written by Meghan, was published in June 2021 by Random House Children's Books. It is based on her perception of the relationship between her husband and their son.[140] The book received a mixed response; it garnered praise for its illustrations and messaging but was criticized for its structure and writing.[141][142][143] Following its release, Meghan, alongside Archewell, donated 2,000 copies of The Bench to libraries, schools, and other nonprofit programs across the United States.[144] On June 17, the book reached number one on the children's picture books category of The New York Times Best Seller list.[145] In July 2021, it was announced that Meghan would executive-produce, alongside David Furnish, a Netflix animated series called Pearl.[146] The series was originally pitched to Netflix in 2018.[147][148] Pearl would depict the adventures of a 12-year-old girl who is inspired by influential women from history,[149] but the project was canceled in May 2022.[150] In the same month it was reported that Meghan and Harry had signed a four-book publishing deal that includes a wellness guide by Meghan and a memoir by Harry.[151] In September 2021, Meghan and Harry went to New York, where they visited the 9/11 Memorial with New York governor Kathy Hochul and New York City mayor Bill de Blasio, and held meetings with the U.N. Deputy Secretary-General Amina J. Mohammed and the U.S. ambassador to the U.N. Linda Thomas-Greenfield.[152][153] In October 2021, Meghan and Harry announced their partnership with Ethic, a sustainable investment firm based in New York City, which also manages the couple's investments.[154][155] According to state filings from Delaware, where the couple's Archewell foundation is registered, Meghan and Harry incorporated 11 companies and a trust beginning in early 2020 which include Orinoco Publishing LLC and Peca Publishing LLC to hold the rights for their books as well as Cobblestone Lane LLC and IPHW LLC which are holders of their foundation's logos.[156] Frim Fram Inc., which ran The Tig, had been registered earlier as a new corporation in Delaware in December 2019.[157]\n\nCharity work and advocacy\n\nMarkle became a counsellor for the international network One Young World in 2014 and spoke at its 2014 summit in Dublin[159] and attended the 2016 opening ceremony in Ottawa.[160] Also in 2014, she toured Spain, Italy, Turkey, Afghanistan and England with the United Service Organizations.[161] During her time in Toronto, she volunteered for the Community Meals Program of St. Felix Centre and donated food from the set of Suits.[162][163]\n\nIn 2016, Markle became a global ambassador for World Vision Canada, traveling to Rwanda for the Clean Water Campaign.[164][165][27] After a trip to India focused on raising awareness for women's issues, she penned an op-ed for Time magazine concerning stigmatization of women in regard to menstrual health.[166] She has also worked with the United Nations Entity for Gender Equality and the Empowerment of Women as an advocate.[164][167] Meghan is a vocal feminist and intended to use her role as a member of the royal family to continue supporting women's rights and social justice.[168] In 2017, Markle joined Prince Harry in teaming up with the charity Elephants Without Borders to assist with the conservation efforts taking place in Botswana.[169]\n\nIn January 2018, Markle became interested in the Hubb Community Kitchen run by survivors of the Grenfell Tower fire. She visited the kitchen regularly, and suggested that the displaced women publish a cookbook to assist in funding for the group.[170] Together: Our Community Cookbook, her first charity project as Duchess of Sussex, was announced in September.[171] In March 2021, Meghan used proceeds from the cookbook to donate £10,000 to the UK-based charity Himmah to assist them with stocking the group's food bank, provide them with equipment and help the Salaam Shalom Kitchen, the only Muslim and Jewish community kitchen in the UK.[172]\n\nIn March 2020, it was announced that Meghan's first post-royal project would be the narration of Disneynature's documentary Elephant, which was released on April 3.[173] In support of elephants, Disneynature and the Disney Conservation Fund would donate to Elephant Without Borders for species conservation in Botswana.[174] In April 2020, Meghan and her husband, in a private capacity, volunteered to personally deliver foods prepared by the Project Angel Food to Los Angeles residents amidst the COVID-19 pandemic in the United States.[175] In June 2020, the couple backed the Stop Hate for Profit campaign and encouraged CEOs of different companies to join the movement.[176] In July 2020, she spoke in support of the Black Lives Matter movement.[177] In August 2020, Meghan and Harry collaborated with Baby2Baby and participated in drive-through distribution of school supplies to students.[178]\n\nIn April 2021, the couple were announced as campaign chairs for Vax Live: The Concert to Reunite the World, an event organized by Global Citizen to increase access to COVID-19 vaccinations.[179] They also announced their support for a vaccine equity fundraiser initiated by the same organization,[180] and penned an open letter to the pharmaceutical industry CEOs urging them to address the vaccine equity crisis.[181] In July 2021, Meghan and Harry were among people who were selected by UK-based charity Population Matters to receive the Change Champions award for their decision to have only two children and help with maintaining a smaller and more sustainable population.[182] In August 2021, to mark her 40th birthday, Meghan launched 40x40, a campaign that asks people around the world to spend 40 minutes of their time mentoring women reentering the workforce.[183] In September 2021, Meghan and Harry spoke again in support of vaccine equity at the Global Citizen Live concert.[184] In the following month and ahead of the 2021 G20 Rome summit, the couple penned an open letter together with the Director-General of the World Health Organization Tedros Adhanom, asking the G20 leaders to expedite efforts for the global distribution of COVID-19 vaccines.[185]\n\nIn January 2022 and following criticism aimed at Spotify for their handling of COVID-19 misinformation, Meghan and Harry made an announcement stating that since April 2021 they had begun \"expressing concerns\" about the issue on the platform.[186] In February 2022, the couple were selected to receive NAACP's President's Award for their works on causes related to social justice and equity.[187] In the following month, they were among more than a hundred people who signed an open letter published by the People's Vaccine Alliance, asking for free global access to COVID-19 vaccines and calling out the UK, EU and Switzerland for opposing a waiver that would allow vaccine intellectual property protections to be lifted.[188]\n\nPatronages and interests\n\nFrom January 2019 to February 2021 Meghan was patron of London's National Theatre and the Association of Commonwealth Universities.[189][190] She continued her role as the private patron of Mayhew until 2022.[191] She remains a private patron of Smart Works.[190] From March 2019 to February 2021, she was the vice president of The Queen's Commonwealth Trust.[192][190] Until February 2021, periodically, online QCT chat sessions were conducted and uploaded to YouTube for general public viewing.[193] In October 2019, along with other members of the royal family, Meghan voiced a Public Health England announcement, for the \"Every Mind Matters\" mental health program.[194]\n\nIn 2019 Meghan was a contributor and guest editor for the September issue of British Vogue and highlighted the works of 15 women from different areas, who were described as \"Forces for Change\".[195] Edward Enninful, editor-in-chief of the British Vogue, later revealed that the issue had become the \"fastest-selling issue in the history of British Vogue\".[196] In the same issue, it was announced that she had collaborated with a number of British fashion houses and stores to launch a capsule collection, called The Smart Set, in September 2019 to benefit the charity Smart Works. The collection sought to help \"unemployed and disadvantaged women\", through selling items \"on a one-for-one basis, meaning an item is donated for each item purchased\".[197] Taking advantage of \"the Meghan effect\" (driving consumer purchases), in 10 days the collection provided a year's worth of clothes for the charity.[198]\n\nSussex Royal and Archewell\n\nIn February 2018, Markle and fiancé Harry attended the first annual forum of The Royal Foundation.[199] After marriage Meghan became the foundation's fourth patron alongside Prince Harry, Prince William and his wife, Catherine.[200] In May 2019, as a part of their Heads Together initiative, the Duchess of Sussex together with her husband and in-laws, launched Shout, a text messaging service for those who suffer from mental issues.[201] In June 2019, it was announced that Harry and Meghan would split from the charity and establish their own foundation. Nevertheless, the couples would collaborate on mutual projects, such as the mental health initiative Heads Together.[202][203] The following month, \"Sussex Royal The Foundation of The Duke and Duchess of Sussex\" was registered in England and Wales.[204] However, it was confirmed on February 21, 2020, that \"Sussex Royal\" would not be used as a brand name for the couple, following their step back from official life as working royals.[205] On August 5, 2020, Sussex Royal Foundation was renamed \"MWX Foundation\" and dissolved the same day.[206]\n\nIn March 2021, it was reported that the Charity Commission for England and Wales was conducting a review of the Sussex Royal organization in a \"regulatory and compliance case\" regarding its conduct under charity law during dissolution.[207] Representatives for the couple claimed that Sussex Royal was \"managed by a board of trustees\" and that \"suggestion of mismanagement\" directed exclusively at the Duke and Duchess would be incorrect.[207] The commission later concluded that the foundation did not act unlawfully, but criticized the board of directors for expending a \"substantial proportion of funds\" to setting up and closing the charity.[208][209]\n\nIn April 2020, Meghan and Harry confirmed that an alternative foundation (in lieu of Sussex Royal) would be called \"Archewell\".[210] The name stems from the Greek word \"arche\", which means \"source of action\"; the same word that inspired the name of their son.[210] Archewell was registered in the United States.[211] Its website was officially launched in October 2020.[212]\n\nPublic image and style\n\nBetween 2010 and 2012, Markle anonymously ran the blog The Working Actress, which detailed the \"pitfalls and triumphs of struggling to make it in Hollywood\".[213] In 2014, she founded her own lifestyle blog The Tig, which posted articles about food, fashion, beauty, travel and inspirational women.[214] The viewing audience consisted primarily of the fans of Markle and Suits. Promotion of the blog on other social media platforms targeted three million followers on Instagram, 800,000 on Facebook, and 350,000 on Twitter.[215] In April 2017, The Tig closed. In January 2018, she took all articles offline and deleted her social media accounts.[215] It is estimated that Markle's social media activities annually earned her about $80,000 from endorsements and sponsorships.[35] She was also known for socializing at Soho House.[216]\n\nMarkle became known through The Tig for her fashion sense,[38] releasing two fashion collections with Canadian clothing company Reitmans in 2015 and 2016.[215] The lines were based on her personal style and that of her Suits character.[38] Markle has cited Emmanuelle Alt as her style inspiration.[217][218]\n\nMarkle was featured in the cover story for the October 2017 issue of Vanity Fair and the December 2017 issue of Elle France.[219][220] Shortly after her engagement to Prince Harry in 2017, she caused a surge of interest in Scottish retailer Strathberry after carrying one of its handbags to a public event.[221][222] This was reported as an indication that her fashion choices would produce results similar to the Kate Middleton effect.[221][223] After Markle and Prince Harry's first appearance as a couple, brands Mackage, Birks, R&R Jewelers, Crown Jewelers and Everlane noted an upswing in their website hits and sales.[224][225][222] It was speculated that Markle's effect would be broader internationally because she already had a strong American appeal.[223] Consequently, the United States saw a boost in yellow gold jewelry sales in the first quarter of 2018.[226]\n\nIn 2018, Tatler included Meghan with other senior royal women on its list of Britain's best-dressed people.[227] Following the announcement of her pregnancy she appeared in a Karen Gee dress that resulted in the Australian designer's website crashing.[228] Fashion website Net-a-Porter ranked Meghan as one of the best dressed women in 2018.[229] She was nominated for the 2018 Teen Choice Awards in the category Choice Style Icon.[230] In 2019, British brand Reiss reported a growth in profits after Meghan was seen wearing a mini-dress by them on International Women's Day.[231] In 2022, the black Armani dress worn by Meghan during her Oprah interview was selected by the Fashion Museum, Bath as Dress of the Year 2021.[232] In the same year, Meghan was featured in the cover story for the 2022 Fall Fashion issue of The Cut.[233]\n\nIn 2018, Time magazine selected Meghan as one of the 100 Most Influential People in the World[234] and placed her on its shortlist for Person of the Year.[235] Her name appeared again on the listicle in 2021 and she and her husband were featured on one of the magazine's seven worldwide covers.[236] In 2019, the magazine named Meghan and Harry among the 25 Most Influential People on the Internet.[237] She was also chosen as one of the 25 most influential women in the United Kingdom by British Vogue magazine in 2018, 2019, and 2021.[238][239][240] Her influence was also recognized in both the 2019 and 2020 editions of Powerlist, the 100 most influential Britons of African and Afro-Caribbean descent.[241] In 2022, she was named as one of the 50 Women Changing the World over the past year by Worth magazine.[242] In the same year, Variety named her as a stellar honoree for its Power of Women issue.[243]\n\nPrivacy and the media\n\nCourt cases\n\nAssociated Newspapers Limited\n\nIn October 2019, the Duchess launched a lawsuit against Associated Newspapers Limited (ANL), the publisher of The Mail on Sunday and MailOnline over the publication of a letter she had sent to her father.[244][245] Thomas Markle Sr. had provided the publisher with excerpts of the letter after five of Meghan's friends referenced it in a People article.[4][246][247] The Duchess subsequently received support from more than 70 female MPs from different parties who in an open letter condemned the use of \"outdated, colonial undertones\" against her in some national media outlets.[248] In May 2020, the court dismissed claims of the tabloid's alleged dishonesty and malice, as they were deemed either vague or irrelevant to the case.[249] In February 2021, the High Court of Justice found in summary judgment that ANL's Mail on Sunday had invaded the Duchess's privacy by publishing the letter,[250] and she won her claim for \"misuse of private information and copyright infringement\" in May 2021.[251] She was given a £450,000 downpayment on her £1.5 million legal fees as an interim payment, and pursuant to copyright law, her legal team asked for a front-page statement by The Mail on Sunday and MailOnline to acknowledge her legal victory.[252]\n\nThe Court of Appeal granted ANL permission to appeal against the ruling.[253] The appeal was subsequently launched by ANL in November 2021.[254] Meghan and Harry's former communications secretary Jason Knauf—who had previously denied co-authoring the letter with Meghan[255]—gave a statement to the court of appeal, mentioning that the Duchess of Sussex gave him briefing points to share with Finding Freedom's authors Omid Scobie and Carolyn Durand and the Duke of Sussex welcomed the suggestion that they should conceal their involvement, while they both discussed the book \"on a routine basis\".[256] ANL had previously applied to use the book in their defense, arguing that the Duke and Duchess had \"co-operated with the authors of the recently published book Finding Freedom to put out their version of certain events\".[257][258] Knauf also revealed that the Duchess wondered whether she should refer to her father as \"daddy\" in the letter, as she believed \"in the unfortunate event that it leaked, it would pull at the heartstrings\".[256] Meghan subsequently apologized to the court for not remembering the emails earlier and stated she \"had absolutely no wish or intention to mislead the defendant or the court\", adding that the \"extent of the information\" Knauf shared with the book's authors was \"unknown\" to her and her exchanges with Knauf were \"a far cry from the very detailed personal information that the defendant alleges that I wanted or permitted to put into the public domain\".[259] In December 2021, three senior appeal judges upheld the judgement of the High Court against ANL, prompting Meghan to call for reform of the tabloid industry.[260] In the same month, ANL's The Mail on Sunday and MailOnline published a front-page statement on Boxing Day acknowledging the Duchess's victory, adding that there had been an agreement on \"financial remedies\".[261] In addition to covering a portion of Meghan's legal costs, the outlet agreed to pay her £1 in damages for invading her privacy and a confidential sum for infringing her copyright.[262] They were also banned from naming the Duchess's friends, who had spoken to People magazine about the letter in 2018.[262]\n\nOther cases and complaints\n\nIn November 2016, the MailOnline was criticized for running an article on Markle's family background titled \"(Almost) Straight Outta Compton\", which triggered a response from Prince Harry's Communications Secretary.[10] In the same month, The Sun ran the headline \"Harry girl's on Pornhub\".[53] The outlet denied any smear after it was revealed that the clips were illegally uploaded scenes from the TV series Suits, and not pornographic material.[53] They subsequently apologized via an official statement in February 2017.[263] In February 2018, a letter containing white powder and a racist note addressing Markle was sent to St James's Palace, triggering counter-terrorism and racist hate crime investigations by Scotland Yard.[264] Meghan and Harry obtained a formal apology in May 2019 from the Splash News for privacy invasion.[265][266] The couple had a legal warning issued to the press in general in January 2020 after the publication of paparazzi photographs.[267] In March 2020, the couple took Splash UK to court after Meghan and her son were photographed without permission in Canada during a \"private family outing\". The case was settled later that year with Splash UK agreeing to no longer take unauthorized photos of the family.[268] The Duke and Duchess announced in April that they would no longer cooperate with the Daily Mail, The Sun, Daily Mirror and Daily Express.[269] They won an apology in October from American news agency X17 for taking photographs of their son at their home using drones.[270]\n\nIn March 2021, ITV News reported the Duchess had complained directly to ITV's CEO about Piers Morgan's comments on mental health following her interview with Oprah Winfrey.[271] Ofcom received over 57,000 complaints about the program including one from the Duchess of Sussex.[272][273] In the same month, it was reported that an American private investigator unlawfully handed over personal details about Meghan to The Sun, including her Social Security number, cellphone number and address, when she first started dating Harry in 2016. Meghan and her husband condemned the \"predatory practices\" of the British tabloids, while The Sun stated that the investigator \"was instructed clearly in writing to act lawfully\", and they did not \"use the information he provided for any unlawful practice\".[274]\n\nIn July 2021, the Duchess filed legal complaints against The Times for two separate articles, with the first one covering an unproven allegation from Robert Lacey's book that she had left an engagement in Fiji for not being appointed by UN Women as a goodwill ambassador and the second one claiming that the Duke and Duchess of Cambridge had refused to talk to Harry after Prince Philip's funeral due to fears of a potential leak.[275][276] In January 2022, the couple mutually filed a legal complaint against The Times for an article reporting on Archewell raising less than $50,000 in 2020.[277] In the same month, she complained to the BBC regarding their five-part podcast Harry, Meghan and the Media, in which the presenter Amol Rajan stated that the Duchess had \"apologized for misleading\" the Court of Appeal in her case against the Mail on Sunday.[278][279] The BBC responded by issuing a statement on its \"corrections and clarifications\" website to emphasize that she had \"apologized to the court for not remembering email exchanges\".[279]\n\nIn March 2022, her half-sister, Samantha Markle, sued Meghan by filing a defamation lawsuit in Florida, accusing her of lying in the Oprah interview and disseminating false statements via her communications secretary for the book Finding Freedom, and sought damages in excess of $75,000.[280][281] Meghan's lawyers described the lawsuit as \"a continuation of a pattern of disturbing behavior.\"[281] In a response filed in May 2022, Meghan's attorneys argued that her half-sister's claims were \"demonstrably false\", and the statements made by Meghan during the Oprah interview were either \"non-actionable opinion or substantially true\".[282] They also added that the alleged defamatory statements Samantha had referred to either were true or could not be found in Finding Freedom or in the emails that Meghan had sent to her communications secretary, for which Meghan could not be held accountable under Florida's two-year statute of limitations and due to the fact that she did not write the book herself.[282] In June 2022, Meghan's initial motion to dismiss the case was rejected by a judge following amendments made by Samantha in her complaints.[283] She filed a second motion in the same month, stating that the deletion of \"numerous specific factual allegations and exhibits from her original complaint\" combined with the lack of facts had undermined Samantha's case, and argued a judge or jury would not be able to pass judgements about the state of their relationship.[283] Meghan's lawyers have argued that her comments regarding her upbringing in the interview were unfalsifiable and subjective statements of her feelings, rather than objective facts.[284]\n\nIn August 2022 and in an interview with The Cut, Meghan recalled being told at the premiere of The Lion King in London by a South African cast member that following her marriage to Harry, people in South Africa \"rejoiced in the streets the same we did when Mandela was freed from prison\".[285] Meghan was criticized by Mandela's grandson Mandla Mandela for reciting the story, who stated that his grandfather's release from prison after \"overcoming 350 years of colonialism with 60 years of a brutal apartheid regime in South Africa\" could not be \"compared to the celebration of someone's wedding\".[285][286] John Kani, the only South African cast member of The Lion King, later stated that he did not recall meeting the Duchess and claimed there were no big celebrations in South Africa at the time of the wedding.[287] Lebo M., the film's South African composer who was at the London premiere, revealed that he had spoken to Meghan for \"less than a minute\" and could not remember discussing Mandela with her.[288] In the same interview, Meghan spoke of the reason behind her refusal to share photos of her children with the Royal Rota, claiming that she would not share it with the people who allegedly call her children the N-word, a claim that was disputed by British journalists.[289]\n\nBullying allegations and Oprah interview\n\nIn 2021, shortly before the Duke and Duchess were due to be interviewed by Oprah Winfrey, The Times reported that the Duchess's former communications secretary, Jason Knauf, complained in October 2018 that her conduct at Kensington Palace had caused two personal assistants to quit and had undermined the morale of a third employee,[290] prompting an investigation by Buckingham Palace into the bullying allegations.[291][292] The palace hired an external law firm to examine the claims, with ten aides reported to cooperate with the review.[293][294] Criticism of the Duchess for twice wearing earrings gifted from Saudi Crown Prince Mohammed bin Salman in 2018, after he was accused of complicity in the assassination of Jamal Khashoggi, appeared at the same time.[295][290][296] Her representatives denied her awareness of the accusations against Mohammed bin Salman, and said The Times was being used by Buckingham Palace for \"a smear campaign\" against her.[297][290] In an updated epilogue for the couple's unauthorized biography, Finding Freedom by Omid Scobie and Carolyn Durand, the authors claimed that \"two of the individuals mentioned in [Knauf's] email asked for any allegations made to HR about their experiences with Meghan to be rescinded\".[298] Speaking on behalf of the Duchess in a BBC documentary, Jenny Afia, a lawyer who represents Meghan in her case against ANL stated that the bullying allegations were \"just not true\".[299] In June 2022, The Times reported that the results from the inquiry made Buckingham Palace modify some of the policies and procedures in its HR department, but the report would not be published to ensure the privacy of those who took part in it.[300]\n\nThe television special Oprah with Meghan and Harry was broadcast on CBS on March 7, 2021.[301] Meghan spoke about her personal and royal life and public pressure. She discussed contemplating suicide during her time as a working royal and talked about a perceived lack of protection for her and her son while being part of the royal institution.[302] There was a wide and polarized reaction to the interview.[303]\n\nIn March 2019, European consulting firm 89up reported on their discovery of 1,103 highly connected Twitter accounts with more than two and a half million tweets in favor of the Duchess of Sussex, most of which appeared to be bots carrying out \"coordinated attacks\" on royal correspondents who had reported negatively on Meghan.[304][305] In the same year, CNN had reported on a research by Hope not Hate, stating that out of 5,200 \"abusive tweets directed at Meghan\" in January and February 2019, 3,600 came from a small group of trolls.[304] In October 2021, Twitter analytics service Bot Sentinel released their analysis of more than 114,000 tweets about the Duke and Duchess of Sussex, as a result of which they found 83 accounts with a combined number of 187,631 followers that were possibly responsible for approximately 70% of the negative content posted about the couple.[306] The report prompted an investigation by Twitter.[306] Twitter stated that it found no evidence of \"widespread coordination\" between the accounts, and said that it had taken action against users who violated Twitter's conduct policy.[306][307] Bot Sentinel also released three more reports in the following months, arguing that the accounts were part of a \"bot network\" and a similar network could be found on YouTube.[308][309] In January 2022, the BBC named Meghan and Harry among people whose photos and videos were used in fake instant profits advertisements and bitcoin-related investment schemes.[310]\n\nTitles, styles, and arms\n\nMeghan became a princess of the United Kingdom upon her marriage to Prince Harry, entitled to the style of Royal Highness.[311] After her marriage, she was styled \"Her Royal Highness The Duchess of Sussex\". She also holds the titles of Countess of Dumbarton and Baroness Kilkeel.[312] She is the first person to hold the title \"Duchess of Sussex\".[313][314] Following the Duke and Duchess's decision to step back from royal duties in 2020, the couple agreed not to use the style of \"Royal Highness\" in practice, but still legally retains the style.[315][316][317]\n\nFilmography\n\nTelevision\n\nFilm\n\nBibliography\n\nBooks\n\nAuthored articles and letters\n\nReferences", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Prince_Harry_and_Meghan%E2%80%99s_carriage_procession_through_streets_of_Windsor_05.jpg/260px-Prince_Harry_and_Meghan%E2%80%99s_carriage_procession_through_streets_of_Windsor_05.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Harry_and_Meghan_on_Christmas_Day_2017_%28cropped%29.jpg/220px-Harry_and_Meghan_on_Christmas_Day_2017_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Royal_Monogram_of_Meghan%2C_Duchess_of_Sussex.svg/100px-Royal_Monogram_of_Meghan%2C_Duchess_of_Sussex.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Crown_of_Saint_Edward_Heraldry.svg/20px-Crown_of_Saint_Edward_Heraldry.svg.png", "https://upload.wikimedia.org/wikipedia/commons/b/bf/Meghan_Markle_-_2018_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Meghan_Markle_-_2018_%28cropped%29.jpg/220px-Meghan_Markle_-_2018_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/21px-Flag_of_the_United_States.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Brian_Urlacher%2C_Meghan_Markle_and_Doug_Fister%2C_2014.jpg/220px-Brian_Urlacher%2C_Meghan_Markle_and_Doug_Fister%2C_2014.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Coat_of_arms_of_Meghan%2C_Duchess_of_Sussex.svg/220px-Coat_of_arms_of_Meghan%2C_Duchess_of_Sussex.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/19px-P_vip.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Meghan_Markle_in_2013_New_York_Fashion_Week_%2834567271204%29.jpg/220px-Meghan_Markle_in_2013_New_York_Fashion_Week_%2834567271204%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Prince_Harry_and_Ms._Markle_visit_Belfast%E2%80%99s_Crown_Liquor_Saloon_%2840263263684%29.jpg/220px-Prince_Harry_and_Ms._Markle_visit_Belfast%E2%80%99s_Crown_Liquor_Saloon_%2840263263684%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Meghan_Markle_visits_to_ActionAid_South_Africa_03.jpg/220px-Meghan_Markle_visits_to_ActionAid_South_Africa_03.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Meghan_Markle_and_Patrick_J._Adams_%28Paley_Center_%27Suits%27%29.jpg/220px-Meghan_Markle_and_Patrick_J._Adams_%28Paley_Center_%27Suits%27%29.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Badge_of_the_House_of_Windsor.svg/70px-Badge_of_the_House_of_Windsor.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/21px-Flag_of_the_United_Kingdom.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Signature_of_the_HRH_Meghan%2C_Duchess_of_Sussex.svg/150px-Signature_of_the_HRH_Meghan%2C_Duchess_of_Sussex.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Meghan_Markle_-_2018_%28cropped%29.jpg", "keywords": [], "authors": ["Authored Articles"], "canonical_link": "https://en.wikipedia.org/wiki/Meghan,_Duchess_of_Sussex", "title": "Meghan, Duchess of Sussex", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Meghan_Markle_-_2018_%28cropped%29.jpg/640px-Meghan_Markle_-_2018_%28cropped%29.jpg", "width": 640, "height": 960}, "title": "Meghan, Duchess of Sussex - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}