{"url": "https://www.usmagazine.com/celebrity-news/news/gus-kenworthy-mourns-death-of-dog-he-adopted-during-winter-olympics/", "text": "Gus Kenworthy announced on Saturday, May 26, that his dog Beemo died of a heart defect. The Team USA athlete adopted Beemo from a dog farm during the 2018 Winter Olympics in PyeongChang, South Korea, earlier this year.\n\n“Two days ago my beautiful baby Beemo passed away,” Kenworthy captioned an Instagram photo showing the pup licking his ear. “It was completely unexpected and Matt [Wilkas] and I are beside ourselves trying to cope with her loss. For a week or so we’d been worrying because she was showing less and less interest in her food. There were several trips to the vet and on our final visit this past Thursday I asked them do a full body scan in case there was an underlying issue they had missed. Beemo went into a panic attack during the x-rays and her breathing became rapid and shallow. The scan revealed that her lungs were deteriorated and that her heart was too big for her body – a birth defect we had no way of knowing about.”\n\nKenworthy rushed her from that vet, who was unable to treat her, to an emergency vet where she was placed on a respirator in the hope “they could get her vitals back to a normal level so she could be treated but they were never able to do so.”\n\nThe athlete wrote that the days since losing Beemo have been “a blur.”\n\n“It all happened so fast that it’s still hard to believe it,” he continued. “The ER doc told us that even if we’d somehow spotted the issue earlier it wouldn’t have made a difference in the end. He said that she’d been living on ‘borrowed time’ from the get go. Beemo was truly the best thing that ever happened to me and I feel so fortunate for our borrowed time together. I’ve never loved anything or anyone in the way that I loved that dog and she is and will always be deeply missed.\n\n“She was so smart and playful. She brought so much happiness to so many people every single day. I’ll always remember being out on a walk with her and every other second she would get stopped by someone wanting to pet her, kneel down and kiss her, hold her in their arms or take a photo and on many occasions a crowd of people would have formed around her. That was her power: she made people smile,” Kenworthy concluded. “She was the kindest, most gentle soul I’ve ever known. She loved people. She loved birds and the snow. She loved me and Matt. But most of all she loved meeting other dogs. If any of you have pets up in doggy heaven please tell them to go find Bee because she could really use a good play date right now. RIP sweet creature – your daddy loves you more than you could ever even know!”\n\nKenworthy and his boyfriend, Matthew Wilkas, announced in February that they had fallen for the puppy at first sight and planned to take her home after the games.\n\n“This morning Matt and I had a heart-wrenching visit to one of the 17,000 dog farms here in South Korea. Across the country there are 2.5 million dogs being raised for food in some of the most disturbing conditions imaginable,” the freestyle skier wrote on Instagram at the time. “Yes, there is an argument to be made that eating dogs is a part of Korean culture. And, while don’t personally agree with it, I do agree that it’s not my place to impose western ideals on the people here. The way these animals are being treated, however, is completely inhumane and culture should never be a scapegoat for cruelty.”\n\nA month later, the couple revealed Beemo was finally home with them in the states after she was quarantined. Kenworthy gushed to Us in March about the pup.\n\n“I like human names for dogs. When we were coming up with a name from Beemo, we were going over pop queens and divas,” he said. “But then I kind of just wanted to keep it in the family with her older brother who lives with my ex, so we went with another character which is Beemo.”\n\nKenworthy frequently shared photos of Beemo on Instagram, and even made a separate account for her, which has over 130k followers. Kenworthy also helped rescue four dogs from the 2014 Olympics in Sochi, Russia.", "images": ["https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/bg-subscribe.png", "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/2018/05/gus-kenworthy-dog.jpg?crop=0px%2C124px%2C712px%2C374px&resize=1200%2C630&ssl=1&quality=82&strip=all", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered-green.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/placeholders/default-usweekly.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/shop-with-us-new.png", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/placeholders/default-usweekly-square.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered.svg"], "top_img": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/2018/05/gus-kenworthy-dog.jpg?crop=0px%2C124px%2C712px%2C374px&resize=1200%2C630&ssl=1&quality=82&strip=all", "keywords": [], "authors": ["Sarah Hearon"], "canonical_link": "https://www.usmagazine.com/celebrity-news/news/gus-kenworthy-mourns-death-of-dog-he-adopted-during-winter-olympics/", "title": "Gus Kenworthy Mourns Death of Dog He Adopted During Winter Olympics", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": "-206090124", "fo-verify": "49e6fc6a-c68d-447f-9978-70e3eac455ac", "post-format": "article", "post-tags": "Celebrity Pets,pets", "post-cats": "Celebrity News", "theme-color": "#fff", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Gus Kenworthy announced that his dog Beemo who he adopted from a dog farm during the 2018 Winter Olympics in PyeongChang, South Korea, has died — read his tribute", "og": {"locale": "en_US", "type": "article", "title": "Gus Kenworthy Mourns Death of Dog He Adopted During South Korea Olympics", "description": "Gus Kenworthy announced that his dog Beemo who he adopted from a dog farm during the 2018 Winter Olympics in PyeongChang, South Korea, has died — read his tribute", "url": "/celebrity-news/news/gus-kenworthy-mourns-death-of-dog-he-adopted-during-winter-olympics/", "site_name": "Us Weekly", "updated_time": "2018-05-27T03:02:25+00:00", "image": {"identifier": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/2018/05/gus-kenworthy-dog.jpg?crop=0px%2C124px%2C712px%2C374px&resize=1200%2C630&ssl=1&quality=82&strip=all", "secure_url": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/2018/05/gus-kenworthy-dog.jpg?crop=0px%2C124px%2C712px%2C374px&resize=1200%2C630&ssl=1&quality=82&strip=all", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/UsWeekly", "published_time": "2018-05-27T03:02:25+00:00"}, "author": "Sarah Hearon", "twitter": {"card": "summary_large_image", "title": "Gus Kenworthy Mourns Death of Dog He Adopted During South Korea Olympics", "description": "Gus Kenworthy announced that his dog Beemo who he adopted from a dog farm during the 2018 Winter Olympics in PyeongChang, South Korea, has died — read his tribute", "image": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/2018/05/gus-kenworthy-dog.jpg?crop=0px%2C124px%2C712px%2C374px&resize=1200%2C630&ssl=1&quality=82&strip=all", "creator": "@sarahhearon", "site": "@usweekly"}, "spons": "no", "tragedy": "off", "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://www.usmagazine.com/wp-content/uploads/2020/05/cropped-us-logo.png?w=270&quality=86&strip=all"}, "movies": [], "publish_date": 1527390145.0, "source": "https://www.usmagazine.com", "summary": ""}