{"url": "https://www.jkrowling.com/opinions/grindelwald-casting/", "text": "When Johnny Depp was cast as Grindelwald, I thought he’d be wonderful in the role. However, around the time of filming his cameo in the first movie, stories had appeared in the press that deeply concerned me and everyone most closely involved in the franchise.\n\nHarry Potter fans had legitimate questions and concerns about our choice to continue with Johnny Depp in the role. As David Yates, long-time Potter director, has already said, we naturally considered the possibility of recasting. I understand why some have been confused and angry about why that didn’t happen.\n\nThe huge, mutually supportive community that has grown up around Harry Potter is one of the greatest joys of my life. For me personally, the inability to speak openly to fans about this issue has been difficult, frustrating and at times painful. However, the agreements that have been put in place to protect the privacy of two people, both of whom have expressed a desire to get on with their lives, must be respected. Based on our understanding of the circumstances, the filmmakers and I are not only comfortable sticking with our original casting, but genuinely happy to have Johnny playing a major character in the movies.\n\nI’ve loved writing the first two screenplays and I can’t wait for fans to see ‘The Crimes of Grindelwald’. I accept that there will be those who are not satisfied with our choice of actor in the title role. However, conscience isn’t governable by committee. Within the fictional world and outside it, we all have to do what we believe to be the right thing.", "images": ["https://www.jkrowling.com/wp-content/uploads/2017/11/FNBST2_First_Look_3000x1800-R01_SQUARE_2.jpg", "https://www.jkrowling.com/wp-content/themes/jkrowling/assets/images/JKSig_Option4.svg"], "top_img": "https://www.jkrowling.com/wp-content/uploads/2017/11/FNBST2_First_Look_3000x1800-R01_SQUARE_2.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.jkrowling.com/opinions/grindelwald-casting/", "title": "Grindelwald casting", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_GB", "type": "article", "title": "Grindelwald casting - J.K. Rowling", "description": "When Johnny Depp was cast as Grindelwald, I thought he’d be wonderful in the role. However, around the time of filming his cameo in the first movie, stories had appeared in the press that deeply concerned me and everyone most closely involved in the franchise. Harry Potter fans had legitimate questions and concerns about our […]", "url": "https://www.jkrowling.com/opinions/grindelwald-casting/", "site_name": "J.K. Rowling", "image": {"identifier": "https://www.jkrowling.com/wp-content/uploads/2017/11/FNBST2_First_Look_3000x1800-R01_SQUARE_2.jpg", "width": 1100, "height": 619, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/JKRowling", "modified_time": "2018-05-30T08:53:35+00:00"}, "twitter": {"card": "summary", "site": "@jk_rowling", "label1": "Estimated reading time", "data1": "1 minute"}, "generator": "WordPress 6.0.2"}, "movies": [], "publish_date": null, "source": "https://www.jkrowling.com", "summary": ""}