{"url": "https://www.usatoday.com/story/life/movies/2018/08/17/aretha-franklin-movie-jennifer-hudson/1026703002/", "text": "Aretha Franklin biopic: 'Aretha was adamant that it be Jennifer (Hudson)' playing her\n\nShow Caption Hide Caption Queen of Soul also leaves civil rights legacy Aretha Franklin's song \"Respect\" became a battle cry for black America. The Queen of Soul was a close friend of the Rev. Martin Luther King Jr., and she never hesitated to support the civil rights movement financially or with her performance. (Aug. 16) AP\n\nWhen producer Harvey Mason Jr. spoke by phone last week to Aretha Franklin, one of the topics they covered was the movie planned about her life.\n\nNow, as Mason mourns Thursday's death of the legend who became his friend, he is committed to carrying out her wishes on the film.\n\n\"Going forward, what will be foremost in my mind is, 'What would Aretha do here? What would Aretha want here?' \" said Mason, a producer for the project, in an interview with the Detroit Free Press on Friday. \"She will always be in the front of my mind as I make decisions on the film.\"\n\nIn January 2018, the biopic about Franklin's life made headlines when famed music producer Clive Davis announced at his annual pre-Grammys party that Oscar-winning actress Jennifer Hudson would be playing Franklin.\n\nFranklin herself chose Hudson for the role.\n\nThe possibility of a movie on the Queen of Soul has been percolating for many years. In 2010, Franklin sent out a press release suggesting that Halle Berry play the young Aretha (and Denzel Washington for her late father, noted Detroit minister C.L. Franklin). Two year later, she said in an interview that Taylor Hackford was going to be the director.\n\nRelated:\n\nMore: Ariana Grande, The Avett Brothers stop the show to pay tribute to Aretha Franklin\n\nAlso: Aretha Franklin's greatest pop culture moments, from 'Blues Brothers' to 'Murphy Brown'\n\nCause of death: Soul legend Aretha Franklin had pancreatic cancer, one of the most deadly forms\n\nWhen Davis went public with Hudson's casting, it seemed like the movie — linked in reports to MGM — would soon become a reality. Contacted by USA TODAY this week, an MGM spokesperson said there was nothing further to share at this time.\n\nVariety reported Friday that the film, yet to be titled, still needs a director and a script and is in the process of acquiring some rights.\n\nFranklin contributed her ideas for the film before and after the Hudson announcement. According to Mason, he and Franklin discussed many aspects of the movie right up to last week, during what he describes as \"countless hours\" of phone conversations.\n\nOver an estimated 100 phone calls, they talked about \"what stories she felt were important and what really made her who she is.\" They also talked about which songs \"were important to her career\" and \"really told her story\" and should be included in the feature-length film.\n\nMason's credits include writing and producing songs for Franklin, Michael Jackson, Justin Timberlake, Whitney Houston and Britney Spears. His movie credentials – as a producer on the music side – run the gamut from Hudson's \"Dreamgirls\" to \"Pitch Perfect\" to \"Sparkle,\" the 2012 musical filmed in Detroit that marked Whitney Houston's final cinematic appearance.\n\nWhile it previously has been reported that filming on the Franklin movie could start in 2019, Mason says a start date hasn't been set. He stressed that the production will not be rushed because of Franklin's passing.\n\n\"My duty is to do something that really honors Aretha and treats her in the manner I have been accustomed to dealing with her. I have a good feel for what she likes and doesn't like. My whole goal is to do something ... her fans would be proud of and something that stands up to her legacy.\"\n\nMason notes certain similarities between Franklin and Hudson.\n\n\"They both sing with a lot of emotion. They both sing with a lot of range and power. It's really hard to compare anyone with Aretha, though. I think the good thing about Jennifer is that was Aretha's pick to play her. ... There was a lot of discussion about a lot of people, but Aretha was adamant that it be Jennifer.\"\n\nOn Thursday, Hudson posted a tribute to Franklin on Instagram and Twitter that said \"while teaching me about your life, u taught me so much about life and schooled me in mine.\"\n\nA representative for Hudson told the Free Press she has no further comment at this time.\n\nI have no words , so I will let the Queen say it ! But I will Say while teaching me about your life , u taught me so much about life and schooled me in mine . I will never forget those… https://t.co/4gQfz1OTrb — Jennifer Hudson (@IAMJHUD) August 16, 2018\n\nMason was introduced to Franklin more than a decade ago by Davis in connection with a recording project. He went on to work with her on several songs and albums, including the memorable duet between Franklin and Mary J. Blige on \"Never Gonna Break My Faith\" for the soundtrack for the 2006 movie \"Bobby.\"\n\nMason says Franklin raised his game. As collaborators, he says, she appreciated that he was prepared \"to bring something to the table.\"\n\nSaid Mason, \"I would give her suggestions. She would sometimes agree with my suggestions. Sometimes she'd tell me, 'No, I'm not doing that.' But she understood I wasn't going to just sit there and clap and be a fan — although I was a fan. ... I went into all my sessions with Aretha trying to see if I could make the best singer in the world sound even better.\"\n\nThe last time they spoke by phone, Mason didn't realize it would be their final exchange. He says Franklin was optimistic and brought up returning to singing.\n\n\"She said she was really looking forward to getting back on the mic, which is her words: 'I really can't wait to get back on the mic.' She said she was resting. I told her, 'I hope you rest well and get your strength back so we can get you back on the mic.' \"\n\nContact Detroit Free Press pop culture writer Julie Hinds: 313-222-6427 or jhinds@freepress.com.", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/29906170001/29906170001_5823132697001_5823124983001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/presto/2018/08/17/PDTF/d3de30ed-8b8d-4c1b-b562-56289dbf4697-Aretha_jennifer.jpg?auto=webp&crop=1179,663,x616,y316&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/presto/2018/08/17/PDTF/d3de30ed-8b8d-4c1b-b562-56289dbf4697-Aretha_jennifer.jpg?auto=webp&crop=1179,663,x616,y316&format=pjpg&width=1200", "keywords": [], "authors": ["Julie Hinds"], "canonical_link": "https://www.usatoday.com/story/life/movies/2018/08/17/aretha-franklin-movie-jennifer-hudson/1026703002/", "title": "Aretha Franklin biopic: 'Aretha was adamant that it be Jennifer (Hudson)' playing her", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/movies/2018/08/17/aretha-franklin-movie-jennifer-hudson/1026703002/life/movies", "theme-color": "#ffffff", "og": {"type": "article", "title": "Aretha Franklin biopic: 'Aretha was adamant that it be Jennifer (Hudson)' playing her", "description": "The biopic on Aretha Franklin won't be rushed to the screen, says music producer Harvey Mason Jr., who spent an estimated 100 calls speaking in-depth with the legendary singer about the project.", "site_name": "Detroit Free Press", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/08/17/PDTF/d3de30ed-8b8d-4c1b-b562-56289dbf4697-Aretha_jennifer.jpg?auto=webp&crop=1179,663,x616,y316&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "The biopic on Aretha Franklin won't be rushed to the screen, says music producer Harvey Mason Jr., who spent an estimated 100 calls speaking in-depth with the legendary singer about the project.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1534460400.0, "source": "https://www.usatoday.com", "summary": ""}