{"url": "https://www.hollywoodreporter.com/live-feed/bachelor-paradise-couple-jordan-kimball-jenna-cooper-respond-cheating-report-1142561", "text": "Engagement bliss was cut short for Bachelor in Paradise couple Jordan Kimball and Jenna Cooper.\n\nAfter getting engaged on the pre-taped finale of the Bachelor and Bachelorette summer spinoff series on Monday night’s episode, the pair revealed on Tuesday’s reunion show that, weeks after filming had wrapped, they are still together and moving forward with wedding plans. By Wednesday, all of that had changed.\n\nDuring the reunion show, which was taped Aug. 28 and weeks after cameras stopped rolling on the Sayulita, Mexico, beach set, Jordan pitched his and Jenna’s TV wedding to franchise host Chris Harrison: June 9, on the beaches of Paradise with Harrison officiating.\n\n“We have a date for the wedding, we have to start planning that,” Jordan had happily told The Hollywood Reporter after the taping of their plans. “We want to bring our families closer together and we have to figure out a living space. We met on June 9 and it’s her birthday. The network brought us together, so why not bring us even closer together?”\n\nShortly before the episode aired, however, franchise spoiler blogger Reality Steve published a report accusing Jenna of cheating on Jordan. The report included screengrabs of text messages apparently sent by Jenna, where she says she and Jordan “aren’t together for real” and that she is faking it for her business (she runs a social media management company). “I don’t even like him, let alone love him. I’m better than him and once I’m able to I’ll break it off for good and make up some story and make up some story to make him look bad if it will make you feel better,” she writes in the messages to a man claiming to be in a relationship with her.\n\nHours after the Bachelor in Paradise reunion episode aired, both Jenna and Jordan spoke out about the accusations. Jenna denied the content in the text messages, but Jordan said he was blindsided.\n\n“I am aware of the allegations being made against me and they are simply untrue,” Jenna told People in a statement. “I am choosing to focus on my relationship right now. Thank you for respecting my privacy at this time.”\n\nJordan, however, said he felt “weak in the knees” and like “I have rocks in my stomach” after hearing the story, which he got a warning of on Twitter.\n\n“On Monday, I saw something someone posted on Twitter — that somebody was going to be roasted the next night,” he told the magazine. “Jenna called me and said she was very anxious about this Twitter post. I talked to her in the middle of the night last night. I said, ‘Don’t hype yourself up, don’t worry, you have nothing to worry about.’ I tried to calm her. I went back to bed for a few hours, woke up, had my coffee and she called me again and said she was anxious and felt sick to her stomach.”\n\nHe continued, “She’s in New York. I told her to keep calm. I thought she was just being nervous for no reason. Then I was driving back to Central Florida from Miami and I started getting calls from castmates like Chris Randone. I started getting screenshots sent to me. I didn’t know what to think. I sank in my seat.”\n\nJordan told the magazine that he believes the report: “I know my Jenna, and I read those texts and in my heart, I know it’s her. She was saying she didn’t do it, but hinting towards the fact that there’s a possibility that it happened. In all reality, I don’t expect her to own it.”\n\nJordan said they had been in the midst of planning an engagement party, but that this news is now “killing” him. “I would never have expected this,” he said. “I feel sick about it. I just don’t understand why someone would say that they’re better than me and have ill intentions. If this whole thing sticks, and it’s true, I will be hurt much more than the depths of romance. I will be hurt as a person and as a friend. There are so many layers to a relationship and right now I feel all of them peeling back.”\n\nJordan, a model from Florida, broke out as a franchise face after his dramatic stint on Becca Kufrin’s recent cycle of The Bachelorette. He quickly earned “villain” status for feuding with his fellow castmates, most notably co-star David Ravitz. Jordan and David continued their fighting when they returned on Bachelor in Paradise, but Jordan’s storyline quickly turned to one of romance once he and Jenna began dating.\n\n“This was not a TV romance,” he told People of his relationship with Jenna, who hails from Arie Luyendyk Jr.’s season of The Bachelor. “This was real. And whether you like me or not, I deserve love. I found it, and this is what happened. So for the sake of anyone who’s ever been in love, be understanding.”\n\nHe also couldn’t answer whether or not they are still engaged. “I don’t even know what piece to pick up or how to put it back,” he said.\n\nBut that indecisiveness didn’t last long. Later on Wednesday, Jordan announced that he had broken off the engagement and “removed” himself from the relationship with Jenna in a lengthy Instagram post.\n\n“To think, to feel, to fall. These emotions interact with experiences and people, when you find a person you think about them, you feel when they feel and sometimes you fall,” he began the post. “When you’re in love with even the experiences you’ve had with them it’s something to respect. Being careless with someone that you give your heart to and reach milestones with isn’t sensible no matter what the terms may be. I have not had an easy life and having struggles allows me to grab onto tough times and discard them from my path.”\n\nContinuing, “I deal with unreasonable circumstances reasonably and have come to terms with a decision to remove myself from the relationship, it breaks my heart to think, feel and fall for this. It’s dropped me. Fumbling emotions and being understanding is not easy. I’ll be taking time to pursue my inner peace and she will always have me to talk to, if you’ve reached out to me, allow me time. Thank you to those that have.”\n\nJenna continued to deny the texts, calling them “completely fabricated” in her own Instagram statement, and said she is seeking legal advice to “investigate this hurtful and fraudulent attack on my character.”\n\nShe wrote in her post: “I want to start by saying those texts were completely fabricated, and I never sent them to anyone. I did not cheat on Jordan, and I have nothing to hide. I have been extremely open and vulnerable throughout this whole process. I was looking for love, and I found it. I was excited to share this journey with all of you. I am hurt by these fake texts, and that anyone would believe this story so quickly without proof. I have an attorney helping me investigate this hurtful and fraudulent attack on my character. We are evaluating all legal remedies available to punish those responsible.” (See both posts below.)\n\nJordan and Jenna were one of two couples to walk away from Bachelor in Paradise with an engagement. Chris Randone and Krystal Nielson revealed they are moving forward with wedding plans, albeit slowly, and two other couples — Kevin Wendt and Astrid Loch, and Kendall Long and Joe Amabile — ended the show with a relationship commitment. Joe, who was nicknamed “Grocery Store Joe” after he went viral over his night-one Bachelorette elimination, will next be seen on ABC’s Dancing With the Stars.\n\nBachelor in Paradise now boasts two marriages, one engagement and two relationships in five seasons. That success rate is higher than 22 seasons of The Bachelor, which has produced two marriages and one engagement. ABC has yet to comment.\n\nSept. 12, 12 p.m. Updated with Jordan’s Instagram post.\n\n2:30 p.m. Updated with Jenna’s Instagram post.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/09/jordan_jenna_0.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/09/jordan_jenna_0.jpg?w=1024", "keywords": [], "authors": ["Jackie Strause"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/bachelor-paradise-couple-jordan-kimball-jenna-cooper-respond-cheating-report-1142561/", "title": "‘Bachelor in Paradise’ Couple Calls off Engagement After Cheating Report", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "'Bachelor in Paradise' couple Jordan Kimball and Jenna Cooper respond to a cheating report after announcing their engagement on the ABC show's finale.", "news_keywords": "Bachelor In Paradise", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jackie Strause", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1142561, "title": "'Bachelor in Paradise' Couple Calls off Engagement After Cheating Report", "published_at": "2018-09-12 06:04:58", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/09/jordan_jenna_0.jpg?w=1024", "comment_count": 0, "tags": "Bachelor In Paradise", "topics": "TV News", "body": "Engagement bliss was cut short for Bachelor in Paradise couple Jordan Kimball and Jenna Cooper.\r\nAfter getting engaged on the pre-taped finale of the Bachelor and Bachelorette summer spinoff series on Monday night's episode, the pair revealed on Tuesday's reunion show that, weeks after filming had wrapped, they are still together and moving forward with wedding plans. By Wednesday, all of that had changed.\r\nDuring the reunion show, which was taped Aug. 28 and weeks after cameras stopped rolling on the Sayulita, Mexico, beach set, Jordan pitched his and Jenna's TV wedding to franchise host Chris Harrison: June 9, on the beaches of Paradise with Harrison officiating.\r\n\"We have a date for the wedding, we have to start planning that,\" Jordan had happily told The Hollywood Reporter after the taping of their plans. \"We want to bring our families closer together and we have to figure out a living space. We met on June 9 and it’s her birthday. The network brought us together, so why not bring us even closer together?\" \r\nShortly before the episode aired, however, franchise spoiler blogger Reality Steve published a report accusing Jenna of cheating on Jordan. The report included screengrabs of text messages apparently sent by Jenna, where she says she and Jordan \"aren't together for real\" and that she is faking it for her business (she runs a social media management company). \"I don't even like him, let alone love him. I'm better than him and once I'm able to I'll break it off for good and make up some story and make up some story to make him look bad if it will make you feel better,\" she writes in the messages to a man claiming to be in a relationship with her. \r\nHours after the Bachelor in Paradise reunion episode aired, both Jenna and Jordan spoke out about the accusations. Jenna denied the content in the text messages, but Jordan said he was blindsided.\r\n\"I am aware of the allegations being made against me and they are simply untrue,\" Jenna told People in a statement. \"I am choosing to focus on my relationship right now. Thank you for respecting my privacy at this time.\"\r\nJordan, however, said he felt \"weak in the knees\" and like \"I have rocks in my stomach\" after hearing the story, which he got a warning of on Twitter.\r\n\"On Monday, I saw something someone posted on Twitter — that somebody was going to be roasted the next night,\" he told the magazine. \"Jenna called me and said she was very anxious about this Twitter post. I talked to her in the middle of the night last night. I said, 'Don't hype yourself up, don't worry, you have nothing to worry about.' I tried to calm her. I went back to bed for a few hours, woke up, had my coffee and she called me again and said she was anxious and felt sick to her stomach.\"\r\nHe continued, \"She's in New York. I told her to keep calm. I thought she was just being nervous for no reason. Then I was driving back to Central Florida from Miami and I started getting calls from castmates like Chris Randone. I started getting screenshots sent to me. I didn't know what to think. I sank in my seat.\"\r\n\r\nJordan told the magazine that he believes the report: \"I know my Jenna, and I read those texts and in my heart, I know it's her. She was saying she didn't do it, but hinting towards the fact that there's a possibility that it happened. In all reality, I don't expect her to own it.\"\r\nJordan said they had been in the midst of planning an engagement party, but that this news is now \"killing\" him. \"I would never have expected this,\" he said. \"I feel sick about it. I just don't understand why someone would say that they're better than me and have ill intentions. If this whole thing sticks, and it's true, I will be hurt much more than the depths of romance. I will be hurt as a person and as a friend. There are so many layers to a relationship and right now I feel all of them peeling back.\"\r\nJordan, a model from Florida, broke out as a franchise face after his dramatic stint on Becca Kufrin's recent cycle of The Bachelorette. He quickly earned \"villain\" status for feuding with his fellow castmates, most notably co-star David Ravitz. Jordan and David continued their fighting when they returned on Bachelor in Paradise, but Jordan's storyline quickly turned to one of romance once he and Jenna began dating.\r\n\"This was not a TV romance,\" he told People of his relationship with Jenna, who hails from Arie Luyendyk Jr.'s season of The Bachelor. \"This was real. And whether you like me or not, I deserve love. I found it, and this is what happened. So for the sake of anyone who's ever been in love, be understanding.\"\r\nHe also couldn't answer whether or not they are still engaged. \"I don't even know what piece to pick up or how to put it back,\" he said.\r\nBut that indecisiveness didn't last long. Later on Wednesday, Jordan announced that he had broken off the engagement and \"removed\" himself from the relationship with Jenna in a lengthy Instagram post.\r\n\"To think, to feel, to fall. These emotions interact with experiences and people, when you find a person you think about them, you feel when they feel and sometimes you fall,\" he began the post. \"When you're in love with even the experiences you've had with them it's something to respect. Being careless with someone that you give your heart to and reach milestones with isn't sensible no matter what the terms may be. I have not had an easy life and having struggles allows me to grab onto tough times and discard them from my path.\"\r\nContinuing, \"I deal with unreasonable circumstances reasonably and have come to terms with a decision to remove myself from the relationship, it breaks my heart to think, feel and fall for this. It's dropped me. Fumbling emotions and being understanding is not easy. I'll be taking time to pursue my inner peace and she will always have me to talk to, if you've reached out to me, allow me time. Thank you to those that have.\"\r\nJenna continued to deny the texts, calling them \"completely fabricated\" in her own Instagram statement, and said she is seeking legal advice to \"investigate this hurtful and fraudulent attack on my character.\"\r\nShe wrote in her post: \"I want to start by saying those texts were completely fabricated, and I never sent them to anyone. I did not cheat on Jordan, and I have nothing to hide. I have been extremely open and vulnerable throughout this whole process. I was looking for love, and I found it. I was excited to share this journey with all of you. I am hurt by these fake texts, and that anyone would believe this story so quickly without proof. I have an attorney helping me investigate this hurtful and fraudulent attack on my character. We are evaluating all legal remedies available to punish those responsible.\" (See both posts below.)\r\nJordan and Jenna were one of two couples to walk away from Bachelor in Paradise with an engagement. Chris Randone and Krystal Nielson revealed they are moving forward with wedding plans, albeit slowly, and two other couples — Kevin Wendt and Astrid Loch, and Kendall Long and Joe Amabile — ended the show with a relationship commitment. Joe, who was nicknamed \"Grocery Store Joe\" after he went viral over his night-one Bachelorette elimination, will next be seen on ABC's Dancing With the Stars.\r\nBachelor in Paradise now boasts two marriages, one engagement and two relationships in five seasons. That success rate is higher than 22 seasons of The Bachelor, which has produced two marriages and one engagement. ABC has yet to comment.\r\n\r\n\r\n\t\r\n\t\t \r\n\t\t\r\n\t\t\t\r\n\t\t\t\t \r\n\t\t\t\r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\r\n\t\t\r\n\t\t\r\n\t\t\t \r\n\t\t\r\n\t\t\t\r\n\t\t\r\n\t\t\t\r\n\t\t\t\tView this post on Instagram\r\n\t\t\r\n\t\t\r\n\t\t\t \r\n\t\t\r\n\t\t\t\r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\r\n\t\t\t\r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\r\n\t\t\t\r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\r\n\t\t\r\n\t\tTo think, to feel, to fall. These emotions interact with experiences and people, when you find a person you think about them, you feel when they feel and sometimes you fall. When you’re in love with even the experiences you’ve had with them it’s something to respect. Being careless with someone that you give your heart to and reach milestones with isn’t sensible no matter what the terms may be. I have not had an easy life and having struggles allows me to grab onto tough times and discard them from my path. I deal with unreasonable circumstances reasonably and have come to terms with a decision to remove myself from the relationship, it breaks my heart to think, feel and fall for this. It’s dropped me. Fumbling emotions and being understanding is not easy. I’ll be taking time to pursue my inner peace and she will always have me to talk to, if you’ve reached out to me, allow me time. Thank you to those that have.\r\n\t\tA post shared by  Jordan Kimball (@jordan__kimball) on Sep 12, 2018 at 11:25am PDT\r\n\t\r\n\r\n\r\n\t\r\n\t\t \r\n\t\t\r\n\t\t\t\r\n\t\t\t\t \r\n\t\t\t\r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\r\n\t\t\r\n\t\t\r\n\t\t\t \r\n\t\t\r\n\t\t\t\r\n\t\t\r\n\t\t\t\r\n\t\t\t\tView this post on Instagram\r\n\t\t\r\n\t\t\r\n\t\t\t \r\n\t\t\r\n\t\t\t\r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\r\n\t\t\t\r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\r\n\t\t\t\r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\t\r\n\t\t\t\t\t \r\n\t\t\t\r\n\t\t\r\n\t\tI want to start by saying those texts were completely fabricated, and I never sent them to anyone. I did not cheat on Jordan, and I have nothing to hide. I have been extremely open and vulnerable throughout this whole process. I was looking for love, and I found it. I was excited to share this journey with all of you. I am hurt by these fake texts, and that anyone would believe this story so quickly without proof. I have an attorney helping me investigate this hurtful and fraudulent attack on my character. We are evaluating all legal remedies available to punish those responsible.\r\n\t\tA post shared by  Jenna Cooper (@jennacooperfit) on Sep 12, 2018 at 2:01pm PDT\r\n\t\r\n\r\nSept. 12, 12 p.m. Updated with Jordan's Instagram post.\r\n\t2:30 p.m. Updated with Jenna's Instagram post.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Bachelor in Paradise’ Couple Calls off Engagement After Cheating Report", "url": "https://www.hollywoodreporter.com/tv/tv-news/bachelor-paradise-couple-jordan-kimball-jenna-cooper-respond-cheating-report-1142561/", "description": "‘Bachelor in Paradise’ couple Jordan Kimball and Jenna Cooper respond to a cheating report after announcing their engagement on the ABC show’s finale.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/09/jordan_jenna_0.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-09-12T06:04:58+00:00", "modified_time": "2018-09-12T17:21:11+00:00"}, "twitter": {"site": "@thr", "creator": "@jackiedstrause", "card": "summary_large_image", "title": "‘Bachelor in Paradise’ Couple Calls off Engagement After Cheating Report", "description": "‘Bachelor in Paradise’ couple Jordan Kimball and Jenna Cooper respond to a cheating report after announcing their engagement on the ABC show’s finale.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/09/jordan_jenna_0.jpg?w=1280"}}, "movies": [], "publish_date": 1536732298.0, "source": "https://www.hollywoodreporter.com", "summary": ""}