{"url": "https://people.com/music/gwen-stefani-and-blake-shelton-photos/", "text": "01 of 46 They're Just Plain Cute Stefani said her husband makes \"it feel like Christmas\" — a nod to their holiday duet — at Thanksgiving 2021.\n\n02 of 46 They Celebrate Each Other Stefani was on hand to tout her love's latest milestone in September 2021: 20 years in the business plus a whole host of top records.\n\n03 of 46 They Know Their Fans Love Them Together Stefani popped up at the September 2021 CMA Summer Jam, while Shelton joined his bride on stage for her final Just a Girl Vegas residency show later that year.\n\n04 of 46 They're Married! In July 2021 the pair made it official, tying the knot in an intimate ceremony at home in Oklahoma officiated by friend Carson Daly. \"His love for her is so deep,\" a source told PEOPLE at the time. \"Having the wedding at home was a way for their families — and Gwen — to be as comfortable as possible.\"\n\n05 of 46 She Celebrates Him on Father's Day Stefani shared a special Father's Day post to Shelton in June 2021 on Instagram, writing, \" ... to the most generous patient loving funny guy i know - we love u so much @blakeshelton gx\" The slideshow of photos shows Shelton hanging out with Stefani's sons Kingston, Apollo and Zuma, whom she shares with ex-husband Gavin Rossdale.\n\n06 of 46 They're Engaged! Gwen Stefani and Blake Shelton's engagement. Gwen Stefani and Blake Shelton The couple made their engagement Instagram official on Oct. 27, 2020, with a sweet post from Stefani, who shared a pic of herself kissing her new fiancé and showing off her ring. \"@blakeshelton yes please! 💍🙏🏻 gx,\" she captioned the photo on Instagram.\n\n07 of 46 They Rule Awards Shows Gwen Stefani, Blake Shelton. Emma McIntyre/Getty Shelton and Stefani hit the 2020 Grammy Awards stage to perform their love song \"Nobody But You\" for the first time. Shelton took the stage first, singing solo with a guitar in hand. Stefani joined him midway through, walking out in a sheer white ballgown with an embellished Queen of Hearts-motif corset and matching headband. The couple played up their romance during the performance, facing each other and locking eyes as they sang. At one point, Stefani grabbed Shelton's hand as they finished singing the love ballad.\n\n08 of 46 They Shoot Heart-Melting Music Videos Together Just a few days before their duet performance at the Grammys, the duo released the highly anticipated music video for their song \"Nobody But You,\" and fans were not disappointed. The video featured clips of the longtime couple cuddling on a couch with their dog Betty, driving down dirt roads and sharing fries at a diner — all while singing about how they don't want to live or breathe without each other.\n\n09 of 46 They Share Holiday Traditions Gwen Stefani and Blake Shelton. The year 2019 marked Gwen and Blake's fourth annual getaway to his Oklahoma ranch with their extended families, including her three sons. \"We all fly out to Oklahoma, like 30 of us,\" Gwen told Entertainment Tonight. \"Blake has this bed and breakfast hotel that we all stay at, and it's just pretty incredible. We have fun, we all cook together, it's fun.\"\n\n10 of 46 They Top the Charts Together Harmony Gerber/Getty The talented duo released their third duet on Shelton's album Fully Loaded: God's Country in December 2019. The track, called \"Nobody But You,\" is a love song that hit home for Shelton, as it reflects on how a loving relationship can transform your life for the better — something both he and Stefani have openly credited their relationship with doing. \"This was one of those songs where the more I heard it, the more I fell in love with it,\" Shelton said in a statement. \"It fits my story,\" he continued. \"I was about to go in and record when I decided that it needed Gwen on it — because it is our song. I think it's magic.\"\n\n11 of 46 They Always Thank Each Other at Awards Shows Gwen Stefani and Blake Shelton. Todd Williamson/Getty Images The beloved couple were both honored at the 2019 People's Choice Awards, with Stefani winning the second-ever fashion icon award and Shelton taking home the award for best country artist. They made sure to give the other a sweet shoutout during their acceptance speeches, with Stefani playfully holding up the award for him to see while saying, \"Blake Shelton, look! Icon!\" and later adding, \"I love you, Blake Shelton, you're a babe.\" During the \"God's Country\" singer's speech, he tested the TV limits and ended his speech with a cheeky nod to his love, saying, \"Thanks to Pink because now I know we can cuss on this show and I want to say Gwen Stefani, I love the s--- out of you. Thank you.\"\n\n12 of 46 They Love Working Together Blake Shelton and Gwen Stefani. Trae Patton/NBC/NBCU Photo Bank/Getty Ever since first meeting on The Voice back in 2014, the pair have been very vocal about how much they love working together on the show — and it just keeps getting better, according to Stefani. \"Every season I've worked with Blake has been completely different because I've been in different places in my life,\" Stefani told PEOPLE in September 2019. \"This time's my favorite because we know each other so well.\"\n\n13 of 46 She Thinks He's a Great Dad Steve Granitz/WireImage Stefani appreciates the laughter funnyman Shelton brings into the lives of her three sons — Kingston, Zuma and Apollo. \"He is a good dad, actually,\" the former No Doubt singer said on the Today show. \"He's been helping me out a lot. I literally get to the point where I'm like, 'You gotta get home — I need help!' It's hard. I got three boys.\"\n\n14 of 46 They Share Sweet Birthday Shoutouts Blake Shelton and Gwen Stefani on her Instagram Story. Instagram To celebrate his lady's milestone 50th birthday, the country star gave her a sweet and silly shoutout on Twitter. \"Happy Birthday @gwenstefani!!!! I love you so much it's actually stupid… And possibly illegal in the state of California.\"\n\n15 of 46 Their Selfies Are Always Cuddly Gwen Stefani/Instagram Shelton snuggled up to his longtime girlfriend during a fun-filled lake trip with family.\n\n16 of 46 They Love Being Wedding Dates Gwen Stefani/Instagram The singers got romantic at a friend's wedding, where they danced the night away and took plenty of couple selfies.\n\n17 of 46 They Know the Words to Each Other's Songs Blake Shelton and Gwen Stefani in April. John Shearer/ACMA2018/Getty Stefani was seen singing along to Shelton's hit, \"I Lived It,\" which he performed at the 2018 ACM Awards.\n\n18 of 46 They Miss Each Other While on the Road Gwen Stefani/Instagram Though the happy couple can't always be together in person due to their touring schedules, Stefani sent her love across the miles by posting a sweet selfie of the pair on social media. \"Missing being a girlfriend on tour w this country boy,\" she captioned the photo.\n\n19 of 46 They're Thankful for One Another Gwen Stefani/Instagram Stefani joined PEOPLE's former Sexiest Man Alive for a PDA-packed Thanksgiving with friends and family in Oklahoma in 2017. \"Had the best Thanksgiving,\" wrote the songstress on Instagram.\n\n20 of 46 They Celebrate Each Other's Awards Gwen Stefani/Twitter \"I guess I've been kissing the #sexiestmanalive all this time but @people I knew that allready!! @blakeshelton gx,\" Stefani tweeted after Shelton was named PEOPLE's 2017 Sexiest Man Alive. She later added that he's \"perfect\" for the job.\n\n21 of 46 They Hang Out with Their Friends Michael Tran/FilmMagic Like former Voice coach Adam Levine.\n\n22 of 46 They Cheer Each Other Up Source: Gwen Stefani Instagram And when Gwen says she thinks Blake's a winner, he believes it — even if he first felt like a \"loser\" after the Voice finale.\n\n23 of 46 Blake's Tight with Gwen's Kids Gwen Stefani/Instagram The pair joked around with Gwen's son Apollo in an Instagram snap in July 2017.\n\n24 of 46 They Spend Important Days Together ... Instagram ... like Shelton's 41st birthday, which Stefani helped ring in with the help of an armadillo cake. \"Celebrating the birth of my #bestie,\" she wrote, captioning a pic of the country crooner on his big day.\n\n25 of 46 They're Each Other's Go-To Awards Show Dates Blake Shelton and Gwen Stefani. Kevin Mazur/BBMA2017/Getty The pair continued making the world swoon with their appearance at the 2017 Billboard Music Awards. \"I felt like I was the luckiest guy in the room anyway because Gwen is here with me, so I had a good feeling about [winning],\" Shelton said after taking home his top country artist trophy.\n\n26 of 46 They Give Each Other Public Shout-Outs on the Regular Emma McIntyre/Getty Images for People's Choice Awards Looks of love aside, Stefani and Shelton are also prone to gushing. Case in point: the 2017 People's Choice Awards, which saw the country singer single out his rocker-girlfriend while accepting his award. \"Thanks to the hottest date in the room tonight, Gwen Stefani,\" he said.\n\n27 of 46 He Thinks She's Really Hot Gwen Stefani/Instagram The attraction is ... undeniable. \"She's hot,\" Shelton said on an episode of Ellen, asking DeGeneres, \"Have you seen her? I mean look at that.\"\n\n28 of 46 He Seriously Admires Her Rachel Murray/Getty \"It's been just an eye opener to be with someone like her,\" Shelton also said to DeGeneres. \"Believe it or not, I mean, you think Gwen Stefani and No Doubt and she is literally maybe the most normal person that I've ever met in my life.\"\n\n29 of 46 They Perform Together for the President EPA/Michael Reynolds Shelton and Stefani had the honor of performing at President Obama's final State Dinner, where they shared a special moment on stage during their duet and mingled with former couple Sandra Lee and then New York Governor Andrew Cuomo. If that doesn't scream #RelationshipGoals, we don't know what does.\n\n30 of 46 Their Selfies Continue to Be on Point Source: Gwen Stefani/Instagram A couple that slays selfies together, stays together. In November 2016, the singers marked their first anniversary — and they couldn't be more smitten. \"I can't say anything but I'm so blessed,\" Stefani told PEOPLE. \"It's just crazy how much happened, you know what I mean? So many beautiful memories.\"\n\n31 of 46 They're Rarely Not Cuddling Source: Gwen Stefani/Instagram This sweet backstage pic is yet another piece of evidence that the couple can't keep their hands to themselves. They make their love fest very public, too. At one of Shelton's recent tour stops, the country singer invited Stefani on stage for an adorable duet. \"He wanted me to come out and do the song, which I was like, 'Duh!' I want do to it as many times as we can,\" Stefani told PEOPLE.\n\n32 of 46 Seriously Though ... They Can't Stop Smiling Around Each Other Source: Gwen Stefani/Instagram We have zero photos that prove otherwise.\n\n33 of 46 They Share a Passion for Good Food Source: Gwen Stefani/Instagram Shelton knows the way to Stefani's heart: through her stomach. Following Stefani's Boston show — kicking off her This Is What the Truth Feels Like tour — the country star treated the singer and her crew to a New England-style feast that included lobster rolls and fried calamari courtesy of The Cod Squad, a food truck Shelton rented for the occasion.\n\n34 of 46 They're Really Important to Each Other Kevin Winter/Getty Images for iHeartMedia Blake isn't shy about expressing his appreciation for Gwen, who he says helped him after announcing his split from Miranda Lambert. \"I tell people all the time, 'Gwen saved my life last year,' \" Shelton said in an interview with CMT's Hot 20 Countdown. \"She did, and I think she would probably tell you something similar about me.\"\n\n35 of 46 They Glow When They're Together Source: Gwen Stefani Instagram Stefani shared several adorable photos with her man while in Las Vegas for the 2016 Billboard Music Awards. The singer wrapped her arm around Shelton's shoulder as they smiled for a close-up shot — and they're both radiating warm and fuzzy feels.\n\n36 of 46 They're Masters at Harmonizing NBC The stars performed their duet, \"Go Ahead and Break My Heart,\" on The Voice — confirming what everyone thought to be true: this pair shares as much chemistry onstage as they do offstage. \"I love this song! This song's important to us and the fact that we wrote it together is so important to both of us,\" Shelton previously told PEOPLE.\n\n37 of 46 They Support Each Other Source: Gwen Stefani/Instagram \"It was a really super unexpected gift to find a friend, somebody who happened to be going through the exact same thing as me, literally mirroring my experience,\" Stefani said of her undeniable connection to Shelton. \"I don't think it's an accident that that happened. It saved me.\"\n\n38 of 46 They Aren't Afraid of PDA Replacement image for 287218 \"They acted like giddy teenagers at a high school dance,\" an insider told PEOPLE of the pair's PDA-packed night at the Vanity Fair Oscars party. \"They were holding hands the whole night and didn't leave each other's sides. I don't think either of them stopped smiling the entire time they were there.\"\n\n39 of 46 Gwen Is More Than Willing to Channel Her Country Roots Gwen Stefani/Twitter … and is even happy to do so — especially when it comes time to visit Blake's home in Tishomingo, Oklahoma. \"She takes time with her image and she's very serious about her career, but she's also just a regular gal,\" a source close to the couple revealed to PEOPLE. \"She loved having time on that farm and immediately fit into the fabric of the town.\"\n\n40 of 46 Family Means Everything to Them Fresh/INFphoto \"They have the same perspective on life and the same family values,\" says a source close to the couple, who spends the holidays in Tishomingo with Blake's family. \"They're very close with their families, and there's a very easygoing way about them.\"\n\n41 of 46 Did We Mention They Love PDA? Source: Gwen Stefani/Twitter Even if it does involve biting.\n\n42 of 46 They're Pretty Much the Same Person (Really!) Splash News Online Don't let their apparent differences (fashion and music style) fool you: these two have a lot more in common than you think. \"It's clear they share a great life,\" says a source. \"They share a passion for music and are very supportive of each other's careers.\"\n\n43 of 46 They Look at Each Other Like This Douglas Gorenstein/NBC/GETTY Never mind the pop star's \"Make Me Like You\" single, which was inspired by her country star beau — can we just take a moment to acknowledge Gwen and Blake's gazes? They're totally smitten.\n\n44 of 46 They're Hardly Ever Apart Kevin Mazur/WireImage They know how important quality time is with when it comes to making a relationship work. \"Coming from the relationships they did, it's really important to both of them to make time for each other,\" said an insider. \"They both recognize the importance of time for a relationship and for family.\n\n45 of 46 They're Both Positive People Courtesy Gwen Stefani In fact, it's kind of why they got together. \"She tried so hard for the kids to keep the marriage together,\" said a source close to No Doubt frontwoman of her union to Gavin Rossdale. \"Then here came this ray of sunshine who did make her smile, and now he's one of the most positive people in her life.\"", "images": ["https://people.com/thmb/NrsVAEma7ZrMe5QHu61rFy9QBe4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/gwen-stefani-1-2000-33b4ac3044c04f5f98350132c465e5be.jpg", "https://people.com/thmb/11-wJHcg78AfAfB6vPgVLtPCu40=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(560x377:562x379)/gwen-stefani-2-1-0a4ec706d0cf4410a7bade30062c89c5.jpg", "https://people.com/thmb/3vUuoCeBcKvcc2S8T5dAagrZKO8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(596x0:598x2)/gwen-stefani-c066a2820b15443cb0c9f4c0ac917777.jpg", "https://people.com/thmb/RD0NxHZTu5yqz_a4ESjLZC2pA3E=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(839x189:841x191)/Blake-Shelton-3dce4a4e2f994c31a2e883efa464b654.jpg", "https://people.com/thmb/H4M1U3mg3S_-8oqN3mHlwP14lvA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(595x0:597x2)/screen-shot-2016-10-13-at-10-44-19-am-5181f8cfd8b64b93b9f8eed26907eab6.png", "https://people.com/thmb/BsgQMurn7r1KdpifmeCGamnQAjA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(478x551:480x553)/gwen-stefani-blake-shelton-wedding-a8e024d241854d099cdee758633aa160.jpg", "https://people.com/thmb/ctzkZEjKg-v-jLYnMjR_bc4U2RM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(677x479:679x481)/blake-gwe-2000-f5b06eb4b988445d88ca8effffb03428.jpg", "https://people.com/thmb/awLL_JnLxSmmefkK_FYo8y39xO4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/blake-shelton-b-800-1-cd63ae623e3f4b3daa3b4c7d72b5ffe6.jpg", "https://people.com/thmb/p24rmdcHDjvkcoYVIn30McIGCn0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(874x0:876x2)/gwen-stefani-blake-shelton-1-d76f51b6af174290a1473d487d124135.jpg", "https://people.com/thmb/19oSl4-b4R3qOeHgGk2vq1xRLOU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(625x430:627x432)/gwen-stefani-4-7ec2da1d7e3944e5b5dbacd05ddb6fcd.jpg", "https://people.com/thmb/RgGkP4m--nrVw7A7Ev_rNEsdpM0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(299x0:301x2)/gwen-stefani-b-600-9b55a6ce0ce9423b9703ed2fb68e104a.jpg", "https://people.com/thmb/JweBrdwljX4Pmocl7e-TOCbVr50=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(299x0:301x2)/shelton-stefani-ig-600-6658af5cab63446c88f93b88c0ea9534.jpg", "https://people.com/thmb/AKiAdHqiJ3Sd9W4z1MEYYo34IyY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(464x449:466x451)/gwen-blake-b0190297c21b435eabd3763e11cf6645.jpg", "https://people.com/thmb/9eih3ac3jHDroHiXMfzpIX_2VAg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/gettyimages-1202162101-2000-2dff23ac71c44401ad99b228a9499dba.jpg", "https://people.com/thmb/QMaaU4miLLWARSedcpuHtCQ-YAE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(511x0:513x2)/blake-shelton-p-1024-2948936dd624478dbbda3d20fc8c27bd.jpg", "https://people.com/thmb/dd_-EAliwjwznYTpA63H-p3EPE4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/stefani-shelton-6-13dd804c7e8b4f0bbe344f14471e2757.jpg", "https://people.com/thmb/Ca1ahv3yo0tYcfFOlmy4IAKvaEo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(299x0:301x2)/shelton-stefani-600x800-1-c7a17c91e16b4556af1e11cff7a6862c.jpg", "https://people.com/thmb/xZlXBZ81DIiwsZCyS_dIp9cUnFU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(699x380:701x382)/blake-shelton-gwen-stefani-eedb60823c924d0d9ad4ce0a1fbb6f75.jpg", "https://people.com/thmb/nh0c9OoqaqBrLfQzvN2ITjRwo6s=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/shelton-stefani-3-0fc64e7182cb4e3db24fa06a0fa7503e.jpg", "https://people.com/thmb/rqslwds_NwevFpPR8qdifBar6KU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/gwen-stefani-blake-shelton-17f0909b436a4b0fb7e247d81512ca52.jpg", "https://people.com/thmb/kXCDTrWvCya1qm0WQQPDjflQ2wY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/shelton-stefani-1-2000-0839ac3a6356485fb014384d6288644f.jpg", "https://people.com/thmb/AC5nqAgQiFlCHchuYyiwEWjIDUM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(767x0:769x2)/gwen-stefani3-f3364ec4ef594bd6b96a45f8425ccb66.jpg", "https://people.com/thmb/EFf2g9eJuCe3t9P6Ky6B7PTsDdM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/shelton-stefani-2000x2000-dd536938e1454e639eb3bb87a68e8228.jpg", "https://people.com/thmb/4O1GFOO03vyDlTk_JmBlOGDkRcc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(603x282:605x284)/blake-shelton-07a9509d0e534bb189a4fb22b3cf6d7b.jpg", "https://people.com/thmb/AeTzGmv4M101YYDG_JJC9Z4RQdI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/gwen-stefani2-2ba5fa43ab614fc4a8d6a775de2d419e.jpg", "https://people.com/thmb/xD-CURb-5to-lDc4-hf8K1OAvk8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/gwen-stefani-435-280-8772bcb660844907bae32d6b06c7d12b.jpg", "https://people.com/thmb/yyWZ7mdKvMExehYtv8muLoPF_jc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/gwen-stefani-1-2000-1c82d952e5b7446986332a9af8cc6b43.jpg", "https://people.com/thmb/tMuxKw9g6AT96J6I8BGnAnLxY30=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(717x0:719x2)/blake-shelton1-1-d22eba0d58d0472d97a2c27d8995d98e.jpg", "https://people.com/thmb/eot_kH-u1CEyRLuC2ZOEQW1jPsg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(8774x3699:8776x3701)/Gwen-Stefani-Blake-Shelton-591f6b1c8f284f6c94beef390b0c43f4.jpg", "https://people.com/thmb/eFjc5gQWYZDh8zEOHBjsck-br8I=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/gettyimages-1167884017-1-2000-443012df667c48c5a041c65dce66dd35.jpg", "https://people.com/thmb/0WKMa4HEkP6xobklVphgwUT-cD0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/peoples-choice-54-2000-4d9f0071ac3741c8b6eb192eb69d1926.jpg", "https://people.com/thmb/wlXqKXou_sQ4baj2ORhUSTeckkA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(268x0:270x2)/gwen-e-1-32849b641eb84c1b9efe60f852cfc39d.jpg", "https://people.com/thmb/E8EOjHfY5uqg0C8psLmQiGw02fg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/blake-shelton-435-50-7fb99a6f392e415ba181a92602ce94bb.jpg", "https://people.com/thmb/zvG0h964wmUv4SgwF5ao8AEhOYA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(939x398:941x400)/gwen-blake-1-43c5de3d789343b8af6d9ca5deb156b8.jpg", "https://people.com/thmb/ckTEoeLkZKRFEIhAGps5omG7oNE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(671x0:673x2)/gwen-stefani-3-db50d6ba48f74e5c963f36d200a7b1db.jpg", "https://people.com/thmb/Je8QGUqwWoJqun0MtpVB_64WN-s=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(839x158:841x160)/gwen-stefani-1-2000-54739bd24df14f7b8a64db2d1f19add9.jpg", "https://people.com/thmb/8BPTA7HdqqeNsaO7gMl2UZn7GZw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(551x0:553x2)/gwen-blake-1-2000-e86eadbfff7c43779f1fdac13e061030.jpg", "https://people.com/thmb/vKq9IIHeqH_GyNdExPi7XZfoY-Y=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(299x0:301x2)/stefani-shelton-01-600-776cb9d6d0d649318322deb15bf95e32.jpg", "https://people.com/thmb/NrmrO1Zq9UhfsRJZJuUyY0uuq2A=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/gwen-blake-435a-1-a1081cb89cdc416c8bed578801f76a79.jpg", "https://people.com/thmb/REwY52x1VZr7uvhO4SDHyAlzGvE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(637x0:639x2)/gwen-d-1-22bdb4740d6f4b9bb38edf6e60de8495.jpg", "https://people.com/thmb/E0oERmcdaHsPh3qbeIhJvJH-70g=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(319x0:321x2)/gwen-stefani-instagram-4bfbc98da5f14ee5aaf0f985a7738fb1.jpg", "https://people.com/thmb/F5EoCsqn7KMejZL9rQFYPAcKZ0s=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/gwen-blake-1-b73e02a440884175854f3947e92c066a.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/eFUmOj6luO4mpBVUXKegLV2aekQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/blake-gwen-800-1-7498116d19464d0298df451d9bcbd3f7.jpg", "https://people.com/thmb/ZiyEsSRVc_Ztk1b3QtWr4ImzJ5c=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(561x0:563x2)/gwen-stefani-blake-shelton-kiss-1-e28b9c3c082a44329737dcd59145eb51.jpeg", "https://people.com/thmb/Y6eeIiv2epmbw-7kjNOq-kfo4iE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/gwen-stefani-1-d3acc4ebce394e68a59bcdfc88bf7994.jpg", "https://people.com/thmb/Wz0GVrTpiHcHJ0DZf7fFL_TDG-w=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(595x0:597x2)/screen-shot-2016-10-13-at-10-44-54-am-c3aac1486bb04b6b9efc37e827847c45.png", "https://people.com/thmb/ldqhISHZkM_natCs-2OoQEu9U_0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/gwen-stefani-state-dinner-58bc9940d244485b94dc2a66bd311323.jpg", "https://people.com/thmb/TMHZr5_d3Pjikb6oRSnz9bfcgTo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/gwen-blake-800-1-d3093007aa904cca9c01588db5967f97.jpg", "https://people.com/thmb/3UY6PiUx7X8MScnMuftr0R0fZCw=/1080x810/filters:fill(auto,1)/blake-shelton-07a9509d0e534bb189a4fb22b3cf6d7b.jpg", "https://people.com/thmb/4XM4TqttxGRTXlZU_zUgoz0U5Mw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(594x0:596x2)/screen-shot-2016-10-13-at-10-44-33-am-fd21e8b98b1b49a9ae0a182ae448708d.png", "https://people.com/thmb/JEQXV1QzgRc1B4K55sAcZG8Url0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/gwen-stefani-1-b749b15da42a461091284f798b229cd7.jpg", "https://people.com/thmb/6GyaNIpdg-aOYrA_13wZW3vqHzg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/blake-shelton-660-40-a62f7968a8e94295afb14302689bfa44.jpg", "https://people.com/thmb/6ssdoeyR7gCTLsARmvO8YK5amN4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(897x639:899x641)/Gwen-Stefani-0c107f9ca673439eaea6a32ebeb9cd0a.jpg", "https://people.com/thmb/LSYGCyYJxx7b11uNe5RXF02T4OM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/gwen-stefani-b-660-f9ef10e96d72478c9611c6a681e2e9c2.jpg", "https://people.com/thmb/vhAR92etSDifYLe8ISzxotdPpkU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(876x0:878x2)/blake-shelton-1-1c78ba568b8c478f80e2046999b5764a.jpg", "https://people.com/thmb/5Q9mS4siTmDIHOFebDB51qafZTI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(821x0:823x2)/gwen-stefani-1-f6f085ba2786474fb8c0b42b60528a9d.jpg", "https://people.com/thmb/cNP7Wgpuf0C9jlo6EgVjZHfALAs=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(299x0:301x2)/gwen-stefani-t-600-0e816f9cb2ad4023bff0740839d3e425.jpg"], "top_img": "https://people.com/thmb/3UY6PiUx7X8MScnMuftr0R0fZCw=/1080x810/filters:fill(auto,1)/blake-shelton-07a9509d0e534bb189a4fb22b3cf6d7b.jpg", "keywords": [], "authors": ["Grace Gavilanes"], "canonical_link": "https://people.com/music/gwen-stefani-and-blake-shelton-photos/", "title": "Gwen Stefani and Blake Shelton Photos", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Gwen Stefani and Blake Shelton love working together on The Voice, spending family time with Stefani's three sons and topping the charts together. See their cutest photos!", "emailcontenttype": "LISTSC", "emailvertical": "PEOPLE", "sailthru.author": "Grace Gavilanes", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/music/gwen-stefani-and-blake-shelton-photos/", "title": "Gwen Stefani and Blake Shelton Photos", "description": "Gwen Stefani and Blake Shelton love working together on The Voice, spending family time with Stefani's three sons and topping the charts together. See their cutest photos!", "image": "https://people.com/thmb/3UY6PiUx7X8MScnMuftr0R0fZCw=/1080x810/filters:fill(auto,1)/blake-shelton-07a9509d0e534bb189a4fb22b3cf6d7b.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Gwen Stefani and Blake Shelton Photos", "description": "Gwen Stefani and Blake Shelton love working together on The Voice, spending family time with Stefani's three sons and topping the charts together. See their cutest photos!", "image": "https://people.com/thmb/YMS8sADVAbA5u4ymrVo5hyxD7fA=/1080x810/filters:fill(auto,1):focal(603x282:605x284)/blake-shelton-07a9509d0e534bb189a4fb22b3cf6d7b.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}