{"url": "https://web.archive.org/web/20201112031249/https://www.forbes.com/sites/alfredkonuwa/2017/05/10/wwes-brie-bella-gives-birth-3-reasons-birdie-joe-is-a-million-dollar-baby/", "text": "Retired WWE Superstar Brie Bella has given birth to Birdie Joe Danielson, a healthy baby girl born Tuesday, May 9th at 11:58 p.m. Birdie, conceived with husband and current SmackDown Live General Manager Daniel Bryan, was born at eight pounds, 10 ounces and 21 inches.\n\nCredit: Eonline.com\n\nBrie Bella has adapted quite well to life after WWE as the Divas-era star has been featured in Total Divas, Total Bellas and the popular Bella Twins YouTube channel which, in partnership with WWE, has amassed a staggering 500,000 subscribers in just under a year.\n\nThe newest addition to the Bella dynasty could be its most important in terms of furthering a brand that has could one day put the Bella Twins on equal footing as some of the biggest giants in both reality television and digital media.\n\nBaby Bella Raises Profile of WWE's Reality TV Portfolio\n\nIn its Q4 2016 earnings report, WWE singled out the Bella Twins YouTube channel and Total Bellas as highlights of its growing presence in digital media and reality television, respectably. On the strength of reality shows like Total Bellas, WWE was able to increase its television revenues by 23 percent, compared to Q4 2015, with revenues of $68.6 million.\n\nWith the first Bella baby now conceived, Nikki Bella, Brie Bella, John Cena and Daniel Bryan stand to reap the benefits of surging interest in their monetized post-WWE lives.\n\nCredit: WWE.com\n\nBirdie Joe Playlist will Attract Millions of Viewers on YouTube\n\nSpecial events have translated to large viewership numbers on the Bella Twins YouTube channel. All four of the aforementioned stars are either retired or part-time performers. The Bella Twins YouTube channel has allowed fans continued access to their lives while they spend time away from the world wide leader and its famed squared circle.\n\nWhen the channel surpassed 500,000 subscribers, John Cena and Nikki Bella engaged in a playful striptease to the tune of over seven million views and counting. As of this writing, the channel has since surpassed to over 630,000 subscribers.\n\nAs part of the Bella Twins YouTube channel, Cena and Nikki Bella have launched the \"Our Wedding\" playlist, documenting the pending nuptials between the power couple following Cena's high-profile proposal at WrestleMania 33. With just nine videos, the playlist is closing in on nine million views as it has averaged just under one million views per video.\n\nBrie Bella and Daniel Bryan figure to reap similar benefits for all things Birdie Danielson, as videos of the new parents will to spark comparable interest.\n\nBaby Bella Translates to E! Network Ratings Bonanza\n\nShould the long-awaited birth make its way to either Total Divas or Total Bellas, both of which air on the E! Network, the Bella Empire stands to have quite the ratings coup with both a wedding special and a child birth episode occurring in the same season.\n\nIn Keeping up with the Kardashians, the episode All Signs Point to North featured footage of Kim Kardashian going into labor. The episode, which occurred in Season 11, drew an impressive 2.28 million viewers. And while a show like Total Bellas may not see a similar pop in viewership—the inaugural season averaged just over 640,000 viewers—it can certainly expect to grow its viewership in the likelihood that it continues to broadcast such intriguing life events.", "images": ["https://web.archive.org/web/20201112031249im_/https://secure.gravatar.com/avatar/f461a8a1b6a8be95b105485800c13910?s=400&d=mm&r=g", "https://web.archive.org/web/20201112031249im_/https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fblogs-images.forbes.com%2Falfredkonuwa%2Ffiles%2F2017%2F05%2FBrie2.jpg"], "top_img": "https://web.archive.org/web/20201112031249im_/https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fblogs-images.forbes.com%2Falfredkonuwa%2Ffiles%2F2017%2F05%2FBrie2.jpg", "keywords": [], "authors": ["Alfred Konuwa"], "canonical_link": "https://web.archive.org/web/20201112031249/https://www.forbes.com/sites/alfredkonuwa/2017/05/10/wwes-brie-bella-gives-birth-3-reasons-birdie-joe-is-a-million-dollar-baby/", "title": "WWE's Brie Bella Gives Birth: 3 Reasons Birdie Joe Is A Million-Dollar Baby", "meta_data": {"referrer": "no-referrer-when-downgrade", "viewport": "width=device-width,initial-scale=1,maximum-scale=5,minimum-scale=1,user-scalable=yes", "description": "Brie Bella gave birth to Birdie Joe Danielson, a healthy baby girl who will figure to make the Bella Twins budding media empire healthier than ever.", "author": "Alfred Konuwa", "article": {"section": "Business", "section_url": "https://www.forbes.com/sportsmoney/", "id": "blogAndPostId/blog/post/3951-3181", "published": "2017-05-10", "modified": "2017-05-10", "publisher": "https://www.facebook.com/forbes", "author": "Alfred Konuwa"}, "og": {"title": "WWE's Brie Bella Gives Birth: 3 Reasons Birdie Joe Is A Million-Dollar Baby", "site_name": "Forbes", "type": "article", "url": "https://web.archive.org/web/20201112031249/https://www.forbes.com/sites/alfredkonuwa/2017/05/10/wwes-brie-bella-gives-birth-3-reasons-birdie-joe-is-a-million-dollar-baby/", "image": "https://web.archive.org/web/20201112031249im_/https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fblogs-images.forbes.com%2Falfredkonuwa%2Ffiles%2F2017%2F05%2FBrie2.jpg", "description": "Brie Bella gave birth to Birdie Joe Danielson, a healthy baby girl who will figure to make the Bella Twins budding media empire healthier than ever.", "updated_time": "2017-05-10T18:48:42.582-04:00"}, "fb": {"app_id": 123694841080850}, "apple-itunes-app": "app-id=588647136", "twitter": {"card": "summary_large_image", "site": "@forbes", "creator": "@@ThisIsNasty", "title": "WWE's Brie Bella Gives Birth: 3 Reasons Birdie Joe Is A Million-Dollar Baby", "description": "Brie Bella gave birth to Birdie Joe Danielson, a healthy baby girl who will figure to make the Bella Twins budding media empire healthier than ever.", "image": "https://web.archive.org/web/20201112031249im_/https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fblogs-images.forbes.com%2Falfredkonuwa%2Ffiles%2F2017%2F05%2FBrie2.jpg"}}, "movies": ["https://web.archive.org/web/20201112031249if_/https://www.youtube.com/embed/gKLDO3Zm4WM"], "publish_date": 1494370800.0, "source": "https://web.archive.org", "summary": ""}