{"url": "www.washingtonpost.com/news/the-fix/wp/2017/02/04/trump-lashes-out-at-federal-judge-who-temporarily-blocked-travel-ban/", "text": "A federal judge in Seattle on Feb. 3 temporarily blocked the enforcement of President Trump’s travel ban. Here’s what you need to know about the judge’s ruling. (Video: Natalie Jennings, Bastien Inzaurralde, Alice Li/The Washington Post, Photo: Susan Walsh/The Washington Post)\n\nGift Article Share\n\nPresident Trump ripped into a federal judge's decision to temporarily block enforcement of his controversial travel ban, sending tweets throughout the day. “When a country is no longer able to say who can, and who cannot , come in & out, especially for reasons of safety &.security — big trouble!” Trump posted on Twitter early Saturday morning.\n\nHe also appeared to question the legitimacy of the federal judge who issued the ruling.\n\n“The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!” Trump tweeted.\n\nThe tweets came hours after a federal judge in Washington state temporarily blocked enforcement of Trump’s ban on entry to the United States for citizens of seven majority-Muslim countries and refugees from around the world.\n\nAdvertisement\n\nU.S. District Judge James L. Robart wrote in his opinion that “fundamental” to the court’s work was “a vigilant recognition that it is but one of three equal branches of our federal government.”\n\nRobart, a judge appointed by George W. Bush, said in his written order that U.S. officials should stop enforcing the key aspects of the ban: the halting of entry by citizens from certain countries and by refugees from around the world. He did not specifically address the matter of those whose visas already had been revoked.\n\nFollowing the Friday-night ruling, government authorities immediately began communicating with airlines and taking steps that would allow travel by those previously barred from doing so, according to a U.S. official.\n\nAt the same time, though, the White House said in a statement that the Justice Department would “at the earliest possible time” file for an emergency stay of the “outrageous” ruling from the judge. Minutes later, it issued a similar statement omitting the word “outrageous.”\n\n“The president’s order is intended to protect the homeland and he has the constitutional authority and responsibility to protect the American people,” the White House said.\n\nAdvertisement\n\nTrump signed orders on Jan. 27 not only to suspend admission of all refugees into the United States for 120 days but also to implement “new vetting measures” to screen out “radical Islamic terrorists.” Refugee entry from Syria, however, would be suspended indefinitely, and all travel from Syria and six other nations — Iran, Iraq, Libya, Somalia, Sudan and Yemen — is suspended for 90 days. Trump also said he would give priority to Christian refugees over those of other religions, according to the Christian Broadcasting Network.\n\nHours after it was signed, Trump's executive order sparked massive protests at airports across the country, as reports surfaced that dozens of travelers from the affected countries, including green-card holders, were being detained.\n\nThe American Civil Liberties Union filed a lawsuit the following day challenging Trump’s order after two Iraqi men with immigrant visas were barred from entering the United States at New York's John F. Kennedy International Airport. Within hours, federal judge Ann M. Donnelly issued a stay to stop the deportations nationwide, noting there was a strong likelihood the order had violated the petitioners' rights to due process and equal protection by the Constitution.\n\nTravelers affected by ban begin to arrive in U.S. after Trump order is suspended Share Share Share on Facebook Share on Twitter Share on Reddit Share on LinkedIn MailSolid Email this link View Photos View Photos Next Image DULLES, VA - At Dulles International Airport, Muhamad Alhaj Moustafa, M.D., an Internal Medicine resident at the Washington Hospital Center, welcomes home his wife, Nabila Alhaffar, who was traveling from Doha where she saw family but was prevented from coming back to the US because of President Trump's Executive Order on travel, in Dulles, Virginia Monday February 6, 2017. (Melina Mara/The Washington Post)\n\nSince then, the travel ban has evolved as Trump's administration has attempted to clarify exceptions to the order. The Department of Homeland Security said the ban would not apply to permanent residents or green-card holders, dual citizens who carry a passport from somewhere other than one of the banned countries and those with NATO or U.N. visas.\n\nAdvertisement\n\nRobart's ruling Friday, which was broader than similar ones before it, sets up a high-stakes legal confrontation between the new president and the judicial branch.\n\nThe ruling is temporary, and the ultimate question of whether Trump’s executive order will pass constitutional muster will fall to higher-level courts. Legal analysts have said the ban could be difficult to permanently undo because the president has broad authority to set immigration policy.\n\nLater Saturday morning, the State Department announced it would reverse its visa revocations, allowing previously banned travelers to enter the United States.\n\nTrump, presumably responding to the latest development, resumed tweeting his displeasure hours later.\n\nAnd then again, an hour later:\n\nThough his tweet implied that “anyone” could now come into the United States, the State Department's announcement applied to travelers from those countries who already held valid visas.\n\nAdvertisement\n\n“Those individuals with visas that were not physically canceled may now travel if the visa is otherwise valid,” a State Department spokesman said Saturday, adding that Department of Homeland Security personnel “will resume inspection of travelers in accordance with standard policy and procedure.”\n\nMatt Zapotosky, Lori Aratani and Justin Jouvenal contributed to this article. This post has been updated.\n\nRead more:\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/WashingtonPost/2017/01/29/National-Security/Images/2017-01-29T143122Z_1218394881_RC1317BBD510_RTRMADP_3_USA-TRUMP-IMMIGRATION-0781.jpg&w=1440"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/WashingtonPost/2017/01/29/National-Security/Images/2017-01-29T143122Z_1218394881_RC1317BBD510_RTRMADP_3_USA-TRUMP-IMMIGRATION-0781.jpg&w=1440", "keywords": [], "authors": ["Amy B Wang"], "canonical_link": "https://www.washingtonpost.com/news/the-fix/wp/2017/02/04/trump-lashes-out-at-federal-judge-who-temporarily-blocked-travel-ban/", "title": "Trump lashes out at ‘so-called judge’ who temporarily blocked travel ban", "meta_data": {"description": "The tweets came hours after a federal judge in Washington state temporarily blocked enforcement of President Trump’s executive order.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/the-fix/wp/2017/02/04/trump-lashes-out-at-federal-judge-who-temporarily-blocked-travel-ban/", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/WashingtonPost/2017/01/29/National-Security/Images/2017-01-29T143122Z_1218394881_RC1317BBD510_RTRMADP_3_USA-TRUMP-IMMIGRATION-0781.jpg&w=1440", "title": "Trump lashes out at ‘so-called judge’ who temporarily blocked travel ban", "description": "The tweets came hours after a federal judge in Washington state temporarily blocked enforcement of President Trump’s executive order."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Trump lashes out at ‘so-called judge’ who temporarily blocked travel ban", "description": "The tweets came hours after a federal judge in Washington state temporarily blocked enforcement of President Trump’s executive order."}, "last_updated_date": "2021-11-25T15:29:40.910Z", "article": {"published_time": "2017-02-04T22:58:35.000Z", "modified_time": "2021-11-25T15:29:40.910Z", "section": "The Fix", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 71, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/news/the-fix/wp/2017/02/04/trump-lashes-out-at-federal-judge-who-temporarily-blocked-travel-ban/"}, "movies": [], "publish_date": 1486166400.0, "source": "http://www.washingtonpost.com", "summary": ""}