{"url": "https://www.celebritynetworth.com/richest-celebrities/eddie-judge-net-worth/", "text": "What is Eddie Judge's Net Worth?\n\nEddie Judge is an American reality TV star and lawyer who has a net worth of $3 million. Judge became a household name when he began dating one of the main cast members of Bravo's \"The Real Housewives of Orange County,\" Tamra Barney. Tamra joined the cast of \"The Real Housewives of Orange County\" during season three, and the show followed the dissolution of her marriage throughout seasons 4 and 5. She finalized her divorce from now ex-husband, Simon Barney, in the fall of 2011, and Judge began appearing on \"The Real Housewives of Orange County\" that year.\n\nEddie and Tamra starred in the 2013 spin-off \"Tamra's OC Wedding,\" and they appeared in an episode of the E! network's \"Hollywood Medium With Tyler Henry\" in 2019. Judge served as an associate producer on the 2020 documentary \"Erasing Family,\" which \"follows young adults fighting to reunite with their broken families.\"\n\nEarly Life\n\nEddie Judge was born on March 31, 1973, in Guadalajara, Mexico. He was raised by his grandmother in Orange County, California, and he studied business administration in college.\n\nCareer\n\nWhen he met Tamra, Eddie was managing the Judge Law Firm in Irvine, California. He worked for his adoptive father, attorney James Judge, who is the founder and managing partner of the firm. The Judge Law Firm focused most of their services on \"representing homeowners associations (HOAs) in suits against members of the HOA for failure to pay HOA fees.\" Eddie eventually left his job with the law firm and became a founding partner and co-owner of the gym C.U.T. Fitness with Tamra. The gym is based in Rancho Santa Margarita, California, and the couple celebrated its grand opening in February 2013.\n\nJudge also serves as a Nutrition Coach, Spartan Race Coach, Strength & Conditioning Trainer, and Cycling Coach at the gym. In January 2019, Eddie and Tamra launched Vena CBD, which includes products for both people and pets. Judge began appearing on \"The Real Housewives of Orange County\" during the show's sixth season and remained on the series through season 14 in 2019. In January 2020, Tamra announced that she was leaving the series, saying that she reevaluated her life as a result of Eddie's health issues and her ex-husband's cancer diagnosis.\n\nPersonal Life\n\nEddie proposed to Tamra Barney in Bora Bora in 2012, and they wed at the Monarch Beach Resort in Dana Point, California, on June 15, 2013. The nuptials were documented for the three-part televised event \"Tamra's OC Wedding,\" which aired in September 2013. Judge is stepfather to Tamra's children from her first and third marriage, Ryan, Sophia, Sydney, and Spencer. In November 2019, Tamra revealed that Eddie had undergone heart surgery for atrial fibrillation 10 times and would be having an ablation and an implant inserted in his heart the following January. In April 2020, Judge stated that his condition had been corrected. In December 2020, Eddie had surgery after falling off his dirt bike and breaking his wrist.\n\nReal Estate\n\nIn early 2020, Tamra and Eddie sold their Coto de Caza California, home for $2 million. The couple had no plans to sell the home, but when Tamra's friend, realtor Shelley Black, told her that someone wanted to buy the house for $200,000 more than the $1.63 million the couple paid for it in 2018, they decided to sell it. The 4,840 square foot home sits on a lot that measures nearly 10,000 square feet, and the property includes six bedrooms, 4.5 bathrooms (which are finished in marble), a butler's pantry, a swimming pool, and a spa.\n\nIn December 2017, the Judges paid $1.58 million for a 3,900 square foot home in the Covenant Hills neighborhood of Ladera Ranch, California, and after remodeling the 5-bedroom house, they put it on the market for $1.8 million in September 2018. When Eddie and Tamra bought that home, they already owned a different home in the same neighborhood, which they listed for rent for $6,000 per month in February 2018. According to real estate records, the 3,795 square foot home last sold for $1.3 million in 2006 and was likely Eddie's home before he married Tamra.", "images": ["https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2012/01/Eddie-Judge-1.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/wp-content/uploads/2012/01/ed.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2012/01/ed.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/eddie-judge-net-worth/", "title": "Eddie Judge Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Eddie Judge is an American reality TV star and lawyer who has a net worth of $3 million. Judge became a household name when he began dating one of the main cast members of Bravo's \"The Real Housewives of Orange County,\" Tamra Barney.", "cnw_share_fb_count": 84, "cnw_share_tw_count": 54, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Eddie Judge Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/eddie-judge-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2012/01/ed.jpg", "site_name": "Celebrity Net Worth", "description": "Eddie Judge is an American reality TV star and lawyer who has a net worth of $3 million. Judge became a household name when he began dating one of the main cast members of Bravo's \"The Real Housewives of Orange County,\" Tamra Barney."}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2021-10-28T20:43:37+00:00", "published_time": "2021-01-02T01:50:21+00:00", "section": "Richest Celebrities", "tag": "Tamra barney net worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2012/01/ed.jpg", "title": "Eddie Judge Net Worth", "description": "Eddie Judge is an American reality TV star and lawyer who has a net worth of $3 million. Judge became a household name when he began dating one of the main cast members of Bravo's \"The Real Housewi..."}}, "movies": [], "publish_date": 1609552221.0, "source": "https://www.celebritynetworth.com", "summary": ""}