{"url": "http://www.sundaynews.co.zw/eye-on-fashion-celebrity-influence-on-fashion-trends/", "text": "Rutendo Chidawanyika\n\nFASHION trends are shaped and influenced by celebrities. Fashion is wearing what is considered chic or popular at a particular time. Celebrities not only influence fashion trends but create them too. It is easy for famous people to influence fashion because fashion critics and the general public spend time reviewing these outfits, then the dos and don’ts are decided upon.\n\nThen we have those we call fashion icons, those who are always on fleek when it comes to fashion and are admired by other celebrities as well.\n\nMagazines play a huge role in allowing celebrities to influence the way that everyday people dress all the time, whether they are going to work, going to the club, or going to the park to walk their dog. You will always see Riri dress alikes and Future or even Jidenna. Magazines are especially influential to teenage and pre-teen girls. There are many magazines that aim to attract this demographic, such as Seventeen Magazine, CosmoGirl, Cleo and many more. Television as well plays a really big role in the way that celebrities can influence fashion trends.\n\nThe way the characters in movies and television shows are dressed can change people’s thoughts and perceptions on fashion and fashion trends. People on tv are always dressed for success which can be misleading to ordinary people. The way people are dressed in music videos has raised the bar for the youths (whatever that bar is). A lot of young people dress like they are in hip-hop music videos.\n\nSo many shows are devoted to the subject of fashion such as Project runway and Fashion police. Some ads feature clothing or other fashion accessories, and sometimes, these ads also feature celebrities promoting certain fashion trends.\n\nSocial media is the craziest as that is where all celebrities are hanging out these days. From waist trainers to slimming teas.\n\nSocial media has made it easy for people to stalk their favourite celebrities to check what they are wearing and what they have been up to. It is good to keep up with trends but some people only dress how they dress because Minnie Dlamini or Yemi Alade is rocking the same look. The morning shoes trend is still fresh and soon everyone will trade in their normal shoes for morning shoes. Tiwa Savage and Khloe Kardashian have been seen wearing morning shoes on Instagram.\n\nOne particular celebrity that has been very influential in the world of fashion in recent years is Kanye West. Kanye is a famous rapper, writer and producer. He also has his own clothing line Yeezy. Kanye pioneered a lot of fashion trends that have been embraced by the hip-hop culture. Kanye was the first to begin wearing the brightly-coloured plastic glasses that have no lenses but instead have plastic “blinds”. Kanye is still coming up with new trends through his Yeezy clothing line, of late he has been playing around with desert colours, the nudes, coffees and olives in his latest collection.\n\nCelebrities may not realise their influence but their trendsetting power is huge among shoppers. It’s not completely clear as to why celebrities have such a massive influence on trends in fashion. Is it their daring attitude? Is it because they can pull off anything they choose to wear or they decorate themselves with anything and still get attention? Of course the attention can be negative and ridiculed but it seems many still believe that any press is good press.\n\nMom jeans started as a welcome trend as it linked mothers and housewives to celebrities who prefer higher cut, more age appropriate jeans rather than low cut jeans, more revealing pants. Once a picture is taken of a celebrity wearing a pair from an unflattering angle, the jeans get pushed back into the closet for fear of ridicule.\n\nCelebrities and average people will always have one thing in common: they want to look nice, they want to be aware of the current trends and they want their appearance to be appreciated. We all might not have the same financial access but we all strive to have the admiration that celebrities have.\n\nFeedback: [email protected]", "images": ["https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2022/10/Untitled-21-ml-200x100.jpg", "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2022/10/Dave-Houghton-handing-out-batting-tips-to-Wessly-Madhevere-ml-200x100.jpg", "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2022/10/AGRICULTURE-JOURNAL-SEPTEMBER-2022-1.jpg", "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2020/02/Chi-Mhende11-ml-200x100.jpg", "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2022/10/Untitled-22-copy-ml-200x100.jpg", "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2022/10/Untitled-18-ml-200x100.jpg", "https://www.sundaynews.co.zw/wp-content/themes/sirius/img/sirius_logo.png", "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2022/10/Andrew-Pycroft-ml-200x100.jpg", "https://www.sundaynews.co.zw/wp-content/themes/sirius/img/default_medium.jpg", "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2022/09/Sikandar-Raza-raises-his-bat-ml-200x100.jpg", "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2022/10/Untitled-17-ml-200x100.jpg", "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2022/08/stars-ml-200x100.jpg", "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2022/03/rugby-ml-200x100.jpg", "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2022/10/WhatsApp-Image-2022-10-05-at-08.17.17-ml-200x100.jpeg", "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2016/10/celebrity-fashion-2.jpg", "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2022/09/Ray-Lunga--ml-200x100.jpg", "http://sundaynews.zimpapersnetwork.co.zw/wp-content/uploads/sites/16/2018/12/sundaynews_logo_small.png"], "top_img": "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2016/10/celebrity-fashion-2.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.sundaynews.co.zw/eye-on-fashion-celebrity-influence-on-fashion-trends/", "title": "Eye on Fashion: Celebrity influence on fashion trends", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "theme-color": "#12640f", "description": "Bringing you the best", "twitter": {"card": "summary_large_image", "site": "@SundayNewsZimba"}, "og": {"title": "Eye on Fashion: Celebrity influence on fashion trends", "description": "Bringing you the best", "type": "article", "url": "https://www.sundaynews.co.zw/eye-on-fashion-celebrity-influence-on-fashion-trends/", "site_name": "The Sunday News", "image": "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2016/10/celebrity-fashion-2.jpg"}, "msapplication-TileImage": "https://www.sundaynews.co.zw/wp-content/uploads/sites/16/2018/12/cropped-sundaynews_site_icon-270x270.png"}, "movies": [], "publish_date": null, "source": "http://www.sundaynews.co.zw", "summary": ""}