{"url": "https://www.bustle.com/p/the-2018-emmy-nominations-include-so-many-gilmore-girls-stars-that-its-basically-a-reunion-9743226", "text": "On Thursday, July 12, the nominations for the 70th Emmy Awards were announced, and there's a lot of good news for the residents of Stars Hollow. The 2018 Emmy Nominations are basically a Gilmore Girls reunion, and it's the best thing ever. Rory (Alexis Bledel), Jess (Milo Ventimiglia), and series creator Amy Sherman-Palladino are all up for major Emmys this year — and all from completely different projects. Can you just imagine what Lorelai would have to say about this?\n\nAlexis Bledel received a nomination for Outstanding Supporting Actress in a Drama Series, which is an upgrade from her nomination (and win) for Outstanding Guest Actress from the year before. Both nominations, unsurprisingly, were for her role as Ofglen in Hulu's adaptation of The Handmaid's Tale. Meanwhile, Milo Ventimiglia was recognized for his work on This Is Us, NBC's smash hit and beloved tearjerker du jour. It's also the second year in a row that he's received a nomination for Outstanding Lead Actor in a Drama Series for the show.\n\nThe Emmys will take place on Monday, September 17, so fans have plenty of time to get a Gilmore Girls-themed Emmys party together. Maybe one where coffee, burgers, pancakes, pizza, and Chinese food are served, and people could go in pajama sets? That's just one idea. There are a lot of them.\n\nTBH, though, the Amy Sherman-Palladino news is the most exciting of all. Her decades in showbusiness have brought audiences some of the most beloved television shows of all time, including Gilmore Girls and the gone-too-soon Bunheads. She received her first-ever directing nomination — yes, first ever — this year, for the \"Pilot\" of The Marvelous Mrs. Maisel. Seriously, what would Amazon Prime's The Marvelous Mrs. Maisel be without Sherman-Palladino's incredible eye (and hats) behind the camera? It's worth noting that she's the only woman to receive a nomination in that category this year. She's up against fellow industry heavyweights like Bill Hader, Mike Judge, and Donald Glover, as well as recent rockstar Hiro Murai, and Jesse Peretz.\n\nFor folks that have been following Sherman-Palladino's career since the '90s, this is a historic day. Despite the many, many series she's either written for, produced, directed, created, and any combination of the above, this is her first ever nomination since 1992, when she earned a writing nod for her work on Roseanne. Here's hoping that Emmy voters are ready to recognize her talent behind the camera — though, as the saying goes, it's an honor just to be nominated.\n\nIt's a testament to Sherman-Palladino's television power to see how many of her current and former stars received nominations for 2018 Emmys. In addition to Bledel and Ventimiglia, Mrs. Maisel stars Rachel Brosnahan and Alex Borstein have been nominated as well.\n\nTwo intense dramas — The Handmaid's Tale and This Is Us — and a family-friendly, not-dystopian, no crockpot fire-having woman-led comedy, all with traces of Sherman-Palladino in them. Not bad! Now let's just rustle up a few nominations for Lauren Graham, Melissa McCarthy, Kelly Bishop, and Keiko Agena, and then it will really be a party.\n\nIn other Emmys news, Netflix officially broke HBO's multi-year streak of having the most nominations to its name, so take that, Game of Thrones. Not that Game of Thrones had a bad showing by any means; according to the Associated Press, the series itself racked up an impressive 22 nominations. Additionally, Sandra Oh's nomination for Killing Eve makes her the first ever woman of Asian heritage to be nominated for the Outstanding Lead Actress in a Drama Series role. So, the 2018 Emmys will be a big year all around. Is it September yet?", "images": ["https://imgix.bustle.com/uploads/image/2022/10/7/5d8f0698-b98b-460f-86bb-87733a815208-164650_6498_rv3.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/5/868481de-d85a-4ed6-918b-fd2d705b9aed-intern3.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/9/27/4f925157-92ef-4dc3-a1e3-23457edc4647-ross-rachel.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/6/6/970833c6-ac2d-44b1-8808-6f216efbc190-jenna-ortega_gallery-single_0287r2c.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2018/7/12/0aacc0b8-b8a4-41d6-a686-5b44f074b255-getty-624303386.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2018/7/12/0aacc0b8-b8a4-41d6-a686-5b44f074b255-getty-624303386.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/7/12/0aacc0b8-b8a4-41d6-a686-5b44f074b255-getty-624303386.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/the-2018-emmy-nominations-include-so-many-gilmore-girls-stars-that-its-basically-a-reunion-9743226", "title": "The 2018 Emmy Nominations Include So Many 'Gilmore Girls' Stars That It's Basically A Reunion", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@sophyish"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/the-2018-emmy-nominations-include-so-many-gilmore-girls-stars-that-its-basically-a-reunion-9743226", "type": "article", "title": "The 2018 Emmy Nominations Include So Many 'Gilmore Girls' Stars That It's Basically A Reunion", "description": "On Thursday, July 12, the nominations for the 70th Emmy Awards were announced, and there's a lot of good news for the residents of Stars Hollow. The 2018 Emmy Nominations are basically a Gilmore Girls reunion, and it's the best thing ever. Rory…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/7/12/0aacc0b8-b8a4-41d6-a686-5b44f074b255-getty-624303386.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "On Thursday, July 12, the nominations for the 70th Emmy Awards were announced, and there's a lot of good news for the residents of Stars Hollow. The 2018 Emmy Nominations are basically a Gilmore Girls reunion, and it's the best thing ever. Rory…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}