{"url": "http://wikinetworth.com/celebrities/brittany-kerr-wiki-age-wedding-baby-american-idol-jason-aldean.html", "text": "Happiness will only come to those who appreciate what they have. Brittany Kerr, being one of the famous names knows the game too well to lead a happy life. Raising above the cliche of a celeb with disruptive dating life, Kerr has been enjoying her romantic journey of married life all along. From her American Idol journey to happy marriage, Kerr has been in very few controversies living her real life more beautifully than the reel life.\n\nHappiness will only come to those who appreciate what they have. Brittany Kerr, being one of the famous names knows the game too well to lead a happy life. Raising above the cliche of a celeb with disruptive dating life, Kerr has been enjoying her romantic journey of married life all along. From her American Idol journey to happy marriage, Kerr has been in very few controversies living her real life more beautifully than the reel life.\n\nHer Journey in American Idol\n\nAll it took for Brittany Kerr to be an overnight sensation on American Idol was a flash of her smile and a song. She participated in the season 11 of the famous TV-reality show “American Idol” being her first time performing for an audience.\n\nNo doubt she topped the first time earning herself a golden ticket from her first performance. It was a little bumpy when Jennifer Lopez voted against sending her to Hollywood. Her journey to American Idol did not last long with much more memorable marks.\n\nModeling Career\n\nIt might not be surprising for everybody to know Brittany was a former cheerleader for the NBA’s Charlotte Bobcats from 2011 to 2012. Given her perfect physique with killer looks, she already has the photogenic charm as per her attitude. She used her charm in modeling in 2010 when she entered in Victoria’s Secret Model Search contest. She got in the top 80 and made her mark in the hearts of fans.\n\nRough Start in the Relationship\n\nIt may not be the best start for Brittany’s dating life, to begin with. She had to deal with the labels of ‘homewrecker’ making her delete her twitter account.\n\nIt was the year of 2012 when her then-boyfriend, Jason Aldean was seen flirting romantically Brittany at The Den on the Sunset Strip. Jason was already married to Jessica Aldean sharing two daughters. For one way or another, Brittany’s love started when it ended for Jessica as for many spectators.\n\nMarried with Three years Boyfriend\n\nJason Aldean might have passed the 2012’s pub flirtation as a drunken mistake only to weave another fairytale of its own.\n\nThough Brittany’s entry was fuel for Jason’s divorce with his ex-wife, the duo, Brittany and Jason turns out best for each other. They didn’t hesitate to make the relationship official with their wedding in 2015. She married her boyfriend of 3 years, Jason Aldean following a six-month-long engagement.\n\nWelcomed a Child into the Family\n\nThe happy family did not leave any room to share their happiness with all the fans waiting. They took the day of May 8, 2017, to announce their first child and pregnancy news on social media.\n\n\n\nCaption - Brittany Kerr's pregnancy news\n\nSource - Instagram\n\nJason became a dad once more with a son, Memphis on Dec 1, 2017. The couple had turned their bundles of love into a beautiful child with the name of pure country perfection. Brittany has walked a long way from the alleged girlfriend to the mother in her love journey.\n\n\n\nCaption - Brittany Kerr with her newborn baby\n\nSource - Instagram\n\nWithin seven months that the happily married couple welcomed their first child, Memphis in December, the pair announced that they were expecting their second offspring in July 2018. Brittany managed to share the photo on her Instagram with the caption 'Here we go again' and confirmed about her pregnancy in July. Back in April 2018, the couple released their statement that they had the desire to have the second kid as well which eventually came true.\n\nAfter seven months of their announcement about their expectation to welcome a new baby, Brittany reportedly gave birth to her second child, Navy Rome Williams on 4th of February 2019. Navy, born at 12:45 p.m. weighed 7 lbs., 12 oz. in weight.\n\nBrittany's newly born daughter, Navy Rome Williams (Photo: Brittany's Instagram)\n\nCurrently, Brittany lives with her husband and four kids; two from her and two from her husband's previous marriage. There are no traces of their possible divorce or separation and they are pursuing their healthy family life.\n\nHow much is Brittany’s Net Worth?\n\nBrittany has a perfect life with every kind of happiness a person asks for. In case of her net worth, she enjoys the estimated amount of $80 million from her husband, Jason Aldean.\n\nShort Bio And Wiki\n\nThe American singer was born on June 19, 1988, in North Carolina, the USA making her the age of 30 years old. Standing at the height of 5’5”, Brittany has good physique with a surprise of the first degree black belt. She belongs to white ethnicity. The aspiring daughter of father Donald Kerr and mother Debbie Kerr, she has Hunter Kerr as her sibling brother.\n\nHer wiki suggests that she attended South Mecklenburg High School in Charlotte, North Carolina. She followed her further education at the University of Alabama but transferred to the University of North Carolina. She holds the graduation degree in Human Environmental Science.", "images": ["http://wikinetworth.com/uploads/Brittany%20kerr%20pregnancy%20news.PNG", "http://wikinetworth.com/uploads/Navy-Rome-Williams.JPG", "https://wikinetworth.com/userfiles/images/wn/wiki-logo.png", "https://wikinetworth.com/userfiles/images/wn/fav-icon.png", "https://wikinetworth.com/frontend/images/socialmedia/popup.png", "http://wikinetworth.com/uploads/Brittany%20Kerr%20with%20her%20new%20born%20baby.PNG", "https://wikinetworth.com/uploads/Brittany-Kerr.jpg", "https://images.dmca.com/Badges/dmca_protected_sml_120f.png", "https://wikinetworth.com/userfiles/images/wn/wn-mobile-text-logo.png"], "top_img": "https://wikinetworth.com/uploads/Brittany-Kerr.jpg", "keywords": [], "authors": ["Wn Writer"], "canonical_link": "https://wikinetworth.com/celebrities/brittany-kerr-wiki-age-wedding-baby-american-idol-jason-aldean.html", "title": "Brittany Kerr Wiki: Age, Wedding, Baby, American Idol-All About Jason Aldean's Wife", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "twitter": {"card": "summary_large_image", "site": "wikinetworth", "creator": "@wikinetworth", "title": "Brittany Kerr Wiki: Age, Wedding, Baby, American Idol-All About Jason Aldean's Wife", "description": "Happiness will only come to those who appreciate what they have. Brittany Kerr, being one of the famous names knows the game too well to lead a happy life. Raising above the cliche of a celeb with disruptive dating lif", "image": "https://wikinetworth.com/uploads/Brittany-Kerr.jpg"}, "og": {"site_name": "wikinetworth", "type": "blog", "locale": "en_US", "title": "Brittany Kerr Wiki: Age, Wedding, Baby, American Idol-All About Jason Aldean's Wife", "url": "https://wikinetworth.com/celebrities/brittany-kerr-wiki-age-wedding-baby-american-idol-jason-aldean.html", "description": "Happiness will only come to those who appreciate what they have. Brittany Kerr, being one of the famous names knows the game too well to lead a happy life. Raising above the cliche of a celeb with disruptive dating lif", "image": {"identifier": "https://wikinetworth.com/uploads/Brittany-Kerr.jpg", "secure_url": "https://wikinetworth.com/uploads/Brittany-Kerr.jpg"}}, "google-site-verification": "wz9L4Xrb4KcYidM8zhr7TwrMnCxXjxmIPTQNLI8cgMM", "robots": "all", "description": "Happiness will only come to those who appreciate what they have. Brittany Kerr, being one of the famous names knows the game too well to lead a happy life. Raising above the cliche of a celeb with disruptive dating lif"}, "movies": [], "publish_date": null, "source": "http://wikinetworth.com", "summary": ""}