{"url": "https://web.archive.org/web/20181107012017/https://thetalko.com/even-to-this-day-20-times-kristen-stewart-and-robert-pattinson-got-extra-complicated/", "text": "Back in the day, Twilight was the most popular and beloved franchise, and Kristen Stewart and Robert Pattinson were the most popular and beloved celebrity couple. We loved seeing them together, running errands or attending their film premieres, and it seemed like their love story was only just getting started.\n\nAs we all know, that wasn't the case. Their breakup was covered just as much as their relationship. Sometimes when a star-studded couple splits up, fans are left confused and wondering what happened to make them go their separate ways. With Rob and Kristen, we knew what went wrong since it was written about and talked about so much. Of course, that didn't make the breakup any less sad, and we still wish that they could reunite.\n\nRead on to find out 20 times that Kristen Stewart and Robert Pattinson's relationship got extra complicated. There are still some fascinating things to know about this former couple, even to this day.\n\nContinue scrolling to keep reading Click the button below to start this article in quick view Share Tweet Email Copy Link Copied\n\nadvertising\n\n20 Happy Birthday (With The Reunion Everyone Was Waiting For)\n\nPinterest\n\nWhen we see a former celebrity couple together again, we automatically get really excited. That's what happened with Rob and Kristen recently.\n\nAccording to E online, they had a \"reunion\" of sorts when they both went to a birthday party. The celebration was for Lily Rose-Depp. A source says that they talked for a bit.\n\nOf course, we would love to know what they talked about (okay, more than that, we need to know). We can't help it. They were such a great couple and we still think that even today. But we'll settle for knowing that they have had some conversations in the recent past.\n\n19 Robert Avoided A Question About His And Kristen's Reunion\n\npinterest\n\nadvertising\n\nEven though Robert Pattinson and Kristen Stewart aren't a thing anymore, they have definitely been rocking their acting careers. They have each been in countless films since Twilight and it's been cool to follow along.\n\nAccording to Elite Daily, at the premiere of Rob's new movie Damsel in June 2018, a reporter asked him about being at the party mentioned above with Kristen. They asked, “How is it, hanging out? The publication mentioned how awkward that was because he acted like he didn't actually hear the question... or he didn't want to respond. Either way, that's really awkward. It's another example of a time that their relationship got extra complicated.\n\n18 Putting A Ring On It (Sort Of)\n\nAfter splitting up with Kristen, Rob fell in love with FKA Twigs. That relationship was complicated as well and was also very high-profile.\n\nThese two were engaged... but, as Popsugar reported, it wasn't quite that simple and straightforward. In the summer of 2017, he was asked if they were still going to get married, and he said \"Yeah, sort of.\"\n\nHow can you be \"sort of\" engaged to someone? Hmmm. We thought that you were either engaged or not engaged. We didn't realize that there could be such a complex thing going on. But maybe this is how celebrities are. Or maybe it's just Rob and FKA Twigs.\n\n17 A Familiar And Famous Face\n\nE! News\n\nadvertising\n\nRobert Pattinson's relationship with FKA Twigs didn't end up working out, either. Many probably don't know that Robert Pattinson and Katy Perry are friends. Even more interesting, according to Metro, they hung out a lot after he and FKA Twigs broke up, and people wondered if that meant that the two of them were an item.\n\nAs E online wrote in August 2017, \"Fast forward to this weekend when he was spotted getting cozy with good pal Katy Perry during a dinner outing Saturday night, causing lots of fans to question what's really going on.\"\n\nWe definitely wonder what was really going on, although of course, it does seem that they were simply friends.\n\n16 Another Kristen/Robert Reunion\n\nLainey Gossip\n\nJust like how we wonder if we should go back to our ex-boyfriend when our current relationship ends and we're single again, we wonder if a celeb couple will reunite when one of them breaks up with someone else.\n\nAccording to Hollywood Life, in February 2018, after Robert and FKA Twigs broke up, Robert and Kristen were seen at a bar together. (We can hear the fans freaking out now.)\n\nA source who knows FKA Twigs told Hollywood Life, “(FKA) Twigs isn’t at all concerned about what Robert is doing. She basically doesn’t even acknowledge his existence or the fact that they were to together for three years. She was really hurt when they decided to split up, and she carried that with her for a couple months before she eventually got over it.\"\n\n15 Are They Or Aren't They Dating?\n\nPinterest\n\nadvertising\n\nRobert and Kristen's relationship seems like it was complicated from the beginning. Fans wondered if they were dating and they kept saying no, it was just platonic. It's hard to believe that was true, just like it's hard for us to think that a guy and girl could film a movie (let alone a film franchise) together and get super close and not fall deeply and madly in love.\n\nIn March 2009, as E online reported about Kristen, \"She's asked by Nylon magazine about the rumors of her and Rob and denies them, saying they are simply \"good friends.\" Hmmm.\n\n14 The Complicated Summer Of 2012\n\nPinterest\n\nThings between Robert Pattinson and Kristen Stewart seemed picture perfect. As we know, they dated for a few years after meeting on the set of Twilight. Fans loved them and we all thought that this would last.\n\nEverything changed in the summer of 2012. In July 2012, Kristen was involved with director Rupert Sanders. This was a pretty big deal in terms of entertainment news and we can probably remember being surprised to read about this. Even though that was years ago now, it's hard not to look back and think, \"Yeah, that was complicated.\"\n\nadvertising\n\n13 Kristen's POV On What Happened Between Her And Rob\n\nPinterest\n\nadvertising\n\nHow did Kristen Stewart feel about her and Robert Pattinson's relationship? What's interesting is that while she didn't talk about it while they were together, she did talk about it in various interviews after they broke up.\n\nAs she told The New York Times, \"People wanted me and Rob to be together so badly that our relationship was made into a product. It wasn’t real life anymore. And that was gross to me.\"\n\nIt's fascinating to hear her point of view and we wonder if Robert felt the same way. We'll probably never know that but, hey, we can't help but wonder.\n\n12 A Heartbroken Actress\n\nPinterest\n\nIf fans were upset that Rob and Kristen's love story had come to an end, Kristen was just as upset. In the years since she has talked about what happened and how she felt about it.\n\nThe Daily Mail wrote about her August 2015 Maire Claire cover story when she said that it was a \"traumatic period\" when she and Rob broke up. She told the magazine, \"I lit my universe on fire and I watched it burn. Speaking very candidly, it was a really traumatic period in my early 20s that kick-started something in me that was a bit more feral.\"\n\nThat's definitely a dramatic (and poetic) way to put it.\n\n11 Making Mistakes\n\nThe Sun\n\nadvertising\n\nWhat did Rupert Sanders have to say about the whole situation? He actually discussed the situation quite a bit, especially in an interview with Vanity Fair.\n\nHe told Vanity Fair that he had made mistakes and said “You never know what’s coming in life. Around every corner there’s something unexpected, and that’s life. You just have to brush yourself off and continue moving forward the best you can. Everyone makes mistakes. I am bound to make more mistakes, and I wouldn’t expect my life to be exciting if I didn’t.”\n\n10 Hurt Feelings For Kristen When Rob Has Moved On\n\nPopsugar\n\nWe know that when we break up with someone and see him with his new girlfriend, it's the worst. This is still true if we've moved on ourselves and are in a new relationship. It's just so awkward to think about our ex with another girl and it's something that we would rather forget as soon as possible. That must be even worse in Hollywood when everyone is famous.\n\nRobert Pattinson has been linked to Suki Waterhouse recently. According to Hollywood Life, when it comes to what it was like for Kristen to see Robert moving on with Suki Waterhouse, a source says that Kristen found it \"uncomfortable.\"\n\n9 Kristen's Public Apology\n\nPinterest\n\nadvertising\n\nSometimes when a celebrity is in the news for something that is a big deal, they turn to their social media accounts to make a statement to their fans. Other times, they make more of a public statement. Kristen Stewart did the latter.\n\nKristen issued a public apology and, as Us Weekly reported, one of the things that she said was, \"I'm deeply sorry for the hurt and embarrassment I've caused to those close to me and everyone this has affected. This momentary indiscretion has jeopardized the most important thing in my life, the person I love and respect the most, Rob. I love him, I love him, I'm so sorry.\"\n\n8 Rupert Was Sorry, Too\n\nFashion\n\nRupert had his own apology. Us Weekly reported that he said, \"I am utterly distraught about the pain I have caused my family. My beautiful wife and heavenly children are all I have in this world. I love them with all my heart. I am praying that we can get through this together.\"\n\nThis statement proves that it was a tough situation for everyone involved, from Robert to Kristen to Rupert and his family. Of course, since this involved a lot of famous people, we can't think of it going any other way. Everyone knew what was going on and there was no way to keep it private.\n\n7 This Is Awkward (But Sweet)\n\nadvertising\n\nIt's really cool when a couple breaks up and they still say nice and polite things about one another. It's not always easy, especially when feelings have been hurt, so we really respect someone for being so kind.\n\nIn the case of Robert Pattinson and Kristen Stewart, Robert has said some really nice things about her. In June 2018, People magazine reported that he called her a \"powerhouse.\" He was talking about the talented women that he has been in films with. He said, \"Oh tons! I mean, I’ve worked with some real power houses. Definitely Mia is one of them, obviously. Kristin Scott Thomas, Uma Thurman. Kristen Stewart, Kristen too! Kristen Stewart as well, yeah. Catherine Hardwicke, too. She’s great.” (We can hear all the fans going \"Awwww.\")\n\n6 Kristen Gets Real About Being With Robert And In The Spotlight\n\nPinterest\n\nKristen Stewart told Us Weekly that she didn't like how everyone always talked about her relationship and she found this hard. She said, \"When I was dating Rob, the public were the enemy — and that is no way to live. It wasn’t this grand statement, ‘I was so confused! Now I’ve realized who I am!’ I have not been struggling.”\n\nIf we've ever dated someone who was in the same friend group as us, we know that can get complicated. We want some privacy and we don't want everyone to know every little thing about our relationship. We can only imagine how tough it is to be famous and experience that but times 100.\n\n5 It Was Love For Kristen With Rob\n\nPinterest\n\nadvertising\n\nFans feel that it was real love between Kristen and Robert, and she confirmed that.\n\nAccording to The Inquistr, Kristen said that she really did love Robert. She told Harpers Bazaar, “I’ve been deeply in love with everyone I’ve dated. Did you think I was faking it? I’ve always really embraced a duality. And really, truly, believed in it and never felt confused or struggling. I just didn’t like getting made fun of.\"\n\nThat last part makes us realize that it seems like it was hard for them to be in such a public relationship. We can see how that would be really difficult on a daily basis.\n\n4 Casting Decision: Kristen Wanted Robert To Be Edward\n\nHollywood Life\n\nWhen we think about how Kristen and Robert met, we assume that it was when they auditioned for the roles of Bella and Edward for Twilight. We can picture them hanging out and getting to know each other and realizing that they had fallen in love. Of course, they have been private about the early days of their relationship, so we don't actually know about how things got started.\n\nBut we do know that she was behind his casting in the film franchise, which is just so sweet. Zimbio reported that Kristen really wanted Robert to be Edward. We agree that he was the best choice.\n\n3 It Was His Choice To End The Relationship\n\nPinterest\n\nadvertising\n\nWe know why their relationship ended, but who was the one who decided that it was best to go their separate ways?\n\nAccording to The Mirror, Robert Pattinson was the one who called it quits with Kristen Stewart.\n\nWe always cringe when we hear about a celebrity couple breaking up since we know how much heartbreak sucks but we also know that it's worse for famous people. They have basically no privacy and everytime that they're interviewed, they're going to be asked about the split. It can't be easy at all. We haven't experienced going through a public breakup, but we've all had our hearts broken in private, and that's bad enough.\n\n2 Will They Get Back Together?\n\nPinterest\n\nWill these two get back together? It's a question that their fans have been asking. According to The Daily Mail, in April 2018, people started talking about the possibility of them dating again.\n\nWe know that we would love to see them in love again. They seemed like such a great couple. Yes, they had some hard times and they went through something very publicly, but sometimes a relationship can come back from that and be even stronger. There are certain celebrity couples that fans want to see together again (we'll always love Britney Spears with Justin Timberlake) and they are on that list for sure.\n\n1 Kristen And Robert's Love Story Might Not Be Over\n\nThe Sun\n\nadvertising\n\nAs Life and Style magazine reported, sources say that Kristen and Robert have been hanging out a lot since he broke up with FKA Twigs and people want them to start dating again.\n\nDo we think that they could get back together and that their love story isn't totally over? Maybe we think they will or maybe we're not so sure, but either way, we can agree on one thing: their love story has always been complicated. Even today, it hasn't gotten any simpler. We'll still be over here, reading everything that we can about them, and wondering what's going to happen next.\n\nSources: Eonline.com, Elitedaily.com, Popsugar.com, Metro.co.uk, Nytimes.com\n\nadvertising", "images": ["https://web.archive.org/web/20181107012018im_/https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://web.archive.org/web/20181107012018im_/https://www.thetalko.com/public/build/images/th-logo-full-white.7684e614.svg", "https://web.archive.org/web/20181107012018im_/https://www.thetalko.com/public/build/images/tq-logo-full-white.7436bde3.svg", "https://web.archive.org/web/20181107012018im_/https://www.thetalko.com/public/build/images/hc-logo-full-white.5f66cfe4.svg", "https://web.archive.org/web/20181107012018im_/https://www.thetalko.com/public/build/images/tg-logo-full-white.fc9e742a.svg", "https://web.archive.org/web/20181107012018im_/https://www.facebook.com/tr?id=1803658626514362&ev=PageView&noscript=1", "https://web.archive.org/web/20181107012018im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20181107012018im_/https://www.thetalko.com/public/build/images/bg-logo-full-white.8242bbb9.svg", "https://web.archive.org/web/20181107012018im_/https://www.thetalko.com/public/build/images/sr-logo-full-white.b0cc2b44.svg", "https://web.archive.org/web/20181107012018im_/https://www.thetalko.com/public/build/images/tv-logo-full-white.642d3d01.svg", "https://web.archive.org/web/20181107012018im_/https://www.thetalko.com/public/build/images/tt-logo-full-white.04a6f0d4.svg", "https://web.archive.org/web/20181107012018im_/https://www.thetalko.com/public/build/images/mm-logo-full-white.fe72c74c.svg", "https://web.archive.org/web/20181107012018im_/https://static2.thetalkoimages.com/wordpress/wp-content/uploads/2018/10/3-copy-4.jpg", "https://web.archive.org/web/20181107012018im_/https://www.thetalko.com/public/build/images/tr-logo-full-white.090c581a.svg", "https://web.archive.org/web/20181107012018im_/https://www.thetalko.com/public/build/images/ts-logo-full-white.54beb4cf.svg", "https://web.archive.org/web/20181107012018im_/https://www.thetalko.com/public/build/images/cb-logo-full-white.afca2e29.svg"], "top_img": "https://web.archive.org/web/20181107012018im_/https://static2.thetalkoimages.com/wordpress/wp-content/uploads/2018/10/3-copy-4.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20181107012018/https://www.thetalko.com/even-to-this-day-20-times-kristen-stewart-and-robert-pattinson-got-extra-complicated/", "title": "Even To This Day: 20 Times Kristen Stewart And Robert Pattinson Got Extra Complicated", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "We loved seeing them together, and their breakup got just as much publicity as their relationship.", "og": {"title": "Even To This Day: 20 Times Kristen Stewart And Robert Pattinson Got Extra Complicated", "type": "article", "image": {"identifier": "https://web.archive.org/web/20181107012018im_/https://static2.thetalkoimages.com/wordpress/wp-content/uploads/2018/10/3-copy-4.jpg", "width": 1728, "height": 910}, "url": "https://web.archive.org/web/20181107012018/https://www.thetalko.com/even-to-this-day-20-times-kristen-stewart-and-robert-pattinson-got-extra-complicated/", "locale": "en_US", "description": "We loved seeing them together, and their breakup got just as much publicity as their relationship.", "site_name": "TheTalko"}, "article": {"published_time": "2018-10-18T19:10:19Z", "section": "Entertainment"}, "fb": {"app_id": 1470061169975403}}, "movies": [], "publish_date": 1539889819.0, "source": "https://web.archive.org", "summary": ""}