{"url": "https://www.billboard.com/articles/columns/pop/8070261/taylor-swift-2017-timeline", "text": "Taylor Swift didn’t do a lot in 2017… until she did. Following months spent attempting to fly under the radar, and the Instagram blackout of Aug. 2017, Swift took the rest of the year by storm, with a not-so-traditional album rollout for Reputation and a series of larger than life visuals to accompany the first singles.\n\nExplore Explore Taylor Swift See latest videos, charts and news See latest videos, charts and news\n\nFans got a sneak preview at what was to come from her personally curated Secret Sessions, but those were hidden away from the lens of the media. Now that Reputation is here to stay, Billboard has taken a look back at Swift’s action packed year.\n\nRelated 5 momentos inspiradores de la semana en la música latina\n\nJan. 27 – “I Don’t Want to Live Forever” music video release\n\nSwift kicked off the New Year with the release of the visuals to Fifty Shades Darker track “I Don’t Wanna Live Forever.” Swift and former 1D artist Zayn trashed a hotel room for the video, lit by flashing shades of blue and red. The song peaked at No. 2 on the Billboard Hot 100.\n\nFeb. 4 2017 – Taylor Swift plays “only show of 2017”\n\nSwift broke some disappointing news to fans during her pre-Super Bowl set for DIRECTV Now Super Saturday Night. “I have to be really honest with you about something: As far as I know, I’m doing one show in 2017. And as far as I know, this is that one show,” Swift said long before the announcement of Reputation. She added, “You’re the crowd in my most recent daydreams, when I’m thinking about being onstage, so I was wondering: If you don’t feel like dancing for yourself or screaming for yourself, you don’t feel in the mood or whatever, you’re like stressed out, would you do it for me tonight?”\n\nFeb. 15-16 – TAS Rights Management, LLC filed nine separate trademarks for “Swifties”\n\nSwift’s brand nailed down the things most true to her: Swifties. Nine separate trademarks were filed for the word alone, including one involving “a website featuring non-downloadable audio recordings [and] video recordings.” The idea that Swift would launch her own streaming service was debunked.\n\nMar. 2 – Ed Sheeran teases Swift’s upcoming album\n\nThe singer revealed that his pal would be putting her music out quite late on in the year, saying, “Taylor [Swift] isn’t going to be releasing until probably the end of this year—Christmas is the smartest time to release because that’s when everyone buys records.” Looks like he was right.\n\nMar. 10 – Man arrested for stalking/burglary inside Swift’s apartment building\n\nA man was arrested in Swift’s New York City building on charges of burglary, stalking, and trespassing. According to a Page Six report, the man allegedly hoped to meet the singer face-to-face. While the man was initially held on $20,000 bail, he was found unfit to stand trial and reportedly “placed in the custody of the New York State Office of Mental Health” as of late September.\n\nApril 4 – “Busy working” on new album in Nashville\n\nAfter the singer had been spotted driving around Nashville, a source confirmed to ET that she’d come “to get away from the paparazzi,” and also that she had “been busy working on her upcoming album.”\n\nMay 15 – She’s really in Nashville! Swift celebrates Mother’s Day at home with her mom\n\nTMZ did the heavy digging and proved that Swift really had been in Nashville – though she may have been hopping back and forth, as she was spotted getting onto her private jet after a spending the weekend with mama Swift for Mother’s Day.\n\nJuly 4 – Keeping it low-key for the first time in years on the Fourth of July\n\nPaparazzi were very upset that Swift didn’t have an Independence day blowout tailor-made for media, even though she’d been keeping a relatively low profile all year.\n\nAug. 14 – $1 Countersuit Win\n\nThe long-drawn-out legal battle between DJ David Mueller, who was accused of reaching under the pop star’s skirt to grope her during a photo shoot in 2013, was finally put to rest. After Mueller attempted to countersue for damages that occurred following Swift’s accusation (which was quietly made to the station, who promptly let him go), the singer was awarded a single symbolic dollar in damages. Swift’s attorney Douglas Baldridge explained the value, “It means no means no, and it tells every woman that they will determine what is tolerated with their body.”\n\nAug. 18-20 – Bye bye, old Taylor… and old posts\n\nIn the internet-breaking fashion Swift seems to have perfected, the singer’s social media accounts went into full blackout mode. No old posts were to be found anywhere, signaling that she was gearing up to launch something huge.\n\nAug. 21 – She’s back, but only with some snakes\n\nIn one of the best social media moments of the year, Swift posted a three-part series of glitch-y snake videos without captions to her Instagram to break her short-lived blackout. The image of the snake had become synonymous with Swift’s internet-meme identity, following the drawn-out beef with Kim Kardashian and Kanye West regarding West’s “Famous” lyrics and video.\n\nA post shared by Taylor Swift (@taylorswift) on Aug 23, 2017 at 7:01am PDT\n\nAug. 23 – It’s an album!\n\nAfter five days (AKA an eternity in Swiftie time), Swift revealed the project behind the social media madness. Continuing in the three-part posting style, Swift announced “FIRST SINGLE OUT TOMORROW NIGHT,” posted the cover art, and announced the release date for then-upcoming album Reputation. All posts were still caption-less.\n\nAug. 24 – Look what you made her do.\n\nSwift released Reputation’s lead single “Look What You Made Me Do” with a clever caption on Instagram: “..ready for it? New single #LookWhatYouMadeMeDo out now.” Of course, the forthcoming track title remained an inside joke to the singer’s team upon posting time.\n\nAug. 27 – Look what you made her do, part two.\n\nThe singer premiered the visuals for “LWYMMD” at the 2017 MTV VMAs, snagging 43.2 million views in the first 24 hours alone, now standing with over 783 million views. The Joseph Kahn-directed visual is loaded with references to the “old Taylor,” including a tombstone for Nils Sjoberg, her songwriting pseudonym on ex-boyfriend Calvin Harris’ 2016 hit “This Is What You Came For,” nearly all of her most iconic outfits, more snakes, and nearly all her besties’ names scribbled on a new version of her “You Belong With Me” music video costume.\n\nSept. 3 – “…Ready for It?” released\n\nSwift released the second track off Reputation after she previewed it on Saturday Night Football the night prior. It followed suit with the darker, much more dramatic new Taylor, yet gave no clearer picture of what was yet to come.\n\nSept. 5 – No. 1, again\n\nTaylor Swift’s “Look What You Made Me Do” tops the Billboard Hot 100, where it would reign for three weeks. The song was her fifth Hot 100 No. 1 and broke the weekly streaming record for a song by a woman; it also stopped the record-tying 16-week reign of “Despacito.”\n\nSept. 7 – TayTay On Demand\n\nEver wanted to know what Swift is up to at any given moment? Well this isn’t exactly that, but the trailer jokes that it will be. Swift announced her new video-on-demand channel in partnership with AT&T and DirectTV called Taylor Swift NOW, accompanied by a hilarious play-by-play of Swift’s day in the studio (complete with Andy Samberg cameo).\n\nOct. 11 – The Swift Life app announced\n\nStans will finally have a one-stop-shop for finding out everything there is to know about their fave singer. It is said to function as a social network of sorts, leaning into Swift’s hobby of “lurking” and replying to fans on social media, and also offering an opportunity to “collect Taymojis, stickers, pics, and more.”\n\nOct. 20 – “Gorgeous” released\n\nThe predictable yet addicting pop track the world was waiting for finally arrived. Swift sang of a romantic interest that was somehow too gorgeous for even a superstar like her to talk to. James Reynolds, two-year-old daughter of Ryan Reynolds and Blake Lively, was later officially credited in album liner notes as the voice at the beginning of the track.\n\nOct. 27 – “…Ready for it?” returns with visuals\n\nThe fans surely weren’t ready for it, yet with the Joseph Kahn directed video packed with hidden messages, it wasn’t long before Swifties decoded them all. Among the most obvious are Swift’s birth year spray-painted on a wall, the Chinese characters for “Year of the Snake,” as well as a similar lightning strike in the intro to Calvin Harris’ “This is What You Came For” album art.\n\nNov. 2 – “Call It What You Want” lyric video released\n\nFans started to get a fuller picture of what was coming from Reputation in just over a week. Swift seemed to be finding her way to happiness in the first ballad to be released from the album, but she was still attempting to rid herself of the drama she’d endured. The day was special for more than one reason, coinciding with the 13th anniversary (Swift’s lucky number) of meeting Scott Borchetta, the Big Machine Records executive who signed her and gave her the fateful big break.\n\nNov. 7 – Track list revealed on Swift’s Instagram Account\n\nThree days prior to the Reputation release date, Swift posted the back cover to the album, featuring the track listing.\n\n3 days until #reputation A post shared by Taylor Swift (@taylorswift) on Nov 7, 2017 at 6:52pm PST\n\nNov. 8 – CMA Win\n\nEven though she’s left country in the dust on her own albums, Swift’s song for Little Big Town, “Better Man,” nabbed song of the year at the 2017 CMAs.\n\nNov. 9 – The album was leaked, and this is why we can’t have nice things\n\nIn this day and age, so many albums leak prior to release date, but not quite in this fashion: missing from the leaked files was track no. 13, “This Is Why We Can’t Have Nice Things.” Whether it was at the hands of Swift’s team, Swift herself, or a sneaky fan, it was quite the clever move.\n\nOn the same day, an intimate recording “New Years Day” from what looks like a secret session was premiered on ABC during an episode of Scandal.\n\nNov. 10 – Reputation is out everywhere, except for streaming services\n\nReputation hit shelves and online retailers; a Target exclusive version included a magazine with poems and photos from Swift. She announced 20 days later that Reputation would be available to stream at midnight on Dec. 1.\n\nNov. 11 – SNL\n\nSwift plays Saturday Night Live, busting out “…Ready for It?” and an acoustic “Call It What You Want.”\n\nNov. 13 – Tonight Show\n\nFollowing the death of Jimmy Fallon’s mother, Taylor Swift agreed to appear on The Tonight Show to play a moving version of “New Year’s Day.”\n\nNov. 20 – Reputation Is No. 1\n\nSwift’s Reputation becomes her fifth No. 1 album on the Billboard 200. Reputation notched 2017’s biggest week for an album, as the set earned 1.238 million equivalent album units in the week ending Nov. 16, according to Nielsen Music. Of that sum, 1.216 million were in traditional album sales — the largest sales frame for an album since 2015. It would hold the No. 1 spot for three weeks.\n\nNov. 28 – Grammy Time\n\nThe Taylor Swift-penned “Better Man” from Little Big Town is nominated for best country song — which is a songwriter(s) award, so Swift will get a trophy if it wins. She’s also nominated for best song written for visual media for her Zayn collab “I Don’t Want to Live Forever.”\n\nDec. 1 – Taylors In the Stream\n\nReputation appears on the major streaming services.\n\nDec. 4 2017 – Reputation, but make it fashion (UK Vogue cover)\n\nVogue UK revealed its first cover of the new year would feature Swift. Newly appointed Editor in Chief Edward Enninful styled the singer during his second cover after taking the reigns from Alexandra Shulman. Mert Alas and Marcus Piggott, also photographers for all Reputation visuals, shot the twelve-page spread. Two days later, the high fashion mag revealed a poem Swift wrote exclusively to run with the feature, titled, “The Trick to Holding On.”\n\nDec. 6 2017 – Swift is one of Time’s “Silence Breakers”\n\nHer summer court case was not meant to be a media spectacle, but it was meant to prove a point with the symbolic $1 request. As Time gave the platform to “The Silence Breakers,” women who helped bring sexual assault and harassment to the forefront of the national conversation, as its 2017 Person of the Year, Swift was among the individuals highlighted. The Time interview is the first time Swift has done press about the court case, and in it she detailed reaching out to Kesha for support, as well as her feelings as she sat in the courtroom. “I was angry. In that moment, I decided to forego any courtroom formalities and just answer the questions the way it happened,” Swift said. “This man hadn’t considered any formalities when he assaulted me, and his lawyer didn’t hold back on my mom — why should I be polite? I’m told it was the most amount of times the word ‘ass’ has ever been said in Colorado Federal Court.”\n\n#TimePOY A post shared by Taylor Swift (@taylorswift) on Dec 6, 2017 at 6:21am PST\n\nDec. 8 2017 – Swift Plays iHeartRadio’s Z100 Jingle Ball in NYC\n\nThe pre-Super Bowl performance wasn’t her only concert of 2017, after all. Camila Cabello and Lindsay Lohan were Swift’s biggest fans at the show, posting videos dancing the night away to various social media platforms.\n\nDec. 11 – Reputation Continues to Be Big\n\nSwift earned her 55th Hot 100 hit with Reputation album track “End Game,” featuring rapping from Future, Ed Sheeran and herself.\n\nDec. 13 – B’Day & Tix\n\nWhile some fans were able to buy tickets in advance, the general public tickets for Swift’s Reputation Tour went on sale Dec. 13, 2017 — not coincidentally her 28th birthday. She released a tour trailer to celebrate.\n\nDec. 14 – Still Getting ‘Ready’\n\nSwift dropped a lyric video for BloodPop’s bouncy remix of “…Ready for It?”", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/uploads/media/taylor-swift-2017-piano-billboard-1548.jpg?w=1024", "https://www.billboard.com/wp-content/uploads/media/taylor-swift-2017-piano-billboard-1548.jpg?w=942&h=623&crop=1", "https://www.billboard.com/wp-content/uploads/media/bb-ye2017-recirc.jpg", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif"], "top_img": "https://www.billboard.com/wp-content/uploads/media/taylor-swift-2017-piano-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Allison Stubblebine"], "canonical_link": "https://www.billboard.com/music/pop/taylor-swift-2017-timeline-8070261/", "title": "Taylor Swift’s 2017: The Timeline", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "Taylor Swift took over the latter half of 2017 with her sixth studio album 'Reputation.'", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 8070261, "author": "Allison Stubblebine", "pmc-category": "Music,Pop", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-12-18T17:18:24"}, "title": "Taylor Swift’s 2017: The Timeline", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Allison Stubblebine", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 8070261, "title": "Taylor Swift's 2017: The Timeline", "published_at": "2017-12-18 17:18:24", "image": "https://www.billboard.com/wp-content/uploads/media/taylor-swift-2017-piano-billboard-1548.jpg?w=1024", "comment_count": 0, "topics": "Pop", "body": "Taylor Swift didn't do a lot in 2017... until she did. Following months spent attempting to fly under the radar, and the Instagram blackout of Aug. 2017, Swift took the rest of the year by storm, with a not-so-traditional album rollout for Reputation and a series of larger than life visuals to accompany the first singles. Fans got a sneak preview at what was to come from her personally curated Secret Sessions, but those were hidden away from the lens of the media. Now that Reputation is here to stay, Billboard has taken a look back at Swift's action packed year. Jan. 27 - “I Don’t Want to Live Forever” music video releaseSwift kicked off the New Year with the release of the visuals to Fifty Shades Darker track “I Don’t Wanna Live Forever.” Swift and former 1D artist Zayn trashed a hotel room for the video, lit by flashing shades of blue and red. The song peaked at No. 2 on the Billboard Hot 100.Feb. 4 2017 - Taylor Swift plays “only show of 2017”Swift broke some disappointing news to fans during her pre-Super Bowl set for DIRECTV Now Super Saturday Night. \"I have to be really honest with you about something: As far as I know, I'm doing one show in 2017. And as far as I know, this is that one show,\" Swift said long before the announcement of Reputation. She added, “You're the crowd in my most recent daydreams, when I'm thinking about being onstage, so I was wondering: If you don't feel like dancing for yourself or screaming for yourself, you don't feel in the mood or whatever, you're like stressed out, would you do it for me tonight?\"Feb. 15-16 - TAS Rights Management, LLC filed nine separate trademarks for “Swifties”Swift’s brand nailed down the things most true to her: Swifties. Nine separate trademarks were filed for the word alone, including one involving “a website featuring non-downloadable audio recordings [and] video recordings.” The idea that Swift would launch her own streaming service was debunked.Mar. 2 - Ed Sheeran teases Swift’s upcoming albumThe singer revealed that his pal would be putting her music out quite late on in the year, saying, “Taylor [Swift] isn’t going to be releasing until probably the end of this year—Christmas is the smartest time to release because that’s when everyone buys records.” Looks like he was right.Mar. 10 - Man arrested for stalking/burglary inside Swift’s apartment buildingA man was arrested in Swift’s New York City building on charges of burglary, stalking, and trespassing. According to a Page Six report, the man allegedly hoped to meet the singer face-to-face. While the man was initially held on $20,000 bail, he was found unfit to stand trial and reportedly “placed in the custody of the New York State Office of Mental Health” as of late September.April 4 - “Busy working” on new album in NashvilleAfter the singer had been spotted driving around Nashville, a source confirmed to ET that she’d come “to get away from the paparazzi,” and also that she had “been busy working on her upcoming album.”May 15 - She’s really in Nashville! Swift celebrates Mother’s Day at home with her mom TMZ did the heavy digging and proved that Swift really had been in Nashville - though she may have been hopping back and forth, as she was spotted getting onto her private jet after a spending the weekend with mama Swift for Mother’s Day.July 4 - Keeping it low-key for the first time in years on the Fourth of JulyPaparazzi were very upset that Swift didn’t have an Independence day blowout tailor-made for media, even though she'd been keeping a relatively low profile all year.Aug. 14 - $1 Countersuit WinThe long-drawn-out legal battle between DJ David Mueller, who was accused of reaching under the pop star’s skirt to grope her during a photo shoot in 2013, was finally put to rest. After Mueller attempted to countersue for damages that occurred following Swift’s accusation (which was quietly made to the station, who promptly let him go), the singer was awarded a single symbolic dollar in damages. Swift’s attorney Douglas Baldridge explained the value, “It means no means no, and it tells every woman that they will determine what is tolerated with their body.\"Aug. 18-20 - Bye bye, old Taylor… and old postsIn the internet-breaking fashion Swift seems to have perfected, the singer’s social media accounts went into full blackout mode. No old posts were to be found anywhere, signaling that she was gearing up to launch something huge.Aug. 21 - She’s back, but only with some snakesIn one of the best social media moments of the year, Swift posted a three-part series of glitch-y snake videos without captions to her Instagram to break her short-lived blackout. The image of the snake had become synonymous with Swift’s internet-meme identity, following the drawn-out beef with Kim Kardashian and Kanye West regarding West’s “Famous” lyrics and video. A post shared by Taylor Swift (@taylorswift) on Aug 23, 2017 at 7:01am PDTAug. 23 - It’s an album!After five days (AKA an eternity in Swiftie time), Swift revealed the project behind the social media madness. Continuing in the three-part posting style, Swift announced “FIRST SINGLE OUT TOMORROW NIGHT,” posted the cover art, and announced the release date for then-upcoming album Reputation. All posts were still caption-less.Aug. 24 - Look what you made her do. Swift released Reputation’s lead single “Look What You Made Me Do” with a clever caption on Instagram: “..ready for it? New single #LookWhatYouMadeMeDo out now.” Of course, the forthcoming track title remained an inside joke to the singer’s team upon posting time.Aug. 27 - Look what you made her do, part two. The singer premiered the visuals for “LWYMMD” at the 2017 MTV VMAs, snagging 43.2 million views in the first 24 hours alone, now standing with over 783 million views. The Joseph Kahn-directed visual is loaded with references to the “old Taylor,” including a tombstone for Nils Sjoberg, her songwriting pseudonym on ex-boyfriend Calvin Harris’ 2016 hit “This Is What You Came For,” nearly all of her most iconic outfits, more snakes, and nearly all her besties’ names scribbled on a new version of her “You Belong With Me” music video costume.Sept. 3 - “…Ready for It?” releasedSwift released the second track off Reputation after she previewed it on Saturday Night Football the night prior. It followed suit with the darker, much more dramatic new Taylor, yet gave no clearer picture of what was yet to come.Sept. 5 - No. 1, againTaylor Swift's \"Look What You Made Me Do\" tops the Billboard Hot 100, where it would reign for three weeks. The song was her fifth Hot 100 No. 1 and broke the weekly streaming record for a song by a woman; it also stopped the record-tying 16-week reign of \"Despacito.\"Sept. 7 - TayTay On DemandEver wanted to know what Swift is up to at any given moment? Well this isn’t exactly that, but the trailer jokes that it will be. Swift announced her new video-on-demand channel in partnership with AT&T and DirectTV called Taylor Swift NOW, accompanied by a hilarious play-by-play of Swift’s day in the studio (complete with Andy Samberg cameo).Oct. 11 - The Swift Life app announcedStans will finally have a one-stop-shop for finding out everything there is to know about their fave singer. It is said to function as a social network of sorts, leaning into Swift’s hobby of “lurking” and replying to fans on social media, and also offering an opportunity to “collect Taymojis, stickers, pics, and more.”Oct. 20 - “Gorgeous” releasedThe predictable yet addicting pop track the world was waiting for finally arrived. Swift sang of a romantic interest that was somehow too gorgeous for even a superstar like her to talk to. James Reynolds, two-year-old daughter of Ryan Reynolds and Blake Lively, was later officially credited in album liner notes as the voice at the beginning of the track.Oct. 27 - “…Ready for it?” returns with visualsThe fans surely weren’t ready for it, yet with the Joseph Kahn directed video packed with hidden messages, it wasn’t long before Swifties decoded them all. Among the most obvious are Swift’s birth year spray-painted on a wall, the Chinese characters for “Year of the Snake,” as well as a similar lightning strike in the intro to Calvin Harris’ “This is What You Came For” album art.Nov. 2 - “Call It What You Want” lyric video releasedFans started to get a fuller picture of what was coming from Reputation in just over a week. Swift seemed to be finding her way to happiness in the first ballad to be released from the album, but she was still attempting to rid herself of the drama she’d endured. The day was special for more than one reason, coinciding with the 13th anniversary (Swift’s lucky number) of meeting Scott Borchetta, the Big Machine Records executive who signed her and gave her the fateful big break.Nov. 7 - Track list revealed on Swift’s Instagram AccountThree days prior to the Reputation release date, Swift posted the back cover to the album, featuring the track listing. 3 days until #reputationA post shared by Taylor Swift (@taylorswift) on Nov 7, 2017 at 6:52pm PST Nov. 8 - CMA WinEven though she's left country in the dust on her own albums, Swift's song for Little Big Town, \"Better Man,\" nabbed song of the year at the 2017 CMAs.Nov. 9 - The album was leaked, and this is why we can’t have nice thingsIn this day and age, so many albums leak prior to release date, but not quite in this fashion: missing from the leaked files was track no. 13, “This Is Why We Can’t Have Nice Things.” Whether it was at the hands of Swift’s team, Swift herself, or a sneaky fan, it was quite the clever move.On the same day, an intimate recording “New Years Day” from what looks like a secret session was premiered on ABC during an episode of Scandal.Nov. 10 - Reputation is out everywhere, except for streaming servicesReputation hit shelves and online retailers; a Target exclusive version included a magazine with poems and photos from Swift. She announced 20 days later that Reputation would be available to stream at midnight on Dec. 1.Nov. 11 - SNLSwift plays Saturday Night Live, busting out \"...Ready for It?\" and an acoustic \"Call It What You Want.\"Nov. 13 - Tonight ShowFollowing the death of Jimmy Fallon's mother, Taylor Swift agreed to appear on The Tonight Show to play a moving version of \"New Year's Day.\"Nov. 20 - Reputation Is No. 1Swift's Reputation becomes her fifth No. 1 album on the Billboard 200. Reputation notched 2017’s biggest week for an album, as the set earned 1.238 million equivalent album units in the week ending Nov. 16, according to Nielsen Music. Of that sum, 1.216 million were in traditional album sales -- the largest sales frame for an album since 2015. It would hold the No. 1 spot for three weeks.Nov. 28 - Grammy TimeThe Taylor Swift-penned \"Better Man\" from Little Big Town is nominated for best country song -- which is a songwriter(s) award, so Swift will get a trophy if it wins. She's also nominated for best song written for visual media for her Zayn collab \"I Don't Want to Live Forever.\"Dec. 1 - Taylors In the StreamReputation appears on the major streaming services.Dec. 4 2017 - Reputation, but make it fashion (UK Vogue cover)Vogue UK revealed its first cover of the new year would feature Swift. Newly appointed Editor in Chief Edward Enninful styled the singer during his second cover after taking the reigns from Alexandra Shulman. Mert Alas and Marcus Piggott, also photographers for all Reputation visuals, shot the twelve-page spread. Two days later, the high fashion mag revealed a poem Swift wrote exclusively to run with the feature, titled, \"The Trick to Holding On.\" Thank you @edward_enninful and @mertalas for your passion, spirit, and contagious laughter on set. Mert and Marcus took these photos for @britishvogue and my album photos for reputation, and it’s been such a bonding experience working together so closely and talking so much about what we wanted to make. It’s been a while since I’ve done a magazine cover. I’m really happy my first one back was with such wonderful people. #newvogueA post shared by Taylor Swift (@taylorswift) on Dec 4, 2017 at 9:08am PSTDec. 6 2017 - Swift is one of Time’s “Silence Breakers”Her summer court case was not meant to be a media spectacle, but it was meant to prove a point with the symbolic $1 request. As Time gave the platform to “The Silence Breakers,” women who helped bring sexual assault and harassment to the forefront of the national conversation, as its 2017 Person of the Year, Swift was among the individuals highlighted. The Time interview is the first time Swift has done press about the court case, and in it she detailed reaching out to Kesha for support, as well as her feelings as she sat in the courtroom. \"I was angry. In that moment, I decided to forego any courtroom formalities and just answer the questions the way it happened,” Swift said. “This man hadn’t considered any formalities when he assaulted me, and his lawyer didn’t hold back on my mom -- why should I be polite? I’m told it was the most amount of times the word 'ass' has ever been said in Colorado Federal Court.\" #TimePOYA post shared by Taylor Swift (@taylorswift) on Dec 6, 2017 at 6:21am PSTDec. 8 2017 - Swift Plays iHeartRadio’s Z100 Jingle Ball in NYCThe pre-Super Bowl performance wasn’t her only concert of 2017, after all. Camila Cabello and Lindsay Lohan were Swift’s biggest fans at the show, posting videos dancing the night away to various social media platforms. Dec. 11 - Reputation Continues to Be BigSwift earned her 55th Hot 100 hit with Reputation album track \"End Game,\" featuring rapping from Future, Ed Sheeran and herself. Dec. 13 - B'Day & TixWhile some fans were able to buy tickets in advance, the general public tickets for Swift's Reputation Tour went on sale Dec. 13, 2017 -- not coincidentally her 28th birthday. She released a tour trailer to celebrate. Dec. 14 - Still Getting 'Ready'Swift dropped a lyric video for BloodPop's bouncy remix of \"...Ready for It?\"", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "Taylor Swift’s 2017: The Timeline", "url": "https://www.billboard.com/music/pop/taylor-swift-2017-timeline-8070261/", "description": "Taylor Swift took over the latter half of 2017 with her sixth studio album ‘Reputation.’", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/taylor-swift-2017-piano-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Taylor Swift"}, "locale": "en_US"}, "article": {"published_time": "2017-12-18T22:18:24+00:00", "modified_time": "2017-12-19T15:32:52+00:00"}, "twitter": {"site": "@billboard", "creator": "@MsAllyMackenzie", "card": "summary_large_image", "title": "Taylor Swift’s 2017: The Timeline", "description": "Taylor Swift took over the latter half of 2017 with her sixth studio album 'Reputation.'", "image": "https://www.billboard.com/wp-content/uploads/media/taylor-swift-2017-piano-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1513635504.0, "source": "https://www.billboard.com", "summary": ""}