{"url": "https://www.cosmopolitan.com/style-beauty/beauty/how-to/a52634/flat-iron-hacks/", "text": "I get it: Sometimes you want loose, undone waves, but whipping out your curling iron just feels a little extra (see also: time-consuming, hard, annoying...). But what if I told you you could create the perfect beach waves with a flat iron? Not only is it way easier than curling your hair, IMO, but it’s also a genius way to get just-rolled-out-of-bed waves à la Emily Ratajkowski or Lucy Hale without having to attend beauty school or watch, IDK, 30 hours of YouTube to master. Ahead, I gathered seven game-changing hacks that’ll immediately turn you into a hair-straightener convert.\n\nThis content is imported from {embed-name}. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nFlat-Iron Beach Waves Hack #1: Add Texture\n\nGot fine hair that doesn’t hold a curl, or silky-soft texture with zero grip? Whether you’re working with freshly washed hair or you’re going on day three, prep for flat-iron beach waves with a healthy spray of dry shampoo. And as with any heat styling, you’ll want to follow with a few spritzes of heat protectant to keep your hair nice and healthy. These top-rated formulas are a great place to start:\n\nFlat-Iron Beach Waves Hack #2: Create \"S\" Waves\n\n\n\nKathleen Kamphausen/Lauren Ahn\n\nIf you’re after soft, lived-in waves (basically, the opposite of bouncy, Victoria’s Secret-esque curls), you’ll love this flat-iron technique. Start by picking up a section of your hair and dropping it (yup, drop it—bear with me) into the mouth of the flat iron to create your first bend. Then, with that same section, clamp your flat iron in the shape of an “S” to finish off the piece. You’ll repeat this motion throughout your hair, focusing on your ends for a natural-looking finish.\n\nNot sure your hair-straightener is up to the task? Check out one of my personal faves, below:\n\nFlat-Iron Beach Waves Hack #3: Twirl and Pull\n\nNomi Ellenson | Lauren Ahn\n\nNomi Ellenson | Lauren Ahn\n\nFor beachy waves that are slightly more defined, try the twirl-and-pull method. Holding your flat iron at an angle, insert an inch-wide section of hair between the clamps and turn the iron away from your face to create your first bend. Then, gently slide the iron a little way down the section of hair before twirling the iron away from your face again. You’ll repeat this method until you reach your ends—leave them relatively straight for an unfinished (yet cool) look. Once your entire head is done, run your fingers through the loose curls to make them more wave-like.\n\nFlat-Iron Beach Waves Hack #4: Twist Away from Your Face\n\nKathleen Kamphausen/Lauren Ahn\n\nThis technique is especially great for longer hair, since you can actually get a fairly bouncy wave out of it. Using a , feed a 1-inch section of hair (starting close to the nape of your neck, eventually working up toward your hairline) between the clamps. From there, in one fluid motion—or else you’ll end up with crimps—twist your wrist away from your face so the hair flows over (not under) the iron. Make sure the hair continues to wrap around the flat iron’s shell as you pass through your ends. Pro tip: The smaller the section, the curlier your hair will be.\n\nFlat-Iron Beach Waves Hack #5: Bend Your Wrist\n\nNomi Ellenson | Lauren Ahn\n\nNot super down for a time-consuming technique? This quick hack of simply bending your wrist back and forth will give you subtle beach waves. You’ll want to hold your hair out horizontally from your head and turn your wrist away as you pass through the section, then bend your wrist back toward your hair for some soft texture.\n\nFlat-Iron Beach Waves Hack #6: Start with a Braid\n\nKathleen Kamphausen\n\nAn equally low-effort technique, this hack begins with a super-simple braid. After spritzing your braid with a , gently run the flat iron over it a few times. When you undo your braid, you’ll be left with perfectly crimped beach waves.\n\n\n\nFlat-Iron Beach Waves Hack #7: Protect Your Waves with Pin Curls\n\nNomi Ellenson | Lauren Ahn\n\nIf you’re going to take the time to create flat-iron waves, you may as well make sure they last overnight (nobody wants to restyle their hair in the morning, am I right?). Before bed, roll 1-inch sections of your waves into loose pin curls, securing with a few bobby pins. When you wake up, gently remove the and let your waves down.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/beach-waves-1591716232.png?crop=1.00xw:0.335xh;0,0.321xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flat-iron-waves-1569855879.jpg?crop=1.00xw:0.803xh;0,0.120xh&resize=480:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flat-iron-waves-1-1569856074.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flat-iron-waves-1-1569856074.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Carly Cardellino", "Ruwas The Beauty Editor At Cosmopolitan", "Where She Covered Beauty Across Print", "Carly Cardellino Was The Beauty Director At Cosmopolitan."], "canonical_link": "https://www.cosmopolitan.com/style-beauty/beauty/how-to/a52634/flat-iron-hacks/", "title": "How to Get Beach Waves with a Flat Iron 2022", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "7 Hacks That Make Flat-Iron Waves *So* Much Easier", "description": "The key to IDGAF texture, right this way.", "url": "https://www.cosmopolitan.com/style-beauty/beauty/how-to/a52634/flat-iron-hacks/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flat-iron-waves-1-1569856074.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2022-02-11T10:37:57Z", "published_time": "2019-09-30T15:10:00Z", "section": "Beauty", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flat-iron-waves-1-1569856074.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "How to Get Beach Waves with a Flat Iron 2022 - Flat Iron Waves Tutorial", "description": "The secret to loose, beachy waves lies in your flat iron. Ahead, seven tips that make flat-iron beach waves totally doable (plus, everything you'll need).", "keywords": "DIY, Hair", "auto-publish": "evergreen", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flat-iron-waves-1-1569856074.jpg?crop=0.505xw:1.00xh;0.231xw,0&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Beauty & Style,style-beauty,beauty", "sailthru.date": "2019-09-30T15:10:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flat-iron-waves-1-1569856074.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/flat-iron-waves-1-1569856074.jpg?crop=0.505xw:1.00xh;0.231xw,0", "sailthru.socialtitle": "7 Hacks That Make Flat-Iron Waves *So* Much Easier", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1569856200.0, "source": "https://www.cosmopolitan.com", "summary": ""}