{"url": "https://en.wikipedia.org/wiki/Tiger_Woods", "text": "American professional golfer (born 1975)\n\nEldrick Tont \"Tiger\" Woods (born December 30, 1975) is an American professional golfer. He is tied for first in PGA Tour wins, ranks second in men's major championships, and holds numerous golf records.[4] Woods is widely regarded as one of the greatest golfers of all time and is one of the most famous athletes in modern history.[4] He is an inductee of the World Golf Hall of Fame.[5]\n\nFollowing an outstanding junior, college, and amateur golf career, Woods turned professional in 1996 at the age of 20. By the end of April 1997, he had won three PGA Tour events in addition to his first major, the 1997 Masters, which he won by 12 strokes in a record-breaking performance. He reached number one in the world rankings for the first time in June 1997, less than a year after turning pro. Throughout the first decade of the 21st century, Woods was the dominant force in golf. He was the top-ranked golfer in the world from August 1999 to September 2004 (264 consecutive weeks) and again from June 2005 to October 2010 (281 consecutive weeks). During this time, he won 13 of golf's major championships.\n\nThe next decade of Woods's career was marked by comebacks from personal problems and injuries. He took a self-imposed hiatus from professional golf from December 2009 to early April 2010 in an attempt to resolve marital issues with his wife at the time, Elin. Woods admitted to multiple infidelities, and the couple eventually divorced.[6] He fell to number 58 in the world rankings in November 2011 before ascending again to the number-one ranking between March 2013 and May 2014.[7][8] However, injuries led him to undergo four back surgeries between 2014 and 2017.[9] Woods competed in only one tournament between August 2015 and January 2018, and he dropped off the list of the world's top 1,000 golfers.[10][11] On his return to regular competition, Woods made steady progress to the top of the game, winning his first tournament in five years at the Tour Championship in September 2018 and his first major in 11 years at the 2019 Masters.\n\nWoods has held numerous golf records. He has been the number one player in the world for the most consecutive weeks and for the greatest total number of weeks of any golfer in history. He has been awarded PGA Player of the Year a record 11 times[12] and has won the Byron Nelson Award for lowest adjusted scoring average a record eight times. Woods has the record of leading the money list in ten different seasons. He has won 15 professional major golf championships (trailing only Jack Nicklaus, who leads with 18) and 82 PGA Tour events (tied for first all time with Sam Snead).[13] Woods leads all active golfers in career major wins and career PGA Tour wins. Woods is the fifth (after Gene Sarazen, Ben Hogan, Gary Player and Jack Nicklaus) player to achieve the career Grand Slam, and the youngest to do so. He is also the second golfer (after Nicklaus) to achieve a career Grand Slam three times.\n\nWoods has won 18 World Golf Championships. He was also part of the American winning team for the 1999 Ryder Cup. In May 2019, Woods was awarded the Presidential Medal of Freedom by Donald Trump, the fourth golfer to receive the honor.[14]\n\nOn February 23, 2021, Woods was hospitalized in serious but stable condition after a single-car collision and underwent emergency surgery to repair compound fractures sustained in his right leg in addition to a shattered ankle.[15] In an interview with Golf Digest in November 2021, Woods indicated that his full-time career as a professional golfer was over, although he would continue to play \"a few events per year\".[16] He returned to the PGA Tour for the first time since the car accident at the 2022 Masters.\n\nBackground and family\n\nEldrick Tont Woods was born on December 30, 1975, in Cypress, California,[17] to Earl[18] and Kultida \"Tida\" Woods.[19] He is their only child and has two half-brothers and a half-sister from his father's first marriage.[20] Earl was a retired U.S. Army officer and Vietnam War veteran; he was born to African American parents and was also said to have had European, Native American, and possibly Chinese ancestry.[21][22] Kultida (née Punsawad) is originally from Thailand, where Earl met her when he was on a tour of duty there in 1968. She is of mixed Thai, Chinese, and Dutch ancestry.[23] In 2002, ESPN claimed: \"For the record, he is one-quarter Thai, one-quarter Chinese, one-quarter Caucasian, one-eighth African American and one-eighth Native American.\"[24] Tiger has described his ethnic make-up as \"Cablinasian\" (a syllabic abbreviation he coined from Caucasian, Black, American Indian, and Asian).[25]\n\nWoods's first name, Eldrick, was chosen by his mother because it began with \"E\" (for Earl) and ended with \"K\" (for Kultida). His middle name Tont is a traditional Thai name. He was nicknamed Tiger in honor of his father's friend, South Vietnamese Colonel Vuong Dang Phong, who had also been known as Tiger.[26]\n\nWoods has a niece, Cheyenne Woods, who played for the Wake Forest University golf team and turned professional in 2012 when she made her pro debut in the LPGA Championship.[27]\n\nEarly life and amateur golf career\n\nWoods grew up in Orange County, California. He was a child prodigy who was introduced to golf before the age of two by his athletic father Earl Woods. Earl was a single-digit handicap amateur golfer who also was one of the earliest African-American college baseball players at Kansas State University.[28] His father was a member of the military and had playing privileges at the Navy golf course beside the Joint Forces Training Base in Los Alamitos, which allowed Tiger to play there. Tiger also played at the par 3 Heartwell golf course in Long Beach, as well as some of the municipals in Long Beach.[29]\n\nIn 1978, Woods putted against comedian Bob Hope in a television appearance on The Mike Douglas Show. At age three, he shot a 48 over nine holes at the Navy course. At age five, he appeared in Golf Digest and on ABC's That's Incredible![30] Before turning seven, Woods won the Under Age 10 section of the Drive, Pitch, and Putt competition, held at the Navy Golf Course in Cypress.[31] In 1984 at the age of eight, he won the 9–10 boys' event, the youngest age group available, at the Junior World Golf Championships.[32] He first broke 80 at age eight.[33] He went on to win the Junior World Championships six times, including four consecutive wins from 1988 to 1991.[34][35][36][37][38]\n\nWoods's father Earl wrote that Tiger first defeated him at the age of 11 years, with Earl trying his best. He lost to Woods every time from then on.[39] Woods first broke 70 on a regulation golf course at age 12.[40]\n\nWhen Woods was 13 years old, he played in the 1989 Big I, which was his first major national junior tournament. In the final round, he was paired with pro John Daly, who was then relatively unknown. The event's format placed a professional with each group of juniors who had qualified. Daly birdied three of the last four holes to beat him by only one stroke.[41] As a young teenager, Woods first met Jack Nicklaus in Los Angeles at the Bel-Air Country Club, when Nicklaus was performing a clinic for the club's members. Woods was part of the show, and he impressed Nicklaus and the crowd with his skills and potential.[42] Earl Woods had researched in detail the career accomplishments of Nicklaus and had set his young son the goals of breaking those records.[40]\n\nWoods was 15 years old and a student at Western High School in Anaheim when he became the youngest U.S. Junior Amateur champion; this was a record that stood until it was broken by Jim Liu in 2010.[43] He was named 1991's Southern California Amateur Player of the Year (for the second consecutive year) and Golf Digest Junior Amateur Player of the Year. In 1992, he defended his title at the U.S. Junior Amateur Championship, becoming the tournament's first two-time winner. He also competed in his first PGA Tour event, the Nissan Los Angeles Open (he missed the 36-hole cut), and was named Golf Digest Amateur Player of the Year, Golf World Player of the Year, and Golfweek National Amateur of the Year.[44][45]\n\nThe following year, Woods won his third consecutive U.S. Junior Amateur; he remains the event's only three-time winner.[46] In 1994, at the TPC at Sawgrass in Florida, he became the youngest winner of the U.S. Amateur, a record he held until 2008 when it was broken by Danny Lee.[47] He was a member of the American team at the 1994 Eisenhower Trophy World Amateur Golf Team Championships (winning), and the 1995 Walker Cup (losing).[48][49]\n\nWoods graduated from Western High School at age 18 in 1994 and was voted \"Most Likely to Succeed\" among the graduating class. He starred for the high school's golf team under coach Don Crosby.[50]\n\nWoods learned to manage his stuttering as a boy.[51] This was not widely known until he wrote a letter to a boy who contemplated suicide. Woods wrote, \"I know what it's like to be different and to sometimes not fit in. I also stuttered as a child and I would talk to my dog and he would sit there and listen until he fell asleep. I also took a class for two years to help me, and I finally learned to stop.\"[52]\n\nCollege golf career\n\nWoods was heavily recruited by college golf powers. He chose Stanford University, the 1994 NCAA champions. He enrolled at Stanford in the fall of 1994 under a golf scholarship and won his first collegiate event, the 40th Annual William H. Tucker Invitational, that September.[53] He selected a major in economics and was nicknamed \"Urkel\" by college teammate Notah Begay III.[54] In 1995, he successfully defended his U.S. Amateur title at the Newport Country Club in Rhode Island[47] and was voted Pac-10 Player of the Year, NCAA First Team All-American, and Stanford's Male Freshman of the Year (an award that encompasses all sports).[55][56]\n\nAt age 19, Woods participated in his first PGA Tour major, the 1995 Masters, and tied for 41st as the only amateur to make the cut; two years later, he won the tournament by 12 strokes. At age 20 in 1996, he became the first golfer to win three consecutive U.S. Amateur titles[57] and won the NCAA individual golf championship.[58] In winning the silver medal as leading amateur at The Open Championship, he tied the record for an amateur aggregate score of 281.[59] He left college after two years in order to turn professional in the golf industry. In 1996, Woods moved out of California, stating in 2013 that it was due to the state's high tax rate.[60]\n\nProfessional career\n\nWoods in 1997\n\nWoods turned professional at age 20 in August 1996 and immediately signed advertising deals with Nike, Inc. and Titleist that ranked as the most lucrative endorsement contracts in golf history at that time.[61][62] Woods was named Sports Illustrated's 1996 Sportsman of the Year and PGA Tour Rookie of the Year.[63] On April 13, 1997, he won his first major, the Masters, in record-breaking fashion and became the tournament's youngest winner at age 21.[64] Two months later, he set the record for the fastest ascent to No. 1 in the Official World Golf Ranking.[65] After a lackluster 1998, Woods finished the 1999 season with eight wins, including the PGA Championship, a feat not achieved since Johnny Miller did it in 1974.[66][67]\n\nWoods was severely myopic; his eyesight had a rating of 11 diopters. In order to correct this problem, he underwent successful laser eye surgery in 1999,[68] and he immediately resumed winning tour events. In 2007, his vision again began to deteriorate, and he underwent laser eye surgery a second time.[69]\n\nIn 2000, Woods won six consecutive events on the PGA Tour, which was the longest winning streak since Ben Hogan did it in 1948. One of these was the U.S. Open, where he broke or tied nine tournament records in what Sports Illustrated called \"the greatest performance in golf history\", in which Woods won the tournament by a record 15-stroke margin and earned a check for $800,000.[70] At age 24, he became the youngest golfer to achieve the Career Grand Slam.[71] At the end of 2000, Woods had won nine of the twenty PGA Tour events he entered and had broken the record for lowest scoring average in tour history. He was named the Sports Illustrated Sportsman of the Year, the only athlete to be honored twice, and was ranked by Golf Digest magazine as the twelfth-best golfer of all time.[72]\n\nWhen Woods won the 2001 Masters, he became the only player to win four consecutive major professional golf titles, although not in the same calendar year. This achievement came to be known as the \"Tiger Slam\".[73] Following a stellar 2001 and 2002 in which he continued to dominate the tour, Woods's career hit a slump.[66][74] He did not win a major in 2003 or 2004. In September 2004, Vijay Singh overtook Woods in the Official World Golf Rankings, ending Woods's record streak of 264 weeks at No. 1.[75]\n\nWoods rebounded in 2005, winning six PGA Tour events and reclaiming the top spot in July after swapping it back and forth with Singh over the first half of the year.[76]\n\nWoods began dominantly in 2006, winning his first two PGA tournaments but failing to capture his fifth Masters championship in April.[77] Following the death of his father in May, Woods took some time off from the tour and appeared rusty upon his return at the U.S. Open at Winged Foot Golf Club, where he missed the cut.[78] However, he quickly returned to form and ended the year by winning six consecutive tour events. At the season's close, Woods had 54 total wins that included 12 majors; he broke the tour records for both total wins and total majors wins over eleven seasons.[79]\n\nWoods continued to excel in 2007 and the first part of 2008. In April 2008, he underwent knee surgery and missed the next two months on the tour.[80] Woods returned for the 2008 U.S. Open, where he struggled the first day but ultimately claimed a dramatic sudden death victory over Rocco Mediate that followed an 18-hole playoff, after which Mediate said, \"This guy does things that are just not normal by any stretch of the imagination,\" and Kenny Perry added, \"He beat everybody on one leg.\"[81] Two days later, Woods announced that he would miss the remainder of the season due to additional knee surgery, and that his knee was more severely damaged than previously revealed, prompting even greater praise for his U.S. Open performance. Woods called it \"my greatest ever championship.\"[82] In Woods's absence, television ratings for the remainder of the season suffered a huge decline from 2007.[83]\n\nWoods competing at the third annual Earl Woods Memorial Pro-Am (July 1, 2009)\n\nWoods had a much anticipated return to golf in 2009, when he performed well. His comeback included a spectacular performance at the 2009 Presidents Cup, but he failed to win a major, the first year since 2004 that he did not do so.[84] After his marital infidelities came to light and received massive media coverage at the end of 2009 (see further details below), Woods announced in December that he would be taking an indefinite break from competitive golf.[6] In February 2010, he delivered a televised apology for his behavior, saying \"I was wrong and I was foolish.\"[85] During this period, several companies ended their endorsement deals with Woods.[86]\n\nWoods returned to competition in April at the 2010 Masters, where he finished tied for fourth place.[87] He followed the Masters with poor showings at the Quail Hollow Championship and the Players Championship, where he withdrew in the fourth round, citing injury.[88] Shortly afterward, Hank Haney, Woods's coach since 2003, resigned the position. In August, Woods hired Sean Foley as Haney's replacement. The rest of the season went badly for Woods, who failed to win a single event for the first time since turning professional, while nevertheless finishing the season ranked No. 2 in the world.\n\nIn 2011, Woods's performance continued to suffer; this took its toll on his ranking. After falling to No. 7 in March, he rebounded to No. 5 with a strong showing at the 2011 Masters, where he tied for fourth place.[89] Due to leg injuries incurred at the Masters, he missed several summer stops on the PGA Tour. In July, he fired his longtime caddie Steve Williams (who was shocked by the dismissal), and replaced him on an interim basis with friend Bryon Bell until he hired Joe LaCava.[90] After returning to tournament play in August, Woods continued to falter, and his ranking gradually fell to a low of #58.[8] He rose to No. 50 in mid-November after a third-place finish at the Emirates Australian Open, and broke his winless streak with a victory at December's Chevron World Challenge.[8][91][full citation needed]\n\nWoods began his 2012 season with two tournaments (the Abu Dhabi HSBC Golf Championship and the AT&T Pebble Beach National Pro-Am) where he started off well but struggled on the final rounds. Following the WGC-Accenture Match Play Championship, where he was knocked out in the second round by missing a 5-foot putt,[92] Woods revised his putting technique and tied for second at The Honda Classic, with the lowest final-round score in his PGA Tour career. After a short time off due to another leg injury, Woods won the Arnold Palmer Invitational, his first win on the PGA Tour since the BMW Championship in September 2009. Following several dismal performances, Woods notched his 73rd PGA Tour win at the Memorial Tournament in June, tying Jack Nicklaus in second place for most PGA Tour victories;[93] a month later, Woods surpassed Nicklaus with a win at the AT&T National, to trail only Sam Snead, who accumulated 82 PGA tour wins.[94]\n\nThe year 2013 brought a return of Woods's dominating play. In January, he won the Farmers Insurance Open by four shots for his 75th PGA Tour win. It was the seventh time he won the event.[95] In March, he won the WGC-Cadillac Championship, also for the seventh time, giving him his 17th WGC title and first since 2009.[96] Two weeks later, he won the Arnold Palmer Invitational, winning the event for a record-tying 8th time. The win moved him back to the top of the world rankings.[97] To commemorate that achievement, Nike was quick to launch an ad with the tagline \"winning takes care of everything\".[98]\n\nDuring the 2013 Masters, Woods faced disqualification after unwittingly admitting in a post-round interview with ESPN that he took an illegal drop on the par-5 15th hole when his third shot bounced off the pin and into the water. After further review of television footage, Woods was assessed a two-stroke penalty for the drop but was not disqualified.[99] He finished tied for fourth in the event. Woods won The Players Championship in May 2013, his second career win at the event, notching his fourth win of the 2013 season. It was the quickest he got to four wins in any season of his professional career.\n\nWoods practicing in a bunker prior to the start of the 2014 Quicken Loans National\n\nWoods had a poor showing at the 2013 U.S. Open as a result of an elbow injury that he sustained at The Players Championship. In finishing at 13-over-par, he recorded his worst score as a professional and finished 12 strokes behind winner Justin Rose. After a prolonged break because of the injury, during which he missed the Greenbrier Classic and his own AT&T National, he returned at the Open Championship at Muirfield. Despite being in contention all week and beginning the final round only two strokes behind Lee Westwood, he struggled with the speed of the greens and could only manage a 3-over-par 74 that left him tied for 6th place, five strokes behind eventual winner Phil Mickelson. Two weeks later, Woods returned to form at the WGC-Bridgestone Invitational, recording his 5th win of the season and 8th win at the event in its 15-year history. His second-round 61 matched his record score on the PGA Tour and could easily have been a 59 were it not for some short missed birdie putts on the closing holes. This gave him a seven-stroke lead that he held onto for the rest of the tournament. But at the PGA Championship at Oak Hill Country Club, Woods never was in contention, making 2013 his fifth full season where he did not win a major; he was in contention in only two of the four majors in 2013.\n\nAfter a slow start to 2014, Woods sustained an injury during the final round of The Honda Classic and was unable to finish the tournament. He withdrew after the 13th hole, citing back pain.[100] He subsequently competed in the WGC-Cadillac Championship but was visibly in pain during much of the last round. He was forced to skip the Arnold Palmer Invitational at the end of March 2014,[101] and after undergoing back surgery, he announced on April 1 that he would miss the Masters for the first time since 1994.[102] Woods returned at the Quicken Loans National in June, however he said that his expectations for the week were low. He struggled with nearly every aspect of his game and missed the cut. He next played at The Open Championship, contested at Hoylake, where Woods had won eight years prior. Woods fired a brilliant 69 in the first round to put himself in contention, but shot 77 on Friday and eventually finished 69th. Despite his back pain, he played at the 2014 PGA Championship where he failed to make the cut. On August 25, 2014, Woods and his swing coach Sean Foley parted ways. In the four years under Foley, he won eight times but no majors. He had previously won eight majors with Harmon and six with Haney. Woods said there was currently no timetable to find a replacement swing coach.[103]\n\nOn February 5, 2015, Woods withdrew from the Farmers Insurance Open after another back injury.[104] Woods stated on his website that it was unrelated to his previous surgery and he would take a break from golf until his back healed.[105] He returned for the Masters, finishing in a tie for 17th. In the final round, Woods injured his wrist after his club hit a tree root. He later stated that a bone popped out of his wrist, but he adjusted it back into place and finished the round.[106] Woods then missed the cut at the 2015 U.S. Open and Open Championship, the first time Woods missed the cut at consecutive majors, finishing near the bottom of the leaderboard both times.[107] He finished tied for 18th at the Quicken Loans National on August 2.[108] In late August 2015, Woods played quite well at the Wyndham Championship finishing the tournament at 13-under, only four strokes behind the winner, and tied for 10th place.[109] Woods offered only a brief comment on the speculation that he was still recovering from back surgery, saying it was \"just my hip\" but offering no specifics.[110]\n\nWoods had back surgery on September 16, 2015. In late March 2016, he announced that he would miss the Masters while he recovered from the surgery;[111] he had also missed the 2014 Masters due to a back problem.[112] \"I'm absolutely making progress, and I'm really happy with how far I've come,\" he explained in a statement. \"But I still have no timetable to return to competitive golf.\"[113] However, he did attend the Masters Champions Dinner on April 5, 2016.[114] For the first time in his career, he missed all four majors in one year due to problems with his back. In October 2016, he told Charlie Rose on PBS that he still wanted to break Jack Nicklaus's record of 18 major titles.[115] Woods underwent back surgery in December 2016 and spent the next 15 months off the Tour. He made his return to competitive golf in the Hero World Challenge.[116]\n\nWoods's back problems continued to hinder him in 2017. He missed the cut at the Farmers Insurance Open in January and pulled out of a European Tour event in Dubai on February 3. On March 31, Woods announced on his website that he would not be playing in the 2017 Masters Tournament despite being cleared to play by his doctors. Woods said that although he was happy with his rehabilitation, he did not feel \"tournament ready.\"[117][118] Woods subsequently told friends, \"I'm done\".[119] On April 20, Woods announced that he had undergone his fourth back surgery since 2014 to alleviate back and leg pain. Recovery time required up to six months, meaning that Woods would spend the rest of the year without playing any professional golf.[120] Woods returned to competitive golf at the Hero World Challenge in the Bahamas. He shot rounds of 69–68–75–68 and finished tied for 9th place. His world ranking went from 1,199th to 668th, which was the biggest jump in the world rankings in his career.\n\nOn March 11, 2018, he finished one-shot back and tied for second at the Valspar Championship in Florida, his first top-five finish on the PGA Tour since 2013.[121] He then tied for sixth with a score of five under par at the 2018 Open Championship.[122] At the last major of the year, the 2018 PGA Championship, Woods finished second, two shots behind the winner Brooks Koepka. It was his best result in a major since 2009 (second at the 2009 PGA Championship) and moved him up to 26th in the world rankings. His final round of 64 was his best-ever final round in a major.[123][11]\n\nWoods returned to the winner's circle for the 80th time in his PGA Tour career on September 23, 2018, when he won the season-ending Tour Championship at East Lake Golf Club for the second time and that tournament for the third time. He shot rounds of 65–68–65–71 to win by two strokes over Billy Horschel.[124]\n\nOn April 14, 2019, Woods won the Masters, which was his first major championship win in eleven years and his 15th major overall. He finished 13 under par to win by one stroke over Dustin Johnson, Xander Schauffele and Brooks Koepka.[125] At age 43, he became the second oldest golfer ever to win the Masters, after Jack Nicklaus who was 46 when he triumphed in 1986.[126] In August 2019, Woods announced via social media that he underwent knee surgery to repair minor cartilage damage and that he had an arthroscopic procedure during the Tour Championship. In his statement, Woods also confirmed that he was walking and intends on traveling and playing in Japan in October.[127]\n\nWoods played in his first 2020 PGA Tour event at the Zozo Championship in October 2019, which was the first-ever PGA Tour event played in Japan. Woods, who played a highly publicized skins game earlier in the week at the same course as the Championship, held at least a share of the lead after every round of the rain-delayed tournament, giving him a three stroke victory over Hideki Matsuyama.[128] The win was Woods's 82nd on Tour, tying him with Sam Snead for the most victories all time on the PGA Tour.[129][130]\n\nOn December 23, 2020, Woods had microdiscectomy surgery on his back for the fifth time.[131] The operation was to remove a pressurized disc fragment that was pinching his nerve and causing him pain during the PNC Championship.\n\nWoods returned to play in his first professional tournament since his 2021 motor vehicle accident at the 2022 Masters Tournament. He made the cut and finished in 47th place at 13-over par, 23 shots behind the winner Scottie Scheffler.[132]\n\nHonors\n\nWoods checking his drive in 2007\n\nOn August 20, 2007, California Governor Arnold Schwarzenegger and his wife Maria Shriver announced that Woods would be inducted into the California Hall of Fame. He was inducted December 5, 2007 at The California Museum for History, Women and the Arts in Sacramento.[133]\n\nIn December 2009, Woods was named \"Athlete of the Decade\" by the Associated Press.[134] He was named Associated Press Male Athlete of the Year[135] a record-tying four times, and is one of only two people to be named Sports Illustrated's Sportsman of the Year more than once.\n\nSince his record-breaking win at the 1997 Masters, Woods has been the biggest name in golf and his presence in tournaments has drawn a huge fan following. Some sources have credited him for dramatically increasing prize money in golf, generating interest in new PGA tournament audiences, and for drawing the largest TV ratings in golf history.[63][136]\n\nIn May 2019, following his 2019 Masters Tournament win, Woods was awarded the Presidential Medal of Freedom by President Donald Trump.[137]\n\nEndorsements\n\nDuring the first decade of his professional career, Woods was the world's most marketable athlete.[138] Shortly after his 21st birthday in 1996, he signed endorsement deals with numerous companies, including General Motors, Titleist, General Mills, American Express, Accenture, and Nike. In 2000, he signed a 5-year, $105 million contract extension with Nike, which was the largest endorsement package signed by a professional athlete at that time.[139] Woods's endorsement has been credited with playing a significant role in taking the Nike Golf brand from a \"start-up\" golf company earlier in the previous decade to becoming the leading golf apparel company in the world and a major player in the equipment and golf ball market.[138][140] Nike Golf is one of the fastest growing brands in the sport, with an estimated $600 million in sales.[141] Woods has been described as the \"ultimate endorser\" for Nike Golf,[141] frequently seen wearing Nike gear during tournaments, and even in advertisements for other products.[139] Woods receives a percentage from the sales of Nike Golf apparel, footwear, golf equipment, golf balls,[138] and has a building named after him at Nike's headquarters campus in Beaverton, Oregon.[142]\n\nIn 2002, Woods was involved in every aspect of the launch of Buick's Rendezvous SUV. A company spokesman stated that Buick was happy with the value of Woods's endorsement, pointing out that more than 130,000 Rendezvous vehicles were sold in 2002 and 2003. \"That exceeded our forecasts,\" he was quoted as saying, \"It has to be in recognition of Tiger.\" In February 2004, Buick renewed Woods's endorsement contract for another five years, in a deal reportedly worth $40 million.[139]\n\nWoods collaborated closely with TAG Heuer to develop the world's first professional golf watch, which was released in April 2005.[143] The lightweight, titanium-construction watch, designed to be worn while playing the game, incorporates numerous innovative design features to accommodate golf play. It is capable of absorbing up to 5,000 Gs of shock, far in excess of the forces generated by a normal golf swing.[143] In 2006, the TAG Heuer Professional Golf Watch won the prestigious iF product design award in the Leisure/Lifestyle category.[144]\n\nWoods preparing for a photo shoot in 2006\n\nWoods also endorsed the Tiger Woods PGA Tour series of video games; he has done so since 1999.[145] In 2006, he signed a six-year contract with Electronic Arts, the series' publisher.[146]\n\nIn February 2007, Woods, Roger Federer, and Thierry Henry became ambassadors for the \"Gillette Champions\" marketing campaign. Gillette did not disclose financial terms, though an expert estimated the deal could total between $10 million and $20 million.[147]\n\nIn October 2007, Gatorade announced that Woods would have his own brand of sports drink starting in March 2008. \"Gatorade Tiger\" was his first U.S. deal with a beverage company and his first licensing agreement. Although no figures were officially disclosed, Golfweek magazine reported that it was for five years and could pay him as much as $100 million.[148] The company decided in early fall 2009 to discontinue the drink due to weak sales.[149]\n\nIn October 2012, it was announced that Woods signed an exclusive endorsement deal with Fuse Science, Inc, a sports nutrition firm.[150]\n\nIn 1997, Woods and fellow golfer Arnold Palmer initiated a civil case against Bruce Matthews (the owner of Gotta Have It Golf, Inc.) and others in the effort to stop the unauthorized sale of their images and alleged signatures in the memorabilia market. Matthews and associated parties counterclaimed that Woods and his company, ETW Corporation, committed several acts including breach of contract, breach of implied duty of good faith, and violations of Florida's Deceptive and Unfair Trade Practices Act.[151] Palmer also was named in the counter-suit, accused of violating the same licensing agreement in conjunction with his company Arnold Palmer Enterprises.\n\nOn March 12, 2014, a Florida jury ruled in favor of Gotta Have It on its breach of contract and other related claims, rejected ETW's counterclaims, and awarded Gotta Have It $668,346 in damages.[152] The award may end up exceeding $1 million once interest has been factored in, though the ruling may be appealed.\n\nIn August 2016, Woods announced that he would be seeking a new golf equipment partner[153] after the news of Nike's exit from the equipment industry.[154] It was announced on January 25, 2017 that he would be signing a new club deal with TaylorMade.[155] He added the 2016 M2 driver along with the 2017 M1 fairway woods, with irons to be custom made at a later date. He also added his Scotty Cameron Newport 2 GSS, a club he used to win 13 of his 15 majors.[156] Also, in late 2016, he would add Monster Energy as his primary bag sponsor, replacing MusclePharm.[157]\n\nAccumulated wealth\n\nWoods has appeared on Forbes' list of the world's highest-paid athletes.[158][159] According to Golf Digest, Woods earned $769,440,709 from 1996 to 2007,[160] and the magazine predicted that Woods would pass a billion dollars in earnings by 2010.[161] In 2009, Forbes confirmed that Woods was indeed the world's first professional athlete to earn over a billion dollars in his career, after accounting for the $10 million bonus Woods received for the FedEx Cup title.[162] The same year, Forbes estimated his net worth to be $600 million, making him the second richest person of color in the United States, behind only Oprah Winfrey.[163] In 2015, Woods ranked ninth in Forbes' list of world's highest-paid athletes, being the top among Asian Americans or the fourth among African Americans.[164] As of 2017, Woods was considered to be the highest-paid golfer in the world.[165] In 2022, Woods was the first golfer to have a net worth over one billion dollars.[166]\n\nTiger-proofing\n\nEarly in Woods's career, a small number of golf industry analysts expressed concern about his impact on the competitiveness of the game and the public appeal of professional golf. Sportswriter Bill Lyon of Knight Ridder asked in a column, \"Isn't Tiger Woods actually bad for golf?\" (though Lyon ultimately concluded that he was not).[167] At first, some pundits feared that Woods would drive the spirit of competition out of the game of golf by making existing courses obsolete and relegating opponents to simply competing for second place each week.\n\nA related effect was measured by University of California economist Jennifer Brown, who found that other golfers scored worse when competing against Woods than when he was not in the tournament. The scores of highly skilled golfers are nearly one stroke higher when playing against Woods. This effect was larger when he was on winning streaks and disappeared during his well-publicized slump in 2003–04. Brown explains the results by noting that competitors of similar skill can hope to win by increasing their level of effort, but that, when facing a \"superstar\" competitor, extra exertion does not significantly raise one's level of winning while increasing risk of injury or exhaustion, leading to reduced effort.[168]\n\nMany courses in the PGA Tour rotation (including major championship sites like Augusta National) have added yardage to their tees in an effort to reduce the advantage of long hitters like Woods, in a strategy that became known as \"Tiger-proofing\".[169] Woods said he welcomed the change, in that adding yardage to courses did not affect his ability to win.[170]\n\nCareer achievements\n\nWoods has won 82 official PGA Tour events, including 15 majors. He is 14–1 when going into the final round of a major with at least a share of the lead. Multiple golf experts have heralded Woods as \"the greatest closer in history\".[171] He has the lowest career scoring average and the largest career earnings of any player in PGA Tour history.\n\nWoods's victory at the 2013 Players Championship also marked a win in his 300th PGA Tour start.[172] He also won golf tournaments in his 100th (in 2000) and 200th (in 2006) tour starts.[173]\n\nWoods has spent the most consecutive and cumulative weeks atop the world rankings. He is one of five players (along with Gene Sarazen, Ben Hogan, Gary Player, and Jack Nicklaus) to have won all four major championships in his career, known as the Career Grand Slam, and was the youngest to do so.[174] Woods is the only player to have consecutively won all four major championships open to professionals, accomplishing the feat in the 2000–2001 seasons.\n\nMajor championships\n\nWins (15)\n\n1Defeated May in three-hole playoff by 1 stroke: Woods (3–4–5=12), May (4–4–5=13)\n\n2Defeated DiMarco in a sudden-death playoff: Woods (3), DiMarco (4).\n\n3Defeated Mediate with a par on 1st sudden death hole after 18-hole playoff was tied at even par. This was the final time an 18-hole playoff was used in competition.\n\nResults timeline\n\nResults not in chronological order in 2020.\n\nTournament 1995 1996 1997 1998 1999 Masters Tournament T41 LA CUT 1 T8 T18 U.S. Open WD T82 T19 T18 T3 The Open Championship T68 T22 LA T24 3 T7 PGA Championship T29 T10 1\n\nTournament 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 Masters Tournament 5 1 1 T15 T22 1 T3 T2 2 T6 U.S. Open 1 T12 1 T20 T17 2 CUT T2 1 T6 The Open Championship 1 T25 T28 T4 T9 1 1 T12 CUT PGA Championship 1 T29 2 T39 T24 T4 1 1 2\n\nTournament 2010 2011 2012 2013 2014 2015 2016 2017 2018 Masters Tournament T4 T4 T40 T4 T17 T32 U.S. Open T4 T21 T32 CUT CUT The Open Championship T23 T3 T6 69 CUT T6 PGA Championship T28 CUT T11 T40 CUT CUT 2\n\nWin\n\nTop 10\n\nDid not play\n\nLA = Low amateur\n\nCUT = missed the half-way cut\n\nWD = withdrew\n\n\"T\" indicates a tie for a place\n\nNT = No tournament due to COVID-19 pandemic\n\nSummary\n\nTournament Wins 2nd 3rd Top-5 Top-10 Top-25 Events Cuts made Masters Tournament 5 2 1 12 14 18 24 23 PGA Championship 4 3 0 8 9 11 22 18 U.S. Open 3 2 1 7 8 15 22 17 The Open Championship 3 0 2 6 10 15 22 18 Totals 15 7 4 33 41 59 90 76\n\nMost consecutive cuts made – 39 (1996 U.S. Open – 2006 Masters)\n\nLongest streak of top-10s – 8 (1999 U.S. Open – 2001 Masters)\n\nThe Players Championship\n\nWins (2)\n\nResults timeline\n\nTournament 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 The Players Championship T31 T35 T10 2 1 T14 T11 T16 T53 T22 T37 8\n\nTournament 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 The Players Championship WD WD T40 1 T69 T11 T30\n\nWin\n\nTop 10\n\nDid not play\n\nWD = withdrew\n\n\"T\" indicates a tie for a place.\n\nWorld Golf Championships\n\nWins (18)\n\nResults timeline\n\nResults not in chronological order before 2015.\n\nTournament 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 Championship 1 T5 NT1 1 1 9 1 1 1 5 T9 T10 WD 1 T25 T10 Match Play QF 2 R64 1 1 R32 R16 R16 1 R32 R64 R32 R64 QF Invitational 1 1 1 4 T4 T2 1 1 1 1 T78 T37 T8 1 WD T31 Champions T6 T6\n\n1Cancelled due to 9/11\n\n\n\nWin\n\nTop 10\n\nDid not play\n\nQF, R16, R32, R64 = Round in which player lost in match play\n\nWD = withdrew\n\nNT = No tournament\n\n\"T\" = tied\n\nNote that the HSBC Champions did not become a WGC event until 2009.\n\nPGA Tour career summary\n\nSeason Starts Cuts\n\nmade Wins (majors) 2nd 3rd Top\n\n10 Top\n\n25 Earnings\n\n($) Money\n\nlist rank 1992 1 0 0 0 0 0 0 – – 1993 3 0 0 0 0 0 0 – – 1994 3 0 0 0 0 0 0 – – 1995 4 3 0 0 0 0 0 – – 1996 11 10 2 0 2 5 8 790,594 24 1997 21 20 4 (1) 1 1 9 14 2,066,833 1 1998 20 19 1 2 2 13 17 1,841,117 4 1999 21 21 8 (1) 1 2 16 18 6,616,585 1 2000 20 20 9 (3) 4 1 17 20 9,188,321 1 2001 19 19 5 (1) 0 1 9 18 5,687,777 1 2002 18 18 5 (2) 2 2 13 16 6,912,625 1 2003 18 18 5 2 0 12 16 6,673,413 2 2004 19 19 1 3 3 14 18 5,365,472 4 2005 21 19 6 (2) 4 2 13 17 10,628,024 1 2006 15 14 8 (2) 1 1 11 13 9,941,563 1 2007 16 16 7 (1) 3 0 12 15 10,867,052 1 2008 6 6 4 (1) 1 0 6 6 5,775,000 2 2009 17 16 6 3 0 14 16 10,508,163 1 2010 12 11 0 0 0 2 7 1,294,765 68 2011 9 7 0 0 0 2 3 660,238 128 2012 19 17 3 1 2 9 13 6,133,158 2 2013 16 16 5 1 0 8 10 8,553,439 1 2013–14 7 5 0 0 0 0 1 108,275 201 2014–15 11 6 0 0 0 1 3 448,598 162 2015–16 0 0 0 0 0 0 0 0 n/a 2016–17 1 0 0 0 0 0 0 0 n/a 2017–18 18 16 1 2 0 7 12 5,443,841 7 2018–19 12 9 1 (1) 0 0 4 7 3,199,615 24 2019–20 7 7 1 0 0 2 2 2,083,038 38 2020–21 3 2 0 0 0 0 0 64,200 223 2021–22* 3 2 0 0 0 0 0 43,500 225 Career* 369 335 82 (15) 31 19 199 270 120,895,206 1[175]\n\n*As of July 18, 2022\n\nPlaying style\n\nWhen Woods first joined the PGA Tour in 1996, his long drives had a large impact on the world of golf,[176] but he did not upgrade his equipment in the following years. He insisted upon the use of True Temper Dynamic Gold steel-shafted clubs and smaller steel clubheads that promoted accuracy over distance.[177] Many opponents caught up to him, and Phil Mickelson even made a joke in 2003 about Woods using \"inferior equipment\", which did not sit well with Nike, Titleist, or Woods.[178] During 2004, Woods finally upgraded his driver technology to a larger clubhead and graphite shaft, which, coupled with his clubhead speed, again made him one of the tour's longest players off the tee.\n\nDespite his power advantage, Woods has always focused on developing an excellent all-around game. Although in recent years[when?] he has typically been near the bottom of the Tour rankings in driving accuracy, his iron play is generally accurate, his recovery and bunker play is very strong, and his putting (especially under pressure) is possibly his greatest asset. He is largely responsible for a shift to higher standards of athleticism amongst professional golfers, and is known for utilizing more hours of practice than most.[179][180][181]\n\nFrom mid-1993 (while he was still an amateur) until 2004, Woods worked almost exclusively with leading swing coach Butch Harmon. From mid-1997, Harmon and Woods fashioned a major redevelopment of Woods's full swing, achieving greater consistency, better distance control, and better kinesiology. The changes began to pay off in 1999.[182] Woods and Harmon eventually parted ways. From March 2004 to 2010, Woods was coached by Hank Haney, who worked on flattening his swing plane. Woods continued to win tournaments with Haney, but his driving accuracy dropped significantly. Haney resigned under questionable circumstances in May 2010[183] and was replaced by Sean Foley.[184]\n\nFluff Cowan served as Woods's caddie from the start of his professional career until Woods dismissed him in March 1999.[185] He was replaced by Steve Williams, who became a close friend of Woods and is often credited with helping him with key shots and putts.[186] In June 2011, Woods dismissed Williams after he caddied for Adam Scott in the U.S. Open[187] and replaced him with friend Bryon Bell on an interim basis. Joe LaCava, a former caddie of both Fred Couples and Dustin Johnson, was hired by Woods shortly after[188] and has remained Woods's caddie since then.\n\nOther ventures\n\nTGR Foundation\n\nThe TGR Foundation was established in 1996 by Woods and his father Earl as the Tiger Woods Foundation with the primary goal of promoting golf among inner-city children.[189] The foundation has conducted junior golf clinics across the country, and sponsors the Tiger Woods Foundation National Junior Golf Team in the Junior World Golf Championships.[190][191] As of December 2010, TWF employed approximately 55 people.[192][193]\n\nThe foundation operates the Tiger Woods Learning Center, a $50-million, 35,000-square-foot (3,300 m2) facility in Anaheim, California, providing college-access programs for underserved youth.[190][192][194] The TWLC opened in 2006 and features seven classrooms, extensive multi-media facilities and an outdoor golf teaching area.[190] The center has since expanded to four additional campuses: two in Washington, D.C.; one in Philadelphia; and one in Stuart, Florida.[194]\n\nThe foundation benefits from the annual Chevron World Challenge and AT&T National golf tournaments hosted by Woods.[192] In October 2011, the foundation hosted the first Tiger Woods Invitational at Pebble Beach.[195] Other annual fundraisers have included the concert events Block Party, last held in 2009 in Anaheim, and Tiger Jam, last held in 2011 in Las Vegas after a one-year hiatus.[192][196]\n\nTiger Woods Design\n\nIn November 2006, Woods announced his intention to begin designing golf courses around the world through a new company, Tiger Woods Design.[197] A month later, he announced that the company's first course would be in Dubai as part of a 25.3-million-square-foot development, The Tiger Woods Dubai.[198] The Al Ruwaya Golf Course was initially expected to finish construction in 2009.[198] As of February 2010, only seven holes had been completed; in April 2011, The New York Times reported that the project had been shelved permanently.[199][200] In 2013, the partnership between Tiger Woods Design and Dubai Holding was dissolved.[201]\n\nTiger Woods Design has taken on two other courses, neither of which has materialized. In August 2007, Woods announced The Cliffs at High Carolina, a private course in the Blue Ridge Mountains near Asheville, North Carolina.[202] After a groundbreaking in November 2008, the project suffered cash flow problems and suspended construction.[200] A third course, in Punta Brava, Mexico, was announced in October 2008, but incurred delays due to issues with permits and an environmental impact study.[200][203] Construction on the Punta Brava course has not yet begun.[200]\n\nThese projects have encountered problems that have been attributed to factors that include overly optimistic estimates of their value, declines throughout the global economy (particularly the U.S. crash in home prices), and the decreased appeal and marketability of Woods following his 2009 infidelity scandal.[200]\n\nWritings\n\nWoods wrote a golf instruction column for Golf Digest magazine from 1997 to February 2011.[204] In 2001, he wrote a best-selling golf instruction book, How I Play Golf, which had the largest print run of any golf book for its first edition, 1.5 million copies.[205] In March 2017, he published a memoir, The 1997 Masters: My Story, co-authored by Lorne Rubenstein, which focuses on his first Masters win.[206] In October 2019, Woods announced he would be writing a memoir book titled Back.[207]\n\nPersonal life\n\nWoods after receiving the Presidential Medal of Freedom in 2019. From left to right: girlfriend Erica Herman, mother Kultida Woods, daughter Sam Woods, son Charlie Woods, and Tiger Woods\n\nRelationships and children\n\nIn November 2003, Woods became engaged to Elin Nordegren, a Swedish former model and daughter of former minister of migration Barbro Holmberg and radio journalist Thomas Nordegren.[208] They were introduced during The Open Championship in 2001 by Swedish golfer Jesper Parnevik, who had employed her as an au pair. They married on October 5, 2004, at the Sandy Lane resort in Barbados, and lived at Isleworth, a community in Windermere, a suburb of Orlando, Florida.[209][210] In 2006, they purchased a $39-million estate in Jupiter Island, Florida, and began constructing a 10,000-square-foot home; Woods moved there in 2010 following the couple's divorce.[158][210]\n\nWoods and Nordegren's first child was a daughter born in 2007, whom they named Sam Alexis Woods. Woods chose the name because his own father had always called him Sam.[211] Their son, Charlie Axel Woods, was born in 2009.[212]\n\nInfidelity scandal and fallout\n\nIn November 2009, the National Enquirer published a story claiming that Woods had an extramarital affair with New York City nightclub manager Rachel Uchitel, who denied the claim.[213] Two days later, around 2:30 a.m. on November 27, Woods was driving from his Florida mansion in his Cadillac Escalade SUV when he collided with a fire hydrant, a tree, and several hedges near his home.[214] He was treated for minor facial lacerations and received a ticket for careless driving.[214][215] Following intense media speculation about the cause of the accident, Woods released a statement on his website and took sole responsibility for the accident, calling it a \"private matter\" and crediting his wife for helping him from the car.[216] On November 30, Woods announced that he would not be appearing at his own charity golf tournament (the Chevron World Challenge) or any other tournaments in 2009 due to his injuries.[217]\n\nOn December 2, following Us Weekly magazine's previous day reporting of a purported mistress and subsequent release of a voicemail message allegedly left by Woods for the woman,[218] Woods released a further statement. He admitted transgressions and apologized to \"all of those who have supported [him] over the years\", while reiterating his and his family's right to privacy.[213][219] Over the next few days, more than a dozen women claimed in various media outlets to have had affairs with Woods.[6] On December 11, he released a third statement admitting to infidelity and he apologized again. He also announced that he would be taking \"an indefinite break from professional golf.\"[6]\n\nIn the days and months following Woods's admission of multiple infidelities, several companies re-evaluated their relationships with him. Accenture, AT&T, Gatorade, and General Motors completely ended their sponsorship deals, while Gillette suspended advertising featuring Woods.[86][220] TAG Heuer dropped Woods from advertising in December 2009 and officially ended their deal when his contract expired in August 2011.[86] Golf Digest magazine suspended Woods's monthly column beginning with the February 2010 issue.[221] In contrast, Nike continued to support Woods, as did Electronic Arts, which was working with Woods on the game Tiger Woods PGA Tour Online.[222] A December 2009 study estimated the shareholder loss caused by Woods's affairs to be between $5 billion and $12 billion.[223]\n\nOn February 19, 2010, Woods gave a televised statement in which he said he went through a 45-day therapy program that began at the end of December. He again apologized for his actions. \"I thought I could get away with whatever I wanted to,\" he said. \"I felt that I had worked hard my entire life and deserved to enjoy all the temptations around me. I felt I was entitled. Thanks to money and fame, I didn't have to go far to find them. I was wrong. I was foolish.\" He said he did not know yet when he would be returning to golf.[85][224] On March 16, he announced that he would play in the 2010 Masters.[225]\n\nAfter six years of marriage, Woods and Nordegren divorced on August 23, 2010.[226]\n\nNew relationships\n\nOn March 18, 2013, Woods announced that he and Olympic gold medal skier Lindsey Vonn were dating.[227] They split up in May 2015.[228] From November 2016 to August 2017, Woods was rumored in a relationship with stylist Kristin Smith.[229] Since late 2017, he has been in a relationship with restaurant manager Erica Herman.[230]\n\n2017 arrest\n\nDashcam video of Tiger Woods's DUI arrest, 29 min 27 sec\n\nOn May 29, 2017, Woods was arrested near his Jupiter Island, Florida home by the Jupiter Police Department at about 3:00 am. EDT for driving under the influence of alcohol or drugs. He was asleep in his car, which was stationary in a traffic lane with its engine running. He later stated that he took prescription drugs and did not realize how they might interact together.[231] On July 3, 2017, Woods tweeted that he completed an out-of-state intensive program to tackle an unspecified issue.[232] At his August 9, 2017 arraignment, Woods had his attorney Douglas Duncan submit a not guilty plea for him and agreed to take part in a first-time DUI offender program and attend another arraignment on October 25.[233][234]\n\nAt a hearing on October 27, 2017, Woods pleaded guilty to reckless driving. He received a year of probation, was fined $250, and ordered to undergo 50 hours of community service along with regular drug tests. He was not allowed to drink alcohol during the probation, and if he violated the probation he would be sentenced to 90 days in jail with an additional $500 fine.[235]\n\n2021 car crash\n\nOn February 23, 2021, Woods survived a serious rollover car accident in Rancho Palos Verdes, California.[236] The wreck was a single-vehicle collision and Woods was the sole occupant of the vehicle, which was traveling north along Hawthorne Boulevard.[237][238][239]\n\nHe was taken to the Harbor–UCLA Medical Center by ambulance.[240][236] The incident was under investigation by the Los Angeles County Sheriff's Department, which said the car \"sustained major damage,\" and that Woods was driving over 80 mph, nearly twice the speed limit, before he crashed. No charges were filed.[241][236][242][243] Woods's agent later said that he sustained multiple leg injuries and had surgery for non-life-threatening injuries.[236][238][242]\n\nOther pursuits\n\nWoods was raised as a Buddhist. He actively practiced his faith from childhood until well into his adult professional golf career.[244] In a 2000 article, Woods was quoted as saying that he \"believes in Buddhism ... not every aspect, but most of it.\"[245] He has attributed his deviations and infidelity to his losing track of Buddhism. He said, \"Buddhism teaches me to stop following every impulse and to learn restraint. Obviously I lost track of what I was taught.\"[246]\n\nWoods is registered as an independent voter.[247] In January 2009, Woods delivered a speech commemorating the military at the We Are One: The Obama Inaugural Celebration at the Lincoln Memorial.[248] In April 2009, Woods visited the White House while promoting the golf tournament he hosts, the AT&T National.[249] In December 2016 and again in November 2017, Woods played golf with President Donald Trump at the Trump International Golf Club in West Palm Beach.[250]\n\nBibliography\n\nSee also\n\nNotes\n\n^ This is calculated by totalling Woods's 82 PGA Tour victories, 8 regular European Tour wins, 2 non co-sanctioned Japan Golf Tour wins, 1 non co-sanctioned Asian Tour win, and the 17 other wins in his career. ^ [3] These are the 15 majors, 18 WGC events, and his eight tour wins.\n\nReferences", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Tiger_Woods_in_May_2019.jpg/220px-Tiger_Woods_in_May_2019.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/23px-Flag_of_Germany.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Tiger_Woods_Masters_2006.jpg/220px-Tiger_Woods_Masters_2006.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Tiger_Woods_drives_by_Allison.jpg/220px-Tiger_Woods_drives_by_Allison.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Flag_of_Fiji.svg/23px-Flag_of_Fiji.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Flag_of_Scotland.svg/23px-Flag_of_Scotland.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/50px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/21px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/President_Trump_Presents_the_Medal_of_Freedom_to_Tiger_Woods_%2847796274401%29.jpg/220px-President_Trump_Presents_the_Medal_of_Freedom_to_Tiger_Woods_%2847796274401%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/3/3e/Tiger_Woods_in_May_2019.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/TigerWoods2004RyderCup1.jpg/170px-TigerWoods2004RyderCup1.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Flag_of_Denmark.svg/20px-Flag_of_Denmark.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Flag_of_South_Africa.svg/23px-Flag_of_South_Africa.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Tiger_Woods_-_AT%26T_National_tournament_2009.jpg/170px-Tiger_Woods_-_AT%26T_National_tournament_2009.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9a/Flag_of_Spain.svg/23px-Flag_of_Spain.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/27px-Wikinews-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Flag_of_Ireland.svg/23px-Flag_of_Ireland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Sports_icon.png/21px-Sports_icon.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Flag_of_Croatia.svg/23px-Flag_of_Croatia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Tiger_Woods_speaks_at_We_Are_One.JPG/220px-Tiger_Woods_speaks_at_We_Are_One.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/b/be/Flag_of_England.svg/23px-Flag_of_England.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Tiger_Woods_2014.jpg/220px-Tiger_Woods_2014.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/19px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/President_Trump_Presents_the_Medal_of_Freedom_to_Tiger_Woods_%2847813420571%29_%28cropped%29.jpg/220px-President_Trump_Presents_the_Medal_of_Freedom_to_Tiger_Woods_%2847813420571%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Barack_Obama_meets_Tiger_Woods_4-20-09.jpg/220px-Barack_Obama_meets_Tiger_Woods_4-20-09.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Flag_of_Wales.svg/23px-Flag_of_Wales.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Flag_of_Australia_%28converted%29.svg/23px-Flag_of_Australia_%28converted%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Tiger_Woods_2018_US_Open_26.jpg/180px-Tiger_Woods_2018_US_Open_26.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Tiger_and_Earl_Woods_Fort_Bragg_2004.jpg/220px-Tiger_and_Earl_Woods_Fort_Bragg_2004.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Flag_of_Sweden.svg/23px-Flag_of_Sweden.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/TigerWoods1997.jpg/170px-TigerWoods1997.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/TigerWoods2004RyderCup3.jpg/170px-TigerWoods2004RyderCup3.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/US_Navy_040303-N-5319A-001_Tiger_Woods_meets_Commander_Carrier_Group_Eight_%28CCG-8%29_Rear_Adm._Denby_H._Starling_II%2C_on_the_flag_bridge_aboard_the_aircraft_carrier_USS_George_Washington_%28CVN_73%29.jpg/220px-thumbnail.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/TigerWoodsOct2011.jpg/220px-TigerWoodsOct2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Woods_photo_shoot.jpg/170px-Woods_photo_shoot.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Tiger_Woods_in_May_2019.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tiger_Woods", "title": "Tiger Woods", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Tiger_Woods_in_May_2019.jpg/640px-Tiger_Woods_in_May_2019.jpg", "width": 640, "height": 909}, "title": "Tiger Woods - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}