{"url": "https://www.washingtonpost.com/arts-entertainment/2018/11/02/sitcom-wives-have-lazy-husbands-who-dont-deserve-them-now-there-might-be-sitcom-about-that/", "text": "Comment on this story Comment Gift Article Share\n\nIt’s been a little over a year since “Kevin Can Wait” killed off Erinn Hayes’s character after just one season, a very weird move, given that she played a lead character — Donna Gable, Kevin’s wife of 20 years. To add fuel to the fire burning inside upset viewers' hearts, the CBS sitcom replaced Hayes with Leah Remini, Kevin James’s former co-star from “King of Queens.” Ratings took a dip, and the network eventually axed the show in May.\n\nDonna, while a high-profile case, wasn’t the only mistreated wife in sitcom history, and this hasn’t gone unnoticed. AMC Networks announced Friday that it has a project in development called “Kevin Can F*** Himself,” from creator Valerie Armstrong and executive producers Rashida Jones and Will McCormack.\n\nThe series aims to expose “the secret life of a woman we all grew up watching: the sitcom wife,” the network said in a statement. “A beauty paired with a less attractive, dismissive, caveman-like husband who gets to be a jerk because she’s a nag and he’s ‘funny.'\" The show aims to illuminate said secret life by switching between “single-camera realism and multi-camera zaniness.”\n\nAdvertisement\n\nHayes even tweeted about it:\n\nThis project is the second buzzed about this week that directly challenges long-established Hollywood tropes. The first? “Isn’t It Romantic,” an upcoming movie that centers on a cynical woman (Rebel Wilson) who faces her worst nightmare when she gets trapped in a cheesy romantic comedy. (Yes, the same movie Wilson was promoting when she incorrectly claimed to be the “first-ever plus-sized girl” to lead a rom-com.)\n\nAMC opened a writers' room for the sitcom — as well as workplace drama “Rainy Day People” — under its “script-to-series” development model, used for projects with promising pilot scripts.\n\n“Under the approach, AMC foregoes the traditional pilot process and instead opens writers' rooms to develop scripts for several episodes and a detailed look at a potential first season before deciding whether to move to a straight-to-series order,” Deadline reported last year.\n\nAdvertisement\n\nSo while there’s no guarantee “Kevin Can F*** Himself” will make it to the finish line, AMC programming president David Madden did note that the network has had “great experiences” with the creative team behind it. Things are looking up. We (Kevin) Can’t Wait!\n\nRead more:\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/resizer/2CjPNwqvXHPS_2RpuRTKY-p3eVo=/1484x0/www.washingtonpost.com/pb/resources/img/twp-social-share.png"], "top_img": "https://www.washingtonpost.com/resizer/2CjPNwqvXHPS_2RpuRTKY-p3eVo=/1484x0/www.washingtonpost.com/pb/resources/img/twp-social-share.png", "keywords": [], "authors": ["Sonia Rao"], "canonical_link": "https://www.washingtonpost.com/arts-entertainment/2018/11/02/sitcom-wives-have-lazy-husbands-who-dont-deserve-them-now-there-might-be-sitcom-about-that/", "title": "‘Kevin Can Wait’s’ Erinn Hayes was killed off. Now a new show could help sitcom wives take revenge.", "meta_data": {"description": "Rashida Jones is one of the producers behind the new project.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/arts-entertainment/2018/11/02/sitcom-wives-have-lazy-husbands-who-dont-deserve-them-now-there-might-be-sitcom-about-that/", "image": "https://www.washingtonpost.com/resizer/2CjPNwqvXHPS_2RpuRTKY-p3eVo=/1484x0/www.washingtonpost.com/pb/resources/img/twp-social-share.png", "title": "‘Kevin Can Wait’s’ Erinn Hayes was killed off. Now a new show could help sitcom wives take revenge.", "description": "Rashida Jones is one of the producers behind the new project."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "‘Kevin Can Wait’s’ Erinn Hayes was killed off. Now a new show could help sitcom wives take revenge.", "description": "Rashida Jones is one of the producers behind the new project."}, "last_updated_date": "2018-11-02T22:19:42.594Z", "article": {"published_time": "2018-11-02T18:37:28.986Z", "modified_time": "2018-11-02T22:19:42.594Z", "section": "Arts and Entertainment - OLD", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 70, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/arts-entertainment/2018/11/02/sitcom-wives-have-lazy-husbands-who-dont-deserve-them-now-there-might-be-sitcom-about-that/"}, "movies": [], "publish_date": 1541116800.0, "source": "https://www.washingtonpost.com", "summary": ""}