{"url": "https://en.wikipedia.org/wiki/Lady_Antebellum", "text": "American country music group\n\nFor the Seattle-based singer known as Lady A, see Anita White\n\n\"Lady Antebellum\" redirects here. For the group's debut album, see Lady Antebellum (album)\n\nLady A (formerly known as Lady Antebellum[1]) is an American country music group formed in Nashville, Tennessee, in 2006. The group is composed of Hillary Scott (lead and background vocals), Charles Kelley (lead and background vocals, guitar), and Dave Haywood (background vocals, guitar, piano, mandolin). Scott is the daughter of country music singer Linda Davis, and Kelley is the brother of pop singer Josh Kelley. The band abbreviated the name to \"Lady A\" in June 2020 during the George Floyd protests in an attempt to blunt the name's associations with slavery and the Antebellum South, inadvertently causing a dispute with black blues and gospel singer Anita White, who had been using the name Lady A for more than 20 years.\n\nThe group made its debut in 2007 as guest vocalists on Jim Brickman's single \"Never Alone\", before signing to Capitol Nashville. Lady A has released six albums for Capitol: Lady Antebellum, Need You Now, Own the Night, Golden, 747, Heart Break, plus one Christmas album (On This Winter's Night), and one for BMLG Records: Ocean. The first three albums are certified platinum or higher by the Recording Industry Association of America (RIAA). The albums have produced sixteen singles on the Hot Country Songs and Country Airplay charts, of which nine have reached number one. The longest-lasting number one single is \"Need You Now\", which spent five weeks at that position in 2009; both that song and 2011's \"Just a Kiss\" reached number one on the Adult Contemporary charts.\n\nLady A was awarded Top New Duo or Group by the Academy of Country Music and New Artist of the Year by the Country Music Association in 2008. The band was nominated for two Grammy Awards at the 51st Annual Grammy Awards and two more at the 52nd Annual Grammy Awards, winning Best Country Performance by Duo or Group with Vocals for \"I Run to You\". It was awarded Top Vocal Group, Song of the Year (\"Need You Now\"), and Single of the Year (\"Need You Now\") at the 44th ACM Awards on April 18, 2010. It won five awards at the 53rd Annual Grammy Awards, including Song of the Year and Record of the Year for \"Need You Now\".[2] At the 54th Annual Grammy Awards, Lady A won the award for Best Country Album for Own the Night. By August 2013, the group had sold more than 12.5 million digital singles and 10 million albums in the United States.[3][4]\n\nHistory [ edit ]\n\n2006–2007: Formation and early career [ edit ]\n\nThe band was formed as Lady Antebellum in 2006,[5] in Nashville, Tennessee, by Charles Kelley, Dave Haywood, and Hillary Scott. Scott is the daughter of country music singer Linda Davis, best known for her duet vocals on Reba McEntire's 1993 hit \"Does He Love You\",[6] and Charles Kelley is the brother of pop and country artist Josh Kelley.[7] Hillary Scott attended Donelson Christian Academy in Donelson, Tennessee. Kelley moved to Nashville in mid-2005 from Winston-Salem, North Carolina, where he had been working construction with his brother John. Trying to become a successful solo country artist, Kelley convinced his old middle-school classmate, Haywood, to move to Nashville from Georgia in 2006 so they could write music together. Shortly thereafter, Scott recognized Kelley from Myspace, and they started to talk at a Nashville music club. Kelley invited Scott to join him and Haywood in the new group, which assumed the name Lady Antebellum.[8]\n\nOn the BBC Radio 2 Drivetime Show August 9, 2010, the band explained that the name comes from when the group did a photo shoot in historical costumes at antebellum houses. In American history, the Antebellum era was the period in the Southern United States before the Civil War. The trio then began performing at local venues in Nashville before being signed in July 2007 to a recording contract with Capitol Records Nashville. In an interview with Sirius Satellite Radio, Scott said she was rejected from auditions for American Idol twice, not even making it past the first round.[6]\n\n2007–2009: Lady Antebellum [ edit ]\n\nThe band in concert in 2008, showing Charles Kelley and Hillary Scott\n\nShortly after the trio signed to the label, it was chosen by recording artist Jim Brickman to sing on his 2007 single \"Never Alone,\" which reached No. 14 on the Billboard adult contemporary charts. In mid-2007, the group also wrote a song for the MTV reality television series The Hills.[9]\n\nThe solo debut single \"Love Don't Live Here\" was released in September 2007, with a music video for the song following in December.[10][11] This song was the lead-off single to the band's debut album. Released on April 15, 2008, Lady Antebellum was produced by Paul Worley along with Victoria Shaw, a Nashville songwriter and former solo artist.[5] \"Love Don't Live Here\" reached No. 3 on the Billboard Hot Country Songs charts. The album itself was the first album by a new duo or group to debut at Number One on the Billboard Top Country Albums charts.[12]\n\nA second single, \"Lookin' for a Good Time\", was released in June 2008 and peaked at No. 11 in December. In addition, Lady A was signed as an opening act on Martina McBride's Waking Up Laughing Tour in 2008.[13]\n\nThe group also contributed the song \"I Was Here\" to the AT&T Team USA Soundtrack, a song which peaked at No. 24 on the Bubbling Under Hot 100 based on downloads. In December 2008, the rendition of \"Baby, It's Cold Outside\" peaked at No. 3 on the same chart. The band's third official single, \"I Run to You\", was released in January 2009. It eventually became the trio's first Number One in July 2009. On October 7, 2009, their debut album was certified platinum by the RIAA for shipments of one million copies in the United States.\n\nHaywood and Kelley co-wrote labelmate Luke Bryan's 2009 single \"Do I\", on which the group also sings backing vocals.[14] This song is the first single from Bryan's second studio album \"Doin' My Thing\", which was released on October 6, 2009.\n\n2009–2011: Need You Now [ edit ]\n\nIn August 2009, the group released its fourth single, \"Need You Now\", the lead-off single and title track to the second studio album, which was also produced by Worley. It debuted at No. 50 on the Billboard Hot Country Songs chart and became its second number 1 hit on the charts for the week of November 28, 2009. The song also reached No. 2 on the Billboard Hot 100 and topped the Hot Adult Contemporary chart, making it a crossover hit. A second single, \"American Honey\", was released to radio on January 11, 2010, and would become its third No. 1 hit. The third single from the album, \"Our Kind of Love\", was released on May 31, 2010, and went No. 1 in September 2010. The song was notable for being written in collaboration with a non-Nashville songwriter busbee, who at that point had previously written for Katy Perry, Timbaland and Katharine McPhee.[15] The fourth single from this album, \"Hello World\", was officially released on October 4, 2010.\n\nThe album was released on January 26, 2010, and debuted at No. 1 on the Billboard 200 and Top Country Albums charts for the week of February 2, 2010, selling 480,922 copies.[16] Four weeks after the album's release, it was certified platinum by the Recording Industry Association of America.[17] On April 28, 2010, the band performed on the results show of American Idol, performing \"Need You Now\". On September 20, 2010, the band launched their first headlining tour, \"Need You Now 2010\" in Orlando, Florida. On October 28, 2010, they performed the National Anthem before Game 2 at the 2010 World Series. They also appeared on the 44th Annual Country Music Awards on November 10, 2010.[18]\n\n2011–2012: Own the Night and On This Winter's Night [ edit ]\n\nThe week of January 9, 2011, the group began recording the third studio album. In an interview with Entertainment Weekly, Charles Kelley said, \"We actually just went ahead and decided we're gonna take two, two and a half months straight in the studio to create this thing and not have all this distraction. Hopefully that will be a good thing\".[19]\n\nOn May 2, 2011, the group released the first single from its upcoming album, titled \"Just a Kiss\". The group performed the single on stage on American Idol's result show on May 5, 2011. It was a commercial and critical success, debuting and peaking at number 7 on the Billboard Hot 100, making it the band's highest debut on the chart. It also topped the Billboard Hot Country Songs, making it the band's fifth number-one single on the chart. On June 7, 2011, the title of third album was announced, Own the Night, and was released on September 13, 2011.[20] The album cover and track listing was released on July 18, 2011.[21] All together, four singles were released from Own the Night. Follow-up singles were \"We Owned the Night\", \"Dancin' Away with My Heart\", and \"Wanted You More\", which charted moderately in the Hot Country Songs.\n\nLady A released a \"Lady Hazed\" version of Jason Aldean's song \"Dirt Road Anthem\" titled \"Country Club Anthem\" on its installment of Webisode Wednesdays on August 10, 2011.[22] On October 1, 2011, the group performed as the musical guests on Saturday Night Live.[23]\n\nThe group released its first Christmas album On This Winter's Night on October 22, 2012.[24]\n\n2013–2016: Golden, 747, and hiatus [ edit ]\n\nOn January 22, 2013, \"Downtown\", the first single from a new album, was released to country radio. It was made available on iTunes starting February 5, 2013, and reached number one on the Country Airplay chart in April 2013. The new album, Golden, was released on May 7, 2013.[25] The album's second single, \"Goodbye Town\", was released to country radio on May 13, 2013, and peaked at number 11 on the Country Airplay chart. The third single from the Golden era, \"Compass\", was released to the iTunes Store on October 1, 2013, and reached number one on the Country Airplay chart in March 2014. It is one of the new recordings featured on the deluxe edition re-issue of Golden, which was released on November 12, 2013. Unlike all of the band's previous releases, it was produced by Nathan Chapman.[26] They also sang backing vocals on Darius Rucker's 2013 single \"Wagon Wheel\".[27]\n\n\"Bartender\" was released to country radio on May 12, 2014, as the lead single for the group's sixth studio album, and was made available to digital retailers on May 19.[28] In July 2014, the album's title was confirmed as 747, and the track listing was confirmed. Chapman produced this album as well.[29] \"Bartender\" became the group's ninth number 1 hit on the Country Airplay charts in 2014, with \"Freestyle\" as the second single. The third single \"Long Stretch of Love\" was released on February 7, 2015, in the UK and on March 23, to country radio in the US.\n\nThe band recorded two songs, \"I Did With You\" and \"Falling For You\", for the soundtrack of the 2014 romantic drama film The Best of Me.\n\nIn October 2015, while appearing on Good Morning America, the group announced some downtime after the Wheels Up Tour. During the break, Kelley will be working on his solo career. Kelley stated that the group is his priority but he wanted to try working alone. On September 28, 2015, he released his debut solo single, titled \"The Driver\". It features Dierks Bentley and Eric Paslay.[30] On October 12, 2015, Charles Kelley announced his tour dates for his solo tour. He played some Lady A songs, but his tour focused on his solo material.[31] Also during the break, Hillary Scott announced that she and her family (her mother, father, and sister) would work on a gospel album titled Love Remains. The album was released on 29 July.\n\nIn 2016, Lady A was selected as one of 30 artists to perform on \"Forever Country\", a mash-up track of \"Take Me Home, Country Roads\", \"On the Road Again\", and \"I Will Always Love You\" which celebrates 50 years of the CMA Awards.[32]\n\n2017–2018: Heart Break and label change [ edit ]\n\nOn January 19, 2017, \"You Look Good\" was released as the lead single on the upcoming seventh studio album Heart Break. It released on June 9, 2017, and is further promoted with the \"You Look Good World Tour\", which began on May 26 and ended on October 15, 2017.[33] The titular track was released as the second single on September 25, 2017. Heart Break was nominated for Best Country Album, and \"You Look Good\" was nominated for Best Country Duo/Group Performance at the 60th Annual Grammy Awards. The band co-headlined the Summer Plays On Tour with Darius Rucker starting in mid-2018.\n\nIn August 2018, the group ended its recording contract with Capitol Nashville and signed with Big Machine Records.[34]\n\n2019–present: Las Vegas residency, Ocean, and What a Song Can Do [ edit ]\n\nOn October 24, 2018, the band announced that it would be headlining a residency at the Palms Casino Resort's Pearl Concert Theater in Las Vegas in 2019. The fifteen date Our Kind of Vegas residency began in February 2019.[35]\n\nIn March 2019, the band headlined the C2C: Country to Country festival in London and Dublin for the second time (having previously headlined in 2015) and for the first time in Glasgow. At the London show on March 9, the band announced new music and performed two new songs, \"What If I Never Get Over You\" and \"Be Patient With My Love\".\n\nThe first single on Big Machine, \"What If I Never Get Over You\", was released on May 17, 2019, along with the music video.[36] The second single, \"Pictures\", was released on August 9, 2019. The eighth studio album Ocean was released on November 15, 2019. On September 20, 2019, the title track was released. \"Boots\" was released on October 11, 2019. The song \"What I'm Leaving For\" was also released ahead of the album on October 25, 2019. The album features a collaboration with Little Big Town.[37][38]\n\nThe trio appeared on NBC's Songland and released the song \"Champagne Night\" on April 13, 2020.[39]\n\nOn January 21, 2021, the group became members of the Grand Ole Opry after being invited by Darius Rucker.[40] On March 12, the band released the single \"Like a Lady\" and on October 22, their ninth studio album What a Song Can Do was released.\n\nOn August 4, 2022, the group announced that it would postpone their upcoming tour to support Kelley's sobriety.[41]\n\nName controversy [ edit ]\n\nThe band members have always said that the band's name was chosen arbitrarily, complaining about the difficulty of choosing a name. Inspired by the \"country\" style nostalgia of a photo shoot at a mansion from the Antebellum South, they said, \"one of us said the word and we all kind of stopped and said, man, that could be a name\"[42] and \"Man that's a beautiful Antebellum house, and that's cool, maybe there's a haunted ghost or something in there like Lady Antebellum.\"[43] Haywood concluded, \"[We] had a lady in the group, obviously, and threw Lady in the front of it for no reason. I wish we had a great resounding story to remember for the name, but it stuck ever since.\"[42] The name was always controversial, with a critic in Ms. Magazine writing in 2011 that the band's name \"seems to me an example of the way we still — nearly 150 years after the end of the Civil War, nearly 50 years after the Civil Rights Act; and in a supposedly post-racial country led by a biracial president — glorify a culture that was based on the violent oppression of people of color\".[43] [44]\n\nOn June 11, 2020, joining widespread commercial response to the George Floyd protests,[43] the band announced it would abbreviate its name to its existing nickname \"Lady A\"[45] in an attempt to blunt the name's racist connotations.[1] The band members stated on social media that, never having previously sought the dictionary definition of the word \"antebellum\", they now consulted their \"closest black friends and colleagues\" so that their \"eyes opened wide to the injustices, inequality and biases black women and men have always faced and continue to face every day. Now, blind spots we didn't even know existed have been revealed.\"[46] Fan response was mixed, with many decrying virtue signaling or even disparaging the protests.[43] American Songwriter said, \"Given that the world knows what that A stands for, to many this change does little more than add extra insult to this ongoing injury.\"[47]\n\nThe next day, it was widely reported that the name \"Lady A\" had already been in use for more than 20 years by Seattle-based African American activist and blues, soul, funk, and gospel singer Anita White. The band again admitted ignorance of any prior use, which White called \"pure privilege\". Interviewed by Rolling Stone, White described the band's token acknowledgement of racism while blithely appropriating an African American artist's name: \"They're using the name because of a Black Lives Matter incident that, for them, is just a moment in time. If it mattered, it would have mattered to them before. It shouldn't have taken George Floyd to die for them to realize that their name had a slave reference to it. It's an opportunity for them to pretend they're not racist\". A veteran music industry lawyer observed that such name clashes are uncommon due to the existence of the Internet.[48][49] The band members contacted White the next week to apologize for having inadvertently co-opted and dominated her name,[50] saying that the Black Lives Matter movement had inspired them to a collaborative attitude. They nonetheless required retaining the same name, though she believed dual-naming is inherently impossible.[51] She said \"We talked about attempting to co-exist but didn't discuss what that would look like\"[50] because the band members would not directly respond to that explicit question three times during the conversation or in two contract drafts. She soon submitted a counteroffer that either the band would be renamed, or that her act would be renamed for a $5 million fee plus a $5 million donation to be split between Seattle charities, a nationwide legal defense fund for independent artists, and Black Lives Matter.[51]\n\nOn July 8, 2020, the band filed a lawsuit against White, asking a Nashville court to affirm its longstanding trademark of the name. The press release read: \"Today we are sad to share that our sincere hope to join together with Anita White in unity and common purpose has ended. She and her team have demanded a $10 million payment, so reluctantly we have come to the conclusion that we need to ask a court to affirm our right to continue to use the name Lady A, a trademark we have held for many years.\"[52]\n\nOn September 15, 2020, White filed a counter-suit asserting her claim to the Lady A trademark and rejecting the notion that both artists could operate in the same industry under the same brand identity. She is seeking damages for lost sales and a weakened brand, along with royalties from any income the band receives under the Lady A moniker.[53][54]\n\nIn October 2021, musician Lilli Lewis's album Americana was temporarily blocked and held for review by the streaming-service Spotify because one of the songs on the album, \"A Healing Inside\", credited White as \"Lady A\". The album was returned to the streaming within a week of Lewis becoming aware of the situation.[55][56]\n\nIn February 2022, Pitchfork reported that White and the band have settled their lawsuit; \"the parties filed a joint request for dismissal to a judge in a federal Tennessee court\" and the \"terms of the settlement have not been disclosed\".[57][58]\n\nCharity [ edit ]\n\nSince January 2012, Lady A has been partnered with the charity myLIFEspeaks, to raise awareness of and provide facilities for disabled orphans in Haiti. At the start of the year 2013, the members of the group also created the fund called LadyAID, which was created in hopes of bringing awareness to children who suffer and cannot help themselves locally, nationally and around the world. The main focus of LadyAID is the children in hospitals, mainly in the United States and Canada.[59][60]\n\nAwards and nominations [ edit ]\n\nLady A in April 2010\n\nSince Lady A won the Country Music Association Awards New Artist of the Year award in 2008, it has accumulated seven more awards, including its first Grammy in 2010 for Best Country Performance by Duo or Group with Vocals. At the 2009 CMAs, the group ended Rascal Flatts' six-year reign as Vocal Group of the Year. At the 2010 CMAs, the group became the first artist in CMA Award history to receive the Single of the Year honor for two consecutive years.[61]\n\nAt the 53rd Annual Grammy Awards, the trio won the Song of the Year.[62] It won Top Vocal Group at the 2012 ACM Awards April 1, 2012.[63]\n\nIn addition to being honored, Lady A has made efforts to recognize veterans who have returned from service and contributed to their communities. In 2013, Lady A recognized eight deserving military families for their service by inviting them to up close and personal concerts, and acknowledging them from the stage.[64]\n\nDiscography [ edit ]\n\nTours and residencies [ edit ]\n\nFilmography [ edit ]\n\nTelevision [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Lady_Antebellum_2008.jpg/220px-Lady_Antebellum_2008.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Lady_A_-_Charlotte_12-27-12-39.jpg/1200px-Lady_A_-_Charlotte_12-27-12-39.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/LadyAntebellumAwardsApr10.jpg/220px-LadyAntebellumAwardsApr10.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Lady_A_-_Charlotte_12-27-12-39.jpg/300px-Lady_A_-_Charlotte_12-27-12-39.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Lady_A_-_Charlotte_12-27-12-39.jpg/1200px-Lady_A_-_Charlotte_12-27-12-39.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lady_A", "title": "Wikipedia", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Lady_A_-_Charlotte_12-27-12-39.jpg/640px-Lady_A_-_Charlotte_12-27-12-39.jpg", "width": 640, "height": 427}, "title": "Lady A - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}