{"url": "https://www.cnn.com/2018/06/21/entertainment/chloe-dykstra-chris-hardwick-statement/index.html", "text": "Story highlights Dykstra tweeted a statement on Wednesday She thanked fans for their support\n\nCNN —\n\nChloe Dykstra is speaking out after her ex-boyfriend, TV host Chris Hardwick, denied allegations he sexually and emotionally abused her.\n\n“The outpouring of support and love I’ve received over the past few days has been incredible and unexpected,” Dykstra wrote in a tweet on Wednesday.\n\nThank you all, from the bottom of my heart. pic.twitter.com/giXmp2wb9V — Chloe Dykstra (@skydart) June 20, 2018\n\n“After years of therapy and rebuilding your support has done so much for me than all of it combined,” she added.\n\nDykstra, 29, recently posted an essay on Medium in which she described an almost three-year relationship with an older celebrity who she said imposed strict rules on her behavior.\n\nWithout naming him, she alleged that the man forbid her to have male friends, to speak in public or to go out at night without him – and that she “let him sexually assault me” on multiple occasions. “Every night, I laid there for him, occasionally in tears,” she wrote.\n\nThe actress described him as someone who “grew from a mildly successful podcaster to a powerhouse CEO of his own company.” She also said he blacklisted her in the industry.\n\nFans pieced together the details and quickly figured out that she was talking about Hardwick, 46.\n\nAMC suspends Chris Hardwick talk show after ex-girlfriend makes allegations of abuse\n\nIn a statement, Hardwick, who dated Dykstra from 2011 to 2014, said their relationship was “not perfect – we were ultimately not a good match,” but he denied ever sexually assaulting her.\n\n“I’m devastated to read that she is now accusing me of conduct that did not occur,” he said. “l was blindsided by her post and always wanted the best for her. As a husband, a son, and future father, I do not condone any kind of mistreatment of women.”\n\nThe fallout was swift for Hardwick, who has hosted several aftershows to popular AMC series, including “Talking Dead” (about “The Walking Dead”), “Talking Bad” (about “Breaking Bad”) and “Talking Saul” (about “Better Call Saul”).\n\nAMC announced it had suspended his show, “Talking with Chris Hardwick,” while it assesses the accusations against him and said Hardwick would step aside from moderating AMC and BBC America panels at Comic-Con International in San Diego next month.\n\nDykstra said in her statement that going public has opened her eyes and she is hopeful it will help others.\n\n“It is my hope, and it always was, that women and men on both sides of abuse will make changes to either protect themselves or to stop the cycle of pain their own behavior can cause. These behaviors are insidious and often hard to spot,” she wrote. “We make excuses for them and, bit by bit, we can lose ourselves entirely.”\n\nCNN has reached out to Hardwick’s representatives for comment on this story.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/140929104601-lisa-france-profile-image.jpg?q=x_2,y_0,h_898,w_1596,c_crop/h_270,w_480/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/180617115804-chris-hardwick-chloe-dykstra.jpg?q=x_3,y_146,h_1841,w_3273,c_crop/w_800"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/180617115804-chris-hardwick-chloe-dykstra.jpg?q=x_3,y_146,h_1841,w_3273,c_crop/w_800", "keywords": [], "authors": ["Lisa Respers France"], "canonical_link": "https://www.cnn.com/2018/06/21/entertainment/chloe-dykstra-chris-hardwick-statement/index.html", "title": "Chloe Dykstra speaks out after Chris Hardwick denial", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Chloe Dykstra speaks out after Chris Hardwick denial | CNN", "description": "Chloe Dykstra is speaking out after her ex-boyfriend, TV host Chris Hardwick, denied allegations he sexually and emotionally abused her.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180617115804-chris-hardwick-chloe-dykstra.jpg?q=x_3,y_146,h_1841,w_3273,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2018/06/21/entertainment/chloe-dykstra-chris-hardwick-statement/index.html", "site_name": "CNN"}, "twitter": {"title": "Chloe Dykstra speaks out after Chris Hardwick denial | CNN", "description": "Chloe Dykstra is speaking out after her ex-boyfriend, TV host Chris Hardwick, denied allegations he sexually and emotionally abused her.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180617115804-chris-hardwick-chloe-dykstra.jpg?q=x_3,y_146,h_1841,w_3273,c_crop/w_800", "card": "summary_large_image", "site": "@CNNent"}, "description": "Chloe Dykstra is speaking out after her ex-boyfriend, TV host Chris Hardwick, denied allegations he sexually and emotionally abused her.", "template_type": "article_leaf", "type": "article", "meta-section": "entertainment", "theme": "entertainment", "article": {"published_time": "2018-06-21T18:16:21Z", "modified_time": "2018-06-21T18:16:21Z", "tag": "crime, law enforcement and corrections, crimes against persons, criminal offenses, sex and gender issues, sex crimes, sexual assault, society", "publisher": "https://www.facebook.com/CNN"}, "keywords": "crime, law enforcement and corrections, crimes against persons, criminal offenses, sex and gender issues, sex crimes, sexual assault, society", "author": "Lisa Respers France", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1529535600.0, "source": "https://www.cnn.com", "summary": ""}