{"url": "https://www.cinemablend.com/television/2457472/american-horror-story-apocalypse-premiere---all-the-freakiest-and-funniest-moments", "text": "Major spoilers below for anyone who hasn't yet watched the American Horror Story: Apocalypse premiere.\n\nAs it went with the found-footage-esque Roanoke season, American Horror Story: Apocalypse kept fans guessing about everything from the plot line to the timelines to the crossover element between Murder House and Coven, and everything else slithering between the cracks. The premiere episode, \"The End,\" certainly didn't answer every single question, and possibly created even more than fans might have started off with, but at least we finally know how it all starts: with an apocalypse and a bunch of people who probably aren't worthy of survival.\n\nWhile any major bewitching crossover moments were limited, the premiere still had all the classic trademarks of an American Horror Story opener: big stars, big laughs, big shocks, and some disturbing moments you'd only want to watch between a dead person's fingers. (I assume that would be a highly questionable form of aversion therapy.) So without further a-don't, let's hunker down with some of the best moments from American Horror Story: Apocalypse's season premiere.\n\nCold-Pressed Poison: \"Are you trying to fucking poison me? This tastes like turtle shit. You're supposed to be my personal assistant, Mallory. Do you even know me?\" In less time than it takes someone to show anything approval on social media, Leslie Grossman's alpha-snob Coco St. Pierre Vanderbilt proves her boundless lack of empathy with this brilliant reaction to a rancid-tasting beverage. She can influence people, but not her own taste buds.\n\nA Dismaying Message From Coco's Father: Coco's absurd cruelty is cut short by her father's sobering message confirming the nuclear attacks sending the planet back into pre-civilization. Why he paid so much money to put Coco on a plane that wasn't rigged to explode, I'm not sure. But his showed more compassion on that phone screen, alongside his wife and son, than we're likely going to see from his daughter throughout the season. Unless there's a sect out there that sees any positives in \"turtle shit\" comparisons.\n\nThat Reporter's Final Words: Similar to Coco's father, the news anchor's announcement was not only played for further exposition, but also to introduce the catastrophic chaos spanning the globe, thanks to the final acts for many a nuclear ICBM. As heartbreaking as it was to hear his last words as a loving father, more intriguing for plot purposes was the way he said, \"This is it, ladies and gentlemen. I can't believe we actually did it.\" Who's the \"we\" there, and what was done? The fact that the episode plays that same newscaster's speech during two different scenes no doubt makes it all the more important.\n\nCoco Lacks Some Worth: \"Mallory, you know I'm worthless without you. I'm worse than Elton John. I don't even know how to work a dishwasher or open a door.\" When I laughed at this line, part of it was because I could easily picture Coco getting cripplingly flummoxed by a deadbolt.\n\nThe Public's Reactions To The News: There will always be something so deeply haunting about watching mass groups of people that are guided by nothing but panic and self-preservation. Or even a distinct non-preservation, as was the case with the guy who took his own life before the bombs could do it. If I was anyone on that plane before it took off, I would have spent many of those following months troubled by the sights of all those desperate people getting shot as they descended upon the plane. Something very \"Titanic life boat scene\" happening there, just without the snazzy tunes.\n\nThe Entirety Of Joan Collins' Evie Gallant: Shame on anyone who didn't anticipate pure television gold as soon as Joan Collins was announced as the latest icon to join American Horror Story's ranks. I dare say her professionally affluent Evie Gallant was the best part of the episode each and every time she got a line, as they all hit. \"You know I pay you for ten hours a day.\" \"Let's have some burnt champagne!\" \"No stewardess? Oh, I guess I won't be ordering the fresh cut fruit.\" And even though her grandson is just like her in most respects, Evan Peters' character rubs me in all the opposite ways, but that can change. Let's bring Evie back in time and make her one of Cult's leaders, if that's possible.\n\nThe Breakup: Last season, Leslie Grossman and Billy Eichner played a monstrous couple whose marriage was built on both legal and emotional shams. This season, their characters' courtship lasted all of a phone conversation, when it became clear Coco wasn't keeping the private plane around for Brock, who was stuck in the deadlocked traffic. It's unclear if he'll return in the season somehow, since he was probably a goner without any interference from The Cooperative, but if he is indeed gone for good in Apocalypse, he got to leave on the best final lines: \"No, no, no, Coco! Do not fucking leave me in Santa Monica!\" and \"You bitch!\"\n\nThe Opening Titles: As it usually goes with a season of American Horror Story, the Apocalypse opening titles were chock full of bizarre visuals laid over a super buzzed-out version of the theme song. The explosive symbolism is there in full, usually in the form of mushroom clouds and the like, though the melting candles also represent a much slower form of extinguishment. Beyond some creepy crawlies like scorpions and babies with glowing eyes, the rest of the iconography was mostly religious in nature. Lots of devils and snakes and angel statues and whatnot, all presumably tying into the almighty anti-Father that pops up in the closing minutes.\n\nTimothy's Selection Process: Whenever agents suddenly bullied their way into the Campbell family household to announce the genetic superiority of Kyle Allen's Timothy, it seemed like their motivations would have been based on some dead-to-rights information that absolutely confirmed he was mankind's biological savior. Instead, it's amusingly tossed out there that they discovered Timothy's genetic prowess because he'd signed up for an ancestry-tracking website. Perhaps another way to keep the survivors tied to the digital realm of their former lives. But was there something to Timothy's dad being so willing to let his son go, despite not having any real reason to trust those people?\n\nThe Outside World: While many post-apocalyptic dramas and horrors spend a lot of time in the outside world in searches of shelter and sustenance, American Horror Story: Apocalypse is currently trapped indoors due to the surface being contaminated by nuclear radiation. Which gives the exteriors their own very special aesthetic that's full of smoke and smog, with a Terry Gilliam and Ben Wheatley feel to the way those scenes are shot and framed. Of course, the abject violence and unconquerable disease and the rest certainly squash the hopes of seeing African swallows carrying coconuts around, so it's the life of a hermit for everyone.\n\nHead to the next page to see all the other hilariously bizarre moments from the horror anthology's premiere.\n\nMs. Venable's Rules: \"I'm Wilhemena Venable. Welcome to Outpost 3.\" Perhaps more celebratory than directly freaky or hilarious, Sarah Paulson's introduction as Ms. Venable was filled with well-delivered exposition that enjoyably teetered on ridiculous, detailing the mysterious overlord organization the Cooperation, which is all about keeping people within class systems. As she's walking around by candlelight, which draws the eyes away from possible atrocities happening all around them, and her set of house rules is kinda freaky, telling them to only refer to her as Ms. Venable, and that they cannot go outside or have sex without full authorization. But they'd better show up when they're called for work or a mean, since there are \"no excuse for tardiness when there's nothing else to do.\" That's a mic drop of a statement there.\n\nThe Pigeon Flies No More: This is perhaps the best slice of dialogue from the entire episode.\n\nCoco: 'Wait, a pigeon? Can we eat it?'Miriam: 'It was contaminated by the fallout.'Evie: 'Can we boil it?'\n\nStu, Poor Stu: The future small-consolation Stu wasn't the only one to get falsely accused of being contaminated within the Outpost and then forced to endure painful skin-tearing scrubbings, but he was the only one who got shot in the head. And the only one to very likely get cooked down into a stew that beat the culinary pants off of the enjoyment-free vita-cubes that everyone has been eating. \"Tell me this doesn't look like a finger. Oh, Jesus Christ. This stew is Stu!\" I want to see every single video take of Jeffrey Bowyer-Chapman performed that line, and I hope they number in the dozens, as I'm sure they were absolutely divine. Evie would agree.\n\nDeceit At Outpost 3: Ms. Venable and Miriam plotted Stu's death by nefarious means, which fits along with their own former lives before the bombs dropped, and it's quite unnerving to hear Sarah Paulson say that watching their terrorized faces gives her a \"tingle\" We're dealing with pure sadists here on top of them merely being power-abusing leaders. Sure, it was a smart move to save on some food in the long run, but not so much if everyone just gets to live naturally.\n\nThat Time Jump, Though: The concept of the Outpost's endlessly repeating song stopping and getting replaced by another ditty felt right out of some other show's enigma-strewn narrative, and I was excited by the potential for mystery elements to get introduced. American Horror Story: Apocalypse immediately subverted that expectation, though, dashing anyone's newly founded hopes by jumping ahead 18 months, with Maureen McGovern's \"The Morning After\" still playing. At that point, it's surprising that no one else in the browbeaten group chose to end their journeys early somehow.\n\nSay Hello To The Antichrist: What better way to end a premiere than with a literal nuclear winter punctuated by the bastard child of a human and a ghost whose arrival was destined to bring the end of days? As much as Ms. Venable appears to have been inspired by Gary Oldman's titular beast in Bram Stoker's Dracula, _Cody Fern's adult Michael Langdon looks like a well-presented groupie for Tom Cruise's Lestat inInterview with the Vampire, by way of Jessica Lange's Constance, his grandmother. While we don't get to see much of him, he teases an increasingly diminished outside world, and could very well become another fabulous presence making _Apocalypse as scrumptiously evil as the FX series can be. At least, for everyone but the horses. (Fun fact: the premiere was directed by Bradly Buecker, who often directs episodes of shows from Ryan Murphy and Brad Falchuk's stable, which is fitting, since he also directed the Season 1 finale, which introduced Michael in its final minutes.)\n\nNo More Breakfasts: Perhaps this is anticlimactic to some, but what could possibly sound freakier than a world without breakfast? I mean, Outpost 3 isn't a haven full of waffles or fried eggs or anything, but it's the principle.\n\nDid you guys have as much fun as I did with American Horror Story: Apocalypse? Let us know, and stay tuned for new episodes on FX every Wednesday night at 10:00 p.m. ET. And while waiting to see who else shows up after the planet's downfall, head to our fall TV premiere schedule for a look at all the new and returning shows popping up soon.", "images": ["https://www.cinemablend.com/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/dDRiZMuZXQUWSTrW5FapH7-1200-80.png", "https://vanilla.futurecdn.net/cinemablend/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/dDRiZMuZXQUWSTrW5FapH7-320-80.png"], "top_img": "https://cdn.mos.cms.futurecdn.net/dDRiZMuZXQUWSTrW5FapH7-1200-80.png", "keywords": [], "authors": ["Nick Venable", "Assistant Managing Editor", "Window.Slicecomponents", "Window.Reliabledomcontentloaded.Then", "Var Componentcontainer", "Document.Queryselector", "Slice-Container-Authorbio", "If Componentcontainer", "Var Data", "Layout"], "canonical_link": "https://www.cinemablend.com/television/2457472/american-horror-story-apocalypse-premiere---all-the-freakiest-and-funniest-moments", "title": "American Horror Story: Apocalypse Premiere - All The Freakiest And Funniest Moments", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2018-09-13T14:09:51+00:00", "description": "It's that time of year again, when FX kicks off another season of catty horror with American Horror Story: Apocalypse.", "robots": "max-image-preview:large", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://cdn.mos.cms.futurecdn.net/flexiimages/tbhqzd9bso1619422461.png", "og": {"site_name": "CINEMABLEND", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/dDRiZMuZXQUWSTrW5FapH7-1200-80.png", "width": 1200}, "type": "article", "title": "American Horror Story: Apocalypse Premiere - All The Freakiest And Funniest Moments", "url": "https://www.cinemablend.com/television/2457472/american-horror-story-apocalypse-premiere---all-the-freakiest-and-funniest-moments"}, "article": {"publisher": "https://www.facebook.com/cinemablendnews/", "published_time": "2018-09-13T14:09:51Z", "modified_time": "2018-09-13T14:09:51Z"}, "parsely-type": "post", "parsely-post-id": "ukWjEsthnQdo5cd4dgNmY2", "parsely-pub-date": "2018-09-13T14:09:51Z", "parsely-title": "American Horror Story: Apocalypse Premiere - All The Freakiest And Funniest Moments", "parsely-link": "https://www.cinemablend.com/television/2457472/american-horror-story-apocalypse-premiere---all-the-freakiest-and-funniest-moments", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/dDRiZMuZXQUWSTrW5FapH7.png", "parsely-section": "Television", "parsely-tags": "Category: Television,Category: News,american horror story,FX,american horror story apocalypse,serversidehawk", "parsely-author": "Nick Venable", "twitter": {"card": "summary_large_image", "site": "@cinemablend", "title": "American Horror Story: Apocalypse Premiere - All The Freakiest And Funniest Moments", "creator": "@cinemablend", "image": "https://cdn.mos.cms.futurecdn.net/dDRiZMuZXQUWSTrW5FapH7-1200-80.png", "account_id": 9696142}, "google-site-verification": "Oo3uNFWgI6psN58Pjx7Zjo3yYih1rOwQViWbItBCpyo", "taboola": {"url": "https://www.cinemablend.com/television/2457472/american-horror-story-apocalypse-premiere---all-the-freakiest-and-funniest-moments"}, "botify-site-verification": "2pzcQZFibLjk9GJgSZgweA8MU9al6utA", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E"}, "movies": [], "publish_date": 1536847791.0, "source": "https://www.cinemablend.com", "summary": ""}