{"url": "https://www.grammy.com/grammys/news/2018-latin-grammy-awards-complete-winners-list", "text": "(On Jan. 21 President Barack Obama will be inaugurated into his second term as president of the United States with a celebration in Washington, D.C., featuring performances by GRAMMY winners Beyoncé, Alicia Keys, Kelly Clarkson, Brad Paisley, Usher, and Stevie Wonder, among others. This feature is taken from the fall 2012 issue of GRAMMY magazine and offers a brief history of notable musical performances at past presidential inaugurations.)\n\nBeing elected the leader of the free world is a pretty good reason to strike up the band. Ever since George Washington first danced a celebratory minuet after his inauguration in 1789, music has played an ever-increasing role in the gala events surrounding presidential inaugurations.\n\n\n\nIn 1801 Thomas Jefferson had the U.S. Marines band play him along as he made his way from the Capitol to the White House after taking the oath of office. James and Dolley Madison threw the first official inaugural ball in 1809. Jumping to the 20th century, in 1977 Jimmy Carter invited such music luminaries as John Lennon and Yoko Ono to his inaugural ball and allowed rock and roll — or at least the Southern rock variety — to become a part of his inauguration backdrop when he invited the Marshall Tucker Band and the Charlie Daniels Band to share a concert bill with Guy Lombardo And His Royal Canadians. (Lombardo's group was something of an inauguration ball house band, having played for seven presidents.)\n\n\n\nToday, inaugurations are presented as both massive public live events and televised productions, complete with a concert featuring a roster of star talent. The musical performances at inaugurations not only provide entertainment, they also help set the tone for a new presidency and bring the country together in a unifying moment of patriotism over partisanship.\n\n\n\n\"It wasn't about one side or the other. We just had this overwhelming feeling of being proud to be American,\" recalls Ronnie Dunn, formerly of the GRAMMY-winning duo Brooks & Dunn. He and then-partner Kix Brooks performed their hit \"Only In America\" at a concert as part of George W. Bush's first inauguration in 2001.\n\n\n\n\"Right away you could feel it was an emotionally charged crowd, and when you're standing on the steps of the Lincoln Memorial looking across to the Washington Monument, you can't help but tear up a little,\" says Brooks. \"I remember there was this chaos during the big encore when all the musicians and all the presidential VIPs were onstage together. I turned around and there's Colin Powell shaking my hand. It turned into one of the wildest photo ops ever because all the music people and all the political people were pulling their cameras out to take pictures of each other.\"\n\n\n\nOne of the most memorable unions of political and musical star power at an inaugural gala occurred in 1993, when a reunited Fleetwood Mac performed \"Don't Stop,\" a hit from their GRAMMY-winning album Rumours, for President-elect Bill Clinton. Clinton had used \"Don't Stop\" as the theme song to his presidential campaign, but the payoff live performance almost didn't happen.\n\n\n\n\"At that point we were as broken up as we'd ever been,\" says Stevie Nicks. \"When our management received the request for us to play, they said, 'No.' I heard about that and thought to myself, 'I don't want to be 90, looking back and trying to remember why my group couldn't play the president's favorite song for him.' I told management to let me handle it.\"\n\n\n\nNicks successfully coaxed her bandmates into a one-night, one-song reunion, a performance she remembers as truly exceptional.\n\n\n\n\"For one thing we'd never seen security like that,\" she says. \"The Secret Service makes rock and roll security feel like a bunch of grade school hall monitors. But the performance felt really important. It felt like we were a part of history, and that the song itself was becoming a piece of American history. It was a fantastic night in all of our lives, and I'm really glad the band was able to come together for that one.\"\n\n\n\nThe Beach Boys played Ronald Reagan's second inauguration after a somewhat confused relationship with the White House. The band had headlined a series of Fourth of July concerts at the National Mall until 1983, when U.S. Secretary of the Interior James Watt accused the group of attracting \"the wrong element\" and booked Wayne Newton in their place. Watt later apologized, and the Beach Boys were reinstated and invited to play Reagan's inaugural gala in 1985.\n\n\n\n\"What I remember most about that night is that I got to meet Elizabeth Taylor,\" says Jerry Schilling, the band's then-manager. \"But I also remember being extremely proud of the group. Things had been hard for Brian [Wilson], and the group wasn't always getting along. But they stood there together in front of the president and sang perfect five-part a capella harmony on 'Their Hearts Were Full Of Spring.' It was a big moment — we all felt that. It wasn't just another gig. The guys were truly honored to be there and they brought it when it mattered.\"\n\n\n\nA new musical standard for inaugural events may have been established in 2009 when Barack Obama's presidency was kicked off with the \"We Are One\" concert. The patriotic spectacular featured a who's who of performers ranging from Pete Seeger, Bruce Springsteen and U2 to Usher, Sheryl Crow and will.i.am. An all-star lineup usually adds an all-star production element, but this particular concert was unique.\n\n\n\n\"Dealing with top artists, there's usually a lot of negotiating,\" says Don Mischer, one of the concert's producers, whose list of credits also includes Super Bowl halftime shows and Olympics ceremonies. \"Who needs a private jet? How much does their 'glam squad' cost? What kind of security do they need? Putting together 'We Are One,' we said to every artist, 'This is a historical moment we'd love for you to be a part of, but you have to pay your own way and take care of your own security.' Right away, people like Beyoncé and Bono and Springsteen and Stevie Wonder all said, 'Yes.' They wanted to be there. There was a true camaraderie right from the start, and it turned out to be one of the greatest experiences any of us have ever had.\"\n\n\n\nWhile Washington's minuet may have simply been a matter of dancing, Mischer says music has become as powerful a symbol of America as any other part of Inauguration Day.\n\n\n\n\"When you bring the music and the significance of an event like this together, it really reflects the strength of our cultural diversity and the strength of our country,\" he says. \"In fact, at times when we seem to be going through confrontational political campaigns, I wish we would listen to the music a little more.\"\n\n\n\n(Chuck Crisafulli is an L.A.-based journalist and author whose most recent works include Go To Hell: A Heated History Of The Underworld, Me And A Guy Named Elvis and Elvis: My Best Man.)", "images": ["https://cdn.media.amplience.net/i/naras/grammy_award_logo.webp?w=175", "https://naras.a.bigcontent.io/v1/static/facebook-icon", "https://i8.amplience.net/i/naras/rosalia_2019_1126962091.jpg.jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/twitter-icon", "https://naras.a.bigcontent.io/v1/static/youtube-icon", "https://cdn.media.amplience.net/i/naras/RA_Logo_black", "https://naras.a.bigcontent.io/v1/static/search", "https://naras.a.bigcontent.io/v1/static/2022-grammy-nominations-livestream-backgroundimage.jpg", "https://naras.a.bigcontent.io/v1/static/2022-new-membership-class-recording-academy-announcement-updated", "https://naras.a.bigcontent.io/v1/static/instagram-icon", "https://i8.amplience.net/i/naras/gettyimages-1062036782.jpg.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/gettyimages-487991758.jpg.jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/grammys_setup-4434.jpg", "https://naras.a.bigcontent.io/v1/static/connected"], "top_img": "https://i8.amplience.net/i/naras/gettyimages-1062036782.jpg.jpg?w=821&sm=c", "keywords": [], "authors": [], "canonical_link": "https://www.grammy.com/news/2018-latin-grammy-awards-complete-winners-list", "title": "The Grammys", "meta_data": {"viewport": "width=device-width", "robots": "index,follow", "googlebot": "index,follow", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "twitter": {"card": "summary_large_image", "site": {"identifier": "@RecordingAcad", "id": 17243213}, "url": "https://www.grammy.com/news/2018-latin-grammy-awards-complete-winners-list"}, "og": {"title": "2018 Latin GRAMMY Awards Complete Winners List", "description": "Find out who won at the 19th Latin GRAMMY Awards in Las Vegas", "url": "https://www.grammy.com/news/2018-latin-grammy-awards-complete-winners-list", "type": "article", "image": {"identifier": "https://i8.amplience.net/i/naras/gettyimages-1062036782.jpg.jpg?w=821&sm=c", "alt": "Rosalía", "width": 1200, "height": 630, "type": "image/jpeg"}}, "bingbot": "index,follow", "keywords": "undefined, grammy news, GRAMMY.com", "next-head-count": 24}, "movies": [], "publish_date": null, "source": "https://www.grammy.com", "summary": ""}