{"url": "https://www.celebritynetworth.com/richest-celebrities/models/miranda-kerr-net-worth/", "text": "What is Miranda Kerr's Net Worth?\n\nMiranda Kerr is an Australian model who has a net worth of $60 million. Kerr rose to fame as one of the Victoria's Secret Angels. Today she is also notable for being in a relationship with billionaire Snapchat founder Evan Spiegel. She has two children with Spiegel and one child with actor Orlando Bloom.\n\nEarly Life\n\nMiranda Kerr was born in Sydney, Australia, on April 20, 1983. The daughter of Therese and John Kerr, she spent most of her childhood in Gunnedah, New South Wales along with her younger brother Matthew. The family moved to Brisbane in order to experience city life as opposed to the countryside. When she was 13 years old, Kerr won the \"Dolly\" and Impulse model competition in 1997. She signed with Chic Management and appeared in beachwear ads for Billabong. She graduated from All Hallows' School in 2000 and studied nutrition and psychology before pursuing a career in modeling. Kerr later moved to New York and signed with NEXT Model Management.\n\nEarly Career\n\nShe went on to appear in print and on runways for dozens of international brands, including Baby Phat, Levi's, L.A.M.B., Betsey Johnson, Neiman Marcus, and Roberto Cavalli. Kerr was named ambassador of Seafolly, a swimwear brand, in 2001. She scored ads in a variety of magazines, including \"Harper's Bazaar\" and \"Elle\". In 2004, Miranda had multiple runway appearances and was booked for Elle and Harper's Bazaar. Kerr also appeared in the pages of \"Vogue\" in her native country. She modeled on the season finale of \"Project Runway\" in 2006 for contestant Daniel Vosovic's collection and soon became the face of Maybelline New York cosmetics. Kerr, along with other fellow Next agency models, was featured in a music video for Kanye West and Pharrell for their single \"Number One.\"\n\nVictoria's Secret and Success\n\nIn 2007, she landed a job with Victoria's Secret, taking over for Gisele Bundchen and becoming the first Australian woman to be a VS Angel. Kerr's popularity continued to rise as she appeared in the televised Victoria's Secret Fashion Show in 2006, 2007, 2008, and 2009. Following her success from Victoria's Secret fame, Kerr made a small guest appearance on CBS's \"How I Met Your Mother.\" In 2008, she became the new face of Clinique's fragrance Happy, and also signed a six-figure deal to be the new face of David Jones, an Australian department store. Forbes placed Kerr at number ten on the list of the world's top-earning models, earning an estimated $3.5 million in 2008.\n\nKerr left NEXT Model Management and signed the IMG Models in 2009. She also walked for Prada in Milan and modeled for Italian Vogue that year. She was once again placed on Forbes list of the world's highest-paid models, ranking at #9 and earning $4 million that year.\n\nKerr became the first pregnant model for Vogue in January 2011, sitting at six months pregnant at the time of the shoot. In January 2012, she was named ambassador for Qantas and walked for Chanel and Miu Miu at the Paris Fashion Week.\n\nIn March 2013, negotiations to renew Kerr's five-year contract with department store David Jones fell through and the two parted ways. The next month, her three-year, $1 million contract with Victoria's secret was not renewed. In 2013, she was number two in Forbes' list of the world's highest paid models. She became the face of Austrian crystal house Swarovski. In February 2014, Kerr became the face of H&M and did high profile campaigns for Reebok and Wonderbra. She continued doing covers for Elle, Harer's, and Vogue over the next few years. In Feburary 2017, Miranda was featured in a commercial for Buick that aired during Super Bowl LI.\n\nKerr has frequently shown up on \"Sexiest Woman\" polls and lists throughout her career. Kerr was on Men's Health's list of \"100 Hottest Women of All-Time\", ranking higher than the likes of Audrey Hepburn, Grace Kelly, and Sophia Loren. She was named \"Sexiest Woman Alive\" in 2012 by Esquire UK and ranked Number 1 on Australian Maxim's 2012 Hot 100 List. Her model trademark is her dimples and her \"girl next door\" appearance.\n\nOther Ventures\n\nIn 2009, Miranda launched her own line of skincare products with George Moskos called KORA Organics. Kerr is active in a variety of charities and posed nude and chained to a tree to raise awareness about endangered koalas in her home country. She published her first book, \"Treasure Yourself\", in 2010. She released her debut single, a cover of Elvis' \"You're the Boss\", with Bobby Fox in the spring of 2014.\n\nPersonal Life\n\nMiranda Kerr dating finance broker Adrian Camilleri in 2003. Camilleri was eventually found guilty of fraudulent behavior from February 2003-February 2004.\n\nKerr dated singer Jay Lyon from 2003-2007. Kerr began dating Orlando Bloom in late 2007. In 2009, a gang of thieves known as the Bling Ring broke into Orlando's house and stole luxury brand clothing and jewelry. They were apparently after Kerr's famous Victoria's Secret lingerie. Kerr and Bloom were married in July 2010. They had a son together, Flynn Christopher Blanchard Copeland Bloom on January 6, 2011. Kerr and Bloom separated in October 2013 and their divorce was final by the end of 2013.\n\nIn June 2017, Kerr had to surrender $8 million in jewelry to the U.S. government amid an inquiry into the 1Malaysia Development Berhad scandal. It had been given to her by Jho Low, a Malaysian financier, in 2014. At the time, she was romantically involved with him.\n\nIn 2015, Kerr started dating billionaire Evan Spiegel, Snapchat co-founder and CEO. They were married in May 2017. They have two children together, Hart and Myles Spiegel, born in May 2018 and October 2019, respectively.", "images": ["https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2010/03/Miranda-Kerr-1.jpg", "https://vz.cnwimg.com/wp-content/uploads/2010/03/Miranda-Kerr.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/03/Miranda-Kerr.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/models/miranda-kerr-net-worth/", "title": "Miranda Kerr Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Miranda Kerr Net Worth: Miranda Kerr is an Australian model who has a net worth of $60 million. Kerr rose to fame as one of the Victoria's Secret Angels", "cnw_share_fb_count": 62, "cnw_share_tw_count": 23, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Miranda Kerr Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/models/miranda-kerr-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/03/Miranda-Kerr.jpg", "site_name": "Celebrity Net Worth", "description": "Miranda Kerr Net Worth: Miranda Kerr is an Australian model who has a net worth of $60 million. Kerr rose to fame as one of the Victoria's Secret Angels"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-09-29T22:35:33+00:00", "published_time": "2020-07-19T06:10:56+00:00", "section": "Models", "tag": "victoria's secret models"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/03/Miranda-Kerr.jpg", "title": "Miranda Kerr Net Worth", "description": "Miranda Kerr Net Worth: Miranda Kerr is an Australian model who has a net worth of $60 million. Kerr rose to fame as one of the Victoria's Secret Angels"}}, "movies": [], "publish_date": 1595139056.0, "source": "https://www.celebritynetworth.com", "summary": ""}