{"url": "https://www.washingtonpost.com/news/the-fix/wp/2018/02/15/oprah-says-wealthy-men-have-been-trying-to-persuade-her-to-run-for-president/", "text": "Speculation about television host Oprah Winfrey running for president intensified after her speech at the Golden Globes on Jan. 7. (Video: Patrick Martin/The Washington Post)\n\nGift Article Share\n\nPreliminary polling showed that there was high interest among women in an Oprah Winfrey presidential candidacy in 2020. According to a Quinnipiac poll in January, women would back the former talk-show host 58 percent to 33 percent against President Trump. Men were evenly divided, with 45 percent supporting each. Wp Get the full experience. Choose your plan ArrowRight But Winfrey shared that some influential men have encouraged her to consider a run for the White House.\n\n“I had a lot of wealthy men calling, telling me that they would run my campaign and raise $1 billion for me. I think that when you have that many people whose opinions you value coming at you, it's worthy of thinking about,” she told \"60 Minutes Overtime” correspondent Ann Silvio.\n\nDespite the offers, Winfrey said the lack of spiritual confirmation is what has kept her from seriously weighing a run.\n\nAdvertisement\n\n“If God actually wanted me to run, wouldn't God kind of tell me? And I haven't heard that,” she said.\n\nSo for now, it seems as though we can count Winfrey out of a presidential race.\n\n“I am actually humbled by the fact that people think that I could be a leader of the free world, but it's just not in my spirit,” she told Silvio. “It's not in my DNA.”\n\nMuch of the interest in the political aspirations of the mogul was rooted in her stirring Golden Globes speech on the sexual abuse and harassment of women by men in power. Winfrey, who in the past has talked about her own sexual abuse, has historically made respect for women part of her identity.\n\n“I was just trying to give a good speech. I was looking for a way to express what was going on in this moment in terms of gender and class and race. I cared about landing that speech in the room,” Winfrey said.\n\nAdvertisement\n\nDespite her past declarations of disinterest in running for president, many Americans rallied behind the moment. Overall, the Quinnipiac poll had Winfrey winning 52 percent of the vote to Trump's 39 percent if she ran against him in 2020.\n\nTrump's overall approval rating has inched up since Winfrey's speech, but he is in the midst of a scandal about the White House's handling of allegations against now-former staff secretary Rob Porter, who was accused of abuse by two ex-wives. Trump, who has been accused of sexual misconduct by almost 20 women, has regularly stood up for men on his side who have been accused of sexual abuse or harassment, including Republican Senate candidate Roy Moore in Alabama, Fox News Channel's Roger Ailes and former talk-show host Bill O'Reilly.\n\nAnd Saturday, in the middle of the Porter scandal, he did it again.\n\nAdvertisement\n\n“Peoples lives are being shattered and destroyed by a mere allegation. Some are true and some are false. Some are old and some are new. There is no recovery for someone falsely accused — life and career are gone. Is there no such thing any longer as Due Process?” Trump tweeted.\n\nA recent Washington Post-ABC News poll showed that more than 8 in 10 men view sexual harassment of women in the workplace as a problem. And only 35 percent of men think that the amount of national attention given to the issue has been sufficient.\n\nIt is clear from recent polling, Winfrey’s claims about male political donors as well as criticism against Trump that men also are looking for a leader who can respond effectively to the crisis of the abuse of women.\n\nBut it won’t be Winfrey, apparently.\n\nHowever, the men who would back her in a presidential contest need not worry about her disengaging.\n\n“I do feel that I have a responsibility, as a person who has a big voice in this country, to use it to promote justice and kindness and goodwill in the world. But it has never felt to me that that was supposed to be political,” Winfrey said.\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/Wires/Images/2017-02-09/AP/Travel-Brief-Cruise-Oprah_77861.jpg-3f299.jpg&w=1440"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/Wires/Images/2017-02-09/AP/Travel-Brief-Cruise-Oprah_77861.jpg-3f299.jpg&w=1440", "keywords": [], "authors": ["Eugene Scott", "Staff Writer"], "canonical_link": "https://www.washingtonpost.com/news/the-fix/wp/2018/02/15/oprah-says-wealthy-men-have-been-trying-to-persuade-her-to-run-for-president/", "title": "Oprah says God hasn’t told her to run for president. But wealthy men have.", "meta_data": {"description": "But, for now, it seems as if she is out. “If God actually wanted me to run, wouldn't God kind of tell me?” she said.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/the-fix/wp/2018/02/15/oprah-says-wealthy-men-have-been-trying-to-persuade-her-to-run-for-president/", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/Wires/Images/2017-02-09/AP/Travel-Brief-Cruise-Oprah_77861.jpg-3f299.jpg&w=1440", "title": "Analysis | Oprah says God hasn’t told her to run for president. But wealthy men have.", "description": "But, for now, it seems as if she is out. “If God actually wanted me to run, wouldn't God kind of tell me?” she said."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Analysis | Oprah says God hasn’t told her to run for president. But wealthy men have.", "description": "But, for now, it seems as if she is out. “If God actually wanted me to run, wouldn't God kind of tell me?” she said."}, "last_updated_date": "2021-11-25T13:15:56.915Z", "article": {"published_time": "2018-02-15T18:53:25.000Z", "modified_time": "2021-11-25T13:15:56.915Z", "section": "The Fix", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 71, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/news/the-fix/wp/2018/02/15/oprah-says-wealthy-men-have-been-trying-to-persuade-her-to-run-for-president/"}, "movies": [], "publish_date": 1518652800.0, "source": "https://www.washingtonpost.com", "summary": ""}