{"url": "www.hollywoodreporter.com/news/harrison-ford-goes-trump-administration-environmental-honor-1054597", "text": "Harrison Ford got political on Thursday night at 3Labs in Culver City when he was honored by Conservation International, a nonprofit environmental group he has been involved with for 26 years.\n\n“We face an unprecedented moment in this country. Today’s greatest threat is not climate change, not pollution, not flood or fire,” Ford said during his acceptance speech of the Founders’ Award. “It’s that we’ve got people in charge of important shit who don’t believe in science.”\n\nHe went on to criticize those politicians who let “political or economic self-interest denigrate or belittle sound scientific understanding of the causes and effects of human pressure on the environment.”\n\nFord serves as executive vice chair of Conservation International, which celebrated its 30th anniversary at the event. The group aims to protect nature and specifically focused on a ‘No Forests, No Future’ theme at the gala, highlighting the Amazon rainforest and its importance in addressing climate change.\n\n“I’m here tonight for one reason: I care deeply for the natural world. It’s not about me, it’s not about me at all, it’s about this other world we’re going to leave behind,” the actor said. “If we don’t stop the destruction of nature, nothing else will matter. Jobs won’t matter, our economies won’t matter, our freedoms and ethics won’t matter, our children’s education and potential won’t matter, peace, prosperity. If we end the ability of a healthy natural world to sustain humanity nothing else will matter, simply said.”\n\nFord has been deeply involved in the environmental cause for several decades, meeting with lawmakers, businesses and communities to discuss how to improve conservation policy and practices.\n\n“Other than my family, doing this work has been the most important thing of my life,” he said. “Nature doesn’t need people, people need nature.”\n\nMusic festival Rock in Rio and SC Johnson were also honored at the event, which drew Calista Flockhart, Sophia Bush and Arielle Kebbel, with a performance by Vanessa Carlton. Conservation International showed its virtual reality film Under the Canopy as well, giving guests a real-life look into the Amazon.\n\n“If you protect tropical forests, if you end tropical forest deforestation, it would be the equivalent of basically taking every car in the planet and making it into a Tesla overnight, that’s how important it is. The epicenter of that is the Amazon,” said M. Sanjayan, the group’s CEO and an environmental news analyst.\n\nConservation International launched the largest tropical forest restoration project in the world this year as a result, and Ford will have continued involvement in these worldwide environmental projects.\n\n“We’re not going to depend on governments alone, we’ll help equip communities and businesses to lead,” he said. “It’s a long road but I have hope.”", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-854829202_-_h_2017.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-854829202_-_h_2017.jpg?w=1296&h=730&crop=1", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-854829202_-_h_2017.jpg?w=1024", "keywords": [], "authors": ["Kirsten Chuba"], "canonical_link": "https://www.hollywoodreporter.com/lifestyle/lifestyle-news/harrison-ford-goes-trump-administration-environmental-honor-1054597/", "title": "Harrison Ford Goes After Trump Team While Accepting Environmental Honor", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "\"We’ve got people in charge of important shit who don’t believe in science,\" the actor said Thursday night in Los Angeles.", "news_keywords": "Events, Harrison Ford, Red Carpet", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Kirsten Chuba", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1054597, "title": "Harrison Ford Goes After Trump Team While Accepting Environmental Honor", "published_at": "2017-11-03 11:04:56", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-854829202_-_h_2017.jpg?w=1024", "comment_count": 0, "tags": "Red Carpet", "topics": "Lifestyle News", "body": "Harrison Ford got political on Thursday night at 3Labs in Culver City when he was honored by Conservation International, a nonprofit environmental group he has been involved with for 26 years.\r\n\"We face an unprecedented moment in this country. Today's greatest threat is not climate change, not pollution, not flood or fire,\" Ford said during his acceptance speech of the Founders' Award. \"It's that we've got people in charge of important shit who don't believe in science.\"\r\nHe went on to criticize those politicians who let \"political or economic self-interest denigrate or belittle sound scientific understanding of the causes and effects of human pressure on the environment.\"\r\nFord serves as executive vice chair of Conservation International, which celebrated its 30th anniversary at the event. The group aims to protect nature and specifically focused on a 'No Forests, No Future' theme at the gala, highlighting the Amazon rainforest and its importance in addressing climate change.\r\n\"I'm here tonight for one reason: I care deeply for the natural world. It's not about me, it's not about me at all, it's about this other world we're going to leave behind,\" the actor said. \"If we don't stop the destruction of nature, nothing else will matter. Jobs won't matter, our economies won't matter, our freedoms and ethics won't matter, our children's education and potential won't matter, peace, prosperity. If we end the ability of a healthy natural world to sustain humanity nothing else will matter, simply said.\"\r\nFord has been deeply involved in the environmental cause for several decades, meeting with lawmakers, businesses and communities to discuss how to improve conservation policy and practices.\r\n\"Other than my family, doing this work has been the most important thing of my life,\" he said. \"Nature doesn't need people, people need nature.\"\r\nMusic festival Rock in Rio and SC Johnson were also honored at the event, which drew Calista Flockhart, Sophia Bush and Arielle Kebbel, with a performance by Vanessa Carlton. Conservation International showed its virtual reality film Under the Canopy as well, giving guests a real-life look into the Amazon.\r\n\"If you protect tropical forests, if you end tropical forest deforestation, it would be the equivalent of basically taking every car in the planet and making it into a Tesla overnight, that's how important it is. The epicenter of that is the Amazon,\" said M. Sanjayan, the group's CEO and an environmental news analyst.\r\nConservation International launched the largest tropical forest restoration project in the world this year as a result, and Ford will have continued involvement in these worldwide environmental projects.\r\n\"We're not going to depend on governments alone, we'll help equip communities and businesses to lead,\" he said. \"It's a long road but I have hope.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Harrison Ford Goes After Trump Team While Accepting Environmental Honor", "url": "https://www.hollywoodreporter.com/lifestyle/lifestyle-news/harrison-ford-goes-trump-administration-environmental-honor-1054597/", "description": "“We’ve got people in charge of important shit who don’t believe in science,” the actor said Thursday night in Los Angeles.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-854829202_-_h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-11-03T11:04:56+00:00", "modified_time": "2017-11-05T14:41:09+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Harrison Ford Goes After Trump Team While Accepting Environmental Honor", "description": "“We’ve got people in charge of important shit who don’t believe in science,” the actor said Thursday night in Los Angeles.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-854829202_-_h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1509707096.0, "source": "http://www.hollywoodreporter.com", "summary": ""}