{"url": "https://en.wikipedia.org/wiki/Nathan_Kress", "text": "American actor (born 1992)\n\nNathan Karl Kress (born November 18, 1992) is an American actor. Kress began his career at the age of four, notably appearing in several television commercials and providing the voices of Easy and Tough Pup in the comedy-drama film Babe: Pig in the City (1998).\n\nHe resumed acting seven years later on the talk show Jimmy Kimmel Live! (2005), and thereafter had regular appearances on several Nickelodeon productions, including Toplin on the sitcom Drake & Josh (2007).\n\nKress rose to prominence for portraying Freddie Benson on the Nickelodeon sitcom iCarly (2007–2012), which earned him five Young Artist Award nominations and reprised his role in the revival series of the same name (2021–present).\n\nHe also subsequently voiced Wedge Antilles in the Disney XD animated series Star Wars Rebels (2016–2017).\n\nEarly life [ edit ]\n\nKress was born on November 18, 1992 in Glendale, California.[1][2] He has two brothers, Andrew and Kevin, neither of whom are involved in show business.[3][4] He began his professional career at the age of four when he displayed a natural talent for memorizing and re-enacting the shows he saw on television, prompting his mother to take him to an open \"cattle call\" showcase where he was quickly signed with a talent agent.[3][4][5]\n\nCareer [ edit ]\n\n1992–2005: Modeling career and early roles [ edit ]\n\nThroughout the 1990s, Kress modeled for various print advertisements, as well as performing in numerous commercials and voice-over roles; the most notable of which was his dual role as the voices of \"Easy\" and \"Tough Pup\" in the 1998 feature film Babe: Pig in the City.[2][4][5][6][7] At the age of six, he decided to take a break from acting and return to regular school, where he led a relatively \"normal\" life for the next five years until deciding to return to acting professionally at the age of eleven.[4][5][6]\n\nAt the age of 11, Kress was cast in the lead role as \"The Emperor\" in a school production of The Emperor's New Clothes.[4] The role rekindled his interest in performing, and at the end of his fifth grade school year, he asked his parents if he could be home-schooled so he could return to acting.[4][6] A mutual friend of Kress from school put him in touch with an agent, and after attending a summer acting \"boot camp\", Kress was soon going on real professional auditions once again.[4][5][6]\n\nIn April 2005, Kress made his first live television appearance since returning to acting in a comedy sketch on Jimmy Kimmel Live! where he played a young Simon Cowell of American Idol, and would continue to appear in various comedy sketches on the show a total of 5 times over the next year.[2][8] Kress continued to land steady work over the next two years, appearing in guest-starring roles on dramatic series such as House, Standoff, and Without a Trace as well as the Disney Channel comedy series The Suite Life of Zack & Cody.[2][3][8][9] Kress also appeared in several short films including Pickled, Magnus, Inc., and Bag, for which he was awarded a 168 Film Festival Jury Award for his portrayal of a small-fry drug dealer with a conscience.[4][8][10] In addition to live-action roles, Kress continued to work as a voice-actor, lending his voice to various characters in the animated feature film Chicken Little and on the Nickelodeon animated series Shuriken School.[8]\n\n2006–2009: Acting breakthrough with Nickelodeon [ edit ]\n\nIn February 2006, Kress landed a small role on the popular Nickelodeon family series Drake & Josh.[2][3][4][5][11] He played the role of Toplin, a \"geeky\" kid at a birthday party with a crush on Drake and Josh's younger sister Megan Parker (played by Miranda Cosgrove) in the episode \"Battle of Panthatar\".[3][5][8] Kress did not know it at the time, but this small role would lead to an opportunity that would catapult him to stardom.[3][4][5][12] While filming his scenes for Drake & Josh, television show creator and executive producer Dan Schneider took an interest in him and called him over to talk with him and to introduce him to some network executives.[2][4][5] At the time, Schneider was developing a new series for Nickelodeon, and was on the lookout for someone to play one of the lead roles in the untitled project, which would later become known as iCarly.[4][5][11]\n\nThe role of Toplin was similar to a character named Freddie that Schneider was looking to cast on iCarly.[3][4][5] Schneider had been so impressed with Kress' performance that he remembered him, and about 6 months after filming his small role on Drake & Josh, Kress was called in to audition for the role of \"Freddie\" shortly after his fourteenth birthday.[3][4][5] After several rounds of auditions, Kress was invited back for a screen test with Miranda Cosgrove and Jennette McCurdy and a couple of days later he was notified that he had landed the role of \"Freddie\".[4][5][11] Although iCarly would not premiere until the fall of 2007, the decision was made to cut Kress' scenes with Miranda Cosgrove out of the Drake & Josh episode that had started it all, in order to avoid any potential confusion among the young Nickelodeon viewing audience.[3][5]\n\nOn September 8, 2007, iCarly debuted on Nickelodeon and quickly became a fan favorite.[13][14] On the show, Kress plays Fredward \"Freddie\" Benson, the technical producer for the fictional web-show iCarly, which stars his character's two best friends, Carly Shay (Cosgrove) and Samantha \"Sam\" Puckett (McCurdy).[4][5][15] His character has a crush on the main character Carly, and a feuding, bitter-sweet, love/hate relationship with Carly's best friend and web-show co-star, Sam.[4][5][12] The show became Nickelodeon's most-watched show aimed at tweens, and catapulted Kress to international fame among adolescents.[2][5][12][16][17][18] Kress' performance on the show has been characterized by one reviewer for Variety as \"sweetly nerdy\".[13]\n\nIn 2008, Kress starred in the Nickelodeon television movie Gym Teacher: The Movie.[1][4][8][17] In the movie, Kress played \"Roland\", a decidedly uncoordinated student who transfers to a new school and must be whipped into shape by his ambitious gym teacher, Dave Stewie (Christopher Meloni).[1][4][17] Later that same year, he starred as Freddie Benson in the television movie iCarly: iGo to Japan, the show's first TV movie.[11][16][19] Throughout 2009, Kress continued to play the role of Freddie on iCarly, but was unable to take on other projects due to the network's decision to film both seasons two and three of the show back-to-back without the usual hiatus between filming seasons, in order to make up for the time lost during the 2008 writers strike.[5][11][12][20]\n\n2010–present: Directorial debut and current work [ edit ]\n\nKress in 2011\n\nIn March 2010, Kress guest-starred in the CBS television series CSI: Crime Scene Investigation in season 10: episode 15 titled \"Neverland\".[2][8][9][21] Kress played Mason Ward, one of two best friends of a fourteen-year-old victim with traces of blood of an inmate under his fingernails.[21] Kress told Fanlala.com of his CSI role \"It was a great opportunity to try my hand at something different. I had done scenes in dramas in the past, but other than a few semi-serious scenes on iCarly, it had been a long time since I've had the opportunity to do anything other than comedy.\"[21] Later that same year, Kress returned to comedic roles, guest-starring as Prince Gabriel on the Nickelodeon comedy series True Jackson, VP, and as the voice of Ronald on the Nickelodeon animated series The Penguins of Madagascar.[8]\n\nIn 2011, Kress continued to appear in the role of Freddie Benson on the fourth season of iCarly, and in January 2011, Miranda Cosgrove began telling news sources that she was looking forward to returning to Hollywood to begin filming the fifth season of the main character of the Nickelodeon show.[22][23][24] On January 27, 2011, Cosgrove told Cleveland Live News \"We're getting ready to start the next season, right after the (Dancing Crazy) tour. I would be willing to do the show as long as people like it and as long as it works.\"[22] On January 29, 2011, Reuters also reported that Cosgrove was preparing to begin filming season 5,[23] and on February 3, 2011 Cosgrove told The Middletown Press, when speaking of the show and her co-stars, Kress and Jennette McCurdy: \"I've known them since I was little. I can't wait to get back. I'm really comfortable doing [iCarly]. It's like my home away from home.\"[24] The show was later renewed for a sixth and final season, with the series finale \"iGoodbye\" airing on November 23, 2012.\n\nKress on ThrowBack with Nickelodeon in 2019\n\nKress would eventually reprise the role of Freddie Benson in one episode of the show's spin-off series Sam & Cat which aired in January 2014. Also in 2014, Kress co-starred in his first major film, Into the Storm, and had a major role in the web show Video Game High School as \"The New Law\". In 2015, he debuted as a director on Henry Danger.[25] In 2019, Kress started a podcast called RadioActive Dads with Brett Davern. In March 2021, it was announced that iCarly was being revived. The series premiered on Paramount+ on June 17, 2021, with Kress reprising his role as Freddie Benson.\n\nPersonal life [ edit ]\n\nWhile filming iCarly, Kress was tutored on the set with his co-stars Miranda Cosgrove and Jennette McCurdy, and was home-schooled on the weekends or when on hiatus from the shooting of the show.[4][5] As of February 2011 , Kress was finishing his senior year of high school and hoped to attend UCLA, his father's alma mater.[3][12]\n\nOn May 29, 2015, Kress became engaged to his girlfriend, actress, stunt performer, and Into the Storm castmate London Elise Moore.[26] They married on November 15, 2015, in Los Angeles.[27] Their first child, a daughter, was born on December 21, 2017.[28] On October 21, 2020, Kress announced that he is expecting his second child with his wife.[29] On March 22, 2021, Kress announced the birth of his second daughter.[30]\n\nPhilanthropy [ edit ]\n\nKress works with various charitable causes including The Big Green Help, the Make-A-Wish Foundation and The Starlight Children's Foundation.[2][31][32][33] In the summer of 2003, before returning to his acting career, Kress and his family traveled to Lithuania with the Christian missionary organization, YWAM (Youth With A Mission).[4]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nVideo games [ edit ]\n\nWeb series [ edit ]\n\nYear Title Role Notes 2014 Video Game High School New Law/The Law Main role; season 3\n\nDirector [ edit ]\n\nYear Title Notes 2015–2019 Henry Danger TV series, 11 episodes 2016–2019 Game Shakers TV series, 6 episodes 2021–2022 iCarly TV series, 3 episodes\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Nathan_Kress_2021.png/220px-Nathan_Kress_2021.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Nathan_Kress_2019_%28_gm8Jp_4a5E%29.jpg/170px-Nathan_Kress_2019_%28_gm8Jp_4a5E%29.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/f/fb/Nathan_Kress_2021.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Nathan_Kress_2011%2C_2.jpg/170px-Nathan_Kress_2011%2C_2.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Nathan_Kress_2021.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Nathan_Kress", "title": "Nathan Kress", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Nathan_Kress_2021.png", "width": 640, "height": 945}, "title": "Nathan Kress - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}