{"url": "mashable.com/2017/10/08/mike-pence-leaves-nfl-game-tweets/", "text": "Vice President Mike Pence went to an NFL game in his home state of Indiana today, specifically -- it seems -- to throw a fit online.\n\nThe VP attended the matchup between the San Francisco 49ers and Indianapolis Colts, a likely humdrum affair between two struggling teams with a combined one win between them. But Pence probably wasn't there to take in the game or honor Trump pal Peyton Manning, who got himself a new statue outside Lucas Oil Stadium this weekend.\n\nSEE ALSO: How to teach your kids about the NFL protests and the awesome power of dissent\n\nNope. Pence apparently attended to win some cheap political points by leaving the stadium after members of the visiting 49ers knelt during the national anthem to protest police brutality and the unequal treatment of minorities in the US. He then tweeted about it.\n\nPence's reaction was opportunistic, but it also seems to have been a predetermined, calculated decision meant to rile up the Trump-loving political base. Tensions are still high in the wake of a controversy that has gripped all of domestic sports since Donald Trump began attacking protester athletes at an Alabama rally on Sept. 22.\n\nThe VP probably knew what he was getting into for the game. The 49ers are the former team of Colin Kaepernick, whose protests in 2016 ignited the current controversy. Kaepernick is currently not on an NFL roster, which many believe is due to his role in the movement.\n\nThat hasn't stopped his former teammates and others in the league from continuing (or starting) to kneel and display other forms of dissent during the playing of the anthem. Protests would likely have happened at any game where players weren't encouraged by their owners to link arms or show some other empty form of \"unity\" in the face of Trump's criticism — but the 49ers connection made it all the more likely.\n\nPence followed his tweets with an official statement, which was word-for-word what he tweeted:\n\nI left today’s Colts game because President Trump and I will not dignify any event that disrespects our soldiers, our Flag, or our National Anthem. At a time when so many Americans are inspiring our nation with their courage, resolve, and resilience, now, more than ever, we should rally around our Flag and everything that unites us. While everyone is entitled to their own opinions, I don’t think it’s too much to ask NFL players to respect the Flag and our National Anthem. I stand with President Trump, I stand with our soldiers, and I will always stand for our Flag and our National Anthem.\n\nThe incorrectly capitalized, jingoistic message is counterintuitive, encapsulating the whole debate around anthem protests succinctly. Pence says that he thinks everyone is entitled to their opinions, but he has zero tolerance for others expressing them in ways he doesn't agree with.\n\nHe highlights the \"resolve and resilience\" shown by Americans around the nation, but dismisses the efforts of a large group of citizens steadfastly refusing to allow injustice to be ignored any longer. What he calls an act of disrespect toward the flag and country is, in truth, the exact opposite.\n\nThese players have chosen a widely viewed public platform that can carry a message about something that's broken in this country -- and has been for a long time -- to a broad swath of observers. What good is a protest, really, if it's invisible?\n\nAfter Pence's initial tweets, news emerged making it even more clear that the whole thing was probably a stunt. Vaughn Hillyard of NBC News reported that the press pool with Pence never even left their vans to enter the stadium.\n\nThe White House is now handing out photos of Pence standing during the anthem and the whole situation is being treated as a photo op. How very Trumpian.\n\nUnsurprisingly, Donald Trump weighed in on Twitter.\n\nTrump congratulated his number two for winning some of the same cheap political \"victories\" that he himself seems to value most. His assertion that he told Pence ahead of time to leave if any players took a knee essentially confirmed that the early departure was predetermined.\n\nThis type of grandstanding shouldn't surprise anyone who has been following the NFL protests or any of the controversies that the Trump administration whipped up in response, but it should be highlighted nonetheless. The VP just wasted an untold amount of taxpayer money (on travel, security detail, etc.) to bring more attention to a divisive, partisan debate.\n\nThat's what Senator Brian Schatz, of Hawaii, zeroed in on in his response to the situation.\n\nThe Colts-49ers game will go on, and one team will emerge the winner. For the rest of us, however, there are no victors here.", "images": ["https://helios-i.mashable.com/imagery/articles/00fSJz6CClBfcms5qbW4hch/hero-image.fill.size_220x133.v1665159005.jpg", "https://helios-i.mashable.com/imagery/articles/02jmd6tz3PtCrws99lPodpr/hero-image.fill.size_220x220.v1665157599.jpg", "https://helios-i.mashable.com/imagery/articles/02Y5b7JorAM88OiQsfP7QeK/hero-image.fill.size_220x220.v1665076310.jpg", "https://helios-i.mashable.com/imagery/articles/025qBEXxYhgfijKcaZIbtEq/hero-image.fill.size_220x133.v1664642042.jpg", "https://helios-i.mashable.com/imagery/articles/05mWdtLENlijAyPWMuSEH1g/hero-image.fill.size_220x220.v1665084793.jpg", "https://helios-i.mashable.com/imagery/articles/03LA5Q9rfWUjnOstCHpp3M5/hero-image.fill.size_220x133.v1665080192.jpg", "https://helios-i.mashable.com/imagery/articles/03l1ewk0ufUASvd6RBtyxhW/hero-image.fill.size_220x220.v1664896898.jpg", "https://c.evidon.com/pub/icong1.png", "https://helios-i.mashable.com/imagery/articles/00Xr2IhNH2gF1HMlfa0c173/hero-image.fill.size_1248x702.v1623366306.jpg", "https://helios-i.mashable.com/imagery/articles/00M5ISM7LFlZ2ABwSrqTuMH/hero-image.fill.size_220x220.v1665070706.png", "https://helios-i.mashable.com/imagery/articles/05mWdtLENlijAyPWMuSEH1g/hero-image.fill.size_220x133.v1665084793.jpg", "https://helios-i.mashable.com/imagery/articles/00Xr2IhNH2gF1HMlfa0c173/hero-image.fill.size_1200x675.v1623366306.jpg", "https://helios-i.mashable.com/imagery/articles/00fSJz6CClBfcms5qbW4hch/hero-image.fill.size_220x220.v1665159005.jpg", "https://helios-i.mashable.com/imagery/articles/02Y5b7JorAM88OiQsfP7QeK/hero-image.fill.size_220x133.v1665076310.jpg", "https://helios-i.mashable.com/imagery/articles/03l1ewk0ufUASvd6RBtyxhW/hero-image.fill.size_220x133.v1664896898.jpg", "https://helios-i.mashable.com/imagery/articles/03LA5Q9rfWUjnOstCHpp3M5/hero-image.fill.size_220x220.v1665080192.jpg", "https://helios-i.mashable.com/imagery/articles/027l7uxerp61532fIjB7nUH/hero-image.fill.size_220x133.v1665065449.png", "https://helios-i.mashable.com/imagery/articles/02jmd6tz3PtCrws99lPodpr/hero-image.fill.size_220x133.v1665157599.jpg", "https://helios-i.mashable.com/imagery/articles/00M5ISM7LFlZ2ABwSrqTuMH/hero-image.fill.size_220x133.v1665070706.png", "https://helios-i.mashable.com/imagery/articles/06O7Cs8ebhz62Bq8GAx3nOU/hero-image.fill.size_220x133.v1665113153.jpg", "https://helios-i.mashable.com/imagery/articles/027l7uxerp61532fIjB7nUH/hero-image.fill.size_220x220.v1665065449.png", "https://helios-i.mashable.com/imagery/articles/025qBEXxYhgfijKcaZIbtEq/hero-image.fill.size_220x220.v1664642042.jpg", "https://helios-i.mashable.com/imagery/articles/06O7Cs8ebhz62Bq8GAx3nOU/hero-image.fill.size_220x220.v1665113153.jpg"], "top_img": "https://helios-i.mashable.com/imagery/articles/00Xr2IhNH2gF1HMlfa0c173/hero-image.fill.size_1200x675.v1623366306.jpg", "keywords": [], "authors": [], "canonical_link": "https://mashable.com/article/mike-pence-leaves-nfl-game-tweets", "title": "VP Mike Pence just left an NFL game early to protest a protest he doesn't seem to understand", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#00aeef", "application-name": "Mashable.com", "description": "Vice President Mike Pence attended an NFL game only to leave after national anthem protests, which appears to have been a plan to gain support.", "fb": {"app_id": 122071082108, "pages": 18807449704}, "og": {"site_name": "Mashable", "title": "VP Mike Pence just left an NFL game early to protest a protest he doesn't seem to understand", "url": "https://mashable.com/article/mike-pence-leaves-nfl-game-tweets", "description": "This was all just for show.", "image": {"identifier": "https://helios-i.mashable.com/imagery/articles/00Xr2IhNH2gF1HMlfa0c173/hero-image.fill.size_1200x675.v1623366306.jpg", "secure_url": "https://helios-i.mashable.com/imagery/articles/00Xr2IhNH2gF1HMlfa0c173/hero-image.fill.size_1200x675.v1623366306.jpg", "height": 675, "width": 1200}, "type": "article", "article": {"tag": "Politics"}}, "article": {"author": "Brett Williams", "modified_time": "2021-10-29T15:36:15+00:00", "published_time": "2017-10-08T19:37:02+00:00", "section": "Life"}, "twitter": {"site": "@mashable", "card": "summary_large_image", "creator": "@mashable", "title": "VP Mike Pence just left an NFL game early to protest a protest he doesn't seem to understand", "description": "This was all just for show.", "image": "https://helios-i.mashable.com/imagery/articles/00Xr2IhNH2gF1HMlfa0c173/hero-image.fill.size_1200x675.v1623366306.jpg"}}, "movies": [], "publish_date": 1507417200.0, "source": "http://mashable.com", "summary": ""}