{"url": "https://en.wikipedia.org/wiki/Tom_Holland_(actor)", "text": "English actor (born 1996)\n\nThomas Stanley Holland (born 1 June 1996) is an English actor. His accolades include a British Academy Film Award, three Saturn Awards, a Guinness World Record and an appearance on the Forbes 30 Under 30 Europe list. Some publications have called him one of the most popular actors of his generation.[a]\n\nHolland's career began at age nine when he enrolled in a dancing class, where a choreographer noticed him and arranged for him to audition for a role in Billy Elliot the Musical at London's Victoria Palace Theatre. After two years of training, he secured a supporting part in 2008 and was upgraded to the title role that year, which he played until 2010. Holland made his film debut in the disaster drama The Impossible (2012) as a teenage tourist trapped in a tsunami, for which he received a London Film Critics Circle Award for Young British Performer of the Year. After this, Holland decided to pursue acting as a full-time career, appearing in How I Live Now (2013) and playing historical figures in the film In the Heart of the Sea (2015) and the miniseries Wolf Hall (2015).\n\nHolland achieved international recognition playing Spider-Man/Peter Parker in six Marvel Cinematic Universe (MCU) superhero films, beginning with Captain America: Civil War (2016). The following year, Holland received the BAFTA Rising Star Award and later became the youngest actor to play a title role in an MCU film in Spider-Man: Homecoming. The sequels Far From Home (2019) and No Way Home (2021) each grossed more than $1 billion worldwide, and the latter became the highest-grossing film of the year. During this period, Holland gained recognition for playing darker roles in the crime dramas The Devil All the Time (2020) and Cherry (2021). Holland has additionally directed the short film Tweet (2015) and voiced roles in computer-animated features, including Onward (2020).\n\nEarly life\n\nThomas Stanley Holland was born on 1 June 1996 in Kingston upon Thames in south west London, to photographer Nicola (née Frost) and Dominic Holland, a comedian and author.[4] He has three younger brothers.[5] His paternal grandmother was from Tipperary, Ireland.[6] Holland lives in Kingston upon Thames, near the house of his parents and younger brothers.[7] As his parents have creative professions, he is often inspired by them;[8] he considers his father a role model who has unofficially worked as his manager due to his experience in the industry.[9][10]\n\nHolland was educated at Donhead, an all-male Catholic preparatory school in Wimbledon in south west London.[11] When he was seven, he was diagnosed with dyslexia. His parents sent him and his brothers (to avoid making them feel neglected) to a private school so he could get the necessary attention. Although Holland liked the new school, this started to drain his family's finances.[12][13] Holland attended Wimbledon College, a voluntary aided Jesuit comprehensive school,[14] followed by the BRIT School for Performing Arts and Technology in Croydon.[15]\n\nGrowing up, Holland considered several career choices. As a child, he was a fan of Janet Jackson's songs, and would often dance to them. His mother, impressed with this, signed him up for a dancing class, which was advertised in the private school that Holland was visiting at the time.[12][13] In his teens, Holland briefly attended carpentry school in Cardiff, Wales.[16] At one point, he considered becoming a primary school teacher, as he enjoys being around children.[10]\n\nCareer\n\n2006–2014: Early stage work and film debut\n\nAt age nine, Holland began dancing at a hip hop class at Nifty Feet Dance School in Wimbledon, where he performed with his school group at the 2006 Richmond Dance Festival. There, he was spotted by choreographer Lynne Page, an associate to Peter Darling, choreographer of Billy Elliot the Musical. Page arranged an audition for Holland, where the musical's director Stephen Daldry thought that he \"had great potential and was a very natural actor\".[17] After two years of training in ballet, tap dancing and acrobatics,[9] Holland won the role of Michael Caffrey, the protagonist's best friend, and made his debut performance at the West End's Victoria Palace Theatre in June 2008.[18] During his time performing in the musical, Holland learned gymnastics.[19] Holland says when his peers at school found out about his dancing activities, they started bullying him.[13]\n\nLater in 2008, Holland and co-star Tanner Pflueger were promoted to the lead role in the musical.[20] On his first day playing Elliot, Holland developed tonsillitis, but performed on stage anyway to positive reviews, but went to the doctor the next day.[1] Following his stage success, Holland hoped to be popular in school and that his schoolmates would stop bullying him. After being in a professional environment, however, he matured earlier than his peers and struggled to fit in. As a result, his General Certificate of Secondary Education grades suffered.[13] After his work on Billy Elliot the Musical finished in 2010,[21] Holland voiced a role in the British dub of the Japanese animated fantasy film Arrietty (2011),[22] and sent an audition tape to J.A. Bayona for a part in The Impossible (2012). Bayona then arranged a meeting, and had Holland write a letter to his mother and recite it as an audition. Impressed with his emotional delivery, Bayona cast Holland in the film.[23]\n\nIn The Impossible, Holland played a teenager trapped with his family in the 2004 Indian Ocean earthquake and tsunami. Transitioning from stage to screen was initially hard for Holland due to the shift from live audience to camera.[24] He and co-star Naomi Watts filmed scenes in a 35,000-gallon water tank, which were physically and psychologically taxing for them.[25] Working with Watts made Holland realise that he wanted to pursue an acting career permanently.[26] The Impossible premiered at the Toronto International Film Festival in September to critical and commercial success,[27] earning $180.3 million against a budget of $45 million.[28] Holland received critical praise for his performance.[24] A. O. Scott of The New York Times found Holland to be \"a terrific young actor\", praising his character's transition from a self-involved to a responsible adolescent.[29] He won several awards, including the National Board of Review Award for Breakthrough Performance and London Film Critics Circle Award for Young British Performer of the Year.[30][31] Holland featured in the drama film How I Live Now (2013),[32] lent his voice in a supporting role for the drama film Locke (2013),[33] and had a cameo in Billy Elliot the Musical Live (2014).[34]\n\n2015–2017: Breakthrough as Spider-Man\n\nHolland appeared in four episodes of BBC Two's historical miniseries Wolf Hall (2015), as Gregory Cromwell, son of the protagonist Thomas Cromwell played by Mark Rylance.[35] He directed Tweet (2015), a 3-minute short film about a young man building a birdhouse with his grandfather;[23] Holland later expressed an interest in directing feature films in his 40s.[8] Also in 2015, Holland co-starred as the teenage sailor Thomas Nickerson in Ron Howard's historical adventure-drama In the Heart of the Sea. The film is based on the namesake 2000 non-fiction book about the sinking of the American whaling ship Essex in 1820. In preparation, he and co-stars, including Chris Hemsworth, lost significant weight, consuming 500–1,000 calories a day. Holland performed most of his stunts in the film.[36] In the Heart of the Sea received mixed reviews from critics, and grossed $93 million against a $100 million budget.[37][38] Brian Truitt of the USA Today wrote that Holland \"does a good job\".[39]\n\nIn June 2015, Holland signed a six-picture deal with Marvel Studios to play a teenage Peter Parker / Spider-Man.[40] Growing up, Holland was a fan of Spider-Man; he owned 30 costumes and bed sheet covers of the character.[9] He auditioned against 1,500 teenagers worldwide, including English actors Charlie Rowe and Asa Butterfield.[41] While producers Kevin Feige and Amy Pascal were impressed with his performances in The Impossible, Wolf Hall, and In the Heart of the Sea,[40] directors the Russo brothers cited Holland's dancing and gymnastics background as the reasons to cast him.[42] Stan Lee, Spider-Man's creator, said Holland was the \"exact age and height\" when he envisioned the character.[13] As part of the Marvel Cinematic Universe (MCU), he first appeared as Spider-Man in Captain America: Civil War (2016).[43] The film was a critical and commercial success, grossing over $1.1 billion worldwide against a budget of $250 million to become the highest-grossing film of 2016.[44] In a review for The Guardian, Peter Bradshaw praised Holland and co-star Paul Rudd (who played Ant-Man) as \"seductively high-spirited and hilarious\",[45] and Richard Roeper of Chicago Sun-Times wrote that he made \"a strong first impression\" as Spider-Man.[46]\n\nIn 2016, Holland co-starred with Joel Kinnaman and Percy Hynes White in the psychological thriller Edge of Winter. It was the first film he did without his parents' knowledge.[47] Frank Scheck of The Hollywood Reporter found Holland and White \"excellent\", describing their terrified reaction as \"more emotionally wrenching than the tired thriller genre conventions to which the film ultimately succumbs\".[48] At the 70th British Academy Film Awards in 2017, Holland won the Rising Star Award.[49] Holland's first work that year was alongside Charlie Hunnam in James Gray's drama The Lost City of Z, which was released to positive reviews.[50] On his last day of filming, he broke his nose after a failed backflip attempt.[51] Holland played the son of Percy Fawcett (Hunnam), an explorer who makes several attempts to find a supposed lost ancient city in the Amazon rainforest. Neil Soans of The Times of India praised Holland for making the film emotional towards the end and Rex Reed of The New York Observer found him \"remarkably strong and self-assured\".[52][53] Later in 2017, Holland played Samuel Insull in Alfonso Gomez-Rejon's The Current War, which received negative reviews and was a box-office failure.[54][55] Clarisse Loughre of The Independent found Holland's role insubstantial.[56]\n\nHolland's second film in 2017 was his solo feature as the title character in Spider-Man: Homecoming. As a result, Holland earned an entry in Guinness Book of World Records as the youngest actor to play a title role in the MCU.[57] Though Holland took some inspiration from previous Spider-Man actors Tobey Maguire and Andrew Garfield, he wanted to add some newness in his reinterpretation of the character.[58] Homecoming focused on Parker, as he tries to balance being a high-school student and a superhero.[59] To prepare, Holland attended The Bronx High School of Science in the Bronx for a few days,[60] although other students did not believe he was cast as Spider-Man. Holland felt this situation reflected the film's story, in which other characters are unaware that Parker is Spider-Man.[61] Homecoming and Holland's performance received positive reviews.[62] Peter Travers called it \"a star performance given by a born actor\".[63] Made on a budget of $175 million, the film grossed over $800 million worldwide.[64] Holland's final role in 2017 was in the Irish film Pilgrimage, which premiered at the Tribeca Film Festival.[65] Outside film that year, Holland appeared with Zendaya on Paramount Network's Lip Sync Battle, during which he performed a dance number to Rihanna's \"Umbrella\" in drag.[66] His parents founded The Brothers Trust, a charitable organisation, which aims to use his popularity to raise funds for humanitarian causes.[67]\n\n2018–present: Blockbuster films and mature roles\n\nHolland reprised his role as Spider-Man in Avengers: Infinity War (2018) and its follow-up Avengers: Endgame (2019), which were filmed back-to-back.[68] The pictures each earned more than $2 billion,[69] and Endgame briefly became the highest-grossing film of all time.[b] Holland followed with the sequel Spider-Man: Far From Home (2019), which widely received positive reviews and became the first Spider-Man film to earn $1 billion, finishing as the fourth-highest grosser of 2019.[71][72] Ben Travis of Empire magazine found Holland \"a note-perfect Spider-Man — still funnier and more believably teenage\" than Maguire and Garfield who previously portrayed the character. Travis wrote, \"Holland never loses the ebullient spark that makes him one of the MCU's most endearing figures.\"[73] Holland received a third consecutive Saturn Award for Best Performance by a Younger Actor for Far From Home, having previously won for Civil War and Homecoming.[74] He voiced roles in the Blue Sky Studios animation Spies in Disguise (2019),[75] the live-action film Dolittle (2020), and the Pixar animated film Onward (2020). The last two were with his MCU co-stars Robert Downey Jr. and Chris Pratt, respectively.[76][77] Made on lucrative budgets, all three films underperformed at the box-office.[78]\n\nAlongside Avengers co-star Sebastian Stan, Holland starred in Antonio Campos's The Devil All the Time (2020), a Netflix psychological thriller set after World War II. Holland said he initially worried that he lacked the depth to play a young orphaned man who goes on a killing spree, and was scared and nervous on his first day on set. Encouraged by Campos, he ultimately enjoyed playing the part, although it took a temporary toll on his mental health.[79] Campos praised Holland's effort to learn Southern American English for the role, described his acting process as \"methodical\", \"thoughtful and sensitive\",[80] and called him a kind person.[80] Critics from IndieWire and Roger Ebert's website opined that despite the film's failed script, Holland gave a convincing performance and showed his range as an actor.[81][82] By November 2020, the film was the 22nd-most watched straight-to-streaming title of the year, according to a Variety report.[83]\n\nHolland starred in three films that were released in 2021. His first, the crime drama Cherry, is based on the namesake novel by American author Nico Walker, and reunited him with Avengers directors Russo brothers.[84] He played a college student with post-traumatic stress disorder (PTSD) after enlisting in the army, and robs banks to finance his drug addiction. In preparation for the role, Holland shaved his head and interviewed military veterans undergoing treatments for substance abuse and PTSD.[26] He also lost 30 pounds (14 kg) of weight, then regained it after filming.[85] The film was released in cinemas in February and digitally on Apple TV+ in March.[86] Consensus among critics was that the film enabled Holland to broaden his horizons as an actor, but it had a formulaic story.[87] This was echoed by Owen Gleiberman of Variety who further noted that Holland proved his skills as an actor and demonstrated a range of indulgent looks and moods.[88] Holland next played alongside Daisy Ridley as a young man living on a planet called New World in Chaos Walking, an adaptation of Patrick Ness's best-selling science fiction series of the same name. The film was delayed due to several reshoots in early 2019, which added $15 million to its budget, bringing its cost to $100 million.[89] Chaos Walking failed to recoup its budget and received poor reviews.[90][91] David Rooney of The Hollywood Reporter found the chemistry between Holland and Ridley lackluster and Christian Holub of Entertainment Weekly noted his failed attempt to break away from roles similar to Spider-Man.[92][93]\n\nIn November 2021, Holland voiced Percy Pig in a series of advertisements for Marks & Spencer's Christmas food specials.[94] The following month, Holland reprised his role as Peter Parker in the sequel Spider-Man: No Way Home.[95] After taking on mature roles in films like Cherry, Holland noted that he found it strange adjusting back to playing Parker, chiefly due to raising his voice pitch and returning to the mindset of a \"naïve, charming teenager\".[96] He described No Way Home as the \"most ambitious standalone superhero movie ever made\".[26] Despite its release during the COVID-19 pandemic, No Way Home quickly emerged as the highest-grossing film of 2021 and the sixth highest-grossing film of all time. It also became the first film since 2019's Star Wars: The Rise of Skywalker to earn more than $1 billion at the box-office.[97] No Way Home became the highest-rated Spider-Man film on the online database IMDb and the review aggregator Rotten Tomatoes.[98] Wendy Ide of The Guardian wrote that the film \"delivers an overflowing, funnel-web cornucopia of treats for Spider-fans\" and attributed Parker's continuing appeal to \"his endearing, puppyish enthusiasm\".[99] The Times' Kevin Maher opined that Holland \"own[s] every inch of the role\" and \"casts his web and captures your heart\".[100]\n\nDiscussing his future as Spider-Man after No Way Home, Holland told GQ in 2021 that he was doubtful about reprising the role, especially after he turns 30 in 2026. He expressed a desire to see a live-action Spider-Man film with Miles Morales as the protagonist, whereas Amy Pascal spoke of wanting Holland to continue playing the role.[1] Holland began the following year with an investment in Dogpound gyms,[101] and a starring role as a young Nathan Drake, a charismatic fortune hunter, in the film adaptation of Naughty Dog's Uncharted video game series.[102] In preparation for scenes where his character is bartending, Holland worked shifts at the Chiltern Firehouse, a pub in London. Though the filming was delayed due to the COVID-19 pandemic, Holland continued to eat and train for the role.[1] Uncharted polarised critics but Rebecca Rubin of Variety wrote that Holland's star-power likely contributed to its box-office success.[103][104] In a mixed review for his performance, Brian Tallerico of Roger Ebert's website labelled him miscast, writing that \"Holland has the agility but quite simply lacks the weight and world-weariness needed\" for the role.[105]\n\nUpcoming projects\n\nHolland is set to star in the Apple TV+ anthology series The Crowded Room, where he will also be an executive-producer.[106] Since 2017, he has also been attached to play the role of Pino Lella in Beneath a Scarlet Sky, a spy thriller series set during World War II based on the 2017 fact-based novel of the same name by Mark Sullivan.[107] In December 2021, Holland confirmed that he was set to portray actor and dancer Fred Astaire in a biopic currently in development at Sony.[108]\n\nPublic image and personal life\n\nHolland in an interview with MTV in 2018\n\nNadia Khomani of The Guardian said that Holland's \"cheeky British charm, vulnerability and wit\" has made him the object of infatuation on the internet.[9] Jonathan Dean of The Sunday Times considered him to be \"poised and professional, but also so confident and personable\" and took note of his maturity \"despite boyish wiriness\".[13] German actor Sönke Möhring, his co-star from The Impossible, similarly remarked on his professionalism, adding, \"he is blessed with a deep soul [...] down to earth, very polite and a friendly kid.\"[9] Kevin Macdonald, who directed Holland in How I Live Now, praised him as confident, \"articulate and enthusiastic\", and attributed Holland's success to his positive energy.[9] When asked about the secret to his success, Holland said he believes in avoiding trouble and working hard.[57]\n\nHolland appeared on Screen International's \"UK Stars of Tomorrow – 2012\",[109] and The Hollywood Reporter's \"Next Gen 2015\", a list of promising newcomers in film.[110] In 2019, he featured on Forbes' \"30 Under 30 Europe\", a list of influential people under 30 years,[111] and Insider Inc.'s \"45 young stars who will one day rule Hollywood\".[112] After appearing on Glamour's \"Hot, Young & British Actors 2020\",[113] he was named among the best actors under 30 by Tuko,[114] and Complex Networks in 2021.[115] In the former listing, Ryan Mutuku described him as \"a darling to the English media\" because of his openness and willingness to also give interviews not related to film promotions.[114] Calling him \"his generation's biggest leading man\" in 2021, GQ's Oliver Franklin-Wallis wrote, \"Holland has ascended to a tier of stardom few actors ever reach, and rarely so young\".[1] Variety editors Brent Lang and Rebecca Rubin reported in December 2021 that after the success of the Spider-Man films, Holland could become a top-paid actor in the future. They noted the lack of young leading men in Hollywood and saw Holland's potential to herald a new generation of successful actors.[116]\n\nHolland considers himself to be \"an impossible people pleaser\",[1] which according to Olivia Singh of Yahoo! News has resulted in his facing burnout and an incident where he vomited after a press conference.[117] A self-admittedly indiscreet person, Holland has gained a reputation for inadvertently spoiling important plot elements of his films during interviews and press conferences.[118] His MCU co-stars labelled him the \"least trustworthy\" cast member in terms of spoilers.[119] To prevent an incident, he only read parts of Captain America: Civil War's script.[118] Joe Russo similarly avoided giving Holland the script to Avengers: Endgame, and Holland knew only his lines.[120] Holland has expressed his views on the film industry. In a 2019 interview with The Sunday Times, he spoke for more representation of racial minority and the LGBT community in film.[13] That year, when filmmaker Martin Scorsese criticised Marvel films for their lack of portraying human emotions, Holland responded: \"he doesn't know what it's like because he's never made one.\" Holland further said that MCU films will always do well commercially regardless of their quality, whereas a bad independent film might not.[121] In 2022, he criticised actor Tom Cruise for taking credit for \"resurrect[ing] Hollywood\" during the COVID-19 pandemic with Mission: Impossible – Dead Reckoning Part One (2023) and overlooking the commercial impact of his film Uncharted.[122]\n\nHolland is active on the social networking service Instagram, and he often uses his number of followers to impress auditioners.[13] On the other hand, he describes himself as a private person and is reluctant to discuss his personal life in public.[1] As of November 2021, he is in a relationship with his Spider-Man co-star, Zendaya.[123] He thought the media attention to their relationship breached their privacy.[1] Holland discussed having sleep paralysis nightmares of paparazzi in his bedroom.[123]\n\nNotes\n\n^ [1][2][3] Attributed to multiple references ^ Avengers: Endgame remained the highest-grossing film for two years until it was surpassed by Avatar (2009) after a 2021 re-release in China.[70] remained the highest-grossing film for two years until it was surpassed by(2009) after a 2021 re-release in China.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Tom_Holland_by_Gage_Skidmore.jpg/1200px-Tom_Holland_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Tom_Holland_Billy_Elliot_2010_2b.jpg/170px-Tom_Holland_Billy_Elliot_2010_2b.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Thomas_Nickerson_portrait.jpeg/170px-Thomas_Nickerson_portrait.jpeg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Tom_Holland_MTV_2018_%2802%29.jpg/170px-Tom_Holland_MTV_2018_%2802%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Tom_Holland_Bali_2019_1_%28cropped%29.jpg/180px-Tom_Holland_Bali_2019_1_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Portrait_of_a_Young_Man%2C_c._1535-40%2C_Hans_Holbein_the_Younger.jpg/170px-Portrait_of_a_Young_Man%2C_c._1535-40%2C_Hans_Holbein_the_Younger.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/19px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Britoutside.jpg/220px-Britoutside.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/21px-Flag_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/be/Flag_of_England.svg/21px-Flag_of_England.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Tom_Holland_by_Gage_Skidmore.jpg/220px-Tom_Holland_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/19px-Video-x-generic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Clock_Tower_-_Palace_of_Westminster%2C_London_-_May_2007_icon.png/11px-Clock_Tower_-_Palace_of_Westminster%2C_London_-_May_2007_icon.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Tom_Holland_by_Gage_Skidmore.jpg/1200px-Tom_Holland_by_Gage_Skidmore.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tom_Holland", "title": "Tom Holland", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Tom_Holland_by_Gage_Skidmore.jpg/640px-Tom_Holland_by_Gage_Skidmore.jpg", "width": 640, "height": 945}, "title": "Tom Holland - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}