{"url": "https://www.hollywoodreporter.com/news/jimmy-kimmels-wife-head-writer-why-we-shared-babys-trauma-what-came-1063489", "text": "Molly McNearney never set out to be a recognizable face, never mind a voice of a movement.\n\nThe recognizable face part came first. It began in late 2009, when the Jimmy Kimmel Live! producer and co-head writer started dating her boss. Every bone in McNearney’s body knew it was a bad idea, and not just because the St. Louis native was then the only female in the show’s writers room and was dead set on fitting in. “I remember telling Jimmy, ‘If this doesn’t work out, nothing in your life changes,’ ” she says, “but mine changes completely.” It was left to Kimmel, who had been married once before, to impart to her his confidence that this was something more than a workplace fling.\n\nThat their romance has survived — Kimmel, 50, and McNearney, 39, wed in 2013 and now have two children together — is, at least in part, a credit to the way they have committed to keeping their work life separate from their personal one. Most of the time, anyway. “Occasionally,” she admits, “I’ll be brushing my teeth at night and go, ‘Really? That was a good idea that you rejected today.’ ” Though McNearney has with time gotten comfortable with her boss by day, husband by night setup, she insists she’ll never fully adjust to the prying eyes that come with it: “It’s unsettling and scary to have people have an opinion about you and take an interest in your family who don’t know you.”\n\nMcNearney’s emergence as a voice of a movement came April 21, when the couple’s second child, a son named Billy, was born with a congenital heart defect. Rather than keep quiet about the harrowing situation, she and Kimmel agreed that Billy’s condition would be discussed on the ABC late-night show, both as an explanation for the host’s weeklong absence and as an opportunity to support the Affordable Care Act, which was on the verge of congressional repeal. (Access to health care has remained a powerful theme on JKL! as well as on both parents’ social media feeds.) The decision to speak out has thrust Kimmel and to a lesser extent his wife into a hugely divisive debate. Along with a surge in ratings and publicity has come a vicious backlash from those who accuse the Kimmel family of exploiting their child’s condition for political purposes.\n\nSeated in the JKL! greenroom in the heart of Hollywood in November, McNearney vacillates between tears and laughter as she reflects on the tumultuous year: “There have definitely been times where I couldn’t help but think, ‘Life would be so much easier if we could just go back to making fun of the Kardashians.’ “\n\n•••\n\nBilly arrived, and everything seemed fine.\n\nThree hours later, we were in the recovery room, and the nurse started to ask me a lot of questions that I thought seemed strange. “Did he kick a lot when he was in you?” Yeah, he kicked a lot, but, I thought, who cares? He’s out now. “More than Jane [your older daughter]?” she asked. Yeah. I didn’t know what any of this had to do with anything. Then she said, “I’m going to take him out of the room for a few minutes,” and I didn’t think anything of it. “And Jimmy’s going to come with us.” Jimmy didn’t seem concerned, and they left the room. Twenty minutes went by, then 30 minutes, 40 minutes. … I started to get worried.\n\nThen a doctor I’d never seen before came in the room — and I knew. He sat down on the bed and put his hand on my knee, and I just burst into tears. “Where is he?” I said. “Where is the baby?”\n\nThe doctor told me there’s an issue, it’s either his heart or his lung. From that moment on, it became a whirlwind of medical jargon and information I never knew I would have to understand. I was brought up to the neonatal intensive care unit, and I saw him there in his incubator with all these tubes in him. Jimmy was already there. He had watched it all happen: more and more people coming into the room, putting more and more things in him. After listening to a lot of opinions, we made the decision to move him to Children’s Hospital Los Angeles for open-heart surgery, which Billy had when he was just 3 days old.\n\nIt was all so crazy.\n\nOn day six or so of us being in the hospital, we knew it was time to start thinking about Jimmy going back to work. I remember it had been a really long day at the hospital, and we were in the car going home to have dinner with our daughter, and Jimmy turned to me and said, “I want to talk about Billy on the show on Monday.” I said, “OK.” And then he said, “And I want to talk about the health care problem in this country.” Again, I didn’t think much of it. I figured he’d tell the story and then he’d probably cry because, well, he once cried on the show over a lion dying.\n\nThat Monday, Billy was finally home, and Jimmy was back at work. Even though I was on maternity leave, I was still getting all of my work emails, and I didn’t get one with the monologue for that night. I emailed Jimmy, and he said, “I just want you to watch.” So, there I am, in my living room breastfeeding Billy with my mom beside me, and we’re watching. I sobbed through the entire thing. I couldn’t believe the strength that it took to tell that story a week after it happened. He didn’t have to do that. Our family has excellent health care; he had nothing to gain from that. He did it for the other people whom we met in that hospital. He came home that night, and I just hugged him and I wouldn’t let go.\n\nAt that point I thought what Jimmy had done was incredible, but I didn’t think it would make much of a difference. Of course, I couldn’t have been more wrong. The positive response was and still is overwhelming. Jimmy and I can’t go anywhere without someone coming up and thanking him for that monologue. Now, people interrupting our dinner isn’t annoying to me anymore because I’m so thankful that they show their gratitude toward him and what he did. Then came the criticism. People attacking us for politicizing what happened to our baby, which to me is truly crazy. We took a personal experience and we shared it with the world, and then it just so happened that this was going on while people were trying to take health care away from children like ours. People were sending letters to our home, attacking both of us on Twitter, saying things like we deserve this and we’re terrible people. That’s been the ugliest part of all of this, and it’s been harder for me to deal with than the weekly cardiologist appointments and making sure my baby is breathing properly. I got off Twitter for a while, and now that I’m back I just refuse to look at my replies, which makes me sad because a lot of it is mothers who have children with similar defects who are grateful for what we’re doing. Nine out of 10 are positive, but that one nasty one will shake me.\n\nI just don’t understand. To me, children having access to health care, no matter what their parents’ income, should not be a divisive issue, but that’s where we are as a country right now. I’ll admit I had never been a political person until recently — until Hillary lost. I remember the day after she did, I came to work and I was numb. I had just watched her concession speech with my daughter, who was 2 at the time, on my lap, and then I came in, went in to Jimmy’s office and burst into tears. I told him, “I don’t know if I can do this anymore.” I’d been looking forward to coming in here and not having to watch Donald Trump clips anymore. Once she won, Trump wasn’t going to be the lead story every night. I envy the friends of mine who say, “I’m not going to pay attention this week.” I don’t have the luxury of turning off the news. I have to watch. I can’t write the show if I don’t know the terrible things that he’s said and done.\n\nAt the same time, I know it was good for me to start listening to other people. I have family members and friends who voted for Trump. My dad voted for him. I needed to understand why. I also became much more active. Like a lot of people that morning, I saw things being stripped away that were really important to me, and I didn’t want to sit on the sidelines. So I began researching things, signing up for emails and donating to causes like the environment and sensible gun legislation that were important to me. And now, after Billy, access to health care.\n\nLook, there’s something almost every day that we could be going after, something we could try to be the voice of. But I think that would be a disservice, so we have to stay focused on the few things that are really personal for us. It just so happens that this year Jimmy had a health scare with a child when health care was up for debate, and then people were being gunned down in his hometown [of Las Vegas]. He couldn’t sit quiet, and I’m so glad he didn’t. The monologues he delivered on both of those nights were so personal to him. He had 14 writers sitting in a room ready to write, and he said, “I got this,” and went into his own office and closed the door. That was all him, all his heart.\n\nI don’t necessarily like that everyone knows what’s going on with the health of my child. And it’s scary to make yourself vulnerable the way we have, but the encouragement that we’re helping other people far outweighs my fears about our lack of privacy. If we were to do this all over again and someone said, “You would have an opportunity to have a perfectly healthy baby boy,” I would take the one we got because I think it helped a lot of families. We didn’t anticipate we would be in this position, but we were, and we made the most of it. And thank God this will, fingers crossed, end in a positive way because we get asked about him everywhere we go, and I’m not sure we would ever be able to leave the house. I swear, we haven’t gone to a coffee shop, filled up the gas tank, done anything without someone asking us how Billy is doing, and, thank God, we get to say something positive.\n\nJust yesterday, I was cleaning shit out of his socks, and all I could think was, “Oh honey, you are so unaware right now. You have no idea you have a letter from Obama on your wall.” There’s one from George W. Bush hanging up, too. I’m looking forward to the day that I get to tell him about all of this. I want to be the one to tell Billy what his dad did for him.\n\n[Editor’s Note: Billy Kimmel underwent his second successful heart surgery Dec. 4.]\n\nThis story first appeared in the 2017 Women in Entertainment Power 100 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "images": ["http://www.hollywoodreporter.com/sites/default/files/custom/Annie/THR_woe-embeds2x.png", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/_subject_img_1596-embed.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/111717thr_mollymcnearney2610-h_2017_thr.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/img_0695-embed.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-617638124-embed.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/111717thr_mollymcnearney2610-h_2017_thr.jpg?w=1296&h=730&crop=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/111717thr_mollymcnearney2610-h_2017_thr.jpg?w=1024", "keywords": [], "authors": ["Molly Mcnearney As Told To Lacey Rose"], "canonical_link": "https://www.hollywoodreporter.com/lifestyle/lifestyle-news/jimmy-kimmels-wife-head-writer-why-we-shared-babys-trauma-what-came-1063489/", "title": "Jimmy Kimmel’s Wife and Head Writer: Why We Shared Our Baby’s Trauma (and What Came After)", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "'Jimmy Kimmel Live!' producer and co-head writer Molly McNearney opens up about her son's trauma and her decision, with husband Kimmel, to thrust the whole family into a heavily politicized debate over affordable healthcare.", "news_keywords": "autoplay, Women in Entertainment, Women in Entertainment 2017", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Molly McNearney as told to Lacey Rose", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1063489, "title": "Jimmy Kimmel's Wife and Head Writer: Why We Shared Our Baby's Trauma (and What Came After)", "published_at": "2017-12-06 06:20:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/111717thr_mollymcnearney2610-h_2017_thr.jpg?w=1024", "comment_count": 0, "tags": "Women in Entertainment 2017", "topics": "Lifestyle News", "body": "Molly McNearney never set out to be a recognizable face, never mind a voice of a movement.\r\nThe recognizable face part came first. It began in late 2009, when the Jimmy Kimmel Live! producer and co-head writer started dating her boss. Every bone in McNearney's body knew it was a bad idea, and not just because the St. Louis native was then the only female in the show's writers room and was dead set on fitting in. \"I remember telling Jimmy, 'If this doesn't work out, nothing in your life changes,' \" she says, \"but mine changes completely.\" It was left to Kimmel, who had been married once before, to impart to her his confidence that this was something more than a workplace fling.\r\nThat their romance has survived — Kimmel, 50, and McNearney, 39, wed in 2013 and now have two children together — is, at least in part, a credit to the way they have committed to keeping their work life separate from their personal one. Most of the time, anyway. \"Occasionally,\" she admits, \"I'll be brushing my teeth at night and go, 'Really? That was a good idea that you rejected today.' \" Though McNearney has with time gotten comfortable with her boss by day, husband by night setup, she insists she'll never fully adjust to the prying eyes that come with it: \"It's unsettling and scary to have people have an opinion about you and take an interest in your family who don't know you.\" \r\nMcNearney's emergence as a voice of a movement came April 21, when the couple's second child, a son named Billy, was born with a congenital heart defect. Rather than keep quiet about the harrowing situation, she and Kimmel agreed that Billy's condition would be discussed on the ABC late-night show, both as an explanation for the host's weeklong absence and as an opportunity to support the Affordable Care Act, which was on the verge of congressional repeal. (Access to health care has remained a powerful theme on JKL! as well as on both parents' social media feeds.) The decision to speak out has thrust Kimmel and to a lesser extent his wife into a hugely divisive debate. Along with a surge in ratings and publicity has come a vicious backlash from those who accuse the Kimmel family of exploiting their child's condition for political purposes.\r\nSeated in the JKL! greenroom in the heart of Hollywood in November, McNearney vacillates between tears and laughter as she reflects on the tumultuous year: \"There have definitely been times where I couldn't help but think, 'Life would be so much easier if we could just go back to making fun of the Kardashians.' \"\r\n•••\r\nBilly arrived, and everything seemed fine.\r\nThree hours later, we were in the recovery room, and the nurse started to ask me a lot of questions that I thought seemed strange. \"Did he kick a lot when he was in you?\" Yeah, he kicked a lot, but, I thought, who cares? He's out now. \"More than Jane [your older daughter]?\" she asked. Yeah. I didn't know what any of this had to do with anything. Then she said, \"I'm going to take him out of the room for a few minutes,\" and I didn't think anything of it. \"And Jimmy's going to come with us.\" Jimmy didn't seem concerned, and they left the room. Twenty minutes went by, then 30 minutes, 40 minutes. … I started to get worried.\r\nThen a doctor I'd never seen before came in the room — and I knew. He sat down on the bed and put his hand on my knee, and I just burst into tears. \"Where is he?\" I said. \"Where is the baby?\"\r\nThe doctor told me there's an issue, it's either his heart or his lung. From that moment on, it became a whirlwind of medical jargon and information I never knew I would have to understand. I was brought up to the neonatal intensive care unit, and I saw him there in his incubator with all these tubes in him. Jimmy was already there. He had watched it all happen: more and more people coming into the room, putting more and more things in him. After listening to a lot of opinions, we made the decision to move him to Children's Hospital Los Angeles for open-heart surgery, which Billy had when he was just 3 days old.\r\n\r\nIt was all so crazy.\r\nOn day six or so of us being in the hospital, we knew it was time to start thinking about Jimmy going back to work. I remember it had been a really long day at the hospital, and we were in the car going home to have dinner with our daughter, and Jimmy turned to me and said, \"I want to talk about Billy on the show on Monday.\" I said, \"OK.\" And then he said, \"And I want to talk about the health care problem in this country.\" Again, I didn't think much of it. I figured he'd tell the story and then he'd probably cry because, well, he once cried on the show over a lion dying.\r\nThat Monday, Billy was finally home, and Jimmy was back at work. Even though I was on maternity leave, I was still getting all of my work emails, and I didn't get one with the monologue for that night. I emailed Jimmy, and he said, \"I just want you to watch.\" So, there I am, in my living room breastfeeding Billy with my mom beside me, and we're watching. I sobbed through the entire thing. I couldn't believe the strength that it took to tell that story a week after it happened. He didn't have to do that. Our family has excellent health care; he had nothing to gain from that. He did it for the other people whom we met in that hospital. He came home that night, and I just hugged him and I wouldn't let go.\r\n\r\nAt that point I thought what Jimmy had done was incredible, but I didn't think it would make much of a difference. Of course, I couldn't have been more wrong. The positive response was and still is overwhelming. Jimmy and I can't go anywhere without someone coming up and thanking him for that monologue. Now, people interrupting our dinner isn't annoying to me anymore because I'm so thankful that they show their gratitude toward him and what he did. Then came the criticism. People attacking us for politicizing what happened to our baby, which to me is truly crazy. We took a personal experience and we shared it with the world, and then it just so happened that this was going on while people were trying to take health care away from children like ours. People were sending letters to our home, attacking both of us on Twitter, saying things like we deserve this and we're terrible people. That's been the ugliest part of all of this, and it's been harder for me to deal with than the weekly cardiologist appointments and making sure my baby is breathing properly. I got off Twitter for a while, and now that I'm back I just refuse to look at my replies, which makes me sad because a lot of it is mothers who have children with similar defects who are grateful for what we're doing. Nine out of 10 are positive, but that one nasty one will shake me.\r\n\r\nI just don't understand. To me, children having access to health care, no matter what their parents' income, should not be a divisive issue, but that's where we are as a country right now. I'll admit I had never been a political person until recently — until Hillary lost. I remember the day after she did, I came to work and I was numb. I had just watched her concession speech with my daughter, who was 2 at the time, on my lap, and then I came in, went in to Jimmy's office and burst into tears. I told him, \"I don't know if I can do this anymore.\" I'd been looking forward to coming in here and not having to watch Donald Trump clips anymore. Once she won, Trump wasn't going to be the lead story every night. I envy the friends of mine who say, \"I'm not going to pay attention this week.\" I don't have the luxury of turning off the news. I have to watch. I can't write the show if I don't know the terrible things that he's said and done.\r\nAt the same time, I know it was good for me to start listening to other people. I have family members and friends who voted for Trump. My dad voted for him. I needed to understand why. I also became much more active. Like a lot of people that morning, I saw things being stripped away that were really important to me, and I didn't want to sit on the sidelines. So I began researching things, signing up for emails and donating to causes like the environment and sensible gun legislation that were important to me. And now, after Billy, access to health care.\r\nLook, there's something almost every day that we could be going after, something we could try to be the voice of. But I think that would be a disservice, so we have to stay focused on the few things that are really personal for us. It just so happens that this year Jimmy had a health scare with a child when health care was up for debate, and then people were being gunned down in his hometown [of Las Vegas]. He couldn't sit quiet, and I'm so glad he didn't. The monologues he delivered on both of those nights were so personal to him. He had 14 writers sitting in a room ready to write, and he said, \"I got this,\" and went into his own office and closed the door. That was all him, all his heart.\r\n\r\nI don't necessarily like that everyone knows what's going on with the health of my child. And it's scary to make yourself vulnerable the way we have, but the encouragement that we're helping other people far outweighs my fears about our lack of privacy. If we were to do this all over again and someone said, \"You would have an opportunity to have a perfectly healthy baby boy,\" I would take the one we got because I think it helped a lot of families. We didn't anticipate we would be in this position, but we were, and we made the most of it. And thank God this will, fingers crossed, end in a positive way because we get asked about him everywhere we go, and I'm not sure we would ever be able to leave the house. I swear, we haven't gone to a coffee shop, filled up the gas tank, done anything without someone asking us how Billy is doing, and, thank God, we get to say something positive.\r\nJust yesterday, I was cleaning shit out of his socks, and all I could think was, \"Oh honey, you are so unaware right now. You have no idea you have a letter from Obama on your wall.\" There's one from George W. Bush hanging up, too. I'm looking forward to the day that I get to tell him about all of this. I want to be the one to tell Billy what his dad did for him.\r\n[Editor's Note: Billy Kimmel underwent his second successful heart surgery Dec. 4.]\r\n\r\n\r\n\r\nThis story first appeared in the 2017 Women in Entertainment Power 100 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Jimmy Kimmel’s Wife and Head Writer: Why We Shared Our Baby’s Trauma (and What Came After)", "url": "https://www.hollywoodreporter.com/lifestyle/lifestyle-news/jimmy-kimmels-wife-head-writer-why-we-shared-babys-trauma-what-came-1063489/", "description": "‘Jimmy Kimmel Live!’ producer and co-head writer Molly McNearney opens up about her son’s trauma and her decision, with husband Kimmel, to thrust the whole family into a heavily p…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/111717thr_mollymcnearney2610-h_2017_thr.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-12-06T06:20:00+00:00", "modified_time": "2017-12-06T12:22:38+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Jimmy Kimmel’s Wife and Head Writer: Why We Shared Our Baby’s Trauma (and What Came After)", "description": "‘Jimmy Kimmel Live!’ producer and co-head writer Molly McNearney opens up about her son’s trauma and her decision, with husband Kimmel, to thrust the whole family into a heavily p…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/111717thr_mollymcnearney2610-h_2017_thr.jpg?w=1296"}}, "movies": [], "publish_date": 1512541200.0, "source": "https://www.hollywoodreporter.com", "summary": ""}