{"url": "https://www.standard.co.uk/fashion/news/victorias-secret-fashion-show-2017-bella-hadid-joins-adriana-lima-and-alessandra-ambrosio-backstage-a3695831.html", "text": "With the Victoria's Secret Fashion Show just moments away, models walking this year's extravaganza had an early start this morning as they made their way backstage for preening.\n\nTaking place in Shanghai for the first time in the runway's history, the showcase kicks off at 8pm local time - 12pm GMT.\n\nJoining the models this year for her second VS fashion show is Bella Hadid.\n\nHaving made her debut walking for the lingerie giant in Paris last year alongside older sister Gigi, Bella this year is the only Hadid walking after Gigi pulled out just last week.\n\nAlso absent this year is the Hadid sisters' good friend Kendall Jenner, who is skipping this year due to a contractual agreement with rival lingerie brand La Perla of which she is the face.\n\nBut while Gigi and Kendall are notable absences from this year's line up, there is a smorgasbord of well-known and legendary Victoria's Secret models returning to the runway today.\n\nAdriana Lima, Alessandra Ambrosio, Jasmine Tookes, and Stella Maxwell are all in Shanghai for the show, while Candice Swanepoel regains her place having stepped away from the catwalk for 2016 to have her baby.\n\nKarlie Kloss also returns to the line up having left the brand two years ago.\n\nVictoria's Secret Fashion Show 2017: Confirmed Model Line-up 1 /72 Victoria's Secret Fashion Show 2017: Confirmed Model Line-up Walked before Karlie Kloss Tristan Fewings/Getty Images Walked before Candice Swanepoel Getty Images Walked before Sara Sampaio Getty Images for Victoria's Secret Walked before Adriana Lima Getty Images for Victoria's Secret Walked before Devon Windsor Getty Images for Victoria's Secret Walked before Josephine Skriver Getty Images for Swarovski Walked before Bella Hadid Getty Images for Victoria's Secret Walked before Jasmine Tookes Getty Images for Victoria's Secret Walked before Taylor Hill Getty Images for Victoria's Secret Walked before Alessandra Ambrosio Getty Images for Swarovski Newcomer Gizele Oliveira Getty Images Walked before Lily Aldridge Getty Images for Victoria's Secret Newcomer Mayowa Nicholas AFP/Getty Images Walked before Barbara Fialho AFP/Getty Images Walked before Jourdana Phillips Getty Images for Victoria's Secret Walked before Kelly Gale Getty Images for Victoria's Secret Walked before Zuri Tibby Getty Images for Victoria's Secret Newcomer Vanessa Moody Getty Images for Visionaire Walked before Stella Maxwell Getty Images for Swarovski Newcomer Amilna Estevao AFP/Getty Images Walked before Blanca Padilla Getty Images for Victoria's Secret Walked before Daniela Braga Getty Images for Victoria's Secret Newcomer Grace Bol Getty Images for Veuve Clicquot Newcomer Aiden Curtiss Getty Images for Foundation Figh Newcomer Xin Xie instagram.com/xinxiexx Walked before Martha Hunt Getty Images for Victoria's Secret Newcomer Alecia Morais instagram.com/alecia_morais Walked before Alanna Arrington Getty Images for Victoria's Secret Walked before Leila Nda AFP/Getty Images Walked before Bruna Lirio Getty Images Walked before Maria Borges Getty Images for Victoria's Secret Newcomer Frida Aasen Getty Images Newcomer Samile Bermannelli Getty Images for Marc Jacobs Walked before Liu Wen Walked before Shu Pei Qin Getty Images Newcomer Victoria Lee instagram.com/victorial24 Walked before Sui He Getty Images for Swarovski Newcomer Nadine Leopold Getty Images for Wynn Las Vegas Walked before Herieth Paul Getty Images for Victoria's Secret Walked before Maggie Laine Getty Images for Victoria's Secret Walked before Lais Ribeiro Getty Images for Victoria's Secret Walked before Grace Elizabeth Getty Images for Victoria's Secret Newcomer Estelle Chen instagram.com/chen_estelle Walked before Dilone Getty Images for Victoria's Secret Walked before Romee Strijd Getty Images for Victoria's Secret Newcomer Roos Marijn de Kok instagram.com/roosmarijndekok Walked before Elsa Hosk Getty Images for Victoria's Secret Walked before Sanne Vloet Getty Images for Victoria's Secret Walked before Leomie Anderson Getty Images for Victoria's Secret Newcomer Alexina Graham Getty Images for amfAR Walked before Megan Williams Getty Images for Victoria's Secret Walked before Ming Xi Getty Images for Victoria's Secret Walked before Lameka Fox Getty Images for Victoria's Secret Walked before Cindy Bruna AFP/Getty Images\n\nPhotographed together backstage, the girls joined the brand's first ever high fashion runway collaborator Olivier Rousteing of Balmain ahead of today's debut.\n\nTake a look through our gallery above to see the models as they prepare backstage for one of the biggest catwalk shows of the year", "images": ["https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/20/11/vsbackstagebella.jpg?width=1200&width=1200&auto=webp&quality=75", "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/20/10/vsbackstage21.jpg?width=230", "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/20/11/vsbackstagebella.jpg?width=968"], "top_img": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/20/11/vsbackstagebella.jpg?width=1200&width=1200&auto=webp&quality=75", "keywords": [], "authors": ["Charlie Teather"], "canonical_link": "https://www.standard.co.uk/insider/fashion/victoria-s-secret-fashion-show-2017-bella-hadid-joins-adriana-lima-and-alessandra-ambrosio-backstage-a3695831.html", "title": "Victoria's Secret Fashion Show 2017: Bella Hadid joins Adriana Lima and Alessandra Ambrosio backstage", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "description": "The Victoria's Secret Fashion Show kicks off in Shanghai at 12pm GMT", "theme-color": "#FFFFFF", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 193840110715213, "pages": 165348596842143}, "category": "Fashion", "sitename": "Evening Standard", "page path": "/insider/fashion", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "site_name": "Evening Standard", "updated_time": "2017-11-20T12:59:16.000Z", "title": "Bella Hadid joins models backstage at Victoria's Secret Fashion Show", "url": "https://www.standard.co.uk/insider/fashion/victoria-s-secret-fashion-show-2017-bella-hadid-joins-adriana-lima-and-alessandra-ambrosio-backstage-a3695831.html", "type": "article", "description": "The Victoria's Secret Fashion Show kicks off in Shanghai at 12pm GMT", "image": {"identifier": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/20/11/vsbackstagebella.jpg?width=1200&width=1200&auto=webp&quality=75", "secure_url": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/20/11/vsbackstagebella.jpg?width=1200&width=1200&auto=webp&quality=75"}}, "twitter": {"site": "@EveningStandard", "card": "summary_large_image", "description": "The Victoria's Secret Fashion Show kicks off in Shanghai at 12pm GMT", "image": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2017/11/20/11/vsbackstagebella.jpg?width=1200&width=1200&auto=webp&quality=75", "title": "Bella Hadid joins models backstage at Victoria's Secret Fashion Show"}, "article": {"published_time": "2017-11-20T12:59:16.000Z", "modified_time": "2017-11-20T12:59:16.000Z", "section": "Insider", "subsection": "Fashion", "author_name": "Charlie Teather", "content_type": "story", "word_count": 417, "image_count": 1, "embed_count": 3, "video_count": 0, "internal_link_count": 6, "external_link_count": 0}, "date": "2017-11-20T12:59:16.000Z", "author": "Charlie Teather", "publisher": "Evening Standard", "vf": {"url": "https://www.standard.co.uk/insider/fashion/victoria-s-secret-fashion-show-2017-bella-hadid-joins-adriana-lima-and-alessandra-ambrosio-backstage-a3695831.html"}, "keywords": "Victoria's Secret, Bella Hadid, Alessandra Ambrosio, Adriana Lima, Candice Swanepoel, Olivier Rousteing, Balmain, Jasmine Tookes, Stella Maxwell"}, "movies": [], "publish_date": 1511182756.0, "source": "https://www.standard.co.uk", "summary": ""}