{"url": "https://www.usatoday.com/story/life/2018/06/21/melania-trump-wears-dont-care-coat-visit-migrant-kids-texas/722620002/", "text": "Melania Trump wears an 'I don't care' jacket to visit immigrant children in Texas\n\nShow Caption Hide Caption Melania Trump jacket says 'I DON'T REALLY CARE, DO U?' First lady Melania Trump wore a jacket that read \"I DON'T REALLY CARE, DO U?\" while on her way to visit immigrant children separated from their parents. USA TODAY\n\nMelania Trump, first lady of surprises, had another one Thursday when she donned a short trench coat with a startling message scrawled on the back for her unexpected trip to Texas to visit a migrant children's shelter.\n\n\"I REALLY DON'T CARE, DO U?\" read the white letters on the back of the military-green jacket, identified as a $39 item sold by Zara, according to The Daily Mail.\n\nIt seemed a contradictory message for Trump's mission to Texas, where she hoped to demonstrate how much she cares about the children separated from their parents and housed in shelters there.\n\nTrump said she wanted to learn more about how these children can be reunited with their parents \"as quickly as possible.\"\n\nIn an email to USA TODAY, her spokeswoman, Stephanie Grisham, dismissed the idea there was anything wrong with the jacket, which Trump was wearing again when she returned to Washington Thursday evening.\n\n\"It's a jacket. There was no hidden message. After today's important visit to Texas, I hope the media isn't going to choose to focus on her wardrobe,\" Grisham said.\n\nLater Thursday, the president weighed in on the meaning of his wife's message jacket. It was a slam at the media, or as he habitually calls them: \"Fake News Media.\"\n\n“I REALLY DON’T CARE, DO U?” written on the back of Melania’s jacket, refers to the Fake News Media. Melania has learned how dishonest they are, and she truly no longer cares!\" he tweeted.\n\n“I REALLY DON’T CARE, DO U?” written on the back of Melania’s jacket, refers to the Fake News Media. Melania has learned how dishonest they are, and she truly no longer cares! — Donald J. Trump (@realDonaldTrump) June 21, 2018\n\nThe pictures of Trump in the hooded jacket showed her boarding her jet (the FLOTUS plane is known as Executive One Foxtrot) at Andrews Air Force Base in suburban Washington Thursday morning. But it wasn't entirely clear what the white, graffiti-style lettering said.\n\nThe reporters in the press pool that accompanied her apparently didn't see it; photographers did notice it and brought it up with Grisham later during the surprise visit to McAllen, Texas, to meet children separated from their parents at the Texas border with Mexico.\n\nBy the time she arrived at the Upbring New Hope Children's Center, run by the Lutheran Social Services of the South in McAllen, she had ditched the jacket. Underneath she wore white jeans, a white trench-style shirt and white sneakers.\n\nGrisham said any questions about her choice of jacket (it was raining heavily in McAllen when she arrived) are as inconsequential as the criticism on social media last year about the towering heels Trump wore to get on Air Force One when she traveled to Texas to see recovery efforts after Hurricane Harvey.\n\nShe had changed into more sensible sneakers by the time she got off the plane in Texas but the Twitterverse had a field day sneering.\n\nToday’s visit w the children in Texas impacted @flotus greatly. If media would spend their time & energy on her actions & efforts to help kids - rather than speculate & focus on her wardrobe - we could get so much accomplished on behalf of children. #SheCares #ItsJustAJacket — Stephanie Grisham (@StephGrisham45) June 21, 2018\n\nTrump was wearing the jacket again when she returned to Washington and got off the plane. Meanwhile, Grisham tweeted annoyance at the media for even asking about the jacket.\n\n\"Today’s visit w the children in Texas impacted @flotus greatly. If media would spend their time & energy on her actions & efforts to help kids - rather than speculate & focus on her wardrobe - we could get so much accomplished on behalf of children,\" she lamented.\n\nIn fact, the first lady's sartorial choices have been fodder for several episodes of Twitter mocking, including the $51,000 Dolce & Gabbana jacket she wore in Italy last year.", "images": ["https://www.gannett-cdn.com/-mm-/3f3126fa85817555ec8cd33b7000776e7f18edee/c=0-182-2005-1315/local/-/media/2018/06/21/USATODAY/USATODAY/636651902689322062-AP-Melania-Trump.6.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png", "http://www.gannett-cdn.com/-mm-/32314a24526b0450fa578b036dd877be10d51f15/c=4-0-1916-1080&r=1280x720/local/-/media/2018/06/21/USATODAY/USATODAY/636652065567290778-VPC-MELANIA-JACKET-DESKTOP-THUMB.jpg", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg"], "top_img": "https://www.gannett-cdn.com/-mm-/3f3126fa85817555ec8cd33b7000776e7f18edee/c=0-182-2005-1315/local/-/media/2018/06/21/USATODAY/USATODAY/636651902689322062-AP-Melania-Trump.6.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Maria Puente"], "canonical_link": "https://www.usatoday.com/story/life/2018/06/21/melania-trump-wears-dont-care-coat-visit-migrant-kids-texas/722620002/", "title": "Melania Trump wears an 'I don't care' jacket to visit immigrant children in Texas", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/2018/06/21/melania-trump-wears-dont-care-coat-visit-migrant-kids-texas/722620002/life", "theme-color": "#ffffff", "og": {"type": "article", "title": "Melania Trump wears an 'I don't care' jacket to visit immigrant children in Texas", "description": "Was this the right message for Melania Trump to wear on her jacket during her humanitarian mission to a Texas shelter for migrant children?", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/3f3126fa85817555ec8cd33b7000776e7f18edee/c=0-182-2005-1315/local/-/media/2018/06/21/USATODAY/USATODAY/636651902689322062-AP-Melania-Trump.6.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Was this the right message for Melania Trump to wear on her jacket during her humanitarian mission to a Texas shelter for migrant children?", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1529535600.0, "source": "https://www.usatoday.com", "summary": ""}