{"url": "https://people.com/tv/khloe-kardashian-slams-tristan-thompson-for-cheating/", "text": "Tristan Thompson‘s cheating scandal unfolded for all to see on Sunday night’s episode of Keeping Up with the Kardashians.\n\nAs Khloé Kardashian prepared to welcome the couple’s first child, daughter True Thompson, on April 12 in Cleveland, she was still reeling from the revelation that Thompson had cheated on her, news of which broke after photos surfaced of him getting close to another woman just days before. Nevertheless, the mom-to-be decided that she wanted to put her feelings aside for the birth of her baby girl.\n\n“It’s important for me to stick to my birthing plan, because this is something that I’ve waited for my entire life,” said Khloé, 34. “I don’t want to take away anything from this moment. I’ve always been a big believer of don’t make permanent decisions off of temporary emotions. I want Tristan here with me, I want to experience this magical moment.”\n\n“I want this for me and my daughter, and for him, at the end of the day,” she continued. “I’m mature enough to say that. I’m mature enough to put personal feelings aside. Me and Tristan will deal with him and I at a later time, when this isn’t affecting our child.”\n\nMom Kris Jenner and sisters Kim and Kourtney Kardashian flew in from Los Angeles, and while there were certainly some tense moments in the delivery room, everyone managed to remain relatively cordial.\n\n“The vibe in the room is calm. I thought there would be way more tension,” said Kim, 38. “As much as I want to go off, I just don’t think it’s the time. So I’m going to keep it cute. I don’t have to have a lot of interaction, I just have to be there for her.”\n\nWhen True was born at 4:00 a.m. — Kris delivered her, and Thompson cut the umbilical cord — Khloé was overwhelmed with emotion.\n\n“You’re experiencing a miracle take place,” she reflected afterward. “I’ve always dreamed of being a mom, and I think I came to the place where I didn’t know if that was actually going to happen for me, so the fact that we’re in a delivery room — for myself this time, for me to give birth — it’s just unreal.”\n\n“I feel so blessed. This is something that I’ve waited for forever. I can’t wait to meet her and just spend the rest of my life with her. The minute I met my daughter — I cannot believe I’m even saying the words ‘my daughter’ — I was so in love with her. She’s just perfect.”\n\n“I was so anxious about having everybody in the hospital room because it was really crucial and important for me that it was a very healthy, happy, positive experience,” she added. “And everyone put their differences aside for that moment. I’m really grateful for that. But obviously, there’s a big elephant in the room.”\n\nSPW/SplashNews.com\n\nAs for the state of her relationship with Thompson, 27?\n\n“My focus is not if we’re going to be together or not,” she said. “My focus is just on my daughter and having these beginning moments with my daughter and seeing him be such a great father to her — that’s really what’s important to me.”\n\nKhloé also touched on how she decided on the name True, revealing that it was Kris’ mother MJ that suggested it initially. (Khloé’s great-grandfather was named True, too.)\n\n“I knew that I wanted the initials T.T., because I love that my initials are K.K.,” she said. “I was at dinner one night at my mom’s house and MJ was there and I told her that. … We kept going back and forth, and True was the only one that really made the cut.”\n\nA few days later, Kris and her daughters flew back to Cleveland to have a private, off-camera discussion with Thompson about the situation.\n\n“Tristan said to me that he wants to talk with my sisters and my mom. I have my own personal feelings because this happened to me, but my sisters also have their feelings and they are very much entitled to that,” Khloé said. “When there’s drama, people love to be like, ‘Well, this is my relationship, I don’t need to involve people.’ Well, in this family, you do.”\n\n“I’ve always been very respectful that this is not Tristan’s career, and having conversations like this isn’t comfortable for him on camera,” she continued. “He might not want to be as vulnerable as he normally would in private. Me and Tristan will deal with this at a later time, because there are some things [that are] deeper than being documented. It takes more time than just an episode.”\n\nOn top of everything, the new mom was struggling with the fact that that she also had to deal with the situation playing out in the public eye.\n\n“It’s so much harder to deal with it when it’s so public. Everyone is giving you their opinions and their input and their unsolicited advice,” she said. “Even the nurses and the doctors — everyone kind of like, looking sideways at the whole situation. That’s hard, and it’s humiliating.”\n\n“He obviously f—ed up, major, but I’m not sure how I feel about everything right now,” she added. “In two weeks I might be like, ‘You know what? I don’t trust you and this isn’t for me.’ Or I might say, ‘This is perfect. Let’s keep it going.’ ”\n\nRELATED VIDEO: Most Iconic Kardashian Moments\n\nBack in Los Angeles, Kim filled in cousin Cici Bussey about how the conversation with Thompson went, admitting that she couldn’t help but question whether he was sincerely remorseful.\n\n“I told him, ‘I think you’re more remorseful because it’s affecting your job,’ ” she said. “I think he’s more embarrassed that he looks stupid, because of the public … booing him. And I think it’s more of that than anything, and I told him that.”\n\n“I think the convo was going okay at the beginning and then it got heated. I don’t know, it just kind of took a left turn,” she added. “Overall, I think it was definitely necessary for us to let out how we all felt, and since he is the father of Khloé’s baby, I definitely wanted to take the time to hear what he had to say.”\n\nMaking matters even more complicated was that Kim was scheduled to appear on the Ellen DeGeneres Show. Inevitably, she was asked about Thompson and admitted that his actions were “so f—ed up.” When she called her sister afterwards to give her a heads up, Khloé sounded defeated.\n\n“It is f—ed up. And he’s a complete piece of s—,” she said. “Honestly, you can feel however you want, but I’ve got other s— to deal with right now.”\n\nBut Kim’s interview didn’t bode well with Thompson, and when Khloé told her sister that he thought she was being an “instigator,” Kim was furious.\n\n“I unfollowed him on Instagram. He should be embarrassed,” she fumed to Kourtney, 39. “I literally wrote to [Khloé] and said, ‘Look, let’s change the subject. I love you and I support you, but I’m done with him. Over it.’ She just should have stood her ground.”\n\nBut Kourtney was more sympathetic, especially because she’d been through something similar with Scott Disick.\n\n“She should just do what’s in her heart and she should either give it a chance — if that’s what makes her feel best for her family, I’ve been there,” said Kourtney.\n\n“That’s not realistic,” Kim said.\n\n“I don’t think his intentions are right. I don’t think he’s going to change,” Kourtney said. “But I’m just saying, if she wants to feel like she’s trying for her own heart and know that she’s doing her best, then I don’t think there’s anything wrong with that. I think it takes a lot more strength to hang in there and try for your family than to just walk away.”\n\nEventually, Kim relented.\n\n“I won’t make her feel bad about anything, but I just generally don’t care to be around him,” she said. “Whatever makes her happy. I’ll stay out of the way.”\n\nKeeping Up with the Kardashians airs Sundays (9 p.m. ET) on E!", "images": ["https://people.com/thmb/e8ikhT7WEumh2JgyYdmpPD5tFWY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(764x279:766x281)/khloe-kardashian-889c5d51a4bd4cdeac8e3e3d463e7bd4.jpg", "https://people.com/thmb/8OHiG0nVdC7fatF5FVtcIOH5KcM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(677x0:679x2)/khloe-true-2000-5756e004e92142e396abbc6cd19e5122.jpg", "https://people.com/thmb/BUFdfvY2KbJfk2nHPNeHAU9zgGw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kim-kardashian-1-2000-aa5e512a6ca64c2a99be665965dbd56d.jpg", "https://people.com/thmb/LVT9ScvcABWPT27Tg2Q9Jva_HM8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(689x329:691x331)/Kardashian-Khloe-ABC-interview-8d6b152b8c7f49789d081a1c34ee2ff7.jpg", "https://people.com/thmb/oIOZm_8H5ge7udSQ-UaCh88U8yI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(782x0:784x2)/khloe-kardashian3-2000-50dd505127e341f0877f2e2d55943939.jpg", "https://people.com/thmb/Ei2-ehnsqd-75XpfCyKl-yrROBo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kardashian-thompson-1-2000-60ae8e45c57245e5a540cc737d2e9f4d.jpg", "https://people.com/thmb/xaENrvabXQ6UtqGDM4D6ztVJ3_8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/tristan-thompson-khloe-k-b7c484c8fe3a4f9eb54e3a16ec4a3bb3.jpg", "https://people.com/thmb/6u0XDC6YmiX0qphS85GL30Eqh0o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/kt_k-2000-553d7007b0df4896be4d109173f7b12c.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/OQhbUSd0zrNU_Jh03w7VUiUjhd4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/2way19-2000-d291b8423a0c4fa7994f2a70cb635010.jpg", "https://people.com/thmb/v2d3WxGgy4xHYKVbMtyf5UqIG_s=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/khloe-kardashian-1-1-501168935ce645afabd1228051e39550.jpg", "https://people.com/thmb/XV7tMKARqj37ga8ysYm9Z4ISbxc=/1241x2000/filters:fill(auto,1)/khloe3-ea583cfac9f84ad4b5d7ad424020b13f.jpg", "https://people.com/thmb/Cdi4ywBrAMLUZ9Kb9ZLwlAj6-Lw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(314x249:316x251)/The-Kardashians_01-4df03ab457d2441ca1a41a169f621a34.jpg", "https://people.com/thmb/duYcU_N2rT_bu5qAbGTdoJwcAr8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(619x0:621x2)/khloe3-ea583cfac9f84ad4b5d7ad424020b13f.jpg", "https://people.com/thmb/hILLtl3qhpWJQ_1en4pnCb9ZbXk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kardashian-thompson-1-2000x1333-6bdf5285b4af482787d1e9462920e574.jpg", "https://people.com/thmb/VJOE1oaLq_6y9_29mHeZe0V21LY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(725x0:727x2)/khloe-kardashian-87361254d6b8448e870c1085a5e9e705.jpg", "https://people.com/thmb/IAjI797-Nr9yqyHmwNZPwETYiIk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/khloe-kardashian-tristan-thompson3-6eeeaea9adb441cfba06c4c561daf49e.jpg"], "top_img": "https://people.com/thmb/XV7tMKARqj37ga8ysYm9Z4ISbxc=/1241x2000/filters:fill(auto,1)/khloe3-ea583cfac9f84ad4b5d7ad424020b13f.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/khloe-kardashian-slams-tristan-thompson-for-cheating/", "title": "Khloé Kardashian Calls Tristan Thompson a 'Complete Piece of S—' for Cheating on Her", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Khloé Kardashian admitted that giving birth after Tristan Thompson's cheating scandal went public was \"humiliating\"", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Aurelie Corinthios", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/tv/khloe-kardashian-slams-tristan-thompson-for-cheating/", "title": "Khloé Kardashian Calls Tristan Thompson a 'Complete Piece of S—' for Cheating on Her", "description": "Khloé Kardashian admitted that giving birth after Tristan Thompson's cheating scandal went public was \"humiliating\"", "image": "https://people.com/thmb/XV7tMKARqj37ga8ysYm9Z4ISbxc=/1241x2000/filters:fill(auto,1)/khloe3-ea583cfac9f84ad4b5d7ad424020b13f.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Khloé Kardashian Calls Tristan Thompson a 'Complete Piece of S—' for Cheating on Her", "description": "Khloé Kardashian admitted that giving birth after Tristan Thompson's cheating scandal went public was \"humiliating\"", "image": "https://people.com/thmb/XV7tMKARqj37ga8ysYm9Z4ISbxc=/1241x2000/filters:fill(auto,1)/khloe3-ea583cfac9f84ad4b5d7ad424020b13f.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}