{"url": "https://www.newyorker.com/culture/annals-of-gastronomy/the-joys-of-netflixs-nailed-it-the-baking-competition-that-celebrates-kitchen-disaster", "text": "When “Nailed It!,” a half-hour baking-competition show, débuted on Netflix, back in March, I binged all six episodes in one jubilant couch session. Last week, recognizing the early warning signs of a round of existential malaise, I parked myself in front of the TV for another emotionally restorative viewing. The absurdist, hilarious, occasionally incoherent series follows a standard cooking-competition format. In each episode, three contestants compete in progressively difficult challenge rounds for the chance at a cash prize. Instead of offering its participants a chance to show off their talents, though, “Nailed It!” sets each trio up for disaster, presenting them with confectionary challenges that far outstrip their cooking skills, which might generously be described as amateur. And disaster, right on cue, ensues: cakes topple, fondant cracks, chocolate burns, and rainbows of runny icing swirl together into muddy sugar swamps. A panel of judges—including the comedian Nicole Byer, dazzlingly charismatic, and the magnificent French chocolatier Jacques Torres—hoots with laughter, cringes in despair, and occasionally steps in to offer a little guidance. After assessing each confection, the judges send a winner (or, more accurately, a least-loser) home with ten thousand dollars.\n\n“Nailed It!” capitalizes on the Internet phenomenon of “Pinterest fails,” in which home cooks attempt one of the high-concept, high-design baking projects that are so popular on the social-media platform (think elaborately decorated cakes, doughnuts done up to look like pirates), then share images of the flawlessly executed original next to photos of their own dripping, desiccated, oozing mishaps. Often, the caption simply reads “Nailed it”—a self-appraisal that’s sarcastic and a bit nihilistic but also oddly joyous, a failure turned inside out to reveal something that’s like a less stuffy cousin of success. There might be a meticulous pleasure to be found in the precise at-home re-creation of, say, a towering layer cake adorned with fondant, piled with shaped chocolate, and airbrushed with food coloring until it resembles a long-haired princess in a teetering tower guarded by a fearsome dragon, with a stalwart knight ready to attack, but there’s a far more accessible joy in screwing it up mightily, throwing your hands in the air, and sharing your truly epic fail with the world.\n\nThat particular princess-tower cake shows up as the final challenge in the second episode of “Nailed It!.” (The winner of the previous challenge is crowned with an intensely kitschy gold-sequinned chef’s toque, which she must wear for the remainder of the show—an honor that, like so much else on the show, feels a little bit like a really fun punishment.) “I don’t mean to laugh, but your princess is terrifying,” Byer says to a contestant named Toni. She’s doubled over in laughter in front of the final reveal: a collapsed phallus of a castle tower made of underbaked vanilla cake coated in liver-beige frosting. The princess is demonic: a disembodied ball of fondant perched on one of the layers, with giant, staring white eyes, two snakelike nostrils poked in with a toothpick, and long blond hair that snakes down the buttercream walls like lumpy, overlong Cheetos.\n\nA show premised on highlighting its participants’ incompetence could easily veer toward cruelty, but, here, everyone is in on the joke. The mood is light, the judges are charming, and (notwithstanding the ten-thousand-dollar prize on the line) the stakes are low. Because of this, “Nailed It!” feels not like “Chopped” or “Cutthroat Kitchen” or any of the other culinary competitions whose format it shares but instead like a natural companion to “The Great British Bake Off,” whose gentle combination of wholesomeness and sly subversion has catapulted it to phenomenal international success. “Nailed It!” has the same warmth, the same feeling of baking just for the fun of it; it is a joyous testament to the power of laughing with instead of laughing at. Despite the eldritch horrors of Toni’s princess cake, her competitors’ renditions were, somehow, even more atrocious. She’s declared the winner, and when she realizes that she’ll be bringing home the ten-thousand-dollar prize (signified by cash being fired in her face by a judge holding a make-it-rain money gun) she weeps.\n\nThere are, in the six installments of the first season, occasional contestants who enter the studio unaware that their baking skills are anything less than exceptional, and their dawning horror is its own part of the fun. In each episode, the new contestants seem to outdo the previous ones: they forget to use eggs, they forget to use frosting, they accidentally light chocolate on fire, they wander off set, they drink the vodka that is meant for the baking, they decorate cookies with cheese puffs. They deliver to the judges raw doughnuts, incomprehensible wedding cakes, and, on one memorable occasion, an edible bust of President Donald Trump that somehow errs on the side of Nosferatu. Even the hosts and judges revel in catastrophe: they gleefully fumble their lines, bicker good-naturedly with one another and the production crew, flagrantly steal props, and own up to their own culinary inadequacies. Judging cake pops, Byer admits that she has no real basis for comparison, since she’s never eaten one before. At one point, a guest judge gets a phone call in the middle of the competition, a reminder to pick up his kids from school, and he just gets up and leaves, mid-episode, returning just in time for the final judgment.\n\nAt times, “Nailed It!” ’s wholehearted commitment to underachievement starts to feel—well, it feels like overachievement, like a funhouse-mirror version of the same tyrannical domestic perfectionism it’s trying to skewer. The blooper-style moments that would be edited out of other shows become predictable beats in the formula of each episode. But they’re still funny, even when you know they’re coming, and they feel—particularly to any home cook who’s confidently undertaken an ambitious baking project, only to realize that she’s in way, way over her head, and there’s no giving up, and the only way out is through—intensely, almost distressingly real. The show was recently renewed for a second season; potential contestants were encouraged to audition by posting a “cookie selfie” to Instagram or Facebook. Following the official hashtag reveals hundreds of amateur bakers posing next to confectionary versions of themselves that look evenly baked, nicely iced, and generally delicious—but there are enough examples of runny icing, gloppy swamp monsters, nightmare eyeballs, and (why not) scary clowns to foreshadow another round of glorious culinary calamity to come.", "images": ["https://media.newyorker.com/photos/5b10173258e57038595fc3b6/master/w_2560%2Cc_limit/Helen-NailedIt-2.jpg", "https://dwgyu36up6iuz.cloudfront.net/heru80fdn/image/upload/c_fill%2Cd_placeholder_thescene.jpg%2Cfl_progressive%2Cg_center%2Ch_360%2Cq_80%2Cw_480/v1528214896/thenewyorker_professional-poker-players-replay-their-most-memorable-hands.jpg", "https://media.newyorker.com/photos/5b10173258e57038595fc3b6/16:9/w_1280,c_limit/Helen-NailedIt-2.jpg", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo.f1893bac6dafe13d6d5bad671a5bee2345efa44d.svg", "https://media.newyorker.com/photos/5a04aaa03c28d150d0b8d8aa/4:3/w_480%2Cc_limit/Goldfield-Lessons-from-the-Worst-Food-Hack-of-2017.jpg", "https://media.newyorker.com/photos/5aff39d69aac0b676bab15cd/4:3/w_480%2Cc_limit/Rosner-Gold-Wings.jpg", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo-reverse.f915b516b6ca9c0c2a9bdf9b749519365b2b2e4a.svg", "https://media.newyorker.com/photos/5af07a4be99bf22dbb623cb9/4:3/w_480%2Cc_limit/Rosner-Sweetbitter.jpeg", "https://media.newyorker.com/photos/5a677220b82999219b13e510/1:1/w_270%2Cc_limit/helen_rosner-2-01.png", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo-header.6e34c81346bc43475ffd572e6c2eb3e125927148.svg"], "top_img": "https://media.newyorker.com/photos/5b10173258e57038595fc3b6/16:9/w_1280,c_limit/Helen-NailedIt-2.jpg", "keywords": [], "authors": ["Condé Nast", "Helen Rosner"], "canonical_link": "https://www.newyorker.com/culture/annals-of-gastronomy/the-joys-of-netflixs-nailed-it-the-baking-competition-that-celebrates-kitchen-disaster", "title": "The Joys of Netflix’s “Nailed It!,” the Baking Competition That Celebrates Kitchen Disaster", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "Helen Rosner on the joys of Netflix’s “Nailed It,” a baking competition that celebrates kitchen disaster.", "id": "5b0ebbe117cfc821059c242e", "keywords": "netflix,cooking shows", "news_keywords": "netflix,cooking shows", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "5b0ebbe117cfc821059c242e", "parsely-metadata": "{\"description\":\"Helen Rosner on the joys of Netflix’s “Nailed It,” a baking competition that celebrates kitchen disaster.\",\"image-16-9\":\"https://media.newyorker.com/photos/5b10173258e57038595fc3b6/16:9/w_1000,c_limit/Helen-NailedIt-2.jpg\",\"image-1-1\":\"https://media.newyorker.com/photos/5b10173258e57038595fc3b6/1:1/w_1000,c_limit/Helen-NailedIt-2.jpg\"}", "og": {"description": "In the absurdist, hilarious, occasionally incoherent series, participants are presented with confectionary challenges that far outstrip their skills.", "image": "https://media.newyorker.com/photos/5b10173258e57038595fc3b6/16:9/w_1280,c_limit/Helen-NailedIt-2.jpg", "site_name": "The New Yorker", "title": "The Joys of Netflix’s “Nailed It!,” the Baking Competition That Celebrates Kitchen Disaster", "type": "article", "url": "https://www.newyorker.com/culture/annals-of-gastronomy/the-joys-of-netflixs-nailed-it-the-baking-competition-that-celebrates-kitchen-disaster"}, "article": {"content_tier": "metered", "opinion": "false", "section": "tags", "published_time": "2018-06-01T16:50:51.886Z", "modified_time": "2018-06-01T16:50:51.886Z", "author": "Helen Rosner"}, "twitter": {"card": "summary_large_image", "creator": "@NewYorker", "description": "In the absurdist, hilarious, occasionally incoherent series, participants are presented with confectionary challenges that far outstrip their skills.", "domain": "https://www.newyorker.com", "image": "https://media.newyorker.com/photos/5b10173258e57038595fc3b6/16:9/w_1280,c_limit/Helen-NailedIt-2.jpg?mbid=social_retweet", "site": "@NewYorker", "title": "The Joys of Netflix’s “Nailed It!,” the Baking Competition That Celebrates Kitchen Disaster"}, "fb": {"app_id": 1147169538698836, "pages": 9258148868}, "google-signin-client_id": "275906274807-b4eqbdqr511u9msdpj8mh0pf77fcciv7.apps.googleusercontent.com"}, "movies": [], "publish_date": 1527871851.886, "source": "https://www.newyorker.com", "summary": ""}