{"url": "https://en.wikipedia.org/wiki/Royal_descendants_of_Queen_Victoria_and_King_Christian_IX", "text": "Descendants of Victoria and Christian IX\n\nThe Marriage of the Prince of Wales with Princess Alexandra of Denmark seem to be the only existing contemporary painting where Queen Victoria and King Christian IX are depicted in the same painting. The painting by William Powell Frith from 1865 depictingseem to be the only existing contemporary painting where Queen Victoria and King Christian IX are depicted in the same painting.\n\nThe royal descendants of Queen Victoria and of King Christian IX, monarchs of the United Kingdom (1837–1901) and Denmark (1863–1906) respectively, currently occupy the thrones of Belgium, Denmark, Luxembourg, Norway, Spain, Sweden, and the United Kingdom. At the outbreak of the First World War their grandchildren occupied the thrones of Denmark, Greece, Norway, Germany, Romania, Russia, Spain, and the United Kingdom. For this, Victoria was nicknamed \"the grandmother of Europe\" while Christian IX was nicknamed \"father-in-law of Europe\".\n\nGrandchildren [ edit ]\n\nChristian IX in 1898 with his and Victoria's great-grandson Prince Edward of York, the future King Edward VIII of the United Kingdom.\n\nVictoria arranged the marriage of her eldest son and heir-apparent, the future Edward VII, to Alexandra of Denmark, the eldest daughter of Christian IX, which took place on 10 March 1863. Among their six children were George V (who was also Emperor of India throughout his reign) and his sister Maud of Wales (who would later marry their cousin Haakon VII of Norway, another grandchild of Christian IX, on 22 July 1896). However, these two marriages were not the only unions among and between descendants of Victoria and Christian IX.\n\nThe second son of Christian IX, Prince William, became King of Greece as George I shortly after his sister Alexandra's marriage due to this new connection with the British royal family. On 27 October 1889 his son, later Constantine I of Greece, married Sophia of Prussia, a granddaughter of Victoria, forging another union between descendants of the British queen and the Danish king.\n\nIn 1865, Christian IX's second daughter, Princess Dagmar, became engaged to Tsarevich Nicholas of Russia, son and heir of Tsar Alexander II. Following the untimely death of her fiancé, Dagmar married Nicholas's younger brother, the Tsarevich Alexander in 1866, taking the Russian name Maria Feodorovna. Between 1881 and 1894, she was empress-consort of Russia. Her son, Nicholas II of Russia, married Alix of Hesse and by Rhine, yet another granddaughter of Queen Victoria, on 26 November 1894, and she became empress-consort as Alexandra Feodorovna.\n\nOther grandchildren became monarchs in their own right or consorts. Christian X of Denmark was the elder brother of Haakon VII of Norway and thus another grandson of Christian IX of Denmark. William II, German Emperor and King of Prussia was the elder brother of Sophia of Prussia and thus another reigning grandson of Victoria. Lastly, Victoria had two more granddaughters who became queens: Marie of Edinburgh, who married Ferdinand I of Romania, and Victoria Eugenie of Battenberg who married Alfonso XIII of Spain.\n\nChristian IX was therefore the grandfather of an emperor and two kings who all married granddaughters of Victoria, one of whom (Maud of Wales) was also a granddaughter of Christian IX. In total, five of his grandsons were reigning sovereigns.\n\nVictoria, meanwhile, was the grandmother of an emperor, a king-emperor, four queens consort and an empress consort.\n\nFirst World War [ edit ]\n\nDuring the First World War (1914–1918), many monarchs of countries from both sides were closely related due to their mutual descent from either Queen Victoria, Christian IX or both. The most commonly cited example is the fact that Nicholas, his wife, Alexandra, and Kaiser Wilhelm II of Germany were all first cousins of George V of the United Kingdom through Christian IX (in Nicholas's case) or Queen Victoria (for Wilhelm and Alexandra).[1][2][3] Shortly before the end of the war, Nicholas, his wife and children were executed by the Bolsheviks.\n\nOther countries who fought against Germany in addition to Russia and the United Kingdom were Romania, whose queen-consort, Marie, wife of Ferdinand I, was a cousin of the Kaiser, and Greece, whose queen-consort, Sophia, wife of Constantine I, was the Kaiser's own sister.\n\nAdditionally, George V was a first cousin of Constantine I of Greece through Christian IX. Other first cousins of George V, whose countries were neutral during the war, were Christian X of Denmark, Victoria Eugenie of Spain (queen-consort of Alfonso XIII) and Haakon VII of Norway (who was also George's brother-in-law via his marriage to George's sister, Maud).\n\nFamily tree of sovereign and consort grandchildren [ edit ]\n\nThe family tree below also attempts to show the relationship between close and extended family members referenced on this page.\n\nPresent-day reigning descendants [ edit ]\n\nThe unions between descendants of Queen Victoria and of King Christian IX did not end with the First World War, despite the overthrows of both the German and Russian monarchies (along with the House of Habsburg in Austria-Hungary). On the contrary, nearly all European reigning kings and queens today are most closely related through their descent from Victoria, Christian or both.\n\nKing Charles III of United Kingdom, King Harald V of Norway, Queen Margrethe II of Denmark and King Felipe VI of Spain are all descended from both Queen Victoria and King Christian IX.[citation needed] The first two monarchs are descendants of the aforementioned union between Alexandra of Denmark (daughter of King Christian IX) and Edward VII (son of Queen Victoria). Harald V of Norway is actually descended from Christian IX three ways, twice through his father and once through his mother. Margrethe II of Denmark is descended once each from Victoria and Christian IX. She is also a first cousin to Carl XVI Gustaf of Sweden through Victoria's granddaughter Princess Margaret of Connaught. Felipe VI is descended from Victoria three ways and Christian IX twice. His father, King Juan Carlos I, is descended from Victoria and not Christian IX, while Juan Carlos' consort, Queen Sofía, is twice a descendant of Victoria and twice a great-great-granddaughter of Christian IX. Charles III is descended from both Christian IX and Queen Victoria twice, as his parents Queen Elizabeth II and Prince Philip were both descendents of both monarchs.\n\nKing Carl XVI Gustaf of Sweden is descended from Victoria, twice, as his parents were second cousins because they were both great-grandchildren of Victoria. In addition, Carl XVI Gustaf also descends on his maternal side from Victoria's half-sister Feodora. Carl XVI Gustaf is not a descendant of Christian IX; however, he descends on his maternal side from the parents of Christian IX through Christian IX's elder brother, Friedrich.\n\nConversely, Philippe, King of the Belgians is descended from King Christian IX but not Queen Victoria, although, he is a descendant of Victoria's maternal uncle (as well as her husband Prince Albert of Saxe-Coburg and Gotha's paternal uncle), Leopold I, King of the Belgians. Philippe's father, King Albert II, who abdicated in the summer of 2013, is a first cousin to Harald V of Norway through their grandfather Prince Carl, Duke of Västergötland, married to Princess Ingeborg of Denmark, a granddaughter of Christian IX.\n\nMonarchs descended from Queen Victoria [ edit ]\n\nMonarchs descended from King Christian IX [ edit ]\n\nCommon ancestry between Victoria and Christian IX [ edit ]\n\nBecause so many monarchs descend from both Queen Victoria and King Christian IX of Denmark, the relationship between these two monarchs is of some interest. These monarchs were third cousins through their mutual descent from King George II of Great Britain. This relationship occurs twice because the maternal grandparents of King Christian IX of Denmark, Prince Charles of Hesse-Kassel (or Hesse-Cassel) (1744–1836) and Princess Louise of Denmark (1750–1831), were both children of daughters of King George II of Great Britain (1660–1727), and thus first cousins. Louise of Hesse-Kassel, wife of King Christian IX of Denmark, was a granddaughter of Prince Frederick of Hesse (1747–1837), the brother of the aforementioned Prince Charles of Hesse-Kassel.\n\nThus King Christian IX of Denmark and his wife Louise of Hesse-Kassel were both second and third cousins to each other and third cousins to Queen Victoria.\n\nThe longest lived descendants of Victoria and of Christian IX [ edit ]\n\nLongest living descendants [ edit ]\n\nCurrently holding Royal Office\n\nLiving\n\nAges of living descendants as of 20:44, Wednesday, October 5, 2022 ( UTC ).\n\nOldest living descendants [ edit ]\n\nCurrently holding Royal Office\n\nAges of living descendants as of 20:44, Wednesday, October 5, 2022 ( UTC ).\n\nSee also [ edit ]\n\nNotes [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/William_Powell_Frith_-_The_Marriage_of_the_Prince_of_Wales%2C_10_March_1863.JPG/300px-William_Powell_Frith_-_The_Marriage_of_the_Prince_of_Wales%2C_10_March_1863.JPG", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/William_Powell_Frith_-_The_Marriage_of_the_Prince_of_Wales%2C_10_March_1863.JPG/1200px-William_Powell_Frith_-_The_Marriage_of_the_Prince_of_Wales%2C_10_March_1863.JPG", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/ChristianIX_e_eduardo_de_york.jpg/220px-ChristianIX_e_eduardo_de_york.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/William_Powell_Frith_-_The_Marriage_of_the_Prince_of_Wales%2C_10_March_1863.JPG/1200px-William_Powell_Frith_-_The_Marriage_of_the_Prince_of_Wales%2C_10_March_1863.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Royal_descendants_of_Queen_Victoria_and_of_King_Christian_IX", "title": "Royal descendants of Queen Victoria and of King Christian IX", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/William_Powell_Frith_-_The_Marriage_of_the_Prince_of_Wales%2C_10_March_1863.JPG/640px-William_Powell_Frith_-_The_Marriage_of_the_Prince_of_Wales%2C_10_March_1863.JPG", "width": 640, "height": 457}, "title": "Royal descendants of Queen Victoria and of King Christian IX - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}