{"url": "https://www.usatoday.com/story/life/entertainthis/2018/06/20/chrissy-teigen-vaginal-steaming/717009002/", "text": "Chrissy Teigen tried Gwyneth Paltrow-approved vaginal steaming, but should you?\n\nGwyneth Paltrow would be so proud: Chrissy Teigen has given vaginal steaming a whirl.\n\nThe consistently candid model and cookbook author shared what appeared to be her first vaginal steam with her 18 million-plus Instagram followers Tuesday, as one does if you are Teigen.\n\nGoop founder Paltrow memorably praised the treatment in 2015. In a piece on the lifestyle site, the Tikkun Holistic Spa was highlighted for its Mugworth V-Steam. For the treatment, a combination of Mugwort leaves and flower buds are boiled and the steam, when applied, helps the body detox, so says the spa's website. The spa promises a slew of health benefits from the treatment including battling fatigue, headaches, infections and ease regulating menstrual cycles but warns those statements lack evaluation from the FDA.\n\nIn the photo shared to social media, Teigen struck a pose while wearing a sheet mask and a heating pad wrapped around her neck, sitting atop the steamer.\n\n\"face mask / heat pad / vagina steam,\" the star wrote. \"no I don’t know if any of this works but it can’t hurt right? *vagina dissolves*\"\n\nMore: Chrissy Teigen makes Trump's birthday great by donating to ACLU in installments of $72K\n\nMore: John Legend has the sweetest reason why Father's Day shouldn't be a big deal\n\nWhile we doubt Teigen's vagina has dissolved (citing the lack of tweets about it), the topic of vaginal steaming is not clean from controversy. In fact, a chorus of doctors issued warnings against the practice after Teigen's Instagram.\n\nDr. Jen Gunter was quick to correct Teigen's tweet about her trial. \"The vagina steam is a scam,\" the OB/GYN wrote. \"Potentially harmful. Sitz baths definitely endorsed.\"\n\nThe vagina steam is a scam. Potentially harmful. Sitz baths definitely endorsed. — Jennifer Gunter (@DrJenGunter) June 19, 2018\n\nGunter panned Paltrow's praise of steaming with blog posts on her website in 2015 and 2016. In the latter blog post, she wrote that at best \"steaming will do nothing but make make you feel good because you spent a lot of money (the placebo effect increases the more you spend), at worst it will cause rashes and burns.\"\n\nDr. Jessica Shepherd said there's no evidence vaginal steaming can alleviate cramps or help with cleansing, Women's Health magazine reported Tuesday.\n\nOB/GYN Christine Greves lauded the vagina's natural purifying abilities to \"Today.\"\n\n“The vagina is a self-cleaning oven, which is awesome,” Greves reportedly said in a piece that published Tuesday. “You may feel the need to do something to it but you don’t.”\n\nMore: Gwyneth Paltrow brings aerial yoga, trans talks and cryofacials to Goop health conference\n\nMore: Chrissy Teigen, John Legend share name and cute first photo of their baby boy", "images": ["https://www.gannett-cdn.com/-mm-/669de01dd93775854743e2084c58f47a681a94de/c=227-0-3774-2667/local/-/media/2018/06/20/USATODAY/USATODAY/636650770683978790-GD-Chrissy-Teigen-99610865.JPG?width=320&height=240", "https://www.gannett-cdn.com/-mm-/ffc3fe4726085e60e10f07eb8b5f1f65440711c3/c=0-38-3995-2295/local/-/media/2018/06/20/USATODAY/USATODAY/636650770683978790-GD-Chrissy-Teigen-99610865.JPG?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/ffc3fe4726085e60e10f07eb8b5f1f65440711c3/c=0-38-3995-2295/local/-/media/2018/06/20/USATODAY/USATODAY/636650770683978790-GD-Chrissy-Teigen-99610865.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Erin Jensen"], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2018/06/20/chrissy-teigen-vaginal-steaming/717009002/", "title": "Chrissy Teigen tried Gwyneth Paltrow-approved vaginal steaming, but should you?", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/entertainthis/2018/06/20/chrissy-teigen-vaginal-steaming/717009002/life/entertainthis", "theme-color": "#ffffff", "og": {"type": "article", "title": "Chrissy Teigen tried Gwyneth Paltrow-approved vaginal steaming, but should you?", "description": "Gwyneth Paltrow would be so proud: Chrissy Teigen has given vaginal steaming a whirl.\\u00a0But a\\u00a0chorus of doctors issued warnings against the practice after Teigen's Instagram.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/ffc3fe4726085e60e10f07eb8b5f1f65440711c3/c=0-38-3995-2295/local/-/media/2018/06/20/USATODAY/USATODAY/636650770683978790-GD-Chrissy-Teigen-99610865.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Gwyneth Paltrow would be so proud: Chrissy Teigen has given vaginal steaming a whirl.\\u00a0But a\\u00a0chorus of doctors issued warnings against the practice after Teigen's Instagram.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1529449200.0, "source": "https://www.usatoday.com", "summary": ""}