{"url": "https://www.usatoday.com/story/life/entertainthis/2017/11/27/fashion-police-co-hosts-remember-joan-rivers-touching-series-finale/888340001/", "text": "'Fashion Police' co-hosts remember Joan Rivers in touching series finale\n\nFashion Police is going out in style — Joan Rivers' style.\n\nJust like the late comedian, the E! series' Farewell (Monday, 8 p.m. ET/PT) is audacious, amusing and sincere.\n\nFrom 1995 until her unexpected death in 2014 at age 81, Rivers entertained her fans affectionately called the \"Joan Rangers\" as host of the show that made punchlines out of celebrity fashion faux pas.\n\nFor Rivers, pointing out stars' best looks and blunders was a family affair. Her daughter, Melissa Rivers, served as executive producer for the series and butt of several of Rivers' jokes. Melissa began co-hosting the show in 2015, filling her mom's spot.\n\nWhen E! announced the show's end in October, Melissa praised the network and one of the highlights of her mother's career. “Thank you to E! for having the vision to see the potential of Fashion Police which changed both the entertainment and fashion industries,” she said in a press release. “I am truly proud to be part of this legacy.”\n\nAfter the loss of Rivers and her flawless delivery of fearlessly offensive humor, the show was never quite the same.\n\nIt attempted to create similar magic with former co-host Kathy Griffin. Kelly Osbourne and George Kotsiopoulos also dished their opinions as co-hosts.\n\nOn Monday, Melissa serves on the final panel with Giuliana Rancic, Brad Goreski, NeNe Leakes and Margaret Cho.\n\nIn addition to regaling viewers with the show's outrageous moments, famous guests and cheeky games, the finale also offers earnest reflections on Rivers' passing.\n\n\"Suddenly, right before we headed out to New York (for Fashion Week) we all got terrible news: Joan was rushed to the hospital,\" Rancic recalls. \"I remember literally falling to the floor, and I called (Melissa).\"\n\n\"And you and I got on the phone,\" Melissa says to Rancic, \"and all I remember is hearing you — you could barely get words out.\"\n\nRancic says they had hoped Rivers would pull through. \"We were all praying and thinking Joan is gonna get out of this,\" the former host of E! News says. \"She is going to wake up.\"\n\nMarveling at Rivers' pioneering ways, Cho says, \"It's phenomenal what she did for women in comedy. She allowed us a space to actually be and to exist.\"\n\nIn recorded send-offs, Osbourne and Kotsiopoulos also recall what it was like to work with Rivers.\n\n\"This was truly the best job I have ever had,\" Osbourne shares. \"Working with Joan was an honor and a privilege but being there every week to make you guys laugh at home was even better.\"\n\n\"I just wanted to thank you for four of the most incredible years of my life, sitting next to Joan Rivers and laughing my butt off hysterically,\" says Kotsiopoulos. \"That laugh changed my life.\"\n\nMore: Kelly Osbourne talks family, feud with Giuliana: 'It’s not my life anymore'", "images": ["https://www.gannett-cdn.com/-mm-/b0981d6cbdf619e682181057a2f97dacb2720944/c=0-21-640-382/local/-/media/2017/11/22/USATODAY/USATODAY/636469580205141508-102917FP-Group-5.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/-mm-/b1718bd3cbd064ebd6d91a4cff51de96b808b891/c=36-0-604-427/local/-/media/2017/11/22/USATODAY/USATODAY/636469580205141508-102917FP-Group-5.jpg?width=320&height=240", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/b0981d6cbdf619e682181057a2f97dacb2720944/c=0-21-640-382/local/-/media/2017/11/22/USATODAY/USATODAY/636469580205141508-102917FP-Group-5.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Erin Jensen"], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2017/11/27/fashion-police-co-hosts-remember-joan-rivers-touching-series-finale/888340001/", "title": "'Fashion Police' co-hosts remember Joan Rivers in touching series finale", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/entertainthis/2017/11/27/fashion-police-co-hosts-remember-joan-rivers-touching-series-finale/888340001/life/entertainthis", "theme-color": "#ffffff", "og": {"type": "article", "title": "'Fashion Police' co-hosts remember Joan Rivers in touching series finale", "description": "Just like late comedian Joan Rivers,  'Fashion Police: The Farewell' is audacious, amusing and sincere.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/b0981d6cbdf619e682181057a2f97dacb2720944/c=0-21-640-382/local/-/media/2017/11/22/USATODAY/USATODAY/636469580205141508-102917FP-Group-5.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Just like late comedian Joan Rivers,  'Fashion Police: The Farewell' is audacious, amusing and sincere.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1511740800.0, "source": "https://www.usatoday.com", "summary": ""}