{"url": "https://en.wikipedia.org/wiki/Feels_(song)", "text": "2017 single by Calvin Harris featuring Pharrell Williams, Katy Perry and Big Sean\n\n\"Feels\" is a song recorded and produced by Scottish DJ Calvin Harris featuring American musicians Pharrell Williams, Katy Perry and Big Sean. It was released on 15 June 2017 through Sony Music as the fourth single from his fifth studio album Funk Wav Bounces Vol. 1 (2017), after \"Slide\", \"Heatstroke\" and \"Rollin\". Starrah assisted the artists in writing the song.[1][2]\n\n\"Feels\" has reached number one in Belgium, Israel, Latvia, Lebanon, Poland and the United Kingdom, the top 10 in Argentina, Australia, Austria, Canada, Costa Rica, the Czech Republic, Denmark, Finland, Germany, Hungary, Ireland, Malaysia, the Netherlands, New Zealand, Norway, Panama, Paraguay, Portugal, Scotland, Slovakia, Serbia, Slovenia, and Switzerland, and the top 20 in Italy, Sweden, and the United States.\n\nRelease [ edit ]\n\nOn 14 June 2017, Calvin Harris announced on social media that he would release the fourth single from Funk Wav Bounces Vol. 1 the next day, titled \"Feels\". The post included the single's cover art and credits.[3]\n\nComposition [ edit ]\n\n\"Feels\" is a disco-funk[4] and ska[5] song containing elements of dancehall, hip hop and electronica.[6] The bassline and chord progression of the song bear resemblance to Let's Groove (1981) by Earth, Wind and Fire;[citation needed] its authors, Maurice White and Wayne Vaughn, were later acknowledged in the song's credits.[7]\n\nCritical reception [ edit ]\n\nAndy Cush of Spin called the song \"a little flimsy\" while also noting that \"the groove is unimpeachable\" and that \"It has a skillful melange of sounds from the mid-70s apex of analog recording, the era of disco and yacht rock: a warm and rounded bassline, some Nile Rodgers-style guitar, a slick descending line on Fender Rhodes.\"[8] Rolling Stone's Elia Leight said that the song is \"a simple, lighthearted loop, which combines punctual ska guitar, a playful keyboard line and charming squeaks that recall a cartoon character's slip on a banana peel.\"[9] Brent Faulkner from The Musical Hype said the song is undercooked, leaving more to be desired, adding that it's \"the type of record that is pleasing more because of the sound than the lyricism.\"[10]\n\nChart performance [ edit ]\n\nIn the US, \"Feels\" debuted at number 50 on the Billboard Hot 100 and reached a peak of 20, making it Harris' eighth top 20 hit, as well as Perry's eighteenth. It spent eighteen weeks on the Billboard Hot 100. In Canada, the song peaked at number five, giving Perry her eighteenth top ten in the country. In the UK, \"Feels\" topped the Official Singles Chart, making it Harris' eighth, Williams' fourth, Perry's fifth, and Sean's first number one in the chart.\n\nMusic videos [ edit ]\n\nThe song's accompanying music video was uploaded to Harris' Vevo channel on YouTube on 26 June 2017. The clip was directed by Emil Nava.[11] In the video, Harris, Williams, Perry and Big Sean lounge around on a desert island.[12]\n\nA second video, also directed by Nava, followed two months later, featuring all four artists as a band playing the track in front of a live audience and receiving applause for their performance.[13]\n\nTrack listings [ edit ]\n\nDigital download[14] No. Title Length 1. \"Feels\" (featuring Pharrell Williams, Katy Perry & Big Sean) 3:43\n\nPersonnel [ edit ]\n\nCredits adapted from the song's liner notes.[3][14]\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRelease history [ edit ]\n\nRelease dates for \"Feels\" Region Date Format Label Ref. Various 15 June 2017 Digital download Columbia\n\nSony [3][14] Italy 16 June 2017 Contemporary hit radio Sony [155] United States 20 June 2017 Columbia [156] United Kingdom 23 June 2017 Columbia\n\nSony [157] Russia 26 August 2017 Sony [26]", "images": ["https://upload.wikimedia.org/wikipedia/en/6/6b/Calvin_Harris_-_Feels_cover_art.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/6b/Calvin_Harris_-_Feels_cover_art.png/220px-Calvin_Harris_-_Feels_cover_art.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/6/6b/Calvin_Harris_-_Feels_cover_art.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Feels_(song)", "title": "Feels (song)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/6/6b/Calvin_Harris_-_Feels_cover_art.png", "width": 640, "height": 640}, "title": "Feels (song) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}