{"url": "https://www.cnn.com/2017/08/01/entertainment/the-lowe-files-review/index.html", "text": "CNN —\n\nNothing really says “family values” quite like starring in a reality TV show that turns spending quality time with the kids into a money-making endeavor. So Rob Lowe and his sons join the legions of ghost hunters that populate cable with “The Lowe Files,” a goofy bit of Scooby-Doo-like hijinks for the A&E network.\n\nOpening to the strains of the song “Don’t Fear the Reaper,” this rather odd series introduces Lowe – who, no fool, promptly rattles off a list of his credits – and his college-age kids John Owen and Matthew. Narrated earnestly by Lowe (who’s also among the producers), the concept is for the trio to explore the paranormal and other “unsolved mysteries” together, beginning with an episode that features the Hardy Boys-esque title “Haunted Boys’ Reformatory.”\n\n“What makes us different from any other idiot who’s taking cameras into haunted mansions and castles and whatever?” John Owen asks, as they banter in the car.\n\nWell, for starters, dad is asked to pose for pictures when they stop for coffee and donuts, and the family has its own “personal shaman,” billed as a “spiritual intermediary,” who they bring with them to investigate the unruly spirits.\n\nThe Lowe Files: Official First Look | Series Premiere August 2nd | A&E\n\nThe main problem with having actors participate in these sort of exercises is there’s always a nagging sense that they’re hamming it up, despite on-air disclaimers that stress the program is “100% authentic” and that “Nothing has been staged for television.” The elder Lowe also somehow manages to look dashing and handsome even seen through eerie night-vision photography while wearing a silly beanie.\n\nThe sheer glut of unscripted programs devoted to the paranormal has made it challenging to bring anything new to the equation, which is where the actor’s name recognition and the family dynamics come into play. The sitcom-like qualities, however, disappear faster than you can say gh-gh-ghost once items start moving around and lights flashing in that aforementioned dormitory.\n\nWell-known performers who dabble in reality TV usually do so either because the phone has stopped ringing quite as regularly or to provide a lift to their progeny, a la (in one early and often-imitated example) Ozzy Osbourne.\n\nLowe is spinning “The Lowe Files” as an opportunity for a great big shared adventure. Still, after his sitcom “The Grinder” went south, it’s probably not the worst way to help boost his sons’ profiles and keep himself in the spotlight, even if said light comes via the familiar glow of a greenish night-vision lens.\n\n“The Lowe Files” premieres Aug. 2 at 10 p.m. on A&E.", "images": ["https://i.ytimg.com/vi/eqXZq-rKfew/hqdefault.jpg", "https://media.cnn.com/api/v1/images/stellar/prod/170731113823-lowe-files-photo-ae.jpg?q=x_0,y_67,h_2956,w_5254,c_crop/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/170608134508-brian-lowry.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/170731113823-lowe-files-photo-ae.jpg?q=x_0,y_67,h_2956,w_5254,c_crop/h_270,w_480"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/170731113823-lowe-files-photo-ae.jpg?q=x_0,y_67,h_2956,w_5254,c_crop/w_800", "keywords": [], "authors": ["Brian Lowry"], "canonical_link": "https://www.cnn.com/2017/08/01/entertainment/the-lowe-files-review/index.html", "title": "'The Lowe Files' review: Rob Lowe goes ghost hunting", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Rob Lowe turns ghost hunting into family affair on A&E | CNN", "description": "'The Lowe Files' review: Rob Lowe and sons turn ghost hunting into a family affair in A&E reality show", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170731113823-lowe-files-photo-ae.jpg?q=x_0,y_67,h_2956,w_5254,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2017/08/01/entertainment/the-lowe-files-review/index.html", "site_name": "CNN"}, "twitter": {"title": "Rob Lowe turns ghost hunting into family affair on A&E | CNN", "description": "'The Lowe Files' review: Rob Lowe and sons turn ghost hunting into a family affair in A&E reality show", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170731113823-lowe-files-photo-ae.jpg?q=x_0,y_67,h_2956,w_5254,c_crop/w_800", "card": "summary_large_image", "site": "@CNNent"}, "description": "'The Lowe Files' review: Rob Lowe and sons turn ghost hunting into a family affair in A&E reality show", "template_type": "article_leaf", "type": "article", "meta-section": "entertainment", "theme": "entertainment", "article": {"published_time": "2017-08-01T14:08:43Z", "modified_time": "2017-08-01T14:08:43Z", "tag": "a&e television networks llc, celebrities, companies, rob lowe", "publisher": "https://www.facebook.com/CNN"}, "keywords": "a&e television networks llc, celebrities, companies, rob lowe", "author": "Brian Lowry", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1501542000.0, "source": "https://www.cnn.com", "summary": ""}