{"url": "https://www.irishtimes.com/culture/tv-radio-web/how-rose-mcgowan-became-a-victim-of-her-own-victimhood-1.3507249", "text": "When Citizen Rose first aired on E! in January this year, it followed Rose McGowan's rapid ascension into the role of social-justice spearhead after being one of the first public accusers of Harvey Weinstein. The two-hour docu-series followed McGowan as she was parachuted into the world of activism and felt like part of a wider moment of consciousness to give the voiceless, those who were shamed and silenced the opportunity to finally roar their truth.\n\nMcGowan’s truth was that of a war-torn survivor of sexual exploitation who was grappling with huge personal trauma very publicly - consider the revealing moment when as she’s getting ready to meet her brother’s new girlfriend at a Thanksgiving dinner she ponders aloud whilst fixing her makeup about how the stranger would know every intimate detail of her life by now.\n\nThrough the documentary and the unfurling of other stories within the #MeToo movement, it exposed how the wildest and most perturbing “blind items” from internet gossip sites were actually conservative compared with the depraved and deranged reality, that of spies infiltrating McGowan’s life and the death threats and career-crushing moves suffered by other actresses.\n\nNow, after the dust has somewhat settled, Citizen Rose: Brave series two, explores what happens after the public disclosure when the initial frenzy has quietened down and the daily batch of #MeToo revelations are skimmed over, our sense of shock dulled. This time McGowan is not on the campaign trail but the promotional one with the publication of her biography Brave and her album, as well as the documentary series to publicise.\n\nREAD MORE\n\nThere is no exploration of practical, pragmatic solutions to these issues or conversations around dismantling the patriarchy in Citizen Rose: Brave, instead we’re treated to scenes of McGowan twirling about in fur coats, dancing in the recording studio and lying in an empty bathtub espousing Instagram inspirational quote ‘wisdom’.\n\nThe official trailer for \"Citizen Rose\", a docu-series following Rose McGowan, one of the first women to publicly accuse film producer Harvey Weinstein of sexual assault. Video: E! Entertainment\n\nThe second series feels reminiscent of Lindsay Lohan’s ill-fated documentary show, sticking a camera into the face of famously vulnerable woman and waiting for the expected, explosive results. By strictly focusing on McGowan without any outside input from other affected, non-famous, non-glamourous women who are working tirelessly behind the scenes to help others, there is a glossy egotism to it as if she’s cast herself in the role of the Joan of Arc of the movement with her assembled Rose Army with their arty raised fist symbolism and her shorn hair.\n\nAlthough after Harvey Weinstein effectively shutdown her career, who could blame her for wanting to reclaim the spotlight even if it burns with a white hot intensity.\n\nThis lure of the limelight sees McGowan push herself through a gruelling press tour where she is repeatedly asked questions about her alleged assault, the camera zooming in on her translucent skin rippling with tears.\n\nMcGowan’s fragility is painfully evident as she breaks down several times throughout the show, exhausted by the emotional weight of it all. There are moments when the documentary feels intrusive and exploitative, it is excruciating to watch someone fall apart in slow motion as she unleashes uninformed, unnecessary rage at a trans woman who confronts her at a book reading.\n\nThe price of revealing the trauma is reliving it, and if there is any value to this second series, it is in seeing how women, after dredging up their nightmares, are left to dwell and fester. There seems to be no duty of care to these survivors on a conveyor belt of doom from one interview to the next, their experiences amounting to nothing more than salacious content to fill pages.\n\nThe movement itself was confused and muddled, so vast and unwieldy with only the umbrella of the hashtag to protect them. The social change erupted at such velocity it skinned its unprepared survivors alive, whereas the wealthy accused sunk comfortably into relative anonymity awaiting their inevitable comeback. Citizen Rose shows that there is bravery in unleashing truth, but as freedom flowers so too do the thorns beneath.", "images": ["https://www.irishtimes.com/resizer/0wC9aRtG7vwabiQvMa-bW6VniGk=/600x400/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/MGGRJORMUZN2DJHKPQ7RYQ5JDM.jpg", "https://www.irishtimes.com/resizer/k_KM_sIvPux4RzhjkdOeMq1s8Tw=/600x400/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/AUYUL72VE7P673NFLUUC6OVVKY.jpg", "https://www.irishtimes.com/resizer/s-HPW6xmQIsJVtIQbPuoXX7S2-w=/1600x0/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/T2YWK6B74TRZNP3QP3V7WTXG3I.jpg", "https://www.irishtimes.com/resizer/19S6LiPmzkYAVTjPD7yy7GPEUtI=/600x400/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/72ZQV4BHHF5KML34MTLPHJ3RQQ.jpg", "https://cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/BJJKNJJHDJDGDDODHEER7FDH44.png", "https://www.irishtimes.com/resizer/FpmmM2lLAqL_TFIMtS5U3bks0bU=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/T2YWK6B74TRZNP3QP3V7WTXG3I.jpg", "https://www.irishtimes.com/resizer/BRhyniolFDHe2CoGXX_D6jpJQ7g=/fit-in/800x450/filters:quality(70):fill(white):background_color(white)/static.themebuilder.aws.arc.pub/irishtimes/1647534191476.png", "https://cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/T2XGUGDSUZCOZAYIQEKG2TWML4.png", "https://www.irishtimes.com/resizer/dgM10vwnMCn-GaQob7PvymxnFf8=/600x400/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/UVIUHMFQRZM3US4XJINJN55XWM.jpg", "https://www.irishtimes.com/resizer/Ay9Xhlz96Ai43bM7IeK7LOG-A3I=/600x400/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/GMIO2XJFZO7E6XUFBEGPM64FSI.jpg", "https://static.themebuilder.aws.arc.pub/irishtimes/1647534191733.svg", "https://www.irishtimes.com/resizer/oc5DTGMz9BkikYlXu9Qctp-DkFU=/600x400/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/F2W5IB33O73QOM3T4OJ775UEWQ.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=8946263&cv=2.0&cj=1", "https://www.irishtimes.com/resizer/BrmdI5mT3ODdduAkpR-JxMy11sI=/600x400/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/WFYTJ3QW7KX6WFFBUWERZHUPTI.jpg"], "top_img": "https://www.irishtimes.com/resizer/FpmmM2lLAqL_TFIMtS5U3bks0bU=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/T2YWK6B74TRZNP3QP3V7WTXG3I.jpg", "keywords": [], "authors": ["Jennifer Gannon", "Mon May -"], "canonical_link": "https://www.irishtimes.com/culture/tv-radio-web/how-rose-mcgowan-became-a-victim-of-her-own-victimhood-1.3507249", "title": "How Rose McGowan became a victim of her own victimhood", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Among the first Harvey Weinstein accusers and lynchpin of the #MeToo movement, McGowan’s activism is giving way to a fragile egotism", "twitter": {"description": "Among the first Harvey Weinstein accusers and lynchpin of the #MeToo movement, McGowan’s activism is giving way to a fragile egotism", "title": "How Rose McGowan became a victim of her own victimhood", "image": "https://www.irishtimes.com/resizer/FpmmM2lLAqL_TFIMtS5U3bks0bU=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/T2YWK6B74TRZNP3QP3V7WTXG3I.jpg", "site": "@IrishTimes", "card": "summary_large_image"}, "og": {"description": "Among the first Harvey Weinstein accusers and lynchpin of the #MeToo movement, McGowan’s activism is giving way to a fragile egotism", "title": "How Rose McGowan became a victim of her own victimhood", "image": "https://www.irishtimes.com/resizer/FpmmM2lLAqL_TFIMtS5U3bks0bU=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/T2YWK6B74TRZNP3QP3V7WTXG3I.jpg", "type": "article", "site_name": "The Irish Times", "url": "https://www.irishtimes.com/culture/tv-radio-web/how-rose-mcgowan-became-a-victim-of-her-own-victimhood-1.3507249"}, "keywords": "rose-mcgowan,kenneth-anger,perez-hilton,lohan-lindsay", "robots": "noarchive"}, "movies": [], "publish_date": null, "source": "https://www.irishtimes.com", "summary": ""}