{"url": "https://en.wikipedia.org/wiki/What_Up_with_That", "text": "Recurring Saturday Night Live sketch\n\nThis article is about the SNL sketch. For other topics, see What's Up with That (disambiguation)\n\n\"What Up with That?\" (also rendered \"What's Up with That?\" in some episodes) is a recurring sketch on the NBC television series Saturday Night Live which first aired in 2009. It stars Kenan Thompson as Diondre Cole,[1] host of a talk show on BET. Supporting characters include the show's announcer, originally played by Will Forte, and later by Taran Killam and Mikey Day, Fred Armisen as Giuseppe, a Kenny G-like saxophone player, Jason Sudeikis as Vance, an overzealous track-suit-wearing backup dancer,[2] and backup singers Pippa and Poppy, portrayed by Jenny Slate and Nasim Pedrad (season 35),[3] Pedrad and Vanessa Bayer (seasons 36-37),[3] Bayer and Cecily Strong (season 38),[3] Strong and Sasheer Zamata (40th Anniversary Special),[4] Ego Nwodim and Melissa Villasenor (season 45),[5] and Villasenor and Punkie Johnson (season 47). The sketch has incorporated unannounced cameo appearances by a number of celebrities.[6][7] In addition to this, cast members frequently play roles adding to the chaos during Cole's performances, such as Paul Brittain and Abby Elliott's dancing performances as Vili Fualaau and Mary Kay Letourneau, a student and teacher who made news for their sexual relationship.[8]\n\nFormat [ edit ]\n\nThe sketch begins with Cole singing the show's lengthy theme song, \"What's Up With That?\" Cole welcomes viewers to the show, but his introduction of the day's topic generally leads into a reprise of the theme song. Each performance includes an increasing number of random dancers and performers. Once the reprise is finished, he introduces the show's three guests, with the third always being Bill Hader playing Fleetwood Mac guitarist Lindsey Buckingham. As soon as the first guest begins talking, Cole echoes each thing they say in a sing-song manner (often disrupting them), eventually leading into yet another rendition of the theme song. The multiple theme song performances end up using all the show's time, and the second guest does not get to speak (although Robin Williams did have a few lines in the December 4, 2010, episode,[9] as did Kate Upton in the February 18, 2012, episode and DJ Khaled in the April 15, 2020, episode), nor does Lindsey Buckingham, who, according to Cole, has attended dozens of times without ever getting interviewed, but still remains a good sport.[citation needed]\n\nIn the May 14, 2011 episode, the real Lindsey Buckingham appeared alongside Bill Hader playing him. The first guest was that week's musical guest, Paul Simon, who opened his interview by complaining about how Cole invites Buckingham each week but never gives him a chance to talk. While Hader had no lines once again, the real Buckingham played guitar and spoke up for him.[10]\n\nIn a backstage clip from the show on February 18, 2012, Cole lets Buckingham (Hader) list the U.S. Presidents and their birthdays. This marked the first time that Hader's Buckingham ever received an opportunity to speak.[citation needed]\n\nIn the December 15, 2012 episode, Samuel L. Jackson said \"fuck\" and \"bullshit\" on the live broadcast, prompting Kenan Thompson to respond with \"Come on now, that costs money.\"[11] Jackson responded to the controversy by stating that he had said the profanities expecting Thompson to cut him off in the middle of each.[12]\n\nIn the October 23, 2021 episode, for the first time, Hader was not present as Buckingham. In his place was Nicholas Braun (along with Emily Ratajkowski and Oscar Isaac), although Cole mistook him for Buckingham dressing in a Halloween costume of Braun's Succession character Greg Hirsch.\n\nReception [ edit ]\n\nTelevision web site Hitfix applauded Thompson's performance, stating that it works because he can actually sing.[13] However, Entertainment Weekly suggested that the sketch was getting old over time, asking: \"How many more times can they fall back on this one?\"[14] Rolling Stone would go on to name the sketch as a breakout moment for Thompson.[15]\n\nInternally, among the writers of the sketch there was worry that the bit would not work, with Bryan Tucker noting that it was feared that the sketch \"might be too random and silly\". The night of its premiere, though, Tucker noted that \"After the sketch was over, everyone stopped working and lined the backstage hallway to give Kenan a high-five or a pat on the back\" and that they were \"treating the moment like it was a high school football game, and the home team had just won\".[16]\n\nEpisodes [ edit ]\n\nIn addition to these sketches, Kenan Thompson as Diondre Cole, Jason Sudeikis as Vance, and Fred Armisen as Giuseppe appeared in the monologue of the April 17, 2010, episode hosted by Ryan Phillippe, in which various SNL characters question why MacGruber has a movie yet they do not.[23]\n\nSee also [ edit ]", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/What_Up_with_That%3F", "title": "What Up with That?", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "What Up with That? - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}