{"url": "https://www.thewrap.com/fall-tv-2018-canceled-renewed-pilot-orders-abc-fox-cbs-nbc-cw/", "text": "Updated May 29 with “Roseanne” revival canceled at ABC after one season, following Roseanne Barr’s racially charged remarks about Valerie Jarrett on Twitter.\n\nIt’s that time of year again! As the broadcast networks prepare for their annual upfront presentations to advertisers, they’ve begun to winnow down which current shows will return next season and which will come to an end.\n\nBelow is every scripted (and a few unscripted) show that ABC, NBC, CBS, Fox and The CW have renewed or canceled so far, along with those still awaiting their fates. We’ve also included descriptions of the new shows that have been picked up so far.\n\nCheck back throughout the coming weeks for updates.\n\nAlso Read: Here Are the 5 Broadcast TV Shows We're Still Awaiting Decisions On\n\nNBC\n\nRenewed Series: “A.P. Bio,” “Superstore,” “The Good Place,” “Good Girls,” “Will & Grace,” “This Is Us,” “Chicago Fire,” “Chicago Med,” “Chicago P.D.,” “Law & Order: SVU,” “Blindspot,” “The Blacklist”\n\nCanceled/Ending Series: “Law & Order True Crime,” “Taken,” “The Brave,” “Great News,” “Rise”\n\nSeries Awaiting Decisions: “Champions,” “Timeless”\n\nNewly Ordered Series: “Abby’s,” “The Enemy Within,” “I Feel Bad,” “New Amsterdam,” “The Village,” “Manifest,” “The InBetween,” “Brooklyn Nine-Nine” revival, “America’s Got Talent: The Champions”\n\nAlso Read: 16 Highest-Rated Canceled or Ending TV Shows of 2017-18 Season - So Far (Photos)\n\nHere are the official descriptions for the new 2018-19 NBC shows:\n\n“America’s Got Talent: The Champions”\n\nThe special edition of “America’s Got Talent” will bring together the “most talented, memorable, wackiest and all-around favorites” from past seasons of “AGT.” Additionally, some of the most popular acts from the other global “Got Talent” franchises, spanning 184 countries, will be joining the competition to win the love of America — and $1 million.\n\nThe variety series was created by Cowell and is co-produced by FremantleMedia North America and Syco Entertainment. Cowell, Sam Donnelly, Jason Raff, Trish Kinane and Richard Wallace executive produce.\n\n“Brooklyn Nine-Nine” (revived after Fox cancellation)\n\nA revival of the very recently-canceled Fox sitcom, “Brooklyn Nine-Nine” centers around the detectives at the Brooklyn Police Department’s 99th Precinct.\n\nThe cast includes Andy Samberg, Andre Braugher, Terry Crews, Melissa Fumero, Joe Lo Truglio, Stephanie Beatriz, Chelsea Peretti, Dirk Blocker and Joel McKinnon Miller.\n\nExecutive producers are Michael Schur, Dan Goor, David Miner and Luke Del Tredici. The show hails from Universal Television, Fremulon, Dr. Goor Productions and 3 Arts Entertainment.\n\n“The InBetween”\n\nCassie Bishop was born with a gift, though she may call it a curse. She can see and communicate with the dead, helping them with their unresolved problems … whether she likes it or not. When her longtime friend Det. Tom Hackett and his new partner, former FBI Agent Damien Asante, need help solving a darkly puzzling murder, Cassie agrees to use her abilities. Despite her reluctance, she may have found a way to keep her demons at bay, all while solving some of the city’s most challenging cases. From writer/executive producer Moira Kirland (“Castle,” “Madam Secretary”) comes this suspenseful, new character-driven procedural drama.\n\nThe cast includes Harriet Dyer, Anne-Marie Johnson, Cindy Luna, Chad James Buchanan and Paul Blackthorne.\n\nMoira Kirland will write and executive produce. Charlotte Sieling will direct and executive produce the pilot. David Heyman and Nancy Cotton also executive produce. “The InBetween” is produced by Universal Television, NBCU International Television Studio and Heyday Television.\n\nAlso Read: 'Taken' Is Being Shopped Around by Universal TV After NBC Cancellation\n\n“Manifest”\n\nWhen Montego Air Flight 828 landed safely after a turbulent but routine flight, the crew and passengers were relieved. Yet in the span of those few hours, the world had aged five years and their friends, families and colleagues, after mourning their loss, had given up hope and moved on. Now, faced with the impossible, they’re all given a second chance. But as their new realities become clear, a deeper mystery unfolds and some of the returned passengers soon realize they may be meant for something greater than they ever thought possible. From Robert Zemeckis and Jack Rapke comes an emotionally rich, unexpected journey into a world grounded in hope, heart and destiny.\n\nThe cast includes Melissa Roxburgh, Josh Dallas, Athena Karkanis, J.R. Ramirez, Luna Blaise, Jack Messina and Parveen Kaur.\n\nJeff Rake will write and executive produce. David Frankel will direct and executive produce the pilot. Robert Zemeckis and Jack Rapke also executive produce. “Manifest” is produced by Warner Bros. Television and Compari Entertainment.\n\n“Abby’s”\n\nFrom the producers of “The Good Place” comes a hilariously aspirational new comedy about the best bar in San Diego, home to good prices, great company and, of course, Abby. This unlicensed, makeshift bar nestled in her backyard is the opposite of everything annoying about today’s party scene. There are rules at Abby’s: no cell phones (not even to “look something up”), earning a seat at the bar takes time and losing a challenge means drinking a limey, sugary “not-beer” drink. As the oddball cast of regulars will tell you, hanging out at Abby’s is a coveted honor. But once you’re in, you’re family.\n\nThe cast includes Natalie Morales, Nelson Franklin, Kimia Behpoornia, Jessica Chaffin, Leonard Ouzts and Neil Flynn.\n\nJosh Malmuth will write and executive produce. Pamela Fryman will direct and executive produce the pilot. Michael Schur and David Miner also executive produce. “Abby’s” is produced by Universal Television, Fremulon and 3 Arts Entertainment.\n\nAlso Read: NBC Shares Findings From Matt Lauer Sexual Harassment Investigation\n\n“The Enemy Within”\n\nIn this fast-paced, spy-hunting thriller, Erica Shepherd (Jennifer Carpenter) is a brilliant former CIA operative, now known as the most notorious traitor in American history serving life in a Supermax prison. Against every fiber of his being but with nowhere else to turn, FBI Agent Will Keaton (Morris Chestnut) enlists Shepherd to help track down a fiercely dangerous and elusive criminal she knows all too well. For Keaton, it’s not easy to trust the woman who cost him so much. While Shepherd and Keaton have different motivations for bringing the enemy to justice, they both know that to catch a spy… they must think like one.\n\nThe cast includes Jennifer Carpenter, Morris Chestnut, Raza Jaffrey and Kelli Garner.\n\nKen Woodruff will write and executive produce. Mark Pellington will direct and executive produce the pilot. Vernon Sanders also executive produces. “The Enemy Within” is produced by Universal Television.\n\nAlso Read: ESPN's New Streaming Service Lands Portion of UFC TV Rights for $150 Million Per Year\n\n“I Feel Bad”\n\nEmet is the perfect mom, boss, wife, friend and daughter. OK, she’s not perfect. In fact, she’s just figuring it out like the rest of us. Sure, she feels bad when she has a sexy dream about someone other than her husband, or when she pretends not to know her kids when they misbehave in public, or when she uses her staff to help solve personal problems. But that’s OK, right? Nobody can have it all and do it perfectly. From executive producer Amy Poehler comes a modern comedy about being perfectly OK with being imperfect.\n\nThe cast includes Sarayu Blue, Paul Adelstein, Aisling Bea, Zach Cherry, Johnny Pemberton and James Buckley.\n\nAseem Batra will write and executive produce. Julie Anne Robinson will direct and executive produce the pilot. Amy Poehler, Dave Becky and Josh Maurer also executive produce. “I Feel Bad” is produced by Universal Television, Paper Kite Productions, CannyLads Productions and 3 Arts Entertainment.\n\nAlso Read: NBC News Blasted for 'Ludicrous' Internal Probe Clearing Management Over Matt Lauer Scandal\n\n“The Village”\n\nWelcome to the Village, an apartment building in Brooklyn that appears like any other from the outside but is quite unique inside. The people who reside here have built a bonded family of friends and neighbors. Sarah’s a nurse and single mom raising a creative teen; Gabe’s a young law student who got a much older and unexpected roommate; Ava must secure the future of her young, U.S.-born son when ICE comes knocking; Nick’s a veteran who’s returned from war; and the heart and soul of the building, Ron and Patricia, have captivating tales all their own. These are the hopeful, heartwarming and challenging stories of life that prove family is everything — even if it’s the one you make with the people around you.\n\nThe cast includes Moran Atias, Dominic Chianese, Warren Christie, Frankie Faison, Jerod Haynes, Daren Kagasoff, Michaela McManus, Lorraine Toussaint and Grace Van Dien.\n\nMike Daniels will write and executive produce. Minkie Spiro will direct and executive produce the pilot. Jessica Rhoades also executive produces. “The Village” is produced by Universal Television and 6107 Productions.\n\nAlso Read: WWE 'Backlash': 7 Things You Didn't See on TV\n\n“New Amsterdam”\n\nInspired by Bellevue, the oldest public hospital in America, this unique medical drama follows the brilliant and charming Dr. Max Goodwin, the institution’s newest medical director who sets out to tear up the bureaucracy and provide exceptional care. How can he help? Well, the doctors and staff have heard this before. Not taking “no” for an answer, Dr. Goodwin must disrupt the status quo and prove he will stop at nothing to breathe new life into this understaffed, underfunded and underappreciated hospital — the only one in the world capable of treating Ebola patients, prisoners from Rikers and the President of the United States under one roof — and return it to the glory that put it on the map.\n\nThe cast includes Ryan Eggold, Freema Agyeman, Janet Montgomery, Jocko Sims, Anupam Kher and Tyler Labine.\n\nDavid Schulner will write and executive produce. Kate Dennis will direct and executive produce the pilot. Peter Horton also executive produces. Dr. Eric Manheimer will produce. “New Amsterdam” is produced by Universal Television, Pico Creek Productions and Mount Moriah.\n\nAlso Read: Hulu Orders Horror Series 'Light as a Feather' From Kelsey Grammer and Awesomeness TV\n\nCBS\n\nRenewed Series: “The Big Bang Theory,” “Blue Bloods,” “Bull,” “Hawaii Five-0,” “MacGyver,” “Madam Secretary,” “Mom,” “NCIS,” “NCIS: Los Angeles,” “NCIS: New Orleans,” “Ransom,” “SEAL Team,” “S.W.A.T.,” “Young Sheldon,” “Criminal Minds,” “Man With a Plan,” “Life in Pieces,” “Instinct,” “Celebrity Big Brother,” “Elementary”\n\nCanceled Series: “Me, Myself & I,” “Wisdom of the Crowd,” “Living Biblically,” “Scorpion,” “Superior Donuts,” “Kevin Can Wait,” “9JKL,” “Code Black”\n\nNewly Ordered Series: “F.B.I.,” “Murphy Brown,” “Untitled Damon Wayans Jr. Project,” “Welcome to the Neighborhood,” “Fam,” “God Friended Me,” “Magnum P.I.,” “The Code,” “The Red Line”\n\nAlso Read: Ryan Murphy Is Developing #MeToo Anthology Series 'Consent' Tackling Harvey Weinstein, Kevin Spacey\n\nHere are the official descriptions for the new 2018-19 CBS shows:\n\n“F.B.I.”\n\nExplores the inner-workings of the New York office of the Federal Bureau of Investigation.\n\nThe cast includes Missy Peregrym, Jeremy Sisto, Zeeko Zaki, Connie Nielsen and Ebonee Noel.\n\nCraig Turk will write and executive produce. Niels Arden Oplev will direct and executive produce. Dick Wolf, Arthur W. Forney and Peter Jankowski are also executive producers. “F.B.I.” is produced by Universal Television and CBS Television Studios.\n\nAlso Read: CBS Beats Q1 Earnings Forecasts on Record Revenue\n\n“Murphy Brown”\n\nIn a revival of the 1988 sitcom, Murphy Brown (Candice Bergen) returns to a world of cable news, social media, fake news and a very different political and cultural climate.\n\nThe cast includes Candice Bergen, Faith Ford, Joe Regalbuto, Grant Shaud, Jake McDorman and Nik Dodani\n\nOriginal series creator Diane English will write and executive produce. Pam Fryman will direct and executive produce. Bergen also executive produces. “Murphy Brown” is produced by Warner Bros. Television and Bend in the Road Productions.\n\nAlso Read: Damon Wayans Jr, Cedric the Entertainer Sitcoms Set for CBS' 2018-19 Season\n\nUntitled Damon Wayans, Jr. Project\n\nA 30-something couple, tired of their mundane life, start to reconnect with their younger, cooler selves when a young pop star who is drawn to their super normal suburban life, moves in.\n\nThe cast includes Damon Wayans, Jr., Amber Stevens West, Felix Mallard, Stephnie Weir and Chris Parnell.\n\nTim McAuliffe and Austen Earl penned the script for the series, which hails from CBS TV Studios. They will both executive produce along with Harry Styles, Ben Winston via Fulwell 73 and 3 Arts Entertainment’s Michael Rotenberg and Jonathan Berry. Phill Lewis directed the pilot.\n\nFrom CBS Studio:\n\n“The series is inspired by a time when Executive Producers Ben Winston and Harry Styles lived together. However, that’s where the reality ends. The show is not based on real life experiences or characters.”\n\nAlso Read: Charlie Rose, CBS News Sued by Three Women: 'Mr. Rose Repeatedly Sexually Touched Plaintiffs'\n\n“The Neighborhood (formerly known as “Welcome to the Neighborhood”)\n\nThe nicest guy in the Midwest moves his family into a tough neighborhood in L.A. where not everyone appreciates his extreme neighborliness.\n\nThe cast includes Cedric The Entertainer, Max Greenfield (recast for Josh Lawson), Sheaun McKinney, Tichina Arnold, Dreama Walker, Marcel Spears and Hank Greenspan.\n\nJim Reynolds will write and executive produce the CBS Television Studios series. Aaron Kaplan, Dana Honor, and Wendi Trilling are also executive produce, along with Cedric and Eric Rhone under their A Bird and A Bear Entertainment banner. James Burrows is directing and grabbing an EP credit as well.\n\n“Fam”\n\nA woman’s dreams of an upstanding life with her new fiancé and his upstanding family are dashed when her younger train wreck half-sister comes to live with her to escape their train wreck of a father.\n\nCast includes Nina Dobrev, Tone Bell, Odessa Adlon, Brian Stokes Mitchell and Sheryl Lee Ralph.\n\nCorinne Kingsbury is writer and executive producer, with Scott Ellis directing the pilot. Aaron Kaplan, Dana Honor and Wendi Trilling are also executive producers. The multi-camera comedy is produced by CBS Television Studios and Kapital Entertainment.\n\nAlso Read: Damon Wayans Jr, Cedric the Entertainer Sitcoms Set for CBS' 2018-19 Season\n\n“God Friended Me”\n\nQuestions of faith, existence and science are explored in this humorous, uplifting series about an outspoken atheist whose life is turned upside down when he is “friended” by God on social media. Unwittingly, he becomes an agent of change in the lives and destinies of others around him.\n\n\n\nCast includes Brandon Micheal Hall, Violett Beane, Suraj Sharma, Javicia Leslie and Joe Morton.\n\nSteven Lilien and Bryan Wynbrandt are writers and executive producers. Marcos Siega will direct and executive produce. Greg Berlanti and Sarah Schechter are also executive producers. The hour-long drama is produced by Warner Bros. Television.\n\n“Magnum P.I.”\n\nAn update of the classic television series set in Hawaii, MAGNUM P.I. follows Thomas Magnum, a decorated ex-Navy SEAL who, upon returning home from Afghanistan, repurposes his military skills to become a private investigator.\n\nCast includes Jay Hernandez, Perdita Weeks, Zachary Knighton and Stephen Hill.\n\nPeter Lenkov and Eric Guggenheim are co-writers and executive producers. Justin Lin will direct and executive produce. John Davis, John Fox and Danielle Woodrow are also executive producers. The hour-long drama is produced by CBS Television Studios and Universal Television.\n\nAlso Read: 'New Girl': Damon Wayans Jr Makes His Series Return - and Owes Someone $71,000 (Exclusive Video)\n\n“The Code”\n\nThe military’s brightest minds take on our country’s toughest challenges – inside the courtroom and out – where each attorney is trained as a prosecutor, a defense lawyer, an investigator – and a Marine.\n\n\n\nCast includes Anna Wood, Ato Essandoh, Phillipa Soo and Raffi Barsoumian.\n\nCraig Sweeny is executive producer and showrunner. Pilot is based on a story by Sweeny and Craig Turk. Carl Beverly and Sarah Timberman also executive produce, alongside director Marc Webb. The drama is produced by CBS Television Studios.\n\n“The Red Line”\n\nAfter a white cop in Chicago mistakenly shoots and kills a black doctor, we follow three vastly different families that all have connections with the case as the story is told from each perspective.\n\nCast includes Noah Wyle, Emayatzy Corinealdi, Aliyah Royale, Noel Fisher, Michael Patrick Thornton, Vinny Chhibber, Howard Charles and Elizabeth Laidlaw.\n\nCaitlin Parrish and Erica Weiss are writers and co-executive producers. Ava DuVernay, Greg Berlanti and Sarah Schechter will also executive prodcue. Victoria Mahoney is director on the drama from Warner Bros. Television.\n\nAlso Read: Why Fox Canceled 'Brooklyn Nine-Nine,' 'The Mick' and 'The Last Man on Earth'\n\nABC\n\nRenewed Series: “The Goldbergs,” “The Good Doctor,” “Grey’s Anatomy,” “Modern Family,” “Speechless,” “Splitting Up Together,” “How to Get Away With Murder,” “American Housewife,” “Black-ish,” “For the People,” “Fresh Off the Boat,” “Station 19,” “Marvel’s Agents of S.H.I.E.L.D.”\n\nCanceled/Ending Series: “The Mayor,” “The Middle,” “Once Upon a Time,” “Scandal,” “Ten Days in the Valley,” “Quantico,” “Designated Survivor,” “Alex, Inc.,” “The Crossing,” “Deception,” “Kevin (Probably) Saves the World,” “Marvel’s Inhumans,” “Roseanne”\n\nNewly Ordered Series: “The Rookie,” “Take Two,” “Schooled” (“Goldbergs” spinoff), “A Million Little Things,” “Single Parents,” “Grand Hotel,” “Whiskey Cavalier,” “The Fix,” “The Kids Are Alright”\n\nAlso Read: Carol Burnett Disses Modern Broadcast TV: 'There Are Just Too Many Cooks Now'\n\nHere are the official descriptions for the new 2018-19 ABC shows:\n\n“The Rookie”\n\nAt an age where most are at the peak of their career, John Nolan (Nathan Fillion) casts aside his comfortable, small town life and moves to L.A. to pursue his dream of being a cop. Now, surrounded by rookies twenty years his junior, Nolan must navigate the dangerous, humorous and unpredictable world of a “young” cop, determined to make his second shot at life count.\n\nThe cast includes Nathan Fillion, Afton Williamson, Eric Winter, Richard T. Jones, Melissa O’Neil, Titus Makin, Alyssa Diaz and Mercedes Mason.\n\nAlexi Hawley will write and executive produce. Liz Friedlander will direct and executive produce. Fillion, Mark Gordon, Nicholas Pepper, Michelle Chapman and Jon Steinberg are also executive producers. “The Rookie” is a MGCo and ABC Studios co-production.\n\nAlso Read: 'American Idol' Renewed for Second Season at ABC\n\n“Take Two”\n\nAn entertaining private investigator procedural with a unique balance of comedy and drama. Sam Swift (Rachel Bilson), the former star of a hit cop series is fresh-out-of-rehab following a bender of epic proportions. Desperate to restart her career, she talks her way into shadowing rough-and-tumble private investigator Eddie Valetik (Eddie Cibrian) as research for a potential comeback role. Though lone wolf Eddie resents the babysitting gig, high-spirited Sam proves herself to be surprisingly valuable, drawing on her acting skills and 200 episodes of playing a detective.\n\nThe cast includes Rachel Bilson, Eddie Cibrian, Aliyah O’Brien, Xavier de Guzman and Alice Lee.\n\nTerri Edda Miller and Andrew W. Marlowe will write an executive produce. Rola Bauer and Tim Halkin also executive produce. “Take Two” is produced by ABC Studios, Tandem Productions, StudioCanal and Milmar Pictures.\n\nAlso Read: Everybody Who's Been Murdered on 'Scandal' -- And Who Murdered Them (Photos)\n\n“Schooled” (“The Goldbergs” spinoff)\n\nThe spinoff will be set in 1990-something and follow the hilarious teachers of William Penn Academy – led by Principal Glascott (Tim Meadows), Coach Mellor (Bryan Callen) and Lainey Lewis (AJ Michalka) – who, despite their eccentricities and crazy personal lives, are heroes to their students.\n\nMarc Firek will write and executive produce, with story by Firek and “The Goldbergs” creator Adam F. Goldberg. Doug Robinson also executive produces. The untitled series is produced by Sony Pictures Television and ABC Studios.\n\nAlso Read: Ratings: Pauley Perrette's 'NCIS' Farewell Nabs Nearly 15 Million Viewers\n\n“A Million Little Things”\n\nThey say friendship isn’t one big thing, it’s a million little things; and that’s true for a group of friends from Boston who bonded under unexpected circumstances. Some have achieved success, others are struggling in their careers and relationships, but all of them feel stuck in life. After one of them dies unexpectedly, it’s just the wake-up call the others need to finally start living. Along the way they discover that friends may be the one thing to save them from themselves.\n\n“A Million Little Things” stars David Giuntoli as Eddie, Ron Livingston as Jon, Romany Malco as Rome, Allison Miller as Maggie, Christina Moses as Regina, Christina Ochoa as Ashley, James Roday as Gary, Stephanie Szostak as Delilah and Lizzy Greene as Sophie.\n\nDJ Nash is writer and executive producer; Aaron Kaplan and Dana Honor are executive producers; and James Griffiths is the director on the pilot and an executive producer, from ABC Studios/Kapital Entertainment.\n\n“Single Parents”\n\nThis ensemble comedy follows a group of single parents as they lean on each other to help raise their 7-year-old kids and maintain some kind of personal lives outside of parenthood. The series begins when the group meets Will, a 30-something guy who’s been so focused on raising his daughter that he’s lost sight of who he is as a man. When the other single parents see just how far down the rabbit hole of PTA, parenting and princesses Will has gone, they band together to get him out in the dating world and make him realize that being a great parent doesn’t mean sacrificing everything about your own identity.\n\nThe series stars Taran Killam as Will, Leighton Meester as Angie, Kimrie Lewis as Poppy, Jake Choi as Miggy, Marlow Barkley as Sophie, Tyler Wladis as Graham, Devin Trey Campbell as Rory, Grace Hazelett as Emma, Sadie Hazelett as Amy and Brad Garrett as Douglas.\n\nThe series is from 20th Century Fox Television and ABC Studios. JJ Philbin and Liz Meriwether are creators and executive producers, and Katharine Pope is executive producer. The pilot was directed by Jason Winer, who is also an executive producer.\n\nAlso Read: Hulu, Netflix Pass on 'Brooklyn Nine-Nine,' Will Not Rescue Fox Comedy From Cancellation\n\n“Grand Hotel”\n\nEva Longoria executive produces this bold, provocative drama set at the last family-owned hotel in multicultural Miami Beach. Charismatic Santiago Mendoza owns the hotel, while his glamorous second wife, Gigi, and their adult children enjoy the spoils of success. The hotel’s loyal staff round out a contemporary, fresh take on an upstairs/downstairs story. Wealthy and beautiful guests bask in luxury, but scandals, escalating debt and explosive secrets hide beneath the picture-perfect exterior. The show is based on the Spanish series.\n\nThe series stars Demian Bichir as Santiago Mendoza, Roselyn Sanchez as Gigi Mendoza, Denyse Tontz as Alicia Mendoza, Bryan Craig as Javi Mendoza, Wendy Raquel Robinson as Mrs. P, Lincoln Younes as Danny, Shalim Ortiz as Mateo, Anne Winters as Ingrid, Chris Warren as Jason, Feliz Ramirez as Carolina and Justina Adorno as Yoli.\n\nBrian Tanen is the writer and executive producer; Eva Longoria and Ben Spector (UnbeliEVAble), Ramon Campos and Teresa Fernandez-Valdes (Beta) are executive producers of the series. Ken Olin directed the pilot. Series produced by ABC Studios.\n\n“Whiskey Cavalier”\n\n“Whiskey Cavalier” is a high-octane, hour-long action dramedy that follows the adventures of tough but tender FBI super-agent Will Chase (codename: “Whiskey Cavalier”), played by Scott Foley. Following an emotional break-up, Chase is assigned to work with badass CIA operative Francesca “Frankie” Trowbridge (codename: “Fiery Tribune”), played by Lauren Cohan. Together, they lead an inter-agency team of flawed, funny and heroic spies who periodically save the world (and each other) while navigating the rocky roads of friendship, romance and office politics. The series is from writer/executive producer Dave Hemingson and executive producer Bill Lawrence with Warner Bros. Television.\n\nThe series stars Scott Foley as Will Chase, Lauren Cohan as Francesca “Frankie” Trowbridge, Ana Ortiz as Susan Sampson, Tyler James Williams as Edgar Standish and Vir Das as Jai Datta.\n\nDave Hemingson is writer and executive producer; Bill Lawrence and Jeff Ingold (Doozer Productions) are executive producers; Peter Atencio is director and executive producer (pilot), and Scott Foley is producer of the series from Warner Bros. Television.\n\nAlso Read: 'Brooklyn Nine-Nine' Saved? Other Networks and Platforms Have Already Expressed Interest\n\n“The Fix”\n\nAttorney and author Marcia Clark co-writes and executive produces a new legal drama about Maya Travis, an L.A. district attorney who suffers a devastating defeat when prosecuting an A-list actor for double murder. With her high-profile career derailed, she flees for a quieter life in Washington. Eight years later when this same celebrity is under suspicion for another murder, Maya Travis is lured back to the DA’s office for another chance at justice. This legal thriller is executive produced/co-written by Clark, Liz Craft and Sarah Fain, and is from Mandeville TV and ABC Studios.\n\n“The Fix” stars Robin Tunney as Maya Travis, Adam Rayner as Matthew Collier, Merrin Dungey as CJ, Breckin Meyer as Alan Wiest, Marc Blucas as Riv, Mouzam Makkar as Loni\n\nKampoor, Alex Saxon as Gabriel Johnson, with Scott Cohen as Ezra Wolf and Adewale Akinnouye-Agbaje as Sevvy Johnson.\n\nElizabeth Craft & Sarah Fain and Marcia Clark are writers and executive producers, David Hoberman, Todd Lieberman and Laurie Zaks are executive producers (Mandeville). Larysa Kondracki directed the pilot.\n\n“The Kids Are Alright”\n\nSet in the 1970s, this ensemble comedy follows a traditional Irish-Catholic family, the Clearys, as they navigate big and small changes during one of America’s most turbulent decades. In a working-class neighborhood outside Los Angeles, Mike and Peggy raise eight boisterous boys who live out their days with little supervision. The household is turned upside down when oldest son Lawrence returns home and announces he’s quitting the seminary to go off and “save the world.” Times are changing and this family will never be the same. There are 10 people, three bedrooms, one bathroom and everyone in it for themselves. The series is inspired by the childhood of writer/executive producer Tim Doyle.\n\nThe series stars Michael Cudlitz as Mike Cleary, Mary McCormack as Peggy Cleary, Sam Straley as Lawrence, Caleb Martin Foote as Eddie, Sawyer Barth as Frank Christopher Paul Richards as Joey, Jack Gore as Timmy, Andy Walken as William and Santino Barnard as Pat.\n\nRandall Einhorn directed and was an executive producer on the pilot. The series is from ABC Studios.\n\nAlso Read: 'Brooklyn Nine-Nine' Superfan Lin-Manuel Miranda Leads Charge to Save Fox Comedy\n\nFox\n\nRenewed Series: “The Gifted,” “9-1-1,” “The Orville,” “The Simpsons,” “Bob’s Burgers,” “Family Guy,” “Empire,” “The Resident,” “Star,” “Lethal Weapon,” “Gotham”\n\nCanceled/Ending Series: “New Girl,” “The X-Files,” “Brooklyn Nine-Nine,” “The Mick,” “Last Man on Earth,” “Lucifer,” “The Exorcist,” “LA to Vegas”\n\nSeries Awaiting Decisions: “Ghosted”\n\nNewly Ordered Series: “The Cool Kids,” “The Passage,” “Proven Innocent,” “Rel,” “Last Man Standing”\n\nAlso Read: Fox Reports Weak Q3 Earnings, Points to Lack of Super Bowl Revenue\n\nHere are the official descriptions for the new 2018-19 Fox shows:\n\n“The Cool Kids”\n\nThree guy friends in a retirement community are the top dogs until they’re blown out of the water by the newest member of the community, a female rebel whose ready to challenge their place – it’s high school with 70 somethings.\n\nThe cast includes Vicki Lawrence, Martin Mull, David Alan Grier and Leslie Jordan.\n\nCharlie Day and Paul Fruchbom are writers on the series, with Day serving as executive producer and Fruchbom as co-EP. Kevin Abbott is showrunner and Don Scardino is director. Nick Frenkel also executive produces. The multi-camera comedy is produced by 20th Century Fox Television in association with FX Productions.\n\nAlso Read: 21st Century Fox to Buy 7 TV Stations From Sinclair Broadcast Group for $910 Million\n\n“The Passage”\n\nBased on author Justin Cronin’s best‐selling trilogy of the same name, “The Passage” is an epic, character‐driven thriller about a secret government medical facility experimenting with a dangerous virus that could either cure all disease or cause the downfall of the human race. The series focuses on a 10‐year‐old girl named Amy Bellafonte, who is chosen to be a test subject for this experiment and Brad Wolgast, the Federal agent who becomes her surrogate father as he tries to protect her.\n\nThe cast includes Mark‐Paul Gosselaar, Saniyya Sidney, Vincent Piazza, Brianne Howey, Jamie McShane, Caroline Chikezie, Emmanuelle Chriqui.\n\nElizabeth Heldens is writer and executive producer. Jason Ensler and Marcos Siega are both credited as directors on the pilot, with Matt Reeves, Ridley Scott, David W. Zucker and Adam Kassan also executive producing. “The Passage” is produced by 20th Century Fox Television, 6th & Idaho and Scott Free Productions.\n\nAlso Read: 'Lethal Weapon' Considers Replacing Star Clayne Crawford\n\n“Proven Innocent”\n\nA legal drama set in an wrongful conviction firm. Led by a fierce and fearless female lawyer with a hunger for justice, the team reopens investigations, putting their own lives in danger to exonerate the innocent that were ‘proven’ guilty. Our lead’s motivation comes from her infamous past; as a young adult she was found guilty and later exonerated in a high-profile case in which she became a tabloid sensation, household name and national celebrity. While a hero and a victim to some, her bold and bullish tactics garner her some enemies– one of whom will do anything to see her go down for a crime we know she did not commit. We will watch her defend others as she fights to maintain her own innocence.\n\n\n\nCast includes Rachelle Lefevre, Russell Hornsby, Nikki M. James, Vincent Kartheiser, Riley Smith and Clare O’Connor.\n\nDavid Elliot is writer and executive producer on the series. Patricia Riggen directs, and Danny Strong and Stacy Greenberg executive produce. The one-hour drama is produced by Danny Strong Productions in association with 20th Century Fox Television.\n\n“Rel”\n\nLil Rel, a prideful, self-made success who lives by the code to “always believe in yourself and great things will come,” finds that attitude put to the test when he learns his wife is having an affair with his own barber. He tries to rebuild his life post-divorce as a long-distance single father on the South Side of Chicago who’s on a quest for love, respect and a new barber. Inspired by Lil Rel Howrey’s real life.\n\n\n\nCast includes Howrey, Sinbad, Jess “Hilarious” Moore and Jordan L. Jones.\n\nHowrey will also write and executive produce with Kevin Barnett & Josh Rabinowitz. Jerrod Carmichael also executive produces. Mike Scully is showrunner, and Gerry Cohen is director. The multi-camera sitcom is produced by 20th Century Fox Television.\n\n“Last Man Standing”\n\nA revival of the ABC sitcom, “Last Man Standing” stars Tim Allen as a married father of three girls, who tries to maintain his manliness in a world increasingly dominated by women.\n\nProduced by 20th Century Fox Television and created by Jack Burditt, the series also stars Nancy Travis, Jonathan Adams, Amanda Fuller, Christoph Sanders and Jordan Masterson.\n\nAlso Read: Summer TV Premiere Dates: Every New and Returning Show (Photos)\n\nThe CW\n\nRenewed Series: “Crazy Ex-Girlfriend,” “Jane the Virgin,” “Dynasty,” “Arrow,” “Supernatural,” “Riverdale,” “Supergirl,” “DC’s Legends of Tomorrow,” “Black Lightning,” “The Flash,” “The 100,” “iZombie”\n\nCanceled Series: “Life Sentence,” “Valor”\n\nNewly Ordered Series: “Charmed,” “In the Dark,” “Roswell, New Mexico,” “All American,” “Legacies”\n\nHere are the official descriptions for the new 2018-19 The CW shows:\n\n“Charmed”\n\nAfter the tragic death of their mother, three sisters in a college town are stunned to discover they are witches. Soon this powerful threesome must stand together to fight the everyday and supernatural battles that all modern witches must face: from vanquishing powerful demons to toppling the patriarchy.\n\nThe three sisters will be played by Madeleine Mantock, Melonie Diaz and Sarah Jeffery.\n\nThe series (a reboot of the show of the same name which ran on The WB/The CW from 1998-2006) is written and executive produced by Jessica O’Toole and Amy Rardin, along with executive producer and creator Jennie Urman. Brad Silberling directed the pilot and is grabbing an executive producing credit with Ben Silverman and Carter Covington. It comes from CBS Television Studios in association with Propagate Content.\n\nAlso Read: 'Charmed' Casts Madeleine Mantock as the 3rd Sister in CW Reboot Pilot\n\n“In the Dark”\n\nA flawed and irreverent blind woman is the only “witness” to the murder of her drug-dealing friend. After the police dismiss her story, she sets out with her dog, Pretzel, to find the killer while also managing her colorful dating life and the job she hates at the guide dog school owned by her overprotective parents.\n\nIt is written and executive produced by Corinne Kingsbury, along with Ben Stiller, Jackie Cohn, Nicky Weinstock, Emily Fox (Red Hour Films). Michael Showalter directed the pilot and will also executive produce. The series hails from CBS Television Studios and Warner Bros. TV in association with Red Hour Films.\n\n“Roswell, New Mexico”\n\nAfter reluctantly returning to her tourist-trap hometown of Roswell, New Mexico, the daughter of undocumented immigrants discovers a shocking truth about her teenage crush who is now a police officer: he’s an alien who has kept his unearthly abilities hidden his entire life. She protects his secret as the two reconnect and begin to investigate his origins, but when a violent attack and long-standing government cover-up point to a greater alien presence on Earth, the politics of fear and hatred threaten to expose him and destroy their deepening romance.\n\nThe cast includes Jeanine Mason, Nathan Parsons, Tyler Blackburn and Michael Trevino.\n\nCarina Adly MacKenzie is writer and executive producer, along with Brett Matthews, Justin Falvey, Darryl Frank and Lawrence Bender and Kevin Kelly Brown. Julie Plec directed the pilot and is an executive producer. The series is based on the Roswell High book series, by Melinda Metz and hails fromWarner Bros. Television and CBS Television Studios in association with Amblin Television and Bender Brown Productions.\n\nAlso Read: 'Roswell' Reboot Pilot Casts Jeanine Mason as Lead\n\n“All American”\n\nWhen a rising high school football player from South L.A. is recruited to play for Beverly Hills High, the wins, losses and struggles of two families from vastly different worlds — Crenshaw and Beverly Hills — begin to collide. Inspired by the life of pro football player Spencer Paysinger.\n\nApril Blair is writer and executive producer, along with Greg Berlanti and Sarah Schechter. Rob Hardy directed the pilot and will also executive produce. Robbie Rogers is a producer and Dane Morck will act as a consultant. The series is backed by Warner Bros. Television and CBS Television Studios in association with Berlanti Productions.\n\n“Legacies”\n\nContinuing the tradition of “The Vampire Diaries” and “The Originals,” the story of the next generation of supernatural beings at The Salvatore School for the Young and Gifted. Klaus Mikaelson’s daughter, 17-year-old Hope Mikaelson; Alaric Saltzman’s twins, Lizzie and Josie Saltzman; and other young adults come of age in the most unconventional way possible, nurtured to be their best selves…in spite of their worst impulses. Will these young witches, vampires and werewolves become the heroes they want to be — or the villains they were born to be?\n\nJulie Plec and Brett Matthews write and executive producer, along with Leslie Morgenstein and Gina Girolamo. The series comes from Warner Bros. Television and CBS Television Studios, in association with My So-Called Television and Alloy Entertainment\n\nAlso Read: 11 TV Cast Upheavals, From 'House of Cards' to 'The Walking Dead' (Photos)\n\nWe’ll know the fate of pretty much everything by next Thursday, which is when the broadcast television upfronts conclude.\n\nHere is next week’s upfront presentations schedule:\n\nNBC (Monday)\n\nFox (Monday)\n\nABC (Tuesday)\n\nCBS (Wednesday)\n\nThe CW (Thursday)\n\nFind descriptions for all of the outstanding broadcast pilots here.", "images": ["https://www.thewrap.com/wp-content/uploads/2017/01/ABC-logo.jpg", "https://www.thewrap.com/wp-content/uploads/2021/07/Jennifer-Maas-96x96.jpeg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/tw_red.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup2.png", "https://www.thewrap.com/wp-content/uploads/2018/04/executive-compensation-2017.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-filled.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/account.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/ig_red.png", "https://www.thewrap.com/wp-content/uploads/2017/01/The-CW-logo.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/gopro.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/search.png", "https://www.thewrap.com/wp-content/uploads/2019/08/Tony-Maglio-96x96.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/login.png", "https://www.thewrap.com/wp-content/uploads/2022/05/thewrap-film-slate.png", "https://www.thewrap.com/wp-content/uploads/2018/05/SCHOOLED-1.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/yt_red.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/all-white-logo.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/newsletter.png", "https://www.thewrap.com/wp-content/uploads/2022/08/0815_TheWrap_Cover_768x922px.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/mobile-footer-promotion.png", "https://www.thewrap.com/wp-content/uploads/2019/08/Reid-Nakamura-96x96.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/fb_red.png", "https://www.thewrap.com/wp-content/uploads/2018/05/renewedshows.jpg", "https://www.thewrap.com/wp-content/uploads/2017/01/Fox-logo.jpg", "https://www.thewrap.com/wp-content/uploads/2022/05/First-Take-Logo_Small.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-black.svg", "https://www.thewrap.com/wp-content/plugins/contextual-links/assets/img/loading.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/uploads/2022/05/First-Take-Logo-Stacked.png", "https://www.thewrap.com/wp-content/uploads/2017/01/CBS-logo.jpg", "https://www.thewrap.com/wp-content/uploads/2022/05/Image-2022-04-26-at-3.00.43-PM-300x81.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/logo-dark.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-alt.svg", "https://www.thewrap.com/wp-content/uploads/2014/02/NBC-Logo.jpg"], "top_img": "https://www.thewrap.com/wp-content/uploads/2018/05/renewedshows.jpg", "keywords": [], "authors": ["Tony Maglio", "Reid Nakamura", "Jennifer Maas"], "canonical_link": "https://www.thewrap.com/fall-tv-2018-canceled-renewed-pilot-orders-abc-fox-cbs-nbc-cw/", "title": "Fall TV 2018: Every Broadcast Show Canceled, Renewed and Ordered So Far (Updating)", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "msapplication-TileColor": "#f9f9f9", "theme-color": "#ffffff", "parsely-title": "Fall TV 2018: Every Broadcast Show Canceled, Renewed and Ordered So Far (Updating)", "parsely-link": "https://www.thewrap.com/fall-tv-2018-canceled-renewed-pilot-orders-abc-fox-cbs-nbc-cw/", "parsely-type": "post", "parsely-pub-date": "2018-05-29T13:00:20-07:00", "parsely-section": "tv", "parsely-author": "Jennifer Maas", "parsely-tags": "abc, cbs, fox, nbc, the_cw, upfronts-2018", "pubexchange": {"image": "https://www.thewrap.com/wp-content/uploads/2018/05/renewedshows-160x105.jpg"}, "description": "TheWrap's got your comprehensive list on which scripted series made the cut for next fall and spring", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Fall TV 2018: Every Broadcast Show Canceled, Renewed and Ordered So Far (Updating)", "description": "TheWrap's got your comprehensive list on which scripted series made the cut for next fall and spring", "url": "https://www.thewrap.com/fall-tv-2018-canceled-renewed-pilot-orders-abc-fox-cbs-nbc-cw/", "site_name": "TheWrap", "updated_time": "2018-05-29T17:43:26-07:00", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2018/05/renewedshows.jpg", "secure_url": "https://www.thewrap.com/wp-content/uploads/2018/05/renewedshows.jpg", "width": 618, "height": 412, "alt": "Renewed, Canceled, Bubble Shows", "type": "image/jpeg"}}, "article": {"publisher": "https://facebook.com/thewrap", "author": "https://www.facebook.com/tony.maglio.7?ref=tn_tnmn", "tag": "Upfronts 2018", "section": "Business", "published_time": "2018-05-29T13:00:20-07:00", "modified_time": "2018-05-29T17:43:26-07:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "title": "Fall TV 2018: Every Broadcast Show Canceled, Renewed and Ordered So Far (Updating)", "description": "TheWrap's got your comprehensive list on which scripted series made the cut for next fall and spring", "site": "@thewrap", "creator": "@tonymaglio", "image": "https://www.thewrap.com/wp-content/uploads/2018/05/renewedshows.jpg", "label1": "Written by", "data1": "Tony Maglio", "label2": "Time to read", "data2": "30 minutes"}, "generator": "WooFramework 6.2.0", "BridPlugin": "oauth_token:01110011 01100101 01100011 01110010 01100101 01110100|ver:3.2.2|site:16228|widget:1|disable_video_autosave:|channels:Array|width:640|height:360|autoplay:0|aspect:1|user_id:17159|default_channel:18|ovr_def:1|async_embed:1|google_seo:1|raw_embed:1|unit:13381|unit_width:480|unit_height:270|player:21259|video_image:|onready:", "addsearch-custom-field": "conditional_tag=is_singular", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": [], "publish_date": 1527624020.0, "source": "https://www.thewrap.com", "summary": ""}