{"url": "https://www.cnn.com/2018/05/14/politics/melania-trump-surgery/index.html", "text": "CNN —\n\nFirst lady Melania Trump underwent kidney surgery Monday at Walter Reed National Military Medical Center near Washington, DC, according to a statement from her office.\n\nTrump had been experiencing an issue with her kidney that her office described as benign but requiring medical attention.\n\n“This morning, first lady Melania Trump underwent an embolization procedure to treat a benign kidney condition. The procedure was successful, and there were no complications,” the first lady’s communications director, Stephanie Grisham, said in a statement.\n\n“Mrs. Trump is at Walter Reed National Military Medical Center and will likely remain there for the duration of the week. The first lady looks forward to a full recovery so she can continue her work on behalf of children everywhere,” Grisham wrote.\n\nPresident Donald Trump remained in the White House during Melania Trump’s surgery. He tweeted just after 5 p.m. Monday that he was heading to hospital to visit his wife in Marine One.\n\n“Heading over to Walter Reed Medical Center to see our great First Lady, Melania. Successful procedure, she is in good spirits. Thank you to all of the well-wishers!” Trump tweeted.\n\nTrump, who turned 48 last month, had surgery at Walter Reed in nearby Bethesda, Maryland, on Monday morning.\n\nShe is the first US first lady to undergo such a serious medical procedure while in the White House since Nancy Reagan had a mastectomy in October 1987. Rosalynn Carter underwent surgery to remove a benign lump from her breast in April 1977. Weeks after Betty Ford became first lady, she was diagnosed with breast cancer and underwent a mastectomy in September 1974.\n\nThe first lady did not move to Washington until six months into the administration, choosing to let their son, Barron, finish the 2017 school year in New York. More recently, Melania Trump has had a more public profile. On April 24, she and the President hosted the first official state dinner of the Trump administration, an event that was planned and executed primarily by the first lady.\n\nTrump was responsible for every aspect of the formal dinner in honor of French President Emmanuel Macron and his wife, Brigitte Macron, from the hand-selected ivory tablecloths to the menu, which the first lady designed to meld American food with French influence. During the welcome ceremony leading up to the dinner, Melania Trump stole headlines, wearing a crisp white Michael Kors Collection suit with a matching white hat, custom-made by her personal couturier. The hat set the internet ablaze, with references and comparisons to Beyoncé, the suffragette movement and even television character Olivia Pope of “Scandal.”\n\nOn May 7, Trump, a relatively private first lady by comparison to her most recent predecessors, was once again front and center, this time to unveil her formal platform, Be Best. She kicked off the initiative with a Rose Garden speech lasting 11 minutes, the longest public speaking engagement during her 16-month tenure as first lady.\n\nBe Best is a three-pronged platform with a focus on opioid addiction and families, general physical and emotional well-being of children, and kindness and safety for kids using social media. The latter caused a firestorm of controversy because it encompasses cyberbullying, a tactic that Melania Trump’s husband, the President, has often been accused of fueling. In March, the first lady addressed the criticism she has faced by taking up the issue during opening remarks to a meeting she convened at the White House for tech industry leaders from Google, Snap, Twitter, Facebook, Amazon and others.\n\n“I am well-aware that people are skeptical of me discussing this topic,” she said. “I have been criticized for my commitment to tackling this issue, and I know that will continue. But it will not stop me from doing what I know is right.”\n\nMelania Trump has also appeared with her husband several times in recent weeks. He was seated in the front row during her Be Best speech, after which he made remarks praising her commitment to helping children, and he was again second to speak, after his wife, during the Military Mothers and Spouses Ceremony on Friday in the White House East Room.\n\n“She’s become a very, very popular first lady. I’m reading that … They love Melania,” the President said. A new CNN poll released May 7 had the first lady’s favorable rating up 10 points since January to 57%.\n\nThis story is breaking and being updated.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/181005195400-01-melania-africa-trip.jpg?q=x_4,y_181,h_1965,w_3492,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/181006101213-melania-trump-10062018.jpg?q=x_112,y_41,h_962,w_1710,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180514120222-02-melania-trump-0507.jpg?q=x_0,y_0,h_1688,w_2999,c_fill/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180514120137-melania-trump-0305.jpg?q=x_5,y_0,h_2526,w_4490,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/181005144733-melania-trump-elephant.jpg?q=x_69,y_13,h_867,w_1541,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180614220236-melania-trump-brower.jpg?q=x_91,y_136,h_1331,w_2365,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180507131941-04-melania-trump-lead.jpg?q=x_3,y_30,h_1684,w_2993,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/180514120222-02-melania-trump-0507.jpg?q=x_0,y_0,h_1688,w_2999,c_fill/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/181012085503-melania-abc-interview.jpg?q=x_326,y_110,h_619,w_1100,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/170224160608-kate-bennett.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/180507153047-03-melania-trump-be-best-initiative-0507.jpg?q=x_3,y_149,h_1645,w_2923,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/180221134546-01-viktor-and-amalija-knavs.jpg?q=x_3,y_161,h_1684,w_2993,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/181013012041-melania-trump.jpg?q=x_35,y_44,h_1030,w_1831,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180621123006-melania-detention-center-03.jpg?q=x_431,y_155,h_619,w_1100,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180621143454-melania-trump-jacket-1.jpg?q=x_5,y_190,h_2729,w_4850,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/181010120659-melania-trump-abc-news.jpg?q=x_120,y_31,h_893,w_1588,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/181006095302-melania-trump-phone-advice-sot-vpx-00010312.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180621173120-02-melania-trump-jacket-0621.jpg?q=x_4,y_200,h_2171,w_3858,c_crop/w_250"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/180514120222-02-melania-trump-0507.jpg?q=x_0,y_0,h_1688,w_2999,c_fill/w_800", "keywords": [], "authors": ["Kate Bennett"], "canonical_link": "https://www.cnn.com/2018/05/14/politics/melania-trump-surgery/index.html", "title": "Melania Trump undergoes kidney surgery at Walter Reed", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Melania Trump undergoes kidney surgery at Walter Reed medical center | CNN Politics", "description": "First lady Melania Trump underwent kidney surgery Monday at Walter Reed National Military Medical Center, according to a statement from her office.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180514120222-02-melania-trump-0507.jpg?q=x_0,y_0,h_1688,w_2999,c_fill/w_800", "type": "article", "url": "https://www.cnn.com/2018/05/14/politics/melania-trump-surgery/index.html", "site_name": "CNN"}, "twitter": {"title": "Melania Trump undergoes kidney surgery at Walter Reed medical center | CNN Politics", "description": "First lady Melania Trump underwent kidney surgery Monday at Walter Reed National Military Medical Center, according to a statement from her office.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180514120222-02-melania-trump-0507.jpg?q=x_0,y_0,h_1688,w_2999,c_fill/w_800", "card": "summary_large_image", "site": "@cnnpolitics"}, "description": "First lady Melania Trump underwent kidney surgery Monday at Walter Reed National Military Medical Center, according to a statement from her office.", "template_type": "article_leaf", "type": "article", "meta-section": "politics", "theme": "politics", "article": {"published_time": "2018-05-14T19:12:17Z", "modified_time": "2018-05-14T22:04:34Z", "tag": "celebrities, donald trump, government and public administration, government bodies and offices, health and medical, medical treatments and procedures, melania trump, military, military veterans, political figures - us, population and demographics, society, surgery, us federal government, veterans health care, white house", "publisher": "https://www.facebook.com/CNN"}, "keywords": "celebrities, donald trump, government and public administration, government bodies and offices, health and medical, medical treatments and procedures, melania trump, military, military veterans, political figures - us, population and demographics, society, surgery, us federal government, veterans health care, white house", "author": "Kate Bennett", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1526252400.0, "source": "https://www.cnn.com", "summary": ""}