{"url": "https://www.billboard.com/articles/events/amas/8473647/tracee-ellis-ross-american-music-awards-host-2018", "text": "If you thought last year’s American Music Awards were hilarious, you’re in luck: Tracee Ellis Ross is coming back for a second year as the awards show’s host. The black-ish star will return as the night’s emcee as well as an executive producer for the 2018 American Music Awards, which will broadcast live from the Microsoft Theater in Los Angeles on Oct. 9.\n\n“SO NICE, I’M DOING IT TWICE,” Ross captioned an Instagram post revealing the news, which reminds fans just how sassy and silly — and fashionable — she was on last year’s show.\n\nRoss’ role as host at the 2017 AMAs made the show a family affair, as her mother, Diana Ross, received the lifetime achievement award. Though the same kind of family ties aren’t happening this year, Ross’ hosting gig is still timely: The fifth season of black-ish premieres a week after this year’s American Music Awards on Oct. 16.?\n\nNominations for the 2018 American Music Awards are set to be announced on Sept. 12, with Kane Brown, Ella Mai, Normani and Bebe Rexha unveiling the list live from YouTube Space LA in Los Angeles. The 2018 AMAs air Oct. 9 at 8:00 p.m. ET on ABC.\n\nCheck out Ross’ hosting announcement below.\n\nThey’ve created chart-topping hits with Nelly, The Chainsmokers and the Backstreet Boys, but when it came to Florida Georgia Line‘s latest collaboration, it took Tyler Hubbard’s wife to get the track rolling. The country duo feature on Bebe Rexha‘s latest single, “Meant to Be,” from her EP All Your Fault: Pt. 2, and the trio shared how the unexpected writing session was fueled from encouraging words of wisdom from Hubbard’s pregnant wife, Hayley.\n\n“It was my second session of the day and their second session of the day, and they were kind of over it and so was I,” Rexha tells Billboard during an exclusive interview after performing the track at an AMAs encore performance for Xfinity TV subscribers. “Tyler and I sat down, and he was like, ‘You know what my just wife told me? She said, ‘If it’s meant to be, it’ll be that we write a hit or not.’ And, I said, ‘Well that’s the song — let’s go!’ Then the song just poured out.”\n\nHaving worked with everyone from Lil Wayne and 2 Chainz to Martin Garrix and One Direction‘s Louis Tomlinson, Rexha prides herself in being a “renegade” with no genre boundaries, so needed little convincing when her manager suggested she explore the country world and “vibe out” with Florida Georgia Line. And, after the duo’s scheduled writing partner pulled out one night, the collaboration was simply “meant to be.”\n\n“We were supposed to write with somebody else, and it fell through, and she happened to be available, so it was an unexpected write and a pretty special night,” Hubbard says. “When songs like this get written, it’s pretty magical — everybody feels like we’re onto something big. We all fell in love with it, then Bebe decided she wanted to release it and have us feature, which was a huge honor. One thing lead to another and that’s what’s special thing about this song — it’s been super organic and nothing’s been forced.”\n\nRexha admits she was incredibly nervous about her first foray into the genre, and held misconceived perceptions about the lyrics and writing style of country artists. Sitting down with Hubbard, she was surprised at how well the pair “bled” into each other’s songwriting styles, and put their twist on each other’s verses.\n\nWhat she didn’t expect was that the feel-good ballad would help her through her own trouble.\n\n“I’ve recently been going through heartbreak, and I listen to the song, and it makes me feel better and like there’s some type of destiny and if something doesn’t work out then, there’s something better waiting for you,” she says. “I think that’s something we need more than ever with all the events going on in the world. People want to feel safe and like everything’s going to be OK.”\n\nThe AMAs encore performance can now be seen exclusively on Xfinity on Demand for Xfinity TV subscribers, along with behind-the-scenes footage of the acts preparing to hit the stage and archival clips of past AMAs.\n\nHaving grown up watching the AMAs with family while calling friends throughout the show to discuss outfits and performances, Rexha was thrilled to perform on the awards show stage.\n\nIt’s a long way from the 28-year-old Brooklyn native’s early days being discovered by Fall Out Boy‘s Pete Wentz and joining the bassist’s experimental project, Black Cards, in 2010. She has since penned/co-produced Eminem and Rihanna‘s smash “Monster,” and the Selena Gomez hit “Like a Champion,” plus featured on David Guetta‘s catchy “Mama,” alongside Nicki Minaj, and Tomlinson’s first solo single, “Back to You.”\n\nEach of her collaborators has left their mark on her success and drive.\n\n“Nicki taught me to be stronger as a woman and not feel so sorry about wanting things a certain way,” she reflects. “I told her how I watched one of her videos where she was saying how if you accept pickles at video shoots or on your rider, that’s what you’ll get and that’s how people will see you, but if you ask for something nice you’ll get something nicer! That really resonated with me — not just in that sense — but in terms of knowing how I want things done and being very clear in my vision.\n\n“Sometimes when I walk into a room, especially with males, it’s very startling because I know exactly how to work the pro-tools, cut my vocals, design my outfits, do fonts. I’m very hands-on, and she taught me to stick to that intuition and embrace it, instead of being scared.”\n\n“Then working with Louis Tomlinson was just so humbling,” she adds of the teen heartthrob. “It’s so different for guys! As girls, we get stressed over our image and insecure about our weight, whereas a guy wakes up in the morning, showers and throws his clothes on. What I loved about him was he was so humble, and it was actually startling because I’ve met people who haven’t been near the level of fame that Louis has experienced, yet he was one of the most humble people I’ve met, and it was so nice to be around that.”\n\nWhile Rexha has loved and learned from all of her collaborations, her next project, titled Expectations and dropping in 2018, will be focused more on her own voice.\n\nHowever, one thing fans can expect from Expectations is the unexpected.\n\n“I’m definitely changing up the sound,” she shares. “Everyone’s going into more of a rhythmic vibe and urban sound, especially female artists, but I’m going the complete opposite way. It’s very guitar-based and inspired by my favorite bands I grew up listening to, like No Doubt, and I’m not holding anything back.\n\n“It’s cool that ‘Meant to Be’ is this stripped-back song because I think it’ll help me pivot into that sound. And, the overall meaning of Expectations is just growing up in a world where I expected my parents to be superheros or my career and money to bring me happiness, but realizing as you get older that you have to be the creator of your own happiness. The things you thought might be are not.”\n\nBebe Rexha and Florida Geogia Line’s encore performance of “Meant to Be” will be available exclusively on Xfinity on Demand for Xfinity TV subscribers immediately following the show’s live television broadcast. Behind-the-scenes footage of the acts preparing to hit the stage and archival clips from past AMAs will also be available to Xfinity TV customers.", "images": ["https://www.billboard.com/wp-content/uploads/media/Tracee-Ellis-Ross-2017-AMAs-billboard-1548.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.billboard.com/wp-content/uploads/media/amas-recirc-2018-billboard.jpg", "https://www.billboard.com/wp-content/uploads/media/Tracee-Ellis-Ross-2017-AMAs-billboard-1548.jpg?w=942&h=623&crop=1", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif"], "top_img": "https://www.billboard.com/wp-content/uploads/media/Tracee-Ellis-Ross-2017-AMAs-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Taylor Weatherby"], "canonical_link": "https://www.billboard.com/music/awards/tracee-ellis-ross-american-music-awards-host-2018-8473647/", "title": "Tracee Ellis Ross to Return as American Music Awards Host", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "The black-ish star will return as the night's emcee as well as an executive producer for the 2018 American Music Awards, which will broadcast live from the Microsoft Theater in Los Angeles on Oct. 9.", "news_keywords": "ama, bbnews, Tracee Ellis Ross", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 8473647, "author": "Taylor Weatherby", "pmc-category": "Awards,Music", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-09-05T10:13:49"}, "pmc-tag": "ama,bbnews,Tracee Ellis Ross", "title": "Tracee Ellis Ross to Return as American Music Awards Host", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Taylor Weatherby", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 8473647, "title": "Tracee Ellis Ross to Return as American Music Awards Host", "published_at": "2018-09-05 10:13:49", "image": "https://www.billboard.com/wp-content/uploads/media/Tracee-Ellis-Ross-2017-AMAs-billboard-1548.jpg?w=1024", "comment_count": 0, "tags": "Tracee Ellis Ross", "topics": "Music", "body": "If you thought last year's American Music Awards were hilarious, you're in luck: Tracee Ellis Ross is coming back for a second year as the awards show's host. The black-ish star will return as the night's emcee as well as an executive producer for the 2018 American Music Awards, which will broadcast live from the Microsoft Theater in Los Angeles on Oct. 9.\"SO NICE, I’M DOING IT TWICE,\" Ross captioned an Instagram post revealing the news, which reminds fans just how sassy and silly -- and fashionable -- she was on last year's show.Ross' role as host at the 2017 AMAs made the show a family affair, as her mother, Diana Ross, received the lifetime achievement award. Though the same kind of family ties aren't happening this year, Ross' hosting gig is still timely: The fifth season of black-ish premieres a week after this year's American Music Awards on Oct. 16.?Nominations for the 2018 American Music Awards are set to be announced on Sept. 12, with Kane Brown, Ella Mai, Normani and Bebe Rexha unveiling the list live from YouTube Space LA in Los Angeles. The 2018 AMAs air Oct. 9 at 8:00 p.m. ET on ABC.Check out Ross' hosting announcement below. SO NICE, I’M DOING IT TWICE // i’m hosting the @amas again! airing LIVE tuesday, october 9th on @abcnetwork! -- #AMAsA post shared by  Tracee Ellis Ross (@traceeellisross) on Sep 5, 2018 at 6:00am PDTThey've created chart-topping hits with Nelly, The Chainsmokers and the Backstreet Boys, but when it came to Florida Georgia Line's latest collaboration, it took Tyler Hubbard's wife to get the track rolling. The country duo feature on Bebe Rexha's latest single, \"Meant to Be,\" from her EP All Your Fault: Pt. 2, and the trio shared how the unexpected writing session was fueled from encouraging words of wisdom from Hubbard's pregnant wife, Hayley.\"It was my second session of the day and their second session of the day, and they were kind of over it and so was I,\" Rexha tells Billboard during an exclusive interview after performing the track at an AMAs encore performance for Xfinity TV subscribers. \"Tyler and I sat down, and he was like, 'You know what my just wife told me? She said, 'If it's meant to be, it'll be that we write a hit or not.' And, I said, 'Well that's the song -- let's go!' Then the song just poured out.\"Having worked with everyone from Lil Wayne and 2 Chainz to Martin Garrix and One Direction's Louis Tomlinson, Rexha prides herself in being a \"renegade\" with no genre boundaries, so needed little convincing when her manager suggested she explore the country world and \"vibe out\" with Florida Georgia Line. And, after the duo's scheduled writing partner pulled out one night, the collaboration was simply \"meant to be.\"\"We were supposed to write with somebody else, and it fell through, and she happened to be available, so it was an unexpected write and a pretty special night,\" Hubbard says. \"When songs like this get written, it's pretty magical -- everybody feels like we're onto something big. We all fell in love with it, then Bebe decided she wanted to release it and have us feature, which was a huge honor. One thing lead to another and that's what's special thing about this song -- it's been super organic and nothing's been forced.\"Rexha admits she was incredibly nervous about her first foray into the genre, and held misconceived perceptions about the lyrics and writing style of country artists. Sitting down with Hubbard, she was surprised at how well the pair \"bled\" into each other's songwriting styles, and put their twist on each other's verses.What she didn't expect was that the feel-good ballad would help her through her own trouble.\"I've recently been going through heartbreak, and I listen to the song, and it makes me feel better and like there's some type of destiny and if something doesn't work out then, there's something better waiting for you,\" she says. \"I think that's something we need more than ever with all the events going on in the world. People want to feel safe and like everything's going to be OK.\"The AMAs encore performance can now be seen exclusively on Xfinity on Demand for Xfinity TV subscribers, along with behind-the-scenes footage of the acts preparing to hit the stage and archival clips of past AMAs.Having grown up watching the AMAs with family while calling friends throughout the show to discuss outfits and performances, Rexha was thrilled to perform on the awards show stage.It's a long way from the 28-year-old Brooklyn native's early days being discovered by Fall Out Boy's Pete Wentz and joining the bassist's experimental project, Black Cards, in 2010. She has since penned/co-produced Eminem and Rihanna's smash \"Monster,\" and the Selena Gomez hit \"Like a Champion,\" plus featured on David Guetta's catchy \"Mama,\" alongside Nicki Minaj, and Tomlinson's first solo single, \"Back to You.\"Each of her collaborators has left their mark on her success and drive.\"Nicki taught me to be stronger as a woman and not feel so sorry about wanting things a certain way,\" she reflects. \"I told her how I watched one of her videos where she was saying how if you accept pickles at video shoots or on your rider, that's what you'll get and that's how people will see you, but if you ask for something nice you'll get something nicer! That really resonated with me -- not just in that sense -- but in terms of knowing how I want things done and being very clear in my vision.\"Sometimes when I walk into a room, especially with males, it's very startling because I know exactly how to work the pro-tools, cut my vocals, design my outfits, do fonts. I'm very hands-on, and she taught me to stick to that intuition and embrace it, instead of being scared.\"\"Then working with Louis Tomlinson was just so humbling,\" she adds of the teen heartthrob. \"It's so different for guys! As girls, we get stressed over our image and insecure about our weight, whereas a guy wakes up in the morning, showers and throws his clothes on. What I loved about him was he was so humble, and it was actually startling because I've met people who haven't been near the level of fame that Louis has experienced, yet he was one of the most humble people I've met, and it was so nice to be around that.\"While Rexha has loved and learned from all of her collaborations, her next project, titled Expectations and dropping in 2018, will be focused more on her own voice.However, one thing fans can expect from Expectations is the unexpected.\"I'm definitely changing up the sound,\" she shares. \"Everyone's going into more of a rhythmic vibe and urban sound, especially female artists, but I'm going the complete opposite way. It's very guitar-based and inspired by my favorite bands I grew up listening to, like No Doubt, and I'm not holding anything back.\"It's cool that 'Meant to Be' is this stripped-back song because I think it'll help me pivot into that sound. And, the overall meaning of Expectations is just growing up in a world where I expected my parents to be superheros or my career and money to bring me happiness, but realizing as you get older that you have to be the creator of your own happiness. The things you thought might be are not.\"Bebe Rexha and Florida Geogia Line's encore performance of \"Meant to Be\" will be available exclusively on Xfinity on Demand for Xfinity TV subscribers immediately following the show’s live television broadcast. Behind-the-scenes footage of the acts preparing to hit the stage and archival clips from past AMAs will also be available to Xfinity TV customers.", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "Tracee Ellis Ross to Return as American Music Awards Host", "url": "https://www.billboard.com/music/awards/tracee-ellis-ross-american-music-awards-host-2018-8473647/", "description": "The black-ish star will return as the night’s emcee as well as an executive producer for the 2018 American Music Awards, which will broadcast live from the Microsoft Theater in Los Angeles on…", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/Tracee-Ellis-Ross-2017-AMAs-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Tracee Ellis Ross"}, "locale": "en_US"}, "article": {"published_time": "2018-09-05T14:13:49+00:00", "modified_time": "2018-09-20T21:38:50+00:00"}, "twitter": {"site": "@billboard", "card": "summary_large_image", "title": "Tracee Ellis Ross to Return as American Music Awards Host", "description": "The black-ish star will return as the night's emcee as well as an executive producer for the 2018 American Music Awards, which will broadcast live from the Microsoft Theater in Los Angeles on Oct. 9.", "image": "https://www.billboard.com/wp-content/uploads/media/Tracee-Ellis-Ross-2017-AMAs-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1536156829.0, "source": "https://www.billboard.com", "summary": ""}