{"url": "https://en.wikipedia.org/wiki/House_of_Cards_(season_6)", "text": "Season of the American television drama series House of Cards\n\nSeason of television series\n\nThe sixth and final season of House of Cards, an American political drama television series created by Beau Willimon for Netflix, was released on November 2, 2018. Frank Pugliese and Melissa James Gibson returned as showrunners for the final season. The sixth season continues the story of recently-inaugurated, Democratic president Claire Underwood (Robin Wright), who faces new threats within and outside the White House following the death of her husband and former president Frank Underwood. Powerful elites, led by wealthy siblings Annette and Bill Shepherd (Diane Lane and Greg Kinnear), are attempting to manipulate and destroy her presidency, while Claire struggles to exert influence and escape her husband's shadow.\n\nThe sixth season marks the first of the series without Kevin Spacey, who portrayed lead character Frank Underwood. Soon after production began in October 2017, Netflix fired the actor as a result of sexual misconduct allegations made against him. Production was halted for several months while the screenplay was reworked to exclude Spacey's character. As a result, the season was reduced to eight episodes, deviating from the 13-episode format of the previous seasons.\n\nProduction [ edit ]\n\nUnannounced start and sudden shutdown [ edit ]\n\nOn October 11, 2017, The Baltimore Sun reported that House of Cards had been renewed for a sixth season and that filming would begin by the end of October 2017.[1] On October 18, 2017, production of the sixth season of House of Cards appeared to be already in progress, without an official renewal announcement by Netflix, when a gunman opened fire near a House of Cards set outside Baltimore. Production company Media Rights Capital and Netflix stated that production on the show was not affected by the shooting.[2]\n\nProduction on the series was shut down on October 30, 2017, following sexual assault allegations towards Kevin Spacey by actor Anthony Rapp, who publicly stated that Spacey had made a sexual advance on him in 1986, when Rapp was 14 years old. Netflix announced its decision to cancel the series after the upcoming season, although multiple sources stated that the decision to end the series had been made prior to Rapp's accusation.[3][4]\n\nThe following day, Netflix and MRC announced that production on the season would be suspended indefinitely, in order to review the current situation and to address any concerns of the cast and crew.[5] Robin Wright strongly opposed Netflix executives who wanted to cancel the season, as she was concerned about the 2,500 people who had been involved in the production at that time and were at risk of losing their jobs.[6] On November 3, 2017, Netflix announced that they would no longer be associated with Spacey in any capacity whatsoever.[7]\n\nRestarting production [ edit ]\n\nOn December 4, 2017, Ted Sarandos, Netflix's chief content officer, announced that production would restart in 2018 with Wright in the lead, without Spacey's involvement, and revealed that the sixth and final season of the show would consist of eight episodes.[8] House of Cards resumed production on January 31,[9] and wrapped filming four months later, on May 25, 2018.[10]\n\nDiane Lane (left) and (right) were added to the main cast, leading the season alongside Wright and Kelly. and Greg Kinnear were added to the main cast, leading the season alongside Wright and Kelly.\n\nThe firing of Kevin Spacey significantly affected the production process, as showrunners Frank Pugliese and Melissa Gibson had to rethink the show and come up with a conclusion for the series in a limited amount of time, taking into consideration other contractual obligations of the cast and crew.[11][12] In an interview with IndieWire, Pugliese and Gibson revealed that these changes did not represent a huge shift for many of the characters; it was the overall story that was mostly affected, which was initially intended to center on a struggle between Frank and Claire to own the White House. The showrunners also revealed that—even in his absence—Frank continues to have a big impact on the story, and noted that erasing him completely would have seemed disingenuous.[13]\n\nIn the wake of Spacey's firing, Wright leads the sixth season of House of Cards, with her character, Claire Underwood, having assumed the presidency at the end of the previous season.[14] A number of returning cast members reprised their roles from previous seasons,[15] while Alik Sakharov, who had helmed three episodes in season five, directed for the final season as well.[16] New additions to the cast included Diane Lane and Greg Kinnear, who played Annette and Bill Shepherd, the sister-brother inheritors of an industrial conglomerate; said characters were inspired by the Koch brothers, as members of a family with the power to influence American politics. Joining them, Australian actor Cody Fern plays Annette's ambitious son Duncan Shepherd.[17] Lane had been cast to play Claire's longtime friend prior to the firing of Spacey, with whom she had shot a number of scenes. However, as she told IndieWire, the writers \"managed to find the same trajectory for [her] character in terms of what she means to Claire.\"[13]\n\nCast and characters [ edit ]\n\nEpisodes [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Original release date Prod.\n\ncode 66 1 \"Chapter 66\" Alik Sakharov Melissa James Gibson & Frank Pugliese November 2, 2018 ( ) HOC-621 Upon completion of her first one hundred days in the United States presidency, Claire faces public discontent and death threats via social media. Mark Usher, now the Vice President, attempts to help her. With Frank having mysteriously died, she is in conflict with her husband's former financial sponsors, the wealthy siblings Annette and Bill Shepherd, who want Claire to sign a deregulation bill and stop backing a candidate they do not approve of. Regardless, Claire announces her support of the candidate in a public appearance. On the way home, a sniper takes a shot at the presidential limousine, and the round hits the bulletproof passenger window nearest Claire. Recognizing it as a warning, the assassination attempt makes her question whether Frank's death could have been a murder, as she confides in FBI agent Nathan Green. In a mental health facility, Doug Stamper continues to claim responsibility for the death of Zoe Barnes, but it is revealed that his therapist is secretly working for Claire. 67 2 \"Chapter 67\" Ami Canaan Mann Frank Pugliese & Melissa James Gibson November 2, 2018 ( ) HOC-622 After a Shepherd-owned factory in Ohio has a chemical leak, Claire blackmails the governor into declaring a state of emergency. In a ploy to embarrass the Shepherds, Claire tours the town and talks with affected residents. Seth Grayson, who now works for the Shepherd Freedom Foundation, tries to get citizens to sign up for a mobile app managed by Annette's son Duncan, which allows the Shepherds to secretly mine the data on people's phones. Doug calls the U.S. attorney general to recant his confession and makes a deal with the prosecutor to go after Claire. Doug is later visited by Claire at his apartment, where she asks him to help her eliminate Cathy Durant, as she remains a loose end, but he refuses. After threatening Claire over the contents of Frank's will, which she has been trying to keep a secret, Bill finally gets Claire to sign the deregulation bill. 68 3 \"Chapter 68\" Stacie Passon Charlotte Stoudt & Sharon Hoffman November 2, 2018 ( ) HOC-623 Judge Abruzzo is in the Oval Office seeking a position in the Supreme Court. Claire becomes increasingly frustrated at the attempts by the Shepherds to undermine her authority. She meets with Cathy and, fearing she may testify due to Bill's influence, asks Doug to prevent the testimony. Tom Hammerschmidt is frustrated that Frank's mysterious death is not being properly investigated and meets Doug, who reveals that Republican Congressman Cole is running for Speaker. Meanwhile, Mark is having an affair with Annette, but she is in control of the relationship. Claire decides to speak with Annette directly instead of going through Mark. Annette tries to persuade Claire to consider Abruzzo, but Claire retaliates with information about Duncan. In a flashback, a young Claire and Annette are shown to have been close friends. Doug sees the footage of LeAnn Harvey's car crash. Claire receives news that Cathy has died, and thanks Doug. Under Annette's influence, Mark blackmails Claire with Tom Yates' dead body to help Cole. 69 4 \"Chapter 69\" Ernest Dickerson Jerome Hairston & Tian Jun Gu November 2, 2018 ( ) HOC-624 Russian President Viktor Petrov is a surprise guest at Cathy's funeral, and he discusses with Claire how to resolve the conflict with the terrorist group ICO in Syria. Linda Vasquez, Garrett Walker's former Chief of Staff, arrives at the funeral and threatens both Doug and Claire. Doug demands a pardon for himself and Frank, but Claire says she cannot pardon Frank and leaves Doug hanging. Cole proudly showcases Doug as part of his team, and Claire proposes to give Cole the vice presidency in 2020 and the presidency in 2024. Claire makes a deal with Petrov, with the condition that the Russian government takes the blame for Yates' death. Jane Davis tries to influence Claire, but has little success. Hammerschmidt brings Janine Skorsky back to Washington and continues to investigate the Underwoods, while Claire and Doug both wonder how exactly Cathy died. Seth informs Doug that Frank left him more in his will than he knows. Cathy is revealed to have faked her death and is hiding in France. 70 5 \"Chapter 70\" Thomas Schlamme Jason Horwitch & Charlotte Stoudt November 2, 2018 ( ) HOC-625 Claire has not been seen in public for three weeks, prompting speculation about whether she is fit to be president. The Shepherds see this as an opportunity to invoke the 25th Amendment, which would make Mark the de facto president. Doug visits his former psychiatrist to retrieve Frank's will. He continues his investigation of Cathy's death, and wonders if she is still alive. Hammerschmidt travels to New Mexico and obtains Rachel Posner's belongings, including a phone number which leads him to Doug. A worker from the plant in Ohio reaches out to Janine, claiming to have incriminating information on the Shepherds. Claire asks Duncan for help, but when he refuses, she reveals he is not Annette's son. Annette retaliates by preparing to leak information about Claire's past abortion. Claire intercepts her cabinet just before they exercise the 25th Amendment, sacking them all and replacing them with an all-female cabinet. 71 6 \"Chapter 71\" Louise Friedberg Jason Horwitch & Jerome Hairston November 2, 2018 ( ) HOC-626 Claire publicly addresses the personal scandal of her abortion and introduces her new cabinet. Jane is abducted and interviewed by Claire, who believes she had something to do with Cathy's fate. Cole introduces Doug to Bill, who offers him a job, but Doug refuses. Duncan returns home, furious at being lied to about his parentage, but Bill no longer acknowledges him as a Shepherd. Janine is faxed documents about Shepherd wrongdoings in the Arcas Corporation. Claire denounces Usher to the FBI for the disappearance of Yates. Doug and Hammerschmidt meet: Doug admits he killed Rachel but refuses to confirm on the record that Frank killed Zoe, Peter Russo, and LeAnn, although he implies it's true. In rapid succession, Hammerschmidt, Cathy, and Jane are murdered by assassins hired by Claire. Doug confronts Claire about Frank's will, hoping to confirm he is the sole beneficiary and secretly retrieves a memory chip from under the president's desk. However, Claire reveals she is pregnant with Frank's child, meaning the child will receive the entire Underwood inheritance, leaving nothing for Doug. 72 7 \"Chapter 72\" Alik Sakharov Melissa James Gibson & Frank Pugliese November 2, 2018 ( ) HOC-627 Four months later, Doug returns to the desert in New Mexico and digs up Rachel's grave. Meanwhile, Claire is well-advanced in her pregnancy and reverts to her maiden name, Hale. She rallies public support to help her combat her political enemies. A doctor hired by the Shepherds tries to induce the birth early, but the plot fails. Claire puts plans in motion to discredit Frank, even using Petrov's Russian troll factory to spread false rumors. She becomes increasingly autocratic and blackmails Cole into convincing Justice Abruzzo to recuse himself from signing a bill to reduce her powers. After Duncan's arrest by the FBI for treason, Annette and Mark, who is no longer Vice President, plot the assassination of Claire. The Shepherds and Janine separately approach Doug to help take down Claire, but he is unwilling to do so if it risks ruining Frank's legacy. 73 8 \"Chapter 73\" Robin Wright Frank Pugliese & Melissa James Gibson November 2, 2018 ( ) HOC-628 At a press conference, Claire announces a new era of transparency in government and further distances herself from Frank. Doug releases transcripts of Frank's audio recordings, which cut Claire out of his will. Claire proposes to take action against suspected ICO terrorists possessing nuclear weapons, which alienates Petrov and her war cabinet. Annette and Seth see Doug as the ideal person to dispose of Claire. Doug provides the location of Rachel's grave to Janine, who vows to finish the investigation into the Underwoods. After sending a copy of Frank's audio recorder and letter opener to Claire, Doug visits her in the Oval Office where he admits he killed Frank because he was undermining his own legacy. Doug threatens and wounds Claire with the letter opener, but when he draws back, she grabs it and stabs him in the stomach. As he lies bleeding on the floor, she covers his mouth and suffocates him.\n\nMarketing [ edit ]\n\n[18] Promotional video intertitle – Wright's final words from season five were used to promote the final season, as the actress takes over lead duties following Spacey's firing.\n\nExternal video \"House of Cards: Season 6\"\n\nThe official trailer for the sixth season.\n\nFrom March to October 2018, Netflix released various promotional material for the sixth and final season of House of Cards. On March 4, the first teaser premiered during the 90th Academy Awards ceremony. The teaser shows Robin Wright in the Oval Office as President Claire Underwood, declaring \"We're just getting started,\" followed by an intertitle reading \"Hail to the Chief\".[19] On June 10, Netflix released two first-look images from the final season. The first photo shows Wright listening to director Alik Sakharov, and the second shows her looking straight at the camera.[20] On July 4, the 242nd anniversary of the adoption of the Declaration of Independence, a video message was posted on House of Cards' official Twitter account, with President Claire Underwood saying, \"Happy Independence Day... to me.\" The message is followed by the hashtag #MyTurn.[21]\n\nOn August 7, Netflix announced that the season would be released on November 2, 2018, and unveiled key art. The poster pays homage to the promotional image for the first season of the series, as Wright strikes the Lincoln Memorial pose, like Kevin Spacey had done before her.[22] On August 27, four images were published via a press release, which depict new cast members Diane Lane, Greg Kinnear and Cody Fern in their roles as members of the Shepherd family.[23] A teaser trailer released on September 5, revealed the fate of Frank Underwood, portrayed by Spacey who was fired from the show, months after the conclusion of the fifth season. It is shown that Frank died in 2017, and has been buried next to his father in South Carolina. Claire visits her husband's grave and says, \"I'll tell you this though, Francis. When they bury me, it won't be in my backyard. And when they pay their respects, they'll have to wait in line.\" This speech mirrors the one Frank gives in the third season of the series, when he visits his father's grave.[24] On September 27, Netflix released a new teaser trailer that presents several new and returning characters. Claire is shown dealing with the aftermath of her husband's death, and declaring that \"the reign of the middle-aged white man is over.\"[25] On October 8, Netflix released the official trailer for the season, which revolves around Claire's power struggle, as she clashes with the American oligarchs and tries to forge her own path as President of the United States.[26] On October 23, critics began publishing reviews on the season, based on advance copies of the first five episodes that they had received from Netflix, after they had signed a letter of agreement.[27]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nPrior to the official release date of the season, Netflix sent the first five episodes to a number of critics, to serve as advance screeners. On Rotten Tomatoes, the season has an approval rating of 69% based on 64 reviews, with an average rating of 6.11/10. The consensus reads, \"House of Cards folds slightly under the weight of its labyrinthian ending – thankfully Robin Wright's commanding performance is strong enough to keep it standing strong.\"[28] On Metacritic, the season has a weighted average score of 62 out of 100, based on 21 critics, indicating \"generally favorable reviews\".[29]\n\nKevin Lever of FilmEra wrote that \"with Wright at the forefront of the show now, House of Cards shines as it did in its early years.\" Lever described the production as \"stellar\" and the writing as \"reinvigorated\". He noted that the show still has the feel of previous years, but it works best when it focuses on Claire, instead of dealing with holdover pieces.[30] David Zurawik of The Baltimore Sun wrote, \"I love TV drama that speaks to the cultural moment the way this series does. And, as I have said over and over, #MeToo is a landmark moment.\" Zurawik revealed that the season primarily focuses on gender issues; \"the evil of patriarchy and the stench of misogyny\". He stated that the episodes exceeded his expectations, and praised the performances of Wright, Lane and Kinnear.[27] Christopher Hooton of The Independent described the episodes as \"slightly banal\". He expressed his disappointment at the new characters that were introduced this season, and commented that \"Frank Underwood has left behind not only a power vacuum but an entertainment one.\" Hooton noted that ever since Frank became president at the end of season two, the series has drifted directionless, and after watching the first five episodes of the final season, it still remains unclear what the show is actually about.[31]\n\nNegative reviews include one by Tyler Coates of Esquire, who writes: \"Kevin Spacey's absence haunts the final season of House of Cards. Just as the show wouldn't work without Claire Underwood, it doesn't exactly work without Frank.\"[32] Another by Sonia Saraiya of Vanity Fair writes: \"House of Cards collapses – finally. Down a star and out of things to say, Season 6 flounders.\"[33] Jack Seale of The Guardian rated the season two stars out of five stating, \"We still need to talk about Kevin. It's impossible not to miss Spacey's presence as Robin Wright struggles to make her mark and save Netflix's first big show.\"[34]\n\nThe series finale in particular was met with largely negative reviews. Scott Von Doviak of The A.V. Club gave the episode a \"C−\", praising Wright's direction but criticizing the writing and the characterization of Claire during the final season.[35] Kyle Fowle of Entertainment Weekly gave the episode a \"D\" rating, saying the ultimate flaw of the season and the finale was the large focus on Frank and Frank's legacy.[36] Emily VanDerWerff of Vox gave the finale a one-and-a-half star rating out of five, saying the season \"saved the worst for last\".[37]\n\nAccolades [ edit ]\n\nFor the 71st Primetime Emmy Awards, Robin Wright and Michael Kelly received nominations for Outstanding Lead Actress in a Drama Series and Outstanding Supporting Actor in a Drama Series, respectively.[38]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Kevin_Spacey%2C_May_2013.jpg/150px-Kevin_Spacey%2C_May_2013.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Greg_Kinnear_TIFF_2012.jpg/112px-Greg_Kinnear_TIFF_2012.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/9/95/House_of_Cards_season_6.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/House_of_Cards_-_My_Turn.png/260px-House_of_Cards_-_My_Turn.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Robin_Wright_2009.jpg/116px-Robin_Wright_2009.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/95/House_of_Cards_season_6.png/250px-House_of_Cards_season_6.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/MichaelKellyFeb2011.jpg/110px-MichaelKellyFeb2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Diane_Lane_%28Berlin_Film_Festival_2011%29_2.jpg/112px-Diane_Lane_%28Berlin_Film_Festival_2011%29_2.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Nuvola_apps_kaboodle.svg/16px-Nuvola_apps_kaboodle.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/9/95/House_of_Cards_season_6.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/House_of_Cards_(season_6)", "title": "House of Cards (season 6)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/9/95/House_of_Cards_season_6.png", "width": 640, "height": 948}, "title": "House of Cards (season 6) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}