{"url": "https://www.bustle.com/p/meryl-streep-joined-big-little-lies-season-2-in-the-most-adorable-way-possible-according-to-nicole-kidman-13176709", "text": "The second season of Big Little Lies already has a massive fan following that's looking for news and spoilers like a Monterey seagull searching for food. Sadly, not too much is known about the new season, which is set to premiere on HBO sometime in 2019, but fans can already tell it's going to be a good one, probably for two reasons. First, it's Big Little Lies, so, duh, and secondly, Meryl Streep will be on season two so double duh. And, though she didn't open up about what will go down the mansions of Monterey next year in a recent interview with Variety, Nicole Kidman did reveal how Meryl Streep got involved with Big Little Lies. Two words: her emails.\n\nWell, considering that today's news literally reports that Ivanka Trump used her personal email account for government business, this isn't really the time for a \"her emails\" joke. In this case, though, emails are pretty funny for once. Speaking with Variety, Kidman revealed that Streep emailed her and Reese Witherspoon on the night of the 2018 Golden Globes. After Big Little Lies won the award for Best Television Limited Series, Streep said in her email, \"I suppose now I have to join you.\" Kidman continues, saying, \"We were like, ‘What?’ The two of us were just shocked.\" Now that is one email chain that definitely should get published as a series of short stories — or perhaps it could turn into a one act play.\n\nKidman also told Variety that Streep had signed onto Season 2 without even reading the script, something Kidman has spoken about before, because, as the actor said, \"That’s how much she wanted to support us.\" With Season 1 of Big Little Lies ending with a rousing show of female solidarity, it seems like Season 2 will carry on that same energy, at least behind-the-scenes, that is.\n\nAgain, not much about BLL Season 2 is known except for the fact that it is happening in 2019, but last January, Entertainment Weekly revealed that Streep will play Mary Louise Wright, the mother-in-law of Kidman’s character, Celeste Wright. A quick mental family tree mapping will tell you that that means that Streep's character is Alexander Skarsgard’s character, Perry Wright's mom. Spoilers from Season 1 ahead.\n\nAccording to The Hollywood Reporter, Streep's character in Season 2 will arrive in Monterey in order to find out more information about Perry's death. It definitely sounds like things could get tense between Kidman and Streep's characters, and in her interview with Variety, Kidman revealed that she felt a little bit of tension herself in anticipation of filming alongside a legend like Streep. \"I was terrified,\" Kidman said, before adding, \"You’re acting opposite the great one. I get nervous anyway — but to be opposite her and not want her to think, ‘Who is this amateur?'\" There was also pressure to deliver material worthy of Streep's participation, something Kidman said she and Witherspoon were all too aware of. \"And also, we want to deliver a series for her that she’s great in,\" she said. \"Reese and I were like, ‘We want this for her and for the other women.’ They have much stronger roles in the second one.\"\n\nConsidering that Kidman earned both an Emmy and a Golden Globe award for her role in the HBO miniseries for its first season, it's safe to say that she had nothing to worry about. But stronger roles for each of the women in Season 2 — and the addition of Meryl Streep — makes the future for Big Little Lies sound better than ever.", "images": ["https://imgix.bustle.com/uploads/getty/2021/5/11/b0482c01-f6ea-4620-ac68-4f7118aa0d95-getty-71805167.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/9/30/d7b2162b-52fe-4d22-b787-dc312fe4dceb-28-melaniec-teaser.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2021/10/24/07376820-9148-49fa-a0e3-736e1ed805f6-getty-1341348986.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/7/18/1cae65a7-8bf5-44ac-8f1d-da59763fa0f8-the-idol-hbo-the-weeknd.jpg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.6507&fp-y=0.4854", "https://imgix.bustle.com/uploads/image/2018/11/20/84f2e59c-e933-4910-86e3-35885a8a8943-nicolekidman.jpeg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/11/20/84f2e59c-e933-4910-86e3-35885a8a8943-nicolekidman.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg"], "top_img": "https://imgix.bustle.com/uploads/image/2018/11/20/84f2e59c-e933-4910-86e3-35885a8a8943-nicolekidman.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/meryl-streep-joined-big-little-lies-season-2-in-the-most-adorable-way-possible-according-to-nicole-kidman-13176709", "title": "Meryl Streep Joined ‘Big Little Lies’ Season 2 In The Most Adorable Way Possible, According To Nicole Kidman", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@AngelicaFlori0"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/meryl-streep-joined-big-little-lies-season-2-in-the-most-adorable-way-possible-according-to-nicole-kidman-13176709", "type": "article", "title": "Meryl Streep Joined ‘Big Little Lies’ Season 2 In The Most Adorable Way Possible, According To Nicole Kidman", "description": "The second season of Big Little Lies already has a massive fan following that's looking for news and spoilers like a Monterey seagull searching for food. Sadly, not too much is known about the new season, which is set to premiere on HBO sometime in…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/11/20/84f2e59c-e933-4910-86e3-35885a8a8943-nicolekidman.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "The second season of Big Little Lies already has a massive fan following that's looking for news and spoilers like a Monterey seagull searching for food. Sadly, not too much is known about the new season, which is set to premiere on HBO sometime in…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}