{"url": "https://en.wikipedia.org/wiki/Game_of_Thrones_(season_8)", "text": "Season of television series\n\nThe eighth and final season of the fantasy drama television series Game of Thrones, produced by HBO, premiered on April 14, 2019, and concluded on May 19, 2019. Unlike the first six seasons, which consisted of ten episodes each, and the seventh season, which consisted of seven episodes, the eighth season consists of only six episodes.\n\nThe season was filmed from October 2017 to July 2018 and largely consists of original content not found in George R. R. Martin's A Song of Ice and Fire series, while also incorporating material that Martin has revealed to showrunners about the upcoming novels in the series, The Winds of Winter and A Dream of Spring. The season was adapted for television by David Benioff and D. B. Weiss.\n\nThe season was met with mixed reviews from critics, in contrast to the critical acclaim of previous seasons, and is the lowest-rated of the series on the website Rotten Tomatoes. While the performances, production values and music score were praised, criticism was mainly directed at the shorter runtime of the season as well as numerous creative decisions made by the showrunners regarding the plot and character arcs. Many commentators deemed it to be a disappointing conclusion to the series.\n\nThe season received 32 nominations at the 71st Primetime Emmy Awards, the most for a single season of television in history.[1] It won twelve, including Outstanding Drama Series and Outstanding Supporting Actor in a Drama Series for Peter Dinklage.\n\nPlot [ edit ]\n\nThe final season depicts the culmination of the series' two primary conflicts: the Great War against the Army of the Dead, and the Last War for control of the Iron Throne. In the first half of the season, Jon Snow, Daenerys Targaryen and many of the main characters converge at Winterfell to face the Dead. During the battle, Bran lures the Night King into the open where Arya destroys him; the army of White Walkers and wights crumbles. Meanwhile, Cersei Lannister remains in King's Landing and strengthens her forces to set traps for a weakened Daenerys. The second half of the season resumes the war for the throne as Daenerys suffers losses until she finally assaults King's Landing upon Drogon, her last dragon. She defeats Cersei's forces, burns the city and kills Cersei and her brother Jaime. Daenerys vows to \"liberate\" the whole world as she has liberated the capital of Westeros. Unable to sway her from her destructive path, an agonized Jon kills her. Drogon flies away with her body, but not before destroying the Iron Throne with dragonfire. The leaders of Westeros choose Bran Stark as King, who grants the North independence and appoints Tyrion his Hand. Sansa Stark is crowned Queen in the North. Arya sails west, and Jon leads the Wildlings north of the Wall.\n\nEpisodes [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Original air date [2] U.S. viewers\n\n(millions) 68 1 \"Winterfell\" David Nutter Dave Hill April 14, 2019 ( ) 11.76[3] Upon reaching Winterfell with their combined armies, Jon and Daenerys learn the Army of the Dead has breached the Wall and the Night King commands the undead Viserion. The Northern Houses and the Vale rally around Winterfell but distrust Daenerys and doubt Cersei's pledge to send troops. Euron returns to King's Landing with the Golden Company and entices Cersei to consummate their union. Cersei, through Qyburn, hires Bronn to assassinate Tyrion and Jaime. Theon rescues Yara, who then sets out to retake the Iron Islands, while Theon returns to Winterfell. There, Jon is reunited with Arya. Jon and Daenerys ride the dragons and deepen their bond. Daenerys wants to reward Sam for saving Jorah before realizing that she executed his father and brother. Sam tells Jon that he was born Aegon Targaryen and is the true heir to the Iron Throne. At House Umber, Tormund and Beric encounter Edd and other Night's Watch members. They find the castle's occupants dead, and the wight of Ned Umber is left as a gruesome message. Jaime arrives at Winterfell where Bran awaits him. 69 2 \"A Knight of the Seven Kingdoms\" David Nutter Bryan Cogman April 21, 2019 ( ) 10.29[4] Jaime reveals Cersei's deception to the Targaryen-Stark alliance and joins them after Brienne vouches for his honor. Jaime apologizes to Bran for crippling him; Bran replies he harbors no anger and says they are no longer the same people. Daenerys no longer trusts Tyrion's judgment for his having believed Cersei, but Jorah asks that she forgive Tyrion's mistakes. Citing their mutual love for Jon, Daenerys tries to gain Sansa's trust, but Sansa says the North vowed never to bow to anyone again. Theon, Edd, Tormund, and Beric arrive at Winterfell, with the latter three reporting the undead army's impending arrival. Bran proposes he lure out the Night King, who intends to destroy the Three-Eyed Raven. Theon and the Ironborn will protect Bran. Arya seduces Gendry, wanting to experience it before they die. Jaime formally anoints Brienne as a knight. Jorah fails to dissuade Lyanna Mormont from fighting, and Sam presents Jorah with House Tarly's ancestral sword. As the Army of the Dead approaches, Jon reveals his true lineage to Daenerys, who realizes that he has a claim to the Iron Throne. 70 3 \"The Long Night\" Miguel Sapochnik David Benioff & D. B. Weiss April 28, 2019 ( ) 12.02[5] The living meet the Army of the Dead outside Winterfell. The initial Dothraki charge is destroyed and the Unsullied are quickly overwhelmed, despite the dragonfire. Edd is killed saving Sam and survivors retreat into the castle. Melisandre ignites the fire trench surrounding Winterfell to delay the advancing horde. Jon and Daenerys aerially engage the Night King on their dragons. The wights invade Winterfell, overpowering the defenders; Lyanna Mormont is killed destroying a giant wight; Beric dies defending Arya and Melisandre tells Arya what she must do. Jon and Rhaegal knock the Night King off Viserion and Daenerys and Drogon burn him with dragonfire without any effect. The Night King raises the slain Winterfell soldiers and the dead entombed in the Stark family crypt, who attack those sheltered there. Wights pull Daenerys from Drogon and Jorah is fatally wounded defending her. The Night King kills Theon as he protects Bran. Arya ambushes and stabs the Night King with her Valyrian steel dagger shattering him and his White Walkers and Viserion and all wights. Her purpose served; Melisandre allows herself to die of old age. 71 4 \"The Last of the Starks\" David Nutter David Benioff & D. B. Weiss May 5, 2019 ( ) 11.80[6] The survivors mourn, burn the dead and then celebrate their victory. During the somber feast, Daenerys uplifts the mood by legitimizing Gendry as a Baratheon, naming him Lord of Storm's End. Arya gently declines Gendry's subsequent marriage proposal while Jaime and Brienne become lovers. To protect her claim to the throne, Daenerys asks Jon to conceal his true parentage. Bronn arrives and threatens Jaime and Tyrion but spares them in exchange for being promised Highgarden castle. Jon reveals his true parentage to Sansa, Bran, and Arya, swearing them to secrecy. Wanting Jon as king, Sansa tells Tyrion, who informs Varys. Arya and the Hound head for King's Landing, separately bent on revenge. Tormund returns north with the Wildlings, taking Ghost at Jon's request. Daenerys and her fleet set sail for King's Landing, while Jon leads the Northern army. At Dragonstone, Euron's navy ambushes Daenerys' fleet, killing Rhaegal with ship-mounted ballistas. Missandei is taken hostage and Daenerys considers seizing King's Landing using dragonfire. Varys and Tyrion debate whether Jon would be a better ruler than Daenerys. Jaime leaves Winterfell to return to Cersei, despite Brienne's pleas to stay. Cersei rejects Daenerys' demand to surrender and has Missandei beheaded before an enraged Daenerys and Grey Worm. 72 5 \"The Bells\" Miguel Sapochnik David Benioff & D. B. Weiss May 12, 2019 ( ) 12.48[7] Varys urges Jon to advance his claim to the throne but Jon refuses to betray Daenerys. After Tyrion reveals Varys' plot, Daenerys executes Varys by dragon-fire. Jaime is captured but Tyrion releases him so Jaime can persuade Cersei to surrender the city and then escape Westeros together. Jaime, Arya and the Hound each infiltrate King's Landing. Riding Drogon, Daenerys destroys the Iron Fleet and most of the city's defenses, allowing her army to enter. Cersei's forces are quickly overwhelmed and the city signals its surrender. An enraged Daenerys begins leveling the city, burning soldiers and civilians. The allied army follows her lead, slaughtering anyone in their path, horrifying Tyrion and Jon. Jaime kills Euron but is mortally wounded. The Hound convinces Arya to abandon her vendetta against Cersei and save herself; then he confronts the Mountain. The brothers, battling each other, ultimately perish after falling from a tower into flames. Cersei and Jaime reunite but are killed as the Red Keep collapses on them. Jon calls for a retreat as frantic civilians flee the devastation. Arya barely escapes alive. 73 6 \"The Iron Throne\" David Benioff & D. B. Weiss David Benioff & D. B. Weiss May 19, 2019 ( ) 13.61[8] Jon is appalled when the Unsullied execute captured soldiers upon Daenerys' orders. Tyrion finds Jaime and Cersei dead in the ruins. Daenerys rallies the Unsullied and Dothraki, proclaiming she will lead them to \"liberate\" the entire world. Tyrion resigns as Hand of the Queen and is imprisoned for treason. Arya and Tyrion separately warn Jon that Daenerys is a threat to him, House Stark and the people. Jon confronts Daenerys. Unable to halt her destructive path, an agonized Jon kills her. Drogon, enraged, melts the Iron Throne, then carries away Daenerys' body. Later, Tyrion proposes that all future monarchs be chosen by Westerosi leaders, rather than familial succession. Bran Stark is proclaimed King Bran the Broken. He grants the North independence as a kingdom and appoints Tyrion his Hand. Jon is sentenced to the Night's Watch to appease the Unsullied, who set sail for Naath, Missandei's homeland. Tyrion reorganizes the Small Council – Brienne, Bronn, Davos and Sam – to rebuild King's Landing. Podrick is knighted. Sansa is crowned Queen in the North. Arya sets sail to explore unknown lands west of Westeros. Jon rejoins Tormund and Ghost at Castle Black, leading the Wildlings north of the Wall.\n\nCast [ edit ]\n\nMain cast [ edit ]\n\nRecurring cast [ edit ]\n\nThe recurring actors listed here are those who appeared in season 8. They are listed by the region in which they first appear.\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nHBO announced the eighth and final season of the fantasy drama television series Game of Thrones in July 2016.[35][36] Like the previous season, it largely consists of original content not found in George R. R. Martin's A Song of Ice and Fire series.[37] As Benioff had verified in March 2015, the creators have talked with Martin about the end of the series, and they \"know where things are heading\". He explained that the ends of both the television and the book series would unavoidably be thematically similar, although Martin could still make some changes to surprise the readers.[38] When asked about why the television series is coming to an end, he said, \"this is where the story ends.\"[39]\n\nCrew [ edit ]\n\nSeries creators and executive producers David Benioff and D. B. Weiss serve as showrunners for the eighth season. The directors for the eighth season were announced in September 2017. Miguel Sapochnik, who previously directed \"The Gift\" and \"Hardhome\" in the fifth season, as well as \"Battle of the Bastards\" and \"The Winds of Winter\" in the sixth season, returned to direct two episodes. David Nutter, who had directed two episodes each in the second, third, and fifth seasons, including \"The Rains of Castamere\" and \"Mother's Mercy\", directed three episodes for the eighth season. The final episode of the series was directed by Benioff and Weiss, who have previously co-directed two episodes, taking credit for one episode each.[40]\n\nAt the series' South by Southwest panel on March 12, 2017, Benioff and Weiss announced the writers for the series to be Dave Hill (episode 1) and Bryan Cogman (episode 2). The showrunners divided up the screenplay for the remaining four episodes amongst themselves.[41]\n\nWriting [ edit ]\n\nWriting for the eighth season started with a 140-page outline. Benioff said that the divvying up process and who should write what section became more difficult because \"this would be the last time that [they] would be doing this.\"[42]\n\nFilming [ edit ]\n\nIn an interview with Entertainment Weekly, HBO programming president Casey Bloys said that instead of the series finale's being a feature film, the final season would be \"six one-hour movies\" on television. He continued, \"The show has proven that TV is every bit as impressive and in many cases more so, than film. What they're doing is monumental.\"[43] Filming officially began on October 23, 2017[44] and concluded in July 2018.[45] Many exterior scenes were filmed in Northern Ireland and a few in Dubrovnik, Croatia; Paint Hall Studios in Belfast were used for interior filming.[46] The direwolf scenes were filmed in Alberta, Canada.[47]\n\nCasting [ edit ]\n\nThe eighth season saw the return of Tobias Menzies as Edmure Tully and Lino Facioli as Robin Arryn in the final episode, neither of whom appeared in the seventh season.[34] Marc Rissmann was cast as Harry Strickland, the commander of the Golden Company.[33]\n\nContent [ edit ]\n\nCo-creators David Benioff and D. B. Weiss have said that the seventh and eighth seasons would likely comprise fewer episodes, saying that after the sixth season, they were \"down to our final 13 episodes after this season. We're heading into the final lap\".[48][49] Benioff and Weiss said that they were unable to produce 10 episodes in the series' usual 12 to 14-month timeframe, as Weiss explained, \"It's crossing out of a television schedule into more of a mid-range movie schedule.\"[48] HBO confirmed in July 2016 that the seventh season would consist of seven episodes and would premiere later than usual in mid-2017 because of the later filming schedule.[50] Benioff and Weiss later confirmed that the eighth season would consist of six episodes and would premiere later than usual for the same reason.[51]\n\nBenioff and Weiss said about the end of the series: \"From the beginning, we've wanted to tell a 70-hour movie. It will turn out to be a 73-hour movie, but it's stayed relatively the same of having the beginning, middle[,] and now we're coming to the end. It would have been really tough if we lost any core cast members along the way[;] I'm very happy we've kept everyone and we get to finish it the way we want to.\"[51] The first two episodes are, respectively, 54 and 58 minutes long, while the final four episodes of the series are all more than an hour in length—episode three is 82 minutes (making it the longest episode of the series), episodes four and five are each 78 minutes,[52] and the final episode is 80 minutes.[53]\n\nA two-hour documentary, Game of Thrones: The Last Watch, which documents the making of the eighth season, aired on May 26, the week after the series finale.[54]\n\nMusic [ edit ]\n\nRamin Djawadi returned as the series' composer for the eighth season.[55] The soundtrack album for the season was released digitally on May 19, 2019 and was released on CD on July 19, 2019.[56]\n\nRelease [ edit ]\n\nBroadcast [ edit ]\n\nThe season premiered on April 14, 2019 in the United States on HBO.[57]\n\nMarketing [ edit ]\n\nOn December 6, 2018, HBO released the first official teaser trailer for the eighth season.[58] A second teaser trailer was released on January 13, 2019, which announced the premiere date as April 14, 2019. The trailer was directed by David Nutter.[59] HBO released a promotional advertisement with Bud Light on February 3, 2019 during Super Bowl LIII.[60] Later, first-look photos of several main characters were released on February 6, 2019.[61] On February 28, posters of many of the main characters sitting upon the Iron Throne were released.[29] The official full trailer was released on March 5, 2019.[30]\n\nIllegal distribution [ edit ]\n\nThe season premiere was reportedly pirated by nearly 55 million people within the first 24 hours of release. Of these numbers, 9.5 million downloads came from India, 5.2 million came from China, and 4 million came from the U.S.[62] On April 21, 2019, it was reported that the second episode of the season was illegally leaked online hours before it aired due to being streamed early on Amazon Prime Germany.[63] On May 5, 2019, it was reported that the fourth episode of the season was leaked online, with footage from the episode circulating on social media.[64]\n\nHome media [ edit ]\n\nThe season was released on Ultra HD Blu-ray, Blu-ray, and DVD on December 3, 2019.[65]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nGame of Thrones (season 8): Critical reception by episode Season 8 (2019): Percentage of positive critics' reviews tracked by the website Rotten Tomatoes[66]\n\nThe season received mixed reviews from critics.[67] On Rotten Tomatoes, it holds an approval rating of 55% based on 22 reviews with an average rating of 6.45/10, the lowest rating for a season of Game of Thrones.[a] The website's critical consensus reads: \"Game of Thrones' final season shortchanges the women of Westeros, sacrificing satisfying character arcs for spectacular set-pieces in its mad dash to the finish line\".[66]\n\nThe first three episodes were met with generally positive feedback from critics. On Metacritic, the premiere garnered a score of 75 out of 100 based on 12 reviews, indicating \"generally favorable reviews\".[69] \"The Long Night\" was praised for the cinematography and grand scale of the battle between the living and the dead,[70] but was criticized for what was considered its lack of catharsis, disorienting lighting, and the anticlimactic ending of the White Walker storyline that had been built up for seven seasons.[71][72][73] \"The Last of the Starks\" and \"The Bells\" were said to have rushed pacing, writing, and deviation from character development, with \"The Last of the Starks\" being labeled as \"anticlimactic\" and \"a huge letdown\".[79] \"The Iron Throne\" was described as \"divisive\", and according to Rotten Tomatoes, the series finale represents \"a modest rebound\" but it \"went out with a whimper\".[80][81] \"The Bells\" and \"The Iron Throne\" are the worst-reviewed episodes of the entire series on the website, with an approval of 49% and 48% respectively, while the last four episodes of the season \"plunged to record low scores\".[74][82][83][84]\n\nDavid Sims of The Atlantic wrote that the final season \"has been the same story over and over again: a lot of tin-eared writing trying to justify some of the most drastic story developments imaginable, as quickly as possible. As usual, the actors did their best with what was on the page.\"[80] Lucy Mangan of The Guardian considered the season a \"rushed business. It has wasted opportunities, squandered goodwill, and failed to do justice to its characters or its actors.\"[85] Zack Beauchamp of Vox wrote that it \"dispensed almost entirely with trying to make sense of its characters' internal motivations—let alone the complex political reality that its psychological realism initially helped create\".[86] Huw Fullerton of Radio Times said the final season was not \"Thrones at its best\" but still had \"some sort of ending for the characters\". For Fullerton, the season was \"like the finale — some bits I liked, one or two I loved, an awful lot that leaves me scratching my head\".[87]\n\nWriting for USA Today, Kelly Lawler felt that the series ultimately betrayed its \"identity\" of \"tragedy and injustice\" with a \"pandering\" ending.[88] Judy Berman of Time said that the series failed to complete the answer to \"conflicting ideas about freedom, justice and leadership\", themes that had brought depth to the series.[89] Ellen Gray of the Philadelphia Inquirer and Darren Franich of Entertainment Weekly agreed that the final season was not as complex as previous seasons.[90][91] Franich stated that the \"broseph mentality shined through,\" shunting the development and interaction between female characters. Franich criticized Cersei for doing nothing this season, regarding it \"one complete failure of imagination\", as well as the ultimate primary focus on the reactions and thoughts of the male characters, such as \"Jon Snow, the least complicated main character.\"[91] Writing for The Hollywood Reporter, Maureen Ryan condemned what she considered the season’s reductive treatment of women, and \"decisions set up and executed with little or no foresight or thoughtfulness\", declaring the penultimate episode \"The Bells\" as \"Game of Thrones at its worst\".[92]\n\nRatings [ edit ]\n\nAudience response [ edit ]\n\nA petition to HBO for \"competent writers\" to remake the eighth season of Game of Thrones in a manner \"that makes sense\" was started on Change.org after \"The Last of the Starks\" aired, but went viral after \"The Bells\" aired and saw Daenerys's arc take a significant turn.[99][100] The petition described showrunners David Benioff and D. B. Weiss as \"woefully incompetent writers\".[101][102][103][104][105] By September 6, 2019, it received over 1.73 million signatures.[102][106][107] Digital Spy reported that some fans of the series criticized the season for the way it handled several character arcs and the \"rushed\" pacing.[102][108] The petition's creator stated that he never expected HBO to remake the season, but saw the petition as a message \"of frustration and disappointment at its core\".[102]\n\nThe petition was labelled as \"disrespectful to the crew and the filmmakers\" by actress Sophie Turner (who plays Sansa Stark),[109][110] \"ridiculous\", \"weird, juvenile\" by actor Isaac Hempstead Wright (who plays Bran Stark),[110][111] \"rude\" by actor Jacob Anderson (who plays Grey Worm)[112] and \"fandom extremism\" by actress Carice van Houten (who plays Melisandre).[113] Emilia Clarke (who plays Daenerys Targaryen) indicated she was previously unaware of the petition, but gave a warmer response when she was asked what she would want to see happen if the eighth season were redone: \"I can only speak to my own character, and the people that I interact with on the show. But I would've loved some more scenes with me and Missandei. I would've loved some more scenes with me and Cersei\".[114]\n\nRichard Roeper, writing for the Chicago Sun Times, wrote: \"Over the last 25+ years, I've reviewed thousands of movies and dozens of TV shows, and I don't think I've ever seen the level of fan (and to a lesser degree, critical) vitriol leveled at [this show] in recent weeks\". However, Roeper noted that social media was not yet widely used during much of this time period.[115]\n\nLenika Cruz, writing for The Atlantic, wrote that with the end of the series, \"there are folks who don't feel as though the hours and hours they've devoted to this show have been wasted\", but \"there are many others\" who felt the opposite.[80] Kelly Lawler of USA Today wrote that the ultimate ending of the series was not what some fans \"signed up for\".[88]\n\nCBS News has described several plot points that some fans are dissatisfied with: the character arcs of Daenerys and Jaime; the fates of Jaime, Missandei, Rhaegal, and the Night King; the Battle of Winterfell being visually too dark; the \"basic existence of Euron Greyjoy\"; and \"Jon's treatment of Ghost\".[104]\n\nCast response [ edit ]\n\nIn an interview with The New Yorker, Emilia Clarke said she had to hold back her innermost anxiety from Beyoncé: \"I was just, like, Oh, my God, my absolute idol in life is saying that she likes me, and I know for a fact that by the end of this season she's going to hate me. ... All I wanted to scream was 'Please, please still like me even though my character turns into a mass-killing dictator! Please still think that I'm representing women in a really fabulous way.'\"[114] Clarke said she was shocked at Daenerys's turn and her last scene because \"it comes out of nowhere\". Although she stands by the character, Clarke said it was a \"struggle\" reading the scripts. As for what she would have changed, she said she would have liked more scenes between Daenerys and Missandei and Daenerys and Cersei; \"I just think more dissection and those beautifully written scenes that the boys have between characters — that we are more than happy to contently sit there and watch ten minutes of two people talking, because it's beautiful. I just wanted to see a bit more of that.\"[116]\n\nIn an interview published as the final season premiered, Kit Harington said he felt \"defiant\" about the series at the time, adding that \"whatever critic spends half an hour writing about this season and makes their [negative] judgement on it, in my head they can go fuck themselves. I know how much work was put into this ... Now if people feel let down by [this final season], I don't give a fuck—because everyone [working on the series] tried their hardest. ... In the end, no one's bigger fans of the show than we are\".[117] Harrington later said he expected the ending was going to divide fans, and he was concerned the final two episodes would be deemed sexist: \"We have Cersei and Dany, two leading women, who fall\". \"The justification is: Just because they're women, why should they be the goodies? They're the most interesting characters in the show. You can't just say the strong women are going to end up the good people ... It's going to open up discussion ... And when have you ever seen a woman play a dictator?\" Harrington also said he was disappointed his character Jon did not kill the Night King.[118]\n\nNathalie Emmanuel, who played Missandei, was heartbroken when she read her character's sudden demise: \"I think the fact that she died in chains when she was a slave her whole life, that for me was a pungent cut for that character, that felt so painful\". Emmanuel, the only woman of color who was a regular cast member for the last several seasons, said, \"It's safe to say that Game of Thrones has been under criticism for their lack of representation, and the truth of it is that Missandei and Grey Worm have represented so many people because there's only two of them.\"[119] Emmanuel added that she wished she \"had more time or scenes this season maybe with Daenerys or even with Cersei, scenes where we get to see her being brilliant before she dies. I think that might have eased the pain a bit more for people, and reinforcing a friendship that she and Dany had because we haven't really seen anything for a few seasons.\"[118]\n\nConleth Hill, who played Varys, told Entertainment Weekly that the seventh and eighth seasons were \"kind of frustrating\" and not his \"favorite\", noting that Varys \"kind of dropped off the edge\". Hill reacted with \"dismay\" to Varys apparently \"losing his knowledge\", commenting, \"If he was such an intelligent man and he had such resources, how come he didn't know about things?\" After being \"very bummed to not have a final scene with [Littlefinger]\", Hill was \"bummed not to have any reaction to [Littlefinger] dying, if he was [Varys'] nemesis\". Also, once the series ran out of book material as a source, Hill said that \"special niche interest in weirdos wasn't as effective as it had been\". However, Hill was \"not dissatisfied on the whole\" regarding the series.[120]\n\nLena Headey had a \"mixed\" initial reaction to the manner of death for Cersei Lannister. Headey said she would rather have had Cersei die by \"some big piece or fight with somebody\". Fellow actor Nikolaj Coster-Waldau and Headey discussed it and then appreciated the scene, viewing it as \"the perfect ending\" for Cersei and Jaime as they \"came into the world together and now they leave together\".[121] Headey mentioned that a scene of Cersei's miscarriage was cut.[122][123]\n\nSophie Turner said she would like to have seen \"Sansa and Cersei reunited, or Arya and Cersei\", but she was happy with the ending for her character.[118] Maisie Williams said the biggest regret for her character Arya was not getting a scene with Cersei, and possibly killing her, \"even if it means [Arya] dies too\". She later embraced Arya's happier arc for the last season.[124]\n\nGwendoline Christie, who played Brienne, said she was \"dismayed\" by her character turn, explaining that \"It was partially because I read about this character [in Martin's novels] before I saw the show. So we all have our own ideas about how we think the character is going to develop. Sometimes your ideas become set in your mind, and sometimes David and Dan write something you didn't expect and find difficult to comprehend.\" \"[Brienne] has been very impactful in the way I think about women and in the way they're portrayed in the media and the way they're treated in society\", she noted.[118]\n\nJoe Dempsie (Gendry), also expressed disappointment over the series' finale, as did former cast members Charles Dance (Tywin Lannister) and Natalia Tena (Osha).[118][125]\n\nAccolades [ edit ]\n\nWith 32 nominations, Game of Thrones broke the record of the most nominations received by a regular TV show in a single year.\n\nNotes [ edit ]\n\n^ [68] Before May 24, 2019, Rotten Tomatoes calculated a 67% approval from 627 reviews and scored a 7.48/10 average rating.\n\nReferences [ edit ]\n\n\n\n", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/e/e0/Game_of_Thrones_Season_8.png/220px-Game_of_Thrones_Season_8.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Global_thinking.svg/10px-Global_thinking.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/32px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/en/e/e0/Game_of_Thrones_Season_8.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/e0/Game_of_Thrones_Season_8.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Game_of_Thrones_(season_8)", "title": "Game of Thrones (season 8)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/e/e0/Game_of_Thrones_Season_8.png", "width": 640, "height": 900}, "title": "Game of Thrones (season 8) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}