{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/jason-statham-net-worth/", "text": "What is Jason Statham's net worth and salary?\n\nJason Statham is a British actor who has a net worth of $90 million. His dozens of films have grossed multiple billion of dollars at the worldwide box office. As a result, Jason is one of the highest-paid action stars in the world today. He can regularly earn $10+ million for a single film in which he is the primary star.\n\nWhen combined with his longtime partner, Rosie Huntington-Whiteley, the two have a net worth of $120 million. They are not technically married even after being together since 2010.\n\nEarly Life\n\nJason Statham was born on July 26, 1967 in Shirebrook, Derbyshire England. He grew up in Great Yarmouth, a seaside town in England. His mother Eileen was a dancer and his father Barry sold street goods. Statham played football for the local grammar school. Before becoming a world-famous action star, Jason Statham originally pursued a career in diving and was a member of Britain's National Diving Squad for twelve years. Jason became part of the British Olympic team and went to Seoul, Korea in 1988. Statham competed for England as a diver at the 1990 Commonwealth Games. After some disappointing finishes at both the Olympic Trials and Championships, he decided to focus on acting and modeling as a career.\n\nActing Career\n\nAn agent spotted Jason in 1998 and his career in front of the camera took off almost instantly. He also did a bit of modeling in his early career for the clothing line French Connection and was subsequently spotted by Guy Ritchie, who cast him in the films \"Lock, Stock, and Two Smoking Barrels, grossing over $80 million in box office sales, and launched Jason's career in Hollywood. Statham collaborated again with Guy Ritchie when he played the role of Turkish in the 2000 film Snatch. Statham acted alongside Brad Pitt and Benicio del Toro and the film earned over $80 million at the box office. He appeared in various films throughout the early 2000s, including \"The One\" and \"Ghosts of Mars\", but it was the action film, \"The Transporter\" that made him a household name. For this role, he was responsible for all of his own stunts (by his choice) and he studied karate, Wing Chun kung fu, and kickboxing to prepare for the role. The Transporter went on to spawn two sequels, a reboot, and a television series. In 2005, Ritchie cast Statham in a starring role yet again in Revolver. However, it was a critical and box office fail. In 2008, Statham's performances in The Bank Job and Death Race garnered him loads of praise and put him in the category of full-blown action star.\n\nIn 2010, Statham appeared in The Expendables, an ensemble action film that also featured Sylvester Stallone and Mickey Rourke. The film opened at number one in the U.S, UK, China, and India box offices. His next role, in 2011, was in The Mechanic and was met to positive acclaim. Statham returned to British film when he starred in the police drama Blitz. Around this time, Jason appeared in The Italian Job and Cellular, in which he played the lead villain. His next film, Killer Elite, was panned by critics and grossed a negative budget In 2012, Statham reprised his role for the sequel to The Expendables, and in 2014, he appeared in The Expendables 3. The sequels were critically panned but still box office smashes. Statham got to show off his comedic acting chops when he appeared in the action-comedy Spy that had an all-star cast including Jude Law, Melissa McCarthy, and Rose Byrne. He was nominated for a Critic's Choice Award for best comedic actor for his role.\n\nIn late 2016, the sequel to his 2011 film The Mechanic opened as Mechanic: Ressurection. It went on to become a financial windfall, grossing over $109.4 million dollars worldwide. In February 2017, he and Gal Gadot co-starred in a Wix.com ad for Super Bowl LI. The ad reached over 22 million user impressions. Spy 2 was confirmed in 2018, however, director Paul Feig has been quoted as saying there hasn't been any interest from the studio in the project. Statham played the starring role of captain Jonas Taylor in The Meg, an action horror film released in August 2018.\n\nStatham has also appeared in three Fast and Furious movies and reprised his role as Deckhard Shaw in Fast & Furious Presents: Hobbs & Shaw. Statham was praised critically for his performance, and the film was very commercially successful; it went on to become the tenth highest-grossing film of 2019.\n\nPersonal Life\n\nJason has been dating model Rosie Huntington-Whiteley since 2010. The couple became engaged in 2016 and welcomed their first son in 2017. The family resides in Beverly Hills. In 2015, Statham advocated for stunt performers to be given a category at the Academy Awards, citing the talent as overlooked. In his free time, Jason enjoys rock climbing, windsurfing, wakeboarding, and jet skiing.\n\nReal Estate\n\nIn 2009 Jason spent $10.6 million on an oceanfront home in Malibu, California. He sold this house in January 2020 for $20 million.\n\nIn 2011 he bought a Hollywood Hills home from Ben Stiller for $7.3 million. He sold this house in 2015 for $9.2 million to \"The Big Bang Theory\" star Johnny Galecki. Years earlier this home was owned by legendary session drummer Hal Blaine.\n\nIn 2015 Jason and Rosie spent $2.7 million on a home above the Sunset Strip. Their primary mansion is a home down the road in Beverly Hills that cost $13 million.", "images": ["https://vz.cnwimg.com/wp-content/uploads/2009/11/Jason-Statham.jpg", "https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2020/01/Jason-Statham.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2009/11/Jason-Statham.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/jason-statham-net-worth/", "title": "Jason Statham Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Jason Statham is a British actor who has a net worth of $90 million. His dozens of films have grossed multiple billion of dollars at the worldwide box office. As a result, Jason is one of the highest-paid action stars in the world today. He can regularly ea...", "cnw_share_fb_count": 128, "cnw_share_tw_count": 40, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Jason Statham Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/jason-statham-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/11/Jason-Statham.jpg", "site_name": "Celebrity Net Worth", "description": "Jason Statham is a British actor who has a net worth of $90 million. His dozens of films have grossed multiple billion of dollars at the worldwide box office. As a result, Jason is one of the highest-paid action stars in the world today. He can regularly ea..."}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-03-22T20:53:42+00:00", "published_time": "2020-01-02T21:24:46+00:00", "section": "Actors", "tag": "richest british people"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/11/Jason-Statham.jpg", "title": "Jason Statham Net Worth", "description": "Jason Statham is a British actor who has a net worth of $90 million. His dozens of films have grossed multiple billion of dollars at the worldwide box office. As a result, Jason is one of the highe..."}}, "movies": [], "publish_date": 1578000286.0, "source": "https://www.celebritynetworth.com", "summary": ""}