{"url": "www.inquisitr.com/2627282/holy-smokes-batman-ben-affleck-looks-a-little-different-lately/", "text": "Ben Affleck is looking different from his usual handsome self. The actor appears to be changing his looks after his very public divorce.\n\nAccording to OK! Magazine, Ben Affleck has been the center of plastic surgery rumors recently. The actor was spotted on the set of his new film, Live By Night, wearing some bandages, cuts, and bruises on his face. The plastic surgery rumors first started when Affleck's face has been looking smoother than usual. Several cosmetic surgeons have claimed that Affleck may have had some Botox and fillers.\n\nBen Affleck fuels plastic surgery rumors with bandaged and bruised appearance on film set — See the shocking photos! https://t.co/83uNJXF5fY — OK! Magazine USA (@OKMagazine) December 9, 2015\n\n— OK! Magazine USA (@OKMagazine) December 9, 2015\n\n\"He looks different — but he doesn't look better. In fact, he doesn't look like himself at all! He's had the entire upper third of his face worked on, and the result is he looks more like Jack Nicholson's Joker than Batman.\"\n\n\"A small amount of Botox fills your wrinkles and makes you look relaxed and well rested. He's had so much put in that his eyebrows look jacked up and he's just downed 50 cups of coffee. \"Again, it's a case of too much work where only a little was needed. Fat and skin has been trimmed from both above and below the eyes, and it's so starkly different that he might as well be Kenny Rogers.\"\n\n\"Again, it's a case of too much work where only a little was needed. Fat and skin has been trimmed from both above and below the eyes, and it's so starkly different that he might as well be Kenny Rogers.\"\n\nAccording to the report, since the 43-year-old has been in the news for allegedly cheating on his ex-wife Jennifer Garner with his children's nanny, sources close to Affleck claim that he's trying out a new look. Cosmetic surgery experts speculate that Affleck may have also gotten cheek fillers and laser skin treatments but has already done too much, way too soon.\n\nBen isn't just opting for a younger look on his face. He's also trying to look younger by dyeing his hair. According to the Daily Mail, the actor is taking the role of Bruce Wayne very seriously by dyeing his gray hair back to his dark brown locks. Ben has also been looking different in recent weeks due to his noticeable weight loss.\n\nHe really IS the Dark Knight! Ben Affleck ditches fade to gray look for brown locks hitting the dye bottle for… https://t.co/3EVEGfDpEe — Las Vegas NV Blog (@LasVegasNvBlog) December 3, 2015\n\n— Las Vegas NV Blog (@LasVegasNvBlog) December 3, 2015\n\nThat's not the only thing that's different about Ben Affleck these days. Reports surfaced claiming that the actor has been hiding a huge Phoenix back tattoo from his fans and the rest of the world. Ben was spotted rocking a huge and unsightly tattoo on his back, but his fans thought it was for a movie role. Sources told TMZ that Ben's tattoo is the real deal. In fact, he's had the ink design for a few months now.\n\nPlastic surgery and a huge back tattoo?!?! Ben Affleck what is HAPPENING?!?! Stop before you ruin everything!!!! https://t.co/BunOmknDh6 — Lindsay (@PinotGrigioPls) December 10, 2015\n\n— Lindsay (@PinotGrigioPls) December 10, 2015\n\nBen Affleck -- Massive Back Tattoo Is the Real Deal!!! (PHOTOS) https://t.co/f4FSeMlkG7 — TMZ (@TMZ) December 12, 2015\n\n— TMZ (@TMZ) December 12, 2015\n\nBen Affleck's back tattoo shows commitment pic.twitter.com/XsF3cbusJk — Marlow Stern (@MarlowNYC) December 11, 2015\n\n— Marlow Stern (@MarlowNYC) December 11, 2015\n\n[Photo by Angela Weiss/Getty Images]", "images": ["https://imgb.srgcdn.com/c2fbdf24-a0a4-40f9-ad23-b0cb57bf8766.jpg", "https://imgb.srgcdn.com/d258d2ec-e52b-4489-9950-908cc366bacf.jpg", "https://secure.gravatar.com/avatar/500ccfb758219c650c1b3e9b1bfeddb2?s=800", "https://imgb.srgcdn.com/fe42e24b-1fa1-4cf2-b7ef-0bcd25a6f5c9.png", "https://imgb.srgcdn.com/1740626a-9ecf-4723-b66a-d7ca5e1d678c.jpg", "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "https://imgb.srgcdn.com/a5ba8e20-c5b5-4c82-ae2b-4f343261a07b.jpg", "https://imgb.srgcdn.com/6977b3f9-ffc5-44c5-866c-e80c13668077.jpg"], "top_img": "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.inquisitr.com/2627282/holy-smokes-batman-ben-affleck-looks-a-little-different-lately/", "title": "Holy Smokes, Batman! Ben Affleck Looks A Little Different Lately", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimal-ui, user-scalable=no", "msapplication-TileImage": "/static/inquisitr/favicon-128x128.png", "robots": "max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Holy Smokes, Batman! Ben Affleck Looks A Little Different Lately", "url": "https://www.inquisitr.com/2627282/holy-smokes-batman-ben-affleck-looks-a-little-different-lately/", "site_name": "The Inquisitr", "description": "Holy Smokes, Batman! Ben Affleck Looks A Little Different Lately", "updated_time": "2021-08-16 18:13:43Z"}, "article": {"modified_time": "2021-08-16 18:13:43Z", "published_time": "2015-12-11 22:56:06Z", "section": "Celebrities"}, "description": "Holy Smokes, Batman! Ben Affleck Looks A Little Different Lately", "keywords": "Celebrities", "twitter": {"card": "summary_large_image"}}, "movies": [], "publish_date": 1449874566.0, "source": "http://www.inquisitr.com", "summary": ""}