{"url": "https://web.archive.org/web/20220818004044/http://trolls.wikia.com/wiki/King_Peppy", "text": "Character Costumes History Merchandise Gallery Quotes\n\n\n\n\n\nKing Peppy Elder\n\nAdult Trolls\n\nTrolls: The Beat Goes On! General information Alt. names Rey Pepe (Spanish) Voice Actor Jeffrey Tambor (Trolls)\n\nWalt Dohrn (Trolls World Tour)\n\n(2D animation) David Kaye (2D animation) First Appearance Trolls Profile Gender Male Age [1] 60+ Home\n\n(current) Troll Tree (former) Pop Village (current) Species Troll Origin Tribe Pop Troll Family Rainbow Troll Occupation\n\nmember King of the Pop Trolls (retired) Extreme Sleepover Club member Affiliation Extreme Sleepover Club\n\n(formerly) H.U.G.G. (formerly) Relationships Family\n\nPippi (\n\nPappy (\n\nLoppy ( Queen Poppy (daughter)Pippi ( mother Pappy ( grandfather Loppy ( great-grandfather Friends King Thrash Enemies Chef\n\nCreek\n\nand the Queen Barb and the Rock Trolls (formerly)\n\n\n\n\n\n“ No Troll left behind! ”\n\nPeppy, also referred to as King Peppy, is the retired king of the Pop Trolls and Poppy’s father. He's a major character in the opening storyline of Trolls, and has a supporting role throughout the franchise.\n\nAppearance\n\nTrolls\n\nTrolls: The Beat Goes On!\n\nTrolls World Tour\n\nTrolls: TrollsTopia Normal King Peppy is an orange-skinned Troll with pink frizzly hair, eyebrows and a mustache with grey streaks on them. He has a yellow nose and brown eyes. He wears a green and blue waistcoat, and green pants. He often carries a blue walking stick that helps him walk, but also doubles as a microphone. Adult As a young adult, Peppy had straight hair without grey streaks and a slightly longer mustache. He has the same pants that he wears as an elder, but also a dark green shirt and a blue cape, as well as a crown made of green leaves. As a young adult, Peppy had straight hair without grey streaks and a slightly longer mustache. He has the same pants that he wears as an elder, but also a dark green shirt and a blue cape, as well as a crown made of green leaves. Normal His appearance is mostly the same as in Trolls. A notable difference is that he has less grey streaks on his hair (which in turn divide it into sections of different pink shades), with none on his eyebrows and mustache, both of which are longer and thicker. In TBGO Normal He has the same design as in Trolls with a few improvements. He has the same design as inwith a few improvements. Normal He has the same appearance as in Trolls: The Beat Goes On!. He has the same appearance as in\n\nOfficial Bios\n\nTrolls\n\n“ King Peppy, as the brave leader of the Pop Trolls, led his people on a torch-lit escape to freedom from Bergen Town. His heroism and valor were the stuff of Troll legend. Quick with inspirational words of wisdom, King Peppy ushered in a new era of happiness and security in Troll Village. Now it’s 20 years later, and King Peppy has become a grandfatherly elder statesman to the Trolls. A tad dottier and forgetful than he was as a young man, King Peppy brings some unintentional humor to the Trolls, but is still beloved by everyone in Troll Village, and his legacy lives on in his daughter Poppy. He ​led the great Troll escape from the Bergens 20 years ago.\n\nHe never leaves a Troll behind.\n\nKing Peppy’s a bit absent-minded — but if he ever misplaces anything, it’s usually stuck in his hair.\n\nKing Peppy won’t let anything stop him from protecting his trolls… not even his underwear. ” —DreamWorks, 2016\n\n\n\n\n\nTrolls World Tour\n\n“ Now that he’s passed the crown to daughter Poppy, King Peppy feels he can relax a bit. But when Queen Barb forces him to confront a secret past, he must tell his tribe about the six strings. ” —DreamWorks, 2020\n\n\n\n\n\nPersonality\n\nPeppy is the old King of the Pop Trolls, a leader who lead by courage and example, taking risks under the motto of \"no Troll left behind\". In Trolls, it was shown that he was strong, fearless and determined to save his people from further harm. However, 20 years later he was not the Troll had been in his prime, and had to face allowing Poppy's friends to die to protect the rest of his people. He was helpless to protect his people, even though he still had the courage in him and was faced with the decision of protecting those left behind by going against his earlier belief. He was reluctant to see his daughter Poppy go after her friends, but was happy that she saved everyone in the end and proved her worth enough to become Queen.\n\nKing Peppy is shown as a wise teacher in Trolls: The Beat Goes On! and has sage advice on things, but he has his eccentric side as well. For example, in the episode \"Royal Review\", he gives his daughter a frowny face in the primary vote to teach her a lesson, though he isn't clear what the lesson was himself. He's accepting of his elder status and even laughs at his own expense. King Peppy had been a bit of an adventurer in his prime. He can be seen in \"Queen of the Castle\" giving up some of the numerous books he had gathered over time. In \"Scrapbookmobile\", it was shown that he had some of the greatest scrapbooks scissored, which other Trolls enjoyed reading, though due to poor memory could barely remember them enough to recreate those books.\n\nPeppy doesn't always tell his daughter everything despite being Queen, believing that she should learn things when she's ready. He didn't tell her about the other Tribes because he felt she wasn't ready, but Queen Barb's conquest of the Tribes forced him to reveal that secret to her. However, he's oblivious about the version of his Tribe history being changed in context. He lived in fear of other Trolls and the approaching threat by Barb was even enough to attempt to overwrite Poppy's decisions to not run from the Rock Trolls and saw the Rock Trolls as a true threat, unaware that they had in truth seen the Pop Trolls as the biggest threat.\n\nRelationships\n\nFriends\n\nIn the Trolls: The Beat Goes On! episode \"Hug Fest\", Peppy joined with his former band H.U.G.G. for the reunion concert, which consists of Sky Toronto, Mags Gumdrop and Dr. Moonbloom.\n\nOther Trolls\n\nPeppy was well respected by his people and they looked up to him for literal decades for guidance and leadership. He was the king who freed his people from the Bergens, giving them back their liberty and freedom, as well as protecting them from the Bergens by founding a new home far away from Bergen Town.\n\nIn Trolls: The Beat Goes On!, Peppy is portrayed as being acknowledged by all Trolls as old, even joking with him about it in \"Funsgiving\". In \"Don't Worry Be Peppy\", the entirety of Pop Village were prepared to help Poppy make him feel wanted and useful, just because Poppy was worried about him.\n\nFamily\n\nTheir relationship is generally one of great respect; Peppy is glad to have her as a daughter and Poppy looks to him for sage advice. Poppy admires her father and wants to be a good leader to the Trolls like he was, but sometimes just lacks the experience and Peppy is known to chip in advice from time to time.\n\nIn Trolls World Tour, he has a row with Poppy over what's best for their people with the incoming threat of Barb, and Poppy has to remind him that she is Queen now. He accuses of her of not listening to him, which was warranted given that his daughter would go on without listening to anyone throughout the movie. He shows sorrow when Poppy appears to have been converted to a Rock Zombie, but then takes pride in her for stopping Barb and wastes no time to take credit for raising her, calling himself a \"genius\" for doing so.\n\nSkills & Abilities\n\nHe has most normal Troll abilities, as well as the abilities of his Tribe.\n\nIn the Trolls era, he was listed as a Rainbow Troll. His \"True Colors\" are unknown.\n\nLeadership\n\nIn his youth, King Peppy was the heroic King who vowed to save his people by running away from the Bergens. He tends to fall back onto this tactic later in the movies. In the main storyline of Trolls, when Chef attacks during his daughter Poppy's party, he tells her that the surviving Trolls need to run. In Trolls World Tour, he suggests the same when Queen Barb announces her Rock World Tour. As a leader, one of Peppy's duties is to protect his people no matter what, but he often relies on the \"run and hide\" tactic, running away from danger rather than facing it.\n\nAs a leader, Peppy was known for his strength of body and mind, matched by his determination and will to carry on. While how long his reign lasted is unknown as that information is unavailable, he was the King who successfully saved his people from Trollstice under the oath of \"No Troll left behind!\" on the day his daughter Princess Poppy was set to be devoured by King Gristle Jr.. It was also his duty to make new holidays, with \"Funsgiving\" being one of those holidays he declared.\n\nMusic\n\nPeppy was a member of H.U.G.G., as seen in the Season 6 episode \"Hug Fest\". He was the band's lead singer.\n\nWhen he was King of the Pop Trolls, it was his sworn duty to protect his music, including the pink string of Pop.\n\nAdventurer\n\nIt has been mentioned in Trolls: The Beat Goes On! that in his youth Peppy was highly adventurous and went on many great adventures, though only few details of these adventures are known.\n\nTeaching\n\nWhen he was leader, it would have been his duty to teach young Trolls about being a Troll. Now retired, he extends his knowledge to try and help his daughter with sage old advice. However, he hasn't necessarily revealed everything he knows to her, as evidenced by his neglecting of telling her about the other Tribes until Queen Barb became a threat.\n\nMedical Status and Issues\n\nWhen he was younger, he was shown to be able to carry many Trolls during the escape in Trolls. However, this is no longer possible due to his age. He now has physical restrictions. King Peppy usually requires a walking stick though at times is seen without it.\n\nIn Trolls: The Beat Goes On!, he is shown to still have some fitness to do things in \"Don't Worry Be Peppy\", though he accepts he is happily retired and all the rushing around was exhausting. \"In Hug Fest\", he threw his back out doing a split-jump.\n\nMental Issues\n\nThough he was intended to be written as senile in Trolls, this was not the case in the end.\n\nHowever, in Trolls: The Beat Goes On!, he showed signs of forgetfulness at times with examples included \"Scrapbookmobile\" and \"A Flower For Poppy\".\n\nSongs\n\nTrolls: The Beat Goes On!\n\nSeason 6\n\nTrolls: TrollsTopia\n\nSeason 2\n\nEtymology\n\n\"Peppy\" means \"lively and high-spirited\".\n\nTrivia\n\nGeneral\n\nPeppy is one of the only two elder Trolls seen in the movies, the other being King Thrash. In the Trolls: The Beat Goes On! episode \"Don't Worry Be Peppy\", Branch mentions that Peppy is three times his age, which would put Peppy at an age of at least 60 due to how old Branch is (around 20 years). Based on his estimated age given by the aforementioned episode, Poppy was born when Peppy was about 40 years old, since Poppy herself was at least 20 during the main storyline of Trolls .\n\nHe's one of the few characters to have had 3 voice actors in the franchise.\n\nReferences", "images": ["https://web.archive.org/web/20220818004044im_/https://vignette.wikia.nocookie.net/spotlightsimagestemporary/images/0/0e/UC.JPG/revision/latest?cb=20200923195325", "https://web.archive.org/web/20220818004044im_/https://static.wikia.nocookie.net/trolls/images/e/e6/Site-logo.png/revision/latest?cb=20210722022523", "https://web.archive.org/web/20220818004044im_/https://static.wikia.nocookie.net/trolls/images/f/f6/Peppy.png/revision/latest/scale-to-width-down/1200?cb=20200504113949", "https://web.archive.org/web/20220818004044im_/https://static.wikia.nocookie.net/trolls/images/f/f6/Peppy.png/revision/latest/scale-to-width-down/350?cb=20200504113949", "https://web.archive.org/web/20220818004044im_/https://vignette.wikia.nocookie.net/letsgoluna/images/c/cd/Erik-Luna-article-2-copy.png/revision/latest?cb=20200327133046", "https://web.archive.org/web/20220818004044im_/https://static.wikia.nocookie.net/trolls/images/c/c4/2436392.jpg/revision/latest/scale-to-width-down/180?cb=20210620161427", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://web.archive.org/web/20220818004044im_/https://vignette.wikia.nocookie.net/club57/images/b/b2/Rainbow-Club-57-cover.jpg/revision/latest?cb=20200522172522", "https://web.archive.org/web/20220818004044im_/https://static.wikia.nocookie.net/trolls/images/1/10/Kingpeeppytbgo.jpg/revision/latest/scale-to-width-down/350?cb=20200521193917", "https://web.archive.org/web/20220818004044im_/https://static.wikia.nocookie.net/trolls/images/0/09/King_Peppyyoung.png/revision/latest/scale-to-width-down/350?cb=20191116101726", "https://web.archive.org/web/20220818004044im_/https://static.wikia.nocookie.net/trolls/images/1/10/Kingpeeppytbgo.jpg/revision/latest/scale-to-width-down/144?cb=20200521193917"], "top_img": "https://web.archive.org/web/20220818004044im_/https://static.wikia.nocookie.net/trolls/images/f/f6/Peppy.png/revision/latest/scale-to-width-down/1200?cb=20200504113949", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20220818004044/https://trolls.fandom.com/wiki/King_Peppy", "title": "King Peppy", "meta_data": {"generator": "MediaWiki 1.37.4", "format-detection": "telephone=no", "og": {"type": "article", "site_name": "Trolls Trollpedia", "title": "King Peppy", "url": "https://web.archive.org/web/20220818004044/https://trolls.fandom.com/wiki/King_Peppy", "description": "Peppy, also referred to as King Peppy, is the retired king of the Pop Trolls and Poppy’s father. He's a major character in the opening storyline of Trolls, and has a supporting role throughout the franchise. Peppy is the old King of the Pop Trolls, a leader who lead by courage and example, taking risks under the motto of \"no Troll left behind\". In Trolls, it was shown that he was strong, fearless and determined to save his people from further harm. However, 20 years later he was not the Troll ha", "image": "https://web.archive.org/web/20220818004044im_/https://static.wikia.nocookie.net/trolls/images/f/f6/Peppy.png/revision/latest/scale-to-width-down/1200?cb=20200504113949"}, "twitter": {"card": "summary", "site": "@getfandom", "url": "https://web.archive.org/web/20220818004044im_/https://trolls.fandom.com/wiki/King_Peppy", "title": "King Peppy | Trolls Trollpedia | Fandom", "description": "Peppy, also referred to as King Peppy, is the retired king of the Pop Trolls and Poppy’s father. He's a major character in the opening storyline of Trolls, and has a supporting role throughout the..."}, "description": "Peppy, also referred to as King Peppy, is the retired king of the Pop Trolls and Poppy’s father. He's a major character in the opening storyline of Trolls, and has a supporting role throughout the franchise. Peppy is the old King of the Pop Trolls, a leader who lead by courage and example...", "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.25, maximum-scale=5.0", "fb": {"app_id": 112328095453510}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}