{"url": "https://www.hollywoodreporter.com/live-feed/doctor-who-star-jodie-whittaker-women-are-not-a-genre-1149270", "text": "It may have taken more than 50 years for TV’s favorite two-hearted alien to regenerate into a woman’s body, but according to new Doctor Who star Jodie Whittaker, it was something the BBC drama’s latest showrunner, Chris Chibnall, always wanted to do. As a lifelong fan, Chibnall’s vision of the Doctor was perhaps more progressive than the heads of the BBC were ready to allow. But in 2018, Whittaker is ready to throw down.\n\nHeading into Sunday’s Doctor Who premiere, Whittaker still recalls the day more than a year ago when her casting went viral. “The announcement was, in my career at that point, the biggest thing that ever happened,” the actress tells The Hollywood Reporter. In the time since she became a household name among the fanboy set, Whittaker has had the opportunity to make her mark on the Doctor.\n\n“Shooting the two days of the Christmas special with Peter [Capaldi] — his final episode and the regeneration — and then going on with the 10-episode season, it grows in the most organic, ordinary, quite metered way,” Whittaker says.\n\nBelow, Whittaker opens up about what playing the first female Doctor in show history means, advice from her peers and why she wants to be more than a feminist icon.\n\nWhat was the process of becoming the Doctor like for you?\n\nBeing on set for the first time was really emotional, it was incredible for all of us — Chris Chibnall, for [companions] Brad [Walsh] and Mandip [Gill] and Tosin [Cole]. We were supported by this incredible crew, some of whom have been working on [Doctor Who] for 10 to 15 years. There’s no job like it. It’s quite liberating as an actor, all the hard work has been done over 55 years, generating a fan base all over the world, I just have to make sure I don’t lose it.\n\nDid you and Chris collaborate on what your Doctor would be like?\n\nWe were able to talk about it a lot. All these little things started to happen before anybody knew I was playing the role, so it was a continual conversation. For the character, though, I think Chris had a very clear idea of the Doctor he was writing, and my energy was suited to that. In no way did I have to go, “This is the type of Doctor I want to play”; it was there on the page.\n\nHow does the Doctor’s femaleness change the role/story? Does it?\n\nWell, it’s less relevant to the Doctor because the Doctor has embraced change, previously, 12 times. It becomes apparent in certain worlds because sometimes we go back in time, where gender played a particular role. And you see in the Christmas special, when I pull the screen around in the TARDIS for the first time — before I’m rudely kicked out. I saw the woman’s reflection and that being a joy, and it being something new and exciting. It’s certainly not a running theme for me because it is irrelevant to me. My gender, in every part I’ve ever played — I just am. Gender is irrelevant because it’s about playing an alien timelord so it’s just about inhabiting the truth of the scene and the energy — and making sure you’re driving the story forward. All those things come naturally anyway, whether that’s being played by a man or a woman.\n\nWhat about femininity, which hasn’t been traditionally seen as a strength onscreen? With Game of Thrones, the more feminine characters are punished but the more masculine types survive. Will your Doctor derive any of her strength from more feminine aspects of herself?\n\nI’m always searching out inspiration from strong, complex and flawed characters. I want to be emotionally and physically challenged and driven to different aspects of my range. The Doctor has personality traits, but they aren’t specific. What’s important is that we don’t attribute them solely to men. They’re the attributes of the Doctor, regardless of who plays that role. It’s the character’s attributes, not the gender. When I was growing up, all the parts I wanted to play were being played by the lads — it never stopped me believing I wanted to do those things. It’s nice to know if someone’s watching it, you represent something for them that they haven’t necessarily seen before, but it doesn’t affect the playing of the role.\n\nAre you sick of hearing “first female Doctor”? It sounds a lot like the inclusion conversation in Hollywood these days.\n\nI’ve been in stuff before where there’s been a female director and it’s like, “I think she was just a director,” or describing someone as a “female writer” instead of just a writer. It’s often given to us as this nice little packaged statement. I got asked, “Oh, are you going to play the Doctor as a woman?” I’m just going to play it as me. I didn’t approach Beth Latimer on Broadchurch and go, “What female qualities will I bring to this?” I just have to play the truth and experience of the scene. And the truth of the scene is my experience, and my truth, but that doesn’t mean it disconnects from anyone else’s truth, it just is a different direction. Like Peter’s truth will be different from Chris Eccleston’s truth, because of life and experience.\n\nIs that frustrating for you? Because it feels like you have to act in a way that looks to the future, but the discourse we’re having is set in the near-past or present.\n\nBeing cast as the first female Doctor is extraordinary, and I’m going to dine out on it forever, but what I can’t wait for is the moment — because TV does represent the society we live in in every way — where we don’t just see [stories] from the same perspective continually. That’s being embraced now. Women are not a genre, we’re just the other half of the population. I’m guilty of this as well because when I first started to audition, I kept calling the Doctor a “he” — it was just this automatic thing. Now it’s second nature to me: the Doctor is the Doctor without either/or, but you can’t help but associate it with that because that’s how it’s always been known.\n\nWith your casting, you’re helping reframe what identity means to the show. To that end, how much of a feminist icon do you think this character will become now?\n\nIt’s about being an icon for everyone, which is what the Doctor has always been. Doctor Who has always had a fanbase that is very diverse, with male and female fans of all ages. For me it’s about saying, “Listen, there are 12-year-old boys watching this show, who have women in their life that they probably look up to; it isn’t weird to look up to women. You probably look up to your mom or your aunt or your grandmom!” The wonderful thing about this role is that the people that you’re regenerating into look like you could live next door to them — they’re not chiseled out of rock or have this extraordinary muscle tone. [Laughs.] It’s very ordinary bodies with an extraordinary alien inside, and that’s what’s appealing about it: it’s an icon for all. Being a woman, you have young kids looking up to you like they didn’t before. Like the young girl who’s not previously had the show she’s followed all her life have a woman that looked like her at the helm. Because you’re always on the sidelines very often, aren’t you? … I think it’s going to, hopefully, be a role for all people — including new viewers who may have previously thought this show wasn’t necessarily for them.\n\nWhy do you think it took so long for this franchise to cast a female Doctor?\n\nIn like the ’80s, there was a talk show where it was suggested. For Chris, who says watching Doctor Who was his first memory, it was the direction that he wanted to take the show in as a fan. This happened before all the [#MeToo] revelations within the industry. It feels timely because we’re at a moment where we’re being heard, and that’s only a good thing. We are sitting in the cinemas and seeing versions of ourselves onscreen and in places of power, which is exciting and about time. It’s 2018, we’re all ready for it — it’s not such an unusual thing to see a female Doctor.\n\nFan reaction can be vitriolic in fandoms as large as Doctor Who. We saw that with Star Wars‘ Kelly Marie Tran being bullied off social media earlier this year. Have you experienced anything like that in your time thus far?\n\nI haven’t. I’m not on social media. I’ve not opened myself up to that because to do so would involve someone walking across the street and saying it to my face. That’s why it doesn’t happen, because people hide behind their Twitter handle. I don’t want to experience it, [though] I’d love to know what doesn’t qualify me for the role, or what makes Peter, Matt, David or Chris more qualified to play an alien with two hearts than me. With social media there are so many positives, it gives people a voice in places that don’t necessarily have a voice, it gave the #MeToo movement an incredibly powerful voice and it has these positives, but me, as an individual, I just think my narcissistic traits could not cope with that.\n\nHave you spoken to Moffat or any of the past Doctors?\n\nMy casting was announced on a Sunday after the Wimbledon finals, and [former Doctors] Peter Capaldi, Matt Smith, David Tennant and Steven Moffat were made aware of it beforehand. David, who is a friend, said [playing a Doctor] will, “be like nothing you ever go on, but it is such an experience that you’ll treasure. It’ll go really quick, it won’t seem like it now when you’re in fear of the world about to know what you look like, but it goes so quick and it’s just to be enjoyed because it’s a massive ride.” And when I spoke to Peter and Matt, it was more of those vibes.\n\nWhat are your plans for day-of premiere?\n\nI will probably be very far away! I might turn my phone off so I can just watch it peacefully and take it in and then be very accusatory over WhatsApp, going, “Did you watch it, did you watch it?!” We’ve just spent a year and a half of work carrying on this amazing legacy, and making it our own as well. To know that finally the fans are getting to watch it and potentially reach a new audience that has never seen it before? I think it will be really emotional and I’d like to make that as private as possible, but I’m sure someone will FaceTime me during a crucial bit! And I’ll be like, “Are you not watching?!”", "images": ["https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.hollywoodreporter.com/wp-content/uploads/2018/10/doctor_who_2_-still_-publicity_-embed_4-_2018.jpg?w=928", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/10/doctor_who_2_-still_-publicity_-embed_3-_2018.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/10/doctor_who_2_-still_-publicity_-embed_1-_2018.jpg?w=928", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/uploads/2018/10/doctor_who_2_-still_-publicity_-h_2018.jpg?w=1296&h=730&crop=1", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/10/doctor_who_2_-still_-publicity_-h_2018.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2018/10/doctor_who_2_-still_-publicity_-embed_2-_2018.jpg?w=928"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/10/doctor_who_2_-still_-publicity_-h_2018.jpg?w=1024", "keywords": [], "authors": ["Alicia Lutes"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/doctor-who-star-jodie-whittaker-women-are-not-a-genre-1149270/", "title": "‘Doctor Who’ Star Jodie Whittaker: “Women Are Not a Genre”", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Jodie Whittaker wants to be more than a feminist icon as the first woman to play the Doctor on 'Doctor Who.'", "news_keywords": "Doctor Who, international, Jodie Whittaker", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Alicia Lutes", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1149270, "title": "'Doctor Who' Star Jodie Whittaker: \"Women Are Not a Genre\"", "published_at": "2018-10-04 09:40:28", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/10/doctor_who_2_-still_-publicity_-h_2018.jpg?w=1024", "comment_count": 0, "tags": "Jodie Whittaker", "topics": "TV News", "body": "It may have taken more than 50 years for TV's favorite two-hearted alien to regenerate into a woman's body, but according to new Doctor Who star Jodie Whittaker, it was something the BBC drama's latest showrunner, Chris Chibnall, always wanted to do. As a lifelong fan, Chibnall's vision of the Doctor was perhaps more progressive than the heads of the BBC were ready to allow. But in 2018, Whittaker is ready to throw down.\r\nHeading into Sunday's Doctor Who premiere, Whittaker still recalls the day more than a year ago when her casting went viral. \"The announcement was, in my career at that point, the biggest thing that ever happened,\" the actress tells The Hollywood Reporter. In the time since she became a household name among the fanboy set, Whittaker has had the opportunity to make her mark on the Doctor.\r\n\"Shooting the two days of the Christmas special with Peter [Capaldi] — his final episode and the regeneration — and then going on with the 10-episode season, it grows in the most organic, ordinary, quite metered way,\" Whittaker says.\r\nBelow, Whittaker opens up about what playing the first female Doctor in show history means, advice from her peers and why she wants to be more than a feminist icon.\r\n\r\nWhat was the process of becoming the Doctor like for you?\r\nBeing on set for the first time was really emotional, it was incredible for all of us — Chris Chibnall, for [companions] Brad [Walsh] and Mandip [Gill] and Tosin [Cole]. We were supported by this incredible crew, some of whom have been working on [Doctor Who] for 10 to 15 years. There's no job like it. It's quite liberating as an actor, all the hard work has been done over 55 years, generating a fan base all over the world, I just have to make sure I don't lose it. \r\nDid you and Chris collaborate on what your Doctor would be like?\r\nWe were able to talk about it a lot. All these little things started to happen before anybody knew I was playing the role, so it was a continual conversation. For the character, though, I think Chris had a very clear idea of the Doctor he was writing, and my energy was suited to that. In no way did I have to go, \"This is the type of Doctor I want to play\"; it was there on the page.\r\nHow does the Doctor's femaleness change the role/story? Does it?\r\nWell, it's less relevant to the Doctor because the Doctor has embraced change, previously, 12 times. It becomes apparent in certain worlds because sometimes we go back in time, where gender played a particular role. And you see in the Christmas special, when I pull the screen around in the TARDIS for the first time — before I'm rudely kicked out. I saw the woman's reflection and that being a joy, and it being something new and exciting. It's certainly not a running theme for me because it is irrelevant to me. My gender, in every part I've ever played — I just am. Gender is irrelevant because it's about playing an alien timelord so it's just about inhabiting the truth of the scene and the energy — and making sure you're driving the story forward. All those things come naturally anyway, whether that's being played by a man or a woman.\r\n\r\nWhat about femininity, which hasn't been traditionally seen as a strength onscreen? With Game of Thrones, the more feminine characters are punished but the more masculine types survive. Will your Doctor derive any of her strength from more feminine aspects of herself? \r\nI'm always searching out inspiration from strong, complex and flawed characters. I want to be emotionally and physically challenged and driven to different aspects of my range. The Doctor has personality traits, but they aren't specific. What's important is that we don't attribute them solely to men. They're the attributes of the Doctor, regardless of who plays that role. It's the character's attributes, not the gender. When I was growing up, all the parts I wanted to play were being played by the lads — it never stopped me believing I wanted to do those things. It's nice to know if someone's watching it, you represent something for them that they haven't necessarily seen before, but it doesn't affect the playing of the role.\r\nAre you sick of hearing \"first female Doctor\"? It sounds a lot like the inclusion conversation in Hollywood these days. \r\nI've been in stuff before where there's been a female director and it's like, \"I think she was just a director,\" or describing someone as a \"female writer\" instead of just a writer. It's often given to us as this nice little packaged statement. I got asked, \"Oh, are you going to play the Doctor as a woman?\" I'm just going to play it as me. I didn't approach Beth Latimer on Broadchurch and go, \"What female qualities will I bring to this?\" I just have to play the truth and experience of the scene. And the truth of the scene is my experience, and my truth, but that doesn't mean it disconnects from anyone else's truth, it just is a different direction. Like Peter's truth will be different from Chris Eccleston's truth, because of life and experience.\r\n\r\nIs that frustrating for you? Because it feels like you have to act in a way that looks to the future, but the discourse we're having is set in the near-past or present. \r\nBeing cast as the first female Doctor is extraordinary, and I'm going to dine out on it forever, but what I can't wait for is the moment — because TV does represent the society we live in in every way — where we don't just see [stories] from the same perspective continually. That's being embraced now. Women are not a genre, we're just the other half of the population. I'm guilty of this as well because when I first started to audition, I kept calling the Doctor a \"he\" — it was just this automatic thing. Now it's second nature to me: the Doctor is the Doctor without either/or, but you can't help but associate it with that because that's how it's always been known.\r\n\r\nWith your casting, you're helping reframe what identity means to the show. To that end, how much of a feminist icon do you think this character will become now?\r\nIt's about being an icon for everyone, which is what the Doctor has always been. Doctor Who has always had a fanbase that is very diverse, with male and female fans of all ages. For me it's about saying, \"Listen, there are 12-year-old boys watching this show, who have women in their life that they probably look up to; it isn't weird to look up to women. You probably look up to your mom or your aunt or your grandmom!\" The wonderful thing about this role is that the people that you're regenerating into look like you could live next door to them — they're not chiseled out of rock or have this extraordinary muscle tone. [Laughs.] It's very ordinary bodies with an extraordinary alien inside, and that's what's appealing about it: it's an icon for all. Being a woman, you have young kids looking up to you like they didn't before. Like the young girl who's not previously had the show she's followed all her life have a woman that looked like her at the helm. Because you're always on the sidelines very often, aren't you? … I think it's going to, hopefully, be a role for all people — including new viewers who may have previously thought this show wasn't necessarily for them.\r\n\r\nWhy do you think it took so long for this franchise to cast a female Doctor?\r\nIn like the '80s, there was a talk show where it was suggested. For Chris, who says watching Doctor Who was his first memory, it was the direction that he wanted to take the show in as a fan. This happened before all the [#MeToo] revelations within the industry. It feels timely because we're at a moment where we're being heard, and that's only a good thing. We are sitting in the cinemas and seeing versions of ourselves onscreen and in places of power, which is exciting and about time. It's 2018, we're all ready for it — it's not such an unusual thing to see a female Doctor.\r\nFan reaction can be vitriolic in fandoms as large as Doctor Who. We saw that with Star Wars' Kelly Marie Tran being bullied off social media earlier this year. Have you experienced anything like that in your time thus far? \r\nI haven't. I'm not on social media. I've not opened myself up to that because to do so would involve someone walking across the street and saying it to my face. That's why it doesn't happen, because people hide behind their Twitter handle. I don't want to experience it, [though] I'd love to know what doesn't qualify me for the role, or what makes Peter, Matt, David or Chris more qualified to play an alien with two hearts than me. With social media there are so many positives, it gives people a voice in places that don't necessarily have a voice, it gave the #MeToo movement an incredibly powerful voice and it has these positives, but me, as an individual, I just think my narcissistic traits could not cope with that.\r\n\r\nHave you spoken to Moffat or any of the past Doctors? \r\nMy casting was announced on a Sunday after the Wimbledon finals, and [former Doctors] Peter Capaldi, Matt Smith, David Tennant and Steven Moffat were made aware of it beforehand. David, who is a friend, said [playing a Doctor] will, \"be like nothing you ever go on, but it is such an experience that you'll treasure. It'll go really quick, it won't seem like it now when you're in fear of the world about to know what you look like, but it goes so quick and it's just to be enjoyed because it's a massive ride.\" And when I spoke to Peter and Matt, it was more of those vibes.\r\nWhat are your plans for day-of premiere? \r\nI will probably be very far away! I might turn my phone off so I can just watch it peacefully and take it in and then be very accusatory over WhatsApp, going, \"Did you watch it, did you watch it?!\" We've just spent a year and a half of work carrying on this amazing legacy, and making it our own as well. To know that finally the fans are getting to watch it and potentially reach a new audience that has never seen it before? I think it will be really emotional and I'd like to make that as private as possible, but I'm sure someone will FaceTime me during a crucial bit! And I'll be like, \"Are you not watching?!\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Doctor Who’ Star Jodie Whittaker: “Women Are Not a Genre”", "url": "https://www.hollywoodreporter.com/tv/tv-news/doctor-who-star-jodie-whittaker-women-are-not-a-genre-1149270/", "description": "Jodie Whittaker wants to be more than a feminist icon as the first woman to play the Doctor on ‘Doctor Who.’", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/10/doctor_who_2_-still_-publicity_-h_2018.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-10-04T09:40:28+00:00", "modified_time": "2018-10-05T06:42:49+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Doctor Who’ Star Jodie Whittaker: “Women Are Not a Genre”", "description": "Jodie Whittaker wants to be more than a feminist icon as the first woman to play the Doctor on ‘Doctor Who.’", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/10/doctor_who_2_-still_-publicity_-h_2018.jpg?w=1296"}}, "movies": [], "publish_date": 1538646028.0, "source": "https://www.hollywoodreporter.com", "summary": ""}