{"url": "www.cnn.com/2017/09/29/politics/tom-price-resigns/index.html", "text": "Story highlights The scandal infuriated Trump Price is the latest casualty in the administration\n\nWashington CNN —\n\nTom Price, the embattled health and human services secretary, resigned Friday in the midst of a scandal over his use of private planes, a storm that enraged President Donald Trump and undercut his promise to bring accountability to Washington.\n\nPrice’s departure came as he’s being investigated by the department’s inspector general for using private jets for multiple government business trips, even to fly distances often as short as from Washington to Philadelphia. The cost for the trips ran into the hundreds of thousands of dollars.\n\nThe scandal infuriated Trump, who viewed the controversy as a needless distraction from his agenda. Over the course of the week, Trump fumed to aides about Price’s flights, which he deemed “stupid,” according to multiple sources. Instead of moving past the storm, Price’s offer to reimburse the government for only a fraction of the flights’ costs enraged Trump further.\n\nSpeaking less than an hour before the resignation was announced, Trump bemoaned the optics of the matter, which he said obscured what otherwise had been a cost-saving tenure.\n\n“I was disappointed because I didn’t like it, cosmetically or otherwise. I was disappointed,” Trump said.\n\nPrice and his aides have insisted that the trips he took by private charter jet had been approved through the usual legal and ethics offices at HHS. But the appearance of a millionaire Cabinet secretary flying routes easily navigated by far cheaper means proved an optics nightmare for an administration already accused of being out of touch with regular Americans.\n\nPrice is the latest casualty in an administration that’s seen a high rate of dramatic departures over its first eight months. Since taking office, Trump has dismissed or seen quit his national security adviser, press secretary, communications director, chief strategist, acting attorney general and FBI director. The tumult has come as Trump struggles to fulfill key aspects of his agenda on Capitol Hill, and as his team confronts its most dire challenge yet on a storm-demolished Puerto Rico.\n\nTrump was incensed that Price’s actions undermined his vow to “drain the swamp,” though Price is not the only Cabinet official to have used private air charters to travel around the country. EPA Administrator Scott Pruitt and Interior Secretary Ryan Zinke have both flown on private planes during their tenures in the administration.\n\nThe White House said this week it was examining whether to adopt stricter oversight of Cabinet secretaries’ travel plans.\n\nThe first sign of Trump’s ire emerged on Wednesday, when he said only “we’ll see” after being asked if he was planning to fire Price. Neither Trump nor his top aides could say in the following days whether Price retained the President’s confidence.\n\nDeparting the White House on Friday, Trump called Price a “very fine man” who had nonetheless made a grave mistake.\n\n“This is an administration that saves hundreds of millions of dollars on renegotiating things,” Trump said. “So I don’t like to see somebody that perhaps there’s the perception that it wasn’t right.”\n\nThe resignation was announced as Trump flew aboard Air Force One for another weekend at his golf club in New Jersey. Stepping off his own plane, Trump offered a thumbs-up sign when reporters asked if he’d accepted Price’s resignation.\n\nPrice himself offered a rosy picture of his future on Thursday evening, telling CNN that he “absolutely” planned to stay on as health secretary – a claim that was ultimately not meant to be.\n\nNot close\n\nVideo Ad Feedback 01:34 - Source: CNN Tom Price vows reimbursement for flights\n\nTrump, who never grew as close to Price as he has to some of his aides, also viewed the health secretary as an ineffective promoter of Republican plans to repeal and replace the Affordable Care Act, an effort that has failed multiple times over the course of Trump’s eight months in office.\n\nDuring a rally with Boy Scouts in July, Trump quipped that if Price couldn’t wrangle the votes, he’d dismiss him.\n\n“He better get them. Oh, he better,” Trump said. “Otherwise I’ll say, ‘Tom, you’re fired.’ “\n\nPrice didn’t get the votes, but it was his use of private aircraft that ultimately led to his demise in the Trump administration.\n\nPolitico first reported Price’s use of charter jets for official business last week and found that the secretary has traveled on charter flights at least 24 times since May, citing people familiar with his travel plans and a review of HHS documents.\n\nCharter plane operators estimated 24 flights would have cost $400,000, Politico reported. Commercial trips would have cost thousands of dollars less. The Health and Human Services inspector general is reviewing whether the means of travel was appropriate.\n\nLater, it was revealed that Price also took US military aircraft on two trips abroad, bringing the total cost of his non-commercial travel to more than $1 million. The military flights were approved by the White House.\n\nBreaking precedent\n\nVideo Ad Feedback 04:39 - Source: CNN Price experiencing turbulence for private flights\n\nPrice’s travel breaks with the precedent set by former President Barack Obama’s HHS secretaries Sylvia Mathews Burwell and Kathleen Sebelius, who flew commercially when flying within the US.\n\nPrice said in a statement on Thursday that would write a personal check to the US Treasury to cover the cost of his travel on private charter planes.\n\n“The taxpayers won’t pay a dime for my seat on those planes,” he proclaimed, though it was later revealed he would only pay for his seat and not the total cost of chartering a plane.\n\nAn HHS spokesperson said the check would come to $51,887.31, a small percentage of the total cost of the private flights.\n\nPrice, both in his role as Trump’s health boss and as a Republican congressman from Georgia, was a frequent critic of government spending. He told CNN in April that he wanted to cut redundancy and waste in his agency.\n\n“For us to say, ‘OK, let’s just throw more money at that system, let’s see if more money helps that out,’ is the wrong way,” Price told CNN’s Sanjay Gupta.\n\nWhile at HHS, Price played an integral part helping craft many iterations of alternatives to Obamacare – all of which ultimately failed to pass. Price was also part of the executive opioid commission announced by Trump in March.\n\nPrior to his role in the administration, Price was a Georgia representative for over 10 years, and was an orthopedic surgeon for 20 years. He was the third doctor to hold the HHS secretary position.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/170117115346-chuck-schumer-tom-price-raju-ath-intv-00001317.jpg?q=x_228,y_54,h_869,w_1544,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/170929135751-01-tom-price-0929.jpg?q=x_3,y_0,h_1684,w_2993,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/170925150243-sarah-sanders-09-25-2017.jpg?q=x_6,y_52,h_1684,w_2993,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/170419223152-1-on-1-with-tom-price.jpg?q=x_2,y_0,h_1078,w_1915,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/160520153744-white-house-file.jpg?q=x_3,y_126,h_1684,w_2993,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/170928161928-tom-price-09-28-2017.jpg?q=x_3,y_156,h_1684,w_2993,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/170116165250-02-tom-price-file.jpg?q=x_3,y_0,h_1684,w_2993,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/170929135751-01-tom-price-0929.jpg?q=x_3,y_0,h_1684,w_2993,c_crop/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/140929103051-kevin-liptak-profile-image.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/161129144301-tom-price.jpg?q=x_2,y_0,h_898,w_1596,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/170808174919-tom-price.jpg?q=x_127,y_58,h_920,w_1635,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/161128093233-tom-price-january-12-2015.jpg?q=x_392,y_0,h_2223,w_3951,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/170706100345-miranda-green.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/170929121150-tom-price.jpg?q=x_5,y_143,h_2526,w_4490,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/170929165353-03-price-trump-file.jpg?q=x_76,y_102,h_1616,w_2872,c_crop/w_250"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/170929135751-01-tom-price-0929.jpg?q=x_3,y_0,h_1684,w_2993,c_crop/w_800", "keywords": [], "authors": ["Kevin Liptak Miranda Green", "Kevin Liptak", "Miranda Green"], "canonical_link": "https://www.cnn.com/2017/09/29/politics/tom-price-resigns/index.html", "title": "Price out as HHS secretary after private plane scandal", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Price out as HHS secretary after private plane scandal | CNN Politics", "description": "Tom Price, the embattled health and human services secretary, resigned Friday in the midst of a scandal over his use of private planes, a storm that enraged President Donald Trump and undercut his promise to bring accountability to Washington.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170929135751-01-tom-price-0929.jpg?q=x_3,y_0,h_1684,w_2993,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2017/09/29/politics/tom-price-resigns/index.html", "site_name": "CNN"}, "twitter": {"title": "Price out as HHS secretary after private plane scandal | CNN Politics", "description": "Tom Price, the embattled health and human services secretary, resigned Friday in the midst of a scandal over his use of private planes, a storm that enraged President Donald Trump and undercut his promise to bring accountability to Washington.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170929135751-01-tom-price-0929.jpg?q=x_3,y_0,h_1684,w_2993,c_crop/w_800", "card": "summary_large_image", "site": "@cnnpolitics"}, "description": "Tom Price, the embattled health and human services secretary, resigned Friday in the midst of a scandal over his use of private planes, a storm that enraged President Donald Trump and undercut his promise to bring accountability to Washington.", "template_type": "article_leaf", "type": "article", "meta-section": "politics", "theme": "politics", "article": {"published_time": "2017-09-29T20:40:03Z", "modified_time": "2017-09-29T22:34:25Z", "tag": "air transportation, aircraft, aviation and aerospace industry, business and industry sectors, business, economy and trade, civil aviation, donald trump, government and public administration, government bodies and offices, political figures - us, resignations, tom price, transportation and warehousing, us federal government, white house, scandals", "publisher": "https://www.facebook.com/CNN"}, "keywords": "air transportation, aircraft, aviation and aerospace industry, business and industry sectors, business, economy and trade, civil aviation, donald trump, government and public administration, government bodies and offices, political figures - us, resignations, tom price, transportation and warehousing, us federal government, white house, scandals", "author": "Kevin Liptak,Miranda Green", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1506639600.0, "source": "http://www.cnn.com", "summary": ""}