{"url": "https://web.archive.org/web/20170602043758/https://www.billboardmusicawards.com/2017/05/nicki-minaj-is-set-to-open-the-billboard-music-awards/", "text": "AFTER BREAKING THE RECORD FOR FEMALE ARTIST WITH THE MOST BILLBOARD HOT 100 HITS, GLOBAL SUPERSTAR NICKI MINAJ IS SET TO OPEN THE “2017 BILLBOARD MUSIC AWARDS”\n\nMinaj to be joined by Lil Wayne, Jason Derulo and David Guetta\n\nfor Epic 9-Minute Performance\n\nThe “2017 Billboard Music Awards” will broadcast LIVE on BOTH COASTS from T-Mobile Arena In Las Vegas on SUNDAY, MAY 21st at 8:00 p.m. ET / 5:00 p.m. PT on ABC\n\nClick HERE for digital assets for the “2017 Billboard Music Awards”\n\nSANTA MONICA, CA (May 18, 2017) – dick clark productions and ABC today announced that multi-platinum artist Nicki Minaj will open the “2017 Billboard Music Awards“ with an epic 9-minute performance featuring special guests Lil Wayne, Jason Derulo and David Guetta. 2017 marks the fourth appearance for Minaj on the Billboard Music Awards stage, as well as her first television performance since breaking Aretha Franklin’s long-standing record for Female Artist charting the most songs on the Billboard Hot 100. Ludacris and Vanessa Hudgens will host the “2017 Billboard Music Awards along with previously announced performers on the broadcast Camila Cabello, The Chainsmokers, Miley Cyrus, Celine Dion, Drake, Florida Georgia Line, Halsey, Sam Hunt, Imagine Dragons, John Legend, Lorde, Bruno Mars, Ed Sheeran and 2017 Billboard Music Awards ICON Award recipient, Cher. The “2017 Billboard Music Awards” will broadcast LIVE on both coasts from T-Mobile Arena in Las Vegas on Sunday, May 21 at 8:00 p.m. ET / 5:00 p.m. PT on ABC.\n\nFans can still vote online and on Twitter for Billboard Chart Achievement Award Presented by Xfinity and Top Social Artist Presented by ION360. Voting for both categories will remain open until May 21, 2017 at 9:00 p.m. ET / 6:00 p.m. PT (one hour into the live broadcast).\n\nBillboard Music Awards nominees are based on key fan interactions with music, including album and digital songs sales, streaming, radio airplay, touring and social engagement. These measurements are tracked year-round by Billboard and its data partners, including Nielsen Music and Next Big Sound. The awards are based on the reporting period of March 18, 2016 through March 16, 2017. Since 1940, the Billboard charts have been the go-to guide for ranking the popularity of songs and albums, and are the ultimate measure of success in music.\n\nTickets are now on sale for the “2017 Billboard Music Awards.” Note, not all performances noted above will originate from the T-Mobile arena. To purchase tickets online, fans should go to www.axs.com or www.t-mobilearena.com.\n\nFor additional information on the “2017 Billboard Music Awards,” visit us at www.billboardmusicawards.com or check out the Billboard hub at www.billboard.com.\n\nFor the latest Billboard Music Awards (BBMAs) news, exclusive content and more, be sure to follow the BBMAs on social media and join the conversation by using the official hashtag for the show, #BBMAs.\n\nFacebook: FB.com/TheBBMAs\n\nTwitter: @BBMAs\n\nInstagram: bbmas\n\nTumblr: bbmas.tumblr.com\n\nSnapchat: thebbmas\n\nCheat Tweet: .@NICKIMINAJ is set to open the 2017 @BBMAs! Sunday at 8e/5p on ABC: bbmas.news/NickiOpen #BBMAs\n\nThe “2017 Billboard Music Awards” sponsors include ION360, Las Vegas Convention and Visitors Authority, T-Mobile and Xfinity from Comcast. Media partners include Cumulus Media | WestwoodOne and Music Choice.\n\nThe “2017 Billboard Music Awards” is produced by dick clark productions. Allen Shapiro, Mike Mahan, Mark Bracco, Barry Adelman and Robert Deaton are Executive Producers.\n\nAbout Billboard\n\nBillboard is the world’s largest voice in music, built on the most complete and well-respected database of charts across all music genres. The Billboard charts define success in music. From the iconic Billboard magazine to Billboard.com, the ultimate consumer-facing destination for millions of passionate music fans, to the industry’s most elite conference series and influencer events including the Power 100 and Women in Music – the Billboard brand has unmatched authority among fans, artists and the industry alike. Billboard has a social media footprint of 15.4 million social followers across Facebook, Twitter, Instagram, and YouTube, and created 86.9M cross-platform video views in Jan. 2017. Billboard magazine has published major news-generating covers recently including Ariana Grande, The Chainsmokers, Nicki Minaj, Future, Selena Gomez, Fifth Harmony, Migos, Justin Bieber, and an open letter to Congress signed by 180+ of the music industry’s biggest stars and executives. In December 2016, the Billboard Women in Music ceremony, which honored Madonna as Woman of the Year, was presented to a mass audience via Lifetime, the exclusive broadcast partner. In 2016, The Hollywood Reporter-Billboard Media Group acquired SpinMedia’s storied music assets Spin, Vibe, and Stereogum, establishing the world’s largest music brand by digital traffic, social reach, and audience share. Combined entity of music and entertainment properties now reaches 45 million unique visitors and one in every three U.S. millennials.\n\nAbout “2017 Billboard Music Awards”\n\nThe “2017 Billboard Music Awards” are set to return to ABC and will be broadcast live from T-Mobile Arena in Las Vegas on Sunday, May 21 at 8:00 p.m. ET / 5:00 p.m. PT. The show will showcase this year’s hottest and biggest music stars. Billboard Music Awards nominees are based on key fan interactions with music, including album and digital songs sales, streaming, radio airplay, touring and social engagement. These measurements are tracked year-round by Billboard and its data partners, including Nielsen Music and Next Big Sound. The awards are based on the reporting period of March 18, 2016 through March 16, 2017. The “2017 Billboard Music Awards” is produced by dick clark productions. Allen Shapiro, Mike Mahan, Mark Bracco, Barry Adelman and Robert Deaton are Executive Producers.\n\nAbout dick clark productions\n\ndick clark productions (dcp) is the world’s largest producer and proprietor of televised live event entertainment programming with the “Academy of Country Music Awards,” “American Music Awards,” “Billboard Music Awards,” “Dick Clark’s New Year’s Rockin’ Eve with Ryan Seacrest,” “Golden Globe Awards,” “Miss America,” “Hollywood Film Awards” and the “Streamy Awards.” Weekly television programming includes “So You Think You Can Dance” from 19 Entertainment and dcp. dcp also owns one of the world’s most unique and extensive entertainment archive libraries with more than 55 years of award-winning shows, historic programs, specials, performances and legendary programming. For additional information, visit www.dickclark.com.\n\nMedia Contacts\n\nSlate PR:\n\ndick clark productions:\n\nABC Media Relations:\n\nd.baron Media Relations, Inc\n\nCheck out the full list of 2017 winners here.", "images": ["https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2016/06/output_GOUsVx.gif", "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2017/05/12220.jpg", "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2017/05/RateREdCarpet-100x100.jpg", "https://web.archive.org/web/20170602043758im_/https://b.scorecardresearch.com/p?c1=2&c2=18157917&cv=2.0&cj=1", "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2017/05/Nicki-Minaj.jpg", "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2015/11/BBMAs-Snapchat-QR-Code.png", "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2017/05/Miley-Cyrus-Performing-BBMAs-2-620x393.png", "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/themes/basetheme15/images/dcp_logo.png", "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2017/05/Banner-SeeTheListofWinners-2400x100.jpg", "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2016/02/BBMA_KOlogo-1.png", "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2017/05/Sam-Hunt-Halsey-Chainsmokers-620x393.jpg", "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2017/05/sdfdsfds-100x100.jpg", "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2017/05/perfceline1-100x100.jpg", "https://web.archive.org/web/20170602043758im_/https://pixel.quantserve.com/pixel/p-r9s_arDXcPGbp.gif", "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2017/05/Camila-Cabello-XFINITY-620x393.jpg", "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2016/02/BBMA_KOlogo.png", "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2016/01/abc_logo.png", "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2017/05/btscarpet-100x100.jpg"], "top_img": "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2017/05/Nicki-Minaj.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170602043758/https://www.billboardmusicawards.com/2017/05/nicki-minaj-is-set-to-open-the-billboard-music-awards/", "title": "Nicki Minaj Is Set To Open The Billboard Music Awards", "meta_data": {"viewport": "width=device-width,initial-scale=1.0,user-scalable=no,minimal-ui", "fb": {"pages": 649725761716779}, "description": "Nicki Minaj will open the “2017 Billboard Music Awards“ with an epic 9-minute performance featuring special guests Jason Derulo, David Guetta and Lil Wayne.", "robots": "noodp", "og": {"locale": "en_US", "type": "article", "title": "Nicki Minaj Is Set To Open The Billboard Music Awards | Billboard Music Awards", "description": "Nicki Minaj will open the “2017 Billboard Music Awards“ with an epic 9-minute performance featuring special guests Jason Derulo, David Guetta and Lil Wayne.", "url": "https://web.archive.org/web/20170602043758/https://www.billboardmusicawards.com/2017/05/nicki-minaj-is-set-to-open-the-billboard-music-awards/", "site_name": "Billboard Music Awards", "updated_time": "2017-05-18T08:25:01-07:00", "image": {"identifier": "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2017/05/Nicki-Minaj.jpg", "width": 1200, "height": 760}}, "article": {"publisher": "http://www.facebook.com/TheBBMAs", "section": "Performers", "published_time": "2017-05-18T06:00:13-07:00", "modified_time": "2017-05-18T08:25:01-07:00"}, "twitter": {"card": "summary_large_image", "description": "Nicki Minaj will open the “2017 Billboard Music Awards“ with an epic 9-minute performance featuring special guests Jason Derulo, David Guetta and Lil Wayne.", "title": "Nicki Minaj Is Set To Open The Billboard Music Awards | Billboard Music Awards", "site": "@BBMAs", "image": "https://web.archive.org/web/20170602043758im_/https://www.billboardmusicawards.com/wp-content/uploads/2017/05/Nicki-Minaj.jpg", "creator": "@BBMAs"}, "generator": "WordPress 4.7.5", "msapplication-TileImage": "https://www.billboardmusicawards.com/wp-content/uploads/2016/01/cropped-icon_large-270x270.png"}, "movies": [], "publish_date": 1495112413.0, "source": "https://web.archive.org", "summary": ""}