{"url": "https://www.usatoday.com/story/life/people/2018/10/26/queen-elizabeth-last-corgi-dies-ending-link-iconic-breed/1776769002/", "text": "Queen Elizabeth II's last beloved corgi dies, ending her link with an iconic breed\n\nWhisper, the last corgi belonging to dog-loving Queen Elizabeth II, has died, leaving the 92-year-old monarch without one of her favorite stumpy, snappy pooches to trot by her side.\n\nBritish media reports in The Daily Mail, The Express and The Telegraph, among others, said that Whisper, who was 12, died Saturday at Windsor Castle, leaving the queen bereft of her loyal corgis, the endearing breed she has loved since her 18th birthday when she received a Pembroke Welsh corgi pup, Susan, as a gift from her father, King George VI.\n\nBut the queen is not entirely without canine companions: There are two dorgis left, Vulcan and Candy, products of the corgi-dachshund mix created when one of the queen's corgis mated with a dachshund belonging to her sister, Princess Margaret.\n\nBuckingham Palace did not immediately return an email from USA TODAY seeking confirmation, but the palace almost never says anything about the queen's private life, including her dogs.\n\nAccording to the Daily Mail's royally-plugged in columnist, Richard Kay, Whisper was adopted by the queen in 2016 after the death of his owner, Bill Fenwick, a former gamekeeper at Sandringham, the royal estate in Norfolk. Kay said the queen was left \"deeply saddened\" by Whisper's death.\n\n\"Fenwick’s late wife Nancy was known as the 'keeper of the Queen’s corgis' and always looked after the royal pets when Her Majesty was away on tours,\" Kay reported. \"Her offer to take in Whisper was seen as returning the favor.\n\n\"Over the last two years she had become especially close to Whisper who devotedly followed her from room to room throughout Buckingham Palace.\"\n\nBack in April, Kay, a longtime royal correspondent for the Mail, also broke the sad news that Willow, a 14th-generation descendant of the queen's first dog, Susan, was put down after suffering from a cancer-related illness. That, too, left the queen bereaved.\n\nThe queen's devotion to her dogs (and horses) is one of her signature characteristics that people around the world recognize, and especially her long association with the distinctive corgi breed.\n\nShort, plump, yappy and snappy, packs of them would trail her everywhere in her various palaces, hopping in and out of royal Bentleys and Rolls, and being carried up royal plane stairs by equerries.\n\nThat image of her with dogs at her feet would go viral globally in 2012 during the opening ceremony of the Summer Olympics in London, when she agreed to appear in a video spoof with Daniel \"James Bond\" Craig: Three of her corgis, Monty, Holly and Willow, were in the video, too, trotting by her side.\n\nMonty's performance was especially memorable: He greeted Craig as Bond, delivered him to the queen at her writing desk, then performed some tummy rolls for the camera. Then 13, Monty died a few months later in September 2012.\n\nIn 2015, The Telegraph reported that the queen had stopped breeding corgis (she is also famous for her horse-breeding skills) because she was getting on (she was then 89) and didn't want to leave any young dogs behind after she's gone.\n\nUsually her dogs have died due to illness or age, although one, Pharos, was killed when daughter Princess Anne's bull terrier Dotty attacked him at Sandringham during the family's Christmas holiday there in 2003.\n\nWhen she could, the queen often fed her dogs herself and took them for walks. Her children and grandchildren were known to be somewhat less enamored of the corgis: Prince William once said in an interview that their barking was too noisy.\n\n\"I don't know how she copes with it, but her private life with her dogs and her riding and her walking, it's very important to her,\" William said in a 2012 ITV documentary. \"I would just question the noise!\"\n\nPrince Harry, during an interview after announcing his engagement to Meghan Markle, pointed out that when they went to tea with the queen, her dogs loved Markle instantly while he's had to put up with years of suspicious barking.\n\n“For the last 33 years, I’ve been barked at. This one walks in, and absolutely nothing!” he said. “Just wagging tails.”", "images": ["https://www.gannett-cdn.com/presto/2018/10/26/USAT/0f5c9e23-f302-4bd7-8877-64d344f9648d-ib05_queen_dogs_03.jpg?crop=1561,1171,x0,y0?width=320&height=240", "https://www.gannett-cdn.com/presto/2018/10/26/USAT/0f5c9e23-f302-4bd7-8877-64d344f9648d-ib05_queen_dogs_03.jpg?auto=webp&crop=1796,1010,x1,y90&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/presto/2018/10/26/USAT/0f5c9e23-f302-4bd7-8877-64d344f9648d-ib05_queen_dogs_03.jpg?auto=webp&crop=1796,1010,x1,y90&format=pjpg&width=1200", "keywords": [], "authors": ["Maria Puente"], "canonical_link": "https://www.usatoday.com/story/life/people/2018/10/26/queen-elizabeth-last-corgi-dies-ending-link-iconic-breed/1776769002/", "title": "Queen Elizabeth II's last beloved corgi dies, ending her link with an iconic breed", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/people/2018/10/26/queen-elizabeth-last-corgi-dies-ending-link-iconic-breed/1776769002/life/people", "theme-color": "#ffffff", "og": {"type": "article", "title": "Queen Elizabeth II's last beloved corgi dies, ending her link with an iconic breed", "description": "Now that the last corgi, Whisper, has died, Queen Elizabeth II has only two dorgis left as canine companions.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/10/26/USAT/0f5c9e23-f302-4bd7-8877-64d344f9648d-ib05_queen_dogs_03.jpg?auto=webp&crop=1796,1010,x1,y90&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Now that the last corgi, Whisper, has died, Queen Elizabeth II has only two dorgis left as canine companions.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": ["https://www.youtube.com/embed/S0ZFBun4WMs?feature=oembed"], "publish_date": 1540508400.0, "source": "https://www.usatoday.com", "summary": ""}