{"url": "https://www.wmagazine.com/story/michelle-williams-all-the-money-in-the-world-christopher-plummer", "text": "Actress Michelle Williams isn’t afraid of a challenge, but her latest role in All the Money in the World presented a surprising one. Only a month before the film was released, director Ridley Scott replaced Kevin Spacey, after multiple allegations of sexual misconduct made against the actor, with Christopher Plummer.\n\nBoth Plummer and Williams ultimately earned Golden Globe nominations for their roles in the film, which is based on the true story of the kidnapping of J. Paul Getty III, the grandson of the wealthy oil tycoon J. Paul Getty, and was released on time after all. Here, Williams talks about the reshoot, the surprising reason she was so excited to work with Plummer, and more.\n\nTell me about your new film, All the Money in the World. What is your character like?\n\nI play Gail Getty, who was a mother of four children, one of whom was kidnapped when they were living in Rome and there was a ransom price set on his head, which would’ve been easy to come up with, given that his grandfather was John Paul Getty, but the man said no. And so I play a woman fighting to get her child back.\n\nAnd this is based on a true story.\n\nSadly, yes.\n\nDid you do a lot of research?\n\nI did, although there wasn’t that much available material. There’s a few clips on YouTube of her, and she has a very distinctive way of speaking that I spent a lot of time with and then I read a few books. The rest of it was really just a collaboration between the words on the page and the guy in charge, Ridley “The Boss” Scott. He and I had a ball together. It was actually like having a ball that he and I would just toss back and forth and sometimes the ball was slippery and sometimes the ball would go over my head – there would be multiples of them. He just keeps you on your toes in this really fun way. I really went to work every day thinking, “I don’t know? What’s he gonna do today?” It was exciting.\n\nHow did you first read the script?\n\nI was sent the script and told to read it within the next 12 hours and have an answer by the time I woke up in the morning, so I read it and I said yes and now here I am.\n\nAnd then you have the reshoots, too.\n\nIf it was anyone else other than Ridley I would say there’s no way, and it’s not going to happen, but that man lives off of excitement and he works well under pressure. Look, there’s no mountain I wouldn’t climb for Ridley. I [gave] him my Thanksgiving day, which was a hard thing to break to the family but when you’re able to tell your daughter that Captain Von Trapp is coming to save the day in real life you know they – everybody makes an exception.\n\nI have to say, I think this is such an optimistic time. It’s been so difficult to go through, ever since the election, especially to be a woman and to be raising a young woman, but I actually something has just turned around for me in like the past couple of weeks and I feel like I’m so glad to be alive right now. I feel like we’re going to create a whole new landscape for a generation of young girls like my daughter that are growing up right now.\n\nLet’s hope.\n\nI really hope.\n\nWhat is that like for you to have to go back and do a character that you said goodbye to? Because you say goodbye to these characters, right?\n\nIn some way I suppose you do, but in some way I feel all of my girls, all of my women, still sort of bubbling up inside of me. Sometimes I feel them and I’ll think like, “Oh god, Marilyn came out a little bit then,” and I’m like, “There she is. There’s Gail still kicking around inside of me.”\n\nGal Gadot, Emma Stone, Margot Robbie, and More Are the Best Performances of the Year Jennifer Lawrence wears Dior dress; Dior Fine Jewelry earrings, and ring. Beauty: Dior. Emma Stone wears Louis Vuitton dress. Beauty: L’Oréal Paris. Photographs by Juergen Teller. Styled by Edward Enninful. Set design by Peter Klein at Frank Reps. Hair for Lawrence by Jenny Cho at Starworks Artists. Hair for Stone by Mara Roszak at Starworks Artists. Makeup for Lawrence by Genevieve Herr. Makeup for Stone by Rachel Goodwin at Streeters. Manicures by Michelle Saunders for Essie at Forward Artists. Gal Gadot wears Giorgio Gadot wears Giorgio Armani jacket; Fabergé necklace; her own earring. Beauty: Revlon. James Franco wears Giorgio Armani jacket, shirt, and bow tie. Photographs by Juergen Teller. Styled by Edward Enninful. Set design by Peter Klein at Frank Reps. Hair for Gadot and Franco by Yusef for Rich Hair Care at Factory Downtown; Makeup for Gadot and Franco by Fulvia Farolfi for Chanel; Manicures by Michelle Saunders for Essie at Forward Artists. Daniela Vega wears Salvatore Ferragamo dress; Tiffany & Co. earrings; Gianvito Rossi shoes. Beauty: Covergirl. Robert Pattinson wears Dior Homme tuxedo, shirt, and bow tie. Photographs by Juergen Teller. Styled by Edward Enninful. Set design by Peter Klein at Frank Reps. Hair for Vega and Pattinson by Yusef for Rich Hair Care at Factory Downtown; Makeup for Vega, Pattinson by Fulvia Farolfi for Chanel; Manicures by Michelle Saunders for Essie at Forward Artists. Marbot Robbie wears Louis Vuitton dress; Wing & Weft Gloves gloves. Beauty: Lancôme. Nicole Kidman wears Dior dress; Wing & Weft Gloves gloves. Beauty: Neutrogena. Photographs by Juergen Teller. Styled by Edward Enninful. Set design by Peter Klein at Frank Reps. Hair for Robbie by Yusef for Rich Hair Care at Factory Downtown. Hair for Kidman by Mara Roszak at Starworks Artists; Makeup for Robbie by Pati Dubroff at Forward Artists; Makeup for Kidman by Fulvia Farolfi for Chanel; Manicures by Michelle Saunders for Essie at Forward Artists. Tom Hanks wears Tom Ford suit; Emma Willis shirt; Hanks’s own jewelry. Mary J. Blige wears Versace dress; Chopard earrings; De Beers ring. Beauty: MAC Cosmetics. Photographs by Juergen Teller. Styled by Edward Enninful. Set design by Peter Klein at Frank Reps. Hair for Blige by Randy Stodghill at Opus Beauty; Makeup for Blige by D’Andre Michael; Grooming for Hanks by Barbara Guillaume at Forward Artists; Manicures by Michelle Saunders for Essie at Forward Artists. Saoirse Ronan wears Chanel dress; Tiffany & Co. earrings; Jimmy Choo pumps. Beauty: Chanel. Andrew Garfield wears Prada suit and top; Converse sneakers. Photographs by Juergen Teller. Styled by Edward Enninful. Set design by Peter Klein at Frank Reps. Hair for Ronan and Garfield by Yusef for Rich Hair Care at Factory Downtown; Makeup for Ronan and Garfield by Fulvia Farolfi for Chanel; Manicures by Michelle Saunders for Essie at Forward Artists. Photographs by Juergen Teller; Styled by Edward Enninful “This year on Halloween, my daughter and I went trick-or-treating, and I had on this huge mask so I could see everyone but they couldn’t see me. Whenever I saw a Wonder Woman costume on a girl or a boy, it was so exciting. My daughter, who was dressed as a unicorn zombie, would run up to me and say, “Did you see that Wonder Woman?” They were everywhere!” Gal Gadot wears Moschino Couture dress; Fabergé ring; Off-White c/o Jimmy Choo shoes. Photographs by Juergen Teller; Styled by Edward Enninful “[Jennifer Lawrence] came to see Cabaret and both of my contacts popped out of my eyes at the same time and my prescription is -900, which, if you know what that means, is like…I cannot see. So, they had to drag me off the stage in the dark and she came backstage afterwards and I was like, ‘I couldn’t see anything! It was garbage! It was a disaster!’ And she was like, ‘Enough, enough. I’m your dance mom. You need to calm down.’” Emma Stone wears a Louis Vuitton dress; Cartier earrings. Photographs by Juergen Teller; Styled by Edward Enninful “I am Vietnamese, and we don’t celebrate birthdays. My parents don’t actually know their birth dates—they just go by their signs. When somebody asks you how old you are, you say, ‘I’m born this month in the Year of the…’ I was born in the Year of the Sheep. Sheep don’t like to be the center of attention, and they don’t like being told what to do. That pretty much sums me up.” Hong Chau wears an Etro dress; Chanel Fine Jewelry earrings; Tiffany & Co. ring. Photographs by Juergen Teller; Styled by Edward Enninful “I’ve had a flirtation with Winston Churchill for years; there’s been a book of famous Churchill quotes on my bookshelf since childhood. To me, he was the man who won the war. And yet, when I was first asked to play the part, I thought, Don’t be ridiculous, and turned it down. But they came back, and it felt right. My wife said, ‘Look, you get to stand in Parliament and say these great words. What have you got to lose?’” Gary Oldman wears a Canali suit; Boss shirt and tie. Photographs by Juergen Teller; Styled by Edward Enninful “I always joke that Jason Dixon, the character I play in Three Billboards, is Barney Fife meets Travis Bickle. I spent a lot of time trying to perfect his southern Missouri accent. I did ride-alongs with a cop down there—he had a great twang. Accents should be practiced as if you’re drunk. Actors get a little tense when they have to do an accent. Drunkenness relaxes everything.” Sam Rockwell wears a Marni trench; Editions M.R shirt; Simon Miller T-shirt; Huntsman pants; Rolex watch; Church’s shoes. “My character in The Meyerowitz Stories is a sweet family girl, but when she sends films she makes in school to her family, you see her wild side. I’m naked in most of those films. I sat next to my dad at the premiere, and that was probably the most uncomfortable thing in my life. To see myself 75 feet tall and naked was not easy. I sank into my chair and heard my dad kind of laugh nervously. We pretended those scenes never happened.” Grace Van Patten wears an Alberta Ferretti dress; her own jewelry. Photographs by Juergen Teller; Styled by Edward Enninful “Being an actress, for me, is about my own transition. It’s about looking for answers. It’s about trying to survive in my life and also for the lives of others who face similar challenges. Life is scary, but art is not scary.” Daniela Vega wears a Max Mara dress; David Webb earrings; Piaget necklace; Chanel Fine Jewelry ring (right hand); Tiffany & Co. bracelet and ring (left hand); Gianvito Rossi shoes. Photographs by Juergen Teller; Styled by Edward Enninful “My husband is an artist, but he still has a hard time watching me sometimes. During The Killing of a Sacred Deer at the Cannes Film Festival, he was both hypnotized and shattered. When he hears me scream or cry from a certain place in my soul, it’s almost like it goes straight into him. His brain and heart don’t discern between acting and real life.” Nicole Kidman wears a Prada top and skirt; Chanel Fine Jewelry ring; Jimmy Choo pumps. Photographs by Juergen Teller; Styled by Edward Enninful Where was your first kiss? This is going to sound like a murder story, but it was in the woods, outside of a baseball park. I had lost my turtle. Curtis, the guy I kissed, found it. Was that your first pet? No, it was a schnauzer named Ozzie. He hated us so much. He never wanted to be in the same room with us. So what’s your porno name—first pet plus first street name? Ozzie Ormond. What was your favorite Halloween costume? A picnic table. My mom wouldn’t let me be a witch or a ghost or anything demonic, so I cut a hole in a plastic cloth and went as a picnic table. The problem was I had a crush on this guy named John, and I was so pumped for Halloween because it was our chance to interact. And then I put my face in the tablecloth and was like, “Hi, John. Are you my boyfriend?” Jennifer Lawrence wears a Dior dress; Dior Fine Jewelry earrings and ring. Photographs by Juergen Teller; Styled by Edward Enninful “When I first read the script for Get Out, I thought, Are you allowed to do this? Are they really going to let this black guy kill all these white people? I think the most fascinating art pieces come at a price to the person making them. And this movie took a risk. On opening night, I went to see it in a theater in the hood in Atlanta. The crowd clapped, they cheered, they yelled, ‘Get out, man! Yo—get out!’ It was all the stuff that we hoped the audience would say.” Daniel Kaluuya wears a Gosha Rubchinskiy x Adidas Football sweatshirt and sweatpants; ’47 hat; Gucci socks; Kaluuya’s own sneakers. “I booked The Florida Project when I was 6. I’m 7 now. It was really fun because during shooting I got to eat ice cream! I want to start my own YouTube channel, and the name of it will be I Am Crazy for Ice Cream because I am crazy for ice cream. I’m also so into fashion. I wear shorts in the movie, and they were so short. It was a struggle getting them on. Now, I’m like, ‘Mom! Where are my skirts? No more shorts!’” Brooklynn Prince wears a Baby Dior dress; La Coqueta shoes. Photographs by Juergen Teller; Styled by Edward Enninful “I’m naked quite a lot in Beach Rats, and it’s a little strange to act when you’re naked. When the boom operator is standing over you, and you’re not wearing anything, it’s awkward. But, in the end, I didn’t find it difficult. I’m pretty comfortable with my body. Not in an ‘I’m happy to flaunt it for £5’ kind of way, but it does go deep into the psychology of someone trying to figure out their own sexuality, and their identity.” Harris Dickinson wears a Calvin Klein 205W39NYC shirt, pants, and boots. Photographs by Juergen Teller; Styled by Edward Enninful “As an actor, people put you in categories. It’s ‘Oh, she has an accent,’ or ‘She doesn’t have an accent,’ or ‘She can do this accent,’ or ‘No, she can’t.’ They’ll say, ‘She’s a pretty blonde, so I don’t know if we can see her in a comedy.’ So I know that for Fatih Akin to pick me was a big risk because he’s very well known in Germany as a director who casts unknowns or people he discovers who are not actors at all. In the beginning, he got a lot of backlash for it. And, in truth, I don’t think I could have played this character five years ago. Now I’m ready to shed any beauty look. I want to be stripped of any pretense, of any glamour.” Diane Kruger wears a Rosamosario romper; Christian Louboutin shoes. Photographs by Juergen Teller; Styled by Edward Enninful “When I was 14, I auditioned for an Off Broadway play. The scene was about a bris, the Jewish tradition of a child having the tip of his penis snipped off. Being the nice Jewish kid that I was, I did not know what a bris was, and I decided to pronounce it brie. Bris as brie. So I did the monologue, and, at the end, the director said, ‘Thank you very much, and it’s pronounced bris.’ I did not get the part.” Ben Stiller wears a Gucci coat; Olatz pajamas. Photograph by Juergen Teller; styled by Edward Enninful “When I was 6, my favorite film was Robin Hood: Men in Tights. It’s got a lot of adult jokes, and it was really inappropriate for a child to see. In school, they asked us, ‘If you were to make a potion, what would you put in it?’ Even then, I could recall lines of movies, and I said, ‘The testicles of a newt!’ I got called up to the front of the class and was asked why I put testicles in my potion. I had no idea what testicles were—I just loved the film.” Margot Robbie wears a Dolce & Gabbana top, shorts, and shoes. Photographs by Juergen Teller; Styled by Edward Enninful “I was late to the game on The Room, which is considered by many to be the worst movie of all time. For years, I would see this billboard in L.A. that Tommy Wiseau, the actor and star of the movie, had paid to have up on Highland Avenue. It was a picture of him, sort of glaring down at you, with the words THE ROOM and a phone number. I was like, ‘What is this? Do you call the number and this crazy, weird, vampirelike guy can be in your movie?’ But then I started reading The Disaster Artist, which was written by one of the other actors in the movie, and before I was halfway through, I just knew it was such an incredible, bizarre story, unlike any other in Hollywood, about outsider artists trying to achieve their dreams. I was instantly drawn to Tommy. It’s almost like we were made for each other.” James Franco wears a Balenciaga shirt; his own pants. Photographs by Juergen Teller; Styled by Edward Enninful “To play Molly Bloom, I thought about what women have to become in order to find power in a society where men are making all of the rules. I was like, ‘Oh, my gosh—the Kardashians are an incredible example of women who have their own sense of entrepreneurial power.’ And in real life, Molly looked a lot like them. For research, I actually watched Kim’s tutorial on face shading and contouring. As the movie goes on, Molly transforms into this idea of what a woman has to be in order to be heard: The heels get higher, the necklines are lower, the hair is longer. It was quite a departure for me, physically. And the strange thing is, I don’t look like myself at all in this film, and so many people have said to me that I’ve never looked better.” Jessica Chastain wears an Oscar de la Renta dress; Sophie Buhai earrings. Photographs by Juergen Teller; Styled by Edward Enninful “Until I read the script for Lady Bird, I had never encountered a female heroine who very much sees herself as a female heroine. In films, you rarely see young girls who love themselves. Lady Bird takes the self-confidence thing to a new level. She knows she’s going to be someone. And she has something to say, even if she doesn’t quite know what it is yet.” Saoirse Ronan wears a Chanel dress. Photographs by Juergen Teller; Styled by Edward Enninful Did you have an audition outfit back when you were starting out? I had multiple outfits. Much like a costume box. I would change between auditions. I remember changing in the car on the freeway. I’m still a fast changer. And discreet. I have a talent for taking my clothes off quickly. What was your first favorite film? The Sound of Music. It was very influential. And I got to meet Captain von Trapp while filming All the Money in the World [Christopher Plummer replaced Kevin Spacey after Spacey was pulled from the project]. We were about to be in this movie together, and I thought, How soon is too soon to ask Christopher Plummer to sing “Edelweiss” into my phone for my daughter? Michelle Williams wears a Louis Vuitton dress. Photographs by Juergen Teller; Styled by Edward Enninful “I play real people a lot. And it is a huge responsibility. Anytime you are playing somebody who was alive, for good or for bad, that performance becomes a version of an official record of what happened: what motivated them, what obstacles they faced, and how they got through their particular struggle. There’s a degree of leeway that you can allow yourself as long as you’re not turning good guys into bad guys, or knowledge into ignorance. Having said that, it’s a little easier playing someone who’s no longer living. Because then you don’t have to meet them.” Tom Hanks wears a Tom Ford suit, vest, and shoes; Boss shirt; Rolex watch. Photographs by Juergen Teller; Styled by Edward Enninful “I had a successful soap opera career in Mexico, but I left my fame and my comfort and I moved to Los Angeles because I wanted to make films. I was very, very famous in Mexico, and in the States I was working as an extra. People thought maybe I was running from the police. Why else would I leave everything I had to play a maid? I told them, ‘This industry is going to change. We are too strong of an economic force to be ignored forever.’” Salma Hayek wears a Saint Laurent by Anthony Vaccarello dress; Cartier earrings. Photographs by Juergen Teller; Styled by Edward Enninful “I was loosely attached to Call Me by Your Name for four years. It never seemed like it was coming together, and then it did. Now I’ve spent nearly two years promoting it. So, in many ways, it will be the project of my youth. When I’m older, I’ll look at this film and remember what it was like to not be jaded, old, and washed up. I’ll look back and say, ‘Oh, when I was young…’” Timothée Chalamet wears a Sandro jacket and pants; Schiesser tank top; Sermoneta Gloves gloves; Calvin Klein 205W39NYC boots. “My first kiss was at a party, when I was 12 or 13, during my first term at a coed school, so, you know, hormones were raging. A girl named Dora had this party when her parents were out of town, and it was literally a bacchanalia for 13-year-olds. No one was having sex, but it was just like, ‘Oh, we all get to kiss each other.’ And there were around 200 people there. It was about five hours of everyone going, ‘Have we made out yet? No? Let’s go!’ To this day, my friends and I will be in a pub or at dinner and say, ‘Remember Dora’s party?’ and sigh. It was an awakening.” Andrew Garfield wears a Shrimps coat; Michael Kors sweater; Sunspel sweatpants. Photographs by Juergen Teller; Styled by Edward Enninful INFO 1/30\n\nDid you like auditioning when you were starting out as an actress?\n\nMan, what a nightmare. That was so rough. It was you know demoralizing. You see the same group of girls and you just feel like talk about a pack, you just travel around in this pack and it seems like nobody ever gets to break out of the pack. I auditioned for two years without getting a part. I was young, too, so at that point that was like a fifth of my life had been spent experiencing rejection, so I think that was hard to tolerate as a kid.\n\nDid you have an audition outfit?\n\nI had multiple outfits much like the costume box. I would change in between auditions. I remember changing in the car on the freeway and I’m still a very fast changer and I’m a discreet changer because of it. I have a talent for taking my clothes of quickly.\n\nWhat was the moment you knew you made it?\n\nI feel like I’m still waiting for it. I feel like I’m still waiting for the moment of you’ll always have work and you’ll always have a community and this whole thing isn’t about to be sort of pulled out from underneath you. It’s a funny thing to have a career or profession where, as you age, you aren’t really necessarily allowed to harness all of that growth and all of that knowledge, like you’re starting to understand what you do while at the same time your ability to do what you do is diminishing, so it’s a very funny. It’s hard to have a sense of security in a job like that.\n\nWhat was your first job?\n\nI served soft serve at the fair. I gave everybody bigger cones than should’ve been allowed. I thought that it would make them happy but instead they were like, “What is this? Like I can’t even hold this unwieldy thing.” It turns out people don’t want like a ton of ice cream.\n\nWhat was the first movie that you loved?\n\nMy parents were really conservative and we weren’t allowed to watch very much, so The Sound of Music is the movie that I’ve probably seen the most in my life, because it was just about the only thing that my parents condoned that I also wanted to watch, so that was probably the most influential film that I watched growing up, and now I’m going to meet Captain Von Trapp.\n\nDo you have a favorite song from The Sound of Music?\n\nMaybe “Edelweiss.” It’s so sad at the end when they sing it like that gets it really gets to the heart of it. Now that we’re gonna be in this movie together, I said to a friend of mine, “How soon is too soon to ask Christopher Plummer to sing ‘Edelweiss’ into my phone for my daughter?” and my friend said, “Well. maybe you should take him out to dinner first,” and as soon as I told [my daughter] Matilda what was happening she said, “Can you get him to? Can we sing with him? I need to meet him immediately and will he sing with us.”\n\nWatch: Michelle Williams Could Sleep Under a Banner of Barbra Streisand’s Face", "images": ["https://imgix.bustle.com/wmag/2018/01/02/5a4bb54bf46871653c88dbac_0218.w.bestperformances.lo9_.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54c3588bb70c4d940a2_0218.w.bestperformances.lo13.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54ff46871653c88dbb6_0218.w.bestperformances.lo22.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54af46871653c88dbaa_0218.w.bestperformances.lo6_.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54ff46871653c88dbb7_0218.w.bestperformances.lo21.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54f3588bb70c4d940a6_0218.w.bestperformances.lo23.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54bf46871653c88dbad_0218.w.bestperformances.lo10.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb55081a7cd57a08913f8_0218.w.bestperformances.lo25.jpg?w=375&h=500&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.6955074875207987&fp-y=0.3047375160051216", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb5493588bb70c4d9409a_0218.w.bestperformances.lo5_.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4beea23588bb70c4d940c3_0218.SAOIRSEANDREW.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54e3588bb70c4d940a4_0218.w.bestperformances.lo18.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54981a7cd57a08913eb_0218.w.bestperformances.lo_.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb5493588bb70c4d9409b_0218.w.bestperformances.lo4_.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54c81a7cd57a08913ef_0218.w.bestperformances.lo12.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4beea1f46871653c88dbf6_0218.DANIELAROB.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb550f46871653c88dbba_0218.w.bestperformances.lo26.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54d81a7cd57a08913f2_0218.w.bestperformances.lo16.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54a3588bb70c4d9409e_0218.w.bestperformances.lo8_.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/8/29/9f122c0b-8ad0-4d04-b2cf-3379547870db-tswifty.jpeg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.532&fp-y=0.228", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54cf46871653c88dbb0_0218.w.bestperformances.lo14.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4beea281a7cd57a089144b_0218.TOMMARY.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54e81a7cd57a08913f5_0218.w.bestperformances.lo19.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4beea03588bb70c4d940bf_0218.JENEMMA.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4beea23588bb70c4d940c1_0218.MARGONICOLE.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/wmag/2018/01/02/5a4beea181a7cd57a0891449_0218.GALJAMES.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54b3588bb70c4d940a0_0218.w.bestperformances.lo11.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/10/5/47b5fa0f-fc48-4cb1-9604-6f5821fa832d-getty-1430611960.jpg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5093&fp-y=0.3502", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb55081a7cd57a08913f7_0218.w.bestperformances.lo24.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54ff46871653c88dbb6_0218.w.bestperformances.lo22.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54df46871653c88dbb2_0218.w.bestperformances.lo17.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54a81a7cd57a08913ed_0218.w.bestperformances.lo7_.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54d81a7cd57a08913f1_0218.w.bestperformances.lo15.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54ef46871653c88dbb4_0218.w.bestperformances.lo20.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54ff46871653c88dbb6_0218.w.bestperformances.lo22.jpg?w=414&h=538&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54ff46871653c88dbb6_0218.w.bestperformances.lo22.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wmagazine.com/story/michelle-williams-all-the-money-in-the-world-christopher-plummer", "title": "Michelle Williams on Reshooting “All the Money in the World” with Christopher Plummer", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@wmag", "card": "summary_large_image"}, "article": {"publisher": "https://www.facebook.com/wmagazine"}, "og": {"site_name": "W Magazine", "url": "https://www.wmagazine.com/story/michelle-williams-all-the-money-in-the-world-christopher-plummer", "type": "article", "title": "Michelle Williams on Reshooting \"All the Money in the World\" with Christopher Plummer", "description": "\"If it was anyone else other than Ridley I would say there's no way, and it's not going to happen.\"", "image": {"identifier": "https://imgix.bustle.com/wmag/2018/01/02/5a4bb54ff46871653c88dbb6_0218.w.bestperformances.lo22.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "\"If it was anyone else other than Ridley I would say there's no way, and it's not going to happen.\""}, "movies": [], "publish_date": null, "source": "https://www.wmagazine.com", "summary": ""}