{"url": "https://www.freep.com/story/life/shopping/georgea-kovanis/2018/01/07/black-golden-globes/1004455001/", "text": "Is wearing black to the Golden Globes in protest of sexual harassment really that big of a deal?\n\nShow Caption Hide Caption Gadot, Ronan, celebrate Time's Up movement At the Palm Springs International Film Festival, actress Gal Gadot says she wants the Time's Up movement to cause a \"cultural change,\" while Mary J. Blige, Holly Hunter and Allison Janney say they will wear black to the Golden Globes to show solidarity. (Jan. 3) AP\n\nBecause Sunday's Golden Globes is taking place in a nation is reeling from #MeToo disclosures, the women — and men — attending the annual 75th annual Hollywood awards ceremony have decided to do something they think will be special: Wear black to show their disdain for sexual harassment and misconduct, as well as to support its victims.\n\nAfter all, Hollywood has, albeit unwittingly, played a huge role establishing nation's new anti-harassment sentiment. Which was brought on by the #MeToo movement. Which gained steam after a New York Times investigation, and a follow-up by The New Yorker, documented years and years of alleged sexual harassment and assault by one of their own: Oscar-winning producer Harvey Weinstein.\n\nSince then, a number of powerful men in the arts, entertainment, media, restaurant and political industries have been similarly accused and, in some cases, fired from their jobs.\n\nIts true, actors and actresses — many of whom have gone to great lengths to distance themselves from Weinstein lest, perhaps, their own careers be ruined — have the visibility and audience that allows them to deliver messages to millions of people.\n\nAnd yet, I can't figure out how wearing black to the Golden Globes will send any sort of powerful message.\n\nIt doesn't seem like much of an effort — in fact it seems rather business-as-usual. Plenty of people already wear black to the event.\n\nLast year, Amy Adams, Mandy Moore, Winona Ryder, Kathryn Hahn, Blake Lively, Kristen Bell and Meryl Streep were among those who chose what InStyle magazine gushingly dubbed \"not so basic black.\" In fact, black was such a popular choice ABC News declared on its website that \"Black is Back on the Red Carpet.\" Several women, including Streep, said they will wear black again on Sunday.\n\nAnd few men ever wear anything other than a black tuxedo, though I guess they could amp up their message by switching out their usual white tuxedo shirts for black ones.\n\nBy the way, there's been no word on whether Casey Affleck will wear black again this year. Affleck — who won last year's best performance by an actor in a motion picture drama award or \"Manchester by the Sea\" — was sued by a producer and cinematographer for sexual harassment on a previous film. The lawsuits were settled out of court.\n\nHowever Dwayne (The Rock) Johnson, Tom Hiddleston, and Armie Hammer are scheduled to dress in black.\n\nIn a report published in the Washington Post, actress Eva Longoria said the biggest impact from wearing black will be felt during red carpet interviews. “Instead of asking us who we’re wearing, they’ll ask us why we’re wearing black,'' Longoria said. \"We’re using that platform and using our voices to say we can change this ideology, and shatter the sexism that teaches men that women are less.”\n\nBut no matter what their voices say, I will look at their black dresses and suits and think about how black is a color that is without risk because it's always appropriate. At funerals, weddings, dinner parties, business meetings you will never go wrong wearing black — there's a reason the little black dress is a fashion icon. It blends so easily into the background. It is an easy choice and a safe choice.\n\nI will wonder if Hollywood is playing it too safe and easy, too.\n\nBecause risk is what creates change.\n\nAnd without change, the Harvey Weinsteins of the world — and there are lots more out there — will continue their reign of power.\n\nContact Georgea Kovanis: gkovanis@freepress.com\n\n75th annual Golden Globes\n\n8 p.m. Sun. (preshow at 7 p.m.)\n\nNBC", "images": ["https://www.gannett-cdn.com/-mm-/477e25251ddce8ce8052b2317e3be6391b4be151/c=0-750-1992-1876/local/-/media/2018/01/05/DetroitFreeP/DetroitFreePress/636507682878447249-AP-Washington-D.C.-Premiere.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/29906170001/29906170001_5701082719001_5701066795001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/477e25251ddce8ce8052b2317e3be6391b4be151/c=0-750-1992-1876/local/-/media/2018/01/05/DetroitFreeP/DetroitFreePress/636507682878447249-AP-Washington-D.C.-Premiere.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Georgea Kovanis"], "canonical_link": "https://www.freep.com/story/life/shopping/georgea-kovanis/2018/01/07/black-golden-globes/1004455001/", "title": "Is wearing black to the Golden Globes in protest of sexual harassment really that big of a deal?", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=904023476, app-argument=https://www.freep.com/story/life/shopping/georgea-kovanis/2018/01/07/black-golden-globes/1004455001/life/shopping/georgea-kovanis", "theme-color": "#ffffff", "og": {"title": "Is wearing black to the Golden Globes in protest of sexual harassment really that big of a deal?", "description": "Actors and actresses have visibility that enables them to deliver messages to millions of people. But will wearing black do the trick?", "site_name": "Detroit Free Press", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/477e25251ddce8ce8052b2317e3be6391b4be151/c=0-750-1992-1876/local/-/media/2018/01/05/DetroitFreeP/DetroitFreePress/636507682878447249-AP-Washington-D.C.-Premiere.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "description": "Actors and actresses have visibility that enables them to deliver messages to millions of people. But will wearing black do the trick?", "twitter": {"site": "@freep", "creator": "@freep", "card": "summary_large_image"}}, "movies": [], "publish_date": 1515283200.0, "source": "https://www.freep.com", "summary": ""}