{"url": "https://www.independent.co.uk/extras/indybest/fashion-beauty/best-online-beauty-retailers-beauty-pie-cult-beauty-space-nk-birchbox-9158731.html", "text": "Sign up to our free weekly newsletter for insider tips and product reviews from our shopping experts Sign up for our free IndyBest email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyBest email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nIn recent years, many of us have turned to online shopping out of sheer convenience but ever since the first lockdown began in March 2020, it’s become somewhat of a necessity, prompting us to scour the web for just about everything, including beauty essentials.\n\nThere was once a time when shopping online for beauty products posed a serious challenge but thanks to advances in virtual shade-matching tools and consumer reviews, now you can easily buy everything from foundation to face powder, serums and brushes with confidence.\n\nJust as the number new and innovative launches surges at a staggering rate each month, so too has the number of places we can buy them online, meaning you can get access to millions of beauty products from the comfort of your home and have them delivered directly to your front door.\n\nWith so many retailers to choose from, it can be hard to know where to start if you're looking to buy cosmetics or skincare online.\n\nRead more: 9 best hair dryers to make every day a good hair day\n\nOur round-up only features retailers with sites that are easy to use; including both larger stores with wide ranges and niche options that deliver on their specialism, like natural skincare, for example.\n\nWhether you're looking to stock up on old favourites or to try something new, these beauty heroes are sure to get you in the mood for some online splurging.\n\nYou can trust our independent reviews. We may earn commission from some of the retailers, but we never allow this to influence selections, which are formed from real-world testing and expert advice. This revenue helps us to fund journalism across The Independent.\n\n(All Beauty/Elemis)\n\nLaunched in 2004, All Beauty is the go-to site for discounted beauty products. Ideal for savvy shoppers, the site sells all the best big beauty brands at the lowest possible price with everything from fragrance and skincare to haircare up for grabs. They also offer a price match service against retailers like Boots, Debenhams, Harrods and Superdrug.\n\nVisit shop\n\n(ASOS/Glam Glow)\n\nYou might know Asos as a go-to destination for fashion but it now also has its very own collection of in-house beauty products, which can be found in the Asos beauty section as Asos Face + Body. As well as its own make-up and skincare, which includes lipsticks, highlighters and budge-proof eyeliners, it also sells products from a number of leading brands including Smashbox, Bobbi Brown, Clinique and Illamasqua.\n\nVisit shop\n\n(Beauty Bay/Allies of Skin)\n\nMore than a retailer, Beauty Bay is packed with make-up tutorials, colour trend reports and tried and tested reviews. With more than 10,000 products available from the very best UK and international brands – think Illamasqua, Sigma and Anastasia Beverly Hills – you’ll be hard pressed to leave this site empty handed. The extensive navigation bar at the top the site helps you find everything you need, from the latest launches to the brands you love.\n\nVisit shop\n\n(Beauty Pie)\n\nThe brainchild of Marcia Kilgore, the beauty buff behind brands like Bliss Spa and Soap & Glory, Beauty Pie is about to revolutionise the way you buy make-up. The digital-only make-up brand cuts out the middleman and the mark-ups, allowing you to buy direct from factories that also supply the majority of luxury beauty brands. There are a number of different memberships available, with the cheapest costing £5 a month, for which you’re given a shopping allowance of up to £50 retail price but you only pay factory cost. It’s not just cosmetics on offer either, with everything from fragrance to body care up for grabs. Where do we sign up?\n\nVisit shop\n\n(Benefit)\n\nAmerican brand Benefit began when identical twins Jean and Jane Ford opened a small beauty boutique in San Francisco back in 1976. Their entire approach was one of fun with kitsch packaging and quirkily named products that were an escape from other cosmetics brands of the time – a practice the brand still adheres to today. If perfect eyebrows are your thing, Benefit should be your go-to destination.\n\nVisit shop\n\n(Birchbox)\n\nBirchbox is best known for its hugely popular beauty subscription service which offers a selection of skin, hair, and makeup treats to your door. The bespoke service asks you to complete a beauty questionnaire so it can provide you with personalised mini make-up, skincare, body and hair care products, vowing never to send the same item twice. The website also has an online store with access to full sized items from the likes of Sand & Sky, Pixi, Benefit and REN.\n\nVisit shop\n\n(Boots)\n\nThe UK’s leading pharmacy-led health and beauty retailer, Boots aims to “help customers look and feel better than they ever thought possible.” The website sells products from leading products such as No7 and Nars as well as beauty electricals from Tresemme and Dyson. It’s also just one of two UK retailers to stock Rihanna’s Fenty Beauty and Fenty Skin. Even better, if you order online by 8pm you can collect your purchases for free the very next day at a store near you.\n\nVisit shop\n\n(Charlotte Tilbury)\n\nAfter more than 20 years working as a make-up artist, Charlotte Tilbury has put every tip and trick she’s learned along the way into her make-up and skincare line, which debuted in the UK in 2013. Available on her eponymous website, Tilbury offers everything from foundation and mascara to moisturisers and ready-made gifts for the beauty obsessive in your life. The website also has a handy “How-to” section where you can follow make-up tutorials for a number of different looks.\n\nVisit shop\n\n(Cult Beauty)\n\n“Top Rated”, “Exclusives” and “New In” are just some of the ways you can filter the cherry-picked beauty products on Cult Beauty. “Our mission is to demystify the beauty industry, combining consumer trials with the vast knowledge of our expert panel to filter out the blaggers and braggers from the gems that do what they say on the tin. The result is a beauty hall of fame – you can shop in the knowledge that anything you buy will be outstanding.” Big claims, but they are well and truly substantiated with some real beauty corkers up for grabs. Brands sold on the site include Huda Beauty, Olaplex, Paula’s Choice and The Ordinary.\n\nVisit shop\n\n(Escentual)\n\nIf you’re after a bit of luxury, Escentual should be your got-to, one stop shop. Founded in 2000, the site brings more than 9,000 products to its customers across a range of high-end brands including Dior and Burberry. Whether it’s make-up, skincare, hair care of fragrance you’re after, you’re guaranteed to find it all here.\n\nVisit shop\n\n(Feel Unique)\n\nWith over 30,000 products at your fingertips across 500 brands, Feel Unique has something for everyone and at every budget, from high street favourites like Maybelline to high end cult brands like Burberry and By Terry. In addition to a plethora of products, Feel Unique also features honest reviews and insider tips so you can know as much as possible about an item before you purchase it. We also like the fact that when you spend over a certain amount, you can add samples to your order so you can try before you buy.\n\nVisit shop\n\n(Fenty Beauty)\n\nIn 2017, Rihanna launched the highly-anticipated make-up line Fenty Beauty and it has since become a huge hit amongst beauty aficionados. Championing diversity, the line targets women of all skin tones with 50 different hues of foundation, putting other big companies to shame by highlighting their lack of diversity. The make-up line includes lip products, bronzers, face powders and mascara. In 2020, Rihanna launched skincare too, under the umbrella brand Fenty Skin, which includes a cleanser, moisturiser, SPF, toner and serum.\n\nVisit shop\n\n(Glossier)\n\nGlossier is one of the first make-up brands to be born out of social media and was launched by Emily Weiss in 2014. But, if there's one brand that's proved it's worth the hype, this is it. From its instantly recognisable millennial pink packaging to its back to basics skincare and no-make-up make-up, Glossier has launched many cult products since its inception including its lash slick mascara, you perfume and best-selling boy brow eyebrow, which thickens and grooms eyebrows. Each delivery also comes with a handy pink pouch to protect your products but, in a bid to become more sustainable, the brand now gives customers the choice of its traditional packaging or biodegradable peanuts.\n\nVisit shop\n\n(Glossybox)\n\nOne for the serious beauty lover, Glossybox allows you to test out new products every month without having to splurge. The service sends a collection of surprise beauty products from brands like Becca Cosmetics, Caudalie, Givenchy and Sarah Chapman directly to your door for just £11.75. The monthly subscriptions comes in three, six, or 12 month plans.\n\nVisit shop\n\n(Bobbi Brown)\n\nA department store that’s been around for more than 150 years, House of Fraser offers an extensive range of beauty products for both men and women. As well as make-up and skincare, the website also sells haircare, tools and fragrances across a number of high-end brands including Chanel, La Mer, Clinique and Elemis. If you’re not sure what to buy, the website also has a great “Beauty Spotlight” section which helps you discover the latest beauty must-haves loved by industry professionals and bloggers alike.\n\nVisit shop\n\n(Look Fantastic)\n\nLookfantastic has over 14,000 products from more than 350 brands available on its site across hair, make-up, fragrance and men; there really is something for everyone here. The site is super-easy to navigate and even allows you to search by brand. We also love the fact that it has introduced the Beauty Box; a monthly subscription which means you can take home premium beauty treats worth over £60 for just £13 a month.\n\nVisit shop\n\n(Love Lula)\n\nWith more rosettes for organic, soil association, natural health and green parenting than you can shake a muddy stick at, this is the place to go for natural beauty. Fifteen years ago it was hard work to get hold of natural organic products, you had to really know your stuff and know where to look. Now we have Love Lula that only sells natural and organic. It insists on “no sodium lauryl sulfates, no parabens, no animal testing”, but products “must be effective, luxurious and guilt-free.” Shop the likes of Antipodes, By Sarah London, Dr. Hauschka and Kure Bazaar.\n\nVisit shop\n\n(Lush)\n\nA brand best known for its inimitable bath bombs, Lush also sells soaps, shampoos, cosmetics and masks using only vegetarian or vegan recipes. What’s more, they do not buy from any companies that carry out or fund any animal testing. As well as its best-selling products, including the famous dream cream, campaigns ranging from human rights to animal protection are also a huge part of the work Lush does to raise awareness of so many global issues.\n\nVisit shop\n\n(Mac)\n\nMac has become a cult favourite among beauty fans, and for good reason. The company has taken the industry by storm since its launch in 1984 and is now sold in more than 105 countries around the world. It sells everything from super-matte lipsticks and professional standard make-up brushes, to shimmering setting sprays and eyeshadow palettes.\n\nVisit shop\n\n(M&S)\n\nA stalwart on the British high street, it’s not just groceries that M&S does really well. Available both in-store and online, the brand also offers an edit of much-loved beauty products from some of the best brands in the business such as Pixi, Nuxe, Emma Hardie and Aveda. It’s also home to a collaboration with supermodel Rosie Huntington-Whiteley which offers easy-to-use modern make-up classics and stylish perfumes.\n\nVisit shop\n\n(Net-a-Porter)\n\nA premier luxury fashion destination, Net-a-Porter sells much more than high-end garb. In fact, the website has quickly become a beauty lovers paradise brimming with indulgent names like Balmain, Victoria Beckham, Chantecaille and Charlotte Tilbury. As well as cosmetics it also sells fragrance, skincare, tools and devices.\n\nVisit shop\n\n(& Other Stories )\n\nA one-stop styling destination filled with fashion collections, & Other Stories also sells a range of products designed to elevate your natural beauty. Ideal for those looking to discover new make-up products for everyday and evening looks, the website sells staple make-up must-haves from brushes and foundation to lipstick and eye colour palettes.\n\nVisit shop\n\n(Selfridges)\n\nA brand that started life in 1906 with a revolutionary understanding of the theatre of retail, Selfridges has gone from strength-to-strength over the years. Now, the website offers beauty lovers everything they could ever need from high street brands like Bare Minerals and Bobbi Brown to luxury names including Burberry, Aesop and Escentric Molecules.\n\nVisit shop\n\n(Space NK)\n\nSpaceNK's Nicky Kinnaird started it all in 1993 with a little shop in Covent Garden where she introduced us to the world of niche high performance beauty brands like Laura Mercier, Chantecaille, Eve Lom, Nars and Shu Uemura. Now, with a wealth of brands online, this is a one-stop-shop for serious luxury and glamour and an edited selection of the world's best beauty products.\n\nVisit shop\n\n(Superdrug)\n\nA favourite on the high street, Superdrug has a huge online offering too. As well as the best big beauty brands, such as Rimmel and Revolution, it also offers a host of exclusive and own-brand products that you won’t find anywhere else. The Superdrug website sells everything from make-up and skincare to men’s grooming products and electricals.\n\nVisit shop\n\n(The Body Shop)\n\nNever afraid to stand out from the crowd, The Body Shop is famed for its naturally-inspired beauty products that are 100 per cent vegetarian and cruelty free. As well as make-up, it also sells fragrances, skincare and an extensive range of moisturising body products. The Body Shop website also features a “Tips and Advice” section where you can find information on everything from how to reduce blackheads to the benefits of hyaluronic acid.\n\nVisit shop\n\n(Too Faced)\n\nFounded by Jerrod Blandino and Jeremy Johnson in 1998, Too Faced is now sold in more than 30 countries and is one of the top-selling brands everywhere it’s sold. Famed for its sweet-scented products, budge-proof mascaras and high-coverage foundations, you won’t leave the site empty handed.\n\nVisit shop\n\nFor more beauty inspiration, read our round-up of the best IPL and laser hair removal machines to use at home", "images": ["https://static.independent.co.uk/2021/01/28/10/BeautyPic.jpg?quality=75&width=982&height=726&auto=webp", "https://static.independent.co.uk/2021/01/28/10/BeautyPic.jpg?quality=75&width=1200&auto=webp"], "top_img": "https://static.independent.co.uk/2021/01/28/10/BeautyPic.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Sarah Young"], "canonical_link": "https://www.independent.co.uk/extras/indybest/fashion-beauty/best-online-beauty-retailers-beauty-pie-cult-beauty-space-nk-birchbox-9158731.html", "title": "Best online beauty stores for make-up and skincare", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "Want to upgrade your beauty regime? These are the best online stores for make-up and skincare in the UK, from Charlotte Tilbury to Fenty Beauty, Boots and more", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "Fashion & Beauty", "sitename": "The Independent", "page path": "/extras/indybest/fashion-beauty", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2014-02-28T01:46:33.000Z", "site_name": "The Independent", "title": "The best places to buy make-up and skincare online", "url": "https://www.independent.co.uk/extras/indybest/fashion-beauty/best-online-beauty-retailers-beauty-pie-cult-beauty-space-nk-birchbox-9158731.html", "type": "article", "description": "Want to upgrade your beauty regime? These are the best online stores for make-up and skincare in the UK, from Charlotte Tilbury to Fenty Beauty, Boots and more", "image": {"identifier": "https://static.independent.co.uk/2021/01/28/10/BeautyPic.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/2021/01/28/10/BeautyPic.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2014-02-28T01:46:33.000Z", "modified_time": "2014-02-28T01:46:33.000Z", "section": "Extras", "subsection": "IndyBest", "author_name": "Sarah Young", "content_type": "story", "word_count": 3262, "image_count": 28, "embed_count": 1, "video_count": 0, "internal_link_count": 2, "external_link_count": 27}, "date": "2014-02-28T01:46:33.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "The best places to buy make-up and skincare online", "site": "@Independent", "card": "summary_large_image", "description": "Want to upgrade your beauty regime? These are the best online stores for make-up and skincare in the UK, from Charlotte Tilbury to Fenty Beauty, Boots and more", "image": "https://static.independent.co.uk/2021/01/28/10/BeautyPic.jpg?quality=75&width=1200&auto=webp"}, "keywords": "Fashion and Beauty,fashion and style,best buy,Beauty Products,indybest,Internal"}, "movies": [], "publish_date": 1393551993.0, "source": "https://www.independent.co.uk", "summary": ""}