{"url": "https://www.hollywoodreporter.com/thr-esq/johnny-depp-has-a-clear-epic-sense-entitlement-managers-say-999062", "text": "Johnny Depp’s former business managers aren’t taking his recent comments about their dispute lightly — and they have escalated their claims against the actor in an amended complaint.\n\nThe legal battle between Depp and The Management Group’s Joel and Robert Mandel began in January, when the actor sued his former business managers for fraud. TMG fired back, saying the actor’s financial woes are all his own.\n\nTMG says Depp’s sense of entitlement is “clear and epic,” as evidenced by his recent interview with The Wall Street Journal — in which he said, “It’s my money. If I want to buy 15,000 cotton balls a day, it’s my thing.”\n\n“Depp listened to no one, including TMG and his other advisors, and he demanded they fund a lifestyle that was extravagant and extreme,” writes attorney Michael Kump in the amended complaint filed Monday. “Ultimately, Depp and/or his sister and personal manager, Elisa Christie Dembrowski, knowingly approved all of Depp’s expenditures.”\n\nCited among the purchases are 14 residences, 45 luxury vehicles, 70 collectible guitars and enough Hollywood memorabilia to fill 12 storage facilities.\n\nNotably, the managers also claim that Depp spends hundreds of thousands of dollars on a sound engineer who feeds him lines on set.\n\n“Depp insisted that this sound engineer be kept on yearly retainer so that he no longer had to memorize his lines,” writes attorney Michael Kump.\n\nTMG also claims Depp’s “army of attorneys” has bailed him out of legal crises and made a series of “hush money settlements” — details of which they promise will be revealed during trial.\n\nFurther, the business managers say Depp habitually lies to the public and authorities to avoid taking responsibility for his actions — including the infamous Australian dog smuggling incident and reportedly volatile behavior with his now ex-wife Amber Heard.\n\nWrites Kump, “Depp’s 45-page complaint against TMG, which is replete with demonstrably false and fraudulent allegations, was filed solely to avoid the non-judicial foreclosure of his properties, and is just another example of Depp’s pattern of habitual lies and deception designed to avoid responsibility for his actions.”\n\nThe new complaint also suggests Depp should submit to a mental health evaluation during the proceedings.\n\n“Depp’s extravagant spending has often been marked by a lack of impulse control,” writes Kump. “In retrospect, it appears that Depp may suffer from a compulsive spending disorder, which will be proven in this action through a mental examination of Depp … and expert testimony. On information and belief, Depp’s flagrant bragging about his senseless and extreme spending to The Wall Street Journal is further evidence of his psychological issues.”\n\nDepp’s lawyer Adam Waldman sent The Hollywood Reporter a statement Monday evening. “Accused of criminal malfeasance and theft totaling tens of millions of dollars, in a case with a whistleblower from the Mandels‘ own firm whose testimony and documents they fight to hide, the defendants decided their only defense is psychobabble,” writes Waldman. “This is how guilty people respond when confronted with the detailed results of a 9 month legal and forensic investigation conducted by 4 firms.”\n\nMay 2, 8:35 a.m. Updated with a quote from Depp’s attorney.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2016/09/johnny_depp.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2016/09/johnny_depp.jpg?w=1296&h=730&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2016/09/johnny_depp.jpg?w=1024", "keywords": [], "authors": ["Ashley Cullins"], "canonical_link": "https://www.hollywoodreporter.com/business/business-news/johnny-depp-has-a-clear-epic-sense-entitlement-managers-say-999062/", "title": "Johnny Depp Has a “Clear and Epic” Sense of Entitlement, Ex-Managers Say", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "In an amended complaint, the ex-managers claim the actor wears an earpiece on set and pays someone to feed him lines so he doesn't have to memorize them.", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Ashley Cullins", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 999062, "title": "Johnny Depp Has a \"Clear and Epic\" Sense of Entitlement, Ex-Managers Say", "published_at": "2017-05-01 13:22:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/09/johnny_depp.jpg?w=1024", "comment_count": 0, "topics": "Business News", "body": "Johnny Depp's former business managers aren't taking his recent comments about their dispute lightly — and they have escalated their claims against the actor in an amended complaint.\r\nThe legal battle between Depp and The Management Group's Joel and Robert Mandel began in January, when the actor sued his former business managers for fraud. TMG fired back, saying the actor's financial woes are all his own. \r\nTMG says Depp's sense of entitlement is \"clear and epic,\" as evidenced by his recent interview with The Wall Street Journal — in which he said, “It's my money. If I want to buy 15,000 cotton balls a day, it's my thing.\"\r\n\"Depp listened to no one, including TMG and his other advisors, and he demanded they fund a lifestyle that was extravagant and extreme,\" writes attorney Michael Kump in the amended complaint filed Monday. \"Ultimately, Depp and/or his sister and personal manager, Elisa Christie Dembrowski, knowingly approved all of Depp's expenditures.\"\r\nCited among the purchases are 14 residences, 45 luxury vehicles, 70 collectible guitars and enough Hollywood memorabilia to fill 12 storage facilities.\r\nNotably, the managers also claim that Depp spends hundreds of thousands of dollars on a sound engineer who feeds him lines on set.\r\n\"Depp insisted that this sound engineer be kept on yearly retainer so that he no longer had to memorize his lines,\" writes attorney Michael Kump.\r\nTMG also claims Depp's \"army of attorneys\" has bailed him out of legal crises and made a series of \"hush money settlements\" — details of which they promise will be revealed during trial.\r\nFurther, the business managers say Depp habitually lies to the public and authorities to avoid taking responsibility for his actions — including the infamous Australian dog smuggling incident and reportedly volatile behavior with his now ex-wife Amber Heard.\r\nWrites Kump, \"Depp's 45-page complaint against TMG, which is replete with demonstrably false and fraudulent allegations, was filed solely to avoid the non-judicial foreclosure of his properties, and is just another example of Depp's pattern of habitual lies and deception designed to avoid responsibility for his actions.\"\r\nThe new complaint also suggests Depp should submit to a mental health evaluation during the proceedings. \r\n\"Depp's extravagant spending has often been marked by a lack of impulse control,\" writes Kump. \"In retrospect, it appears that Depp may suffer from a compulsive spending disorder, which will be proven in this action through a mental examination of Depp ... and expert testimony. On information and belief, Depp's flagrant bragging about his senseless and extreme spending to The Wall Street Journal is further evidence of his psychological issues.\"\r\nDepp's lawyer Adam Waldman sent The Hollywood Reporter a statement Monday evening. \"Accused of criminal malfeasance and theft totaling tens of millions of dollars, in a case with a whistleblower from the Mandels' own firm whose testimony and documents they fight to hide, the defendants decided their only defense is psychobabble,\" writes Waldman. \"This is how guilty people respond when confronted with the detailed results of a 9 month legal and forensic investigation conducted by 4 firms.\"\r\nMay 2, 8:35 a.m. Updated with a quote from Depp's attorney.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Johnny Depp Has a “Clear and Epic” Sense of Entitlement, Ex-Managers Say", "url": "https://www.hollywoodreporter.com/business/business-news/johnny-depp-has-a-clear-epic-sense-entitlement-managers-say-999062/", "description": "In an amended complaint, the ex-managers claim the actor wears an earpiece on set and pays someone to feed him lines so he doesn’t have to memorize them.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2016/09/johnny_depp.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-05-01T13:22:00+00:00", "modified_time": "2017-05-02T08:42:21+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Johnny Depp Has a “Clear and Epic” Sense of Entitlement, Ex-Managers Say", "description": "In an amended complaint, the ex-managers claim the actor wears an earpiece on set and pays someone to feed him lines so he doesn’t have to memorize them.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/09/johnny_depp.jpg?w=1296"}}, "movies": [], "publish_date": 1493644920.0, "source": "https://www.hollywoodreporter.com", "summary": ""}