{"url": "https://web.archive.org/web/20220818002537/https://www.babygaga.com/15-times-hilary-duff-got-real-about-motherhood/", "text": "Hilary Duff is one of the few celebs who started out as a kid that didn't get wrapped up in Hollywood drama. Yet, people still find ways to criticize.\n\nHilary Duff, 29, has been in the spotlight since a very young age, yet she’s weirdly down-to-earth and frankly one of very few child stars who avoided the seedy underbelly of Hollywood, and grew up to be a fantastic person to look up to. The actress, singer and now mom to 5 year-old son Luca Cruz, whom she shares with ex-husband Mike Comrie, has been very candid about pregnancy and motherhood during interviews.\n\nFrom late-night feedings, 24/7 diaper duty, and crying galore, Hilary is fully aware of the stress that new moms everywhere deal with on a daily basis. As a working mom she also experiences difficulty in balancing a chaotic work schedule and wanting to spend time with her son. She struggles with juggling her career and being a mom who is present in her son’s life. Ultimately, Hilary is very much like us, and in fact often takes to her Instagram page to document and share her journey with her young family.\n\nHowever, this also means though that she has been a target for the critics and is no stranger to mommy-shaming. Despite her long resume of albums, TV shows, and films, some of Duff’s hardest reviews are for her parenting. But Hilary responds that she hopes that other moms will stop being so judgmental and realize that everyone has different beliefs and it’s not OK to tell other moms how to raise their child.\n\nThe young star is like all other moms, despite her celebrity status, and we can easily relate to her misadventures. So if you can use some lessons on finding breathing room in your own life start here.\n\n15 Hormonal Roller Coaster\n\nHilary Duff has been very candid about the ups and downs of pregnancy. Although she enjoys every minute of time spent with her son now that he’s here, she admits she didn’t love being pregnant and even describes her pregnancy as a “hormonal roller coaster”. Even now there are still some bumps in the road as she describes how she feels:\n\n\"Exhaustion is a good one to start with! You're very sleep-deprived. Sometimes you have a crying baby and you can't do anything to get them to stop crying … you feel, as their mom, that you should be able to have all the answers and be able to take care of them so easily.\"\n\nEvery mom has felt this way at one time or another. This feeling of helplessness when your baby is crying and you can’t soothe them is heart wrenching. But we need to remember that babies don’t come with instruction manuals and their only way to communicate their discomfort is by crying. Ultimately, you are the person who knows what’s best for them and all they want is their mama.\n\n14 Self-Doubter\n\nHilary Duff has been working in the spotlight since she was 12 years old, but nothing could have prepared her for pregnancy and motherhood. She confesses not feeling confident and these were uncharted waters for her as she had never been around newborns or even that many young children. Like many first time parents, she read a lot of books and did research, but until you're holding your baby, you're always a little worried because it's the unknown. I think numerous moms can relate to this.\n\nEven now that her son is older she still worries – it’s the same thing just a different day. She still doubts herself at times, needing to here \"I'm so proud of you,\" or, \"Look at the wonderful mother you are\", which can make her cry. It’s important for moms to hear this because you’re always stressed and you give so much of yourself away, almost losing yourself. Of course you'd do anything for your children, but hearing that reassurance can just mean the world.\n\n13 Post Baby Body\n\nOne area where Hilary Duff has felt the heat is the public’s opinion on her body after having son Luca. The singer had a thing or two to say about both losing the baby weight and what it’s like to find you’ve unknowingly made a post-baby-body debut:\n\n“The second I had Luca, I went to go get my hair blown out at the salon, and I hadn’t stepped outside in, like, 15 days. Then they’re like, ‘Hilary Debuts Her Post-Baby Body!’ I was like I’m not debuting s–t right now. I’m just going on an errand run!”\n\nShe reminds us that it took 10 months for her body to get to that point, so it won’t just come off. She even jokes that women who look the same right after having a baby are “freaks of nature”. Tabloids were very hard on her because it took her a year and a half to get her body back. And if we learn just one thing from Hil it’s to be more kind to ourselves.\n\n12 Judge And Jury\n\nIt’s difficult being a mom in the workforce. There’s a lot of judgement and we’re victims of blackballing at times because we’ve had a child. And it’s no different in Hollywood. Hilary Duff said she's now been 'pigeonholed' as far as roles she can obtain as an actress in Hollywood. “I feel like I was judged for having a baby too soon” the starlet bemoaned. 'Now I'm pigeonholed for being a mom.' The former Disney Channel star added: “Nobody cares about men's personal lives as much as women's. Everything I do feels judged or picked apart, and the whole world gets to know about it.”\n\nMany of us can relate to this. As women we often feel like we’re doomed if we do and doomed if you don’t. There’s no winning. As if having a child defines everything that we are and renders us useless. NEWS FLASH: we’re not the first woman to have a child and work.\n\n11 Walking A Tight Rope\n\nUnderneath it all, Hilary Duff is just another working mom who misses her son terribly. Balancing a hectic work schedule and being a mom definitely has its challenges At times, Duff feels like she’s missing a lot and it makes her really sad. But she has a quick fix for that saying: “The easiest way for me to really connect with him when I've had a crazy week is to unplug from all my devices.\" When the singer gets the chance to see her son, she focuses all of her energy on him.\n\nKudos for her! More parents should do this. We might not have a lot of time to dedicate to our children; if it were up to them we would play in the park for 10hrs in a row, but when we do, we should give them our undivided attention and unplug from everything else. Hilary might be plagued with working mom guilt, but she sure is an example to follow.\n\n10 Worry Wart\n\nHilary Duff is completely in love being son Luca’s mom. She gushes that \"he only makes every day matter so much more and the joy that I feel, the purpose; everything is so much more heightened. It’s just, he’s really amazing”. But she’s the first to admit that as a parent “you’re always worrying [and] everyone wants their kids’ lives to go perfectly, which is obviously not possible all the time”.\n\nEVERY SINGLE PARENT OUT THERE CAN RELATE TO THIS. From checking if baby is still breathing when you first bring them home to bullying at school and everything in between, there’s always something to worry about. The trick is to trust that you’re doing the very best that you can and have taught them well. YOU are what’s best for this child and you are all that matters in their eyes.\n\n9 Proud Mama\n\nAs parents (especially first-timers) we freakishly record all of our children’s’ milestones. We find pride in the most banal things and we want to scream it from the rooftops (but we usually settle for taking a gazillion pictures and posting them on social media). Celebrities are no different. Hilary Duff gushed about how her son was walking and he learned how to eat with a fork when he was just 11 months old, stating “Those are both really big things, you know?”.\n\nOh we know alright! At that age babies are doing new things daily and we hope that we’ll be there to see these precious moments. But don’t worry if you’re not…even though you might miss the first time, there will always be a first time for you. It’s not necessarily the amount of time spent with your children but rather the quality of time.\n\n8 Young Divorcée\n\nIf Hilary Duff was judged for marrying so young, you can be sure that the same haters were also present to say “I told you so” when she divorced husband Mike Comrie, just 4 years later. Although her divorce was difficult, shattering her ideal of a happily ever after, the two remain very amicable. However that doesn’t mean that co-parenting is always a walk in the park. Although her friends claim it must be nice that she gets a break from kidsville, Hilary disagrees as the break from her kid never makes up for the time lost with them.\n\nAnd what about the mom guilt that multiplies exponentially post-divorce while you're worrying that you've scarred your kid for life and should probably take them to Disneyland every day to make up for it? Yeah, Duff feels you on that one. On the bright side, she probably doesn’t have to sign up for match.com or eHarmony.\n\n7 Letting Go Of The Dream\n\nPrior to her divorce, Hilary Duff made it no secret that she wanted more children. She wanted to do right by Luca and give him a sibling not too far apart so they could have a lot in common and be very close (This probably stems from her close relationship with sister Haylie who is just 2 years older). Close friends and relatives were always asking her when the next baby was coming, but little did they know that she was dealing with much more serious problems, as her marriage of 4 years was crumbling.\n\nWhat is it with people and only child guilt? It seems like your only options are:\n\nWhen you have one child: When is the second one coming? When you have 2 boys: But you’ll try for a girl right? When you have 2 girls: But you’ll try for a boy right? When you have one boy and one girl: So you’re done right? When you have more 3 or more children: ??!!!?\n\nHilary says she just had to get over the fact that she wasn’t going to have her dream of having a baby that was close in age with her son and she’s OK with that.\n\n6 Take A Stand\n\nRecently, Hilary Duff has been under fire for kissing her, then 4-year old, son on the lips. The star posted a picture of her and Luca at Disneyland which received a lot of media attention and was highly criticized as “unhealthy” and “inappropriate”. Duff was quick to reply the next day stating:\n\n“For anyone commenting that a kiss on the lips with my four year old is ‘inappropriate’ go ahead and click a quick unfollow with your warped minds and judgment.”\n\nThis makes us all want to stand up and cheer: “Ya, you go girl! You tell them!”. There is so much judgement out there and even celebrities are shielded from mommy shaming, if anything the general public is much harsher on them and their lives are constantly under a microscope. I personally think this whole event is preposterous. This was an entirely innocent thing. There is nothing more beautiful than the love a mom has for your child.\n\n5 Raise Your Voice\n\nOur little ones don’t always know right from wrong and it’s our job to teach them. But what do you do when it’s another child doing something not so nice and their parent is not intervening? You can’t go around telling someone else’s kid how to behave. However in one particular incident the Hilary didn’t have a choice explaining:\n\n“This little girl at the play gym pushed Luca, so I picked him up and moved onto a different play area. But then she sought him out again and pushed him off his little Rody -- I was like, Hey! Whose kid is this? If you know she's a little aggressive sometimes, you need to keep a better eye on her. So I obviously didn't say anything to the kid, but to the person who was watching her.”\n\nI’m certain all of our inner mama bears would have came out if the same thing happened to our child.\n\n4 Emotional Poem\n\nLast month, Duff shared a picture of a poem on her Instagram page, given to her by co-star Peter Hermann, who plays Hilary’s character’s boss Charles on Younger. Because even though she has a pretty sweet gig, it comes with very long hours and she misses her son terribly. This sweet poem is how she manages to cope. She wrote:\n\n\"Tears started falling down my face at the last four lines and still do when I read it. Motherhood is the greatest gift I have ever received. Every day a new adventure or hurdle. My heart has grown bigger than I can explain. I think every mother or parent will find this poem as moving as I do. enjoy\"\n\nBoy was she right. We do everything in our power to make them happy. We don’t always get a thank you or feel appreciated, but we would do it all over again in a heartbeat.\n\n3 Being A Chauffeur\n\nAs parents, we all make the transition from being the center of our own lives to slowly starting to revolve around our children’s and Hillary Duff is no exception. “I’m basically his chauffeur” the singer exclaims. When she says she doesn’t mind not being on anyone’s schedule but her son’s we all know what she’s talking about. Even when she claims to be his chauffeur we only need to look at our own lives to sympathize. Our lives, inevitably, move away from the stage into the audience’s seat and we start observing and cheering instead of doing.\n\nAnd we even find ourselves enjoying it, even if we are a big celebrity like Hillary Duff, reminding us that her down to earth nature is not a persona, but that she’s real AF like the rest of us. Eventually we even stop to see it as ‘’work’’, we find it relaxing, we enjoy it. We get to bring our young to their destination and just enjoy seeing them live their lives.\n\n2 Buzz Cut\n\nAs a mom to a boy we know all about dinosaurs, trucks, and bugs. We deal with skinned knees and tornados of energy, which seem to have no fear. But have you ever left them with dad thinking ''what's the worst that can happen?'' and been flabbergasted at the result?\n\nBeing a working mom, Hilary left her son Luca with his father after agreeing that Luca was in need of a haircut. Unfortunately, Luca didn't feel like going out and his father, jumped to the occasion by offering to do it himself. After all it's just a buzz cut, how hard can it be?\n\nCue a shameful dad trying to make light of the situation: “I might have went a little too short. He's like basically bald’’. The singer/actress was flabbergasted and wanted to cry. But sometimes you just have to laugh it up. You can’t be in two places at once and mistakes happen. And hey, it’s just hair right?\n\n1 I'm A Survivor\n\nHilary Duff was reminiscing about son Luca’s first birthday party, remembering how proud that she and husband Mike Comrie had made it through the first year –through the sleepless nights, the times when you’re most scared or stressed. She states that “it’s the love you have for your children [that] makes everything possible” and just remember “you’ve got this”.\n\nIt's such a simple message, but it's actually pretty important. You don't realize until you've done it. The first birthday party ends up being more for the parents than the kid. Because all you want to do is scream “we did it! We survived!” That first year there are beautiful amazing experiences, and there are tough ones, too. So there's a lot to celebrate. Every parent has felt this way – as they should because it’s a huge accomplishment. My husband often jokes that our measure of success with our kids is that they are still alive so we must be doing something right (lol).\n\nSources: UsMagazine.com, RedBookMag.com, SheKnows.com, Parents.com, Thestir.cafemom.com, Today.com, Eonline.com, Babycenter.com, Dailymail.com.", "images": ["https://web.archive.org/web/20220818002537im_/https://static0.babygagaimages.com/wordpress/wp-content/uploads/2017/08/hillary2.jpg", "https://web.archive.org/web/20220818002537im_/https://www.babygaga.com/public/build/images/mm-logo-full-colored-light.53763959.svg", "https://web.archive.org/web/20220818002537im_/https://www.babygaga.com/public/build/images/tv-logo-full-colored-light.8d65e7f9.svg", "https://web.archive.org/web/20220818002537im_/https://www.babygaga.com/public/build/images/re-logo-full-colored-light.4b543c53.svg", "https://web.archive.org/web/20220818002537im_/https://www.babygaga.com/public/build/images/tt-logo-full-colored-light.051eb8af.svg"], "top_img": "https://web.archive.org/web/20220818002537im_/https://static0.babygagaimages.com/wordpress/wp-content/uploads/2017/08/hillary2.jpg", "keywords": [], "authors": ["Bg Staff"], "canonical_link": "https://web.archive.org/web/20220818002537/https://www.babygaga.com/15-times-hilary-duff-got-real-about-motherhood/", "title": "15 Times Hilary Duff Got Real AF About Motherhood", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "robots": "max-image-preview:large", "description": "Hilary Duff is one of the few celebs who started out as a kid that didn't get wrapped up in Hollywood drama. Yet, people still find ways to criticize.", "og": {"title": "15 Times Hilary Duff Got Real AF About Motherhood", "type": "article", "image": {"identifier": "https://web.archive.org/web/20220818002537im_/https://static0.babygagaimages.com/wordpress/wp-content/uploads/2017/08/hillary2.jpg", "width": 1024, "height": 512}, "url": "https://web.archive.org/web/20220818002537/https://www.babygaga.com/15-times-hilary-duff-got-real-about-motherhood/", "locale": "en_US", "description": "Hilary Duff is one of the few celebs who started out as a kid that didn't get wrapped up in Hollywood drama. Yet, people still find ways to criticize.", "site_name": "BabyGaga"}, "article": {"published_time": "2017-08-11T17:00:25Z", "modified_time": "2017-08-11T17:00:25Z", "section": "Baby Buzz", "author": "BG Staff", "publisher": "https://www.facebook.com/babygaga"}, "twitter": {"card": "summary_large_image", "site": "@babygaga", "title": "15 Times Hilary Duff Got Real AF About Motherhood", "description": "Hilary Duff is one of the few celebs who started out as a kid that didn't get wrapped up in Hollywood drama. Yet, people still find ways to criticize.", "image": "https://web.archive.org/web/20220818002537im_/https://static0.babygagaimages.com/wordpress/wp-content/uploads/2017/08/hillary2.jpg"}, "fb": {"app_id": 270407583294564}}, "movies": [], "publish_date": 1502470825.0, "source": "https://web.archive.org", "summary": ""}