{"url": "https://news.starbucks.com/news/20-years-of-starbucks-holiday-cups", "text": "For 20 years, the return of the Starbucks holiday cups have marked the arrival of the season. It’s a ritual for many that’s as beloved as that first sip of Peppermint Mocha.\n\nIt’s not easy to find the very first Starbucks holiday cups, which made their debut in stores in 1997. Few were saved, and electronic design files were lost in an earthquake in 2001. Even an Internet search is unyielding, with the cups having made their arrival long before the first selfie.\n\nLuckily, designer Sandy Nelson, a Starbucks alumna, stashed away a set of these cups, along with other artifacts from her 14 years working in Starbucks Creative Studio. She remembers the design fondly, one of her first assignments at Starbucks.\n\n“It was August, and I had just started with the company,” Nelson said. “We were working on holiday creative for the season to come. We had what felt like a hundred cup designs pinned up on the wall. Then Howard [Schultz] came by, looked at all of them, and picked my design. I couldn’t believe mine was chosen.”\n\nThat first cup wasn’t really red – at least not the holiday red that Starbucks has become known for. It was closer to a magenta, and the cup also came in three more colors: sapphire, emerald and amethyst. The design featured swirls and hand-drawn holly leaves that were flecked with coffee beans.\n\nNelson was in Anchorage visiting a friend when she saw the cups in a store for the first time.\n\n“I remember seeing the cups piled high on the counter, and I realized ‘this is big,’” she said. “It was thrilling.”\n\nIt would be two more years, in 1999, before the Starbucks cup would don its signature red color. Jon Cannell, manager Creative Design, was part of the design team that year.\n\n“I remember it all started when the creative director asked us, ‘What is holiday red? Is it burgundy? Is it more of a ruby color,’” Cannell said. “We brought in all these holiday items in a range of reds, and we landed on a red that we all agreed on.”\n\nThat year, they settled on a vibrant shade of candy-apple red with whimsical drawings of snowflakes, stockings and other images that evoked the spirit of the holiday.\n\n“There was a response to that shade of red,” Cannell said. “It was a joyous color, and it really resonated with customers.”\n\nOver two decades, Starbucks holiday cups became emblematic of the holiday, with designs that reflect the joy of the season with scenes of celebration and gathering. That shade of red was the foundation for the cups, the canvas for each creation that has evolved over the years.\n\nThe cup became a symbol of the holidays, the anticipation growing with each passing year. Over the years, online countdown clocks have sprung up as speculation builds on social media. It is now a fixture in popular culture, the star of both morning talk shows and late night stand-up routines. Passions for the cup have run so high that even the design could become controversial, as it did in 2015 when Starbucks introduced a modern two-toned, ombré red design.\n\nThe 2017 design echoes themes from cups of years past with intimate moments connected by swirls of red and white. But this time the coloring book inspired design leaves room for customers to add their own color.\n\n“We’re inviting everyone to color in the holidays in a way that’s meaningful to them,” said Leanne Fremar, executive creative director for Starbucks.\n\nMaybe even magenta.\n\n1997\n\nJoshua Trujillo\n\nThese first holiday cups were adorned with hand-drawn holly and swirls dotted with tiny coffee beans. Customers could enjoy an Eggnog Latte or Christmas Blend brewed coffee in one of four jewel-toned hues.\n\n1998\n\nJoshua Trujillo\n\nCustomers were invited to “embrace the warmth” with holiday cup featuring swirling snowflakes on a field of burgundy.\n\n1999\n\nJoshua Trujillo\n\nThe candy-apple red Starbucks holiday cup makes its first appearance in this whimsical design with black line-drawings of snowflakes, stockings and winter celebrations.\n\n2000\n\nJoshua Trujillo\n\nGingerbread Latte makes its debut in these “Coffeetown” holiday cups with colors of red and kraft paper, which depict a village of coffee and tea pots against a nighttime sky.\n\n2001\n\nJoshua Trujillo\n\nThe cups themselves are designed to look like a gift, trimmed with green and red ribbon and old-fashioned stamps. This is the first holiday for White Chocolate Mocha and Starbucks Cards.\n\n2002\n\nJoshua Trujillo\n\nThis is the first year the holiday cups feature white line art, an illustration style that returned again in 2005 and 2016.\n\n2003\n\nJoshua Trujillo\n\nShadows dance across a fanciful scene with shimmering stars and snowflakes.\n\n2004\n\nJoshua Trujillo\n\nThe Starbucks logo is reminiscent of an evergreen wreath in this year’s cup design. In a Starbucks video, the cup could be found atop the roof of a yellow taxi speeding through the streets of San Francisco.\n\n2005\n\nJoshua Trujillo\n\nThe cup features white woodcut-style drawings of mistletoe along with a reminder that “It only happens once a year” as a string of holiday lights twinkle along the rim.\n\n2006\n\nJoshua Trujillo\n\nVector illustrations that appear as intricate cut paper silhouettes gather in traditional holiday tableaux.\n\n2007\n\nJoshua Trujillo\n\nFor the holiday cup’s 10th anniversary, customers are invited to “Pass the Cheer,” as a gift is shared in a classic snowy scene.\n\n2008\n\nJoshua Trujillo\n\nA field of reindeer and a single white dove are depicted in a moonlit woodland landscape with an overlay of a cozy knitted pattern.\n\n2009\n\nJoshua Trujillo\n\nCaramel Brulée Latte make its debut this year, along with a cup design that featured cut-paper ornaments inscribed with the words “joy, hope, love, light, peace” hanging on sprigs of evergreen.\n\n2010\n\nJoshua Trujillo\n\nThe cups take on a more modern vibe with new holiday characters catching snowflakes in a palette of red, white and of gray.\n\n2011\n\nJoshua Trujillo\n\nCarolers sing, an ice skater spins, and a boy and his dog sled down a hill with these holiday cups. Customers make these merry scenes come to life with Starbucks Cup Magic, an augmented reality app.\n\n2012\n\nJoshua Trujillo\n\nThe holiday characters come in for their close-up in this design with bold accents of navy and gold.\n\n2013\n\nJoshua Trujillo\n\nThe cup features a swoop of coffee cherries, coffee flowers and vintage ornaments painted in a deep garnet with touches of gold.\n\n2014\n\nJoshua Trujillo\n\n“Let there be bright” is the theme for the holiday, with fanciful brushstrokes in bold colors.\n\n2015\n\nJoshua Trujillo\n\nThe cup features a two-toned ombré design, with a bright poppy color on top that morphed into a darker cranberry below.\n\n2016\n\nJoshua Trujillo\n\nFor the first time, Starbucks features customer-created holiday cups with 13 designs from six countries around the world, all with hand-drawn white against a red background.\n\n2017\n\nJoshua Trujillo", "images": ["https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2004-resized.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2006-resized.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2015-resized.jpg", "https://news.starbucks.com/_next/image/?url=https%3A%2F%2Fstories.starbucks.com%2Fuploads%2F2021%2F10%2F2017-Holiday-Cups-FeatureHorizontal.jpg&w=3840&q=75", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_1997-violet-resized.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2003-resized.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2000-resized.jpg", "https://stories.starbucks.com/wp-content/uploads/2019/01/2Yd6nnq0-4800-3226-1.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2009-resized.jpg", "https://news.starbucks.com/_next/image/?url=https%3A%2F%2Fstories.starbucks.com%2Fuploads%2F2022%2F09%2FSBX20220913-Tryer-FeatureHorizontal2-1024x498.jpg&w=3840&q=75", "https://stories.starbucks.com/uploads/2019/01/Starbucks_Logo_Hi-res.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2011-resized.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2010-resized.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2002-resized.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2014-resized.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2001-ribbon-resized.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_1998-resized-1.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_1999-resized-1.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2016-resized.jpg", "https://news.starbucks.com/_next/image/?url=https%3A%2F%2Fstories.starbucks.com%2Fuploads%2F2022%2F07%2FSBX20220711-Outreach-Workers-FeatureHorizontal-1024x498.jpg&w=3840&q=75", "https://stories.starbucks.com/uploads/2022/08/SBX20220818-JC-Letter-FeatureHorizontal-150x150.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2007-resized.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2012-resized.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2008-resized.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2017-resized.jpg", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2013-resized.jpg", "https://news.starbucks.com/_next/image/?url=https%3A%2F%2Fstories.starbucks.com%2Fuploads%2F2022%2F08%2FStarbucks-Whole-Bean-Coffee-Packaging-Redesign-1024x683.jpg&w=3840&q=75", "https://stories.starbucks.com/uploads/2019/01/Holiday_Cup_2005-resized-1.jpg"], "top_img": "https://stories.starbucks.com/uploads/2019/01/Starbucks_Logo_Hi-res.jpg", "keywords": [], "authors": ["Heidi Peiper", "Starbucks Newsroom", "November"], "canonical_link": "https://stories.starbucks.com/stories/2017/20-years-of-starbucks-holiday-cups/", "title": "20 years of Starbucks holiday cups", "meta_data": {"viewport": "initial-scale=1.0, width=device-width", "twitter": {"card": "summary_large_image", "description": "Starbucks Nostalgia: In the latest installment of an occasional series, we take a look back at Starbucks iconic holiday cups, which have helped usher in the holidays since 1997.", "title": "20 years of Starbucks holiday cups", "image": "https://stories.starbucks.com/wp-content/uploads/2019/01/20th_Anniversary_Holiday_Cups-1.jpg"}, "og": {"locale": "en_US", "type": "article", "title": "20 years of Starbucks holiday cups", "description": "Starbucks Nostalgia: In the latest installment of an occasional series, we take a look back at Starbucks iconic holiday cups, which have helped usher in the holidays since 1997.", "url": "https://stories.starbucks.com/stories/2017/20-years-of-starbucks-holiday-cups/", "site_name": "Starbucks Stories", "image": {"identifier": "https://stories.starbucks.com/uploads/2019/01/Starbucks_Logo_Hi-res.jpg", "width": 2500, "height": 2002}}, "description": "How a cup became a tradition: 20 years of Starbucks holiday cups", "next-head-count": 23}, "movies": [], "publish_date": null, "source": "https://news.starbucks.com", "summary": ""}