{"url": "https://www.hollywoodreporter.com/heat-vision/chris-pratt-would-love-see-james-gunn-reinstated-as-guardians-galaxy-3-director-1130696", "text": "Chris Pratt and his fellow Guardians of the Galaxy stars have released an open letter in support of ousted director James Gunn.\n\n“Although I don’t support James Gunn’s inappropriate jokes from years ago, he is a good man,” Pratt wrote Monday in an Instagram post in which he shared a letter co-signed by the cast. “I’d personally love to see him reinstated as director of Volume 3. If you please, read the following statement- signed by our entire cast.”\n\nIn the open letter, the cast referenced a Change.org petition asking for Gunn to be reinstated. So far, the petition has attracted more than 330,000 signatures following Disney’s firing of Gunn on July 20 after offensive tweets resurfaced in which the filmmaker joked about topics such as pedophilia and rape.\n\n“We fully support James Gunn. We were all shocked by his abrupt firing last week and have intentionally waited these ten days to respond in order to think, pray, listen, and discuss,” began the letter, signed by Pratt, Bradley Cooper, Zoe Saldana, Vin Diesel, Dave Bautista, Karen Gillan, Michael Rooker, Sean Gunn and Pom Klementieff. “In that time we have been encouraged by the outpouring of support from fans and members of the media who wish to see James reinstated as director of Volume 3, as well as discouraged by those who were so easily duped into believing the many outlandish conspiracy theories around him.”\n\nGunn’s offensive tweets were resurfaced by conservative personalities, and the Guardians stars referenced political division in the United States in the letter.\n\n“There is little due process in the court of public opinion. James is likely not the last good person to be put on trial. Given the growing political divide in this country, it’s safe to say instances like this will continue, although we hope American from across the political spectrum can ease up on the character assassinations and stop weaponizing mob mentality,” the letter continued.\n\nIn announcing Gunn’s firing on July 20, Walt Disney Studios chairman Alan Horn said, “The offensive attitudes and statements discovered on James’ Twitter feed are indefensible and inconsistent with our studio’s values, and we have severed our business relationship with him.”\n\nThough Disney and Marvel Studios had not set an official release date for Guardians of the Galaxy Vol. 3, the film had been preparing to shoot in Atlanta this fall, and Gunn had been working on a script. Gunn previously said the film would open in 2020. Gunn’s two Guardians films have been big hits for Disney, with the 2014 original earning $773 million globally and last year’s Guardians of the Galaxy Vol. 2 earning $863 million.\n\nBefore this letter, various castmembers had taken different approaches to publicly addressing Gunn’s firing. Bautista, Rooker and the director’s brother Sean Gunn had been the most outspoken in their support of the filmmaker, while Pratt had been more measured, sharing several Bible verses. This is the first statement on the subject from Cooper and Diesel.\n\nRead the letter from the cast below.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/07/guardians_of_the_galaxy_vol_2_cast_at_premiere_with_james_gunn_-_getty_-_h_2018_0.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/guardians_of_the_galaxy_vol_2_cast_at_premiere_with_james_gunn_-_getty_-_h_2018_0.jpg?w=1024", "keywords": [], "authors": ["Aaron Couch"], "canonical_link": "https://www.hollywoodreporter.com/movies/movie-features/chris-pratt-would-love-see-james-gunn-reinstated-as-guardians-galaxy-3-director-1130696/", "title": "Chris Pratt, ‘Guardians of the Galaxy’ Cast Call for Reinstatement of James Gunn", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Chris Pratt and his 'Guardians of the Galaxy' cast have signed a letter in support of fired director James Gunn, asking for him to be reinstated.", "news_keywords": "Chris Pratt, Guardians of the Galaxy, James Gunn", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Aaron Couch", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1130696, "title": "Chris Pratt, 'Guardians of the Galaxy' Cast Call for Reinstatement of James Gunn", "published_at": "2018-07-30 09:54:49", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/guardians_of_the_galaxy_vol_2_cast_at_premiere_with_james_gunn_-_getty_-_h_2018_0.jpg?w=1024", "comment_count": 0, "tags": "James Gunn", "topics": "Movies", "body": "Chris Pratt and his fellow Guardians of the Galaxy stars have released an open letter in support of ousted director James Gunn.\r\n\"Although I don’t support James Gunn’s inappropriate jokes from years ago, he is a good man,\" Pratt wrote Monday in an Instagram post in which he shared a letter co-signed by the cast. \"I’d personally love to see him reinstated as director of Volume 3. If you please, read the following statement- signed by our entire cast.\"\r\nIn the open letter, the cast referenced a Change.org petition asking for Gunn to be reinstated. So far, the petition has attracted more than 330,000 signatures following Disney's firing of Gunn on July 20 after offensive tweets resurfaced in which the filmmaker joked about topics such as pedophilia and rape. \r\n\"We fully support James Gunn. We were all shocked by his abrupt firing last week and have intentionally waited these ten days to respond in order to think, pray, listen, and discuss,\" began the letter, signed by Pratt, Bradley Cooper, Zoe Saldana, Vin Diesel, Dave Bautista, Karen Gillan, Michael Rooker, Sean Gunn and Pom Klementieff. \"In that time we have been encouraged by the outpouring of support from fans and members of the media who wish to see James reinstated as director of Volume 3, as well as discouraged by those who were so easily duped into believing the many outlandish conspiracy theories around him.\"\r\nGunn's offensive tweets were resurfaced by conservative personalities, and the Guardians stars referenced political division in the United States in the letter.\r\n\"There is little due process in the court of public opinion. James is likely not the last good person to be put on trial. Given the growing political divide in this country, it's safe to say instances like this will continue, although we hope American from across the political spectrum can ease up on the character assassinations and stop weaponizing mob mentality,\" the letter continued.\r\nIn announcing Gunn's firing on July 20, Walt Disney Studios chairman Alan Horn said, \"The offensive attitudes and statements discovered on James' Twitter feed are indefensible and inconsistent with our studio's values, and we have severed our business relationship with him.\"\r\nThough Disney and Marvel Studios had not set an official release date for Guardians of the Galaxy Vol. 3, the film had been preparing to shoot in Atlanta this fall, and Gunn had been working on a script. Gunn previously said the film would open in 2020. Gunn's two Guardians films have been big hits for Disney, with the 2014 original earning $773 million globally and last year's Guardians of the Galaxy Vol. 2 earning $863 million.\r\nBefore this letter, various castmembers had taken different approaches to publicly addressing Gunn's firing. Bautista, Rooker and the director's brother Sean Gunn had been the most outspoken in their support of the filmmaker, while Pratt had been more measured, sharing several Bible verses. This is the first statement on the subject from Cooper and Diesel.\r\nRead the letter from the cast below.\r\n\r\n\t\r\n\t\t\r\n\t\t\t\r\n\t\t\t\t \r\n\t\t\r\n\t\tAlthough I don’t support James Gunn’s inappropriate jokes from years ago, he is a good man. I’d personally love to see him reinstated as director of Volume 3. If you please, read the following statement- signed by our entire cast.\r\n\t\tA post shared by  chris pratt (@prattprattpratt) on Jul 30, 2018 at 9:41am PDT", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Chris Pratt, ‘Guardians of the Galaxy’ Cast Call for Reinstatement of James Gunn", "url": "https://www.hollywoodreporter.com/movies/movie-features/chris-pratt-would-love-see-james-gunn-reinstated-as-guardians-galaxy-3-director-1130696/", "description": "Chris Pratt and his ‘Guardians of the Galaxy’ cast have signed a letter in support of fired director James Gunn, asking for him to be reinstated.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/guardians_of_the_galaxy_vol_2_cast_at_premiere_with_james_gunn_-_getty_-_h_2018_0.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-07-30T09:54:49+00:00", "modified_time": "2018-07-30T12:47:12+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Chris Pratt, ‘Guardians of the Galaxy’ Cast Call for Reinstatement of James Gunn", "description": "Chris Pratt and his ‘Guardians of the Galaxy’ cast have signed a letter in support of fired director James Gunn, asking for him to be reinstated.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/guardians_of_the_galaxy_vol_2_cast_at_premiere_with_james_gunn_-_getty_-_h_2018_0.jpg?w=1280"}}, "movies": [], "publish_date": 1532944489.0, "source": "https://www.hollywoodreporter.com", "summary": ""}