{"url": "https://www.closerweekly.com/posts/carrie-underwood-life-back-accident-162219/", "text": "Music icon Carrie Underwood’s return to the stage in 2018 to get her life back following her scary accident has been nothing short of triumphant. First, the emotional singer received a standing ovation from her famous peers after debuting her single “Cry Pretty” at the Academy of Country Music Awards in April. When she sang the moving ballad about overcoming obstacles at the CMT Music Awards on June 6, the crowd took to its feet once more.\n\nBut even though 2018 has been a fabulous year for her so far, Carrie just noted in a new interview that last year wasn’t one of her best. “A lot happened in 2017 during my ‘off year.’ I love it when people say, ‘You took a year off.’ I’m like, ‘You know, I had this shoot and this thing, and I was writing this and doing that.’ There was always so much to do, but it was also a very soul-searching year for me,” she told Redbook Magazine.\n\nThe 35-year-old added, “There were some personal things that happened. And I had the accident and all of that to get through… and just life. Life is full of ups and downs, and I might have had a few more downs than ups last year.”\n\nJust eight months ago, Carrie didn’t know if she’d ever sing again. In November, the country star tripped and fell on a step at her Nashville home, breaking her wrist, chipping her tooth, and injuring her face so badly that she needed more than 40 stitches. Weeks later, she confessed in a letter to fans that she was “not quite looking the same” and felt uncertain about “how it’s all going to end up.” Overcome by insecurity, Carrie largely stayed out of sight — for five long months.\n\nBut now Carrie’s done hiding. “Carrie’s finally moved on,” an insider recently Life & Style. “She’s over talking about the accident in interviews and wants to let her music do the talking from now on. Friends have noticed Carrie is singing better, stronger and with more heartfelt conviction than ever before. She realizes her accident could have been far more catastrophic, leaving her unable to walk, sing, or worse. So she thanks God she’s got her life back.”\n\nCarrie credits her doctors and makeup team for helping her feel physically normal again. “She had been insecure about how she’d appear to fans, at times wondering if she’d ever return to performing live at all,” explained the insider. “But she gains more confidence each day.”\n\nFan support has helped the process. While some accused the performer of over-hyping her injuries, the insider notes that “the public’s generally positive reaction to Carrie’s return has been a big part of her healing.”\n\nBut the biggest factors in her emotional recovery have been her son and husband. “Her family really pulled Carrie through,” the insider said of Isaiah, 3, and newly retired hockey player Mike Fisher, 38. Carrie and Mike had been going through a rough patch at the time of the accident: “Their differing personalities, interests, and schedules were really affecting the marriage,” said the insider. Carrie’s strong Christian faith helped save the union, a source says, and Mike’s help with her recovery bonded them like never before. “In many ways,” noted the insider, “the accident has proved to be a blessing in disguise because it brought them closer, and they’ve been able to spend more time with each other.”\n\nAfter months of uncertainty, Carrie is looking forward to her future. She’s searching for a new, larger family home in the Nashville area, and pals have been buzzing that she’s expecting again. “Going forward, Carrie has vowed to balance career and family better,” said the insider. “She will continue to record and tour, but Mike and their family will be her main priorities.”", "images": ["https://www.closerweekly.com/wp-content/uploads/2018/08/carrie-underwood-life-accident.jpg?resize=940%2C529&quality=86&strip=all", "https://www.closerweekly.com/wp-content/themes/ami-bauer/assets/build/images/placeholders/placeholder-16x9.svg", "https://www.closerweekly.com/wp-content/uploads/2018/08/carrie-underwood-life-accident.jpg?resize=1200%2C630&quality=86&strip=all", "https://www.closerweekly.com/wp-content/uploads/2022/08/TITANIC_300x490_7_11r.gif?fit=300%2C490&quality=86&strip=all", "https://www.closerweekly.com/wp-content/themes/ami-bauer/assets/build/images/placeholders/placeholder-1x1.svg"], "top_img": "https://www.closerweekly.com/wp-content/uploads/2018/08/carrie-underwood-life-accident.jpg?resize=1200%2C630&quality=86&strip=all", "keywords": [], "authors": ["Closer Staff"], "canonical_link": "https://www.closerweekly.com/posts/carrie-underwood-life-back-accident-162219/", "title": "Carrie Underwood Talks Soul-Searching After Her Scary Accident Last Year", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "theme-color": "#ffffff", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Music icon Carrie Underwood’s return to the stage in 2018 to get her life back following her scary accident has been nothing short of triumphant. First,", "og": {"locale": "en_US", "type": "article", "title": "Carrie Underwood Talks Soul-Searching After Her Scary Accident Last Year", "description": "Music icon Carrie Underwood’s return to the stage in 2018 to get her life back following her scary accident has been nothing short of triumphant. First, the emotional singer received a standing ovation...", "url": "https://www.closerweekly.com/posts/carrie-underwood-life-back-accident-162219/", "site_name": "Closer Weekly", "updated_time": "2018-08-02T18:48:56+00:00", "image": {"identifier": "https://www.closerweekly.com/wp-content/uploads/2018/08/carrie-underwood-life-accident.jpg?resize=1200%2C630&quality=86&strip=all", "secure_url": "https://www.closerweekly.com/wp-content/uploads/2018/08/carrie-underwood-life-accident.jpg?resize=1200%2C630&quality=86&strip=all", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/closerweekly", "published_time": "2018-08-02T18:48:00+00:00", "modified_time": "2018-08-02T18:48:56+00:00"}, "author": "Closer Staff", "twitter": {"card": "summary_large_image", "title": "Carrie Underwood Talks Soul-Searching After Her Scary Accident Last Year", "description": "Music icon Carrie Underwood’s return to the stage in 2018 to get her life back following her scary accident has been nothing short of triumphant. First, the emotional singer received a standing ovation...", "image": "https://www.closerweekly.com/wp-content/uploads/2018/08/carrie-underwood-life-accident.jpg?resize=1200%2C630&quality=86&strip=all", "creator": "@closerweekly", "site": "@closerweekly"}, "fb": {"admins": 593583017, "pages": 487501061346187}, "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://www.closerweekly.com/wp-content/uploads/2020/11/android-chrome-192x192-1.png?fit=192%2C192&quality=86&strip=all"}, "movies": [], "publish_date": 1533235680.0, "source": "https://www.closerweekly.com", "summary": ""}