{"url": "https://en.wikipedia.org/wiki/RuPaul%27s_Drag_Race_(season_2)", "text": "No.\n\noverall No. in\n\nseason Title Original air date\n\n10 1 \"Gone with the Window\" February 1, 2010 ( )\n\n12 new queens enter the workroom. For their first mini-challenge, they must do a photoshoot straddling a cannon, while a high-speed fan blows them in the face. Raven wins the mini-challenge. For the main challenge, the queens must make an outfit made out of curtains and home furnishings. Due to winning the mini-challenge, Raven got to choose her curtains first. On the runway, Morgan McMichaels, Pandora Boxx and Tyra Sanchez receive positive critiques, with Morgan McMichaels winning the overall challenge. Mystique Summers Madison, Sahara Davenport and Shangela Laquifa Wadley receive negative critiques. Ru calls Mystique's outfit \"raggedy\", but is ultimately declared safe, leaving Sahara and Shangela in the bottom two. They lip-sync to \"Cover Girl (Put the Bass in Your Walk)\" by RuPaul. Sahara Davenport wins the lip-sync, leaving Shangela Laquifa Wadley to be the first queen to sashay away. Guest Judges: Mike Ruiz and Kathy Griffin\n\nMike Ruiz and Kathy Griffin Mini-Challenge: Gone with the Wind inspired photo shoot\n\ninspired photo shoot Mini-Challenge Winner: Raven\n\nRaven Main Challenge: Outfits made from curtains and home furnishings\n\nOutfits made from curtains and home furnishings Challenge Winner: Morgan McMichaels\n\nBottom Two: Sahara Davenport and Shangela Laquifa Wadley\n\nSahara Davenport and Shangela Laquifa Wadley Lip Sync Song: \"Cover Girl (Put the Bass in Your Walk)\" by RuPaul\n\n\"Cover Girl (Put the Bass in Your Walk)\" by RuPaul Eliminated: Shangela Laquifa Wadley\n\nFarewell Message: \"Love you all. Turn it out... Shangela \"DJ\"\"\n\n11 2 \"Starrbootylicious\" February 8, 2010 ( )\n\nThe remaining 11 queens are tasked with turning a mini Ru doll into a bad girl in pairs. Pandora Boxx and Sahara Davenport win the mini-challenge, making them team captains for the main challenge. For the main challenge, in teams, the queens will compete to earn the most cash while performing burlesque and selling gift certificates. Pandora chooses Morgan McMichaels, Nicole Paige Brooks, Raven, Sonique and Tatianna for her team. Sahara chooses Jessica Wild, Jujubee, Mystique Summers Madison and Tyra Sanchez for her team. While the teams are getting ready for the challenge, Tyra decides to take a nap, and not help out the rest of her team with their outfits. On the runway, category is High Class Drag. Team Sahara is declared the winning team, with Sahara winning the overall challenge. Team Pandora is the losing team. Nicole Paige Brooks and Raven are the bottom two, due to having collected the least amount of money. They lip-sync to \"My Lovin' (You're Never Gonna Get It)\" by En Vogue. Raven wins the lip-sync and Nicole Paige Brooks sashays away. Guest Judges: Kim Coles and Dita Von Teese\n\nKim Coles and Dita Von Teese Mini-Challenge: Turn \"Mini-Ru\" doll from a lady to a tramp in teams of two\n\nTurn \"Mini-Ru\" doll from a lady to a tramp in teams of two Mini-Challenge Winners: Pandora Boxx and Sahara Davenport\n\nPandora Boxx and Sahara Davenport Main Challenge: Teams compete to earn more cash performing burlesque and selling gift certificates\n\nTeams compete to earn more cash performing burlesque and selling gift certificates Runway Theme: High Class Drag\n\nHigh Class Drag Challenge Winner: Sahara Davenport\n\nBottom Two: Nicole Paige Brooks and Raven\n\nNicole Paige Brooks and Raven Lip Sync Song: \"My Lovin' (You're Never Gonna Get It)\" by En Vogue\n\n\"My Lovin' (You're Never Gonna Get It)\" by En Vogue Eliminated: Nicole Paige Brooks\n\nFarewell Message: \"Be Safe Bitch N.P. Brooks\"\n\n12 3 \"Country Queens\" February 15, 2010 ( )\n\nThe girls enter the workroom to discover a long table, where most of the girls speculate that they will have to eat something. They're asked to play a game that RuPaul calls \"Chicken, or What?\", in which they participate in a blind taste test of three foods. They have to guess if what they ate was chicken or some other fried food (\"what?\"). Morgan McMichaels and Mystique Summers Madison win and become team captains for the main challenge. For the main challenge, teams compete as feuding families in a TV commercial for Disco Shortening in country. Morgan chooses Raven, Sahara Davenport, Sonique and Tyra Sanchez for her team. Mystique chooses Jessica Wild, Jujubee, Pandora Boxx and Tatianna for her team. While learning their lines, Ru comes in the workroom and shocks the other queens, they have to switch scripts, and learn new lines. On the runway, category is County Couture. Jessica Wild, Pandora Boxx and Tyra Sanchez receive positive critiques, with Tyra Sanchez winning the challenge. Mystique Summers Madison and Raven are declared the bottom two and lip-sync to \"I Hear You Knockin'\" by Wynonna Judd. Raven wins the lip-sync and Mystique Summers Madison sashays away. Guest Judges: Kathy Najimy and Tanya Tucker\n\nKathy Najimy and Tanya Tucker Mini-Challenge: \"Chicken or What?\" eating contest\n\n\"Chicken or What?\" eating contest Mini-Challenge Winners: Mystique Summers Madison and Morgan McMichaels\n\nMystique Summers Madison and Morgan McMichaels Main Challenge: Teams compete as feuding families in a TV Commercial for Disco Shortening in Country\n\nTeams compete as feuding families in a TV Commercial for Disco Shortening in Country Runway Theme: Country Couture\n\nCountry Couture Challenge Winner: Tyra Sanchez\n\nBottom Two: Mystique Summers Madison and Raven\n\nMystique Summers Madison and Raven Lip Sync Song: \"I Hear You Knockin'\" by Wynonna Judd\n\n\"I Hear You Knockin'\" by Wynonna Judd Eliminated: Mystique Summers Madison\n\nFarewell Message: \"Balls 2 the Walls. Fishes or Bitches. You pick. Mystique.\"\n\n13 4 \"The Snatch Game\" February 22, 2010 ( )\n\n14 5 \"Here Comes the Bride\" March 1, 2010 ( )\n\nFor this week's mini-challenge, the queens have to decorate a white box using provided supplies and an item borrowed from another queen, which Raven wins. RuPaul then announces the main challenge of creating a wedding dress by altering weddings dresses provided to them. As an additional twist, the queens will be shooting wedding portraits using not only their girl drag, but their best guy drag as well by posing as both bride and groom for the portraits. Raven gets first pick of her wedding dress to alter, and then gets to pick the order the rest of the girls pick their dresses out in as well. Drama ensues as Tyra is obnoxiously singing, annoying all of the girls. On the runway, a fight breaks out between Tyra Sanchez and Tatianna. Jessica Wild, Jujubee, Raven and Tyra Sanchez all receive positive critiques, with Tyra Sanchez winning the challenge. Morgan McMichaels, Sahara Davenport and Tatianna all receive negative critiques, with Tatianna being saved due to having immunity. Morgan McMichaels and Sahara Davenport lip-sync to \"Carry On\" by Martha Wash. Sahara Davenport wins the lip-sync and Morgan McMichaels sashays away. Guest Judges: Mathu Andersen and Martha Wash\n\nMathu Andersen and Martha Wash Mini-Challenge: Decorate a box that shows who they are and they must borrow something from another contestant\n\nDecorate a box that shows who they are and they must borrow something from another contestant Mini-Challenge Winner: Raven\n\nRaven Main Challenge: Dress up as the bride and groom in a wedding photo shoot\n\nDress up as the bride and groom in a wedding photo shoot Challenge Winner: Tyra Sanchez\n\nBottom Two: Morgan McMichaels and Sahara Davenport\n\nMorgan McMichaels and Sahara Davenport Lip Sync Song: \"Carry On\" by Martha Wash\n\n\"Carry On\" by Martha Wash Eliminated: Morgan McMichaels\n\nFarewell Message: \"All you have to do is DREAM! Morgan XOXO!\"\n\n15 6 \"Rocker Chicks\" March 8, 2010 ( )\n\nThe girls arrive to RuPaul giving them a mini-challenge in which they must style a wig, giving it a glam rock makeover. Pandora is declared the winner. RuPaul reveals the remaining contestants a very special and unique challenge. They must create a rocker chick outfit and perform live vocals to a rock and roll cover to RuPaul's Ladyboy. Jessica Wild, Pandora Boxx and Raven receive positive critiques, with Jessica Wild winning the challenge. Jujubee, Sahara Davenport and Tyra Sanchez receive negative critiques, with Tyra Sanchez being saved due to having immunity. Jujubee and Sahara Davenport are the bottom two and lip-sync to \"Black Velvet\" by Alannah Myles. Jujubee wins the lip-sync and Sahara Davenport sashays away. Guest Judges: Henry Rollins and Terri Nunn\n\nHenry Rollins and Terri Nunn Mini-Challenge: Give a wig a glam rock makeover.\n\nGive a wig a glam rock makeover. Mini-Challenge Winner: Pandora Boxx\n\nPandora Boxx Main Challenge: Live rock performance of \"Lady Boy\" by RuPaul\n\nLive rock performance of \"Lady Boy\" by RuPaul Challenge Winner: Jessica Wild\n\nBottom Two: Jujubee and Sahara Davenport\n\nJujubee and Sahara Davenport Lip Sync Song: \"Black Velvet\" by Alannah Myles\n\n\"Black Velvet\" by Alannah Myles Eliminated: Sahara Davenport\n\nFarewell Message: \"Live, Love and Believe!!! XO. Sahara\"\n\n16 7 \"Once Upon a Queen\" March 22, 2010 ( )\n\nThe remaining girls are given a mini-challenge where they \"read\" (insult) the other contestants. Jujubee wins the mini-challenge, and RuPaul then gives the girls their main challenge for the week. Each contestant is to create an autobiography book cover and title that represents their own personal stories about how doing drag has impacted their lives. As an additional challenge, the girls field questions via a satellite interview, where they must not only present their autobiography but also promote a new Absolut alcoholic beverage. On the runway, Jujubee, Raven and Tyra Sanchez receive positive critiques, with Raven winning the challenge. Jessica Wild, Pandora Boxx and Tatianna receive negative critiques, with Pandora Boxx being saved. Jessica Wild and Tatianna lip-sync to He's the Greatest Dancer\" by Sister Sledge. Tatianna wins the lip-sync and Jessica Wild sashays away. Guest Judges: Gigi Levangie and Jackie Collins\n\nGigi Levangie and Jackie Collins Mini-Challenge: Reading is Fundamental\n\nReading is Fundamental Mini-Challenge Winner: Jujubee\n\nJujubee Main Challenge: Come up with and promote a concept for an autobiography\n\nCome up with and promote a concept for an autobiography Challenge Winner: Raven\n\nBottom Two: Jessica Wild and Tatianna\n\nJessica Wild and Tatianna Lip Sync Song: \"He's the Greatest Dancer\" by Sister Sledge\n\n\"He's the Greatest Dancer\" by Sister Sledge Eliminated: Jessica Wild\n\nFarewell Message: \"I love you girls! Viva P.R.! JW.\"\n\n17 8 \"Golden Gals\" March 29, 2010 ( )\n\nThis week's challenges focused entirely on age. For the mini-challenge, the girls had to match all 12 of this season's contestants to their baby pictures, including their own. Tatianna wins the mini-challenge. The main challenge consisted of the girls taking older gay men and transforming them into their drag mothers for the runway. The contestants were also expected to perform a lip-sync with their mothers to RuPaul's song \"Main Event\". Tatianna got to pick who each girl would be teamed up with as her reward for winning the mini-challenge. On the runway, Raven, Tatianna and Tyra Sanchez received positive critiques, with Raven winning the challenge. Jujubee and Pandora Boxx are the bottom two and lip-sync to \"Shake Your Love\"\" by Debbie Gibson. Jujubee wins the lip-sync and Pandora Boxx sashays away. Guest Judges: Debbie Reynolds, Cloris Leachman and Toni Ko\n\nDebbie Reynolds, Cloris Leachman and Toni Ko Mini-Challenge: Quickly match the season's 12 contestants with their baby pictures\n\nQuickly match the season's 12 contestants with their baby pictures Mini-Challenge Winner: Tatianna\n\nTatianna Main Challenge: Transform older men into drag mothers and perform a lip synch duet with them\n\nTransform older men into drag mothers and perform a lip synch duet with them Challenge Winner: Raven\n\nBottom Two: Jujubee and Pandora Boxx\n\nJujubee and Pandora Boxx Lip Sync Song: \"Shake Your Love\" by Debbie Gibson\n\n\"Shake Your Love\" by Debbie Gibson Eliminated: Pandora Boxx\n\nFarewell Message: \"Lick this Boxx, bitch. XOXO Love you all Pandora Boxx\"\n\n18 9 \"The Diva Awards\" April 12, 2010 ( )\n\nThis week's challenges focused on creating polished looks for different events. For their mini-challenge, the queens had to style and accessorize identical dresses without cutting or gluing them. Tyra is the winner, and she is placed in charge of choreographing an opening number for The Diva Awards, where the queens must put together three looks for three different Diva Award ceremonies: Teen Diva, Diva D.C. Press and Diva Hollywood Extravaganza. On the runway, Raven and Tyra Sanchez receive positive critiques, with Tyra Sanchez winning the challenge. Jujubee and Tatianna are the bottom two and lip-sync to \"Something He Can Feel\" by Aretha Franklin. Jujubee wins the lip-sync and Tatianna sashays away. Guest Judges: Tatum O'Neal and Marissa Jaret Winokur\n\nTatum O'Neal and Marissa Jaret Winokur Mini-Challenge: Style and accessorize one of four identical dresses\n\nStyle and accessorize one of four identical dresses Mini-Challenge Winner: Tyra Sanchez\n\nTyra Sanchez Main Challenge: The Diva Awards\n\nThe Diva Awards Runway Themes: Teen Diva, Diva D.C. Press, and Diva Hollywood Extravaganza\n\nTeen Diva, Diva D.C. Press, and Diva Hollywood Extravaganza Challenge Winner: Tyra Sanchez\n\nBottom Two: Jujubee and Tatianna\n\nJujubee and Tatianna Lip Sync Song: \"Something He Can Feel\" by Aretha Franklin\n\n\"Something He Can Feel\" by Aretha Franklin Eliminated: Tatianna\n\nFarewell Message: \"Do you 2 the FULLEST! Love TATI\"\n\n19 10 \"The Main Event Clip Show\" April 19, 2010 ( )\n\nHighlights and outtakes from the second season's first nine episodes. RuPaul reveals some never-before-seen, behind the scenes moments including the queens impersonating each other, the contestants' family relationships and the unseen moments on the main stage. This is followed by a fast-forward flashback recap of the entire season, followed by an up-close and personal look at the final 3. Season 1 contestants Ongina, Shannel, and season 1 winner BeBe Zahara Benet join RuPaul to count down the top ten most unforgettable fits and fashions from the season.\n\n20 11 \"Grand Finale\" April 26, 2010 ( )\n\nMerle and Santino arrive to tell the last three queens about their final challenge - dressing in their best 80s outfits and shooting the music video for RuPaul's next single: \"Jealous of My Boogie\". They will work with guests who include reality star Robert Verdi, who will help the girls with fashion, make-up artist Mathu Andersen, who will direct the video and choreographer Ryan Heffington, who will coach them in a small fight sequence a la Dynasty.[16] During the shoot, each girl is given a certain script, where they confront RuPaul and get slapped. Main Challenge: Shooting a music video for \"Jealous Of My Boogie (Gomi and RasJek Edit)\" and acting in a scripted scene with RuPaul inspired by Dynasty\n\nShooting a music video for \"Jealous Of My Boogie (Gomi and RasJek Edit)\" and acting in a scripted scene with RuPaul inspired by Eliminated: Jujubee\n\nFarewell Message: \" You are your own worst critic... let go, forgive, & live. Love, Juju B. \"\n\n\" \" Top Two: Raven and Tyra Sanchez\n\nRaven and Tyra Sanchez Lip Sync Song: \"Jealous Of My Boogie (Gomi and RasJek Edit)\" By Rupaul\n\n\"Jealous Of My Boogie (Gomi and RasJek Edit)\" By Rupaul Runner-up: Raven\n\nFarewell Message: \" Keep reaching for the stars, because you'll never be one - Raven \"\n\n\" \" Winner of RuPaul's Drag Race Season Two: Tyra Sanchez\n\n21 12 \"Reunion\" April 26, 2010 ( )", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/9/96/RuPauls-Drag-Race-S2.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/RuPauls-Drag-Race-S2.jpg/220px-RuPauls-Drag-Race-S2.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/9/96/RuPauls-Drag-Race-S2.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/RuPaul%27s_Drag_Race_(season_2)", "title": "RuPaul's Drag Race (season 2)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/9/96/RuPauls-Drag-Race-S2.jpg", "width": 640, "height": 958}, "title": "RuPaul's Drag Race (season 2) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}