{"url": "https://www.hollywoodreporter.com/thr-esq/keshas-mother-drops-counterclaims-dr-888275", "text": "The dispute between Kesha Rose Sebert and her producer Dr. Luke (Lukasz Gottwald) is hardly over, but the producer has now dodged claims brought by Kesha’s mother, Pebe Sebert.\n\nKesha and Dr. Luke continue to square off with each over her allegations that he sexually abused her and his allegations that she is attempting to repudiate a recording agreement. So far, he’s gotten the upper hand. A New York judge rejected her bid for a preliminary injunction and earlier this month, dismissed all but one of her counterclaims.\n\nThe litigation is taking place in three states. Besides what’s happening in New York, there’s also a paused California lawsuit brought by Kesha as well as a battle between Dr. Luke and Pebe in Tennessee.\n\nIn the Tennessee action, Dr. Luke is suing Pebe on claims of defamation and tortious interference. According to the complaint, Kesha schemed with her mother to elevate a contract disagreement into a “smearing” of Dr. Luke, and when alleged extortion failed, circulated emails to bloggers and others in the industry accusing Dr. Luke of rape.\n\nIn response, Pebe filed counterclaims of intentional and negligent infliction of emotional distress based on the alleged abuse directed at Kesha. She also claimed misrepresentations and fraudulent inducement by asserting that Dr. Luke had promised that she would be involved in her daughter’s career including as a songwriter.\n\nOn Tuesday, Pebe voluntarily dismissed those counterclaims. She’s also recently split with attorney Mark Geragos.\n\n“The litigation with Dr. Luke has been a nightmare for Mrs. Sebert and her family,” said Alex Little, Pebe’s attorney. “She has decided to move on and find peace and forgiveness in her heart rather than dwelling in the cancerous past of an ongoing lawsuit with no end in sight.”\n\n“Pebe Sebert’s voluntary withdrawal of all her claims against Dr. Luke is her acknowledgement that her claims are meritless,” says Christine Lepera, attorney for Dr. Luke. “Dr. Luke’s defamation and other claims continue against Pebe and Kesha Sebert.”\n\nThe denial of the preliminary injunction is now going up to a New York appeals court while Dr. Luke’s attorneys plan to depose Kesha and Pebe in June. In the California case, a status conference is upcoming that may determine whether a stay is lifted.", "images": ["https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2016/02/kesha_and_dr_luke_split-_getty-h_2016.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/uploads/2016/02/kesha_and_dr_luke_split-_getty-h_2016.jpg?w=1296&h=730&crop=1", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2016/02/kesha_and_dr_luke_split-_getty-h_2016.jpg?w=1024", "keywords": [], "authors": ["Eriq Gardner"], "canonical_link": "https://www.hollywoodreporter.com/business/business-news/keshas-mother-drops-counterclaims-dr-888275/", "title": "Kesha’s Mother Drops Counterclaims Against Dr. Luke", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Pebe Sebert had accused the hitmaker of causing her distress and lying about how she would be involved in her daughter's career.", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Eriq Gardner", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 888275, "title": "Kesha's Mother Drops Counterclaims Against Dr. Luke", "published_at": "2016-04-27 12:39:47", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/02/kesha_and_dr_luke_split-_getty-h_2016.jpg?w=1024", "comment_count": 0, "topics": "Business News", "body": "The dispute between Kesha Rose Sebert and her producer Dr. Luke (Lukasz Gottwald) is hardly over, but the producer has now dodged claims brought by Kesha's mother, Pebe Sebert.\r\nKesha and Dr. Luke continue to square off with each over her allegations that he sexually abused her and his allegations that she is attempting to repudiate a recording agreement. So far, he's gotten the upper hand. A New York judge rejected her bid for a preliminary injunction and earlier this month, dismissed all but one of her counterclaims.\r\nThe litigation is taking place in three states. Besides what's happening in New York, there's also a paused California lawsuit brought by Kesha as well as a battle between Dr. Luke and Pebe in Tennessee.\r\nIn the Tennessee action, Dr. Luke is suing Pebe on claims of defamation and tortious interference. According to the complaint, Kesha schemed with her mother to elevate a contract disagreement into a \"smearing\" of Dr. Luke, and when alleged extortion failed, circulated emails to bloggers and others in the industry accusing Dr. Luke of rape.\r\nIn response, Pebe filed counterclaims of intentional and negligent infliction of emotional distress based on the alleged abuse directed at Kesha. She also claimed misrepresentations and fraudulent inducement by asserting that Dr. Luke had promised that she would be involved in her daughter's career including as a songwriter.\r\nOn Tuesday, Pebe voluntarily dismissed those counterclaims. She's also recently split with attorney Mark Geragos.\r\n\"The litigation with Dr. Luke has been a nightmare for Mrs. Sebert and her family,\" said Alex Little, Pebe's attorney. \"She has decided to move on and find peace and forgiveness in her heart rather than dwelling in the cancerous past of an ongoing lawsuit with no end in sight.\"\r\n\"Pebe Sebert's voluntary withdrawal of all her claims against Dr. Luke is her acknowledgement that her claims are meritless,\" says Christine Lepera, attorney for Dr. Luke. \"Dr. Luke's defamation and other claims continue against Pebe and Kesha Sebert.\"\r\nThe denial of the preliminary injunction is now going up to a New York appeals court while Dr. Luke's attorneys plan to depose Kesha and Pebe in June. In the California case, a status conference is upcoming that may determine whether a stay is lifted.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Kesha’s Mother Drops Counterclaims Against Dr. Luke", "url": "https://www.hollywoodreporter.com/business/business-news/keshas-mother-drops-counterclaims-dr-888275/", "description": "Pebe Sebert had accused the hitmaker of causing her distress and lying about how she would be involved in her daughter’s career.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2016/02/kesha_and_dr_luke_split-_getty-h_2016.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2016-04-27T12:39:47+00:00", "modified_time": "2016-04-27T15:35:10+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Kesha’s Mother Drops Counterclaims Against Dr. Luke", "description": "Pebe Sebert had accused the hitmaker of causing her distress and lying about how she would be involved in her daughter’s career.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/02/kesha_and_dr_luke_split-_getty-h_2016.jpg?w=1296"}}, "movies": [], "publish_date": 1461760787.0, "source": "https://www.hollywoodreporter.com", "summary": ""}