{"url": "https://www.nbcnews.com/news/nbcblk/moon-s-path-front-sun-eclipsed-malia-obama-s-harvard-n795386", "text": "As millions across country fixed their eyes on the sky for a glimpse of the cosmic event of the decade, the Obamas seized the moment.\n\nAs solar eclipse selfies flooded social media timelines and cable news streamed continuous coverage, the former first family took the opportunity to move Malia Obama into her freshman dorm at Harvard University — out of the spotlight — on Monday.\n\nIn a video posted on Facebook, the 19-year-old is seen on campus with former president Barack Obama and former first lady Michelle Obama by her side. Other video shows the president and the first lady wearing dark sunglasses walking out of what some say was Malia's dorm and getting into a SUV as a crowd of onlookers cheer.\n\nMalia Obama smiles as she boards Air Force One before departing from Andrews Air Force Base on April 7, 2016 in Maryland. Mandel Ngan / AFP - Getty Images file\n\nUnlike the pandemonium that occurred at Stanford University when Chelsea Clinton arrived with Secret Service agents and over a hundred reporters on the day of freshman move-in, the scene at Harvard was less chaotic. With so many people preoccupied with the solar eclipse and the official freshman move-in day taking place Tuesday, the Obamas’ presence on campus drew less attention.\n\nIn a photo posted online by the Daily Mail, Malia is seen outside the dorm the next day wearing a black outfit and white sneakers holding a bottle of water while chatting with what appears to be a group of students.\n\nRelated: Malia Obama to Attend Harvard University\n\nJust like the Bush daughters attended the former colleges of their parents — Jenna, the University of Texas at Austin like their mother and Barbara, Yale University like their father — Malia is also keeping a college tradition in the family. Both Barack and Michelle Obama received their law degrees from Harvard. Caroline Kennedy, daughter of former president John F. Kennedy is also a graduate of Harvard.\n\nMalia had reportedly toured six out of eight Ivy Leagues and other schools, but her parents say they encouraged her to not choose a college because of the name.\n\n“One piece of advice that I’ve given her is not to stress too much about having to get into one particular college,” former president Obama said at a town hall in Des Moines, Iowa on college affordability in 2015.\n\nMalia Obama's hair flies into the air as a cold wind hits her and President Barack Obama while descending the steps of Air Force One upon their arrival at O'Hare Airport in Chicago on April 7, 2016. KEVIN LAMARQUE / Reuters\n\nAfter graduating from Sidwell Friends School in 2016, the oldest Obama daughter decided to take a “gap year” before joining the Class of 2021.\n\nMalia not only got some down time traveling with family, but interned in New York City at The Weinstein Co., a film production company founded by Bob and Harvey Weinstein. Mrs. Obama has said Malia is interested in being a filmmaker. She interned with HBO’s “Girls” and she also worked as a production assistant on Halle Berry’s show, “Extant.”\n\nMalia was 10-years-old when she came into the national limelight after her father was elected the first Black president in 2008. After growing up in the White House, she is starting a new chapter as a young woman away from her parents and Washington.\n\nRelated: Barack Obama and Joe Biden Save the Future in ‘Barry & Joe: The Animated Series’\n\nFormer president Obama is known to get emotional when talking about his daughters growing up. In an interview with Ellen DeGeneres in 2016, Obama joked he would be wearing “dark glasses, sobbing” at Malia’s graduation. He declined an invitation to speak at Malia’s graduation in 2016, because he said he would be emotional.\n\nThe first day of fall classes at Harvard is August 30, 2017.\n\nFollow NBCBLK on Facebook, Twitter & Instagram", "images": ["https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2016_14/1488661/ss-160407-tip-02.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_34/2130891/170823-malia-obama-ac-813p.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2017_34/2130891/170823-malia-obama-ac-813p.jpg"], "top_img": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_34/2130891/170823-malia-obama-ac-813p.jpg", "keywords": [], "authors": ["Chandelis R. Duster", "Chandelis R. Duster Is Reporter For Nbc News."], "canonical_link": "https://www.nbcnews.com/news/nbcblk/moon-s-path-front-sun-eclipsed-malia-obama-s-harvard-n795386", "title": "Moon's Path In Front of Sun Eclipsed Malia Obama's Harvard Move-In", "meta_data": {"msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/nbcnews/all-other-sizes-PNG.ico/browserconfig.xml", "robots": "max-image-preview:large", "fb": {"app_id": 10150138890205613, "pages": 1508175089456029}, "og": {"site_name": "NBC News", "locale": "en_US", "url": "https://www.nbcnews.com/news/nbcblk/moon-s-path-front-sun-eclipsed-malia-obama-s-harvard-n795386", "title": "Obamas ditched the eclipse for Malia’s Harvard move-in", "description": "As people across the country watched the eclipse, photos and videos show the Obamas dropping off Malia at Harvard.", "image": {"identifier": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_34/2130891/170823-malia-obama-ac-813p.jpg", "secure_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_34/2130891/170823-malia-obama-ac-813p.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@NBCNews", "creator": "NBCNews", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1024-512,f_auto,q_auto:best/newscms/2017_34/2130891/170823-malia-obama-ac-813p.jpg", "title": "Obamas ditched the eclipse for Malia’s Harvard move-in", "description": "As people across the country watched the eclipse, photos and videos show the Obamas dropping off Malia at Harvard.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1, user-scalable=yes", "description": "As people across the country watched the eclipse, photos and videos show the Obamas dropping off Malia at Harvard.", "branch": {"deeplink": {"title": "Obamas ditched the eclipse for Malia’s Harvard move-in", "description": "As people across the country watched the eclipse, photos and videos show the Obamas dropping off Malia at Harvard.", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_34/2130891/170823-malia-obama-ac-813p.jpg", "type": "article", "unibrow": "NBCBLK", "authorName1": "Chandelis R. Duster"}}, "article": {"opinion": "false", "content_tier": "free", "published": "Thu Aug 24 2017 02:50:00 GMT+0000 (UTC)", "modified": "Thu Aug 24 2017 03:03:10 GMT+0000 (UTC)"}, "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x768_scale,f_auto,q_auto:best/newscms/2017_34/2130891/170823-malia-obama-ac-813p.jpg", "next-head-count": 92}, "movies": [], "publish_date": 1503543000.0, "source": "https://www.nbcnews.com", "summary": ""}