{"url": "https://www.hollywoodreporter.com/heat-vision/bryan-singer-fired-directing-queen-biopic-set-chaos-1063977", "text": "Bryan Singer has been fired from the movie Bohemian Rhapsody, 20th Century Fox has told The Hollywood Reporter.\n\n“Bryan Singer is no longer the director of Bohemian Rhapsody,” the studio said Monday in a statement.\n\nThe decision reflected an escalating clash between Singer and actor Rami Malek and was caused by the helmer being missing from the set, necessitating the Dec. 1 production shutdown of the film in which Malek stars as Freddie Mercury, frontman of the rock group Queen. The pic has been shooting in London.\n\nIn announcing the shutdown last week, producers Fox, New Regency and Graham King initially said filming was being suspended because of Singer’s “unexpected unavailability.”\n\nDenying he acted unprofessionally, Singer claimed the studio refused to allow him to tend to “a gravely ill parent” as well as to his own health. “I wanted nothing more than to be able to finish this project and help honor the legacy of Freddie Mercury and Queen,” he said in a statement, “but Fox would not permit me to do so because I needed to temporarily put my health, and the health of my loved ones, first.”\n\nTrouble began when Singer went missing during production on several occasions. His no-shows resulted in cinematographer Newton Thomas Sigel having to step in to helm some of the days while Singer was absent.\n\nTom Hollander, who plays Queen manager Jim Beach, also is said to have briefly quit the film because of Singer’s behavior, but was persuaded to return, according to one source.\n\nMalek complained to the studio, charging Singer with not being present on set, unreliability and unprofessionalism.\n\nSinger had been warned before production began by both Fox Film chairman and CEO Stacey Snider and Fox Film vice chairman and president of production Emma Watts that they wouldn’t tolerate any unprofessional behavior on his part. A representative from the Directors Guild of America also arrived on set to monitor the situation.\n\nThe growing tension led to a confrontation between Singer and Malek, which, while it did not become physical, did involve Singer throwing an object. Subsequently, however, the two are said to have settled their differences and filming was expected to resume.\n\nBut then Singer did not return to the set after the Thanksgiving break and is believed to have been in the U.S. for about the last 10 days, according to one source. In his absence, Sigel stepped in to helm several days of shooting before the production was shut down. Singer’s prolonged absence was the final straw, and so the studio decided to terminate him under his pay-or-play contract.\n\nAccording to another insider, Singer has claimed he is suffering from post-traumatic stress disorder because of the tensions on the set.\n\nIn his statement, Singer said, ““Rumors that my unexpected departure from the film was sparked by a dispute I had with Rami Malek are not true. While, at times, we did have creative differences on set, Rami and I successfully put those differences behind us and continued to work on the film together until just prior to Thanksgiving.”\n\nThe studio, which has about two more weeks of principal photography remaining on the film, is expected to name a new director within the next few days.\n\nDec. 4, 7:10 p.m. Singer’s statements added.\n\n(Aaron Couch contributed to this report.)", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/12/bryan_singer.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/bryan_singer.jpg?w=1296&h=730&crop=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/bryan_singer.jpg?w=1024", "keywords": [], "authors": ["Borys Kit Kim Masters", "Borys Kit", "Kim Masters"], "canonical_link": "https://www.hollywoodreporter.com/movies/movie-news/bryan-singer-fired-directing-queen-biopic-set-chaos-1063977/", "title": "Bryan Singer Fired From Directing Queen Biopic After On-Set Chaos (Exclusive)", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Fox halted production Dec. 1, saying it was because of the \"unexpected unavailability\" of the helmer.", "news_keywords": "Bryan Singer", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Kim Masters", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1063977, "title": "Bryan Singer Fired From Directing Queen Biopic After On-Set Chaos (Exclusive)", "published_at": "2017-12-04 13:56:13", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/bryan_singer.jpg?w=1024", "comment_count": 0, "tags": "Bryan Singer", "topics": "Movies", "body": "Bryan Singer has been fired from the movie Bohemian Rhapsody, 20th Century Fox has told The Hollywood Reporter.\r\n“Bryan Singer is no longer the director of Bohemian Rhapsody,\" the studio said Monday in a statement.\r\nThe decision reflected an escalating clash between Singer and actor Rami Malek and was caused by the helmer being missing from the set, necessitating the Dec. 1 production shutdown of the film in which Malek stars as Freddie Mercury, frontman of the rock group Queen. The pic has been shooting in London.\r\nIn announcing the shutdown last week, producers Fox, New Regency and Graham King initially said filming was being suspended because of Singer's \"unexpected unavailability.\" \r\nDenying he acted unprofessionally, Singer claimed the studio refused to allow him to tend to \"a gravely ill parent\" as well as to his own health. “I wanted nothing more than to be able to finish this project and help honor the legacy of Freddie Mercury and Queen,\" he said in a statement, \"but Fox would not permit me to do so because I needed to temporarily put my health, and the health of my loved ones, first.”\r\nTrouble began when Singer went missing during production on several occasions. His no-shows resulted in cinematographer Newton Thomas Sigel having to step in to helm some of the days while Singer was absent.\r\n\r\nTom Hollander, who plays Queen manager Jim Beach, also is said to have briefly quit the film because of Singer's behavior, but was persuaded to return, according to one source.\r\nMalek complained to the studio, charging Singer with not being present on set, unreliability and unprofessionalism. \r\nSinger had been warned before production began by both Fox Film chairman and CEO Stacey Snider and Fox Film vice chairman and president of production Emma Watts that they wouldn't tolerate any unprofessional behavior on his part. A representative from the Directors Guild of America also arrived on set to monitor the situation. \r\nThe growing tension led to a confrontation between Singer and Malek, which, while it did not become physical, did involve Singer throwing an object. Subsequently, however, the two are said to have settled their differences and filming was expected to resume.\r\nBut then Singer did not return to the set after the Thanksgiving break and is believed to have been in the U.S. for about the last 10 days, according to one source. In his absence, Sigel stepped in to helm several days of shooting before the production was shut down. Singer's prolonged absence was the final straw, and so the studio decided to terminate him under his pay-or-play contract.\r\nAccording to another insider, Singer has claimed he is suffering from post-traumatic stress disorder because of the tensions on the set. \r\nIn his statement, Singer said, \"“Rumors that my unexpected departure from the film was sparked by a dispute I had with Rami Malek are not true.  While, at times, we did have creative differences on set, Rami and I successfully put those differences behind us and continued to work on the film together until just prior to Thanksgiving.”\r\nThe studio, which has about two more weeks of principal photography remaining on the film, is expected to name a new director within the next few days. \r\nDec. 4, 7:10 p.m. Singer's statements added.\r\n(Aaron Couch contributed to this report.)", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Bryan Singer Fired From Directing Queen Biopic After On-Set Chaos (Exclusive)", "url": "https://www.hollywoodreporter.com/movies/movie-news/bryan-singer-fired-directing-queen-biopic-set-chaos-1063977/", "description": "Fox halted production Dec. 1, saying it was because of the “unexpected unavailability” of the helmer.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/bryan_singer.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-12-04T13:56:13+00:00", "modified_time": "2017-12-06T16:36:10+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Bryan Singer Fired From Directing Queen Biopic After On-Set Chaos (Exclusive)", "description": "Fox halted production Dec. 1, saying it was because of the “unexpected unavailability” of the helmer.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/bryan_singer.jpg?w=1296"}}, "movies": [], "publish_date": 1512395773.0, "source": "https://www.hollywoodreporter.com", "summary": ""}