{"url": "https://www.usatoday.com/story/sports/olympics/2018/01/19/jordyn-wieber-2012-olympic-gold-medalist-makes-statement-sexual-abuse-against-larry-nassar/1047464001/", "text": "Jordyn Wieber, a 2012 Olympic gold medalist, makes statement of sexual abuse against Larry Nassar\n\nShow Caption Hide Caption Olympian Jordyn Wieber describes Nassar abuse Another Olympic gold medalist, Jordyn Wieber, has come forward to say that she too was sexually assaulted by former sports doctor Larry Nassar. \"I was not protected and neither were my teammates,\" she said. (Jan. 19) AP\n\nLANSING — Jordyn Wieber, a DeWitt native and 2012 Olympic gold medalist, is in court today to make a victim impact statement about Larry Nassar.\n\n\"I thought that training for the Olympics would be hardest thing I would ever have to do. But the hardest thing I’ve ever had to do is process that I am a victim of Larry Nassar.\" she said.\n\nIt is the first time she has spoken publicly about Nassar since the sex abuse scandal became public in 2016.\n\nWieber is the fourth member of the Fierce Five — the nickname given to the 2012 U.S. women’s gymnastics team — to say Nassar sexually abused her, joining Gabby Douglas, McKayla Maroney and Aly Raisman.\n\nRaisman accompanied Wieber to Judge Rosemarie Aquilina’s courtroom this morning and also is expect to make a statement.\n\nWieber said she began seeing Nassar at age 8, but first had the treatment that has resulted criminal charges after an injury when she as 14.\n\nWATCH LIVE:Day 4 of Larry Nassar's sentencing hearing\n\nShe said she discussed the treatment with teammates, saying it made her uncomfortable. She said she accepted the need for treatments in order to keep competing.\n\n\"To this day, I don't know how he could have been allowed to do this for so long,\" she said.\n\nShe spoke in detail of the access USA Gymnastics gave to Nassar, allowing him to treat gymnasts in hotel rooms, at national training camps and other venues, often being alone with the gymnasts.\n\n\"I am angry with myself for not recognizing the abuse, and that's something I'm struggling with today,\" Wieber said.\n\n\"The people who are responsible need to accept accountability,\" she said.\n\nFriday is the fourth day of Nassar’s sentencing hearing. He pleaded guilty in November to seven first-degree criminal sexual conduct charges here in Ingham County. On Jan. 31, he’ll be sentenced on three of the same charges in Eaton County, where he also pleaded guilty in November. The plea deals mirrored each other and set the range for the low end of Nassar sentence between 25 and 40 years in prison, with the maximum sentence being up to life. The plea deal included a provision that more than 100 women and girls be given the chance to give an impact statement, if they wanted to do so.\n\nThe Michigan Attorney General’s Office has asked for Nassar to be sentenced to 40 to 125 years in prison, the high end representing a year for every woman and girl who reported to police that Nassar abused them. Those 125 women and girls include gymnasts, former gymnasts, former Michigan State University athletes, former patients of Nassar’s and a woman he sexually abused in his home when she was a child.\n\nNassar worked for MSU and with USA Gymnastics for decades.\n\nOn Thursday, Assistant Attorney General Angela Povilaitis, the lead prosecutor in Nassar’s case, read a written statement from Maroney.\n\nWhen she was 15, Maroney said in her statement, Nassar gave her a sleeping pill for a flight to Tokyo. When she woke up, she was in Nassar’s hotel room, getting \"treatment.”\n\n“I had a dream to go to the Olympics, and the things that I had to endure to get there, were unnecessary, and disgusting,” Maroney said.\n\nLike many of the victims who have addressed the judge, Maroney criticized USA Gymnastics and MSU for failing to stop Nassar.\n\n“A question that has been asked over and over is: How could have Larry Nassar been allowed to assault so many women and girls for more than two decades?” Maroney said. “The answer to that question lies in the failure of not one, but three major institutions to stop him — Michigan State University, USA Gymnastics and the United States Olympic Committee.”\n\nFriday had been scheduled to be the conclusion to a four-day sentencing hearing, which last week was expected to include victim-impact statements from 88 women and girls. That number increased each day of the hearing, reaching 105 by Thursday morning.\n\nNassar is now expected to be sentenced on Monday, with the judge saying Tuesday is also a possibility.\n\nIn December, a federal judge sentenced Nassar to 60 years in prison on three child pornography charges. He must serve the entirety of his federal sentence before serving any time on the state charges.", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/29906170001/29906170001_5715195733001_5715186758001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/-mm-/0564ded15cb5a11bcdb2b5d635ec7818f200619f/c=244-211-2056-1235/local/-/media/2018/01/19/USATODAY/USATODAY/636519517259648043-iA01-WIEBER-GYMN-OLY.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/0564ded15cb5a11bcdb2b5d635ec7818f200619f/c=244-211-2056-1235/local/-/media/2018/01/19/USATODAY/USATODAY/636519517259648043-iA01-WIEBER-GYMN-OLY.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Matt Mencarini", "Beth Leblanc"], "canonical_link": "https://www.usatoday.com/story/sports/olympics/2018/01/19/jordyn-wieber-2012-olympic-gold-medalist-makes-statement-sexual-abuse-against-larry-nassar/1047464001/", "title": "Jordyn Wieber, a 2012 Olympic gold medalist, makes statement of sexual abuse against Larry Nassar", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/sports/olympics/2018/01/19/jordyn-wieber-2012-olympic-gold-medalist-makes-statement-sexual-abuse-against-larry-nassar/1047464001/sports/olympics", "theme-color": "#ffffff", "og": {"type": "article", "title": "Jordyn Wieber, a 2012 Olympic gold medalist, makes statement of sexual abuse against Larry Nassar", "description": "U.S. gymnast Jordyn Wieber, a 2012 Olympic gold medalist, made a statement in court Friday accusing Larry Nassar of sexual abuse.", "site_name": "Lansing State Journal", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/0564ded15cb5a11bcdb2b5d635ec7818f200619f/c=244-211-2056-1235/local/-/media/2018/01/19/USATODAY/USATODAY/636519517259648043-iA01-WIEBER-GYMN-OLY.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "U.S. gymnast Jordyn Wieber, a 2012 Olympic gold medalist, made a statement in court Friday accusing Larry Nassar of sexual abuse.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1516320000.0, "source": "https://www.usatoday.com", "summary": ""}