{"url": "https://www.hollywoodreporter.com/live-feed/demario-jackson-bachelor-paradise-interview-im-not-monster-1031911", "text": "DeMario Jackson made his awaited TV return on Tuesday’s Bachelor in Paradise.\n\n“I’m in a much better place in my life,” Jackson told host Chris Harrison, comparing his current status to one month prior when he was embroiled in the ABC reality show’s controversy. “June 11 was very difficult for myself, my family, my friends, my mother.”\n\nJackson, speaking to Harrison during a pre-taped studio special, said he immediately bonded with castmate Corinne Olympios over their “villain” personas from past stints on the franchise when they landed on the set of Paradise earlier this summer. They met and hooked up within an hour of starting to film the season on June 4.\n\n“We got turnt up,” he recalled of their encounter. Though the incident was caught on tape, ABC only aired their interactions leading up when Paradise premiered last week. “We’re at the bar, we’re hanging out. One thing leads to another and we’re making out … The pool gets a little intense and I didn’t think anything of it.”\n\nHe added, “Who would say ‘no’ to Corinne?”\n\nWithin days, an allegation of sexual misconduct between the pair launched an on-set investigation that suspended filming for nearly two weeks. Ultimately, producers Warner Bros. Television found no misconduct and resumed filming on the Mexico set.\n\nJackson reiterated what he had previously told The Hollywood Reporter, that a third party filed the complaint and he remains confused about why the show shut down if the issue didn’t stem from him or Olympios. The third-party complaint was filed by a producer, who Jackson claims he only knows as Olympios‘ best friend. (Olympios‘ rep said Jackson should refer his questions to proucers.) Jackson said that producer, along with a second producer who later filed a similar complaint, left set before he did.\n\nABC has not provided any details about the producers, or what motivated them to file their complaints.\n\n“I never once thought that I would be here, today, speaking to you guys amid a crazy scandal,” he said, admitting that the whole situation, coming on the heels of his disastrous Bachelorette stint, made him reevaluate himself and his decisions.\n\nHe then broke down in tears recounting what he and his family then went through, especially his mother.\n\n“You were being accused of sexual assault,” said Harrison.\n\n“That’s every man’s biggest fear,” he replied.\n\nRecalling a false report that stated he took a “limp Corinne” out of the pool and had “sex with her,” Jackson said, “I know I’m not that monster they’re trying to portray on TV.”\n\nHe also noted the “aggressive” and “intense” slut-shaming Olympios experienced on her end. The pair has yet to speak.\n\nThe sit-down broke the traditional format on the summer spinoff series and resembled the Bachelor and Bachelorette post-show special, After the Final Rose, with franchise alums and castmembers making appearances before a live audience. The studio edition aired during the second half of Tuesday’s episode, following an hour of traditional Paradise drama.\n\nBefore Jackson made his entrance, Harrison spoke to castmembers Raven Gates, Jasmine Goode, Derek Peth, Diggy Moreland and Robby Hayes. All five contestants were part of the original cast who were there for the shutdown.\n\nOnce again, the castmembers relived what happened, how production shut down and the fallout, pointing fingers away from the show and towards the media and public jury.\n\n“It was disgusting how they were portraying DeMario as someone that committed this ‘sexual assault crime,'” Gates said of the media coverage. “Reading those articles, there was maybe 10 percent of information that we connected with and 90 percent that was just made up,” added Peth.\n\nGoode said the cast witnessed what happened and from what they saw, no one was a victim, referencing Olympios‘ statement made during the investigation. “I thought she was into him and I thought he was into her,” she said.\n\nNext week ABC will air Harrison’s one-on-one sit-down with Olympios, who has been less outspoken in sharing her experience.\n\nShortly after the controversy broke, the 25-year-old said, “I am a victim and have spent the last week trying to make sense of what happened on June 4.” ABC reality chief Robert Mills told THR that Olympios will clarify what she meant.\n\n“She says, ‘I used the word victim, but let me explain what that meant,’” he said. “I think she felt badly about what DeMario went through as well, so you’ll see both of them discussing that. They had these statements that completely got twisted or misconstrued where it was being asked what they meant. I think they wanted to say in a stronger, more expansive forum, ‘This is what I meant by that. … This is my version of what happened that night.’ And just get the story out there so we can put this thing to bed once and for all.”", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/08/147277_4915_-_h_2017.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/147277_4915_-_h_2017.jpg?w=1296&h=730&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/147277_4915_-_h_2017.jpg?w=1024", "keywords": [], "authors": ["Jackie Strause"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/demario-jackson-bachelor-paradise-interview-im-not-monster-1031911/", "title": "‘Bachelor in Paradise’ Star DeMario Jackson Returns in Tearful TV Interview", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The ABC reality star made his first appearance on the franchise since leaving 'Paradise' in scandal this summer.", "news_keywords": "Bachelor In Paradise", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jackie Strause", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1031911, "title": "'Bachelor in Paradise' Star DeMario Jackson Returns in Tearful TV Interview", "published_at": "2017-08-22 19:31:34", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/147277_4915_-_h_2017.jpg?w=1024", "comment_count": 0, "tags": "Bachelor In Paradise", "topics": "TV News", "body": "DeMario Jackson made his awaited TV return on Tuesday's Bachelor in Paradise.\r\n\"I'm in a much better place in my life,\" Jackson told host Chris Harrison, comparing his current status to one month prior when he was embroiled in the ABC reality show's controversy. \"June 11 was very difficult for myself, my family, my friends, my mother.\"\r\nJackson, speaking to Harrison during a pre-taped studio special, said he immediately bonded with castmate Corinne Olympios over their \"villain\" personas from past stints on the franchise when they landed on the set of Paradise earlier this summer. They met and hooked up within an hour of starting to film the season on June 4.\r\n\"We got turnt up,\" he recalled of their encounter. Though the incident was caught on tape, ABC only aired their interactions leading up when Paradise premiered last week. \"We're at the bar, we're hanging out. One thing leads to another and we're making out ... The pool gets a little intense and I didn't think anything of it.\"\r\nHe added, \"Who would say 'no' to Corinne?\"\r\n\r\nWithin days, an allegation of sexual misconduct between the pair launched an on-set investigation that suspended filming for nearly two weeks. Ultimately, producers Warner Bros. Television found no misconduct and resumed filming on the Mexico set.\r\nJackson reiterated what he had previously told The Hollywood Reporter, that a third party filed the complaint and he remains confused about why the show shut down if the issue didn't stem from him or Olympios. The third-party complaint was filed by a producer, who Jackson claims he only knows as Olympios' best friend. (Olympios' rep said Jackson should refer his questions to proucers.) Jackson said that producer, along with a second producer who later filed a similar complaint, left set before he did.\r\nABC has not provided any details about the producers, or what motivated them to file their complaints.\r\n\"I never once thought that I would be here, today, speaking to you guys amid a crazy scandal,\" he said, admitting that the whole situation, coming on the heels of his disastrous Bachelorette stint, made him reevaluate himself and his decisions. \r\nHe then broke down in tears recounting what he and his family then went through, especially his mother.\r\n\"You were being accused of sexual assault,\" said Harrison.\r\n\"That's every man's biggest fear,\" he replied.\r\nRecalling a false report that stated he took a \"limp Corinne\" out of the pool and had \"sex with her,\" Jackson said, \"I know I'm not that monster they're trying to portray on TV.\"\r\nHe also noted the \"aggressive\" and \"intense\" slut-shaming Olympios experienced on her end. The pair has yet to speak.\r\n\r\nThe sit-down broke the traditional format on the summer spinoff series and resembled the Bachelor and Bachelorette post-show special, After the Final Rose, with franchise alums and castmembers making appearances before a live audience. The studio edition aired during the second half of Tuesday's episode, following an hour of traditional Paradise drama.\r\nBefore Jackson made his entrance, Harrison spoke to castmembers Raven Gates, Jasmine Goode, Derek Peth, Diggy Moreland and Robby Hayes. All five contestants were part of the original cast who were there for the shutdown.\r\nOnce again, the castmembers relived what happened, how production shut down and the fallout, pointing fingers away from the show and towards the media and public jury.\r\n\"It was disgusting how they were portraying DeMario as someone that committed this 'sexual assault crime,'\" Gates said of the media coverage. \"Reading those articles, there was maybe 10 percent of information that we connected with and 90 percent that was just made up,\" added Peth.\r\n\r\nGoode said the cast witnessed what happened and from what they saw, no one was a victim, referencing Olympios' statement made during the investigation. \"I thought she was into him and I thought he was into her,\" she said.\r\nNext week ABC will air Harrison's one-on-one sit-down with Olympios, who has been less outspoken in sharing her experience.\r\nShortly after the controversy broke, the 25-year-old said, \"I am a victim and have spent the last week trying to make sense of what happened on June 4.\" ABC reality chief Robert Mills told THR that Olympios will clarify what she meant. \r\n\"She says, 'I used the word victim, but let me explain what that meant,'” he said. \"I think she felt badly about what DeMario went through as well, so you’ll see both of them discussing that. They had these statements that completely got twisted or misconstrued where it was being asked what they meant. I think they wanted to say in a stronger, more expansive forum, 'This is what I meant by that. ... This is my version of what happened that night.' And just get the story out there so we can put this thing to bed once and for all.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Bachelor in Paradise’ Star DeMario Jackson Returns in Tearful TV Interview", "url": "https://www.hollywoodreporter.com/tv/tv-news/demario-jackson-bachelor-paradise-interview-im-not-monster-1031911/", "description": "The ABC reality star made his first appearance on the franchise since leaving ‘Paradise’ in scandal this summer.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/147277_4915_-_h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-08-22T19:31:34+00:00", "modified_time": "2017-08-23T05:39:28+00:00"}, "twitter": {"site": "@thr", "creator": "@jackiedstrause", "card": "summary_large_image", "title": "‘Bachelor in Paradise’ Star DeMario Jackson Returns in Tearful TV Interview", "description": "The ABC reality star made his first appearance on the franchise since leaving ‘Paradise’ in scandal this summer.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/147277_4915_-_h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1503430294.0, "source": "https://www.hollywoodreporter.com", "summary": ""}