{"url": "https://www.rollingstone.com/culture/culture-news/kathy-griffin-is-no-longer-sorry-about-trump-photo-shoot-outrage-was-b-s-196289/", "text": "Kathy Griffin is rescinding her apology over her controversial art piece depicting a decapitated President Trump. The comedienne opened up about the headline-making incident on Australian talk show Sunrise earlier this week, backtracking on her previous mea culpa.\n\n“I am no longer sorry, the whole outrage was B.S, the whole thing got so blown out of proportion,” she said. “I lost everybody.”\n\n. @KathyGriffin: “I’m no longer sorry. The whole outrage was BS. The whole thing got so blown out of proportion.” pic.twitter.com/5PxNrQ2VSk — Jeffrey Guterman (@JeffreyGuterman) August 29, 2017\n\nSince she first posted an image of herself holding up what looked to be a bloodied head, Griffin has been fired from her annual CNN New Year’s Eve program, dropped from deals with advertisers like Squatty Potty and investigated by the Secret Service.\n\n“I didn’t just lose one night on CNN. My entire tour was canceled within 24 hours because every single theater got all these death threats,” she added. “These Trump fans, they’re hardcore.”\n\nWhen TV host Samantha Armytage then asked Griffin whether she thought she had crossed a line by sharing the graphic image, the veteran comic got defensive.\n\n“No, you’re full of crap. Stop this,” she said. “Stop acting like my little picture is more important than talking about the actual atrocities that the president of the United States is committing.”\n\nGriffin also noted that non-Republicans had turned on her as well, including Chelsea Clinton and Debra Messing, who had both tweeted to condemn her actions. But Griffin felt the impact most deeply when her close friend and longtime New Year’s Eve cohost Anderson Cooper disavowed her with a single tweet.\n\n“For the record, I am appalled by the photo shoot Kathy Griffin took part in,” he wrote at the time. “It is clearly disgusting and completely inappropriate.”\n\nAccording to The Cut, four of Cooper’s CNN colleagues reached out to Griffin repeatedly in subsequent days to make sure she was OK; Cooper didn’t reach out to Griffin until August 10th. Via a series of text messages, she soon told him their friendship was over, The Cut reports.\n\nCooper told Andy Cohen on Watch What Happens Live in July that the pair are “still friends,” and that he hopes “she bounces back.”", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/06/kathy-griffin-not-apologetic-trump-head-hoax-5d0e5f42-78d2-40da-b1b7-656e4d1370d3.jpg?w=500&h=375&crop=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.rollingstone.com/wp-content/uploads/2018/06/kathy-griffin-not-apologetic-trump-head-hoax-5d0e5f42-78d2-40da-b1b7-656e4d1370d3.jpg?w=1581&h=1054&crop=1", "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2022/assets/public/lazyload-fallback.gif"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/kathy-griffin-not-apologetic-trump-head-hoax-5d0e5f42-78d2-40da-b1b7-656e4d1370d3.jpg?w=500&h=375&crop=1", "keywords": [], "authors": ["Joyce Chen"], "canonical_link": "https://www.rollingstone.com/culture/culture-news/kathy-griffin-is-no-longer-sorry-about-trump-photo-shoot-outrage-was-b-s-196289/", "title": "Kathy Griffin ‘No Longer Sorry’ About Trump Photo Shoot – Rolling Stone", "meta_data": {"theme-color": "#df3535", "viewport": "width=device-width, initial-scale=1.0", "description": "Months after her Trump decapitation photo shoot, Kathy Griffin says entire situation was \"blown out of proportion\" and rescinds her original apology.", "news_keywords": "Donald Trump", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "rollingstone", "pmc-page_type": "article", "articleid": 196289, "author": "Joyce Chen", "pmc-category": "(Sub)Culture,(Sub)Culture News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-08-30T17:30:25"}, "pmc-tag": "Donald Trump", "title": "Kathy Griffin Is ‘No Longer Sorry’ About Trump Photo Shoot: Outrage Was ‘B.S.’", "pageclass": "article", "pmc-is_free": "no", "pmc-branded-content": "no", "pmc-evergreen": "no"}, "generator": "WordPress 6.0.2", "author": "Joyce Chen", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "RS", "application-name": "RS", "content_type": "Article", "post_id": 196289, "title": "Kathy Griffin Is 'No Longer Sorry' About Trump Photo Shoot: Outrage Was 'B.S.'", "published_at": "2017-08-30 17:30:25", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/kathy-griffin-not-apologetic-trump-head-hoax-5d0e5f42-78d2-40da-b1b7-656e4d1370d3.jpg?w=1024", "comment_count": 0, "tags": "Donald Trump", "topics": "(Sub)Culture News", "body": "Kathy Griffin is rescinding her apology over her controversial art piece depicting a decapitated President Trump. The comedienne opened up about the headline-making incident on Australian talk show Sunrise earlier this week, backtracking on her previous mea culpa.\"I am no longer sorry, the whole outrage was B.S, the whole thing got so blown out of proportion,\" she said. \"I lost everybody.\". @KathyGriffin: \"I'm no longer sorry. The whole outrage was BS. The whole thing got so blown out of proportion.\" pic.twitter.com/5PxNrQ2VSk— Jeffrey Guterman (@JeffreyGuterman) August 29, 2017\nSince she first posted an image of herself holding up what looked to be a bloodied head, Griffin has been fired from her annual CNN New Year's Eve program, dropped from deals with advertisers like Squatty Potty and investigated by the Secret Service.\"I didn't just lose one night on CNN. My entire tour was canceled within 24 hours because every single theater got all these death threats,\" she added. \"These Trump fans, they're hardcore.\"When TV host Samantha Armytage then asked Griffin whether she thought she had crossed a line by sharing the graphic image, the veteran comic got defensive.\"No, you're full of crap. Stop this,\" she said. \"Stop acting like my little picture is more important than talking about the actual atrocities that the president of the United States is committing.\"Griffin also noted that non-Republicans had turned on her as well, including Chelsea Clinton and Debra Messing, who had both tweeted to condemn her actions. But Griffin felt the impact most deeply when her close friend and longtime New Year's Eve cohost Anderson Cooper disavowed her with a single tweet.\"For the record, I am appalled by the photo shoot Kathy Griffin took part in,\" he wrote at the time. \"It is clearly disgusting and completely inappropriate.\"According to The Cut, four of Cooper's CNN colleagues reached out to Griffin repeatedly in subsequent days to make sure she was OK; Cooper didn't reach out to Griffin until August 10th. Via a series of text messages, she soon told him their friendship was over, The Cut reports.Cooper told Andy Cohen on Watch What Happens Live in July that the pair are \"still friends,\" and that he hopes \"she bounces back.\"", "fb": {"pages": 10664530778}, "onesignal": "wordpress-plugin", "og": {"type": "article", "title": "Kathy Griffin Is 'No Longer Sorry' About Controversial Trump Photo Shoot", "url": "https://www.rollingstone.com/culture/culture-news/kathy-griffin-is-no-longer-sorry-about-trump-photo-shoot-outrage-was-b-s-196289/", "description": "Comedian says entire situation was “blown out of proportion”", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/kathy-griffin-not-apologetic-trump-head-hoax-5d0e5f42-78d2-40da-b1b7-656e4d1370d3.jpg?w=500&h=375&crop=1", "width": 1024, "height": 680, "alt": "kathy griffin president donald trump severed head hoax"}, "locale": "en_US"}, "article": {"published_time": "2017-08-30T17:30:25+00:00", "modified_time": "2018-06-25T14:37:30+00:00"}, "twitter": {"site": "@RollingStone", "card": "summary_large_image", "title": "Kathy Griffin Is ‘No Longer Sorry’ About Trump Photo Shoot: Outrage Was ‘B.S.’", "description": "Months after her Trump decapitation photo shoot, Kathy Griffin says entire situation was \"blown out of proportion\" and rescinds her original apology.", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/kathy-griffin-not-apologetic-trump-head-hoax-5d0e5f42-78d2-40da-b1b7-656e4d1370d3.jpg?w=1024"}, "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2022/08/cropped-Rolling-Stone-Favicon.png?w=270"}, "movies": [], "publish_date": 1504114225.0, "source": "https://www.rollingstone.com", "summary": ""}