{"url": "https://en.wikipedia.org/wiki/Raven%27s_Home", "text": "American television series\n\nRaven's Home is an American family sitcom[1] television series developed by Jed Elinoff and Scott Thomas that premiered on Disney Channel on July 21, 2017. The series stars Raven-Symoné, Issac Ryan Brown, Navia Robinson, Jason Maybaum, Sky Katz, and Anneliese van der Pol.\n\nBased on the characters created by Michael Poryes and Susan Sherman, the series is a spinoff of That's So Raven,[2][3] the second spinoff from that series after Cory in the House. The series centers on Raven Baxter, a divorced mother of preteen twins Booker and Nia, living with her childhood best friend Chelsea and her son Levi in Chicago, Illinois.\n\nPremise\n\nBest friends Raven and Chelsea, both divorced single mothers, are now raising their children in an apartment together in Chicago. Their house is turned upside down when they realize that Raven's son Booker has inherited the same psychic abilities as his mother.\n\nIn the fifth season, Raven and Booker temporarily relocate to Raven's hometown of San Francisco to care for Raven's father Victor after he suffers a mild heart attack. While Raven tries to get her father back in shape, Booker must navigate his mother's old school with the help of some new friends and his younger cousin Alice.\n\nEpisodes\n\nSeason Episodes Originally aired First aired Last aired 1 13 July 21, 2017 ( ) October 20, 2017 ( 2017-10-20 ) 2 21 June 25, 2018 ( ) November 30, 2018 ( 2018-11-30 ) 3 26 June 17, 2019 ( ) May 3, 2020 ( 2020-05-03 ) 4 19 July 24, 2020 ( ) May 21, 2021 ( 2021-05-21 ) 5 TBA March 11, 2022 ( ) TBA\n\nCast and characters\n\nMain\n\nRaven-Symoné as Raven Baxter, [4] the single mother of twins Nia and Booker, who works as a fashion designer for dogs. It is revealed that prior to the series, Raven had gotten divorced from Devon Carter, an ex-boyfriend from high school, and now lives with Chelsea and her son in Chicago. Raven possesses psychic abilities, able to glimpse \"visions\" of the future. She decides not to tell her children about her visions as she believes they would not understand. However, in \"The Falcon and the Raven – Part Two\", she reveals to the children that she is psychic. In the second season, Raven is working as a driver for the transportation business Scüt. Additionally, she starts working on her own fashion line called \"Ravenous Fashion\".\n\nthe single mother of twins Nia and Booker, who works as a fashion designer for dogs. It is revealed that prior to the series, Raven had gotten divorced from Devon Carter, an ex-boyfriend from high school, and now lives with Chelsea and her son in Chicago. Raven possesses psychic abilities, able to glimpse \"visions\" of the future. She decides not to tell her children about her visions as she believes they would not understand. However, in \"The Falcon and the Raven – Part Two\", she reveals to the children that she is psychic. In the second season, Raven is working as a driver for the transportation business Scüt. Additionally, she starts working on her own fashion line called \"Ravenous Fashion\". Issac Ryan Brown as Booker Baxter-Carter, [4] Raven's son and Nia's twin brother, who has inherited his mother's psychic abilities. After he gets his first vision at school, he decides to keep his newfound powers a secret, especially from his mother as he thinks she would not believe him, unaware that his mother is also psychic. Eventually, Booker tells Levi, Nia and Tess about his psychic abilities and makes them promise to help him keep them a secret. Also, in \"The Falcon and the Raven – Part One\", he reveals to his mother and Chelsea that he has visions.\n\nRaven's son and Nia's twin brother, who has inherited his mother's psychic abilities. After he gets his first vision at school, he decides to keep his newfound powers a secret, especially from his mother as he thinks she would not believe him, unaware that his mother is also psychic. Eventually, Booker tells Levi, Nia and Tess about his psychic abilities and makes them promise to help him keep them a secret. Also, in \"The Falcon and the Raven – Part One\", he reveals to his mother and Chelsea that he has visions. Navia Robinson as Nia Baxter-Carter (seasons 1–4), [4] Raven's daughter and Booker's twin sister. She initially does not believe her brother's psychic abilities, insisting it is one of his made up stories. When her brother has a vision of Nia getting hit by a boxing bag that later becomes true, she realized that her brother was telling the truth and helps keep his power a secret alongside their friends. After season four, it is revealed that Nia is in Guatemala building homes for the poor.\n\nRaven's daughter and Booker's twin sister. She initially does not believe her brother's psychic abilities, insisting it is one of his made up stories. When her brother has a vision of Nia getting hit by a boxing bag that later becomes true, she realized that her brother was telling the truth and helps keep his power a secret alongside their friends. After season four, it is revealed that Nia is in Guatemala building homes for the poor. Jason Maybaum as Levi Grayson (seasons 1–4), [4] Chelsea's son. He is very mature for his age and often acts as the parent in his relationship with his mother. Levi is Booker's best friend and is aware of his psychic abilities.\n\nChelsea's son. He is very mature for his age and often acts as the parent in his relationship with his mother. Levi is Booker's best friend and is aware of his psychic abilities. Sky Katz as Tess (seasons 1–4), Nia's street-wise best friend who lives in the same building as the rest of the family; her last name is revealed to be O'Malley in \"Oh Father, Where Art Thou?\" She is an avid basketball player. Due to previously believing in psychics, Tess quickly believed Booker about being one and vowed to help keep his powers a secret.\n\nAnneliese van der Pol as Chelsea Grayson (seasons 1–4), [4] Raven's somewhat dim-witted and sweet best friend and the mother of Levi. It is revealed that prior to the series, Chelsea made a substantial sum of money from an infomercial product she invented called the \"Schmop\", but her fortune was stolen by her husband Garrett Grayson. Afterward, Garrett was arrested for tax evasion and ended up having an affair with the federal agent who arrested him. Chelsea subsequently divorced him upon reclaiming some of her money and moved in with Raven. While living with Raven, Chelsea often tries to cook for the family, which goes horribly awry. In season 2, she builds a vegetable garden on their building's rooftop. In the third season, Chelsea is seen temporarily working on a cruise ship she went on during the second season while becoming a life coach.\n\nRaven's somewhat dim-witted and sweet best friend and the mother of Levi. It is revealed that prior to the series, Chelsea made a substantial sum of money from an infomercial product she invented called the \"Schmop\", but her fortune was stolen by her husband Garrett Grayson. Afterward, Garrett was arrested for tax evasion and ended up having an affair with the federal agent who arrested him. Chelsea subsequently divorced him upon reclaiming some of her money and moved in with Raven. While living with Raven, Chelsea often tries to cook for the family, which goes horribly awry. In season 2, she builds a vegetable garden on their building's rooftop. In the third season, Chelsea is seen temporarily working on a cruise ship she went on during the second season while becoming a life coach. Mykal-Michelle Harris as Alice Baxter (season 5), Raven's cousin who lives with Victor in San Francisco to attend a school for geniuses\n\nFelix Avitia as Neil (season 5), Victor's neighbor and Booker's classmate at Bayside High School\n\nEmmy Liu-Wang as Ivy (season 5), Victor's neighbor and Booker's classmate at Bayside High School\n\nRondell Sheridan as Victor (season 5; guest season 2),[5] the father of Raven and the maternal grandfather of Booker and Nia. He works as a chef and flies out to Chicago to help Raven while Chelsea is away on a Caribbean cruise. In the fifth season, he has a mild heart attack and Raven returns to San Francisco with Booker to take care of him.\n\nRecurring\n\nJonathan McDaniel as Devon Carter (season 1–4), Raven's ex-husband and the father of Booker and Nia who works as a meteorologist. He was Raven's boyfriend in high school and is now aware of Raven's abilities. After the two of them separated, Devon relocated to Dallas, Texas.\n\nAnthony Alabi as Coach Spitz (season 1–3), the gym teacher at George Washington Carver Community School.\n\nJenna Davis as Sienna (season 2–3), a popular and influential student at George Washington Carver Community School who lives in 352 Hauser Avenue and has a lot of followers on the media app Peanut Face\n\nDylan Martin Frankel as Mitch (season 2), the son of 352 Hauser Avenue's new owner Richard Moseley who runs the apartment while his father is busy.\n\nLaya DeLeon Hayes as Zeena (season 2), a student at George Washington Carver Community School who is the leader of the Red Hot Chili Steppers dance group and has an improving relationship with Nia and Tess.\n\nMax Torina as Ramon (season 3–4), Tess' boyfriend.\n\nAdrienne Bailon as Alana Rivera (season 5), Raven's teenage arch nemesis, and now principal of Bayside High.\n\nMarissa Reyes as Cami Rivera (season 5), Alana's daughter and Booker's new love interest.\n\nNotable guest stars\n\nProduction\n\nOn August 14, 2015, Raven-Symoné and her former co-stars were reunited in an appearance on The View. T'Keyah Crystal Keymáh and Rondell Sheridan were not present, but were mentioned by the cast.[10] A pilot for the series was announced by Disney Channel on October 27, 2016,[1] and Raven-Symoné also announced that she was departing as co-host of The View later in 2016 in order to work on the series full time.[11] On November 14, 2016, it was announced that Anneliese van der Pol would reprise her role of Chelsea Daniels in the series as a divorced mother who is raising a son, Levi, and moves in with Raven.[3] Disney Channel officially greenlit the series, with the title of Raven's Home, on April 4, 2017.[12][13] Executive producers Jed Elinoff and Scott Thomas serve as showrunners and head writers, with Raven-Symoné also on the writing team as an executive producer.[14] The series is filmed at Hollywood Center Studios.\n\nDisney Channel renewed the series for a second season on October 10, 2017, which began filming in November 2017.[15] Additionally, starting with the second season, Michael Feldman and Dava Savel replaced Jed Elinoff and Scott Thomas as showrunners. Both Savel and Feldman served as writers and producers on That's So Raven.[16] On September 28, 2018, it was announced that a musical episode of the series would premiere on October 12, 2018.[17]\n\nFollowing a silent renewal, on November 28, 2018, it was announced that Eunetta T. Boone would be taking over as showrunner and executive producer for the third season.[18] On March 21, 2019, it was announced that production on the third season was temporarily shut down, following the death of Eunetta T. Boone.[19] On May 10, 2019, it was announced that the third season would premiere on June 17, 2019.[20]\n\nOn October 16, 2019, it was announced by Disney Channel that the series was renewed for a fourth season, with production scheduled to begin sometime in 2019. Additionally, Alison Taylor joined the series as an executive producer.[21]\n\nOn June 29, 2020, it was announced that Raven's Home and Bunk'd would have a special crossover event on July 24, 2020.[22]\n\nOn October 1, 2021, it was announced by Disney Channel that the series was renewed for a fifth season. Raven Symoné and Isaac Ryan Brown would return for the season; however, Navia Robinson, Jason Maybaum, Sky Katz, and Anneliese van der Pol would not return. Additionally, newcomers Mykal-Michelle Harris, Felix Avitia, and Emmy Liu-Wang joined as Alice, Neil and Ivy, respectively, and Rondell Sheridan would return as Raven's father Victor Baxter. Production of the fifth season commenced in fall 2021.[23] Adrienne Bailon also returned as Alana Rivera, Raven's high school bully in the original series.[24] On February 10, 2022, it was announced that the fifth season would premiere on March 11, 2022.[25]\n\nOn June 21, 2022, Entertainment Tonight announced that Keymáh would reprise her role as Tanya Baxter in the season five finale. This marks her first time portraying the character since 2005 in her final appearance in the season 3 That's So Raven episode, \"Food For Thought\".[26]\n\nRaven-Symoné announced during a panel at Disney's D23 Expo on September 10, 2022, that the series was renewed for a sixth season.[27]\n\nBroadcast\n\nThe world premiere of Raven's Home aired immediately after the premiere of Descendants 2 on the Disney Channel on July 21, 2017.[28] The first season concluded on October 20, 2017. The second season premiered on June 25, 2018,[29][30] and concluded on November 30, 2018. The third season premiered on June 17, 2019, and concluded on May 3, 2020. The fourth season premiered on July 24, 2020, and concluded on May 21, 2021. The fifth season premiered on March 11, 2022.[31]\n\nReception\n\nCritical response\n\nRaven's Home has received positive reviews. Writing for The Post, Georgia Davis appreciated the pilot for \"maintain[ing] the charm and energy\" of the original, praising Raven and Chelsea's characterizations, as well as the performances of the child actors. Davis concluded, \"It might be too early to tell, but it seems Raven's Home is on the right path for success.\"[32] Emily Ashby of Common Sense Media wrote that \"That's So Raven fans will find plenty more of what they loved about the original series in this sharply written sitcom that plays up the woes of adulting and tween trials in a surprisingly great balance.\"[33]\n\nRatings\n\nViewership and ratings per season of Raven's Home Season Episodes First aired Last aired Avg. viewers\n\n(millions) Date Viewers\n\n(millions) Date Viewers\n\n(millions) 1 13 July 21, 2017 ( ) 3.50[34] October 20, 2017 ( 2017-10-20 ) 1.27[35] 1.50 2 21 June 25, 2018 ( ) 0.96[36] November 30, 2018 ( 2018-11-30 ) 0.75[37] 0.83 3 26 June 17, 2019 ( ) 0.63[38] May 3, 2020 ( 2020-05-03 ) 0.40[39] 0.50 4 19 July 24, 2020 ( ) 0.72[40] May 21, 2021 ( ) 0.33[41] 0.37 5 15 March 11, 2022 ( ) 0.24[42] TBA TBD 0.19\n\nAwards and nominations\n\nReferences\n\n\n\n", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/1/18/RavensHome.PNG/250px-RavensHome.PNG", "https://upload.wikimedia.org/wikipedia/en/1/18/RavensHome.PNG", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/18/RavensHome.PNG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Raven%27s_Home", "title": "Raven's Home", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/1/18/RavensHome.PNG", "width": 640, "height": 320}, "title": "Raven's Home - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}