{"url": "https://variety.com/2017/tv/news/stranger-things-season-2-reviews-1202597112/", "text": "As Halloween draws near, so does the debut of the second season of Netflix’s “Stranger Things.” Will it live up to the hype after Season 1 ended up becoming a surprise hit?\n\nThe show took 2016 by storm, drawing audiences in with its ’80s nostalgia, lovable cast, and eerie story, and fans have waited for more than a year to binge watch their way back to Hawkins, Ind. Currently at 96% with 23 reviews on Rotten Tomatoes, “Stranger Things” seems to have captured the same spooky magic in its sophomore season.\n\nFor those who need a recap, here’s where the first season left off (spoiler alert!): Mike, Lucas, and Dustin successfully brought their friend Will back from the alternate dimension known as the Upside Down. Unfortunately, their psychic friend and ex-government lab rat Eleven vanishes while protecting her friends from the monstrous Demogorgon, leaving audiences to wonder if she died or was sucked into the Upside Down. Life seems to return to normal for the young heroes — however, Will coughs up a black, worm-like creature into his sink, indicating that he’s not out of the woods yet.\n\nHere’s what the critics are saying about the new season:\n\nVariety‘s Maureen Ryan:\n\n“Until ‘Stranger Things 2’ really gets going — and that takes a while — it trails an air of self-consciousness that veers into strained fan service at times. The good news is, the show’s core cast remains an extremely versatile and effective ensemble, and once the story kicks into a higher gear about halfway through the nine-episode season, a lot of the old magic returns.”\n\nUproxx’s Alan Sepinwall:\n\n“The whole thing could very easily fall prey to all the worst symptoms of sequelitis, but despite some bumps along the way — one bad storytelling choice in particular — ‘Stranger Things 2’ largely justifies its existence. The first season’s epilogue left me with no interest in returning to this world, yet I had an enormous smile on my face for a lot of the new episodes, and particularly the last two, which turn out to be a tighter and more exciting climax than we got last time around.”\n\nUSA Today’s Kelly Lawler:\n\n“Overall, the new season has a stronger character focus, and some of the supporting roles from Season 1 are fleshed out to great effect, particularly Lucas, Dustin and Steve (Joe Keery), who may end up being the fan-favorite breakout of the year (sorry, Barb)… Season 2 is still a mostly satisfying binge-watch that makes good use of a talented multi-generational cast and an intriguing mythology. ‘Stranger’ is right there in the series’ title, and it would be stronger by branching into strangeness in more than just its monsters.”\n\nTV Line’s Matt Webb Mitovich:\n\n“In the parlance of Mike Wheeler and friends, ‘Stranger Things’ Season 2 is the ‘Empire Strikes Back’ to the first season’s ‘Star Wars,’ in that it’s a highly anticipated follow-up where the stakes are higher for a band of unlikely heroes. But also because just as Luke Skywalker spent much of that sequel on his own journey, so does Eleven here — which is perhaps the otherwise engaging sophomore season’s only shortcoming.”\n\nRolling Stone’s Rob Sheffield:\n\n“The new season is darker – it’s a genuine horror show – but it still has that same emotional power and a mundanely empathetic sense of grief and loss…Everybody in this story has seen people die or disappear for no good reason, and no matter how bravely they search for answers, sometimes the answers don’t come. That’s the real power of ‘Stranger Things’ – once you come into contact with the monsters, even if you escape from the Upside Down, you might not be able to come all the way back home.”\n\nIndiewire’s Ben Travers:\n\n“‘Stranger Things 2’ is big. Everything about it is big. Its story is big, its emotions are big, its music cues, homages, and characters are all big, big, big. With an additional episode, a handful of new faces, more money in the budget and inflated ideas to match, the sequel season to Netflix’s breakout original series is a conscious move to broaden its scope and lengthen its story. Season 2 takes a while to get going, and there are more growing pains other than additional setup, but the first season’s lively spirit perseveres for a largely thrilling adventure that’s hard not to enjoy.”\n\nThe Daily Beast’s Kevin Fallon:\n\n“Despite its awards-show attention and popularity, it’s safe to say that last season, ‘Stranger Things’ wasn’t exactly the best show on television. But it was unequivocally the most fun. That’s where fans can breathe easy. There are nits to pick about the new season’s plots and pacing. But in the end, it’s still a hell of a lot of fun to watch.”\n\nCollider’s Allison Keene:\n\n“The Duffer Brothers have again managed to wield their particular alchemy and create a follow-up worthy of the hype created by its predecessor. ‘Stranger Things’ is not reinventing television, but it does once again provide a highly entertaining, extremely bingeable, and even surprisingly heartwarming viewing experience.”", "images": ["https://variety.com/wp-content/uploads/2017/10/eleven.jpg?w=681&h=383&crop=1", "https://variety.com/wp-content/themes/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://variety.com/wp-content/uploads/2017/10/eleven.jpg?w=1000", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif"], "top_img": "https://variety.com/wp-content/uploads/2017/10/eleven.jpg?w=1000", "keywords": [], "authors": ["Matt Fernandez"], "canonical_link": "https://variety.com/2017/tv/news/stranger-things-season-2-reviews-1202597112/", "title": "‘Stranger Things’ Season 2 Reviews: What the Critics Are Saying", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://variety.com/wp-content/themes/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "\"Stranger Things 2\" expands on the horror of its world and the charm of its characters, though it suffers a few story missteps.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199, "pages": 12616252196}, "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202597112, "author": "Matt Fernandez", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-10-23T15:38:24"}, "pmc-tag": "Netflix,Stranger Things", "title": "‘Stranger Things’ Season 2 Reviews: What the Critics Are Saying", "pageclass": "article", "pmc-vertical": "tv", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress 6.0.2", "author": "Matt Fernandez", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Variety", "application-name": "Variety", "ia": {"markup_url_dev": "https://variety.com/2017/tv/news/stranger-things-season-2-reviews-1202597112/?ia_markup=1"}, "content_type": "Article", "post_id": 1202597112, "title": "'Stranger Things' Season 2 Reviews: What the Critics Are Saying", "published_at": "2017-10-23 15:38:24", "image": "https://variety.com/wp-content/uploads/2017/10/eleven.jpg?w=1000", "comment_count": 6, "tags": "Stranger Things", "topics": "News", "appeared_in_print": "No", "body": "As Halloween draws near, so does the debut of the second season of Netflix's \"Stranger Things.\" Will it live up to the hype after Season 1 ended up becoming a surprise hit?\r\n\r\nThe show took 2016 by storm, drawing audiences in with its '80s nostalgia, lovable cast, and eerie story, and fans have waited for more than a year to binge watch their way back to Hawkins, Ind. Currently at 96% with 23 reviews on Rotten Tomatoes, \"Stranger Things\" seems to have captured the same spooky magic in its sophomore season.\r\n\r\nFor those who need a recap, here's where the first season left off (spoiler alert!): Mike, Lucas, and Dustin successfully brought their friend Will back from the alternate dimension known as the Upside Down. Unfortunately, their psychic friend and ex-government lab rat Eleven vanishes while protecting her friends from the monstrous Demogorgon, leaving audiences to wonder if she died or was sucked into the Upside Down. Life seems to return to normal for the young heroes -- however, Will coughs up a black, worm-like creature into his sink, indicating that he's not out of the woods yet.\r\n\r\nHere's what the critics are saying about the new season:\r\n\r\nVariety's Maureen Ryan:\r\n\"Until 'Stranger Things 2' really gets going — and that takes a while — it trails an air of self-consciousness that veers into strained fan service at times. The good news is, the show’s core cast remains an extremely versatile and effective ensemble, and once the story kicks into a higher gear about halfway through the nine-episode season, a lot of the old magic returns.\"\r\n\r\nUproxx's Alan Sepinwall:\r\n\"The whole thing could very easily fall prey to all the worst symptoms of sequelitis, but despite some bumps along the way — one bad storytelling choice in particular — 'Stranger Things 2' largely justifies its existence. The first season’s epilogue left me with no interest in returning to this world, yet I had an enormous smile on my face for a lot of the new episodes, and particularly the last two, which turn out to be a tighter and more exciting climax than we got last time around.\"\r\n\r\nUSA Today's Kelly Lawler:\r\n\"Overall, the new season has a stronger character focus, and some of the supporting roles from Season 1 are fleshed out to great effect, particularly Lucas, Dustin and Steve (Joe Keery), who may end up being the fan-favorite breakout of the year (sorry, Barb)... Season 2 is still a mostly satisfying binge-watch that makes good use of a talented multi-generational cast and an intriguing mythology. 'Stranger' is right there in the series' title, and it would be stronger by branching into strangeness in more than just its monsters.\"\r\n\r\nTV Line's Matt Webb Mitovich:\r\n\"In the parlance of Mike Wheeler and friends, 'Stranger Things' Season 2 is the 'Empire Strikes Back' to the first season’s 'Star Wars,' in that it’s a highly anticipated follow-up where the stakes are higher for a band of unlikely heroes. But also because just as Luke Skywalker spent much of that sequel on his own journey, so does Eleven here — which is perhaps the otherwise engaging sophomore season’s only shortcoming.\"\r\n\r\nRolling Stone's Rob Sheffield:\r\n\"The new season is darker – it's a genuine horror show – but it still has that same emotional power and a mundanely empathetic sense of grief and loss...Everybody in this story has seen people die or disappear for no good reason, and no matter how bravely they search for answers, sometimes the answers don't come. That's the real power of 'Stranger Things' – once you come into contact with the monsters, even if you escape from the Upside Down, you might not be able to come all the way back home.\"\r\n\r\nIndiewire's Ben Travers:\r\n\"'Stranger Things 2' is big. Everything about it is big. Its story is big, its emotions are big, its music cues, homages, and characters are all big, big, big. With an additional episode, a handful of new faces, more money in the budget and inflated ideas to match, the sequel season to Netflix’s breakout original series is a conscious move to broaden its scope and lengthen its story. Season 2 takes a while to get going, and there are more growing pains other than additional setup, but the first season’s lively spirit perseveres for a largely thrilling adventure that’s hard not to enjoy.\"\r\n\r\nThe Daily Beast's Kevin Fallon:\r\n\"Despite its awards-show attention and popularity, it’s safe to say that last season, 'Stranger Things' wasn’t exactly the best show on television. But it was unequivocally the most fun. That’s where fans can breathe easy. There are nits to pick about the new season’s plots and pacing. But in the end, it’s still a hell of a lot of fun to watch.\"\r\n\r\nCollider's Allison Keene:\r\n\"The Duffer Brothers have again managed to wield their particular alchemy and create a follow-up worthy of the hype created by its predecessor. 'Stranger Things' is not reinventing television, but it does once again provide a highly entertaining, extremely bingeable, and even surprisingly heartwarming viewing experience.\"", "fragment": "!", "og": {"type": "article", "title": "‘Stranger Things’ Season 2 Reviews: What the Critics Are Saying", "url": "https://variety.com/2017/tv/news/stranger-things-season-2-reviews-1202597112/", "description": "As Halloween draws near, so does the debut of the second season of Netflix’s “Stranger Things.” Will it live up to the hype after Season 1 ended up becoming a surprise hit? The sh…", "site_name": "Variety", "image": {"identifier": "https://variety.com/wp-content/uploads/2017/10/eleven.jpg?w=1000", "width": 1000, "height": 562, "alt": "Stranger Things Season 2"}, "locale": "en_US"}, "article": {"published_time": "2017-10-23T22:38:24+00:00", "modified_time": "2017-10-24T01:26:20+00:00"}, "twitter": {"site": "@variety", "creator": "@matt_fern", "card": "summary_large_image", "title": "‘Stranger Things’ Season 2 Reviews: What the Critics Are Saying", "description": "\"Stranger Things 2\" expands on the horror of its world and the charm of its characters, though it suffers a few story missteps.", "image": "https://variety.com/wp-content/uploads/2017/10/eleven.jpg?w=1000"}}, "movies": [], "publish_date": 1508798304.0, "source": "https://variety.com", "summary": ""}