{"url": "https://www.theringer.com/2017/3/3/16044634/how-a-little-known-high-school-show-explains-ryan-murphy-43f7a02a595a", "text": "Feud: Bette and Joan is a flex for everyone involved. Ryan Murphy’s latest FX anthology is a showcase for Jessica Lange and Susan Sarandon, who prowl and preen as departed legends Joan Crawford and Bette Davis. It’s a power move for the network, keeping up a breakneck 2017 filled with star vehicles and wild gambles. Above all, though, Feud is yet another victory for Murphy. The cocreator and executive producer, who also wrote and directed several episodes, has masterminded a string of hits (American Horror Story is renewed through Season 9) and boasts what might be the most intimidating pipeline in show business (American Crime Story hasn’t even aired its second season and it’s already plotting out its fourth). Feud is the grandest demonstration of Murphy’s power yet: chock full of movie actors (Sarandon and Lange, but also Alfred Molina and Stanley Tucci), based on Old Hollywood subject matter that screams “passion project,” and according to Murphy himself, green-lit before he’d even finished his pitch to FX president John Landgraf.\n\nBut Ryan Murphy wasn’t always Ryan Murphy, super-producer. The first series he created is remembered as a cancelled-too-soon cult show. Popular ran on the WB for just two seasons, from 1999 to 2001. Unlike other high school shows from the same era, it’s not available for streaming, which helps explain why it doesn’t share a spot on the teen-touchstone short list with Freaks and Geeks (on Netflix) and My So-Called Life (on Hulu). Reviewing Popular in 2017 shows the series remains relatively obscure thanks to circumstance, not quality. The show is an acidic, insightful survey of a social ecosystem — and an early preview of a sensibility that would come to dominate TV. Popular isn’t just a show worth preserving for its own sake. It’s also the Ryan Murphy urtext.\n\nA Popular rewatch yields plenty of insight into Murphy’s creative instincts, the impulses he went on to hone and, just as crucially, the ones he dropped or hadn’t developed yet. First and foremost:\n\nRyan Murphy Loves a Pretty Girl …\n\nRyan Murphy is obsessed with beautiful women, and the lengths beautiful women will go to hold on to their status when it’s threatened by a competitor or simply by time. Cocreated by Murphy and Gina Matthews, Popular is the story of two teenage girls bound together by unhappy accident. Sam (Carly Pope) is smart and bitter, a brain who channels her grievances and outsider status into student journalism. Brooke (Leslie Bibb) is a queen bee with perfect grades, a football-star boyfriend, and a host of adoring sidekicks. When their previously single parents get engaged, chaos ensues.\n\nThe landscape of Sam and Brooke’s Jacqueline Kennedy High School (yes, really) is rigidly, cartoonishly split into the haves and have nots. The have nots spend their lunch periods stewing in self-pity; the haves constantly judge each other by how closely they resemble chosen deity Gwyneth Paltrow — always referred to as simply “Gwyneth.” It’s clear which side of the popular-loser divide holds Murphy’s interest. In their barely concealed self-consciousness, Brooke and her sidekick Nicole (Tammy Lynn Michaels) are clear predecessors to Glee’s Quinn and Santana, Scream Queens’ Chanels, or any character Emma Roberts has ever played across the Murphy Expanded Universe.\n\nLater on, Lange would play out some rendition of this theme in all four of her American Horror Story characters, all matriarchs unwilling to accept their declining value in the eyes of an uncaring society. Nip/Tuck is literally about physical flawlessness and the gory, disgusting lengths people go to preserve it. In Feud, ageism is the bell Murphy and his cocreators Jaffe Cohen and Michael Zam can’t stop ringing: 1961-era Davis and Crawford were actresses in their 50s who desperately needed a hit, so Crawford essentially engineered her own and recruited her archnemesis to the project as a savvy marketing ploy. As Popular’s title suggests, Murphy’s fascination with the beautiful people and their incentivized vanity emerged early.\n\n… Especially a Mean One\n\nWith looks-related insecurity comes bitchiness, and bitchiness has always been Murphy’s primary mode of humor. Remember that spot-on Taylor Swift parody, or American Horror Story: Coven’s unstoppable meme?\n\nOn Popular, the primary vessel for that bitchiness is Brooke’s best friend and attack dog Nicole. Since Nicole’s behavior is often in the name of doing her capo’s dirty work, Brooke turns a blind eye to Nicole’s cruelty in order to preserve plausible deniability. (Popular is unusually perceptive on how the default mind-set of the privileged isn’t always malice toward the less fortunate, but blissful ignorance of their problems.) Nicole is also an outlet for one of Murphy’s more questionable instincts: writing belittlement a little too well, giving himself cover for truly nasty or reprehensible sentiments (racism, fatphobia) by putting them in the mouths of ostensible villains.\n\nMurphy has always been undervalued as a humor writer, with a knack for pop culture–saturated one-liners that finds its perfect delivery device in catty characters like Nicole. A lunch lady is “one of God’s typos”; she and a crush “are like fashion and anorexia — they go together.” You get the sense that Murphy enjoys writing these lines, if a bit too much, and that if Michaels, who’s since quit acting, had come along at a more ascendant point in Murphy’s career, she would have been folded into his ever-expanding repertory of cross-series regulars. One of the more disconcerting parts of watching Popular is that it’s conspicuously missing its own Lange, Roberts, or Lea Michele, a star whose career is in a symbiotic relationship with her showrunner’s.\n\nOutcasts Are Welcome\n\nMurphy’s keen interest in the tip-top of the social pyramid has a flip side: He’s almost equally interested in its very bottom. Sam and her friends don’t exactly count — they’re bright, mature kids who just don’t fit their current environment, a tried-and-true teen archetype that’s notably absent from basically any of Murphy’s later work. Instead, Popular has a coterie of true rejects. The literal dirt-eater in chess club, the butch science teacher nicknamed “sir,” and the pompous dweeb who goes up against the jocks and gets a swirlie for his trouble are all familiar figures to longtime Murphy fans. They’re the predecessors of Glee’s Icee-doused dorks, Scream Queens’ candle vlogger, and the namesake cast of American Horror Story: Freak Show. Murphy finds their eccentricity almost as fascinating as the popular kids’ rabid conformity.\n\nMurphy’s work is populated by outsiders, a trend that recasts his interest in gorgeous women and golden boys as an understanding that exceptionalism is its own kind of isolation. (He’s also into the two clusters’ cross-pollination. Like Popular, Glee also features a jock who just wants to sing.) What Murphy seems genuinely indifferent to is the middle, the otherwise well-adjusted whose high school discomfort seems temporary. He doesn’t really buy into the Daria complex of the smart, sensitive observer just waiting to find her tribe. Sam and others like her are never seen again in the Murphyverse. He had bigger, weirder game to hunt.\n\nCamp Is All Around\n\nOne of the more intriguing aspects of Murphy’s career is his introduction of a melodramatic aesthetic to a prestige television landscape that was then — and often, still is — dominated by the sober, masculine, and self-serious. Nip/Tuck arrived on FX when the channel was best known for The Shield, and while it bore some superficial resemblances to other antihero dramas — it starred two straight men in an ethically complicated profession — the show also stood out. It was frivolous. It was campy. It was, well, gay.\n\nThose tendencies have only escalated with every ensuing Murphy production. The result is something rather extraordinary: The buzziest premium network in America is currently built on the back of a creator indebted to retro glamour and trashy true crime. What later turned into the foundation of the Ryan Murphy empire is exactly what got him into trouble on Popular. “They were interested in gay people who were tragic,” Murphy recently told critic Todd VanDerWerff in his first podcast appearance, speaking of the WB. “They weren’t interested in gay sensibility, or the language of being gay.” He’s made similar complaints about the network before, centering on an unsurprising point of contention: “They would give me notes, like, ‘The Mary Cherry character, like, could she be less gay?’”\n\nLeslie Grossman’s Mary Cherry is hysterically flamboyant, a red-lipsticked, Southern-fried heiress more or less transplanted from the work of John Waters. She’s the most two-dimensional of Popular’s otherwise empathetically shaded cast of characters, and yet she’s also the most memorable, a camp caricature whose affectations and bizarre details — her mother’s name is Cherry Cherry; she secretly has webbed feet — feel slightly out of place on Popular but totally of a piece with Murphy’s work. Perhaps that’s because future collaborators realized the benefit of encouraging Murphy’s signature style instead of checking it.\n\nBrevity Works Best\n\nPopular ended after just two seasons, a disappointing outcome that nonetheless rescued it from the fate that too often befalls Murphy shows: pure joy for one season, pure disappointment thereafter. This is the consequence of going for broke and jumping the shark midway through the pilot. (Nip/Tuck’s very first episode ends with the heroes feeding a corpse to an alligator.) Popular showed signs of going off the rails; by the end, one character was running over the other with her car. But it never got the chance to become its own worst enemy the way Glee did: by becoming a textbook example of the after-school sentimentalism its earliest episodes spoofed so well.\n\nMurphy would later come up with a workaround that had the side effect of revolutionizing modern television: He brought the seasonal anthology back into fashion. But even his fail-safes have a way of turning self-defeating. Scream Queens, for example, was supposed to be an anthology series, but Murphy and cocreators Brad Falchuk and Ian Brennan simply couldn’t kill their darlings. The result was a slasher show where nobody important was actually slashed.\n\nThere’s something wonderfully acrobatic about that blunder. Murphy wrote himself a free pass to wipe the slate clean and start over, then fed it through the shredder. He single-handedly pioneered a format because he couldn’t (or didn’t want to) stick to a concept, then couldn’t (or didn’t want to) stick to that format. It’s a perfectly Murphyesque development, a fitting turn on the path that Popular started. Popular’s short and sweet run is fondly, if not widely, remembered as a sharp dramedy. The show is also worth commemorating as the beginning of Ryan Murphy’s career — and a striking amount of contemporary TV, too.", "images": ["https://cdn.vox-cdn.com/thumbor/Lq2WO76IG7dWqpGac2v41xLr79g=/0x0:3000x2093/1200x0/filters:focal(0x0:3000x2093):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8932943/1_6E-0-CHaQ1Ww9OMafxKPbQ.0.jpeg", "data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs", "https://cdn.vox-cdn.com/uploads/chorus_image/image/71469919/1430935201.0.jpg", "https://cdn.vox-cdn.com/thumbor/0_PQbsdGdhE3FwcckPJ3hsEXPf8=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55909393/1_Qsl34AG0sjLwAwwaUlKOnA.0.jpeg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/71469993/1431571556.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/71468851/southerncharmreunionpt1_bravo.0.jpg", "https://cdn.vox-cdn.com/thumbor/Dzp4-FoujHkScdkuFiZ9IJc3h64=/166x0:2833x2000/1200x800/filters:focal(166x0:2833x2000)/cdn.vox-cdn.com/uploads/chorus_image/image/55909393/1_Qsl34AG0sjLwAwwaUlKOnA.0.jpeg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/71469925/1431536830.0.jpg", "https://cdn.vox-cdn.com/thumbor/70Ro7mPGvS2HI8gLS00eyMTuXms=/0x0:2136x3000/1200x0/filters:focal(0x0:2136x3000):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/8932945/1_PjgCHWZ2IY0f-vUR6RE_7w.0.jpeg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/71468047/1431154193.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/71469909/extremerules_wwe_getty_ringer.0.jpeg"], "top_img": "https://cdn.vox-cdn.com/thumbor/0_PQbsdGdhE3FwcckPJ3hsEXPf8=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55909393/1_Qsl34AG0sjLwAwwaUlKOnA.0.jpeg", "keywords": [], "authors": ["Alison Herman", "Sheil Kapadia", "Jack Mccluskey", "Joanna Robinson", "Van Lathan", "Nick Bond", "Rachel Lindsay", "Jodi Walker", "Kevin O'Connor", "Chris Vernon"], "canonical_link": "https://www.theringer.com/2017/3/3/16044634/how-a-little-known-high-school-show-explains-ryan-murphy-43f7a02a595a", "title": "How ‘Popular’ Predicted ‘Feud’ — and the Rest of Ryan Murphy’s Career", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Ringer", "article": {"publisher": "https://www.facebook.com/ringer/", "published_time": "2017-03-03T09:15:07-05:00", "modified_time": "2017-03-03T09:15:07-05:00"}, "author": "Alison Herman", "style-tools": "https://www.theringer.com/style/community/723/2ae0ed8f83bedc27f0c403be20a55bf2/tools.css", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "description": "The showrunner’s first series — a little-watched high school show — set the tone for the rest of his career, the upcoming ‘Feud’ included", "og": {"description": "The showrunner’s first series — a little-watched high school show — set the tone for the rest of his career, the upcoming ‘Feud’ included", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/0_PQbsdGdhE3FwcckPJ3hsEXPf8=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55909393/1_Qsl34AG0sjLwAwwaUlKOnA.0.jpeg", "alt": "(Matt James/FX/Disney)", "height": 900, "width": 1600}, "site_name": "The Ringer", "title": "How ‘Popular’ Predicted ‘Feud’ — and the Rest of Ryan Murphy’s Career", "type": "article", "url": "https://www.theringer.com/2017/3/3/16044634/how-a-little-known-high-school-show-explains-ryan-murphy-43f7a02a595a"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.theringer.com/2017/3/3/16044634/how-a-little-known-high-school-show-explains-ryan-murphy-43f7a02a595a", "title": "How ‘Popular’ Predicted ‘Feud’ — and the Rest of Ryan Murphy’s Career", "description": "The showrunner’s first series — a little-watched high school show — set the tone for the rest of his career, the upcoming ‘Feud’ included", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/0_PQbsdGdhE3FwcckPJ3hsEXPf8=/0x156:3000x1844/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/55909393/1_Qsl34AG0sjLwAwwaUlKOnA.0.jpeg", "alt": "(Matt James/FX/Disney)"}, "site": "ringer"}, "robots": "max-image-preview:large", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/8991995/favicon-196x196.0.png", "msapplication-TileColor": "#67c385"}, "movies": [], "publish_date": 1488499200.0, "source": "https://www.theringer.com", "summary": ""}