{"url": "https://web.archive.org/web/20180106072230/http://www.producersguild.org/news/381005/Theatrical-Motion-Picture-and-Television-Nominees-Announced-for-2018-Producers-Guild-Awards-.htm", "text": "Theatrical Motion Picture and Television Nominees Announced for 2018 Producers Guild Awards 13 hours ago (0 Comments)\n\nShare | PRODUCERS GUILD OF AMERICA ANNOUNCES THEATRICAL MOTION PICTURE AND TELEVISION NOMINATIONS FOR THE 2018 PRODUCERS GUILD AWARDS PRESENTED BY CADILLAC LOS ANGELES (January 5, 2018) – The Producers Guild of America (PGA) announced today theatrical motion picture and television nominations for the 29th Annual Producers Guild Awards presented by Cadillac. This year, the nominees in the category for The Darryl F. Zanuck Award for Outstanding Producer of Theatrical Motion Pictures included a tie, so for the first time the PGA presents 11 film nominees. All 2018 Producers Guild Awards winners will be announced on Saturday, January 20, 2018 at the Beverly Hilton Hotel in Los Angeles. At this month’s event, the Producers Guild will also present special honors to Donna Langley with the Milestone Award, Ryan Murphy with the Norman Lear Achievement Award in Television, Charles Roven with the David O. Selznick Achievement Award in Theatrical Motion Pictures, the feature film “Get Out” with the Stanley Kramer Award, and Ava DuVernay with the Visionary Award. The 2018 Producers Guild Awards Co-Chairs are Donald De Line and Amy Pascal. Cadillac is the Presenting Sponsor of the event. Delta Air Lines, the Official Airline Partner of the PGA, is sponsoring the Visionary Award. In 1990, the Producers Guild held the first-ever Golden Laurel Awards, which were renamed the Producers Guild Awards in 2002. Richard Zanuck and Lili Fini Zanuck took home the award for Best Produced Motion Picture for “Driving Miss Daisy,” establishing the Guild’s awards as a bellwether for the Oscars. The 2018 Producers Guild Awards motion picture nominations are listed below in alphabetical order by category, along with eligible producers’ names. The Darryl F. Zanuck Award for Outstanding Producer of Theatrical Motion Pictures: “The Big Sick” Producers: Judd Apatow, Barry Mendel “Call Me By Your Name” Producers: Peter Spears, Luca Guadagnino, Emilie Georges, Marco Morabito “Dunkirk” Producers: Emma Thomas, Christopher Nolan “Get Out” Producers: Sean McKittrick & Edward H. Hamm, Jr., Jason Blum, Jordan Peele “I, Tonya” Producers: Bryan Unkeless, Steven Rogers, Margot Robbie, Tom Ackerley “Lady Bird” Producers: Scott Rudin, Eli Bush, Evelyn O’Neill “Molly's Game” Producers: Mark Gordon, Amy Pascal, Matt Jackson “The Post” Producers: Amy Pascal, Steven Spielberg, Kristie Macosko Krieger “The Shape Of Water” Producers: Guillermo del Toro, J. Miles Dale “Three Billboards Outside Ebbing, Missouri” Producers: Graham Broadbent & Pete Czernin, Martin McDonagh “Wonder Woman” Producers: Charles Roven & Richard Suckle, Zack Snyder & Deborah Snyder The Award for Outstanding Producer of Animated Theatrical Motion Pictures: “The Boss Baby” Producer: Ramsey Naito “Coco” Producer: Darla K. Anderson “Despicable Me 3” Producers: Chris Meledandri, Janet Healy “Ferdinand” Producers: Lori Forte, Bruce Anderson “The Lego Batman Movie” Producers: Dan Lin, Phil Lord & Christopher Miller The Award for Outstanding Producer of Documentary Motion Pictures: The PGA previously announced the nominations in this category on November 20, 2017. Producers who have already been vetted for awards eligibility are listed below and the winner will be announced at the official ceremony on January 20th. “Chasing Coral” Producers: Jeff Orlowski, Larissa Rhodes “City of Ghosts” Producer: Matthew Heineman “Cries from Syria” Producers: Evgeny Afineevsky, Den Tolmor, Aaron I. Butler “Earth: One Amazing Day” Producer: Stephen McDonogh “Jane” *This film is still in the process of being vetted for producer eligibility this year. “Joshua: Teenager vs. Superpower” *This film is still in the process of being vetted for producer eligibility this year. “The Newspaperman: The Life and Times of Ben Bradlee” Producers: Teddy Kunhardt, George Kunhardt The television nominees are listed below in alphabetical order. The producers of the programs in the following six categories are in the process of being vetted for awards eligibility this year, and the winners will be recognized at the official ceremony on January 20th. The Norman Felton Award for Outstanding Producer of Episodic Television, Drama: “Big Little Lies” (Season 1) “The Crown” (Season 2) “Game of Thrones” (Season 7) “The Handmaid's Tale” (Season 1) “Stranger Things” (Season 2) The Danny Thomas Award for Outstanding Producer of Episodic Television, Comedy: “Curb Your Enthusiasm” (Season 9) “The Marvelous Mrs. Maisel” (Season 1) “Master of None” (Season 2) “Silicon Valley” (Season 4) “Veep” (Season 6) The David L. Wolper Award for Outstanding Producer of Long-Form Television: The Long-Form Television category encompasses both movies of the week and limited series. “Black Mirror” (Season 4) “Fargo” (Season 3) “FEUD: Bette and Joan” (Season 1) “Sherlock: The Lying Detective” “The Wizard of Lies” The Award for Outstanding Producer of Non-Fiction Television: “30 for 30” (Season 8) “60 Minutes” (Season 50) “Anthony Bourdain: Parts Unknown” (Season 9, Season 10) “Leah Remini: Scientology and the Aftermath” (Season 1, Season 2) “Spielberg” The Award for Outstanding Producer of Live Entertainment & Talk Television: “Full Frontal with Samantha Bee” (Season 2) “Jimmy Kimmel Live!” (Season 15) “Last Week Tonight with John Oliver” (Season 4) “The Late Show with Stephen Colbert” (Season 3) “Saturday Night Live” (Season 43) The Award for Outstanding Producer of Competition Television: “The Amazing Race” (Season 29) “American Ninja Warrior” (Season 9) “Lip Sync Battle” (Season 3) “Top Chef” (Season 14) “The Voice” (Season 12, Season 13) The PGA does not vet the individual producers of short-form programs, sports programs, or children’s programs and the winning production will be recognized at the official ceremony on January 20th. The Award for Outstanding Short-Form Program: “Better Call Saul's Los Pollos Hermanos Employee Training” (Season 1) “Carpool Karaoke” (Season 1) “Humans of New York: The Series” (Season 1) “National Endowment for the Arts: United States of Arts” (Season 3) “Viceland at the Women's March” (Season 1) The Award for Outstanding Sports Program: “All or Nothing: A Season with the Los Angeles Rams” (Season 2) “Hard Knocks: Training Camp with the Tampa Bay Buccaneers” (Season 12) “Real Sports with Bryant Gumbel” (Season 23) “SportsCenter with Scott Van Pelt” (Season 3) “VICE World of Sports” (Season 2) The Award for Outstanding Children’s Program: “Doc McStuffins” (Season 4) “Nickelodeon Kids' Choice Awards 2017” “School of Rock” (Season 3) “Sesame Street” (Season 47) “SpongeBob SquarePants” (Season 10, Season 11) ABOUT THE PRODUCERS GUILD OF AMERICA (PGA) The Producers Guild of America is the non-profit trade group that represents, protects and promotes the interests of all members of the producing team in film, television and new media. The Producers Guild has more than 8,200 members who work together to protect and improve their careers, the industry and community by providing members with employment opportunities, seeking to expand health benefits, promoting fair and impartial standards for the awarding of producing credits, as well as other education and advocacy efforts such as encouraging sustainable production practices. For more information and the latest updates, please visit Producers Guild of America websites and follow on social media: Websites: www.producersguild.org, www. pgagreen.org, www. pgadiversity.org Twitter: @ProducersGuild Facebook: www.facebook.com/pga YouTube: www.youtube.com/producersguild Instagram: www.instagram.com/ producersguild Hashtag: #PGAwards\n\n", "images": ["https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/graphics/youtube.jpg", "https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/resource/resmgr/WIN/win_logov2.jpg", "https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/graphics/green-logo.jpg", "https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/graphics/Favicon.ico", "https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/global_graphics/icons/envelope.gif", "https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/graphics/header.jpg", "https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/global_graphics/icons/star_32x32.gif", "https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/graphics/film-logo.jpg", "https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/graphics/sponsors-logo.jpg", "https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/global_graphics/lock-icon.png", "https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/graphics/media-logo.jpg", "https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/resource/resmgr/produced_by_online_content/jan18cover_224.jpg", "https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/graphics/diversity-logo.jpg", "https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/graphics/facebook.jpg", "https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/graphics/twitter.jpg"], "top_img": "https://web.archive.org/web/20180106072230im_/http://www.producersguild.org/graphics/Favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Theatrical Motion Picture and Television Nominees Announced for 2018 Producers Guild Awards", "meta_data": {"google-site-verification": "tzgnQIwcom0BlqBPc9bQQFZT6e4qfq2GTidRzG840Cw"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}