{"url": "https://en.wikipedia.org/wiki/The_Bachelor_(season_17)", "text": "No.\n\noverall No. in\n\nseason Title Original air date Prod.\n\ncode U.S. viewers\n\n(millions) Rating/share\n\n(18–49)\n\n153 1 \"Week 1: Bachelorette Arrivals\" January 7, 2013 ( ) 1701 6.92[36] 2.3/6[36]\n\nSeason 17 begins with Sean arriving at the rental bachelor pad home for the tenure of the season when he gets a video chat to his sister back home, he is then greeted by his friend and Bachelorette castmate Arie Luyendyk Jr. to give and provide some insight and advice. Later that night, Sean's journey begins as twenty-five single ladies arrive at the mansion. Jackie gives Sean a kiss on his cheek, leaving a lipstick mark later wiped off on Selma's napkin; Kelly sings a song with Sean; Katie shows her yoga moves; Ashley P. shows an obsession for Fifty Shades of Grey as she pulls a blue-grey tie from her cleavage and waves it at Sean; Robyn attempts a back flip, but stumbles; Lacey presents a heart of lace; Tierra shows to Sean a heart tattoo on her finger, then Sean asks her to wait outside the mansion to present her with the first impression rose, leaving the girls shocked with mixed reactions; Keriann explains that she has driven 2,775 miles (4,466 km) to meet Sean; Desiree brings pennies to escort Sean and instructs to close his eyes by tossing them onto the fountain; Lesley M. presents a football to convince by playing quarterback with Sean, and Lindsay exits the limousine wearing an elegant wedding dress and mentions her interest in being a bride. Chris Harrison provides a surprise \"twist\" for Sean as he reveals a mystery woman: Kacie Boguskie, a contestant from the previous season. Although Tierra already has the first impression rose, Sean changes the former method by presenting eleven other women with to receive roses throughout the night, making them safe in the first rose ceremony. At the rose ceremony, Ashley H., Ashley P., Kelly, Keriann, Lacey, Lauren and Paige are sent home.\n\n154 2 \"Week 2: Book Cover Photo Shoot\" January 14, 2013 ( ) 1702 7.49[37] 2.5/6[37]\n\nSarah gets the first one-on-one date of the season to meet with Sean at the mansion and, going outside, heads towards a helicopter which whisks them away. They arrive at the top of a Los Angeles skyscraper for a free fall via ropes, from the roof down 360 feet to the base where champagne awaits. Although Sarah had been born without a left forearm and hand, she overcomes the pressure and takes the leap of faith with Sean. That evening Sarah tells Sean that she intended to try a zip-line in Las Vegas, but couldn't because the rules would not allow her to participate with her disability. She receives a rose. Thirteen women are chosen for the first group date of the season where they travel into Beverly Hills estate, as professionals take care of attire and makeup for various groupings of photo shoots for a romance novel. Sean becomes nearly shirtless, Lesley M. touches his abs and looks very seducing. In a vampire outfit, Amanda expresses her feelings with Sean. Kristy, who has experience in modeling, wins a three-book deal for Harlequin covers from the photo shoot. Kacie B. talks to Katie about opening up and her possible decision to leave the competition; Katie has anxiety and a meltdown, then decides to leave the show. Sean gives Kacie B. a rose. Desiree gets the second one-on-one date with Sean, as they have set up a fake Art Museum to response to a prank. Taken through the art show and having met the artist, Sean escorts her into an art room where she can see a sculpture that is to be the pinnacle of the exhibit, soon he is \"asked\" to return to the exhibit hall and leaves Desiree with the art, saying he will return. Chris Harrison watches them from inside the studio room, Sean is able to watch Desiree in the art room. Although she does nothing, the sculpture falls and shatters into many pieces. First the exhibit manager and then the artist come into the room and they ask Desiree what she has done to the precious artwork. Desiree does not know how to respond, then Sean returns to the room to save her, telling her that the art staff are actually professional actors and the art piece is worth $5.00. Then Sean accompanies Desiree in his bachelor home for dinner, she receives a rose. At the cocktail party, The ladies are anxious about Amanda, some ladies dislike her. At the rose ceremony, Brooke and Diana are eliminated.\n\n155 3 \"Week 3: Beach Volleyball Competition\" January 21, 2013 ( ) 1703 7.57[38] 2.5/6[38]\n\nLesley M. has the one-on-one date for the week, where she and Sean head to Hollywood and arrive at the Guinness World Record's Museum. They see a \"longest on-screen kiss\" stand outside and begin to set a record for the world's longest on-screen kiss on a stage along with a cheering audience. Their kiss lasts for three minutes and fifteen seconds, which gave them the record of longest on-screen kiss. That evening, they have a toast above on a penthouse lounge. At the end, Lesley M. received a rose. Twelve women have chosen on this group date to compete for a game of beach volleyball. They split into two groups of six, the red team and the blue team. The blue team won the match and then proceed to a party at Sean's bachelor home, the red team lost and was directly head back to the mansion. Amanda is very serious for her feelings with Sean. Lindsay has the group date rose. Back at the mansion, Tierra reads the date card for AshLee F. on her one-on-one date, she jokes that Selma is on the date and this upsets some of the girls. Before the start of the date, Tierra falls down the stairs and supposedly hits her head. Sean comes to the mansion to pick up AshLee F. for her date and sees the aftermath of the fall. When the ambulance and paramedics arrive, she puts a neck brace but then takes it off and will not let them take her to the hospital. Sean talks with Tierra while AshLee F. waits for him to go on their date. Finally, AshLee F. and Sean arrive at Six Flags Magic Mountain for a fun ride, they invite two girls suffered from chronic illness. After the park closes, they receive a private performance from Eli Young Band. AshLee F. reveals to Sean that she had a difficult childhood until the age of six when she was adopted, AshLee F. receives a rose. At the cocktail party, Sarah explains to Sean on her disability. Later, he brings her dog to play at the mansion. Tierra isn't emotional on what happened with the fall, she wants to leave and Desiree interrupted Tierra's conversation. As the rose ceremony is conducted, Sean asks Kacie B. for a quick private conversation, he tells her that they are better off just being friends and sends her home. At the end of the ceremony, Kristy and Taryn are eliminated.\n\n156 4 \"Week 4: Roller Derby Showdown\" January 28, 2013 ( ) 1704 7.90[39] 2.5/7[39]\n\nSelma gets the first one-on-one date for the week, she and Sean take on a private plane to Joshua Tree National Park to go rock climbing. Selma was surprised that he took \"the Iraqi to the desert\", when she was expecting to go somewhere glamorous. Afterwards, they go to a \"country glam\" trailer park, where Sean reveals he has only had one serious relationship since he graduated from college, and he broke it off because he couldn't see himself marrying the woman. Selma tells Sean she cannot kiss Sean because it goes against her Muslim culture, and she doesn't want to disrespect her family. Sean respects Selma's wishes, and he gives her a rose. Eight women have chosen on this group date where they go roller derby, Amanda lies to the rest of the girls, saying she has done a roller derby before. She later falls and hits her chin on the ground, and she has to be taken to the hospital. Sarah struggles with her balance due to her disability, but Sean encourages her to only do what makes her comfortable. After Amanda's accident, Sean cancels the roller derby competition. He and the rest of the ladies skate freely instead. That night, the girls and Sean are spent relaxing outside, argument escalates between Tierra and Robyn causes Tierra to contemplate going home. In retaliation, Sean gives her the rose to show how much he wants her there, leaving the rest of the girls infuriated. Leslie H. gets the second one-on-one date to embark on a Pretty Woman-themed date with Sean, where they go shopping on Rodeo Drive, and Leslie H. leaves with a dress, shoes, purse and diamond earrings. To top off the ensemble, Sean and Leslie H. visit a Neil Lane jewelry store, where Mr. Lane himself gives Leslie a 120-carot diamond necklace. They go to dinner, where Leslie and Sean discuss past relationships. Leslie also reveals the impact of her parents' divorce on her love life. Sean decides that he does not have a romantic connection with Leslie as he hoped, and he sends her home. At the cocktail party, Tierra confronts Robyn and Jackie, \"apologizing\" for her actions during the group date. She decides to be fake in order to avoid Sean hearing negative things about her from other girls. Sean believes Tierra has a good heart and accepts that she needs more reassurance than other girls. At the rose ceremony, Amanda was eliminated.\n\n157 5 \"Week 5: Sean's Two-on-One Date\" February 4, 2013 ( ) 1705 7.90[40] 2.4/6[40]\n\nChris Harrison drops by at the mansion to announce that the girls will be going Whitefish, Montana to meet with Sean. In Whitefish, Lindsay has the one-on-one date, she and Sean take for a helicopter ride overlooking a mountainous glacier near Glacier National Park which culminates in an outdoor picnic activity at Blackfeet Indian Reservation. In the night portion of the date, Lindsay tells Sean how she spent numerous countries in her childhood because of her dad's assignment as General in the United States Army. Following the picnic, they decided to take in a Sarah Darling concert downtown with thousands of the town's residents cheering them on. Lindsay receives a rose. Eight women are selected on this group date to proceed by bus to the park to have a relay race there and they split into two teams of four, the Blue team and the Red team, into a racing of five challenges. The Red team won after Desiree got a taste of cow's milk. Sean felt bad about sending the blue team home, and he invited them to come back later in the night. Tierra unexpectedly showed up on the group date to tell Sean she was concerned about her impending two-on-one date with him the next day. Daniella received a rose, leaving the girls on the red team angry that Sean invited the other girls back in the first place. Tierra and Jackie are on the ultimate showdown for the two-on-one date, they met with Sean for a horseback ride across a wilderness. Sean spends time alone with Jackie, who warns Sean of Tierra's dangerous personality. Tierra tells Sean she was in a 5-year relationship with an addict who then died, stating this event as a reason for her strong personality. Sean gave the rose to Tierra for a second straight time, and Jackie was sent home. Sean and Tierra ended the night with a firework show. At the cocktail party, Robyn and Lesley confront Tierra regarding her negative personality, which leaves Tierra with a sour taste in her mouth. Desiree doubts her feelings for Sean due to his interest in Tierra. Sean senses tension among the ladies, and he asks Lesley why the girls don't like Tierra, leaving him unsure if finding love on the show is possible. At the rose ceremony, Robyn was eliminated.\n\n158 6 \"Week 6: Polar Bear Plunge\" February 5, 2013 ( ) 1706 7.87[41] 2.7/7[41]\n\nSean and the remaining women are headed to Lake Louise, Alberta in Canada. Catherine receives the one-on-one date, she and Sean ride on a Snowcoach onto the Athabasca Glacier in Jasper National Park, and they spend the day playing in the snow. Catherine reveals that her friend died in a freak accident right in front of her when they were both twelve years old which makes her value life. Sean and Catherine then travel to the Lake Louise Ice Palace, where Sean gives her a rose. Seven women are chosen on the group date, where they meet with Sean canoe across the lake. Everyone is upset when Lesley jumps into Sean's canoe. Sean invites the girls to do the \"Polar Bear Plunge\" with him; where they have to jump into the icy lake water and be completely submerged before they can come out. Selma refuses to go in, which disappoints Sean. The rest of the girls complete the dive, with Tierra suffering from hypothermia upon resurfacing from the water. She is treated by a paramedic and told to stay in her hotel room to rest. Not one for following orders, Tierra makes an entrance at the group date dinner later in the evening. However, Sean gives Lesley the rose. The following day, Sean pulls Sarah aside to tell her that he does not think that she is the one for him, and that he didn't want to wait until the rose ceremony to tell her. Sarah then leaves, shocking the other girls. Desiree has the second one-on-one later that day, she and Sean went to Banff National Park to rappel down a hillside in the Canadian Rockies in order to reach their picnic destination on Tunnel Mountain. During the night portion, they have dinner together in a teepee. Desiree tells Sean that she grew up with little money, and he finds himself wanting to be the man that supports Desiree for the rest of her life, Sean gives her a rose. At the cocktail party, AshLee tells Sean she is afraid of not being in control, and lets him blindfolds her as a trust exercise. Sean witnesses Tierra acting out to other girls, but she quickly tries to calm down the situation. At the rose ceremony, Daniella and Selma have sent home. Sean then announces the remaining women to Saint Croix in the U.S. Virgin Islands, an American insular area.\n\n159 7 \"Week 7: St. Croix\" February 11, 2013 ( ) 1707 8.48[42] 2.7/7[42]\n\nThe remaining women have arriving in Saint Croix, AshLee has the one-on-one date, she and Sean went out on the beach and jumped off a catamaran to reach a private island for the two. When they were on the beach, Sean asked about the drama in the house. AshLee explained that Tierra's rudeness was causing a stir in the house. AshLee then told Sean over dinner that she was married at 17 and divorced at 18 while she was dealing with being in a broken home. Tierra has the one-on-one date and she was presented with the date card and immediately began complaining about walking around and having bugs bite her. She preferred a tropical date with a beach setting. They walked through the city and went shopping in the town. After some fun and buying two snow cones, they sat and talked. After the conversation, Tierra felt like Sean was a little distant from her. Desiree, Lindsay, and Catherine are chosen on the final group date of this season, Sean woke them up at dawn, and they left the house very early and travelled to Point Udall, which is the easternmost point in the United States (not counting Guam), to be the first people in the U.S. to see the sun rise that day. They then went on a trip across the island in a Jeep Wrangler, visiting several local sites along the way. They ended up on the beach at the westernmost point on the island (to be the last people on St. Croix to see the sun set that day). Catherine talked to Sean about her past when her father attempted suicide when she was 14 years old. After his conversations with the three ladies, Sean gave Lindsay the rose. Lesley has the final one-on-one date for this season, she and Sean have walked through sugar plantation ruins at Estate Mount Washington Plantation. Sean was hoping that Lesley would open up to him, but she seemed distant throughout the date. Sean realized that it took Lesley longer than other girls to warm up to him, but he was worried that it was too little too late. The next day, Tierra and AshLee got into a huge argument because AshLee talked about Tierra on her date with Sean. On the day of the rose ceremony, Sean's sister, Shay, came to Saint Croix to meet with him that his sister is convinced to meet Tierra because she was a good judge of character. Sean went to get Tierra at the house, only to find her crying in her room. After talking to Tierra about what happened, he realizes that he needs to send her home. The other girls were unsure of Tierra's fate going into the rose ceremony, when in reality, she left the island at Sean's request after Sean's sister left. At the ceremony, Lesley was eliminated. In the end, the remaining four ladies prepare to take Sean home to meet their families.\n\n160 8 \"Week 8: Sean's Hometown Dates\" February 18, 2013 ( ) 1708 9.26[43] 3.0/8[43]\n\nAshLee's hometown date began in Houston, Texas at a park. When they arrived at her home, her religious parents Bruce and Deborah talked to Sean about on her rough childhood life and her story began when she lived in different foster homes ever since she was born until was adopted by her current family. Ashlee professed her love to Sean before the date ends. Catherine took Sean on her hometown in Seattle, Washington, they took a tour of the Pike Place Market. Upon arriving at her home, Sean met Catherine's family including her grandmother Connie who speaks Tagalog. He greeted her using traditional Filipino culture that Catherine taught him. He also met her Filipino mother Cynthia and her two sisters, India and Monica. Catherine's sisters were skeptical about Sean and Catherine's relationship, and they left Sean unsure as to whether or not Catherine was ready to settle down. Cynthia was not ready to give her daughter's hand in marriage yet. The next stop is at Fort Leonard Wood near St. Robert, Missouri to visit Lindsay where her parents stationed there, Lindsay and Sean explored the town, where Lindsay demonstrates Sean through boot camp. Sean met Lindsay's younger brother Marcus, and her parents Mark and Lisa. Sean struggled with how to address Lindsay's father Mark, who is a two-star general. Ultimately, Mark gave Sean his blessing if he were to propose to Lindsay in the end. The final hometown date for the day is Desiree's hometown of Los Angeles, California, she and Sean have hiked in a park and later went to her home to host her parents, Tony and Roxanne and her brother Nate for dinner. In order to get Sean back for the practical joke he played on her on their first date, Desiree hired an actor to play her ex-boyfriend who came to her house professing his love for Desiree. Sean fell for the prank, but Des told him the truth and they shared a laugh. Sean got along with her parents, but Nate called Sean a \"playboy\" to his face, which upset him. At the rose ceremony, Desiree pulled Sean aside and apologized to him for her brother's rude behavior, she was sent home. The remaining three ladies will travel with Sean to Thailand for their overnight dates.\n\n161 9 \"Sean Tells All\" February 19, 2013 ( ) N/A 8.11[44] 2.6/7[44]\n\nIn this special, Sean expressed his feelings during the show's run. He started his feelings with Lesley that on her expression as he would have given her a rose on Week 7 rose ceremony. Ashley P. got criticized that she did not have a necktie during the first night as saying that her mom loved Sean, and Desiree's prank between an \"ex-boyfriend\" during her hometown date. Sean told Tierra that she should not come along for the show with the right reasons by Chris called her \"the cancer of the house\".\n\n162 10 \"Week 9: Thailand\" February 25, 2013 ( ) 1709 9.23[45] 2.9/8[45]\n\nSean arrives in the resort town of Krabi, Thailand. Lindsay's date started with a Tuk Tuk ride through the Trang Province where they spent the day together in the Sikao market area. The day continued on Yong Ling Beach with monkeys walking throughout the beach and they watched a traditional Chak Phra festival. AshLee's overnight date started with a long-tail Boat ride from Pak Meng Beach and took them to the Ko Lanta District where they swam together through Emerald Cave in Ko Muk to their private, enclosed beach where they spent the day together. Catherine's date started at Ao Nang beach with a junk boat ride and ended in the suite in the jacuzzi. All three dates received fantasy suites. At the rose ceremony, Sean watched the videos from each of the three girls, Sean gave Lindsay the first rose, paused for a few moments, then gave Catherine the other rose for the week. AshLee was visibly upset and wanted to leave the resort without giving Sean a chance to explain himself.\n\n163 11 \"The Women Tell All\" March 4, 2013 ( ) N/A 8.53[46] 2.8/7[46]\n\nNineteen of the twenty-four eliminated bachelorettes sit down beside the audience for a hot seat. Tierra gave an interview and surprised on how made a regret that she did not apologize anything and refused to answer to sit with the others. AshLee took to a hot seat reviewed with a further exchange on Tierra's heated attitude felt that she bullied her in St. Croix. Desiree and Sarah are made emotional since their perspective eliminations that still have a little emotional on what did happened, Sarah expressed her feelings on her elimination in Canada. When Sean comes in to see with the bachelorettes, and finally gives a talk to AshLee that she revealed on a wish she could give a rose on a previous rose ceremony in Thailand, as AshLee seemed to accept Sean's answer, claimed that on made her best in the last date together with Sean.\n\n164 12 \"Week 10: Season Finale in Thailand\" March 11, 2013 ( ) 1710 10.42[47] 3.5/10[47]\n\nThe final two women were able to have the chance to meet Sean's family in Chiang Rai, and get to spend some time with Sean. Sean is excited to see his parents Jay and Sherry, his sister Shay and her husband Andrew Shull, and his niece Kensington and nephew Smith. Both women have impressed with Sean's family and especially the bond with the possible in-laws. For the final dates, Lindsay admits that made herself nervous with Sean, present them with lanterns to write their wishes and sent up to the sky. Catherine took an elephant ride and told Sean that is more difficult with an emotional, she did a courage saying with three words that she wasn't made on her feelings and cried on her tears. At the rose ceremony, Lindsay comes out first. Sean tries to let her down easily, but he ends up breaking down and she ends up having to console him, while still acting slightly annoyed that he didn't pick her. Still, he tells her that he actually does love her and this is the hardest thing he's ever had to do. Then, Chris Harrison hands an envelope to Sean. Sean reads a heartfelt letter from Catherine, which he learns her feelings that they are perfect for each other. Catherine finally arrives to see Sean, and he drops on his knee, presents a ring, and proposes to her. She says yes and gives her the final rose. The two can't stop telling one another how much they love each other.\n\n165 13 \"After the Final Rose\" March 11, 2013 ( ) N/A 10.81[47] 3.8/10[47]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/5/5c/The_Bachelor_S17_poster.jpg/220px-The_Bachelor_S17_poster.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/5/5c/The_Bachelor_S17_poster.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/5/5c/The_Bachelor_S17_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Bachelor_(American_season_17)", "title": "The Bachelor (American season 17)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/5/5c/The_Bachelor_S17_poster.jpg", "width": 640, "height": 854}, "title": "The Bachelor (American season 17) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}