{"url": "https://www.hollywoodreporter.com/news/kevin-sorbo-alleges-designer-gianni-versace-sexually-harassed-him-1051637", "text": "Actor Kevin Sorbo alleges that he was sexually harassed by the late Italian fashion magnate Gianni Versace when he was working as a model decades ago.\n\nSorbo made the claim on Adam Carolla’s podcast Tuesday during a conversation about the multitude of women who have accused producer Harvey Weinstein of sexual harassment and assault.\n\n“I’ve got my sexual harassment story,” Sorbo told Carolla during the discussion.\n\nSorbo said that in 1984, prior to his stint as the lead on Hercules: The Legendary Journeys, which ran for six seasons in the late 1990s, Versace approached him in Italy, where he was modeling: “He wanted to meet me because of my height. At 6-foot, 3-inches, he wanted me to do fashion shows with these 6-foot-tall women.”\n\nSorbo says he was invited to a dinner party where he met Sophia Loren, opera star Luciano Pavarotti, Richard Gere and others. He was invited for several more dinner parties, each one with fewer attendees, until one time it was him and Versace alone, where he told Sorbo he wanted him in commercials advertising his fashion brand.\n\n“All of a sudden, his hand goes up my leg,” says Sorbo. “Dude, you know I’m straight?” he told Versace.\n\n“This is why I like you. You’re not a girly man. You are a man’s man,” Versace told Sorbo, according to his recollection.\n\n“In life, you must fuck everything. You must do the dog, and the cat, and the boy, and the girl,” the actor recalls Versace telling him.\n\nSorbo says he told Versace they were leading two different lifestyles, then Versace said to him he wanted to “build a bridge” between them. “The bridge was never built, and I never got the campaign,” Sorbo says. “I got four free dinners.”\n\nSorbo was on Carolla’s podcast to promote faith-based film Let There Be Light, which opens Friday. The film is notable as it is Fox News personality Sean Hannity’s first foray into filmmaking as the movie’s executive producer.\n\nVersace was one of the world’s leading fashion designers before he was shot to death at his Miami Beach mansion in 1997. His murder will be explored next year in FX’s American Crime Story: The Assassination of Gianni Versace.\n\nSorbo later told The Hollywood Reporter that he remained friends with Versace.\n\n“He booked me for his fashion shows but I never got his campaign, but I knew the game, just like I know the game of Hollywood,” Sorbo told THR. “Casting couches have always been around. I don’t play that game, nor do I care to.”", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/02/kevin_sorbo.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2017/02/kevin_sorbo.jpg?w=1296&h=730&crop=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/02/kevin_sorbo.jpg?w=1024", "keywords": [], "authors": ["Paul Bond"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/kevin-sorbo-alleges-designer-gianni-versace-sexually-harassed-him-1051637/", "title": "Kevin Sorbo Alleges Designer Gianni Versace Sexually Harassed Him", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The actor, most famous for playing Hercules, claims the late Italian designer made an unwanted sexual advance while he was working as a model.", "news_keywords": "Adam Carolla, autoplay, Kevin Sorbo, Sean Hannity", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Paul Bond", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1051637, "title": "Kevin Sorbo Alleges Designer Gianni Versace Sexually Harassed Him", "published_at": "2017-10-24 19:09:52", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/02/kevin_sorbo.jpg?w=1024", "comment_count": 0, "tags": "Sean Hannity", "topics": "News", "body": "Actor Kevin Sorbo alleges that he was sexually harassed by the late Italian fashion magnate Gianni Versace when he was working as a model decades ago.\r\nSorbo made the claim on Adam Carolla's podcast Tuesday during a conversation about the multitude of women who have accused producer Harvey Weinstein of sexual harassment and assault.\r\n\"I've got my sexual harassment story,\" Sorbo told Carolla during the discussion.\r\nSorbo said that in 1984, prior to his stint as the lead on Hercules: The Legendary Journeys, which ran for six seasons in the late 1990s, Versace approached him in Italy, where he was modeling: \"He wanted to meet me because of my height. At 6-foot, 3-inches, he wanted me to do fashion shows with these 6-foot-tall women.\"\r\nSorbo says he was invited to a dinner party where he met Sophia Loren, opera star Luciano Pavarotti, Richard Gere and others. He was invited for several more dinner parties, each one with fewer attendees, until one time it was him and Versace alone, where he told Sorbo he wanted him in commercials advertising his fashion brand.\r\n\"All of a sudden, his hand goes up my leg,\" says Sorbo. \"Dude, you know I'm straight?\" he told Versace.\r\n\"This is why I like you. You're not a girly man. You are a man's man,\" Versace told Sorbo, according to his recollection.\r\n\"In life, you must fuck everything. You must do the dog, and the cat, and the boy, and the girl,\" the actor recalls Versace telling him.\r\nSorbo says he told Versace they were leading two different lifestyles, then Versace said to him he wanted to \"build a bridge\" between them. \"The bridge was never built, and I never got the campaign,\" Sorbo says. \"I got four free dinners.\"\r\nSorbo was on Carolla's podcast to promote faith-based film Let There Be Light, which opens Friday. The film is notable as it is Fox News personality Sean Hannity's first foray into filmmaking as the movie's executive producer.\r\nVersace was one of the world's leading fashion designers before he was shot to death at his Miami Beach mansion in 1997. His murder will be explored next year in FX's American Crime Story: The Assassination of Gianni Versace.\r\nSorbo later told The Hollywood Reporter that he remained friends with Versace.\r\n\"He booked me for his fashion shows but I never got his campaign, but I knew the game, just like I know the game of Hollywood,\" Sorbo told THR. \"Casting couches have always been around. I don't play that game, nor do I care to.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Kevin Sorbo Alleges Designer Gianni Versace Sexually Harassed Him", "url": "https://www.hollywoodreporter.com/news/general-news/kevin-sorbo-alleges-designer-gianni-versace-sexually-harassed-him-1051637/", "description": "The actor, most famous for playing Hercules, claims the late Italian designer made an unwanted sexual advance while he was working as a model.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/02/kevin_sorbo.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-10-24T19:09:52+00:00", "modified_time": "2017-10-26T14:00:37+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Kevin Sorbo Alleges Designer Gianni Versace Sexually Harassed Him", "description": "The actor, most famous for playing Hercules, claims the late Italian designer made an unwanted sexual advance while he was working as a model.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/02/kevin_sorbo.jpg?w=1296"}}, "movies": [], "publish_date": 1508872192.0, "source": "https://www.hollywoodreporter.com", "summary": ""}