{"url": "https://madamenoire.com/500775/celebs-who-date-their-managers/", "text": "1 of 13 ❯ ❮\n\nof 13\n\nWith certain celebrities, sometimes the line between business and pleasure has become blurred. These stars ended up dating or even marrying their managers.\n\nhttps://instagram.com/p/tJitlSP-Z1/ Kelly Rowland 2014 was a big year for Kelly Rowland. Not only did she become a wife, she became a mother as well. The former Destiny’s Child member started dating manager Tim Weatherspoon in 2011. Two years later he asked her to be his wife via Skype. Last May, the couple tied the knot with a destination wedding in Costa Rica. A few months later Rowland gave birth to their son Titan.\n\nhttps://instagram.com/p/rrs40kgYHR/ Mary J. Blige Not only does Mary J. Blige trust Kendu Isaacs with her heart, she trusts him with her career, too. They recently celebrated their 11th wedding anniversary and he’s been in charge of her career just as long. “I’m just happy that my man is still with me and he’s had the courage to stay with me. I’m grateful for that,” Blige said when asked about how she felt about her 11th wedding anniversary.\n\nWendy Williams Wendy Williams has gone from dominating the radio airwaves in New York to having her own national daytime talk show. And there for much of her success and helping her navigate her radio and television career as well as other projects has been husband Kevin Hunter. They tied the knot back in 1997 and a year later he became her agent. After suffering two miscarriages, Williams and her husband are now the parents to one teenage son.\n\nUsher Usher enjoyed life as a single man following his divorce from wife Tameka Foster in 2008 until he started dating Grace Miguel shortly afterward. But over the holiday season, Usher reportedly popped the big question and his manager Grace has been spotted tooling around Miami with what appeared to be a diamond band on her left ring finger. “I have an incredible partner and manager,” Usher said. “She has helped me through some of the hardest times in my life and my career. She’s someone who’s been able to support and understand all of who I am. Not just as a dancer or as a performer or as a singer, but as a humanitarian and a businessman and as a person.”\n\nTasha Smith Tasha Smith’s an example of how mixing business and pleasure doesn’t always work. The “Why Did I Get Married?” star tied the knot to her boyfriend of one year, Keith Douglas, in 2010. Douglas was also her manager, but a few months ago, Douglas filed for a restraining order against Smith, claiming that he was fearful of his life. She went to court and filed for a restraining order of her own. A judge ordered Smith and Douglas to stay away from each other, which could be especially challenging because they still lived in the same house together.\n\nhttps://instagram.com/p/xDjl8EgsWR/ Tamar Braxton Tamar Braxton had dreams of becoming a chart-topping singer but when her first album flopped, she settled for singing background for big sister Toni. But “Braxton Family Values” proved to be the perfect launching pad and Tamar’s solo career she was given a new lease on life. Hubby Vince Herbert had his hands full managing his wife’s new career. Vince was also Lady Gaga’s manager and viewers of “Braxton Family Values” and “Tamar and Vince” have watched her complain about not being on the top of his list of priorities.\n\nView this post on Instagram Repost from @rasheedadabosschick #HappyNewYear 💯 what's good??? #2015 A post shared by Kirk Frost (@frost117) on Dec 31, 2014 at 10:43pm PST Rasheeda Frost Kirk Frost has been managing wife Rasheeda’s career longer than they’ve been married. The “Love & Hip Hop Atlanta” star had been managing his wife’s career for 17 years and married for 12 when in 2012 she wanted a change in direction. Rasheeda spoke to famed manager Debra Antney about possibly managing her career and she was in tears when cameras were present as Rasheeda told Kirk that she wanted to fire him as her manager. Fortunately, they worked through their professional and personal issues and are good now.\n\nCeline Dion Age ain’t nothing but a number. At least that’s according to Celine Dion and her husband Rene. They first met when she was 12 and he was 38 years old. He began managing her career and seven years later their professional relationship became something much more. They got married in 1994 and after trying the old-fashioned way to have a child, the couple welcomed a son after in-vitro fertilization treatments in 2001. Dion became a mother again when she welcomed twins in 2010.\n\nBritney Spears Following her split from hubby Kevin Federline and a very public meltdown that landed her in the psych ward, Britney Spears worked on piecing her life back together. There to help her get her career back on track was manager Jason Trawick. But soon he became more than her employee and the couple began dating in 2009. He asked for her hand in marriage at the end of 2011 but they would never make it down the aisle together. They split soon after ushering in 2013.\n\nLa Toya Jackson La Toya Jackson’s relationship with manager Jack Gordon started out strictly professional. But when things took a romantic turn, Gordon suddenly became very controlling. The pair ended up getting married and La Toya’s career took a sharp nosedive and when she realized he was looking to have her star in pornography, Jackson had enough. The marriage only lasted a year. She filed for a divorce and sued her former hubby in civil court for years of abuse under the Violence Against Women Act.\n\nBobby Brown Bobby Brown was married to Whitney Houston for 15 years and when their tumultuous relationship came to an end, the self-proclaimed King of R&B found solace with manager Alicia Etheridge. They welcomed a son together in 2009 and a year later the “Don’t Be Cruel” singer asked for her hand in marriage. He proposed to her while performing onstage at the Funk Fest in Jacksonville, FL. They got married two years later in Hawaii.\n\nView this post on Instagram A post shared by AMERIE 에므리 📚🎼 (@amerie) on Apr 4, 2014 at 12:48pm PDT Ameriie Ameriie has probably been more focused on her relationship than her career, which wouldn’t be such a bad thing if she weren’t involved with her manager. The “One Thing” singer has been dating longtime boyfriend and manager Lenny Nicholson since 2004 and they got married in 2011 in an oceanfront wedding in Anguilla. She’s expected to release two projects in 2015 and is slated to go on tour in the UK as well.\n\nView this post on Instagram Cooking for friends and family on New Year's Eve!! 🎉🎉🎉 A post shared by Mariah Carey (@mariahcarey) on Dec 31, 2014 at 8:45pm PST Mariah Carey Her marriage to Tommy Mottola may have been rocky but one thing is for certain: the Sony executive helped turn Mariah Carey into a star. She was 20 years his junior and has revealed that Mottola made her feel inferior in their marriage. They also had a difference in opinion as far as the creative directions her albums and career would go. After five years of marriage, the “Butterfly” singer had enough of Mottola’s controlling ways and filed for a divorce.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035391&cv=3.6.0&cj=1", "https://madamenoire.com/wp-content/themes/bossip4/images/madamenoire_logo_white.svg", "https://madamenoire.com/wp-content/uploads/sites/9/2017/10/cropped-tab-logo.jpg?strip=all&quality=80", "https://www.facebook.com/tr?id=187138648481959&ev=PageView&noscript=1", "https://madamenoire.com/wp-content/themes/bossip4/images/madamenoire_logo.svg"], "top_img": "https://madamenoire.com/wp-content/uploads/sites/9/2017/10/cropped-tab-logo.jpg?strip=all&quality=80", "keywords": [], "authors": ["Iva Anthony"], "canonical_link": "https://madamenoire.com/500775/celebs-who-date-their-managers/", "title": "Mixin’ Business With Pleasure: Celebs Who Date Their Managers", "meta_data": {"fb": {"admins": 100006356380901, "pages": 123136324375898}, "google-site-verification": "89cYy4uYOnrle-D3H3SPnHJySu32IytBEKjsv1_skZo", "y_key": "637ec967f3cf29ad", "viewport": "width=device-width, initial-scale=1.0", "article-type": "slideshow", "robots": "max-image-preview:large", "description": "Celebs marrying their managers is nothing new in Hollywood and these famous people have also mixed business with pleasure.", "twitter": {"card": "summary_large_image", "title": "Celebs Who Date Their Managers", "description": "Celebs marrying their managers is nothing new in Hollywood and these famous people have also mixed business with pleasure.", "creator": "@MadameNoire", "site": "@MadameNoire", "label1": "Written by", "data1": "MadameNoire", "label2": "Est. reading time", "data2": "6 minutes"}, "generator": "WordPress 6.0.2", "wp-parsely_version": "1.13.0", "sailthru.date": "2015-01-27 09:10:49", "sailthru.title": "Mixin’ Business With Pleasure: Celebs Who Date Their Managers", "sailthru.tags": ",celebrity couples,Arts & Entertainment,Slideshows", "sailthru.author": "Iva Anthony", "sailthru.description": "Sometimes it works...sometimes not so much.", "og": {"type": "article", "title": "Mixin’ Business With Pleasure: Celebs Who Date Their Managers", "url": "https://madamenoire.com/500775/celebs-who-date-their-managers/", "description": "Sometimes it works…sometimes not so much.", "site_name": "MadameNoire", "image": {"identifier": "https://madamenoire.com/wp-content/uploads/sites/9/2017/10/cropped-tab-logo.jpg?strip=all&quality=80", "width": 512, "height": 512}, "locale": "en_US"}, "article": {"published_time": "2015-01-27T14:10:49+00:00", "modified_time": "2015-01-27T14:10:49+00:00"}, "msapplication-TileImage": "https://madamenoire.com/wp-content/uploads/sites/9/2017/10/cropped-tab-logo.jpg?w=270&strip=all&quality=80"}, "movies": [], "publish_date": 1422367849.0, "source": "https://madamenoire.com", "summary": ""}