{"url": "https://www.hollywoodreporter.com/live-feed/greys-anatomy-unexpected-way-sara-ramirez-returned-season-14-finale-1112728", "text": "[This story contains spoilers from Grey’s Anatomy’s 14th season finale, “All of Me.”]\n\nABC’s Grey’s Anatomy found a unique way to incorporate Sara Ramirez into Jessica Capshaw’s final episode.\n\nAs diehard Grey’s viewers recall, Ramirez portrayed Callie — Arizona’s (Capshaw) ex-wife who moved to New York with then-girlfriend Penny — when the actress exited the Shondaland drama back in season 12.\n\nDuring Thursday’s season 14 finale, which marked the final episode for longtime regulars Capshaw and Sarah Drew (April), Ramirez was not featured onscreen but the ABC medical drama found a smart and subtle way to incorporate the fan favorite (who now co-stars on CBS’ Madam Secretary).\n\nIf the song that played during the episode’s final scene — aka the weddings between April and Matthew and Alex and Jo — sounded familiar, it should have. The song was a cover of Brandi Carlile’s signature hit “The Story” — as performed by Ramirez during “Song Beneath the Song,” the season seven musical episode of Grey’s Anatomy.\n\nAnd while Ramirez’s Callie was never seen onscreen, the character did have a prominent role. Arizona, newly single after breaking things off with Carina (Stefania Spampinato), decided to move back to New York so her daughter with Callie could have both of her parents in the same city. During Thursday’s finale, Arizona revealed that Callie was single now as well. What’s more, Arizona told April and Richard that she was having feelings again for Callie — with the latter seemingly of the same mindset.\n\nWhat did you think of Ramirez’s cameo and how Arizona’s storyline ended? Sound off in the comments section below. For more on the season finale, click here. Grey’s Anatomy returns in the fall on ABC for its 15th season.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2014/02/134344_0334_ful.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2014/02/134344_0334_ful.jpg?w=2000&h=1126&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2014/02/134344_0334_ful.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/greys-anatomy-unexpected-way-sara-ramirez-returned-season-14-finale-1112728/", "title": "‘Grey’s Anatomy’: The Unexpected Way Sara Ramirez Returned in the Season 14 Finale", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Season 14 ended on a familiar note as Ramirez's Callie played an important role.", "news_keywords": "Grey's Anatomy", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1112728, "title": "'Grey's Anatomy': The Unexpected Way Sara Ramirez Returned in the Season 14 Finale", "published_at": "2018-05-17 18:15:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2014/02/134344_0334_ful.jpg?w=1024", "comment_count": 0, "tags": "Grey's Anatomy", "topics": "TV News", "body": "[This story contains spoilers from Grey's Anatomy's 14th season finale, \"All of Me.\"]\r\nABC's Grey's Anatomy found a unique way to incorporate Sara Ramirez into Jessica Capshaw's final episode.\r\nAs diehard Grey's viewers recall, Ramirez portrayed Callie — Arizona's (Capshaw) ex-wife who moved to New York with then-girlfriend Penny — when the actress exited the Shondaland drama back in season 12.\r\n\r\nDuring Thursday's season 14 finale, which marked the final episode for longtime regulars Capshaw and Sarah Drew (April), Ramirez was not featured onscreen but the ABC medical drama found a smart and subtle way to incorporate the fan favorite (who now co-stars on CBS' Madam Secretary).\r\nIf the song that played during the episode's final scene — aka the weddings between April and Matthew and Alex and Jo — sounded familiar, it should have. The song was a cover of Brandi Carlile's signature hit \"The Story\" — as performed by Ramirez during \"Song Beneath the Song,\" the season seven musical episode of Grey's Anatomy.\r\n\r\nAnd while Ramirez's Callie was never seen onscreen, the character did have a prominent role. Arizona, newly single after breaking things off with Carina (Stefania Spampinato), decided to move back to New York so her daughter with Callie could have both of her parents in the same city. During Thursday's finale, Arizona revealed that Callie was single now as well. What's more, Arizona told April and Richard that she was having feelings again for Callie — with the latter seemingly of the same mindset.  \r\nWhat did you think of Ramirez's cameo and how Arizona's storyline ended? Sound off in the comments section below. For more on the season finale, click here. Grey's Anatomy returns in the fall on ABC for its 15th season.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Grey’s Anatomy’: The Unexpected Way Sara Ramirez Returned in the Season 14 Finale", "url": "https://www.hollywoodreporter.com/tv/tv-news/greys-anatomy-unexpected-way-sara-ramirez-returned-season-14-finale-1112728/", "description": "Season 14 ended on a familiar note as Ramirez’s Callie played an important role.", "site_name": "The Hollywood Reporter", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2014/02/134344_0334_ful.jpg?w=1024", "locale": "en_US"}, "article": {"published_time": "2018-05-17T18:15:00+00:00", "modified_time": "2018-05-18T09:46:17+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Grey’s Anatomy’: The Unexpected Way Sara Ramirez Returned in the Season 14 Finale", "description": "Season 14 ended on a familiar note as Ramirez’s Callie played an important role.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2014/02/134344_0334_ful.jpg?w=3000"}}, "movies": ["https://www.youtube.com/embed/nJmOU6exdEg"], "publish_date": 1526580900.0, "source": "https://www.hollywoodreporter.com", "summary": ""}