{"url": "https://en.wikipedia.org/wiki/That_Thing_You_Do!", "text": "1996 film\n\nThat Thing You Do! is a 1996 American comedy film co-starring, written, and directed by Tom Hanks, in his feature writing and directorial debut. It tells the story of the rise and fall of a fictional 1960s one-hit wonder pop band, and stars Tom Everett Scott, Liv Tyler, Johnathon Schaech, Steve Zahn, Ethan Embry, and Charlize Theron. The film resulted in a musical hit with the titular song of the same name, which was nominated for an Academy Award and a Golden Globe Award for Best Original Song.[2]\n\nPlot [ edit ]\n\nIn 1964, Guy Patterson, an aspiring jazz drummer, is working in his family's appliance store in Erie, Pennsylvania, when he is asked by Jimmy Mattingly and Lenny Haise to perform at a talent show with their band the Oneders and cover for Chad, their regular drummer who broke an arm. At the talent show, Guy launches into a faster tempo than Jimmy intended for his original song, \"That Thing You Do!\" Jimmy is angered, but Guy's tempo wins them the talent show.\n\nThey win a paying gig at Villapiano's, a local pizza parlor. When a fan asks for a record, they decide to record the song and sell 45s of it. Local talent promoter Phil Horace notices the band, promising to get them on the radio within 10 days. Lenny convinces the band to sign with him.\n\nPhil gets the song on Pennsylvania radio, and he books them at a rock & roll showcase concert in Pittsburgh. They have technical difficulties, however, and are booed off the stage. Afterwards, Phil brings a dispirited Guy to meet with Mr. White, an A&R representative for Play-Tone Records, who offers a contract and becomes their manager. He re-spells the band's name as \"The Wonders\", offers them advice on style and presentation (including insisting that Guy always wear sunglasses), asks them to join the Play-Tone tour of Midwestern state fairs, and suggests Jimmy's girlfriend Faye join the tour as their \"costume mistress\".\n\nDuring the tour, the Wonders meet other acts, learn about the business, and become better performers. Jimmy spends time with a disillusioned tour singer named Diane Dane, while the bassist (never identified by name) falls for a member of a girl group, the Chantrellines. \"That Thing You Do!\" garners national radio airplay and the band's popularity soars. While most of the band enjoys their taste of fame, Jimmy is itching to return to the studio and is increasingly indifferent to Faye, which troubles Guy and Mr. White alike.\n\nWhen \"That Thing You Do!\" reaches #7 on the Billboard charts, Mr. White sends them to Los Angeles to do publicity, including radio and film appearances. On the day of their appearance on The Hollywood Television Showcase, a nationally televised live variety show, things start to go awry. The bassist—whom the band knew had enlisted in the Marines and was awaiting his call to boot camp—is nowhere to be found, so Mr. White replaces him with an older, experienced session bassist named Scott Pell, nicknamed \"Wolfman\". Guy is hung over; the night before, he went to a jazz club and met and drank with his idol, pianist Del Paxton. Jimmy is vomiting due to a stomach flu; Lenny is preoccupied with his new girlfriend. Still, the Wonders manage to cooperate for their television appearance. When television captions introduce the members of the band, Jimmy's caption reads \"Careful, girls, he's engaged!\"\n\nAfter the performance, Jimmy lashes out at Faye in the dressing room, insinuating that she was responsible for the \"engaged\" caption (although White implies that it was him). Jimmy insists they are not engaged and he has no intention of proposing. Faye, already disillusioned with Jimmy, breaks up with him. The next day, at a scheduled recording session, the original bassist is still missing and so is Lenny. Mr. White has provided new material for Jimmy and Guy to record, but Jimmy wants to do his original songs. When Mr. White reminds him that the terms of their contract allow Play-Tone to dictate their material, Jimmy quits on the spot. Guy is now the only remaining Wonder. Mr. White assures him that such things are common in the music industry. Guy hangs out in the studio for a while; his idol Paxton is also there making a recording and is impressed with Guy's drumming. They jam together and Del asks Guy to stay in Los Angeles to record a jazz album and become a session musician.\n\nGuy returns to the hotel to check out. He tells Faye he plans to stay in L.A., while she says she will return to Erie. She goes to the curb to call a cab, Guy chases after her and they kiss.\n\nOnscreen text reveals that Jimmy became a record producer; Lenny is a divorced hotel and casino manager in Nevada; the bassist (identified as T.B. Player) earned a Purple Heart in Vietnam, then worked in construction in Orlando, Florida; and Guy and Faye are married with four children in Bainbridge Island, Washington, where Guy teaches jazz composition at their own music conservatory.\n\nCast [ edit ]\n\nPlay-Tone artists\n\nRobert Torti as Freddy Fredrickson\n\nKennya Ramsey, Julie Harkness, and Darlene Dillinger as the Chantrellines\n\nChaille Percival as Diane Dane\n\nCameos and supporting roles\n\nProduction and music [ edit ]\n\nThe movie features original music by Tom Hanks, Adam Schlesinger, Rick Elias, Scott Rogness, Mike Piccirillo, Gary Goetzman and Howard Shore. In the movie, the Wonders' rise to brief stardom on the strength of \"That Thing You Do\", a song written as a wistful ballad but which becomes an uptempo rocker during the band's first performance at a talent show. Written and composed for the film by Adam Schlesinger, bassist for Fountains of Wayne and Ivy and released on the film's soundtrack, the song became a genuine hit for the Wonders in 1996 (the song peaked at #41 on the Billboard Hot 100, #22 on the Adult Contemporary charts, #18 on the Adult Top 40, and #24 on the Top 40 Mainstream charts). The track was nominated for a 1996 Golden Globe Award as well as a 1996 Academy Award for Best Original Song. Mike Viola of the Candy Butchers provided the lead vocals for the Wonders.\n\nIn the film, the title song is referenced with \"All My Only Dreams\" as the B-side. The actual 45 rpm single, released to record stores in North America, features \"Dance With Me Tonight\" as its B-side. The song has since been recorded by the Knack, Billie Joe Armstrong, and Bubblegum Lemonade. The Wonders are also seen playing the song \"Little Wild One\". This was written by the band Gigolo Aunts as a \"faux-Beatles\"-style tune at the request of their record label to be submitted for consideration for inclusion in the film.[3]\n\nFor the purpose of being able to convincingly perform the Wonders' songs on-camera, Scott, Schaech, Zahn and Embry took several weeks of individual lessons, followed by daily practice as a group. Of the four, only Zahn and Embry had any prior experience of playing their assigned instruments. They eventually honed their performance to the point where extras on the set thought they were actually playing the songs, when in reality they were miming along to recordings by professional musicians.[4]\n\nThe song that plays during the film's opening credits, \"Lovin' You Lots and Lots\", is credited to the fictitious Norm Wooster Singers and was actually written by Hanks. This song is a send-up of Ray Conniff, Mitch Miller, and other practitioners of the \"beautiful music\" or proto-Muzak formats that were a staple of adult radio during the early 1960s such as on KPOL (AM) 1540 in Los Angeles.[5][6] Hanks also composed Guy's jazzy signature drum solo, \"I Am Spartacus\".\n\nThe Wonders' bassist (played by Ethan Embry) is unnamed in the film; in the end credits, he is credited as \"T.B. Player\". This is short for \"The Bass Player\", and is a joke based on the perception that bass players are often unknown and unappreciated. Embry later provided his own take on the character's real name: \"I just said my name was Tobias, because he’s such a Tobias. You just take the vowels out [and it's T.B.] His nickname was Toby, but his mom calls him Tobias. And his last name actually was Player, because he was a player, dude! That carousel ride with the Chantrellines? Total player.\"[4]\n\nInspirations for the Wonders [ edit ]\n\nThere were at least two real bands named the Wonders who made the record charts at various radio stations in the early 1960s. One had a ballad titled \"With These Hands\" (b/w \"Please Don't Cry\"; Bamboo 523) that was played by KCRG in Cedar Rapids, Iowa, in the fall of 1962.[7]\n\nThe other Wonders had a regional hit record called \"Say There\" (b/w \"Marilyn\"; Colpix 699), released by Colpix Records in August 1963.[8] Little is known about these Wonders, except that they were probably from Ohio or Pennsylvania; \"Say There\" hit the Top 20 at WCOL in Columbus, Ohio, and made the Top 30 at KQV in Pittsburgh.[9]\n\nSoundtrack [ edit ]\n\nThe soundtrack album (released under the Playtone name in conjunction with Epic Records) was also a hit, peaking at #21 on the Billboard 200 albums chart. The CD artwork is a replica of the fictional Playtone label used in the movie, and the liner notes are done in a mockumentary style, as if the Wonders had been a real group and the events of the film had actually happened. Hanks later used the success of That Thing You Do! as a springboard to launch the actual Playtone Records label, through which the soundtracks of all his subsequent films, as well as other films such as Bring It On and television programs such as The Sopranos, were released as albums.\n\nTrack listing [ edit ]\n\nNo. Title Music Artist Length 1. \"Lovin' You Lots and Lots\" Tom Hanks The Norm Wooster Singers 1:54 2. \"That Thing You Do!\" Adam Schlesinger The Wonders 2:47 3. \"Little Wild One\" David Gibbs, Steve Hurley, Phil Hurley, Fred Elringham The Wonders 2:30 4. \"Dance With Me Tonight\" Scott Rogness, Rick Elias The Wonders 2:05 5. \"All My Only Dreams\" Rogness, Elias The Wonders 2:54 6. \"I Need You (That Thing You Do)\" (The movie credits list this song as being from the Heardsmen.) Rogness, Elias, Linda Elias The Wonders 2:53 7. \"She Knows It\" Rogness, Elias The Heardsmen 3:01 8. \"Mr. Downtown\" Hanks, Gary Goetzman, Mike Piccirillo Freddy Fredrickson 2:32 9. \"Hold My Hand, Hold My Heart\" Hanks, Goetzman, Piccirillo The Chantrellines 3:11 10. \"Voyage Around the Moon\" Hanks, Goetzman, Piccirillo The Saturn 5 3:04 11. \"My World Is Over\" Piccirillo Diane Dane 3:01 12. \"Drive Faster\" Rogness, Elias The Vicksburgs 2:48 13. \"Shrimp Shack\" Piccirillo Cap'n Geech & the Shrimp Shack Shooters 2:22 14. \"Time To Blow\" Steve Tyrell, Robert Mann Del Paxton 4:20 15. \"That Thing You Do! (Live at the Hollywood Television Showcase)\" Schlesinger The Wonders 2:54 Total length: 42:09\n\nCertifications [ edit ]\n\nRegion Certification Certified units/sales United States (RIAA)[10] Platinum 1,000,000 Sales+streaming figures based on certification alone.\n\nReception [ edit ]\n\nBox office [ edit ]\n\nThe film grossed $25.9 million domestically and $8.7 million internationally for a total worldwide gross of $34.6 million.[1] The film debuted at No. 3.[11]\n\nCritical response [ edit ]\n\nOn Rotten Tomatoes, the film has an approval rating of 93% based on reviews from 59 critics, with an average rating of 7.20/10. The site's consensus reads, \"A light, sweet, and thoroughly entertaining debut for director Tom Hanks, That Thing You Do! makes up in charm what it lacks in complexity\".[12] On Metacritic, the film has a score of 71 out of 100 based on reviews from 22 critics, indicating \"generally favorable reviews\".[13]\n\nEmanuel Levy of Variety called it \"A top-notch production, exuberant period music and Hanks the actor in an important role cunningly disguise a rather slight and inconsequential narrative.\"[14] Roger Ebert of the Chicago Sun-Times gave it 3 out of 4 and wrote: \"The movie may be inconsequential, but in some ways that's a strength. Without hauling in a lot of deep meanings, it remembers with great warmth a time and a place.\"[15]\n\nAccolades [ edit ]\n\nThe film is recognized by the American Film Institute in this list:\n\nReunion [ edit ]\n\nThe Erie SeaWolves hosted Wonders Night on September 4, 2021, at UPMC Park. Cast members Johnathon Schaech, Tom Everett Scott, and Steve Zahn traveled to Erie for the occasion and participated in a panel discussion, autograph session, and elements of the ballgame presentation. Cast member Ethan Embry joined the panel discussion virtually. As a result of funds collected from VIP experiences as well as memorabilia and jersey auctions, the 25th anniversary event raised $25,500 for Notice Ability, a nonprofit organization dedicated to helping students with dyslexia.[25] Additional donations were made to Notice Ability, bringing the total sum raised to nearly a quarter of a million dollars.[26] Wonders Night also earned the SeaWolves Promotion of the Year recognition by Ballpark Digest.[27]\n\nHome media [ edit ]\n\nInitial release [ edit ]\n\nThat Thing You Do! was first released in mid-1997 on VHS and Laserdisc. In 1998, the film became available in the DIVX format (as with all 20th Century Fox films), rather than DVD.\n\nFirst DVD [ edit ]\n\nAfter DIVX failed, the film was released onto DVD on June 5, 2001. It included the featurette \"The Making of That Thing You Do!,\" and two music videos.\n\nExtended Edition DVD [ edit ]\n\nOn May 8, 2007, Tom Hanks' Extended Edition was released on DVD. The film's theatrical cut and an extended cut with 39 additional minutes of deleted scenes are included.\n\nMany of the deleted scenes are devoted to character development. A tastefully steamy look at Guy's \"make-out\" session with Tina at his apartment is included. The extended version also goes more in-depth with Guy's developing relationship with Faye (via mild flirting) and his deteriorating relationship with Tina, as well as Tina's budding relationship with her dentist, Dr. Collins. It also suggests that the character portrayed by Tom Hanks (Mr. White) is not only gay but in a relationship with a man played by former NFL defensive lineman Howie Long.[28]\n\nMore camera time is also devoted to the tryst between the bass player and one of the singers of the Chantrellines. In the theatrical cut, this romance was depicted mainly as an unrequited crush on the part of the bass player; in the extended cut it is clearly shown that his efforts were successful.\n\nAt the end of the Extended Edition, rather than becoming a studio drummer on the recommendation of Del Paxton, Guy becomes a disc jockey for the jazz station KJZZ and records a documentary series of interviews with legendary jazz musicians.\n\n2007 DVD repackage re-release [ edit ]\n\nThat Thing You Do! was packaged with Bachelor Party and The Man with One Red Shoe in the Tom Hanks Triple Feature DVD anthology set. The actual DVD appears to be the original 2001 disc, with the featurette and music videos.\n\nBlu-ray release [ edit ]\n\n20th Century Fox Home Entertainment released the film on Blu-ray on April 2, 2013. The Blu-ray includes the Theatrical and Extended cuts as well as all of the bonus features found on the 2-Disc DVD.\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/5/51/That_Thing_You_Do%21_film_poster.jpg/220px-That_Thing_You_Do%21_film_poster.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/5/51/That_Thing_You_Do%21_film_poster.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/5/51/That_Thing_You_Do%21_film_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/That_Thing_You_Do!", "title": "That Thing You Do!", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/5/51/That_Thing_You_Do%21_film_poster.jpg", "width": 640, "height": 946}, "title": "That Thing You Do! - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}