{"url": "https://web.archive.org/web/20170531182357/http://www.seattletimes.com/nation-world/developer-pleads-no-contest-in-los-angeles-mega-mansion-case/", "text": "LOS ANGELES (AP) — A developer of luxury homes has pleaded no contest in Los Angeles to misdemeanor charges stemming from construction of a huge Bel Air mansion that the city says has extensive features that were never approved.\n\nThe pleas were entered Tuesday on behalf of Mohamed Hadid to three charges involving erecting a structure other than what was permitted, failing to make the building conform to code and failing to comply with an order issued by the Department of Building and Safety.\n\n“These were serious violations,” City Attorney Mike Feuer said in a statement. “It was essential to hold the defendant accountable for committing them. We have building and safety rules for a reason, and no one is above the law. At the sentencing hearing we’ll make our case for strong and appropriate sanctions.”\n\nHadid is the father of models Bella and Gigi Hadid.\n\nThe Los Angeles Times (http://lat.ms/2rBq7DK) says the roughly 30,000-square-foot (2,787 square meters) mansion has entire areas including bedrooms, decks and an IMAX theater that weren’t approved.\n\nCity officials ordered work on the gigantic home stopped three years ago amid claims by neighbors below that the hillside above their homes had been destabilized.\n\nOne of them, entertainment lawyer Joseph Horacek, labeled the unfinished structure the “Starship Enterprise.”\n\nSome critics want most of the mansion to be torn down, but its fate is not yet certain.\n\nThe 68-year-old Hadid, who did not appear in court Tuesday, will be sentenced next month.\n\nThe prosecution wants the judge to impose numerous requirements, including hundreds of hours of community service, fines of $1,000 for each of the three charges, and a contribution of $250,000 to a community fund.\n\nSenior Assistant City Attorney Tina Hess also wants a bond to ensure that if the structure cannot be completed legally, the city will have funds to pay for its demolition.\n\nOne of Hadid’s attorneys, Robert Shapiro, said at a hearing earlier this month that his client was trying to get loans to complete the house and argued for more time to work things out with the city, raising the prospect that it could sit unfinished for years if the case went to trial.\n\nThe attorney urged that the best thing to do would be to complete the house, but the Times said city records indicate that revised plans already submitted have not yet received numerous clearances from the building department.", "images": ["https://web.archive.org/web/20170531182357im_/http://www.seattletimes.com/wp-content/themes/st_refresh/img/lazy-loading-14x9.png", "https://web.archive.org/web/20170531182357im_/http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png"], "top_img": "https://web.archive.org/web/20170531182357im_/http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "keywords": [], "authors": ["The Associated Press"], "canonical_link": "https://web.archive.org/web/20170531182357/http://www.seattletimes.com/nation-world/developer-pleads-no-contest-in-los-angeles-mega-mansion-case/", "title": "Developer pleads no contest in Los Angeles mega mansion case", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "noarchive", "description": "LOS ANGELES (AP) — A developer of luxury homes has pleaded no contest in Los Angeles to misdemeanor charges stemming from construction of a huge Bel Air mansion that the...", "twitter": {"card": "summary_large_image", "site": "@seattletimes", "title": "Developer pleads no contest in Los Angeles mega mansion case", "description": "LOS ANGELES (AP) — A developer of luxury homes has pleaded no contest in Los Angeles to misdemeanor charges stemming from construction of a huge Bel Air mansion that the city says has extensive features that were never approved. The...", "image": "https://web.archive.org/web/20170531182357im_/http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-twitter.png"}, "og": {"title": "Developer pleads no contest in Los Angeles mega mansion case", "type": "article", "url": "https://web.archive.org/web/20170531182357/http://www.seattletimes.com/nation-world/developer-pleads-no-contest-in-los-angeles-mega-mansion-case/", "image": "https://web.archive.org/web/20170531182357im_/http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "description": "LOS ANGELES (AP) — A developer of luxury homes has pleaded no contest in Los Angeles to misdemeanor charges stemming from construction of a huge Bel Air mansion that the city says has extensive features that were never approved. The...", "site_name": "The Seattle Times"}, "article": {"published_time": "2017-05-31 07:00:05", "modified_time": "2017-05-31 07:00:05", "section": "Nation & World"}, "news_keywords": "Nation & World", "fb": {"app_id": 1166894493389754, "pages": 38472826214, "admins": 2737159}, "msvalidate.01": "29FBBD36D14799A9FDE7843BF1E1CDD7"}, "movies": [], "publish_date": 1496210405.0, "source": "https://web.archive.org", "summary": ""}