{"url": "https://en.wikipedia.org/wiki/O._J._Simpson", "text": "American football player (born 1947)\n\n\"The Juice\" redirects here. For other uses, see Juice (disambiguation)\n\nAmerican football player\n\nOrenthal James Simpson (born July 9, 1947), nicknamed \"Juice\", is an American former football running back, actor, and broadcaster who played for the Buffalo Bills and San Francisco 49ers of the National Football League. Once a popular figure with the U.S. public, he is now best known for being tried for the murders of his former wife, Nicole Brown Simpson, and her friend Ron Goldman. Simpson was acquitted of the murders in criminal court but was later found responsible for both deaths in a civil trial.\n\nSimpson attended the University of Southern California (USC), where he played football for the USC Trojans and won the Heisman Trophy in 1968. He played professionally as a running back in the National Football League (NFL) for 11 seasons, primarily with the Buffalo Bills from 1969 to 1977. He also played for the San Francisco 49ers from 1978 to 1979. In 1973, he became the first NFL player to rush for more than 2,000 yards in a season. He holds the record for the single-season yards-per-game average, which stands at 143.1. He was the only player to rush for over 2,000 yards in the 14-game regular season NFL format. Simpson was inducted into the College Football Hall of Fame in 1983 and the Pro Football Hall of Fame in 1985. After retiring from football, he began new careers in acting and football broadcasting.\n\nIn 1994, Simpson was arrested and charged with the murders of his ex-wife, Nicole Brown Simpson, and her friend, Ron Goldman. He was acquitted by a jury after a lengthy and internationally publicized trial. The families of the victims subsequently filed a civil suit against him. A civil court awarded a $33.5 million judgment against him in 1997 for the victims' wrongful deaths. In 2000, Simpson moved to Miami, Florida to avoid paying on the liability judgment, which as of 2021 remained mostly unpaid.\n\nIn 2007, Simpson was arrested in Las Vegas, Nevada, and charged with armed robbery and kidnapping.[1] In 2008, he was convicted and sentenced to 33 years' imprisonment, with a minimum of nine years without parole.[2] He served his sentence at the Lovelock Correctional Center near Lovelock, Nevada.[3] Simpson was granted parole on July 20, 2017, which was the minimum sentence. He was eligible for release from prison on October 1, 2017, and was released on that date.[4][5] On December 14, 2021, Simpson was granted early release from his parole by the Nevada Division of Parole and Probation.[6]\n\nEarly life\n\nBorn and raised in San Francisco, California, Simpson is a son of Eunice (née Durden), a hospital administrator, and Jimmy Lee Simpson, a chef and bank custodian.[citation needed] His father was a well-known drag queen in the San Francisco Bay Area. Later in life, Jimmy Simpson announced that he was gay and died of AIDS in 1986.[7][8]\n\nSimpson's maternal grandparents were from Louisiana, and his aunt gave him the name Orenthal, which she said was the name of a French actor she liked.[9] He was called \"O. J.\" from birth and did not know that Orenthal was his given name until a teacher read it in third grade.[10] Simpson has one brother, Melvin Leon \"Truman\" Simpson, one living sister, Shirley Simpson-Baker, and one deceased sister, Carmelita Simpson-Durio. As a child, Simpson developed rickets and wore braces on his legs until the age of five,[11] giving him his bowlegged stance.[12] His parents separated in 1952, and Simpson was raised by his mother.[13]\n\nSimpson's 1964 school portrait\n\nSimpson grew up in San Francisco and lived with his family in the housing projects of the Potrero Hill neighborhood.[14] In his early teenage years, he joined a street gang called the Persian Warriors and was briefly incarcerated at the San Francisco Youth Guidance Center.[11] Future wife Marguerite, his childhood sweetheart, described Simpson as \"really an awful person then\";[15] after his third arrest, a meeting with Willie Mays during which the baseball star encouraged Simpson to avoid trouble helped persuade him to reform.[12] At Galileo High School (currently Galileo Academy of Science and Technology) in San Francisco, Simpson played for the school football team, the Galileo Lions. He graduated in 1965.\n\nAlthough Simpson was an All-City football player at Galileo, his mediocre high-school grades prevented him from attracting the interest of many college recruiters. After a childhood friend's injury in the Vietnam War influenced Simpson to stay out of the military, he enrolled at City College of San Francisco in 1965.[12] He played football both ways as a running back and defensive back and was named to the Junior College All-American team as a running back.[16] City College won the Prune Bowl against Long Beach State, and many colleges sought Simpson as a transfer student for football.[12]\n\nSimpson chose to attend the University of Southern California (USC), which he had admired as a young football fan,[12] over the University of Utah and played running back for head coach John McKay in 1967 and 1968.[17] Simpson led the nation in rushing both years under McKay: in 1967 with 1,543 yards and 13 touchdowns, and in 1968 with 1,880 yards on 383 carries.[18]\n\nAs a junior in 1967, Simpson was a close runner-up in the Heisman Trophy balloting to quarterback Gary Beban of UCLA. In that year's Victory Bell rivalry game between the teams, USC was down by six points in the fourth quarter with under 11 minutes remaining. On their own 36, USC backup quarterback Toby Page called an audible on third and seven. Simpson's 64-yard touchdown run tied the score, and the extra point provided a 21–20 lead, which was the final score.[19] This was the biggest play in what is regarded as one of the greatest football games of the 20th century.[20]\n\nAnother dramatic touchdown in the same game is the subject of the Arnold Friberg oil painting, O.J. Simpson Breaks for Daylight. Simpson also won the Walter Camp Award in 1967 and was a two-time consensus All-American.[21]\n\nSimpson was an aspiring track athlete; in 1967, he lost a 100 m race at Stanford against the then-British record holder Menzies Campbell.[22] Prior to playing football at Southern Cal, he ran in the USC sprint relay quartet that broke the world record in the 4 × 110-yard relay at the NCAA track championships in Provo, Utah on June 17, 1967.[23]\n\nAs a senior in 1968, Simpson rushed for 1,709 yards and 22 touchdowns in the regular season, earning the Heisman Trophy, the Maxwell Award, and Walter Camp Award. He held the record for the Heisman's largest margin of victory for 51 years, defeating runner-up Leroy Keyes by 1,750 points. In the Rose Bowl on New Year's Day, #2 USC faced top-ranked Ohio State; Simpson ran for 171 yards, including an 80-yard touchdown run in a 27–16 loss.[24]\n\nStatistics\n\nSimpson's stats for the USC Trojans Season Rushing Receiving Att Yds Avg TD Rec Yds Avg TD 1967 291 1,543 5.3 13 10 109 10.9 0 1968 383 1,880 4.9 23 26 211 8.1 0 Totals[25] 674 3,423 5.1 36 36 320 8.9 0\n\nBuffalo Bills\n\nSimpson with the Bills on a Topps card of 1970\n\nThe first selection 1969 AFL–NFL Common Draft was held by the AFL's Buffalo Bills, after finishing 1–12–1 in 1968. They took Simpson, but he demanded what was then the largest contract in professional sports history: $650,000 over five years. This led to a standoff with Bills' owner Ralph Wilson, as Simpson threatened to become an actor and skip professional football. Eventually, Wilson agreed to pay Simpson.[26][27]\n\nSimpson entered professional football with high expectations,[26][27] but struggled in his first three years, averaging only 622 yards per season.[28] Bills coach John Rauch, not wanting to build an offense around one running back, assigned Simpson to do blocking and receiving duties at the expense of running the ball. In 1971, Rauch resigned as head coach and the Bills brought in Harvey Johnson.[26][29][30] Despite Johnson devising a new offense for Simpson, Simpson was still ineffective that year. After the 1971 season, the Bills fired Johnson and brought in Lou Saban as head coach.[26] Unlike Rauch, Saban made Simpson the centerpiece of the Bills offense.[31]\n\nSimpson breaks the NFL's single-season rushing record in 1973\n\nIn 1972, Simpson rushed for over 1,000 yards for the first time in his career, gaining a league-leading total of 1,251 yards. In 1973, Simpson became the first player to break the highly coveted 2,000 yard rushing mark, with 2,003 total rushing yards and 12 touchdowns.[28][32] Simpson broke the mark during the last game of the season against the New York Jets with a seven-yard rush. That same game also saw Simpson break Jim Brown's single-season rushing record of 1,863 yards.[33] For his performance, Simpson won that year's NFL MVP Award and Bert Bell Award.[34][35] While other players have broken the 2,000-yard mark since Simpson, his record was established in a time when the NFL had only 14 games per season, as opposed to the 16-game seasons that began in 1978.[36] Simpson still holds the rushing record for 14 games.\n\nSimpson gained more than 1,000 rushing yards for each of his next three seasons. He did not lead the league in rushing in 1974, but did cross the 1,000-yard barrier despite a knee injury.[37] In game 11 of 1974, he passed Ken Willard as the rushing leader among active players, a position he maintained until his retirement more than five seasons later. Simpson also made his first and only playoff appearance during the 1974 season. In a divisional game against the Pittsburgh Steelers, Simpson rushed for 49 yards on 15 attempts and caught a touchdown pass, but the Bills lost the game 32–14.[38] Simpson won the rushing title again in 1975, rushing for 1,817 yards and 16 touchdowns. He also had a career-high 426 receiving yards and seven receiving touchdowns that season.[28]\n\nSimpson once again led the league in rushing in 1976, rushing for 1,503 yards and eight touchdowns.[28] He had the best game of his career during that season's Thanksgiving game against the Detroit Lions on November 25. In that game, Simpson rushed for a then-record 273 yards on 29 attempts and scored two touchdowns. Despite Simpson's performance, the Bills would lose the game 27–14.[39]\n\nA low light that season came during a game against the Patriots a few weeks earlier when defensive end Mel Lunsford and several other Patriots defenders stuffed the superstar running back for no gain but as Simpson tried to continue driving forward Lunsford bodyslammed him to the ground. Simpson got up and punched Lunsford which prompted Lunsford to swing back. Bills offensive lineman Reggie McKenzie then jumped on Lunsford's back but Lunsford bent down and flung McKenzie over his head and went back to swinging at Simpson before a melee of the two teams stopped the fight and ended up in a pile on the field. Lunsford and Simpson were both ejected from the game as the Patriots solid defense persisted with New England going on to win 20–10 on their way to finishing the 1976 season 11–3. The Bills finished 2–12.[40]\n\nSimpson played in only seven games in 1977, as his season was cut short by injury.[9]\n\nSan Francisco 49ers\n\nBefore the 1978 season, the Bills traded Simpson to his hometown San Francisco 49ers for a series of draft picks.[41] Simpson played in San Francisco for two seasons, rushing for 1,053 yards and four touchdowns.[28] His final NFL game was on December 16, 1979, a 31–21 loss to the Atlanta Falcons at Atlanta–Fulton County Stadium.[42] His final play was a 10-yard run on 3rd and 10 for a first down.[43]\n\nCareer summary\n\nSimpson gained 11,236 rushing yards, placing him 2nd on the NFL's all-time rushing list when he retired; he now stands at 21st. He was named NFL Player of the Year in 1973, and played in six Pro Bowls. He was the only player in NFL history to rush for over 2,000 yards in a 14-game season and he is the only player to rush for over 200 yards in six different games in his career. From 1972 to 1976, Simpson averaged 1,540 rushing yards per (14 game) season, 5.1 yards per carry, and he won the NFL rushing title four times.[28] Simpson was inducted into the Pro Football Hall of Fame in 1985, his first year of eligibility.[44] In 2019, he was named to the National Football League 100th Anniversary All-Time Team.[45]\n\nSimpson played in only one playoff game during his 11-season Hall of Fame career: a 1974 Divisional Round game between the Buffalo Bills and the Pittsburgh Steelers. Simpson was held to 49 rushing yards on fifteen carries to go with three receptions for 37 yards and a touchdown as the Bills lost 32–14.[46]\n\nSimpson acquired the nickname \"Juice\" as a play on \"O.J.\", a common abbreviation for orange juice. \"Juice\" is also a colloquial synonym for electricity or electrical power, and hence a metaphor for any powerful entity; the Bills' offensive line at Simpson's peak was nicknamed \"The Electric Company\".[47]\n\nNFL career statistics\n\nLegend AP NFL MVP & OPOTY NFL record Led the league Bold Career high\n\nRegular season\n\nYear Team Games Rushing Receiving Fum GP GS Att Yds Avg Lng TD Y/G A/G Rec Yds Avg Lng TD Y/G R/G 1969 BUF 13 0 181 697 3.9 32 2 53.6 13.9 30 343 11.4 55 3 26.4 2.3 6 1970 BUF 8 8 120 488 4.1 56 5 61.0 15.0 10 139 13.9 36 0 17.4 1.3 6 1971 BUF 14 14 183 742 4.1 46 5 53.0 13.1 21 162 7.7 38 0 11.6 1.5 5 1972 BUF 14 14 292 1,251 4.3 94 6 89.4 20.9 27 198 7.3 25 0 14.1 1.9 8 1973 BUF 14 14 332 2,003 6.0 80 12 143.1 23.7 6 70 11.7 24 0 5.0 0.4 7 1974 BUF 14 14 270 1,125 4.2 41 3 80.4 19.3 15 189 12.6 29 1 13.5 1.1 7 1975 BUF 14 14 329 1,817 5.5 88 16 129.8 23.5 28 426 15.2 64 7 30.4 2.0 7 1976 BUF 14 13 290 1,503 5.2 75 8 107.4 20.7 22 259 11.8 43 1 18.5 1.6 6 1977 BUF 7 7 126 557 4.4 39 0 79.6 18.0 16 138 8.6 18 0 19.7 2.3 2 1978 SF 10 10 161 593 3.7 34 1 59.3 16.1 21 172 8.2 19 2 17.2 2.1 5 1979 SF 13 8 120 460 3.8 22 3 35.4 9.2 7 46 6.6 14 0 3.5 0.5 3 Career 135 116 2,404 11,236 4.7 94 61 83.2 17.8 203 2,142 10.6 64 14 15.9 1.5 62\n\nSource:[28]\n\nNFL records\n\nFastest player to gain 1,000 rushing yards in season: 1,025 in seven games in 1973 and 1,005 in seven games in 1975 (tied with Terrell Davis). [48]\n\nFastest player to gain 2,000 rushing yards in season: 2,003 in 14 games in 1973.\n\nMost rushing yards per game in a season: 143.1 per game in 1973.\n\nActing career\n\nSimpson began acting while at USC and appeared on Dragnet in an uncredited role as a potential recruit to the LAPD.[49] He became a professional actor before playing professional football, appearing in the first episode of Medical Center while negotiating his contract with the Bills.[10] While in the NFL Simpson appeared in productions such as the television miniseries Roots (1977), and the dramatic motion pictures The Klansman (1974), The Towering Inferno (1974), The Cassandra Crossing (1976), and Capricorn One (1978). In 1979, he started his own film production company, Orenthal Productions, which dealt mostly in made-for-TV fare such as the family-oriented Goldie and the Boxer films with Melissa Michaelsen (1979 and 1981), and Cocaine and Blue Eyes (1983), a television movie broadcast by NBC.[citation needed]\n\nSimpson said that he did not seriously consider an acting career until seeing Lee Marvin and Richard Burton, while filming The Klansman in Oroville, California, ordering chili from Chasen's via private jet.[10] He said in 1980 that \"The Oscar or the Emmy says you've reached a level of competence in this business, and I would love to have one\".[49] Simpson avoided starring in blaxploitation films, choosing third or fourth lead roles while studying experienced stars like Marvin and Burton.[12] The Hertz commercials from 1975 benefited Simpson's acting career but he sometimes intentionally chose non-positive roles; \"I've got to tear down that picture of O.J. Simpson, the clean-cut athlete, to get believability into whatever part I happen to be playing\".[50] Simpson also starred in the comedic Back to the Beach (1987) and The Naked Gun trilogy (1988, 1991, 1994). According to Arnold Schwarzenegger, Simpson was considered by director James Cameron to play the eponymous character in The Terminator (1984) when Schwarzenegger was cast as Kyle Reese, but Cameron ultimately cast Schwarzenegger as the Terminator while Simpson had no involvement in the film.\n\nBesides his acting career, Simpson worked as a commentator for Monday Night Football and The NFL on NBC.[51] He also appeared in the audience of Saturday Night Live during its second season and hosted an episode during its third season.[52]\n\nFrogmen\n\nSimpson starred in the un-televised two-hour-long film pilot for Frogmen, an A-Team-like adventure series that Warner Bros. Television completed in 1994, a few months before the murders. NBC had not yet decided whether to order the series when Simpson's arrest cancelled the project. While searching his home, the police obtained a videotaped copy of the pilot as well as the script and dailies. Although the prosecution investigated reports that Simpson, who played the leader of a group of former United States Navy SEALs, received \"a fair amount of\" military training—including use of a knife—for Frogmen, and there is a scene in which he holds a knife to the throat of a woman, this material was not introduced as evidence during the trial.[53]\n\nNBC executive Warren Littlefield said in July 1994 that the network would probably never air the pilot if Simpson were convicted; if he were acquitted, however, one television journalist speculated that \"Frogmen would probably be on the air before the NBC peacock could unfurl its plume\".[54] Most pilots that are two hours long are aired as TV movies whether or not they are ordered as series. Because—as the Los Angeles Times later reported—\"the appetite for all things O.J. appeared insatiable\" during the trial, Warner Bros. and NBC estimated that a gigantic, Super Bowl–like television audience would have watched the Frogmen film. Co-star Evan Handler said the studio's decision not to air it or release it on home video, and forego an estimated $14 million in profits, was \"just about the only proof you have that there is some dignity in the advertising and television business\".[53]\n\nJuiced\n\nIn 2006, Simpson starred in his own improv-based hidden-camera prank TV show Juiced. Typical of the genre, Simpson would play a prank on everyday people while secretly filming them and at the end of each prank, he would shout, \"You've been Juiced!\" Less typical, each episode opened with topless strippers dancing around Simpson, who is dressed as a pimp. He sings his own rap song, which includes the lyrics \"Don't you know there's no stopping the Juice / When I'm on the floor I'm like a lion on the loose / Better shoot me with a tranquilizer dart / Don't be stupid, I'm not a Simpson named Bart.\" In one episode, Simpson is at a used car lot in Las Vegas where he attempts to sell his white Bronco. A bullet hole in the front of the SUV is circled with his autograph, and he pitches it to a prospective buyer by saying that if they \"ever get into some trouble and have to get away, it has escapability.\"[55] In another sketch called \"B-I-N-G-O.J.\", Simpson pretends to be having an affair with another man's girlfriend. Later he transforms into an old white man whose dying wish is to call a game of bingo. Juiced aired as a one-time special on pay-per-view television and was later released on DVD.[56]\n\nFilmography\n\nEndorsements\n\nGo, O.J., Go! Hertz slogan[62]\n\nAs a child, Simpson earned money by scalping tickets and collecting seat cushions at Kezar Stadium. In high school, he organized dances, hiring a band and ballroom and charging admission.[12] Chuck Barnes helped Simpson form business relationships with Chevrolet and ABC early in his football career. By 1971, New York wrote that Simpson was already wealthy enough to \"retire this week if [he] wanted to\".[63]\n\nIn 1975, People magazine described Simpson as \"the first black athlete to become a bona fide lovable media superstar\".[15] He used his amiable persona,[64] good looks, and charisma in many endorsement deals. Beginning in 1975, he appeared in advertisements with the Hertz rental car company. Commercials depicted Simpson running through airports embodying speed, as others shouted to him the Hertz slogan \"Go, O.J., Go!\".[62]\n\nBesides helping his acting career, Simpson estimated that the very successful \"superstar in rent-a-car\" campaign raised the recognition rate among people he met from 30% to 90%.[12] Hertz's annual profit increased by 50% to $42.2 million within the first year, brand awareness increased by more than 40%,[50] and 97% of viewers understood that the commercials advertised Hertz, avoiding the common \"vampire video\" problem.[12] Simpson was so important to the company that CEO Frank Olson personally negotiated his contract, and Hertz used him for an unusually long time for a celebrity endorser.[62] Advertising Age in 1977 named Simpson the magazine's Star Presenter of the Year;[50] by 1984, consumer research found that he was the most popular athlete endorser, and a 1990s MCI Communications commercial starring Eunice Simpson satirized her son's work. Although Simpson appeared less often in Hertz commercials by the late 1980s, his relationship with the company continued; Simpson was to travel to Chicago to meet with Hertz executives and clients on the night of the Brown-Goldman murder.[62]\n\nOther products Simpson endorsed included Pioneer Chicken, Honey Baked Ham, Calistoga Water Company's line of Napa Naturals soft drinks, and Dingo cowboy boots. As president and CEO of O. J. Simpson Enterprises, he owned hotels and restaurants. When Simpson and Brown divorced in 1992, he had $10 million in assets and more than $1 million in annual income, including $550,000 from Hertz.[62] During the June 1994 police chase, spectators shouted the \"Go, O.J., Go!\" slogan at Simpson as he rode in a white Bronco[65] owned by Hertz.[50]\n\nFamily life\n\nSimpson with his daughter, Sydney Brooke, in 1986\n\nOn June 24, 1967, at age 19, Simpson married Marguerite L. Whitley. Together, they had three children: Arnelle L. Simpson (b. 1968), Jason Lamar Simpson[66] (b. 1970), and Aaren Lashone Simpson (1977–1979). In August 1979, Aaren drowned in the family's swimming pool.[67][68]\n\nSimpson met Nicole Brown in 1977 while she was working as a waitress at a nightclub called The Daisy.[69][70] Although still married to his first wife, Simpson began dating Brown. Simpson and Marguerite divorced in March 1979.[71][72]: 126–28\n\nBrown and Simpson were married on February 2, 1985, five years after his retirement from professional football.[73] The couple had two children, Sydney Brooke Simpson (b. 1985) and Justin Ryan Simpson (b. 1988).[74] The marriage lasted seven years, during which Simpson pleaded no contest to spousal abuse in 1989.[75] Brown filed for divorce on February 25, 1992, citing irreconcilable differences.[72]: 136 In 1993, after the divorce, Brown and Simpson made an attempt at reconciliation, but according to Sheila Weller \"they were a dramatic, fractious, mutually obsessed couple before they married, after they married, after they divorced in 1992, and after they reconciled.\"[76]\n\nLegal history\n\nNicole Brown Simpson and Ron Goldman murders and trials\n\nCriminal trial for murder\n\nSimpson's mugshot, June 17, 1994\n\nOn June 12, 1994, Nicole Brown Simpson and Ron Goldman were found stabbed to death outside Nicole's condo in the Brentwood area of Los Angeles. Simpson was a person of interest in their murders. Simpson did not turn himself in, and on June 17 he became the object of a low-speed pursuit by police while riding as a passenger in the white 1993 Ford Bronco SUV owned and driven by his longtime friend Al Cowlings.[77] TV stations interrupted coverage of the 1994 NBA Finals to broadcast the incident live. With an estimated audience of 95 million people, the event was described as \"the most famous ride on American shores since Paul Revere's\".[78]\n\nThe pursuit, arrest, and trial of Simpson were among the most widely publicized events in American history. O. J. Simpson's integrated defense counsel team included Johnnie Cochran, Robert Kardashian, Robert Shapiro, and F. Lee Bailey. Marcia Clark was the lead prosecutor for the State of California.[79][80] The trial, often characterized as the Trial of the Century because of its international publicity, likened to that of Sacco and Vanzetti and the Lindbergh kidnapping, culminated after 11 months on October 3, 1995, when the jury rendered a verdict of \"not guilty\" for the two murders. An estimated 100 million people nationwide tuned in to watch or listen to the verdict announcement.[81] Following Simpson's acquittal, no additional arrests or convictions related to the murders were made.\n\nImmediate reaction to the verdict was known for its division along racial lines: a poll of Los Angeles County residents showed that most African Americans there felt justice had been served by the \"not guilty\" verdict, while the majority of whites and Latinos opined that it had not.[82] According to a 2016 poll, 83% of white Americans and 57% of black Americans believe Simpson committed the murders.[83]\n\nWrongful death civil trial\n\nFollowing Simpson's acquittal of criminal charges, Ron Goldman's family filed a civil lawsuit against Simpson. Daniel Petrocelli represented plaintiff Fred Goldman (Ronald Goldman's father), while Robert Baker represented Simpson.[84] Superior Court Judge Hiroshi Fujisaki presided,[84] and he barred television and still cameras, radio equipment, and courtroom sketch artists from the courtroom.[85] On October 23, 1996, opening statements were made, and on January 16, 1997, both sides rested their cases.[86]\n\nOn February 5, 1997, a civil jury in Santa Monica, California, unanimously found Simpson liable for the wrongful death of and battery against Goldman, and battery against Brown. Simpson was ordered to pay $33,500,000 in damages. In February 1999, an auction of Simpson's Heisman Trophy and other belongings netted almost $500,000, which went to the Goldman family.[87]\n\nThe Goldman family also tried to collect Simpson's NFL $28,000 monthly pension,[88] but failed to collect any money.[89]\n\nIn 1997, Simpson defaulted on his mortgage at the home in which he had lived for 20 years, at 360 North Rockingham Avenue, and the lender foreclosed the property. In July 1998, the house was demolished by its next owner, Kenneth Abdalla, an investment banker and president of the Jerry's Famous Deli chain.[90]\n\nOn September 5, 2006, Goldman's father took Simpson back to court to obtain control over Simpson's \"right to publicity\", for purposes of satisfying the judgment in the civil court case.[91] On January 4, 2007, a federal judge issued a restraining order prohibiting Simpson from spending any advance he may have received on a canceled book deal and TV interview about the 1994 murders. The matter was dismissed before trial for lack of jurisdiction.[91] On January 19, 2007, a California state judge issued an additional restraining order, ordering Simpson to restrict his spending to \"ordinary and necessary living expenses\".[91]\n\nOn March 13, 2007, a judge prevented Simpson from receiving any further compensation from the defunct book deal and TV interview, and the judge ordered the bundled book rights to be auctioned.[92] In August 2007, a Florida bankruptcy court awarded the rights to the book to the Goldman family, to partially satisfy an unpaid civil judgment. Originally titled If I Did It, the book was renamed If I Did It: Confessions of the Killer, with the word \"If\" reduced in size to such an extent that it appears within the width of the large red \"I\" in the title, making the title appear to read I Did It: Confessions of the Killer. Additional material was added by members of the Goldman family, investigative journalist Dominick Dunne, and author Pablo Fenjves.[93]\n\nIn June of 2022, Ron Goldman's father, Fred, alleged in court papers intended to keep the wrongful death of and battery judgment viable that Simpson owed $96 million due to significant interest generated on the initial order to pay damages.[94]\n\nOther legal troubles\n\nIn 2007, the state of California claimed that Simpson owed $1.44 million in back taxes.[95] A tax lien was filed in his case on September 1, 1999.[96]\n\nIn the late 1990s, Simpson attempted to register \"O. J. Simpson\", \"O. J.\", and \"The Juice\" as trademarks for \"a broad range of goods, including figurines, trading cards, sportswear, medallions, coins, and prepaid telephone cards\".[97] A \"concerned citizen\", William B. Ritchie, sued to oppose the granting of federal registration on the grounds that doing so would be immoral and scandalous. Simpson gave up the effort in 2000 and left California that year for Florida, settling in Miami. Florida is one of few states where pensions and/or residences cannot generally be seized to collect debts.\n\nIn February 2001, Simpson was arrested in Miami-Dade County, Florida, for simple battery and burglary of an occupied conveyance, for yanking the glasses off another motorist during a traffic dispute three months earlier. If convicted, Simpson could have faced up to 16 years in prison, but he was tried and quickly acquitted of both charges in October 2001.[98]\n\nOn December 4, 2001, Simpson's Miami home was searched by the FBI on suspicion of ecstasy possession and money laundering. The FBI had received a tip that Simpson was involved in a major drug trafficking ring after 10 other suspects were arrested in the case. Simpson's home was thoroughly searched for two hours, but no illegal drugs were discovered, and no arrest or formal charges were filed following the search. However, investigators uncovered equipment capable of stealing satellite television programming, which eventually led to Simpson being sued in federal court.[99]\n\nOn July 4, 2002, Simpson was arrested in Miami-Dade County, Florida, for water speeding through a manatee protection zone and failing to comply with proper boating regulations.[100] The misdemeanor boating regulation charge was dropped, and Simpson was fined for the speeding infraction.[101]\n\nIn March 2004, satellite television network DirecTV, Inc. accused Simpson in a Miami federal court of using illegal electronic devices to pirate its broadcast signals. The company later won a $25,000 judgment, and Simpson was ordered to pay an additional $33,678 in attorney's fees and costs.[102]\n\nLas Vegas robbery\n\nOn the night of September 13, 2007, a group of men led by Simpson entered a room at the Palace Station hotel-casino and took sports memorabilia at gunpoint, which resulted in Simpson being questioned by police.[103][104] Simpson admitted to taking the items, which he said had been stolen from him, but denied breaking into the hotel room; he also denied that he or anyone else carried a gun.[105][106] He was released after questioning.\n\nTwo days later, Simpson was arrested[1] and initially held without bail.[107] Along with three other men, Simpson was charged with multiple felony counts, including criminal conspiracy, kidnapping, assault, robbery, and using a deadly weapon.[108][109] Bail was set at $125,000, with stipulations that Simpson have no contact with the co-defendants and that he surrender his passport. Simpson did not enter a plea.[110][111]\n\nBy the end of October 2007, all three of Simpson's co-defendants had plea-bargained with the prosecution in the Clark County, Nevada, court case. Walter Alexander and Charles H. Cashmore accepted plea agreements in exchange for reduced charges and their testimony against Simpson and three other co-defendants, including testimony that guns were used in the robbery.[112] Co-defendant Michael McClinton told a Las Vegas judge that he too would plead guilty to reduced charges and testify against Simpson that guns were used in the robbery. After the hearings, the judge ordered that Simpson be tried for the robbery.\n\nOn November 8, 2007, Simpson had a preliminary hearing to decide whether he would be tried for the charges. He was held over for trial on all 12 counts. Simpson pleaded not guilty on November 29, with an initial setting for trial on April 7, 2008, although it was soon set for September 8 to give the defense more time for their case.[113][114]\n\nIn January 2008, Simpson was taken into custody in Florida and was extradited to Las Vegas, where he was incarcerated at the Clark County jail for violating the terms of his bail by attempting to contact Clarence \"C. J.\" Stewart, a co-defendant in the trial. District Attorney David Roger of Clark County provided District Court Judge Jackie Glass with evidence that Simpson had violated his bail terms. A hearing took place on January 16, 2008. Glass raised Simpson's bail to US$250,000 and ordered that he remain in county jail until 15 percent was paid in cash.[115] Simpson posted bond that evening and returned to Miami the next day.[116]\n\nSimpson and his co-defendant were found guilty of all charges on October 3, 2008.[117] On October 10, 2008, Simpson's counsel moved for a new trial (trial de novo) on grounds of judicial errors and insufficient evidence.[118] Simpson's attorney announced he would appeal to the Nevada Supreme Court if Judge Glass denied the motion.[118] The attorney for Simpson's co-defendant, C. J. Stewart, petitioned for a new trial, alleging Stewart should have been tried separately and cited possible misconduct by the jury foreman.[118][119][120]\n\nSimpson faced a possible life sentence with parole on the kidnapping charge, and mandatory prison time for armed robbery.[121] On December 5, 2008, Simpson was sentenced to a total of 33 years in prison,[122] with the possibility of parole after nine years, in 2017.[2] On September 4, 2009, the Nevada Supreme Court denied a request for bail during Simpson's appeal. In October 2010, the Nevada Supreme Court affirmed his convictions.[123] He served his sentence at the Lovelock Correctional Center where his inmate ID number was #1027820.[124]\n\nA Nevada judge agreed on October 19, 2012, to \"reopen the armed robbery and kidnapping case against O. J. Simpson to determine if the former football star was so badly represented by his lawyers that he should be freed from prison and get another trial\".[125] A hearing was held beginning May 13, 2013, to determine if Simpson was entitled to a new trial.[126] On November 27, 2013, Judge Linda Bell denied Simpson's bid for a new trial on the robbery conviction. In her ruling, Bell wrote that all Simpson's contentions lacked merit.[127]\n\nRelease from prison\n\nOn July 31, 2013, the Nevada Parole Board granted Simpson parole on some convictions, but his imprisonment continued based on the weapons and assault convictions. The board considered Simpson's prior record of criminal convictions and good behavior in prison in coming to the decision.[128] At his parole hearing on July 20, 2017, the board decided to grant Simpson parole, with certain parole conditions such as travel restrictions, non-contact with co-defendants from the robbery, and not drinking excessively. He was released on October 1, 2017, having served almost nine years.[129][130] On December 14, 2021, Simpson was released from parole early for good behavior, releasing him from the previous conditions of his release and effectively making him a completely free man.[131]\n\nIn popular culture\n\nBooks\n\nPablo Fenjves ghostwrote the 2007 book If I Did It based on interviews with Simpson. The book was published by Beaufort Books, a New York City publishing house owned by parent company Kampmann & Company/Midpoint Trade Books.[132] All rights and proceeds from the book were awarded to the family of murder victim Ron Goldman.[133]\n\nFilms\n\nTelevision\n\nExhibits\n\nThe Bronco from Simpson's police chase is on display in Pigeon Forge, Tennessee's Alcatraz East Crime Museum. [145] [146]\n\nIn 2017, Adam Papagan curated a pop-up museum featuring artifacts and ephemera from the trial at Coagula Curatorial gallery in Los Angeles.[147][148]\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/commons/c/c8/O.J._Simpson_1990_%C2%B7_DN-ST-91-03444_crop.JPEG", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Mug_shot_of_O.J._Simpson.jpg/170px-Mug_shot_of_O.J._Simpson.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/O.J._Simpson_1990_%C2%B7_DN-ST-91-03444_crop.JPEG/220px-O.J._Simpson_1990_%C2%B7_DN-ST-91-03444_crop.JPEG", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/O.J._Simpson_%281986%292.JPG/170px-O.J._Simpson_%281986%292.JPG", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/1986_Jeno%27s_Pizza_-_29_-_O.J._Simpson_%28O.J._Simpson_crop%29.jpg/200px-1986_Jeno%27s_Pizza_-_29_-_O.J._Simpson_%28O.J._Simpson_crop%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/8/8f/OJ_1964.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Oj_simpson_topps_1970.jpg/170px-Oj_simpson_topps_1970.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/c/c8/O.J._Simpson_1990_%C2%B7_DN-ST-91-03444_crop.JPEG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/O._J._Simpson", "title": "O. J. Simpson", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/c/c8/O.J._Simpson_1990_%C2%B7_DN-ST-91-03444_crop.JPEG", "width": 640, "height": 865}, "title": "O. J. Simpson - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}