{"url": "https://www.independent.co.uk/life-style/fashion/met-gala-best-worst-outfits-red-carpet-a8340586.html", "text": "Stay ahead of the trend in fashion and beyond with our free weekly Lifestyle Edit newsletter Stay ahead of the trend in fashion and beyond with our free weekly Lifestyle Edit newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nLifestyle Edit email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nThe annual Met Gala is one of the biggest fashion events of the year, and this year’s outfits did not disappoint.\n\nIncorporating the theme Heavenly Bodies: Fashion and the Catholic Imagination, the event's most controversial theme to date, the A-list used this year’s red carpet to show off their most sacred looks.\n\nWith crowns, crosses, and wings, the 2018 Met Gala red carpet was full of over-the-top ensembles that combined high-fashion and religion.\n\nThese are the best and worst-dressed from the 2018 Met Gala.\n\nThe best:\n\nFor many of the A-listers, a spot on the best-dressed list required some commitment to the theme. These included Jennifer Lopez, who sparkled in Balmain and flirted with boyfriend Alex Rodriguez, Rihanna, who took papal-chic to a whole new level, and Katy Perry, whose extravagant angel wings only added to the appeal of her ensemble.\n\nRihanna stunned in her Pope-inspired ensemble (Getty)\n\nSZA stood out in a pale-pink gown with a gold bodice, and a heavenly-inspired gold halo, as did Kim Kardashian West in a Versace gold-sequined gown adorned with crosses and Gigi Hadid in Versace.\n\nAlso on the best-dressed list were Ariana Grande in Vera Wang, Amber Heard, who turned heads in a stunning red gown, and Priyanka Chopra in a Ralph Lauren red velvet dress and gold chain-mail headdress.\n\nPriyanka Chopra on the red carpet (Getty)\n\nBut, as with any red carpet, there are some ensembles that just don't come together.\n\nMet Gala 2018: Heavenly Bodies Show all 50 1 /50 Met Gala 2018: Heavenly Bodies Met Gala 2018: Heavenly Bodies Rihanna went all in on the Catholicism theme wearing custom Maison Margiela AFP/Getty Met Gala 2018: Heavenly Bodies Madonna poses alongside Jean Paul Gaultier, the designer of her gothic Met Gala gown AFP/Getty Images Met Gala 2018: Heavenly Bodies Supermodel Bella Hadid wears a glossy latex corset by Chrome Hearts Official x Gareth Pugh, topped with a sculptural cape Getty Met Gala 2018: Heavenly Bodies Katy Perry incorporated the theme with oversized wings, a Versace chainmail dress and thigh high boots Getty Met Gala 2018: Heavenly Bodies Black Panther's Chadwick Bosemanan wears an all-white Versace outfit with religiously inspired embellishments, gold shoes, and a cape Getty Images Met Gala 2018: Heavenly Bodies Priyanka Chopra wears Ralph Lauren Getty Met Gala 2018: Heavenly Bodies Solange Knowles opted for a structural black Iris van Herpen dress and a halo headpiece with a black du-rag Met Gala 2018: Heavenly Bodies Lily Collins wears a black Givenchy gown and coordinating gothic makeup Getty Met Gala 2018: Heavenly Bodies Kate Bosworth wears an ethereal Oscar de la Renta gown topped with a mantilla veil Getty Met Gala 2018: Heavenly Bodies Vogue editor Anna Wintour wears a custom Chanel gown featuring a halter neck and intricate beading Getty Met Gala 2018: Heavenly Bodies Frances McDormand wearing a Versace gown and Philip Treacy headpiece, Pierpaolo Piccioli, and Anne Hathaway sporting a Valentino Couture red ballgown AFP/Getty Met Gala 2018: Heavenly Bodies Ariana Grande poses alongside Vera Wang, the designer of the singer's debut Met Gala gown Rex Features Met Gala 2018: Heavenly Bodies Nicki Minaj wears a red Oscar de la Renta gown and bejeweled headpiece PA Met Gala 2018: Heavenly Bodies Blake Lively wears Versace to the Met Gala PA Met Gala 2018: Heavenly Bodies Sarah Jessica Parker and Andy Cohen wear Dolce & Gabbana Getty Met Gala 2018: Heavenly Bodies Kim Kardashian stunned in a liquid gold Versace dress with cross embroidery Reuters Met Gala 2018: Heavenly Bodies Jennifer Lopez wears a bejewelled Balmain gown with cross detailing while Alex Rodriguez opted for a polished black suit PA Met Gala 2018: Heavenly Bodies Tracee Ellis Ross wears a bright pink gown with a matching jacket by Michael Kors Rex Features Met Gala 2018: Heavenly Bodies Amal Clooney wears a Richard Quinn corset dress and navy trousers while husband George Clooney opted for a traditional black tuxedo REUTERS Met Gala 2018: Heavenly Bodies Lana Del Rey wears an elaborate Gucci gown and bird halo headpiece REUTERS Met Gala 2018: Heavenly Bodies Sean 'Diddy' Combs wears a Musika Frere suit while Cassie opted for Thom Browne with Chopard earrings Getty Met Gala 2018: Heavenly Bodies Miley Cyrus wears plunging black dress by Stella McCartney and Sydney Evan custom hoops with a large cross Getty Met Gala 2018: Heavenly Bodies Cynthia Erivo opted for a Valentino gown, Sophia Webster shoes and bejewelled brows Getty Met Gala 2018: Heavenly Bodies Power couple Helen Lasichanh and Pharrell Williams both dressed in Chanel for the annual gala PA Met Gala 2018: Heavenly Bodies Winnie Harlow wears an all-white Tommy Hilfiger dress with a dramatic train PA Met Gala 2018: Heavenly Bodies Donatella Versace, who was co-host for the event, opted for an ornate navy and gold dress of her own design AFP/Getty Met Gala 2018: Heavenly Bodies Elon Musk wears a white tuxedo and Tesla pin, while Grimes opted for a black dress and Tesla choker AFP/Getty Met Gala 2018: Heavenly Bodies Lily Aldridge and Rosie Huntington-Whiteley walked the red carpet together, both wearing Ralph Lauren Collection gowns AFP/Getty Images Met Gala 2018: Heavenly Bodies Atlanta-based trio, Migos, wear sequinned Versace suits EPA Met Gala 2018: Heavenly Bodies Contributing Editor of Vogue Thailand, Nichapat Suphap, wears custom Peter Dundas AFP/Getty Met Gala 2018: Heavenly Bodies Anya Taylor-Joy wears a gold tapestry Dolce & Gabbana dress PA Met Gala 2018: Heavenly Bodies Janelle Monae wears a monochrome Marc Jacobs gown with a crystallised head wrap and Stephen Jones hat PA Met Gala 2018: Heavenly Bodies Rapper Cardi B opted for a custom Moschino gown alongside designer Jeremy Scott REUTERS Met Gala 2018: Heavenly Bodies Eiza Gonzalez wears a black Prabal Gurung gown with a white cape AFP/Getty Met Gala 2018: Heavenly Bodies Cara Delevingne wears a dramatic all-black Dior Haute Couture dress and beaded veil REUTERS Met Gala 2018: Heavenly Bodies Lewis Hamilton wears an all-white ensemble designed by Tommy Hilfiger AFP/Getty Images Met Gala 2018: Heavenly Bodies Rita Ora wears an all-black embellished ensemble by Prada EPA Met Gala 2018: Heavenly Bodies Amanda Seyfried wears a romantic Renaissance-style gown by Prada AFP/Getty Met Gala 2018: Heavenly Bodies Amber Heard paired a Carolina Herrera scarlet gown with a gold halo headpiece REUTERS Met Gala 2018: Heavenly Bodies Lena Waithe made a powerful pride statement with a sparkly rainbow cape worn over a sleek black suit PA Met Gala 2018: Heavenly Bodies Kylie Jenner wears a black Alexander Wang gown with semi-sheer heels and micro sunglasses PA Met Gala 2018: Heavenly Bodies 2 Chainz (kneeling) proposed to Kesha Ward on the red carpet, both wearing custom Versace AP Met Gala 2018: Heavenly Bodies Doutzen Kroes wears a colourful Sies Marjan dress AFP/Getty Met Gala 2018: Heavenly Bodies Supermodel Gigi Hadid wears a Versace gown with stain glass window-inspired detail PA Met Gala 2018: Heavenly Bodies SZA wears a frothy Atelier Versace gown and a headpiece by Chrishabana AFP/Getty Met Gala 2018: Heavenly Bodies Diane Kruger accessorised her Prabal Gurung gown with a custom Philip Treacy head piece REUTERS Met Gala 2018: Heavenly Bodies Andrew Garfield wears a velvety pink tuxedo jacket by Tom Ford PA Met Gala 2018: Heavenly Bodies Paris Jackson and Miley Cyrus both opted for gowns by designer Stella McCartney PA Met Gala 2018: Heavenly Bodies Vanity Fair’s contributing editor, Amy Fine Collins, wears a custom design by Alice + Olivia’s Stacey Bendet Eisner AFP/Getty Met Gala 2018: Heavenly Bodies Emilia Clarke wearing a Dolce & Gabbana gown Getty\n\nAt the Met Gala, the fashion stakes are especially high - and this year, some celebrities fell flat.\n\nThe worst:\n\nThis year's worst-dressed were mostly those who didn't incorporate the heavenly theme into their outfits - or did so to disastrous outcomes.\n\nKylie Jenner left viewers unimpressed with her secular ensemble, opting for a simple black gown and sunglasses indoors. Sister Kendall Jenner made the list as well.\n\nSarah Jessica Parker's Dolce & Gabbana ensemble captured attention, but not necessarily for the right reasons. Featuring an over-the-top gold headpiece and equally busy dress, the usually-fashionable actress's outfit was a lot to take in.\n\nSarah Jessica Parker on the red carpet (Getty)\n\nScarlett Johansson looked beautiful, but her outfit was forgettable, as it had nothing to do with the theme. The same was true for Miley Cyrus, whose daring low-cut satin gown would have been better suited for a different red carpet.\n\nAnd Amal Clooney's outfit of flowers paired with pants by Richard Quin was gorgeous - but the co-host of the event didn't bring the dazzle that one expects from outfits at the Met Gala.\n\nOverall, this year's Met Gala, filled with extravagant headpieces and lots of gold, was one to remember.\n\nAs exhibition curator Andrew Bolton said of the theme: \"Dress is central to any discussion about religion.\"", "images": ["https://www.independent.co.uk/img/pixels-player-logo.svg", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/08/04/gettyimages-955798338.jpg?quality=75&width=1200&auto=webp", "https://www.independent.co.uk/img/logo-white-out.svg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/08/04/gettyimages-955798338.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Chelsea Ritschel", "Sarah Young"], "canonical_link": "https://www.independent.co.uk/life-style/fashion/met-gala-best-worst-outfits-red-carpet-a8340586.html", "title": "Met Gala 2018: Best-dressed guests on the red carpet, from Rihanna to Katy Perry", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "Some celebrities stunned while others blended into the background", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "Fashion", "sitename": "The Independent", "page path": "/life-style/fashion", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2018-05-08T11:30:16.000Z", "site_name": "The Independent", "title": "The best and worst dressed on the Met Gala red carpet", "url": "https://www.independent.co.uk/life-style/fashion/met-gala-best-worst-outfits-red-carpet-a8340586.html", "type": "article", "description": "Some celebrities stunned while others blended into the background", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/08/04/gettyimages-955798338.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/08/04/gettyimages-955798338.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2018-05-08T11:30:16.000Z", "modified_time": "2018-05-08T11:30:16.000Z", "section": "Lifestyle", "subsection": "Fashion", "author_name": "Chelsea Ritschel, Sarah Young", "content_type": "story", "word_count": 502, "image_count": 4, "embed_count": 2, "video_count": 1, "internal_link_count": 0, "external_link_count": 0}, "date": "2018-05-08T11:30:16.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "The best and worst dressed on the Met Gala red carpet", "site": "@Independent", "card": "summary_large_image", "description": "Some celebrities stunned while others blended into the background", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/08/04/gettyimages-955798338.jpg?quality=75&width=1200&auto=webp"}, "keywords": "Met Gala,worst dressed,Red carpet,best-dressed,Internal"}, "movies": [], "publish_date": 1525779016.0, "source": "https://www.independent.co.uk", "summary": ""}