{"url": "https://en.wikipedia.org/wiki/List_of_Southern_Charm_episodes", "text": "No.\n\noverall No. in\n\nseason Title Original air date US viewers\n\n(millions)\n\n37 1 \"While the Kat's Away\" April 3, 2017 ( ) 1.25[49]\n\nSummer is over and the hot mess express has rolled back into town. Thomas has full custody of his two children and has risen to the challenge of being a single dad, by mostly giving up his former playboy lifestyle. Shep, however continues to be Charleston's perennial bachelor and now, thanks to Craig's lying ways, has a new wingman, Austen. Not only does Austen look like a younger version of Shep, he's also giving him a run for his money with the ladies. Cameran, meanwhile, is still determined to see Shep settle down and is convinced she knows just the girl who can reel him in. On the other side of town Landon, who after fleeing the rumors unleashed by Kathryn's accusations, is back in Charleston with a new boyfriend and determined to turn her travel website, into a success. Meanwhile, after a stint in rehab over the summer Kathryn has returned, and according to Thomas, refusing to take a drug test. Or is she?\n\n38 2 \"Roamin' Holiday\" April 10, 2017 ( ) 1.18[50]\n\nAs Cameran gets a sneak peek at motherhood, Kathryn's trip to Malibu proved to be more than just sun bathing and surfing. Meanwhile, Shep confronts Craig once again about the true nature of his legal career, but leaves their friendship on the field. And as Landon prepares to launch her website, a new romance begins to percolate as Thomas realizes he needs a step-mother for his children.\n\n39 3 \"Step and Release\" April 17, 2017 ( ) 1.16[51]\n\nCraig attempts to \"adult\" by helping Naomie throw a fundraiser, but the differences in their planning styles threatens to expose the cracks in their relationship. Meanwhile, Kathryn takes steps to become more responsible, just as Thomas decides it's time to rekindle his friendship with Landon. Later, it seems that Cameran's matchmaking skills are finally paying off after Shep and Chelsea share a romantic evening together. But when Shep leaves town without making his intentions known, Austen swoops in to take his place.\n\n40 4 \"ShepWrecked\" April 24, 2017 ( ) 1.25[52]\n\nKathryn struggles with supervised visitation with her children as Craig judges Thomas' parenting style. However, while Craig meddles in the affairs of his friends, his life with Naomie is slowly starting to fall apart. Meanwhile, at Shep's 37th birthday party Whitney confronts Landon about her true feelings for Thomas, while Cameran tries to convince Shep it's not too late to win Chelsea back before she sails off into the sunset with Austen.\n\n41 5 \"Craig of All Trades, Master of None\" May 1, 2017 ( ) 1.11[53]\n\nCameran turns to the supernatural in hopes of finding her life's purpose, while Thomas takes a leap of faith by asking Landon out on a date. Shep confronts Austen about his bro-code violation over a game of basketball and faces a health scare in the process. Naomie reaches her boiling point when she learns of Craig's latest endeavor, and tensions rise when she questions his plans for the future.\n\n42 6 \"To Liver or Die in Charleston\" May 8, 2017 ( ) 1.29[54]\n\nAfter going to the doctor, Shep receives some shocking news about his health causing him to take a step back from his party boy ways. Meanwhile, love is in the air as Austen and Chelsea deepen their romantic bond, and Thomas and Landon's connection is tested over a casual dinner at Patricia's house. And when Jennifer hosts a Sip and See to celebrate her new baby, Craig finally seals the deal on an investment property while his relationship with Naomie continues to unravel.\n\n43 7 \"Fowl Play\" May 15, 2017 ( ) 1.16[55]\n\nAs Kathryn contemplates a reunion with the father of her children, Patricia continues to push Landon and Thomas closer together. Craig and Naomie attempt to reconcile after their latest blow up, and Shep plans a hunting getaway for the group. Meanwhile, Cameran, ever hopeful that Shep and Chelsea will find true love, has to admit defeat when Chelsea falls for Austen's hunting prowess. And as the two love birds head off to their love shack, Shep's pursuit of health and happiness seems to come to an end.\n\n44 8 \"Sari, Not Sari\" May 22, 2017 ( ) 1.11[56]\n\nCraig and Naomie visit a therapist to help save their increasingly rocky relationship while Austen and Chelsea continue to grow closer. But after, Shep runs into Austen and Landon at a bar, he's convinced there's more going on between them than meets the eye. Meanwhile, Kathryn writes Thomas a letter in the hopes that they can finally move forward and co-parent. Patricia hosts an Indian themed dinner in honor of her new caftan line, and invites an Indian healer who reveals the gangs' future. But it's Whitney's revelation that Kathryn has also reached out to him that shocks the group the most.\n\n45 9 \"Guess Who's Coming to Lunch\" May 29, 2017 ( ) 1.26[57]\n\nAfter the chaos of Patricia's dinner, it seems some fortunes are coming true. Cameran agrees to see if Kathryn has really changed her ways, and brings along a surprise guest. Meanwhile, Austen and Craig discuss the possibility that Shep may still have his heart set on Chelsea. Landon prepares to squash a potential relationship, but it seems she can't escape her fate.\n\n46 10 \"The Hangover\" June 5, 2017 ( ) 1.33[58]\n\nAs Thomas and Kathryn break their year-long standoff to celebrate their son's first birthday together, Patricia continues her quest to make Landon Saint and Kensie's new step-mother. Cameran begins to rethink motherhood and Craig proves he's finally all grown up when he gets the keys to his new house. Meanwhile, after Shep decides that he needs to get out of downtown Cameran offers to show him a house and quickly discovers that he may be in need of more than just a new address.\n\n47 11 \"Boys Gone Wild\" June 12, 2017 ( ) 1.26[59]\n\nAfter Thomas agrees to let Kathryn do a photo shoot with Kensie, the reality of their situation becomes impossible to ignore. Meanwhile, Craig and Naomie question whether they should even continue to be a couple. When Chelsea tells Austen of a late night encounter with Shep, friendships are pushed to the brink.\n\n48 12 \"A Tribe Called key West\" June 19, 2017 ( ) 1.43[60]\n\nTensions are high as the group heads further down south for Cam's birthday trip to Key West. Austen questions Chelsea's commitment to their relationship after she changes her story about the incident with Shep, and Craig finds himself on thin ice with Naomie. Meanwhile, Kathryn reveals shocking new information about Thomas and Landon's relationship. And when she confronts Landon face to face at a group dinner chaos ensues after Craig intervenes and Thomas witnesses the ultimate betrayal.\n\n49 13 \"Ain't No Thang Like a Chicken Wing\" June 26, 2017 ( ) 1.48[61]\n\nIn the season finale, Landon and Kathryn's Key West apology sends shockwaves through the South leaving Thomas a gentleman scorned and the rest of the Charleston crew in bizzaro-land. Meanwhile, as Chelsea and Austen struggle to define their relationship, Craig and Naomie decide the fate of theirs. Kathryn and Thomas seem to finally be on the up and up while Shep continues to spiral down, down, down. When the group gathers for JD's party, old tensions are renewed when Craig is pushed to his limit by Shep.\n\n50 14 \"Reunion Part I\" July 10, 2017 ( ) 1.33[62]\n\nThe cast of Southern Charm rehashes the season in the first episode of the two-part reunion. Cameran unveils her latest accessory, as Craig and Naomie reveal the status of their relationship. Meanwhile, Shep continues to give Craig and Landon a hard time as Austen proves himself to be a more sympathetic version of his mentor. Kathryn and Jennifer confront their past friendship and Thomas issues a threat that leaves the cast speechless.\n\n51 15 \"Reunion Part II\" July 17, 2017 ( ) 1.28[63]", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Southern_Charm_episodes", "title": "List of Southern Charm episodes", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "List of Southern Charm episodes - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}