{"url": "https://en.wikipedia.org/wiki/WAGS_(TV_series)", "text": "WAGS Also known as WAGs LA Genre Reality television Starring Autumn Ajirotutu\n\nBarbie Blank\n\nSasha Gates\n\nNatalie Halcro\n\nAshley North\n\nOlivia Pierson\n\nNicole Williams\n\nSophia Pierson\n\nTia Shipman\n\nMichelle Beltran\n\nAmber Nichole\n\nDominique Penn Country of origin United States Original language English No. of seasons 3 No. of episodes 28 Production Executive producers Amber Mazzola\n\nLori Gordon\n\nJames DuBose Production location Los Angeles, California Camera setup Multi-camera Running time 43 minutes Production company Machete Productions Release Original network E! Picture format 1080i HDTV Original release August 18, 2015 ( ) –\n\nDecember 17, 2017 ( 2017-12-17 ) Chronology Related shows WAGS Miami\n\nWAGS Atlanta\n\nWAGS, also known as WAGS LA, is a 2015-2017 American reality documentary television series that ran for three seasons on the E! television network.[1][2] The reality show chronicles both the professional and personal lives of several WAGs (an acronym for wives and girlfriends of sportspersons).[3]\n\nThe series had three spin-off shows, all on the E! network: WAGS Miami (2016-2017), which ran for two seasons,[4][5] WAGS Atlanta (2018), which ran for one season,[5][6] and Relatively Nat & Liv (2019), starring Olivia Pierson and Natalie Halcro of WAGS LA, which ran for one season.[7][8]\n\nCast [ edit ]\n\nEpisodes [ edit ]\n\nSeries overview [ edit ]\n\nSeason Episodes Originally aired First aired Last aired 1 8 August 18, 2015 ( ) October 6, 2015 ( 2015-10-06 ) 2 12 June 26, 2016 ( ) September 25, 2016 ( 2016-09-25 ) 3 8 November 5, 2017 ( ) December 17, 2017 ( 2017-12-17 )\n\nSeason 1 (2015) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Original air date U.S. viewers\n\n(millions) 1 1 \"The WAG Life\" August 18, 2015 ( ) 477,000[9] The series premieres with the ladies explaining the importance of being a wife and girlfriend of a sports star, the structure of their social circles and the glamorous life they live daily. Cousins Natalie and Olivia enter a rocky feud with former WWE Diva Barbie Blank; Nicole's relationship insecurities threatens to ruin their trip to Las Vegas. 2 2 \"Set a Date or Die!\" August 25, 2015 ( ) 334,000[10] Ashley finally gets a wedding date from fiance Dashon, only to be disappointed again; Nicole puts Natalie's and Olivia's image issues to the test after she sets up a semi-nude shoot and Barbie extends an olive branch, only to feel disrespected by the cousins again. 3 3 \"Is It Another Girl?\" September 1, 2015 ( ) 630,000[11] Ashley questions Dashon's fidelity after her wedding is postponed; Barbie's presence at a party in celebration of Natalie reaching 1 million followers on Instagram causes quite a stir; and Nicole pressures Larry about marriage and kids. 4 4 \"Never Have I Ever\" September 8, 2015 ( ) 625,000[12] Natalie and Olivia try to grow their Insta-Famous business, but hit a snag when they don't see eye to eye; Ashley does her best to move on after her wedding gets postponed; Barbie struggles with life after the WWE. 5 5 \"Mexican Standoff\" September 15, 2015 ( ) 678,000[13] The WAGs take a trip to Mexico for Natalie's birthday; Autumn second-guesses going with them because of guilt over leaving her kids; Barbie bonds with Natalie and Olivia and checks out a potential wedding venue. 6 6 \"For Love or Money\" September 22, 2015 ( ) 376,000[14] Natalie is challenged with choosing between her career and her relationship with Shaun; Nicole gives up a modeling job in New York to spend time with Larry; Barbie gets a surprise package at her home from Sheldon's team. 7 7 \"I Kissed a Girl\" September 29, 2015 ( ) 739,000[15] Nicole and Barbie are put at odds over a trip to the male strip club during Barbie's Bachelorette party; Natalie causes strife with Shaun when she forgets to mention the trip. 8 8 \"You're In a Fake Relationship\" October 6, 2015 ( ) 341,000[16] Natalie has cold feet about taking her relationship with Shaun to the next level; Sasha puts her life on hold when there are complications with her pregnancy; Olivia's single status finally takes a promising turn.\n\nSeason 2 (2016) [ edit ]\n\nSophia Pierson and Tia Shipman joined the cast of WAGs; North departed as a series regular.\n\nNo.\n\noverall No. in\n\nseason Title Original air date U.S. viewers\n\n(millions) 9 1 \"WAGS Collide\" June 26, 2016 ( ) 558,000[17] Newcomer Sophia starts trouble in the Season 2 premiere when she brings up an alleged cheating scandal involving Autumn's husband. Meanwhile, sides are taken when Natalie and Sasha collide over the WAGS hierarchy; Barbie lets wedding plans keep her busy; things get serious between Olivia and Marcedes Lewis and Natalie questions her own relationship status. 10 2 \"Foul Play\" July 3, 2016 ( ) 624,000[18] An unresolved feud between Autumn and Natalie threatens to ruin a spring training trip, during which Barbie looks forward to throwing out the first pitch at a baseball game; Nicole finds a new way to cope with trust issues while away from Larry and Sophia moves into Olivia's apartment without permission. 11 3 \"DM Drama\" July 10, 2016 ( ) 644,000[19] Olivia reveals to new WAG Tia that her boyfriend may not be as trustworthy as she thought; Tia plots revenge and moves in on Olivia's man and his mom; Natalie runs into Shaun, forcing her to deal with her emotions. 12 4 \"Secrets in Sin City\" July 17, 2016 ( ) 537,000[20] Natalie invites Shaun to Vegas in the hope of repairing their relationship, but when Nicole meddles in her love life, her loyalty is questioned; a shocked Sasha finds out she's not invited to Barbie's wedding. 13 5 \"Cheat Sheet\" July 31, 2016 ( ) 567,000[21] Barbie becomes enraged when she finds out that Larry may propose to Nicole during her wedding; Tia creates an opportunity for Natalie and Olivia at New York Fashion Week, but Olivia gets distracted when her sister makes a move on her man. 14 6 \"A Wag Wedding\" August 7, 2016 ( ) 593,000[22] The WAGS head to Cabo San Lucas for Barbie's wedding; Olivia's plus one drops out and Natalie discovers that Sophia may be to blame while Nicole's wedding fever causes unexpected issues. 15 7 \"WAG Interference\" August 14, 2016 ( ) 542,000[23] Larry's ex-girlfriend accuses Nicole of being a home wrecker; Marcedes faces backlash for ditching Olivia in Cabo and Autumn and Barbie face off about the future of their friendship. 16 8 \"Moving on Out\" August 28, 2016 ( ) 432,000[24] Medium Tyler Henry makes a visit to the WAGS; Nicole may cause her relationship with Larry to end; Olivia faces a big decision about her future and Sasha puts on a performance. 17 9 \"New Blood\" September 4, 2016 ( ) 626,000[25] Autumn introduces several LA Rams wives to the group; Olivia deals with the pressure of a long-distance relationship while balancing work issues; Nicole questions her decision. 18 10 \"Pegging Party\" September 11, 2016 ( ) 860,000[26] Tia arranges a lesson; Natalie and Olivia receive an invitation to become brand ambassadors; Larry reveals his intentions with Nicole; Barbie auditions. 19 11 \"Trouble in Paradise[27]\" September 18, 2016 ( ) [27] 651,000[28] Nicole's crazy antics cause Larry to think about calling off the proposal; Sasha and Tia come to blows over a secret nickname while Sophia hits it off with a new athlete. 20 12 \"Thai The Knot\" September 25, 2016 ( ) 561,000[29] The ladies explore Phuket; Tia reveals a huge secret about her dating life and Larry proposes to Nicole.\n\nSeason 3 (2017) [ edit ]\n\nMichelle Beltran, Amber Miller, and Dominique Penn joined the cast of WAGs; Pierson and Shipman departed as series regulars.\n\nNo.\n\noverall No. in\n\nseason Title Original air date U.S. viewers\n\n(millions) 21 1 \"Wag War\" November 5, 2017 ( ) 389,000 22 2 \"Thirsty Thots\" November 12, 2017 ( ) 417,000 23 3 \"Trouble in Paradise\" November 19, 2017 ( ) 296,000 24 4 \"50 Shades of Shade\" November 26, 2017 ( ) 377,000 25 5 \"No Ring, No Deal\" December 3, 2017 ( ) 422,000[30] 26 6 \"Bachelorette Brawl\" December 10, 2017 ( ) 466,000[31] 27 7 \"Party Crasher\" December 17, 2017 ( ) 414,000[32] 28 8 \"Wags Wedding Bells\" December 17, 2017 ( ) 343,000[32]\n\nBroadcast [ edit ]\n\nThe eight-episode series premiered at 10:00PM ET in the United States on the E! cable network and airs weekly starting on August 18, 2015.[1] The series has aired internationally, in Australia and New Zealand, the series premiered on the local version of E! on August 20, 2015.[33][34]\n\nIn May 2016, it was announced that WAGS would receive a spin-off, titled WAGS Miami. The series features wives and girlfriends of sports stars centered in Miami.[35][36] The series premiered on October 2, 2016.[37] On May 4, 2017, it was announced that a second spin-off, WAGS Atlanta, was in development with James DuBose serving as executive producer of the series.[5][6]\n\nCancellation [ edit ]\n\nOn February 1, 2018, E! executives announced that WAGS LA and WAGS Miami were cancelled because of declining ratings.[38]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/a/a0/WAGS_tv_logo.png/250px-WAGS_tv_logo.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/a/a0/WAGS_tv_logo.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/a/a0/WAGS_tv_logo.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/WAGS_(TV_series)", "title": "WAGS (TV series)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/a/a0/WAGS_tv_logo.png", "width": 640, "height": 341}, "title": "WAGS (TV series) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}