{"url": "https://www.cosmopolitan.com/entertainment/celebs/a12786652/sarah-jessica-parker-kim-cattrall-sex-and-the-city-feud-timeline/", "text": "Sex and the City hit your parents’ HBO subscription in 1998, and it’s been straight-up d-r-a-m-a ever since. Like, there’s even been drama about how there is “no drama.” And while no one but the cast knows what actually went down behind the scenes, at some point the internet decided Kim Cattrall and Sarah Jessica Parker were feuding. And thanks to (1) HBO Max’s Sex and the City spin-off And Just Like That… (which has been greenlit for season 2) and (2) a recent interview Kim did with Variety, the actors’ alleged “feud” has once again become a talking point.\n\nBy way of a little background, it’s important to note that there was a pretty major pay disparity among the Sex and the City cast: Sarah Jessica Parker earned a much larger salary than her costars due to being the show’s lead (as well as a producer). Kim wanted more money as the show became more successful, and negotiations between her and the producers took a turn for the very public—and the very yikes. Which brings us to our timeline, ahem!\n\nSeptember 19, 2004\n\nAfter SATC ends its run on HBO, the cast heads to the Emmys and everyone is quick to notice that Kim doesn’t sit with her costars.\n\nGetty Images\n\nNovember 12, 2004\n\nDuring an interview on Friday Night With Jonathan Ross, Kim says that salary discrepancies did, indeed, impact the show ending when it did. “I felt after six years, it was time for all of us to participate in the financial windfall of Sex and the City. When they didn’t seem keen on that, I thought it was time to move on.”\n\nMay 19, 2008\n\nFour years after the series finale, the SATC movie starts filming—after allegedly being delayed due to Kim’s salary negotiations. Sucks for fans, but seems fair, IMO. Sarah Jessica Parker even supports Kim, telling The Telegraph, “She mentioned money and no one should vilify her for it. People made a decision that we had vilified her.”\n\nIn the same interview, Kim talks about the filming holdup and says, “I was going through a divorce and my job of seven years was coming to an end. Then my dad was diagnosed with dementia. So I took a step back and returned to Canada, where my family is—that’s the reason behind it. It wasn’t all about the money.”\n\nNovember 5, 2009\n\nWhile filming SATC 2, Sarah Jessica Parker covers Elle and says, “I don’t think anybody wants to believe that I love Kim. I adore her. I wouldn’t have done the movie without her. Didn’t and wouldn’t.”\n\n\n\nJanuary 8, 2010\n\nKim denies feud rumors in an interview with the Daily Mail:\n\n“I think Sarah was right: People don’t want to believe that we get on. They have too much invested in the idea of two strong, successful women fighting with each other. It makes for juicy gossip and copy. The truth of us being friends and getting along and happily doing our jobs together is nowhere near as newsworthy. I think Sarah is fantastic. She is a born leader and she guides the crew and the cast in such a strong but gentle way. She and I are sick of this. It’s exhausting talking about it and a real bore. Next?”\n\nMay 5, 2010\n\nThe cast covers Marie Claire ahead of Sex and the City 2 and continues to shut down feud rumors. SJP put it this way:\n\n“When you’re on-set, you’re working 90-hour weeks, you’re never home, you’re exhausted. There are times when all of us have been sensitive, and sometimes feelings get hurt. But I don’t have any regrets about how I’ve treated people.”\n\nDave M. Benett Getty Images\n\nAugust 21, 2016\n\nSJP wishes Kim a happy birthday with a giant photo of her face:\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nSeptember 28, 2016\n\nSJP tells Time, “It was always so heartbreaking to me that there was this narrative about Kim and myself because it just didn’t reflect anything that happened on that set. They just didn’t do it to the Sopranos guys. It was so strange to me and upsetting. I posted something on Kim’s birthday and people were like, ‘Oh my god, I didn’t know you liked her!’ What? We were all at liberty to walk away at any time! But nobody asked those questions of shows with men. Isn’t that interesting?”\n\nOctober 18, 2016\n\nSJP opens up to Howard Stern, saying, “This sort of narrative, this ongoing catfight, it really used to upset me. It was usually about bad behavior on the set and I take very seriously my reputation. I work really hard and I treat people well. I have a work ethic that’s very meaningful to me and it’s based on the affection I feel for the people I get to work with. To suggest that I’m behaving poorly or not treating somebody well…it would drive me bananas.”\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nSeptember 29, 2017\n\nAs news breaks that Sex and the City 3 isn’t happening, Kim shuts down speculation that she was somehow responsible for it:\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nWoke 2 a @MailOnline 💩storm! The only 'DEMAND' I ever made was that I didn't want to do a 3rd film....& that was back in 2016 — Kim Cattrall (@KimCattrall) September 29, 2017\n\nThat same day, the rest of the cast talks about how disappointed they are that the movie isn’t happening, and things get a little, ahem, pointed:\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nDisappointed for all crew holding on for negotiations to conclude for their jobs, and of course, for the fans. Leave it at that. #Truth — Willie Garson 🇺🇸 (@WillieGarson) September 29, 2017\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nEvery cast member is integral, and all did amazing work, and would have in this lovely script as well. Nothing to do if one doesn't want to. — Willie Garson 🇺🇸 (@WillieGarson) September 29, 2017\n\nOctober 7, 2017\n\nThe New York Post publishes an entire article about the “mean girls” culture on the set of Sex and the City. The report includes a bunch of aggregated claims of SJP being “mean” to Kim, including from one source who says, “[Kim] feels she has been treated horribly by Sarah Jessica Parker for six years.”\n\nWhy is this particular tabloid report relevant, you ask? Stay tuned.\n\nOctober 24, 2017\n\nKim responds to speculation that her “demands” held up the third Sex and the City movie during an interview with Piers Morgan, saying, “We’ve never been friends. We’ve been colleagues, and in some ways, it’s a very healthy place to be.”\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nShe also told Morgan that no one had reached out to her about reports that it was her fault the third movie was canceled: “Nobody ever picks up the phone and tries to contact you and say, ‘How you doing?’ That would have been the way to handle it. This is, it feels like, a toxic relationship.”\n\nFebruary 1, 2018\n\nSJP reacts to Kim’s interview with Morgan, telling Andy Cohen, “I found it very upsetting because that’s not the way I recall our experience. It’s sad, but I always think that what ties us together is this singular experience. It was a professional experience, but it became personal because it was years and years of our lives, so I’m hoping that that sort of eclipses anything that’s been recently spoken.”\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nFebruary 10, 2018\n\nKim makes it clear she’s not on good terms with SJP, responding to good wishes about her brother’s sudden passing by writing, “Your continuous reaching out is a painful reminder of how cruel you really were then and now.” She adds, “You are not my family. You are not my friend. So I’m writing to tell you one last time to stop exploiting our tragedy in order to restore your ‘nice girl’ persona.”\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nAs you can see, Kim also included the literal URL to that 2017 New York Post article about the “mean girl” culture on SATC—indicating that much of it was true, at least according to her.\n\nFebruary 14, 2018\n\nSarah Jessica Parker insists she and Kim Never. Had. Drama. during an interview with People:\n\n“I never talked about it, except [to say] that some of us were disappointed [about the movie not happening]. But I never responded to the conversation Kim had with Piers Morgan, where she said things that were really hurtful about me. We had this experience and it was amazing, and nothing will ever be like it. We had a connection with an audience, and we had a connection with the city and with this crew, and we got to tell these crazy stories with each other. So I don’t want to mess with that. I couldn’t imagine anyone else playing that part. So there was no fight; it was completely fabricated, because I actually never responded. And I won’t, because she needed to say what she needed to say, and that is her privilege.”\n\nFebruary 26, 2018\n\nCynthia Nixon makes it pretty clear how she feels about the situation with an extremely subtle and completely understated Instagram post!\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nApril 23, 2018\n\nSPJ once again insists that there is no drama to be found, telling Vulture:\n\n“I have never uttered an unkind, unsupportive, unfriendly word, so I would love to redefine it. I also want to remind everybody that there were four women on the set and I spent equal time with all of them, so this was not a set with two women who didn’t get along. I’ve always held Kim’s work in high regard and always appreciative of her contributions. If she chooses not to do the third movie, there’s not a lot I can do to change her mind and we must respect it. That’s the only thing I’ve ever said about it, you know?”\n\nSeptember 17, 2018\n\nFans accuse Kristin Davis of stirring the pot by leaving Kim out of this SATC throwback post:\n\nNovember 19, 2018\n\nProducer/writer Michael Patrick King talks to the Hollywood Reporter about the salary discrepancy on Sex and the City. As he bluntly put it:\n\n“The show doesn’t exist if Sarah Jessica wasn’t the blonde star of the show, that’s number one. Kim was not at the height of her career, Kristin was under her in terms of notability, Cynthia was a theater actress—and their contracts reflected that status.”\n\nNovember 26, 2018\n\nA source tells E! News that one of the reasons Kim turned down a third movie is that she didn’t like Samantha’s storyline: “Kim never wanted to really do the movie to begin with. It was a combination of not great money and a bad storyline for Samantha. It was a bad script.”\n\nJanuary 11, 2021\n\nSJP announces that Sex and the City is coming back to HBO—without Kim.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nShe even specifically confirms that Kim won’t be in the show and denies disliking her to a commenter:\n\nInstagram\n\nJanuary 13, 2021\n\nKim Cattrall “breaks her silence” (kinda) by Liking this pretty pointed tweet about the SATC reboot:\n\nFebruary 12, 2021\n\nSamantha is indeed getting written off the new Sex and the City show, but even though Kim’s exit from the series has been dramatic, Samantha’s won’t be.\n\nHBO Max chief content officer Casey Bloys told TV Line that Samantha will be absent because she simply grew apart from the rest of the crew.\n\n“Just as in real life, people come into your life, people leave,” she said. “Friendships fade, and new friendships start. So I think it is all very indicative of the real stages, the actual stages of life.”\n\nJuly 9, 2021\n\nThe first pics drop from the set of And Just Like That… with Miranda, Carrie, and Charlotte stylishly strutting down an NYC street—and Samantha is a noticeable absence.\n\nJose Perez/Bauer-Griffin Getty Images\n\nOctober 2021\n\n\n\nCandace Bushnell, aka the author whose book Sex and the City was adapted into the series we’ve come to know and love, spoke to the New York Post about Kim not being a part of the reboot while also mentioning that she didn’t know anything about the reboot’s storyline and doesn’t have any involvement with it. “I absolutely love Kim,” Bushnell said, “but it seems she wants to do other things and she doesn’t feel like doing the show. Maybe she doesn’t want to be that character anymore. Maybe she doesn’t want to put the Spanx on!”\n\nDecember 2021\n\nWhile doing press for And Just Like That…, Kristin spoke with the Today show about whether Kim’s absence would be explained in the reboot, to which the actor replied, “Yes.” “We love Samantha. Samantha is never not going to be a part in some way, right? So there is respect for Samantha. It’s part of the story. We would never disrespect Samantha.”\n\nWhen the show debuts on December 9, viewers learn Samantha’s absence is a result of her moving to London for work after Carrie no longer wants her as a publicist. Subsequently, Samantha stops returning calls and texts from all three of her former friends. “I always thought the four of us would be friends forever,” Carrie muses in the show.\n\nFebruary 2022\n\nIn an interview with Variety, SJP reveals that by the end of the first season of And Just Like That…, Carrie and Samantha resolve their differences—once again, via text. Although the spoiler immediately had many wondering if this was a subtle hint that Kim’s character might be in season 2, SJP said the following when asked about whether she would want the How I Met Your Father star back again: “I don’t think I would because I think there’s just too much public history of feelings on her part that she’s shared.…I haven’t participated in or read articles, although people are inclined to let me know.”\n\nCreator Michael Patrick King also added, “Magically thinking, it’s great to have Samantha. I have no realistic expectation of Kim Cattrall ever appearing again.”\n\nMay 2022\n\nKim’s interview with Variety sets the record straight on how she feels about the original SATC cast reprising their roles on And Just Like That… without her.\n\n“It’s odd, isn’t it? I don’t know how to feel about it,” she says. “It’s so finite for me, so it doesn’t continue. I think I would ponder it more if I didn’t have something like Queer as Folk or How I Met Your Father. That’s kind of where I’m centered around. This feels like an echo of the past.…I loved [Samantha]. I loved her so, so, so much. It’s tough competition. The original show is in all of our imaginations. But for me, it feels clean.”\n\nWhen asked whether she was ever friends with her SATC costars, Kim adds, “I guess it’s how you define friends. I think we were colleagues. My colleagues aren’t my friends. It was professional.”\n\nAaand that brings us up to date! We’ll be updating this if anything else happens, which very well may be the case with And Just Like That… being renewed for season ✌🏻.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-115384337-1611074190.jpg?crop=1.00xw:0.303xh;0,0.0397xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/satc-op-ed-1610738671.png?crop=1xw:0.9953703703703703xh;center,top&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-115384337-1611074190.jpg?crop=1.00xw:0.303xh;0,0.0397xh&resize=1200:*", "keywords": [], "authors": ["Mehera", "Mehera Bonner Is A Celebrity", "Entertainment News Writer Who Enjoys Bravo", "Antiques Roadshow With Equal Enthusiasm", "She Was Previously Entertainment Editor At Marie Claire", "Has Covered Pop Culture For Over A Decade."], "canonical_link": "https://www.cosmopolitan.com/entertainment/tv/a35246263/kim-cattrall-sarah-jessica-parker-drama-timeline/", "title": "Kim Cattrall and Sarah Jessica Parker's 'Sex and the City' Feud Timeline", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Kim Cattrall Saying She Wasn’t Asked to Be on ‘AJLT…’ May Have Reignited SJP ‘Sex and the City’ Drama", "description": "It’s been 84 years…. 👀", "url": "https://www.cosmopolitan.com/entertainment/tv/a35246263/kim-cattrall-sarah-jessica-parker-drama-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-115384337-1611074190.jpg?crop=1.00xw:0.303xh;0,0.0397xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2022-06-08T06:32:56Z", "published_time": "2022-05-10T14:00:00Z", "section": "TV", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-115384337-1611074190.jpg?crop=1.00xw:0.303xh;0,0.0397xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Kim Cattrall and Sarah Jessica Parker's 'Sex and the City' Feud Timeline", "description": "Every detail of Kim Cattrall and Sarah Jessica Parker's 'Sex and the City' drama, explained as 'And Just Like That' gets another new season.", "auto-publish": "never", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-115384337-1611074190.jpg?crop=1.00xw:0.606xh;0,0&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,tv", "sailthru.date": "2022-05-10T14:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-115384337-1611074190.jpg?crop=1.00xw:0.303xh;0,0.0397xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-115384337-1611074190.jpg?crop=1.00xw:0.606xh;0,0", "sailthru.socialtitle": "Kim Cattrall Saying She Wasn’t Asked to Be on ‘AJLT…’ May Have Reignited SJP ‘Sex and the City’ Drama", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1652191200.0, "source": "https://www.cosmopolitan.com", "summary": ""}