{"url": "https://www.tor.com/2018/08/03/why-im-obsessed-with-the-outlander-theme-song/", "text": "Sing me a song of a lass that is gone\n\nSay, could that lass be I?\n\nThe first time I saw the opening lyrics to Outlander’s theme song posted on a friend’s Facebook post, I thought it sounded ridiculous, way too on-the-nose to start every episode by acknowledging the series’ premise. YES WE GET IT CLAIRE YOU DISAPPEARED.\n\nThat was before I actually listened to it, and watched the title sequence—and then, like Claire at Craigh na Dun, I fell hard. Now, I forbid my husband from fast-forwarding through the credits every time we watch… and considering that we’ve been bingeing a season at a time, that means I’ve got it well memorized. But why do I find this particular TV opening so compelling?\n\nThe answer, I think, is that it presses all of my nerd buttons: it’s a remix of a mashup, with an excellent invocation of Rule 63. It is the platonic ideal of a TV theme song.\n\nSpoilers for Outlander seasons 1 through 3.\n\nI knew that Bear McCreary is behind so many excellent modern scores, from Battlestar Galactica and 10 Cloverfield Lane, but I did not truly appreciate his expertise until I traced the origins of the Outlander theme. Because first he started off with the tune of the 1884 folk song “The Skye Boat Song,” which is not just any random Scottish ditty, but which chronicles the escape of Bonnie Prince Charlie (!) during the Battle of Culloden (!!) at the heart of the Jacobite uprising. Already, amazing season 2 synergy before the damn pilot has even started:\n\nSpeed, bonnie boat, like a bird on the wing,\n\nOnward! the sailors cry;\n\nCarry the lad that’s born to be King\n\nOver the sea to Skye. Loud the winds howl, loud the waves roar,\n\nThunderclouds rend the air;\n\nBaffled, our foes stand by the shore,\n\nFollow they will not dare.\n\nAnd so forth. But, as Bear explained in his wonderfully detailed Behind the Music-esque blog posts, he wasn’t connecting with the original lyrics by Sir H. Boulton. It was Raya Yarbrough, the voice behind every iteration of the Outlander theme, who suggested swapping them out for Robert Louis Stevenson’s 1892 poem (same subject matter) “Sing Me a Song of a Lad That Is Gone“:\n\nSing me a song of a lad that is gone,\n\nSay, could that lad be I?\n\nMerry of soul he sailed on a day\n\nOver the sea to Skye. Mull was astern, Rum on the port,\n\nEigg on the starboard bow;\n\nGlory of youth glowed in his soul;\n\nWhere is that glory now?\n\nAnd on. Except that the tiresome fop Prince Charlie, the worst character from season 2 (I said it), doesn’t deserve to narrate the opening credits. And really, Outlander isn’t about any of the men—not him, not Frank, not Black Jack, not even dear Jamie. So then Bear conjured his inner fangirl and genderswapped RSL’s poem, so instead of Bonnie Prince Charlie talking, it’s Claire. And, let’s be honest, this stanza from the poem sounds more like her than any man anyway:\n\nBillow and breeze, islands and seas,\n\nMountains of rain and sun,\n\nAll that was good, all that was fair,\n\nAll that was me is gone.\n\nAnd it all comes together like a brilliantly remixed fanfic, or an unexpectedly inventive dish on Chopped:\n\nUGH it’s SO GOOD. When the drums pick up after all that was me is gone and she takes off through the forest? /chefskiss\n\nIn the words of Eliza Schuyler Hamilton, this could be enough. BUT THEN. It’s not enough to have achieved this remix excellence and just float on your laurels for at least six seasons. Then the brilliant minds behind these credits tapped into my favorite part of golden age of TV-era openings and changed it up for every season. Just as I still have a soft spot for appointment television, I earnestly miss TV show openings that change up the footage every season. It was always a treat to start up the new season of Buffy the Vampire Slayer and gawk at all of the moments to look forward to (two Xanders?? a roving monster hand? and of course, the inevitable badass Buffy pose) over the next 22 episodes. Just imagine if every season of Game of Thrones had fleeting shots of Rob Stark getting stabbed, Joffrey purple and spluttering, Cersei’s dragonfire lighting shit up…\n\nTo be fair, the Game of Thrones theme is its own work of art, and fits the show: Westeros is so massive, of course we need to see the entire world from the point of view of scholars and military strategists. Also, the twists in A Song of Ice and Fire are so big that to give even a hint of them would ruin many viewers’ experiences. Outlander had to show not so much where physically Claire would wind up, but where in time—to contrast the magic of the Dance of the Druids at the standing stones with the equal magic of turning a radio dial.\n\nThat said, the series still very much leans in to its predilection for choosing a new country (sometimes a new continent) for each season. To wit, season 2 saw the Frasers going to France—so Bear and co. replaced the Scottish fiddle and drums with a baroque viola de gambe and even translated a verse into French:\n\nBut France was short-lived, with Jamie and Claire returning to Scotland and the fated Battle of Culloden in the latter half of the season. The folks behind the credits could have just washed their hands of it and kept to the Frenchified titles. But do you think they were content with that? OF COURSE NOT. This is war, and the military Scottish snare drums, bagpipes, and shots of shirtless Highlanders versus musket-wielding British soldiers needed to reflect that:\n\nAt this point, changing the main titles every season has become an Outlander tradition. At first, season 3’s changes appear a bit subtler, but there: the radio is replaced by a flickering television, broken chains carry incredible significance, and while many of the Scottish elements remain, they’re more somber, more retrospective. Then, instead of adding or replacing something, Bear strips out the bagpipes—signifying the crushing defeat at Culloden. Seriously, every detail, every choice, is so delightfully deliberate:\n\nThankfully, we do not linger on sadness for long. While the first half of season 2 was very classy and baroque, the latter half of season 3 is shaped by McCreary’s most out-there choice yet: “I cannot imagine any project other than Outlander that would allow me to set a soaring bagpipe melody over blistering congas!” Not unlike Hamilton’s Act 1 ending number “Non-Stop” (one of my favorites in the show), the new Outlander titles utilize congas and other Afro-Cuban influences to impressive dramatic effect. Pack your bags, kiddos, we’re going to the Caribbean:\n\n“Altering a series main title is a risky move,” McCreary wrote when it came to switching things up for season 2. “The entire point of a main title is to be consistent from episode to episode, building a relationship with the audience.” And that could be the case, but when does familiarity begin to breed monotony? Do TV audiences really have a relationship with a static title card and one beat of music, or is it just an extra two seconds to fast-forward to get to the episode at hand?\n\nClaire Beauchamp Randall Fraser’s relationships are as jagged as the lines on her palm: She’s with Frank, then Jamie, then returned to Frank, then reunited with Jamie. As she jumps through time and around the world, aging and changing and conceiving in one timeline but giving birth in another, meeting old friends for the first time and rediscovering new loves, viewers must follow along her dizzying route. She, and they, need a theme song that changes with the show, that always reflects its present moment before shedding that identity and taking on a new one.\n\nLet’s bring back opening credits that match the tone of the show—the headbanging fun of Buffy the Vampire Slayer, the almost-too-cheesy folksiness of Firefly’s “You Can’t Take the Sky From Me,” the quick trip through the universe afforded by Futurama. These should be the rule, not the exception—the rule being that even if you have read the books or otherwise know what to expect from your show, it can still surprise you.\n\nNatalie Zutter loves how the Outlander fans made an alternate version of the season 1 credits. Talk the best TV opening credits with her on Twitter!", "images": ["https://i0.wp.com/www.tor.com/wp-content/uploads/2018/05/outlander-opening-credits-claire.png?fit=1200%2C+9999&crop=0%2C0%2C100%2C1200px&quality=100&ssl=1", "https://www.tor.com/wp-content/uploads/2015/10/newsletter_signup.png"], "top_img": "https://i0.wp.com/www.tor.com/wp-content/uploads/2018/05/outlander-opening-credits-claire.png?fit=1200%2C+9999&crop=0%2C0%2C100%2C1200px&quality=100&ssl=1", "keywords": [], "authors": ["Natalie Zutter", "Molly Templeton", "Vanessa Armstrong", "Sylas K Barrett", "Emmet Asher-Perrin", "Kali Wallace"], "canonical_link": "https://www.tor.com/2018/08/03/why-im-obsessed-with-the-outlander-theme-song/", "title": "Why I’m Obsessed with the Outlander Theme Song", "meta_data": {"viewport": "initial-scale=1.0", "robots": "max-image-preview:large", "google-site-verification": "TKdgmMLGHnS29XwYAR1A9VCy1ejitKME08p83KA8bbw", "p": {"domain_verify": "c5fa3aa04d7b8e9504e9307da5489225"}, "og": {"type": "article", "title": "Why I’m Obsessed with the Outlander Theme Song", "url": "https://www.tor.com/2018/08/03/why-im-obsessed-with-the-outlander-theme-song/", "description": "Sing me a song of a lass that is gone Say, could that lass be I? The first time I saw the opening lyrics to Outlander’s theme song posted on a friend’s Facebook post, I thought it sounded rid…", "site_name": "Tor.com", "image": {"identifier": "https://i0.wp.com/www.tor.com/wp-content/uploads/2018/05/outlander-opening-credits-claire.png?fit=1200%2C+9999&crop=0%2C0%2C100%2C1200px&quality=100&ssl=1", "width": 1200, "height": 1200, "alt": "Outlander opening credits TV theme song Bear McCreary main title The Skye Boat Song sing me a song of a lass that is gone Claire Beauchamp Randall Fraser"}, "locale": "en_US"}, "article": {"published_time": "2018-08-03T14:00:39+00:00", "modified_time": "2018-08-03T18:04:40+00:00", "publisher": "https://www.facebook.com/tordotcom/", "author": "https://www.tor.com/author/natalie-zutter/"}, "fb": {"app_id": 966242223397117}, "author": "Natalie Zutter", "twitter": {"site": "@tordotcom", "text": {"title": "Why I’m Obsessed with the Outlander Theme Song"}, "image": {"identifier": "https://i0.wp.com/www.tor.com/wp-content/uploads/2018/05/outlander-opening-credits-claire.png?fit=1200%2C+9999&crop=0%2C0%2C100%2C1200px&quality=100&ssl=1&w=640", "alt": "Outlander opening credits TV theme song Bear McCreary main title The Skye Boat Song sing me a song of a lass that is gone Claire Beauchamp Randall Fraser"}, "card": "summary_large_image"}}, "movies": ["https://www.youtube.com/embed/YrusSXEEv1M?feature=oembed", "https://www.youtube.com/embed/sECPEz5eDvc?feature=oembed", "https://www.youtube.com/embed/xpy3eZo-qdI?feature=oembed", "https://www.youtube.com/embed/Gvvu0eJZ14c?feature=oembed", "https://www.youtube.com/embed/N0t6H5G2aPc?feature=oembed"], "publish_date": 1533250800.0, "source": "https://www.tor.com", "summary": ""}