{"url": "https://popculture.com/celebrity/2017/07/26/jennifer-aniston-jason-bateman-hollywood-walk-of-fame/", "text": "Jason Bateman received a star on the Hollywood Walk of Fame on Wednesday, with a speech by none other than his frequent co-star and friend Jennifer Aniston.\n\nWhile people were expecting Bateman's Arrested Development co-star Will Arnett to supply some laughs during his speech, many weren't expecting the amount of friendly roasting Aniston provided.\n\nUp Next: Was the Entire 'Friends' Series Just a Dream in Rachel's Head?\n\nAs E! reports, she started out going through Bateman's oft-forgotten child star beginnings, which included roles in Little House on the Prairie and The Hogan Family. She also roasted his first film role in Teen Wolf Too by showing off a Muppets Magazine cover featuring the young star.\n\n\"One thing has proven itself to be true and that is having longevity in this business is not easy,\" Aniston said. \"Especially starting out as a child actor. Usually that's a story that doesn't always end well. When I actually met Jason it was kind of looking like it could go either way.\"\n\nMore: 'Ozark' Showrunner Reveals How Long He Thinks the Series Should Last\n\nShe also shared a humorous story about a New Year's ski trip she attended with Bateman that featured the Ozark star nearly crashing his car.\n\n\"Picture this: It's New Year's Eve. It's just after midnight and there is a blizzard outside. I hear someone yell, 'Help! Someone Help! Jason. Car. Someone could die.'\" Aniston recalled. \"So we run outside to help him and what we see is, we have two feet of snow, Jason is in a truck fishtailing away down a one-way street hanging with the door wide open, hanging half way out of the car.\n\n\"His foot was out trying to stop the car kind of like Fred Flintstone. It's still not clear what you were doing, a little foggy right? You don't remember. Thankfully he outgrew those days of terrifying people.\"\n\nShe decided to end on a more positive note, but still adding in some jokes for good measure.\n\n\"He looks 12. He acts 100. A head of hair that women envy. He works hard. He's tired. Even in his most restful state, he's one of the loveliest men to be around,\" she said. \"He always gives you deep connection, full attention, authenticity and some of the deepest belly laughs that I can remember. We are so very proud of you.\"", "images": ["https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200"], "top_img": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/celebrity/news/jennifer-aniston-jason-bateman-hollywood-walk-of-fame/", "title": "Jennifer Aniston Hilariously Turned Jason Bateman's Walk of Fame Ceremony Into a Roast", "meta_data": {"description": "Jason Bateman received a star on the Hollywood Walk of Fame on Wednesday, with a speech by none [...]", "keywords": "Jason Bateman,Hollywood,Jennifer Aniston", "news_keywords": "Jason Bateman,Hollywood,Jennifer Aniston", "robots": "index, follow, max-image-preview:large", "twitter": {"card": "summary_large_image", "site": "PopCulture", "creator": "PopCulture", "title": "Jennifer Aniston Hilariously Turned Jason Bateman's Walk of Fame Ceremony Into a Roast", "description": "Jason Bateman received a star on the Hollywood Walk of Fame on Wednesday, with a speech by none [...]", "image": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200"}, "og": {"title": "Jennifer Aniston Hilariously Turned Jason Bateman's Walk of Fame Ceremony Into a Roast", "type": "article", "url": "https://popculture.com/celebrity/news/jennifer-aniston-jason-bateman-hollywood-walk-of-fame/", "image": {"identifier": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "width": 640, "height": 320}, "site_name": "Celebrity", "description": "Jason Bateman received a star on the Hollywood Walk of Fame on Wednesday, with a speech by none [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#263240", "apple-mobile-web-app-capable": "yes"}, "movies": [], "publish_date": 1501023600.0, "source": "https://popculture.com", "summary": ""}