{"url": "https://deadline.com/2017/09/will-grace-first-streaming-deal-hulu-nbc-1202173974/", "text": "As Will & Grace is coming back to NBC for at least two new seasons, the series’ original 194 episodes will be made available for streaming for the first time via a deal with Hulu. The Emmy-winning comedy will be available beginning Thursday, a week ahead of the September 28 return of Will & Grace on NBC.\n\n.\n\nHulu will be the exclusive SVOD partner for the original eight seasons, which also will be available on the NBC app and pay TV providers with authentication. The deal also extends to the new episodes of Will & Grace, which will be available for streaming on the same platforms the day after their broadcast premiere.\n\nHulu was the logical home for Will & Grace because, as an NBC corporate sibling, it gets access to the network’s current series via the network’s stacking rights. The pact keeps new and library episodes together, as was the case with NBC’s freshman drama series This Is Us, which also went to Hulu in SVOD. Additionally, Hulu has been active in acquiring streaming rights to broadcast comedy series, including the Golden Girls library.\n\nThe original eight seasons of Will & Grace ran from 1998-2006, receiving 83 Emmy nominations and 16 wins, including Outstanding Comedy Series in 2000.\n\n“As we gear up for the launch of the upcoming season premiere, I can’t think of a better way to reintroduce Will & Grace to the cultural zeitgeist than by giving audiences the opportunity to watch this historic and hilarious series wherever and whenever they want,” said NBC Entertainment Chairman Robert Greenblatt. “With its witty comebacks, pop-culture references and social commentary, Will & Grace is one of the most binge-able comedies in television history, and I am certain fans both old and new will jump on this opportunity to devour it.”\n\nNBC\n\nThe Will & Grace revival starring Eric McCormack, Debra Messing, Sean Hayes and Megan Mullally already has been picked up for a second season with 13 additional episodes. Both the original and new episodes of Will & Grace are written and executive produced by series creators Max Mutchnick and David Kohan, and directed and executive produced by James Burrows.\n\n“There’s no question that Will & Grace has resonated with audiences since the series made its broadcast premiere,” said Hulu, Chief Content Officer Joel Stillerman. “To be able to bring such an iconic show into the streaming universe for the first time ever is an opportunity we couldn’t pass up. This landmark deal will allow fans to re-watch their favorite moments ahead of the series premiere, as well as bring Will & Grace and its cast of characters to a whole new audience.”", "images": ["https://deadline.com/wp-content/uploads/2017/09/will-and-grace-original-series.jpg?w=681&h=383&crop=1", "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://deadline.com/wp-content/uploads/2017/09/will-and-grace-original-series.jpg?w=928", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://deadline.com/wp-content/uploads/2017/05/will-grace.png", "https://deadline.com/wp-content/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1"], "top_img": "https://deadline.com/wp-content/uploads/2017/09/will-and-grace-original-series.jpg?w=928", "keywords": [], "authors": ["Nellie Andreeva"], "canonical_link": "https://deadline.com/2017/09/will-grace-first-streaming-deal-hulu-nbc-1202173974/", "title": "‘Will & Grace’ Lands First-Ever Streaming Deal With Hulu For Old & New Episodes", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Will &amp; Grace' original 194 episodes will be made available for streaming for the first time via a deal with Hulu, which also covers new eps.", "news_keywords": "Hulu, NBC, Will & Grace", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=533209613", "generator": "WordPress 6.0.2", "author": "Nellie Andreeva", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Deadline", "application-name": "Deadline", "content_type": "Article", "post_id": 1202173974, "title": "'Will & Grace' Lands First-Ever Streaming Deal With Hulu For Old & New Episodes", "published_at": "2017-09-20 12:30:01", "image": "https://deadline.com/wp-content/uploads/2017/09/will-and-grace-original-series.jpg?w=296&h=166&crop=1", "comment_count": 10, "tags": "Will & Grace", "topics": "TV", "body": "As Will & Grace is coming back to NBC for at least two new seasons, the series' original 194 episodes will be made available for streaming for the first time via a deal with Hulu. The Emmy-winning comedy will be available beginning Thursday, a week ahead of the September 28 return of Will & Grace on NBC.\r\n\r\n\r\n\r\nHulu will be the exclusive SVOD partner for the original eight seasons, which also will be available on the NBC app and pay TV providers with authentication. The deal also extends to the new episodes of Will & Grace, which will be available for streaming on the same platforms the day after their broadcast premiere.\r\n\r\nHulu was the logical home for Will & Grace because, as an NBC corporate sibling, it gets access to the network's current series via the network's stacking rights. The pact keeps new and library episodes together, as was the case with NBC's freshman drama series This Is Us, which also went to Hulu in SVOD. Additionally, Hulu has been active in acquiring streaming rights to broadcast comedy series, including the Golden Girls library.\r\n\r\nThe original eight seasons of Will & Grace ran from 1998-2006, receiving 83 Emmy nominations and 16 wins, including Outstanding Comedy Series in 2000.\r\n\r\n“As we gear up for the launch of the upcoming season premiere, I can’t think of a better way to reintroduce Will & Grace to the cultural zeitgeist than by giving audiences the opportunity to watch this historic and hilarious series wherever and whenever they want,” said NBC Entertainment Chairman Robert Greenblatt. “With its witty comebacks, pop-culture references and social commentary, Will & Grace is one of the most binge-able comedies in television history, and I am certain fans both old and new will jump on this opportunity to devour it.”\r\n\r\n\r\n\r\n\r\n\r\nThe Will & Grace revival starring Eric McCormack, Debra Messing, Sean Hayes and Megan Mullally already has been picked up for a second season with 13 additional episodes. Both the original and new episodes of Will & Grace are written and executive produced by series creators Max Mutchnick and David Kohan, and directed and executive produced by James Burrows.\r\n\r\n“There’s no question that Will & Grace has resonated with audiences since the series made its broadcast premiere,” said Hulu, Chief Content Officer Joel Stillerman. “To be able to bring such an iconic show into the streaming universe for the first time ever is an opportunity we couldn’t pass up. This landmark deal will allow fans to re-watch their favorite moments ahead of the series premiere, as well as bring Will & Grace and its cast of characters to a whole new audience.”", "fb": {"pages": 105558754896}, "onesignal": "wordpress-plugin", "fragment": "!", "og": {"type": "article", "title": "‘Will & Grace’ Lands First-Ever Streaming Deal With Hulu For Old & New Episodes", "url": "https://deadline.com/2017/09/will-grace-first-streaming-deal-hulu-nbc-1202173974/", "description": "As Will & Grace is coming back to NBC for at least two new seasons, the series’ original 194 episodes will be made available for streaming for the first time via a deal with Hulu. The Emm…", "site_name": "Deadline", "image": {"identifier": "https://deadline.com/wp-content/uploads/2017/09/will-and-grace-original-series.jpg?w=928", "width": 928, "height": 523}, "locale": "en_US"}, "article": {"published_time": "2017-09-20T19:30:01+00:00", "modified_time": "2019-09-06T22:21:19+00:00"}, "twitter": {"site": "@DEADLINE", "creator": "@DeadlineNellie", "card": "summary_large_image", "title": "‘Will & Grace’ Lands First-Ever Streaming Deal With Hulu For Old & New Episodes", "description": "Will & Grace' original 194 episodes will be made available for streaming for the first time via a deal with Hulu, which also covers new eps.", "image": "https://deadline.com/wp-content/uploads/2017/09/will-and-grace-original-series.jpg?w=928"}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1505935801.0, "source": "https://deadline.com", "summary": ""}