{"url": "http://www.vulture.com/2017/10/every-harrison-ford-movie-ranked-from-worst-to-best.html", "text": "Photo-Illustration: Vulture\n\nThis article was originally published in 2017 and has been updated to include Harrison Ford’s most recent work.\n\nIn a culture full of celebrities breathlessly competing for our attention, Harrison Ford feels not just like an anachronism but an aberration — the movie star who really, really doesn’t want to be there. This has long been central to his craggy appeal, as he consistently looks miserable doing promotion for his films, even the ones he likes. When GQ profiled him for Blade Runner 2049, the actor summed up his press-tour strategy thusly: “It’s always better not to talk about [the work], I think. Just fucking do it. Don’t ’splain it. Especially if you’re getting away with it.” Ford’s disdain for the mechanics of fame is refreshing and also really funny — he might be the most delightfully grumpy public figure outside of Larry David.\n\nThat real-guy authenticity has always been a major part of Ford’s story; it’s often mentioned that he worked as a carpenter before establishing a film career. But once he focused on acting, he emphasized the nuts-and-bolts precision of his work, eschewing the flamboyant or the self-regarding in order to portray men whose chief objective was to do their job well.\n\nYet ranking Ford’s five decades of film stardom also reveals a core truth: He is not an actor with extraordinary range. That’s not a criticism but, rather, an acknowledgment of something elemental about his technique, which is to deliver performances that are simple and true with no fuss. It’s not that he hasn’t pushed himself, but he seems to understand where his strengths lie and doesn’t fret about his limitations. You never watch a Harrison Ford performance thinking he’s trying to impress you. (Let other, less-confident actors worry about such nonsense.)\n\nBelow is our rundown of Ford’s 37 biggest roles, skipping over the really early stuff (like Journey to Shiloh), the utterly forgettable cameos (good-bye forever, Jimmy Hollywood), and his minor work in Apocalypse Now. What emerges is a career in which he found superstardom early on, parlayed it into years of being a dependable box-office titan, stumbled after the hits stopped coming, and then returned, triumphant, in long-awaited sequels to his biggest films. We tried our best not to overintellectualize a body of work that’s most striking for its immediacy and lack of self-consciousness. As Ford would say, let’s just fucking do it.\n\nThe infamous Expendables 3 poster — which features a truly shocking 16 people on it — had no more uncomfortable (and obviously Photoshopped) participant than Ford, who looks like someone cut out an old Random Hearts publicity shot and spliced it in with the promise that no one would tell Harrison. Ford has just a couple of scenes as a getaway pilot who helps the gang, and he resembles more a Sinatra cameo in an old Bob Hope golf comedy than anything else. Also: Contrary to the chummy nature of these films, there is no way he has ever so much as met Dolph Lundgren.\n\nThere are tired, lazy buddy-cop movies — and then there’s throwing Harrison Ford and Josh Hartnett (during that brief few months of the Hartnett boom) together as homicide cops in Hollywood and then just calling the movie Hollywood Homicide! Ford is supposed to be growly and grizzled, but he can barely muster up the energy to do that. He also looks openly contemptuous of his co-star. Six years earlier he was helping usher Brad Pitt into stardom; here, he does not look amused by the downgrade.\n\nFord’s timeless quality, the sense that he could have been a movie star in roughly any decade since the dawn of sound, only works against him when directors try to surround him with the Trend of the Day; Harrison Ford shouldn’t be wasted in techno espionage thrillers, particularly when it’s obvious he doesn’t entirely understand what’s happening in them. Here, he’s a normal dad who is targeted by identity thieves, namely Paul Bettany’s nasty hacker. While it’s briefly funny to watch Ford try to figure out what online identity theft is, alas, Firewall is not a comedy.\n\nFord can obviously play romantic leads — half our friends have based their relationships on Han and Leia — but you have to give him some sort of edge. He can’t just be a bland, Rock Hudson–type; he needs to be resisting your urge to foist easy sentiment upon him. Peter Hyams tried to make Ford the conventional-hero type in this World War II–era romance, but that hat doesn’t fit. You can see Ford wincing every time he has to whisper a platitude. This was one of his first post–Han Solo roles, and precisely the sort of part he’d be (mostly) smarter about avoiding as his career went on.\n\nThis Jon Favreau misfire seemed to have a can’t-miss, genre-melding premise, mixing science fiction with the Western (based on the 2006 graphic novel) and bringing together red-hot star Daniel Craig and beloved, aging icon Harrison Ford. But Cowboys & Aliens never quite comes to life, and that goes double for Ford as the cattleman Dolarhyde: We seem more excited that he’s in the movie than he does. This was a distressing tendency in Ford performances at this time — the goodwill extended to him from an adoring audience wasn’t rewarded with anything resembling wit or real effort — and the whole movie seems to slowly collapse in on itself in response.\n\nDid you know that one of the first films to try to tackle Vietnam-era PTSD was a romance with Henry Winkler and Sally Field? It is to the movie’s credit that it tried to voice something that was happening that few were willing to tackle at that time, but that doesn’t make this Fonz–Flying Nun pairing work any better. Winkler does his best, but he just doesn’t have the gravitas to make this unconventional casting sing. Ford has a supporting role, one of his first post–Han Solo parts, as one of Winkler’s war buddies struggling to reintegrate in society, and the movie only stirs to life when he shows up. And then, only barely.\n\nOf all the odd pairings throughout Ford’s career — Josh Hartnett, the Fonz, Jewish rabbis in the old West, Ewoks — Brendan Fraser might be the most stilted. Fraser’s doofus-y blank face essentially requires his co-stars to do all the work and, uh … ain’t no way Ford’s working that hard. This earnest, cheesy real-life drama concerns parents (Fraser and Keri Russell) who try to start a biotech company off the research of a genius doctor (Ford) to save their son. The film is well-intentioned but dull, and Ford gives one of us “point a finger and grumble” performances that mostly looks like a guy ready to get home for the night.\n\nGood news: Ford and his Air Force One nemesis Gary Oldman reunited in this corporate thriller. Bad news: Paranoia sank without a trace, and deservedly so. Ford plays Jock Goddard, a name that clearly indicates he’s a shifty tech genius, who takes hotshot inventor Adam Cassidy (Liam Hemsworth) under his wing — not realizing that he’s actually working undercover for Goddard’s rival Nicholas Wyatt (Oldman). Business ethics and airport-novel pulp collide, and the mistake everybody in Paranoia makes is taking this nonsense seriously. Ford is perfectly respectable as an aloof guru, but he needn’t have bothered — this is the type of role any aging C-movie star could have done.\n\nA sequel to The Guns of Navarone — which came out when Ford was 18 years old — this British war film is mostly uninspired, stiff-upper-lip, moderate entertainment that you’d comfortably doze off to in your grandfather’s study while sucking on Werther’s Originals. But it is worth noting how comfortable and commanding Ford is, just a year after Star Wars, effortlessly stealing the screen from more experienced actors like Robert Shaw, Franco Nero, Richard Kiel, and Edward Fox. The movie isn’t worth thinking much about, but watch how young and magnetic Ford is here, as usual, without trying very hard.\n\nTalking about his one-scene cameo in the Anchorman sequel, in which he plays a network head who fires Ron Burgundy, Ford admitted, “It’s easy enough to cut out. It’s not critical.” (This was also the same interview in which he described the shoot as “bizarre” and referred to his scene partners as “what’s his name and the applesauce girl.”) The fact that Ford looks entirely uncomfortable in Anchorman 2 — like inviting your grumpy grandpa onstage to do improv — is what helps make the scene so funny. When he dresses down Burgundy, he looks legitimately mad — as if he’s not even sure why the hell he’s there.\n\nDesperate for any reason to get excited to see their star in a new film, Ford fans were hopeful about Ender’s Game, the actor’s first pure sci-fi movie since Return of the Jedi. The film was a commercial disappointment. (Based on the Orson Scott Card book, it was one of several YA adaptations that Hollywood launched in the hopes of snagging some of that Hunger Games audience.) Ford’s actually relatively locked-in as the gruff but supportive Colonel Graff training the impressionable Ender (Asa Butterfield), who has to save the universe as all lads in these types of films tend to do. Still, on all fronts, this is far, far away from Star Wars.\n\nThe question “Should Harrison Ford ever do an accent?” is answered definitely “no” in this otherwise perfectly fine and straightforward war thriller. Ford plays a Russian submarine captain who deals with a radiation leak with officers Liam Neeson and Peter Sarsgaard. It’s a serviceable action film — with Kathryn Bigelow honing her chops a few years before breaking through with The Hurt Locker and Zero Dark Thirty — but seriously, Ford’s accent is pretty terrible. We don’t mean to be accent cops here, but man, if you’re ranking Harrison Ford performances, you really have to put the film in which Ford does a terrible Russian accent for two hours pretty low.\n\nThis political romantic thriller features Ford as a police sergeant who discovers that his wife has perished in a plane crash alongside the man with whom she was having an affair. That man’s wife turns out to be a congresswoman (Kristin Scott Thomas), with whom he begins an affair of his own. There’s some good stuff to be found in this Sydney Pollack film — first and foremost is the chemistry between Ford and Thomas — but the movie never finds its focus and completely falls apart by the end. It’s also sort of hilarious that even when Ford is in a movie about two grieving spouses who have a torrid affair with each other, he still plays a cop.\n\nPerhaps Ford’s most memorable role this century was the one he turned down. Initially, he was going to play the judge turned drug czar part in the Oscar-winning Traffic that ultimately went to Michael Douglas. (According to Steven Soderbergh, “[H]e said, ‘I don’t feel like this is what I want to do right now.’ I wished it were otherwise, but I’m a big believer in instinct. If something’s holding him, do you want an actor on the set who doesn’t want to be there?”) It’s impossible to watch Crossing Over, an ensemble examination of America’s labyrinthine illegal-immigration problem that came out nine years later, and not think of it as Ford’s belated attempt to find a Traffic-like project. Unfortunately, it doesn’t come close, and Ford’s stoic turn as an honorable ICE agent gets bogged down in the same disaffected, growly mannerisms that have hindered a lot of his recent performances. The movie’s greatest poignancy comes from the sense of what might have been if Ford had just yes to Soderbergh.\n\nAnother recent Ford project that should have been way more delightful, Morning Glory stars Rachel McAdams as a perky TV producer who has to revive the fortunes of a fading morning show called DayBreak. Ford is the network’s pompous, has-been news anchor Mike Pomeroy who’s forced to work alongside Diane Keaton’s DayBreak host — a fate he considers humiliating since he fancies himself a serious journalist. But the lightness Ford used to wield seems to have atrophied over time: Pomeroy is such a drip that he’s rarely adorably cranky. The result is that you want to actively shake the man and tell him, “Lighten up, dude — movies are supposed to be pleasurable.”\n\nFord has never done much straight comedy, even though he has a nice touch; his comedic sensibility is typically limited to “sending up your traditional Harrison Ford characters.” Which is why this goofy Gene Wilder comedy — in which a Polish rabbi has to travel in the Old West — is a little more enjoyable than it should be. He has fun with it! But there’s only so much fun you can have in this hackneyed of a story — this has to set a record for “oy gevalt!” jokes involving a cow — but Ford and Gene Wilder are a surprisingly potent comic team. You wish he would have tried stuff like this a little more often.\n\nAt the time, this wasn’t a Harrison Ford action/romantic comedy. It was, instead, the Anne Heche Is a Lesbian in a Straight Romantic Comedy Movie, which led to a frankly rather embarrassing press tour, in which a series of men on talk shows asked Ford whether it was weird to pretend to be in love with a lesbian. (Ford, to his credit or to his detriment, did not point out that he was not, in fact, in love with every woman he kissed in a movie. They were just acting.) The movie itself is a rehash of every other romantic comedy ever made, but Heche and Ford have a nice chemistry, for a guy who’s nearly 30 years old than his co-star. Amusingly, the actor playing Heche’s boyfriend at the beginning of the film is David Schwimmer; if you’re David Schwimmer and your girlfriend is hanging out with Harrison Ford, you should know that you’re going to lose that girlfriend by the time the movie ends.\n\nIf you’re going to remake Jack London’s Call of the Wild with a cartoon dog — and ol’ Buck here is just one click away from a computer-generated Scooby-Doo — you need something as solid and real as granite to serve as your foundation. Enter Ford, with a prospector’s beard, playing, at last, a prospector: He’s as growly and cantankerous as ever, but he also seems legitimately invested in this dog and this movie. He even has some affecting moments as a man trying to run away from his past before realizing what his purpose ultimately was for. This is probably wasted effort in a movie about a cartoon dog from the guy who made The Croods, but there’s enough here to think Ford may have one truly great performance left in him — though opposite a person this time, please.\n\nEither by choice or because it was dictated by audience indifference, Ford had stopped doing leading roles around the time of 42, becoming a grizzled character actor that would lend a little old-school star power to a project. This biopic of Jackie Robinson (Chadwick Boseman) is pretty paint-by-numbers, reducing an inspirational and supremely talented ballplayer to feel-good Hollywood formula. Still, it’s a solidly generic drama, which you could also say of Ford’s performance as Brooklyn Dodgers exec Branch Rickey, who signs Robinson, making him the first African-American in Major League Baseball. In an earlier age, Wilford Brimley would have played this role, and Ford makes the character a cigar-chompin’, cranky moral compass, shielding Robinson from racists within baseball and out in the wider world while offering the kid lots of tough-love advice. For once, Ford’s latter-day one-note tone actually makes sense — Rickey is a tough son of a bitch who isn’t going to let anyone tell him what to do — and he has a ball chewing a little scenery.\n\nFord teams with Brad Pitt in a drama about a New York City cop (Ford) who takes in an IRA freedom fighter (Pitt) without realizing his political affiliations, and the complications that arise. The movie is only sort of fine — it’s not the best way to prime yourself on the complexities of the IRA, we’ll put it that way — but more than anything, it feels like Ford passing the leading-man baton to Pitt: They have an edgy, watchable chemistry together that is almost like a movie-star-off. Ford wins, but Pitt would live to battle another day.\n\nHere’s a brief warning about spoilers for a movie that’s 17 years old … okay, now that that’s over, here’s something Ford only did once that he probably should have done more often: played a full-on villain. He and wife Michelle Pfeiffer are being haunted in their comfortable Connecticut home by … something. It turns out that Harrison Ford’s husband has a secret that he’ll do anything to protect. This leads to a finale in which, if you can believe it, our heroine is running from Harrison Ford, who’s trying to kill her. Ford’s menacing, but in a directed-by–Robert Zemeckis way. He’s threatening, but not palpably. It’s a good effort, though. We’d love to see Ford as a full-on crazy, ranting villain someday. It might not work, but it’d be something to watch.\n\nThis fantasy/tearjerker about a woman (Blake Lively) who can’t age never quite lives up to its potential, which makes it even odder that it contains one of Ford’s most moving performances of the last ten years. He plays a man named William Jones — no relation to Indiana — who’s the father of Lively’s boyfriend. But as soon as Adaline and William meet, he realizes this is the same woman who captured his heart so long ago, before she had to abandon him, lest he learn her secret. The Age of Adaline is fluffy nonsense about fate and unrequited love, but Ford captures all the pain of a man who grew up, settled into a life, then rediscovers the one person who once gave it such meaning. As a romantic figure, the actor tends to be more of a swashbuckler than a sensitive soul, but this was one of those rewarding exceptions. And it’s also one of the rare times this century where he elevates the material rather than playing down to it.\n\nFord hasn’t played a lot of nerds, which may be why he’s so surprising in this remake of the Billy Wilder romance. As Linus, the straight-laced brother of Greg Kinnear’s jet-setter, Ford finds just the right groove, playing the character with a charming shyness. On one level, Sabrina is an utterly predictable rom-com — even if you haven’t seen the original, you can tell where this one is going — but Linus’s courting of the sophisticated, ethereal Sabrina (Julia Ormond) makes all the clichés go down smoothly. Sure, he’s just another Heartless Businessman Who Needs to Learn How to Love, but Ford makes that transition organic, even touching. Sabrina is the action hero in heartthrob mode, and here it suits him.\n\nRegarding Henry is a simplistic, rather mawkish story about a hotshot lawyer (Ford) who suffers brain damage after being caught in the crossfire of a bodega robbery and has to learn how to reconnect with his wife (Annette Bening) and his family. The movie itself takes a lot of short cuts, but Ford never does: It’s sort of exciting to watch him being this uncomfortable and open. Ford doesn’t push himself a lot, and he doesn’t have to, but when he does, it can be fascinating to watch. And the scene where he is shot (by John Leguizamo!) sticks in the memory 25-plus years later.\n\nThis Francis Ford Coppola thriller was still early in Ford’s career, and initially he auditioned to play one of the two lovers Gene Hackman’s surveillance specialist is supposed to record. That part went to Frederic Forrest; instead, Ford essentially talked himself into a tiny but meaningful role as the assistant to Hackman’s mysterious employer. Playing the ominous Martin Stett, Ford envisioned the character as gay and came up with the character’s flannel-suit attire. (Coppola reportedly initially responded to the bold choice by barking, “Jesus Christ, what the hell are you?”) But Martin’s menace helps add another dimension to a film already rippling with paranoia — early Ford was quite adept at convincing you not to mess with his edgy characters.\n\nDid Alec Baldwin botch the negotiations to continue playing Jack Ryan after The Hunt for Red October, or did Paramount want to replace him with Ford, a much bigger name? Only those involved know, but the switch of stars fundamentally changed the conception of this character: No longer was he a wonky, brilliant underdog — now, he was Harrison Ford, action hero. Patriot Games and Clear and Present Danger were as close as the actor got to his own Bond franchise, and he invests the role with plenty of macho urgency and patriotic fervor. There’s a dryness to these movies — a let’s-get-the-job-done simplicity — that’s refreshing but also doesn’t make them very memorable. But in Ford’s heyday, that was kind of the idea: He made mature blockbusters at a time when adults would actually go see them.\n\nMelanie Griffith is so delightful and fantastic in this movie that it looked briefly like she was going to be the biggest movie star in the world. That quality rubs off on Ford, who is loose, funny, and even a little sexy as the stuffy executive caught in Griffith’s orbit. Not all the gender politics might hold up today, but the message is still a strong one, and the movie is funny, sharp, and willing to get its hands a little dirty. (Even if that title is not so great.) And check out the supporting cast on this thing: Sigourney Weaver, Alec Baldwin, Kevin Spacey, Joan Cusack, Oliver Platt, Olympia Dukakis, and a pre-X-Files David Duchovny.\n\nAs U.S. president James Marshall, Ford reached the zenith of his America’s Most Trusted Action Star era. Air Force One might be the 1990’s most surefire elevator pitch: “Okay, so the American president is taken hostage on Air Force One, right? But, it’s Harrison Ford, so that means he can kick ass and throw a punch and bark a perfect one-liner while doing it!” This perfectly rollicking thriller is pretty disposable but, in hindsight, also kinda poignant. No one knew it at the time, but Air Force One was the end of the actor’s box-office dominance: Never again would he be the reliable purveyor of top-flight, bare-knuckle action movies enlivened by his grit and rugged, no-bullshit charm. In Air Force One, he’s a total studio pro, selling us a Die Hard knockoff like it’s no big thing.\n\nFord has a heavy, sharp, almost dangerous anger in this adaptation of Scott Turow’s best seller about a Chicago lawyer (Ford) accused of murdering his co-worker mistress (Greta Scacchi) and having to go on trial facing the very lawyers he’s worked with for decades. The movie is all shadows and sinister implications, both believing in the court system it dramatizes while remaining deeply skeptical of it. Ford is a man of privilege in the film, one with his own guilt, but he’s also a smart survivor. It’s a tricky performance, and he navigates it perfectly. This film also features the best Ford sex scene ever, for what it’s worth.\n\n8. Rick Deckard in the Blade Runner movies (1982, 2017)\n\nUnlike his other recent sequels, Blade Runner 2049 doesn’t just feel like Ford rehashing a beloved, iconic character. The Rick Deckard we met in 1982’s Blade Runner was a taciturn, pessimistic cop who, almost despite himself, fell in love with a replicant (Sean Young) — discovering along the way that he was a replicant, too. (Of course, it always seemed perfectly Ford-ian that the actor repeatedly argued that his character wasn’t an android, while director Ridley Scott always believed he was.) Set 30 years later, 2049 gives us a seemingly similar Deckard, but one who has been changed by circumstances we’re not going to spoil here. If the first film gave Ford a chance to do his version of a noir detective — all snarling and brooding — then 2049 is where he gets to play a character who’s lost so much of that piss and vinegar, haunted by tragedy, and perhaps finally able to earn a little redemption. In other words, the Blade Runner films are his one franchise where he gets to try on the character in a new way, rather than just putting on the old suit one more time.\n\nFord isn’t known for working with adventurous, daring directors — he’s always been a Hollywood system guy — but he threw caution to the wind to work with Roman Polanski in this thriller about an American in France who comes out of the shower in his hotel room to find his wife missing … and his desperate attempts to find her. Ford isn’t Polanski’s type of actor, but they work perfectly together here; there’s genuine fear and panic in Ford’s eyes that we’ve never seen in any other movie. Ford’s probably too old to try anything this risky again, but we’re glad that, at the peak of his powers and bankability, he did so here.\n\nBecause Ford is notorious for his grumpiness, it can be easy to forget how magnetic the guy’s smile is. It’s the first thing you notice about Bob Falfa, the cocky hot-rodder who’s the ostensible villain in American Graffiti. Ford plays him as that one older kid that always tormented you in school — not by beating you up, but by just letting you know that he had your number. Falfa is hardly a complex role, but the youthful arrogance of the character is so convincingly, joyfully portrayed that it’s easily one of the most ebullient of Ford’s career. And unlike so many bullies, Falfa gets his comeuppance in the end.\n\nWith each passing year, The Fugitive feels more and more like a Hollywood anomaly. A chase picture with almost no action in it? A summer blockbuster that’s really a cat-and-mouse game between two well-developed adversaries? And a box-office titan that also gets incredible reviews and plenty of Oscar nominations? To all this, add the fact that it may be the one big Ford movie in which he’s underrated. His Richard Kimble doesn’t have the derring-do of Indiana Jones or Han Solo, but he’s a smart, grieving man who has to stay one step ahead of the authorities while trying to track down the man who killed his wife. Director Andrew Davis wanted to make a grown-up popcorn film that was grounded in realism, and in the early ’90s there was no star more empathetic and gruffly compelling than Ford. Tommy Lee Jones (a no-nonsense pro in his own right) won the Oscar, but Ford was just as riveting, giving us a wronged character who won’t rest until he finds justice. How could anyone doubt that he’d succeed?\n\nFord earned his lone Oscar nomination — how can he have only one? — for this Peter Weir thriller about a tough Philly cop (Ford) who must go into an Amish community to protect a boy (Lukas Haas) who witnessed a murder. Ford is his usual tough-guy cop, but there’s a sensitivity, a wounded heart, to his character that comes out most powerfully in his chaste love affair with an Amish woman played by Kelly McGillis. This is ’80s-thriller Ford at his best, using the parameters of a cop thriller to tell a larger story about dislocation and trying to find your place in the world. It is also as kind to the Amish characters as it is to those who are not. It’s a terrific little movie that you may have forgotten about, but it holds up magnificently.\n\nMany actors have that one tough, ambitious project into which they put their heart and soul, only to have the film be rejected by audiences and critics alike. For Ford, that movie is this stunning Peter Weir drama (the pair’s follow-up to the acclaimed Witness), based on the Paul Theroux novel about an arrogant radical who pulls his family out of conventional society to start over in the Central American jungles. The Mosquito Coast is an utterly unlovable, uncompromising movie about a monster who will bring ruin to all those around him — especially his son, played brilliantly by River Phoenix — and Ford allows not a whiff of empathy into his portrayal. His Allie Fox is one of those nightmarish American individualists you occasionally see at the movies — foolhardy men laid low by their own vainglory — and it’s extraordinary to see a movie star who, at the time, was best known for Han Solo and Indiana Jones go so dark. It’s a performance that never asks to be admired for its daring, which only makes it all the more exceptional. Later, Ford shot back at its detractors: “I have never seen a serious film treated so badly by the critics,” he said. “And I think they’re wrong.” We’re with him.\n\n2. Han Solo in the Star Wars movies (1977, 1980, 1983, 2016)\n\nThere are many reasons to love Han Solo. He’s a scoundrel. He’s good with a blaster. He’s secretly a softie. But as the years go on, Han Solo has developed another undeniable appeal: We all know that, deep down, Ford kinda hates the character. Okay, maybe “hate” is too strong a word, but the role that made him a household name is one he’s never entirely embraced. Famously pitching George Lucas on the idea of killing Han off in Return of the Jedi, Ford has long expressed his displeasure at the filmmaker’s wooden dialogue, memorably howling at Lucas during Star Wars’ shoot, “You can type this shit, but you can’t say it.” (“It was a joke, at the time,” Ford insisted this year. “A stress-relieving joke.”) Deep down, we’ve always suspected the reason why Ford has never fully cottoned to Solo is that, well, the guy is a bit of an asshole: a youngish actor’s snarky envisioning of what a cartoonish space cowboy would be like. Regardless, Han Solo has emerged as one of the quintessential cinematic guy role models of the last half-century. He’s more relatable than James Bond. He’s more ordinary than a comic-book superhero. And he’s a lot funnier than the Man With No Name. If Ford was putting his tongue in his cheek the whole time, we all chose not to notice — and when Solo finally did perish in The Force Awakens, it was like a death in the family for Fanboy Nation.\n\n1. Indiana Jones in the Indiana Jones movies (1981, 1984, 1989, 2008)\n\nSam Elliott, Christopher Guest, David Hasselhoff, Tom Selleck: These were some of the men considered to play the globetrotting archaeologist who’s an artist with a bullwhip but harbors a deathly fear of snakes. While Han Solo is aloof, snide, and brooding, Indiana Jones is warm, beleaguered, and funnier. In truth, Ford doesn’t play the two characters that differently, but the actor’s affection for Indy has always tipped his hand in terms of which one he favors. He perfected the role with Raiders of the Lost Ark, crafting an old-school-serial action hero for a modern age, wearing the contradictions with ease. In Indiana Jones and the Temple of Doom, he’s broader in his humor but also darker during the film’s still-scary second half. (That scene where he succumbs to that voodoo potion remains really unsettling.) With The Last Crusade, he leans into the franchise’s gentle self-parody and plays an excellently disgruntled straight man to Sean Connery as his droll dad. As for Kingdom of the Crystal Skull … that movie is terrible in so, so many ways, but it can’t entirely diminish the appeal of seeing a graying Indy once again facing off against evil. Ford has always been the Everyman of movie stars — with Indiana Jones, he found the no-fuss, can-do role to perfectly embody his ethos.", "images": ["http://www.vulture.com/media/components/customer-alert-banner/double_chevron.svg", "https://pyxis.nymag.com/v1/imgs/e33/6e7/aed044d06bd5c293490430f400dc112e41-2022Cov4x5-AsianAmericaPkg.w240.jpg", "https://pyxis.nymag.com/v1/imgs/31a/165/7b2cda49d5258316afceb071e56d8d3a8b-women-3.2x.rsquare-zoom.w75.jpg", "http://www.vulture.com/media/components/customer-alert-banner/close_x.svg", "http://www.vulture.com/media/components/customer-alert-banner/alert.svg", "https://pyxis.nymag.com/v1/imgs/5ea/81e/4d3b39a96107c321338c0c9a25557bd47f-zarifa-ghafari.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/c32/3bf/0a393283dc1f3f9257ff8b361ea03216c8-russia-missile.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/ed1/839/5b2d0651d961a10178b413f54fdb0ea318-03-harrison-ford-ranking.rsquare.w700.jpg", "https://pyxis.nymag.com/v1/imgs/ed1/839/5b2d0651d961a10178b413f54fdb0ea318-03-harrison-ford-ranking.1x.rsocial.w1200.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/ed1/839/5b2d0651d961a10178b413f54fdb0ea318-03-harrison-ford-ranking.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Will Leitch", "Tim Grierson"], "canonical_link": "https://www.vulture.com/article/best-harrison-ford-movies-ranked.html", "title": "Best Harrison Ford Movies, Ranked From Worst to Best", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "parsely-tags": "harrison ford, blade runner, indiana jones, star wars, rankings, vulture lists, lists, movies, vulture picks, call of the wild, featuretype:list or roundup", "og": {"title": "Every Harrison Ford Movie, Ranked", "url": "https://www.vulture.com/article/best-harrison-ford-movies-ranked.html", "description": "We evaluate everything from American Graffiti to Indiana Jones.", "image": "https://pyxis.nymag.com/v1/imgs/ed1/839/5b2d0651d961a10178b413f54fdb0ea318-03-harrison-ford-ranking.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Every Harrison Ford Movie, Ranked", "description": "We evaluate everything from American Graffiti to Indiana Jones.", "image": "https://pyxis.nymag.com/v1/imgs/ed1/839/5b2d0651d961a10178b413f54fdb0ea318-03-harrison-ford-ranking.2x.rsocial.w600.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2020-02-24T12:00:00.000-05:00", "tag": "harrison ford, blade runner, indiana jones, star wars, rankings, vulture lists, lists, movies, vulture picks, call of the wild", "publisher": "https://www.facebook.com/Vulture"}, "description": "We evaluate everything from the Ford’s career, from American Graffiti to Indiana Jones, to present the best Harrison Ford Movies, ranked.", "robots": "max-image-preview:large", "sailthru.tags": "harrison ford, blade runner, indiana jones, star wars, rankings, vulture lists, lists, movies, vulture picks, call of the wild", "author": "Will Leitch, Tim Grierson", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://assets.nymag.com/media/sites/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1582563600.0, "source": "http://www.vulture.com", "summary": ""}