{"url": "https://en.wikipedia.org/wiki/Jamie_Anderson_(snowboarder)", "text": "American professional snowboarder\n\nJamie Louise Anderson (born September 13, 1990) is an American professional snowboarder. She won the gold medal in the inaugural Women's Slopestyle Event at the 2014 Winter Olympics in Sochi, Russia and repeated the feat at the 2018 Winter Olympics in Pyeongchang, South Korea, making her the first female snowboarder to win more than one Olympic gold medal.[1][2][3] She has won gold medals in slopestyle at the Winter X Games in consecutive years in 2007/8 and 2012/3. She has 25 total medals:[4] eighteen gold, five silver, and two bronze.\n\nPersonal life [ edit ]\n\nAnderson was born and raised in South Lake Tahoe, California, the fifth of eight children. She snowboarded for the first time at age nine, and immediately fell in love with the sport. Anderson was homeschooled at Visions in Education, allowing her to spend almost every day on the mountains.[5][6]\n\nAnderson currently resides in Whistler, British Columbia, Canada with her fiance, Tyler Nicholson, a Canadian snowboarder. She met Nicholson at a bar at Whistler, and they've been together since 2015. She also owns The Dream Inn, a private residence suite that overlooks Whistler Blackcomb Ski Resort and other private places in Tahoe and Colorado.\n\nAside from snowboarding, Anderson does yoga and meditation to keep her healthy for her upcoming competitions.[7] She is also a member of the POW's Athlete Alliance & an ambassador for Protect Our Winters.\n\nCareer [ edit ]\n\nAnderson has built a reputation as one of the top slopestyle riders in the business.[6][8] She has been one of the most successful female snowboarders on the Swatch TTR World Snowboard Tour and took home the gold medal in the Olympic debut of women's snowboard slopestyle at the 2014 Sochi Winter Olympic Games.\n\nIn addition to her many career wins, Anderson has been giving back to the snowboarding community through participation in the High Cascade Snowboard Camp.[9] She has hosted a Signature Session™ at High Cascade in 2009–2012 and is scheduled to host another Signature Session™ camp in 2014.\n\nAnderson began snowboarding in 2000, when she received a hand-me-down snowboard at the age of nine, and qualified for the 2004 Winter X Games just four years later. In 2005, she took home a bronze, becoming the youngest female medalist in the competition at age 15.\n\nThrough the Jamie Anderson Foundation[10] established in 2013, she has provided more than 30 young winter sports athletes with equipment, clothing, season passes and financial backing for travel to the USASA national competitions.\n\nDuring the 2006–2007 season, Anderson won the TTR 6Star Burton US Open Snowboarding Championships slopestyle, and the Roxy Chicken Jam emporium in Kaprun, Austria, the quarterpipe event at the O'Neill Evolution in Davos, the Billabong slopestyle Jam and the Abominable Snow man.\n\nWith impressive[neutrality is disputed] results at all major events on the TTR World Snowboard Tour in 2007–2008, among those victories at the Burton European Open slopestyle and the Roxy Chicken Jam US slopestyle, she took home the Women's Swatch TTR World Snowboard Tour Champion title.[11]\n\nEvent Star Tier Format Position Garnier Fructis Australian Open 5star SS 1 Roxy Chicken Jam Europe 6Star SS 2 Burton European Open 6Star SS 1 Nissan X-Trail Nippon Open 5Star SS 2 Chevy Grand Prix 5Star SS 3 Burton US Open 6Star SS 2 Roxy Chicken Jam US 6Star SS 1\n\nAnderson started off the season with the first half pipe victory of her career with a win in both the slopestyle and halfpipe events of the 5-Star Burton New Zealand Open. After her successful start and after leading the rankings for over 40 weeks, Anderson finished the season in third place on the Swatch TTR Tour due to injury.[12]\n\nEvent Star Tier Format Position Burton New Zealand Open 5star SS 1 Burton New Zealand Open 5Star HP 1 Billabong Snowstock 3Star BA 1 Burton Australian Open 5Star HP 3 Burton Australian Open 5Star SS 1 Burton European Open 6Star SS 1 Nissan X-Trail Nippon Open 5Star SS 2\n\nAgain, there was another promising kick-off for Anderson on the TTR World Tour with a win at the 5-Star Burton New Zealand Open slopestyle and the 3Star Billabong Bro Down in Australia. Anderson continued her season with good results from the Winter Dew Tour, finishing off the season in the lead of the Winter Dew Tour Cup Standings.\n\nAnderson then returned to the TTR Tour and took home the Roxy Chicken Jam US slopestyle title and podium finish at the Burton US Open slopestyle. She ended her season in world no. 5[clarification needed] on the Swatch TTR World Tour. Anderson ended her season in the no. 1 spot on the Swatch TTR World Tour.\n\nAnderson won an Olympic gold medal, the first ever offered in slopestyle, at the 2014 Winter Olympics in Sochi, Russia.[13][14]\n\nAnderson won her second Olympic gold medal at the 2018 Olympic games in PyeongChang, South Korea. She also won a silver in the big air event. This was the second time slopestyle had been offered in the Olympics, making it so Anderson has won both gold medals in the slopestyle in Olympic history, and making her the first female snowboarder to win more than one Olympic gold medal.\n\nAnderson won a bronze medal in the big air event at the 2019 Winter X Games Aspen.[15] She also participated the 2019 FIS Snowboard World Championships where she won a bronze medal and denounced the FIS President Gian-Franco Kasper in response to an article from Deadspin, where Kasper \"denied the existence of climate change and spoke disparagingly about immigrants and lauded the ease of working with dictators to organize Olympic Games.\" Her winnings in that event were donated to Protect Our Winters and on her Instagram post, she urged her fellow competitors to do the same thing.[16] In 2020, she won a gold medal in the slopestyle event at the 2020 Burton US Open and at the 2020 Winter X Games Aspen, where she became the most-medaled female competitor in the history of X Games.[17]\n\nTelevision appearances [ edit ]\n\nIn 2015, Anderson competed on the seventh season of The Celebrity Apprentice for her charity, Protect Our Winters.[18] She was fired in the fourth episode.\n\nIn April 2018, Anderson was announced as one of the celebrities who will compete on season 26 of Dancing with the Stars. She was partnered with professional dancer Artem Chigvintsev.[19] She was eliminated on the first episode, and she finished in 9th place.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Blue_pencil.svg/10px-Blue_pencil.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/22px-Flag_of_the_United_States.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Flag_of_Austria.svg/22px-Flag_of_Austria.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/22px-Flag_of_France.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b9/Flag_of_Australia.svg/22px-Flag_of_Australia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/22px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Olympic_rings_without_rims.svg/30px-Olympic_rings_without_rims.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/22px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/22px-Flag_of_Germany.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Jamie_Anderson.JPG/220px-Jamie_Anderson.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Bronze_medal_icon_%28B_initial%29.svg/16px-Bronze_medal_icon_%28B_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Flag_of_the_Netherlands.svg/22px-Flag_of_the_Netherlands.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Flag_of_the_Czech_Republic.svg/22px-Flag_of_the_Czech_Republic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Silver_medal_icon_%28S_initial%29.svg/16px-Silver_medal_icon_%28S_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Flag_of_New_Zealand.svg/22px-Flag_of_New_Zealand.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Flag_of_Switzerland.svg/16px-Flag_of_Switzerland.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/3/39/Jamie_Anderson.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Gold_medal_icon_%28G_initial%29.svg/16px-Gold_medal_icon_%28G_initial%29.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/39/Jamie_Anderson.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jamie_Anderson_(snowboarder)", "title": "Jamie Anderson (snowboarder)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Jamie_Anderson.JPG/640px-Jamie_Anderson.JPG", "width": 640, "height": 1212}, "title": "Jamie Anderson (snowboarder) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}