{"url": "https://www.huffingtonpost.com/entry/bachelor-in-paradise-accidental-rom-com_us_5b995ccbe4b0cf7b00461319", "text": "Joe Amabile and Kendall Long on “Bachelor in Paradise.” ABC\n\nPraise Chris Harrison, “Bachelor in Paradise” has finally come to an end ― and in the process, it maybe sorta blew up its usual rose-scattered path to happily ever after.\n\nThe finale and taped reunion show were a maelstrom of breakups, proposals, make-ups and dumpings on and off camera. Two couples who broke up on the beach in “Paradise” reunited onstage. One couple who left triumphantly, roses in hand, ended their relationship in brutal fashion on Harrison’s couch. Another couple who got engaged during the finale appeared on the reunion show as a glittering, happy pair and even announced a wedding date, but many viewers had already learned of allegations that she had been cheating on her new fiancé since the beginning. (By this afternoon, they had broken up.) The final engaged couple remained together ― status quo maintained.\n\nAdvertisement\n\nAs “Paradise” wound to a conclusion, there were ― as always ― some genuinely touching love stories. They just weren’t the ones that unfolded as expected on the beach.\n\n“Bachelor” shows, at their most successful, deliver romances that are almost anti-narrative and yet somehow make them compelling. Imagine a movie, for example, in which a man is dating two women. He cares for them both. They each want an exclusive commitment. Finally, he chooses one of them, and they get engaged and live happily ever after. Even Hallmark wouldn’t air a rom-com with this little narrative tension.\n\nThe reason romantic comedies are so highly watchable is that they follow a familiar arc that still integrates conflict. You know that a couple will face adversity and probably part ways for a time but in the end will find their way back to each other. Thus the narrative is both interesting to watch and the movie equivalent of comfort food. The conclusion is predetermined, but the varied journeys are what keep us coming back for more.\n\nKevin Wendt and Astrid Loch, between boy meets girl and boy loses girl. ABC\n\nAdvertisement\n\nAt first, the looser format of “Bachelor in Paradise” allowed for more twists ― surprise engagements, mini breakups and reunions (thanks, Carly and Evan) — and all the spice you might expect from Nancy Meyers or a New York Times Vows column. But slowly and surely, it has become calcified into an influencer couple factory, with each contestant vying to be the next Jade or Tanner, one half of a lucrative marriage-cum-business.\n\nThe clearer the path to domestic and professional bliss, the more cookie-cutter and camera-ready the relationships seem ― and the more questionable the actual love behind them. When Jordan Kimball and Jenna Cooper got engaged during the finale, it could have been a tear-jerking romantic scene. Instead, it felt a little canned, especially because dogged reporter Reality Steve had just posted texts allegedly from Jenna to another man she was said to be seeing, in which she appeared to swear she didn’t even like Jordan and would make up a story to smear him so she could end the relationship. She needed to be engaged to Jordan, she allegedly told the source, because it would help her business.\n\nThough Kamil Nicalek and Annaliese Puccini didn’t leave “Paradise” affianced, they did commit to their relationship in a final rose ceremony. Annaliese, eager for her happy ending, seemed convinced that they were headed to the altar regardless; Kamil expressed doubts in confessional tapings but played along with the love story ― right up until he sat down next to a glowing Annaliese on the reunion show, whipped out a shiv and stabbed her in the heart (metaphorically). Their soft-focus declaration of love quickly gave way to grimy reality: a sleazy dude humiliating his girlfriend by dumping her in the most public way possible.\n\nThe “Bachelor” audience is cued to respond most favorably to couples who follow that aforementioned franchise-approved path to love ― dating, opening up, falling in love, getting engaged (all on camera, of course) and then cruising into coupled Instagram fame. But the final rose exchanges on Tuesday night brought no tears to our eyes, though the still extant engagement between Chris Randone and Krystal Nielsen was sweet and perhaps even sincere. Through no fault of theirs, the most compelling love stories of “Paradise” were those that took a more winding, interesting and — dare we say — real road to get there.\n\nBefore the season’s last rose ceremony, fan favorites Joe Amabile and Kendall Long heartwrenchingly parted ways after he expressed that he was completely in love with her and she couldn’t fully reciprocate in the moment. Kendall was left sobbing on the beach while Joe took himself out of paradise. Less than a day later, Kevin Wendt and Astrid Loch broke up on the beach during a tear-filled conversation during which he said that something in the relationship just “wasn’t sitting right” but he couldn’t quite articulate what that missing thing might be.\n\nAdvertisement\n\nThese two couples were the longest-standing ones of the season, and their breakups made even the most jaded in the “Bachelor” audience feel something more than curiosity about what the couples’ first sponsored ad might be. (Diff Eyewear? Sugar Bear Hair? Shit-Your-Brains-Out-to-Get-Thin Tea? The possibilities are endless.) Their breakups, in the universe of the show, were failures of love, commitment and romance.\n\nIn the end, Kevin and Astrid and Joe and Kendall found their way back to each other, mostly off camera. Producers captured a short, inconclusive conversation between Joe and Kendall in Chicago, but it was clear that the bulk of the work of getting back to a place where they could be in a committed relationship was done over dinners and phone calls and during visits to their respective hometowns ― you know, the way actual people in the actual world decide to commit their time and affection to each other. But this gap in filming didn’t diminish the emotional returns.\n\nInstead, it offered us an accidental rom-com. Two couples divided by circumstance and misunderstanding; four hearts broken and yearning. Their separations were perfectly paced to set up a final-act grand gesture, a sentimental reunion. When Kevin, on the couch with Chris Harrison, professed that he still loved Astrid, she hesitated slightly before admitted she loved him too. On our couches, we wept as if we were rewatching “To All the Boys I’ve Loved Before.”\n\nJoe even detailed his reconciliation with Kendall with generous use of dramatic suspense, drawing out his description of their visits together in Chicago and LA before dropping the bomb: He still loved her, and they were officially back together. He offered a “When Harry Met Sally”–style list of what he loved about her ― how she’s a know-it-all, how he can wind her up. The couple snuggled and kissed, love triumphant again. Our hearts twanged in our chests like banjos. Roll credits.\n\nABC can’t offer this to us every time. That’s why “Bachelor” shows are so tightly produced and the relationships subjected to such intense pressure: There’s no guarantee that an on-camera breakup will result in a teary, amorous on-camera reunion two months later. The producers’ best shot at capturing love onscreen is to insist that couples make it work on the beach. If they want to deliver each season, they can’t allow the very hints of reality and doubt that make relationships compelling to watch.\n\nAdvertisement\n\nFor more on “Bachelor in Paradise,” listen to “Here to Make Friends”:", "images": ["https://img.huffingtonpost.com/asset/632b4c8d2300001c003c57cf.jpg?cache=5TSRWLiwuT&ops=92_92", "https://img.huffingtonpost.com/asset/6340396f22000056006b45c3.jpeg?ops=92_92", "https://img.huffingtonpost.com/asset/6340396f22000056006b45c3.jpeg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/5b995ec6200000fd0a37be99.jpeg?cache=7UmjLelD8O&ops=1200_630", "https://img.huffingtonpost.com/asset/633fec47250000360079bea7.jpeg?cache=1MFuMDvaVF&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634032832600001f005b83be.jpg?cache=of3P4Ovoa9&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/63404c7b2500001f004f73fe.jpg?cache=lNas9Q4Wll&ops=240_240", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/634007b2250000360079bec8.jpeg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634007802500001f0079bec6.jpg?cache=cfcrG2pMn0&ops=240_240", "https://img.huffingtonpost.com/asset/6340359b2600001a005b83c3.jpg?cache=WSbcF7Ea6S&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634015ad2600001d00657edc.jpg?cache=HVoWVMuLmj&ops=92_92", "https://img.huffingtonpost.com/asset/6340585c2500003a004f7410.jpeg?cache=mGKk1tDjZH&ops=92_92", "https://img.huffingtonpost.com/asset/63408fb92500003a004f7469.jpeg?ops=92_92", "https://img.huffingtonpost.com/asset/63404c7b2500001f004f73fe.jpg?cache=lNas9Q4Wll&ops=434_244%2Cquality_75", "https://www.facebook.com/tr?id=1112906175403201&ev=PageView&noscript=1", "https://img.huffingtonpost.com/asset/634051842600005f005b83ed.jpeg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633ed0e024000031000a19ae.jpeg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633fdc462200001c006b4555.png?cache=fxogmTwfa0&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634007b2250000360079bec8.jpeg?ops=240_240", "https://img.huffingtonpost.com/asset/634155432500005f00aa33b4.jpg?cache=HCnGNCDvoe&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634155432500005f00aa33b4.jpg?cache=HCnGNCDvoe&ops=240_240", "https://img.huffingtonpost.com/asset/5b995ec6200000fd0a37be99.jpeg?cache=7UmjLelD8O&ops=scalefit_720_noupscale", "https://img.huffingtonpost.com/asset/63406f692200002f006b4607.jpeg?cache=akEXLWRYSr&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/5c17f3542400000b049a34a6.jpg?ops=100_100", "https://img.huffingtonpost.com/asset/634136ec24000039001e50c5.png?cache=XAfWcVBqtK&ops=92_92", "https://img.huffingtonpost.com/asset/63402e432500003a004f73df.jpeg?cache=AdnbRabZJs&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634048f922000034006b45dd.jpg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/5cacf4f424000030074f66b5.jpg?ops=100_100", "https://img.huffingtonpost.com/asset/634007802500001f0079bec6.jpg?cache=cfcrG2pMn0&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633afcf62600001e007770fd.jpg?cache=b8W6udTaGF&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/5b995eb3190000350e50401e.jpeg?ops=scalefit_720_noupscale", "https://img.huffingtonpost.com/asset/633ff8ea2500005e004f73a4.jpeg?cache=Q1MOHMKJiH&ops=434_244%2Cquality_75"], "top_img": "https://img.huffingtonpost.com/asset/5b995ec6200000fd0a37be99.jpeg?cache=7UmjLelD8O&ops=1200_630", "keywords": [], "authors": ["Senior Women'S Reporter", "Books", "Culture Writer"], "canonical_link": "https://www.huffpost.com/entry/bachelor-in-paradise-accidental-rom-com_n_5b995ccbe4b0cf7b00461319", "title": "'Bachelor In Paradise' Was An Accidental Rom-Com", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "There's a reason that Joe and Kendall and Astrid and Kevin gave us this season's most compelling love stories.", "keywords": "Reality TV,bachelor in paradise,chris harrison,bachelor nation", "fb": {"app_id": 238320442863988}, "og": {"title": "'Bachelor In Paradise' Was An Accidental Rom-Com", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/5b995ec6200000fd0a37be99.jpeg?cache=7UmjLelD8O&ops=1200_630", "url": "https://img.huffingtonpost.com/asset/5b995ec6200000fd0a37be99.jpeg?cache=7UmjLelD8O&ops=1200_630", "type": "https://img.huffingtonpost.com/asset/5b995ec6200000fd0a37be99.jpeg?cache=7UmjLelD8O&ops=1200_630", "width": 1200, "height": 630}, "url": "https://www.huffpost.com/entry/bachelor-in-paradise-accidental-rom-com_n_5b995ccbe4b0cf7b00461319", "site_name": "HuffPost UK", "locale": "en_GB", "description": "There's a reason that Joe and Kendall and Astrid and Kevin gave us this season's most compelling love stories."}, "article": {"tag": "Reality TV,bachelor in paradise,chris harrison,bachelor nation", "section": "Culture & Arts", "author": "https://www.facebook.com/emma.rose.gray.1", "published_time": "2018-09-12T23:08:29Z", "modified_time": "2018-09-12T23:08:29Z"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostArts", "title": "'Bachelor In Paradise' Was An Accidental Rom-Com", "image": {"identifier": "https://img.huffingtonpost.com/asset/5b995ec6200000fd0a37be99.jpeg?cache=7UmjLelD8O&ops=1200_630", "width": 1200, "height": 630}, "description": "There's a reason that Joe and Kendall and Astrid and Kevin gave us this season's most compelling love stories.", "creator": "@emmaladyrose"}, "al": {"ios": {"url": "huffpostnews:///?editionID=uk&entryID=uk_5b995ccbe4b0cf7b00461319", "app_store_id": 306621789, "app_name": "HuffPost"}}, "sailthru.title": "'Bachelor In Paradise' Was An Accidental Rom-Com", "sailthru.tags": "Reality TV,bachelor in paradise,chris harrison,bachelor nation", "sailthru.image.thumb": "https://img.huffingtonpost.com/asset/5b995ec6200000fd0a37be99.jpeg?cache=7UmjLelD8O&ops=1200_630", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "google-site-verification": "SwSeLtSWlBL7BhzM0utZK77nXk0ojoWmrDJstoXkO9Q", "taboola.category": "arts"}, "movies": [], "publish_date": 1536793709.0, "source": "https://www.huffingtonpost.com", "summary": ""}