{"url": "https://en.wikipedia.org/wiki/Bobbi_Kristina_Brown", "text": "American television personality (1993–2015)\n\nBobbi Kristina Brown (March 4, 1993 – July 26, 2015) was an American reality television personality. She was the daughter and only child of singers Whitney Houston and Bobby Brown. Her parents' fame kept Brown in the public eye, as did her appearances on the reality show Being Bobby Brown.\n\nBrown intended on becoming a singer, actress, and dancer like her parents. She performed with her mother at concerts a number of times, as well as singing a cover of her mother's song \"I'm Your Baby Tonight\" on Being Bobby Brown. She appeared as herself on a number of television shows and specials, and played a role on Tyler Perry's television series For Better or Worse in 2012.\n\nOn January 31, 2015, Brown was found unconscious in a bathtub in her home, which was similar to the fate of her mother. After being in a coma for nearly six months, Brown died from lobar pneumonia on July 26, 2015, at the age of 22. After her death, her life was the subject of a television movie in 2017 and a documentary in 2021.\n\nEarly life [ edit ]\n\nBobbi Kristina Brown was born on March 4, 1993, at Saint Barnabas Medical Center in Livingston, New Jersey, to singers Whitney Houston and Bobby Brown.[1] Through her mother, Brown was related to many singers and entertainers: her maternal grandmother was singer Cissy Houston of The Drinkard Singers;[2] her mother's cousins were singers Dee Dee Warwick,[2] Dionne Warwick,[2] and Leontyne Price.[3][4] Brown's uncle was former professional basketball player Gary Garland, her mother's half-brother.[5] Through her father, Brown had six half-siblings: Landon, La'Princia, Robert \"Bobby\" Jr., Cassius, Bodhi, and Estelle.[6] Her godmother was gospel singer CeCe Winans and her godfather was music executive Clive Davis.[7][8]\n\nBrown grew up in front of cameras, appearing besides Houston during an interview with Barbara Walters at eight months old, and appearing aged one on stage at the 1994 American Music Award when her mother accepted an award.[9][10] Her vocals were featured on her mother's 1998 song \"My Love Is Your Love,\" for the album of the same title.[11] When her mother brought her to the recording studio and held her up to the microphone, she said \"Sing, mommy,\" which can be heard during the first verse of the song; she says \"Clap your hands!\" at the end of the track. Brown was featured on her mother's 2003 Christmas album titled One Wish: The Holiday Album on \"The Little Drummer Boy\".[12] When Brown's parents divorced in 2007, her mother was awarded custody.[13]\n\nThe Guardian writer Caroline Sullivan characterized Brown's childhood as difficult because of her parents' drug problems.[14] TheWrap stated, \"Brown grew up under the media glare, with her family issues playing out in a very public way.\"[15] The media also scrutinized Brown's weight; BET,[16] Essence,[17] and the Daily Beast[18] all wrote articles commenting and speculating on Brown's fluctuating weight. Author Mark Bego characterized Brown's teenage years as \"no picnic\" because of the media focus on her and her \"extreme growing pains\" because of that.[19]\n\nAdult life [ edit ]\n\nBrown's mother died at age 48 in a hotel bathtub in February 2012 from what was later ruled an accidental drowning with heart disease and cocaine use listed as contributing factors.[20] Brown was described as \"inconsolable\" and a few days later was admitted to Cedars-Sinai Medical Center in Los Angeles; according to a family friend, Brown was \"overwhelmed\".[21][22] In accordance with her mother's will, Brown was the beneficiary of Houston's entire estate including her clothing, jewelry, cars, personal effects, and furniture.[23] The will provided for Brown to receive trust fund payments in installments until she reached age 30, after which she was to receive the remainder of Houston's $115-million estate.[24]\n\nIn March 2012, Brown said she felt her mother's spirit and expressed her intention to carry on her mother's legacy by doing the \"singing thing,\" along with starting a career as an actor and dancer.[25] She was subsequently cast in her acting debut for a recurring role as Tina the receptionist in Tyler Perry's For Better or Worse television series. Perry stated \"She did a fantastic job. And that kid has a such a future. She's such an actor. I'm so proud of her. I'm telling you, as far as she wants to go in the business, she can.\"[26] After rumors began Brown had \"tearfully exited the set\" of the show, Perry came to her defense stating that had never happened.[27] Brown hoped to be cast in Angela Bassett's biographical film Whitney based on her mother. When Bassett did not cast her, Brown called her a \"bitch\". Bassett said that she did not cast Brown \"for a number of reasons... she's not an actress, and acting is a craft\".[28] Brown later apologized to Bassett on Twitter after generating controversy among fans.[29]\n\nIn July 2013, Brown announced her engagement to a close family friend, Nick Gordon, who had come to live in the Houston household when he was 12 years old but was never formally adopted.[30] The announcement caused controversy within the family;[31][32] before making their romantic involvement known, Brown had referred to him as her \"big bruh\" in online posts.[33][34] Brown said the couple received her grandmother Cissy's blessing prior to their engagement.[35] Though the two never legally married, Brown and Gordon announced they had married on January 9, 2014.[36][37]\n\nComa and death [ edit ]\n\nOn January 31, 2015, Gordon and a friend found Brown face down in a bathtub in her home in Alpharetta, Georgia.[38] They began CPR until emergency medical services personnel arrived. According to a police spokesperson, Brown was alive and breathing after being transported to North Fulton Hospital in Roswell, Georgia.[22] At first, they found no evidence to indicate drugs or alcohol caused the incident,[39] but this was later disputed. Doctors placed Brown in an induced coma after determining her brain function was \"significantly diminished\", and her family was told a meaningful recovery would be \"a miracle\".[40]\n\nBrown died in hospice care on July 26, 2015, at age 22. Her death was considered similar to her mother's death, as both had died from effects of being submerged in a bathtub.[13][41] The initial autopsy found no \"obvious underlying cause of death and no significant injuries\", and the Fulton County Medical Examiner's office said more tests were forthcoming.[42] A statement released by the family thanked \"everyone for their tremendous amount of love and support during these last few months\".[38] Several prominent celebrities offered their condolences, including Chris Brown,[43] Oprah Winfrey,[44] and Whitney Houston protegées Brandy and Monica. Funeral services were held August 1, 2015, at St. James United Methodist Church in Alpharetta, Georgia.[45] Brown was buried two days later between her mother and maternal grandfather at Fairview Cemetery in Westfield, New Jersey.[46]\n\nAutopsy report [ edit ]\n\nThe Fulton County Medical Examiner's office said it used both medical records and police investigative files to arrive at a determination for Brown's cause of death. According to the statement, \"marijuana, alcohol (ethanol), benzoylecgonine (a cocaine metabolite), benzodiazepines (medications used for sedation or to treat anxiety), and morphine\" were found in the body.[47] As to the cause of death, it found the \"underlying cause\" of death as \"immersion associated with drug intoxication\".[48] However, the manner of death could not be confirmed. The summary statement read, \"Death was clearly not due to natural causes, but the medical examiner was not able to determine whether death was due to intentional or accidental causes, and therefore classified the manner of death as undetermined.\"[48] A final autopsy report determined Brown died of lobar pneumonia.[49]\n\nPosthumous films [ edit ]\n\nAfter Brown's death, a television movie about her life was released, followed by a documentary on her and her mother. TV One released Bobbi Kristina in 2017. The Atlanta Journal-Constitution wrote, \"The story is ripe with melodrama as newcomer actress Joy Rovaris channels Bobbi Kristina's relationship with her mom, her love affair with Nick Gordon and the aftermath of her mother's death.\"[50] Lifetime released the documentary Whitney Houston & Bobbi Kristina: Didn't We Almost Have It All in 2021, which The Atlanta Journal-Constitution called \"...less an exposé and more a loving tribute to these two women\".[51]\n\nDiscography [ edit ]\n\nBrown spoke and sang in some of her mother's recordings and televised performances, as well as on a television show after her mother's death.\n\nFilmography [ edit ]\n\nNotes [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Bobbi_Kristina_Brown.JPG/220px-Bobbi_Kristina_Brown.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/6/6b/Bobbi_Kristina_Brown.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Bobbi_Kristina_Brown.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Bobbi_Kristina_Brown", "title": "Bobbi Kristina Brown", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.2", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Bobbi_Kristina_Brown.JPG/640px-Bobbi_Kristina_Brown.JPG", "width": 640, "height": 961}, "title": "Bobbi Kristina Brown - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}