{"url": "http://www.cq.com/doc/newsmakertranscripts-4328623", "text": "Council of Economic Advisers Chairman Alan Krueger Interviewed on Bloomberg\n\nSARA EISEN, HOST, BLOOMBERG NEWS:\n\nWe are joined right now by Alan Krueger, the chairman of the Council of Economic Advisors. He is the White House chief economist, and this is his last day on the job. So Dr. Krueger, congratulations on leaving the White House, but it is up to you right now to defend these somewhat disappointing jobs numbers. What do you attribute the weakness to?\n\nALAN KRUEGER:\n\nI think if you look at the big picture, what we see today is that the economy's continuing to heal. Over the last year, we've added 2.3 million private sector jobs. The unemployment rate continues to come down. But given how deep the hole was that was created by the Great Recession, there's a long way to go.\n\nEISEN:\n\nWell given your characterization just now, then how do you account for some of the disaster warnings of sequestration? Do you think you over-exaggerated that a bit?\n\nKRUEGER:\n\nI think there's no doubt that sequester is slowing economic growth. The Congressional Budget Office came out with another estimate that if it stays in place this coming year it could mean 900,000 fewer jobs than we would otherwise have. And I can tell you it's just horrible policy. It's cutting our feed corn (ph) - feed corn. We're not investing as much as we can. We're hurting the vulnerable.\n\nOn Wednesday this week, I went to visit the traumatic brain injury center at Walter Reed Hospital and they told me they're cutting back by 20 percent the number of patients they could treat. So this is just the wrong policy for the United States, and that's why the president proposed replacing the sequester with a much more balanced plan for deficit reduction.\n\nERIK SCHATZKER, HOST, BLOOMBERG NEWS:\n\nAlan, you said earlier - sorry, not you. Pardon me. The president said earlier this week that without sequestration the unemployment rate would be 6.5 percent. Was that your math?\n\nKRUEGER:\n\nCongressional Budget Office has made probably the most authoritative calculations of how sequestration is affecting the economy. On top of sequestration, you also have state and local governments that have cut back. And if you look at what's happened to government employment in this recovery, it's declined, declined at an unprecedented rate. And I think there's no question, and independent analysts have concluded, that if we saw the kind of growth in state and local government jobs, teacher jobs, police and so on that we would normally have in a recovery, the unemployment rate would be at least a percentage point lower.\n\nEISEN:\n\nHere's the story. Part-time America we like to call it. 174,000 additions from the household survey in part time, 92,000 in terms of full time. And this gets straight to the Republican respond to this report about Obamacare, the president's healthcare legislation making it more difficult for people to find full-time work. It's creating a part-time economy. The news is filled with stories of small businesses and colleges cutting back worker's hours or putting a freeze on hiring. How do you respond to that, that the new healthcare legislation is creating a part-time America?\n\nKRUEGER:\n\nI think that's highly misleading. Since the Affordable Care Act passed, 90 percent of job growth has been in full-time positions, higher than over the same period in the last recovery. We're seeing strong job growth in the sectors that have the lowest health insurance coverage rates. So I think there's no evidence to date that the Affordable Care Act is having an adverse effect on the job market.\n\nSCHATZKER:\n\nAlan, what is the relationship -\n\nKRUEGER:\n\nAnd I would also add that we're seeing much slower growth in health insurance premiums than we've seen in the past 50 years. And in the long run, that's going to help job creation and wages.\n\nSCHATZKER:\n\nWhat is the relationship between healthcare reform and the strength of the economy? David Cordani, the CEO of Signa, told us yesterday that not enough people - and he should know, right? He runs a health insurer. That not enough people understand what healthcare reform is doing and are aware of the exchanges that it's creating. If that situation isn't rectified, what does it mean for the economy?\n\nKRUEGER:\n\nI think there's been a tremendous amount of disinformation about the Affordable Care Act, and it's easy to see why. Four times as much has been spent opposing the law than supporting it and explaining what it will do. But the implementation so far I think has been effective. I think you particularly see the states that have taken this seriously and have done their best to implement exchanges are seeing their health insurance premiums come down.\n\nWe saw in New York state, probably where you're sitting right now, premiums come down by 50 percent or more in the individual market. So I think as the law is implemented, and the administration is certainly focused on implementing the law well, people will learn more about it. And I think it on net will have very beneficial effects for the economy.\n\nEISEN:\n\nWell clearly there's something that's holding the private sector back a bit. We're not seeing the 200,000 jobs growth per month. Certainly the trend is better, but we're not seeing those critical numbers. This administration continues to get criticism of an unfriendly towards business kind of attitude. Why do you think that is, and how do you respond to those criticisms that it's holding back private sector employment?\n\nKRUEGER:\n\nThe nature of the economic crisis back in 2008 was unique. $16 trillion of wealth was destroyed. That had a horrible effect on household balance sheets. That's affected consumption. We're seeing slow growth in spending on discretionary items because so much wealth was destroyed. Then on top of that, the housing bubble led us to over build homes and it took a long time to work off that excess. But we are in a much stronger position today. As I mentioned, we've added 2.3 million jobs over the last - last 12 months, and we want to build on this progress.\n\nEISEN:\n\nAll right. Alan Krueger, best of luck to you. Last day on the job as the chairman of the Council on - of Economic Advisors. We will miss being with you on these jobs days.\n\n[*]\n\n***END OF TRANSCRIPT***\n\nALAN KRUEGER, CHAIRMAN, COUNCIL OF ECONOMIC ADVISERS\n\nSARA EISEN, HOST, BLOOMBERG NEWS\n\nERIK SCHATZKER, HOST, BLOOMBERG NEWS", "images": ["http://www.cq.com/images/cq-logo-white-new.png", "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png"], "top_img": "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png", "keywords": [], "authors": [], "canonical_link": "", "title": "Council of Economic Advisers Chairman Alan Krueger Interviewed on Bloomberg", "meta_data": {"build-version": "unknown-TAG", "build-time": "unknown-1664650858571", "viewport": "initial-scale=1", "apple-itunes-app": "app-id=1022591312"}, "movies": [], "publish_date": null, "source": "http://www.cq.com", "summary": ""}