{"url": "https://web.archive.org/web/20200602162402/https://www.thethings.com/23-times-blake-lively-ryan-reynolds-trolled-social-media/", "text": "God must have shipped Ryan Reynolds and Blake Lively really hard, because they seem to be a match made in Heaven.\n\nGod must have shipped Ryan Reynolds and Blake Lively really hard, because they seem to be a match made in Heaven. Ridiculously good-looking? Check. Talented? Check. Funny as hell? Double-check. It would be gag-worthy if they weren't both so likeable and deliciously irreverent. Ryan Reynolds has always had jokes, but I didn't realize that Blake was capable of such witty banter and flawless trolling until they were married. Obviously they bring out the best (troll) in each other. Following both of them on social media and watching them drag each other in the comments is pure comedy.\n\nSo how did such a compatible power couple meet? Although they were both in relationships at the time, their first encounter was on the set of the movie Green Lantern. A year later, when they were both single and ready-to-mingle, the pair went on a double date (but with other people). Weird, right?\n\n\"That was the most awkward date because we were just like fireworks coming across,\" Ryan told Entertainment Weekly's SiriusXM show. \"It was weird at first but we were buddies for a long time. I think it's the best way to have a relationship is to start as friends.\"\n\nSurprise, surprise, it sounds just like a romantic comedy. No famous couple has made me laugh this hard since Chris Pratt and Anna Farris (RIP), so I sure am glad these two internet trolls found each other.\n\nBust out the popcorn, because here are 23 hilarious times Blake Lively and Ryan Reynolds trolled each other on social media. Enjoy.\n\n23 Setting The Record Straight\n\nRumors like this are why we can't have nice things.\n\nThe vast majority of high-profile marriages live under a microscope, but it's even worse if the couple appears to be happy. The tabloids love to expose dirty laundry on celebrities because dirty laundry sells. If the dirt isn't visible, then they will go on the hunt for \"sources\" who will give them the quotes they've been waiting for. Hollywood marriages don't always end due to \"irreconcilable differences\"- sometimes the constant barrage of rumors will tank even the happiest of unions.\n\nRyan and Blake are both successful and well-known, making them the ultimate target for tabloid rumors. The couple seems to ignore the vast majority of bogus headlines, but I guess the claim that Ryan and Blake were “struggling to spend quality time together\" was just too much for them to take.\n\nLeave it to Ryan to hilariously squash a rumor with the ultimate one-liner. \"I wish. I could use a little 'me time,'\" Ryan tweeted just a week after he and Blake had walked the red carpet together at the New York City premiere of Final Portrait. Any working parent with two kids under five knows the true struggle of finding time for oneself, so this tweet is relatable AF! It's hard to come for someone who playfully trash-talks their own marriage. The tabloid magazine that released this story needs to go back to the hole that it came from.\n\n22 It's The Thought That Counts\n\nMost women would be perfectly happy dealing with burnt Christmas cookies if it meant coming home to Ryan Reynolds every night. Clearly he can't cook worth a damn, but he's gorgeous, funny, and rich. I think I could get over it. Plus it's the thought that counts.\n\nI'm praying that Ryan's toddler was responsible for the icing situation, but I can't be sure of that. Judging by the quality of the baking, I wouldn't be surprised if he doesn't know how to ice a cookie any better than a five year old. I love myself some Christmas cookies, but even I would have to draw a line with these. That's saying something, because iced sugar cookies are totally my jam.\n\nI'm guessing this is the last time Blake allowed Ryan in the kitchen, but it kind of paid off in the end (just not with cookies). I bet she took one look at this mess and said to herself, \"yep. This is perfect troll material.\"\n\nThese two are probably always on the hunt for ways to troll each other, even during the Holidays. Blake and Ryan are #RelationshipGoals. Follow them on social media (if you don't already) and just sit back and enjoy the show.\n\n21 GET IT TOGETHER, BLAKE\n\nWhat exactly have you seen three times this week, Blake? Tell me more. No, seriously, we all want to know more.\n\nRyan is trolling Blake pretty hard with this comment, but I can guarantee that she laughed it off. Ryan Reynolds could never be with someone who took herself (or their marriage) too seriously. Maybe that's why it didn't work out with Scarlett Johansson? I don't remember the two of them goofing off with each other online (or anywhere else).\n\nIn my opinion, this kind of playful banter is a sign of a happy marriage.\n\nWhen their kids ARE old enough to read, I bet they'll enjoy watching their parents taking swipes at each other online. It's all in good fun. I'll admit that I wasn't a huge Blake Lively fan at first. When I saw that \"couple picture\" taken alongside \"Cumberswift,\" I remember thinking OMG RYAN WHAT HAVE YOU DONE. Thankfully it seems like Ryan knew something that we didn't- the girl knows how to take a joke. I'm no Hollywood expert or anything, but I'm guessing that's rare for beautiful actress types. Chemistry isn't just about physical attraction- you've got to enjoy each other's company if you want your relationship to stand the test of time. Making each other laugh is a great start. Something tells me these two will be fine.\n\n20 Nice Try, Ryan\n\nRyan and Hugh Jackman first met when they were filming the movie X-Men Origins: Wolverine. Since then they have developed a love/hate relationship on social media that leaves followers equally delighted and confused. Is it a bromance, or do they low-key hate each other? Does the constant shading disguise a tumultuous relationship, or is it all in good fun? Ryan Reynolds trolls Hugh Jackman at every single opportunity, like a little brother who won't stop running into his brother's room uninvited. When Hugh wants to send a fan a birthday message, Ryan starts singing loudly in the background. When Hugh posts a photo of him and his wife for his anniversary, Ryan comments with \"I gave this 3 months. Tops. I was wrong.\"\n\nDespite the constant jokes at each other's expense, at least they're still willing to be photographed together. That's a relief. Blake DID notice the extra space between them and took that opportunity to troll the crap out of her husband, which is fun. Both Blake and Hugh are pretty used to being thoroughly roasted by Ryan, so I'm glad she seized the opportunity to level the playing field. I'm not 100% sure that Hugh \"gets\" their sense of humor, but I'm laughing.\n\n19 Really Feeling Herself\n\nNeither Blake nor Ryan miss the opportunity to playfully throw barbs at each other and we love them for it. There's nothing more annoying than those couples who use social media to wax lyrical about their perfect relationship, is there? I'd rather see a clearly compatible funny couple drag each other on Instagram any day of the week.\n\nWhen Blake posted a picture of herself and hubby Ryan Reynolds exchanging a smile on the red carpet for the premiere of A Quiet Place,\n\ndid you really think she was going to post something sweet?\n\nThis is Blake Lively we're talking about, so of course she saw this as an opportunity for some quality trolling. Complex do-it-yourself braids involving ribbons are truly something to be proud of. I figured all celebrities took the easy way out and used stylists, so good for her! Good hair trumps a good husband every time. Obvs.\n\nOf course Ryan wasn't about to take a roast without clapping back, and his perfect response has me slow-clapping. Keep in mind that Blake posted this picture only a week after Ryan took to Twitter to respond to divorce rumors, so it's double the troll power. They're not only trolling each other, they're trolling the tabloids, too. Well-played, guys.\n\n18 Can The Man Get His Boots Back?!\n\nOnly a tall woman with perfectly toned thighs could pull off this outfit, but her daughter isn't wrong...that dress is SHORT. Is it even a dress, or is she just using it as one? I don't even know. The vast majority of mothers would only wear that outfit if it involved leggings, but Blake Likely isn't most women. Must be nice! If I walked out wearing that outfit, it wouldn't just be my daughter telling me I forgot my pants- it would be the police.\n\nMost guys who saw a picture of their wife wearing something like this would comment with heart or fire emojis, but Ryan Reynolds isn't most men. Ryan took one look at his wife looking sexy and thought IT'S TROLL TIME. I don't think the guy can fall asleep at night without getting all the witty one-liners out of his system.\n\nBlake's boots are definitely making a statement, but I bet this wasn't the statement she was going for. Who knew that Ryan would cop to owning a pair of lace-up black boots? This is Deadpool we're talking about so I guess we should have been prepared for anything. Any opportunity to make people laugh is worth it to Ryan, no matter how self-deprecating.\n\n17 Happy Valentine's Day\n\nI don't know why Ryan is pretending to hold an invisible phone, but Blake clearly had a plan for it. I wonder if she asked him to pose like that on purpose? I wouldn't put it past her. She has a reputation to live up to.\n\nWatching this conversation play out is like watching a really close football game.\n\nOne team scores, then the other team scores, then it goes into overtime and you're not sure who will win. Blake's troll game starts out strong, but then Ryan comes back with a one-liner that has us screaming. Obviously Ryan is looking for real love and not just a brief fling on Twitter. Just when you think Ryan has the game in the bag, Blake comes back to fight fire with fire and scores some points with her Ashley Madison reference. Ryan concedes the fight, because can you really one-up that level of witty? NOPE.\n\nHas there ever been a more compatible couple? I bet these two were exchanging barbs on their first date. In an interview with Good Morning America, Blake explained how she and Ryan have such a good thing going. \"In general, it's nice to have someone who understands what you're doing,\" she said. \"Especially because our job is so weird—you have to be 'married' to other people, it's all so strange. It's never normal, even when you're both doing it.\"\n\n16 Bad Life Choices\n\nBlake Lively is the mother of two, and she recently lost 61 pounds after her most recent pregnancy with the help of her trainer, Don Saladino. She recently posted a picture of her impressive post-baby bod on Instagram, writing, \"Thanks @donsaladino for kickin' my A double S into shape. 10 months to gain, 14 months to lose. Feeling very proud.\"\n\nAt some point Blake must have decided to introduce her trainer/miracle worker to her husband, Ryan Reynolds, but it looks like she might be second-guessing her life choices now that Ryan is bragging about his fitness all over Instagram. Don Saladino, owner of Drive 495, helped Ryan bulk up for Deadpool. Ryan allegedly put on seven pounds of lean muscle for the role, so clearly the Don knows what he's doing if Ryan is already feeling \"4 years younger.\"\n\nBlake isn't here for Ryan's gloating, of course, and let him know it in the comments. \"I've made a terrible decision,\" she writes. I guess Ryan was just sitting around and waiting for the opportunity to exchange a well-timed barb of his own, because the swipe at his wife was quick and to the point (as always). You can always count on Ryan to have the last word.\n\n15 Wandering Eyes\n\nActor Helen Mirren might be 72-years-old, but she still recognizes a fine piece of man meat when she sees it.\n\nHelen, who co-starred with Ryan a couple of years ago in the movie Woman in Gold, recently sang Ryan's praises in a piece she wrote for the annual Time 100 issue. And when I say \"sang his praises\" I mean she might as well be the president of the Ryan Reynolds Ultimate Fan Club, because she had a LOT of good things to say about him.\n\n\"He's the Everyman,\" she writes, \"but somehow with more of everything: wit, elegance, looks and general hunkiness.\"\n\nIt doesn't stop there, though. Not even close. Helen writes, \"I loved Deadpool. But I also miss spending time with the actor who played him—his warm, intelligent, inquisitive brown eyes, his readiness to laugh ... sigh.\"\n\nLAWD HAVE MERCY, Ryan Reynolds done made Helen Mirren sigh.\n\nHELEN MIRREN, the sexiest senior citizen on the planet! Well done, Ryan. After reading that, I'm not surprised that Blake was a little jelly. If Helen was younger there's no way in hell Blake would be joking about this, because the look between the two of them is FIRE. Thank God she's old enough to be his mother.\n\n14 Cropping Out Your Wife Like-\n\nHow the hell was Ryan Reynolds never a stand-up comedian (or on SNL)?\n\nRyan Reynolds isn't the type to miss an opportunity to make a joke on social media, even if it's his wife's 30th birthday. When I first saw this picture I wasn't even sure what I was looking at, but then I saw the caption and I spit out my drink. That's exactly what Ryan intended. Making a funny at his family's expense is what Ryan lives for, but Blake doesn't seem to mind. Ryan makes jokes about his \"daughters\" too, but Blake tells everyone not to take him seriously.\n\n“He may as well work for the Enquirer,” the Blake told Glamour. “When he says ‘my daughter,’ he’s never, ever talking about her. Everything is a completely made-up scenario.”\n\nRyan will try not to catch Blake completely off-guard with his posts, though. “He’ll run them by me sometimes just to make me laugh. But oh, I’m so in love with him when he writes that stuff. I mean, I’m in love with him most of the time, but especially with that. I said, ‘Most of the time,’ because if I say, ‘I’m so in love with him all the time,’ then you get that eye-rolling, ‘Oh, her life is so great, she’s so perfect. So it’s, like, my defense mechanism.”\n\nI get that.\n\n13 Perfect Revenge\n\nRemember that time Ryan celebrated his wife's 30th birthday by cropping her out of a picture on Instagram? Blake never forgot it either, and decided to get back at him on his 41st birthday by cropping him out of a photo taken with Ryan Gosling at the Critics' Choice Awards in 2016. NICELY DONE, BLAKE!\n\nThis picture is infinitely better than Ryan's version because Ryan Gosling is a legendary Hollywood heartthrob.\n\n“Happy Birthday, baby,” Lively captioned the picture that featured only half of Reynolds’ face and body. It's pretty harsh when your wife chooses Ryan Gosling's face over yours! Ryan, you really should have seen this coming. Blake's never been one to take things lying down.\n\nEarlier that same day, Reynolds had tweeted about his daughters' attempts to celebrate his big day.“My kids tried to surprise me for my birthday this morning. I totally heard them coming and snuck out to start a new life somewhere else,” he wrote on Twitter.\n\nOf course none of us believe him, but it's still pretty damn funny. It's like every time Ryan successfully trolls his family on Twitter, Blake is waiting in the wings, planning her next attack. She really outdid herself with this one.\n\n12 #NoFilter\n\nRyan never misses an opportunity to poke fun at his wife on Instagram, so when found a snap of Blake sans make-up on the set of The Rhythm Section looking a little worse for wear, he knew exactly what to do with it.\n\nRyan captioned the shot \"#nofilter,\" because he's a braver man than literally every husband in the universe. Sure, it's funny, but it's also risky as hell. My husband knows to run a picture by me before posting it on social media, but I guess the rules don't apply when you're on a movie set. Everyone's about to see her looking like that anyway, but he was still risking her wrath with that caption. It's still up on social media, so I guess he managed to get away with it. I wonder if this was one of those jokes that he had to run by her first?\n\nBlake is totally unrecognizable in this picture. I would have never known this was her if Ryan hadn't posted it. Do you think this is what she really looks like without makeup? I doubt it. They've clearly tried to make as rough as possible for this movie, even down to her wardrobe.\n\n11 That's One Way To Clear Up A Rumor\n\nWho the hell is responsible for writing this? \"Blake Lively And His Mom On Red Carpet After Shutting Down Split Rumors.\"\n\nWhat kind of wording is that? It's no surprise Ryan trolled the shit out of that mess of a headline. Who exactly was on the path to Splitsville here? His mom and Blake? Blake and Ryan? Ryan and his mom? There were so many ways he could have played this, but I personally love that he chose to troll his own mother (and completely ignore his wife).\n\nI don't know if Blake's mother actually rollerblades (I doubt it), but she doesn't look like the type of lady who smokes jazz cabbage.\n\nTo be honest, she doesn't look like she'd even know what \"jazz cabbage\" is. Judging by the quality of that headline, I wouldn't be surprised if that's not even his mom at all! That's probably just a picture of Ryan and Blake posing with a random fan (that actually is his mother, by the way. I looked it up).\n\nI wonder how it feels to be the mother of an famous internet troll (I mean...actor). That's something to be proud of for sure. She probably never even saw this post, though. The Olds aren't always familiar with Twitter.\n\n10 Trolling His Fashion Choices\n\nLet's try to get past the fact that Ryan Reynolds is scary skinny in this photograph and take a look at the trollish caption below it, posted by Blake herself.\n\nAnyone who follows Blake Lively on Instagram knows how obsessed she is with style. Blake once wore 10 outfits in one day during a promo tour for her film All I See Is You (she changed for every single interview). She didn't just switch clothes, though, she switched LOOKS (changing her hair and makeup). Who the hell has time for that? Needless to say, she's garnered quite the reputation for always looking chic and almost never wearing the same outfit twice. I bet her daughters are some of the best dressed kids in Hollywood. I guess she figures her style might rub off on her husband if he would stop being so damn \"lazy.\"\n\nThe thing I love about this tweet is that Blake isn't just trolling her husband, she's trolling herself and the absurdity of changing so many times in one day. Got to love a girl who knows how to laugh at herself. I bet Ryan put on that suit in the morning and didn't take it off until he was ready to go to sleep. Why would he want to? Those are some seriously dapper duds.\n\n9 Ryan Trolls Blake's Birthday (Again)\n\nI just want to know one thing- did Ryan look up other celebrities with the same birthday as his wife for the sole purpose of trolling Blake on her birthday? I think we all know the answer to that.\n\nBilly Ray Cyrus should feel pretty honored to be loved by Ryan Reynolds with his \"whole heart.\" His achy, breaky heart (sorry, couldn't help myself). Between this birthday tweet and the one where Ryan cropped Blake out of her birthday picture, I'm starting to suspect that Ryan plans these things months in advance. He probably has a journal and he just writes ideas down as they come to him throughout the year. As much as he likes to joke about his wife's birthday being an afterthought, I bet he throws big parties for her in real life.\n\nThis trolling doesn't fool us, Ryan. We know you're crazy about her.\n\nIt takes a special kind of woman to be cool with these kinds of posts year-round, but I think Blake really enjoys it. Unlike some women, she's definitely not the \"overly sensitive type.\" Did you know that she even drove her own husband to the hospital when she was giving birth? It's true, and Ryan even admitted it on Twitter. #BossLady.\n\n8 Hear That, Blake?\n\nTweets like this are the reason I love Ryan Reynolds. He's irreverent AF and never afraid to \"go there\" (within reason), and that's a refreshing change in Hollywood. So many A-listers act like they're God's gift to the world, but Ryan's never been like that. He's always down to make jokes about his \"perfect\" life and family and people love him for it. Sure, he's famous and rich and completely untouchable. But tweets like this help you forget that. Ryan just comes off as the guy next door with the jokes.\n\nRyan and Blake will never be known as a couple that's afraid to tease each other. Can you imagine Kanye teasing Kim like this on Twitter? If Kanye said he had a secret family in Denmark I might actually believe him (and so would Kim). When Ryan tweets it, you know it's a joke and you take it in the spirit intended. Both Blake and Ryan are REALLY good at knowing where to draw the line with their playful barbs. Similar to John Legend and Chrissie Teigen, they tease each other with just the right amount of affection and it's adorable. Watching this kind of interaction is way more palatable than watching celebrities couples blow smoke up each other's ass. That's the worst.\n\n7 Happy Father's Day!\n\nTROLL LEVEL: EXPERT.\n\nThere's a reason this picture had to be taken from Buzzfeed instead of Blake's Instagram account. Unfortunately for both Blake and Ryan, this adorable snap of Ryan holding their daughter led to some seriously intense backlash and Blake eventually had it removed.\n\nAlthough Blake's caption is unquestionably hilarious, her Instagram followers immediately took issue with the way the baby was situated in the carrier.\n\n\"The baby should be in a seated position...that is how they are secure. This has nothing to do with anyone thinking they're a better or perfect parent, it has everything to do with caring about the Reynolds' and the safety of their baby,\" one user said.\n\nOthers weren't so kind in their assessment, writing, \"I guess some people don't read the instruction manual!\"\n\nAdriane State, a certified babywearing educator, told Yahoo parenting: \"A wearer should always be able to clearly see their child's face and ensure that baby's airway is clear. Although baby James is not in the most ideal position for this carrier, it’s really wonderful to see a happy dad trying his best to follow his instincts and snuggle his baby close.\"\n\nLord, help us all. This was some quality trolling on Blake Lively's part, and barely anyone noticed because so many parents were up on their high horse. This isn't the America I want to live in.\n\n6 Basketball Jokes\n\nNo, Blake is not coming home from a basketball game dressed in sequins. By the time Blake left her NYC film screening of her movie, All I See is You, she had changed out of a gold dress and into a glittery, sequined jersey. Apparently this basketball-inspired getup was her seventh outfit change of the day (remember what I told you earlier)?\n\nBut I digress. Blake posted this picture and captioned it \"the balls to my basket\" because she's not afraid to objectify the shit out of her husband on social media. I'm here for it! If my man looked like that I'd be objectifying him every single day! Referring to your man as nothing but a set of balls is both tacky and wonderful all at the same time. I was expecting Ryan to see this and post a witty comeback, but I guess he didn't mind the description. I'm pretty sure most men wouldn't mind the description, especially if it was coming from Blake Lively. Blake probably wore this outfit just so this caption could be born! I wouldn't believe it of any other person, but this is Blake and Ryan we're talking about. You know I'm right.\n\n5 She Just Had To Say It\n\nSome things are just too gross to be joked about, and the \"two girls, one cup\" video is one of them. I've never even seen the video, but I know what happens. I chose not to watch because I enjoy eating too much to lose my appetite for life.\n\nI don't know what's going on here, but this photo doesn't LOOK staged for a nasty caption. Ryan isn't even looking at the camera, yet his hand somehow found its way to Blake's chest (but she doesn't seem too surprised to see it there). Was this caption what she had in mind? Did she actually say \"hang on a sec, let's do a two Deadpools, one cup picture,\" or did the inspiration strike when she was posting it on Instagram?\n\nWho the hell knows with these two. I wouldn't put it past them.\n\nOn another note, this is the most normal outfit I've ever seen Blake Lively wear. Who knew she owned jeans and a pair of chucks? Check out her Instagram page and you'll see what I'm talking about. The woman practically lives in gorgeous designer dresses! She probably wears luxurious dresses to bed, just for fun, and wakes up looking like a goddess! Not even fair.\n\n4 He's No Scientist\n\nI don't know what kind of cake this is, but it looks delicious. Well, at least it did before he mentioned the glue.\n\nIf Ryan really did make this cake (he's wearing an oven mitt, so he at least we know he got it out of the oven), then I'm pretty impressed right now. At least I think that's a cake. I can't really tell under all of those strawberries and that white glue-like icing, but I guess we'll have to take his word for it. Leave it to Ryan to do something sweet for his wife and then make a joke about it. He's simply not the type to do something mushy and then add an even mushier caption, like \"made this for my love bug!\" Every caption is an opportunity to roast himself or someone else. If Ryan ever starts posting sweet pictures and writing super-sentimental captions to his wife (or anyone else), then someone call the police because he's clearly been kidnapped and someone has hacked his account. Ryan doesn't want you to be impressed by his prowess in the kitchen, or by anything else! He simply wants his followers to know that he made his wife a cake using glue. He's an actor, not a scientist! What did you expect?\n\n3 #DeadCool\n\nDid you know that Ryan Reynolds has been bombarded by sick fantasy tweets on social media for years? Some of these are pretty freaking weird, too. One woman tweeted Ryan, asking him to kick her in the chest and drag her across the pavement. Instead of being disturbed, Ryan tweeted back in typical Ryan Reynolds fashion. \"I'm currently lost in prayer. Maybe later.\" Another Twitter user asked if he would mind poking her with chopsticks (you can't make this crap up). His answer? \"Sorry, just trying to get this wild dolphin untangled from a fishing line.\"\n\nWith hilarious comebacks like that, is it any wonder that fans are desperate to get close to him?\n\nIt kind of makes you want to tweet him just for a funny response. When Twitter user Scott Jenkins tweeted concern about how Ryan's wife feels about all these kinky \"fan requests,\" Ryan didn't miss a beat. \"Pretty sure it's my wife writing most of those. Sounds like her.\"\n\nHAHAHA! The quips just keep coming. I wonder if Ryan is just as funny in person as he is on social media. I would be really disappointed if I met him and didn't hear at least one witty one-liner (preferably at his wife's expense).\n\n2 ...Then There's Blake\n\nThis caption made me laugh out loud, but I was surprised to see that it had been removed from Ryan's Instagram account. Ruh-roh. Do you think it's because he took it a little too far for Blake's liking? Did Ryan finally cross the line? Maybe.\n\nCould anyone other than Ryan Reynolds could get away with writing a caption like this? Because I don't think they could. We've all gotten used to Ryan's sense of humor by now and simply accepted that his wife will often be the butt of his jokes. This caption was obviously written in jest, but for Blake, it might have crossed a line. Or maybe Ryan just regretted it and took it down himself, without any prompting. I guess we'll never know. I definitely think it would have been too much if Ryan had not included himself as one of the \"most beautiful, considerate, and loving people\" he's ever known. That shit's just funny.\n\nAll jokes aside, can we just talk about how adorable his two little girls are? These lucky girls will never have to worry about suffering through years of \"Dad jokes,\" because their dad is legitimately hilarious. My only regret is not dying sooner and missing the chance to be reincarnated as one of Ryan and Blake's daughter. Rats.\n\n1 That's Real Love\n\nReal love is when you check your partner's teeth before a big event, isn't it? I once went to a fundraising gala without realizing I had red lipstick all over my two front teeth, but my gem of a husband was willing to hide behind a wall and wipe it off for me with a napkin. That's love right there.\n\nLeave it to Ryan to re-post one of his wife's Instagram \"fan\" pictures for the express purpose of trolling the hell out of it.\n\nRyan's not a big fan of sugary sweet posts like this to begin with. Now that he mentions it, it does look like he's giving Blake's teeth a thorough inspection. Blake probably lives off of granola and chia seeds, so it's good that he was looking out for her. All this talk of teeth has me wondering why Ryan's teeth are so much darker than Blake's. Did she just get a whitening treatment the day before? I bet Ryan's teeth are just a normal shade of white, but they look almost brown in comparison. Maybe he was just marveling at the fact that her teeth could be so blinding. It doesn't seem natural. Must be a Hollywood thing.\n\nShare Tweet Email Share\n\nNext What Was Kit Harington's Life Like Before Marrying Rose Leslie?", "images": ["https://web.archive.org/web/20200602162402im_/https://www.thethings.com/public/build/images/ts-logo-full-colored-light.fe4281c4.svg", "https://web.archive.org/web/20200602162402im_/https://static1.thethingsimages.com/wordpress/wp-content/uploads/2018/05/ryan-blake-feat.jpg", "https://web.archive.org/web/20200602162402im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20200602162402im_/https://www.thethings.com/public/build/images/hc-logo-full-colored-light.83eba484.svg", "https://web.archive.org/web/20200602162402im_/https://www.thethings.com/public/build/images/tr-logo-full-colored-light.d769382c.svg", "https://web.archive.org/web/20200602162402im_/https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c5 d9986e/pixel?tag=ViewContent&noscript=1"], "top_img": "https://web.archive.org/web/20200602162402im_/https://static1.thethingsimages.com/wordpress/wp-content/uploads/2018/05/ryan-blake-feat.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20200602162402/https://www.thethings.com/23-times-blake-lively-ryan-reynolds-trolled-social-media/", "title": "23 Times Blake Lively And Ryan Reynolds Trolled Each Other On Social Media", "meta_data": {"robots": "max-image-preview:large", "viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "God must have shipped Ryan Reynolds and Blake Lively really hard, because they seem to be a match made in Heaven.", "og": {"title": "23 Times Blake Lively And Ryan Reynolds Trolled Each Other On Social Media", "type": "article", "image": {"identifier": "https://web.archive.org/web/20200602162402im_/https://static1.thethingsimages.com/wordpress/wp-content/uploads/2018/05/ryan-blake-feat.jpg", "width": 1728, "height": 910}, "url": "https://web.archive.org/web/20200602162402/https://www.thethings.com/23-times-blake-lively-ryan-reynolds-trolled-social-media/", "locale": "en_US", "description": "God must have shipped Ryan Reynolds and Blake Lively really hard, because they seem to be a match made in Heaven.", "site_name": "TheThings"}, "article": {"published_time": "2018-05-28T20:00:33Z", "section": "Pop Culture"}, "fb": {"app_id": 1704776379798523, "pages": 816297408482105}}, "movies": [], "publish_date": 1527537633.0, "source": "https://web.archive.org", "summary": ""}