{"url": "https://en.wikipedia.org/wiki/Olaf%27s_Frozen_Adventure", "text": "2017 animated short film\n\nOlaf's Frozen Adventure is a 2017 American 3D computer-animated featurette produced by Walt Disney Animation Studios and directed by Kevin Deters and Stevie Wermers. The screenplay was written by Jac Schaeffer, with Josh Gad, Kristen Bell, Idina Menzel, and Jonathan Groff reprising their roles from Frozen (2013).\n\nIn November 2017, Olaf's Frozen Adventure premiered in theaters for a limited time engagement in 3D format preceding the screening of Pixar's Coco, and made its television debut on ABC in the following December. Upon release, it received mixed reviews from critics. It was nominated for Best Animated Special Production, Outstanding Achievement for Animated Effects in an Animated Production, and Outstanding Achievement for Music in an Animated Feature Production at the 45th Annie Awards.\n\nPlot [ edit ]\n\nIt is the first Christmas season since the gates reopened and Anna and Elsa host a celebration for all of Arendelle. With the townspeople unexpectedly leaving early to prepare for their individual holiday traditions, the sisters realized that they have no family traditions of their own. Upon hearing Elsa laments that the cause was her childhood isolation, Olaf and Sven decide to look for traditions and see if any of them are suitable to borrow or adapt.\n\nGoing through the town, Olaf encounters various family traditions relating to Christmas, Hanukkah, and Winter solstice. After a visit to Oaken, Olaf, Sven, and their sleigh full of traditions travel through the snowy tundra only for a piece of coal (from a portable sauna that Oaken had given them) to set the sleigh on fire. They slide down a hill and Olaf and Sven end up separated by a chasm. With only a fruit cake, Olaf attempts to travel through the woods and is attacked by wolves.\n\nMeanwhile, Anna and Elsa discover some forgotten items in their attic. Sven returns to Kristoff and informs him (in vain), Anna, and Elsa of Olaf's plight. They gather the residents of Arendelle to go look for Olaf. Elsewhere, Olaf manages to escape the wolves, but loses the fruit cake to a hawk and gives up by a tree not too far from the kingdom. Anna and Elsa find Olaf and cheer him up by revealing that they do have a tradition: Himself. After Elsa and Anna had been isolated from each other, the latter began annually sliding cards and dolls of Olaf under the former’s door. As they all celebrate the holidays, the hawk drops the fruit cake on Olaf. Upon getting the fruit cake back, Olaf declares it \"A Christmas miracle!\"\n\nCast [ edit ]\n\nProduction [ edit ]\n\nOn February 9, 2016, the short was announced as a television special set to be released on ABC,[3] which would be produced Roy Conli, and directed by Kevin Deters and Stevie Wermers. The title was revealed during the airing of The Making of Frozen: Return to Arendelle on ABC in 2016, and it was announced that it would feature original songs by Elyssa Samsel and Kate Anderson, the latter the sister of Frozen songwriter Kristen Anderson-Lopez. However, in June 2017, it was announced that the film would instead receive a limited time theatrical release in front of Disney/Pixar's Coco, as it was deemed too cinematic for television. It reprise the main cast from the Frozen (2013) including the return of Josh Gad, Kristen Bell, Idina Menzel, and Jonathan Groff.[4]\n\nThe music was recorded by an 80-piece orchestra in May 2017. The short was the filmmakers' first musical. They noted the requirement to keep the plot \"pretty simple\", and commented that they removed anything that diverted too much from that story. The fruitcake jokes in the short are a continuing motif from the filmmakers' previous project Prep & Landing. As they crafted the story, the Frozen team had barely started sketching out the plot of Frozen II.[5]\n\nSoundtrack [ edit ]\n\nThere are four original songs in the film, written by Elyssa Samsel and Kate Anderson, titled \"Ring in the Season\", \"The Ballad of Flemmingrad\", \"That Time of Year\" and \"When We're Together\". The film's score was composed by Christophe Beck and Jeff Morrow. The full soundtrack was released on November 3, 2017 by Walt Disney Records.[6]\n\nOriginal Motion Picture Soundtrack No. Title Performer(s) Length 1. \"Ring in the Season\" Kristen Bell\n\nIdina Menzel\n\nJosh Gad 1:58 2. \"The Ballad of Flemmingrad\" Jonathan Groff 0:44 3. \"Ring in the Season\" (Reprise) Menzel 1:16 4. \"That Time of Year\" Gad\n\nMenzel\n\nBell\n\nCast 3:03 5. \"That Time of Year\" (Reprise) Gad 0:52 6. \"When We're Together\" Menzel\n\nBell\n\nGad\n\nGroff 2:50 7. \"Olaf's Frozen Adventure\" (Score Suite) Christophe Beck\n\nJeff Morrow 4:27 8. \"The Ballad of Flemmingrad\" (Traditional Version) Groff 3:06 9. \"Ring in the Season\" (Instrumental Karaoke Mix) Elyssa Samsel\n\nKate Anderson 1:58 10. \"That Time of Year\" (Instrumental Karaoke Mix) Samsel\n\nAnderson 3:02 11. \"When We're Together\" (Instrumental Karaoke Mix) Samsel\n\nAnderson 2:49 Total length: 25:40\n\nRelease [ edit ]\n\nPixar feature films are typically preceded by short films for their theatrical releases.[7][8] Olaf's Frozen Adventure, in a 3D format, was chosen to precede screenings of Pixar's Coco beginning on November 22, 2017.[4] Coco co-director Adrian Molina said that the short's placement before Coco was an \"experiment\" given that (at 21 minutes) it was longer than the shorts that typically precede Pixar movies.[9] The week after Coco's release in Mexico, local media noted audiences' strong dislike for the length of the film.[10][11][12] A few days later, all Mexican cinemas offered apologies and removed the short from the exhibition.[13] It was reported that some theaters put warning signs up about the length of the short ahead of Coco.[14] Olaf's Frozen Adventure ended its limited time run in U.S. screenings on December 8.[15]\n\nIn the UK, Olaf's Frozen Adventure was shown before re-releases of Frozen on November 25 and 26, and December 2 and 3, 2017.\n\nOn November 23, Disney announced the release of Olaf's Frozen Adventure on Disney's cable television channels in Latin America, along with Netflix, on December 8, and later on Mexican channels Azteca 7 and 13.[16] The short made its network television debut on ABC on December 14, 2017, as part of 25 Days of Christmas.[17] It was viewed by an estimated 5.64 million people in the United States.[18]\n\nCritical response [ edit ]\n\nOn the review aggregator website Rotten Tomatoes, 57% of 7 critics' reviews are positive, with an average rating of 5.1/10.[19]\n\nBill Desowitz of IndieWire deemed the short as a \"bridge\" and a \"setup\" to Frozen II.[20] Nicola Methven of Daily Mirror felt it would \"tide fans over\" until the next feature length installment of the franchise.[21] Writing for KSDK, Patrick Ryan commented it is an \"Adventure' worth taking,\"[22] while Ben Pearson of /Film wrote that \"When We're Together\" had the potential to be 2017's version of \"Let It Go\".[23] Marissa Martinelli of Slate criticized the short's over-commercialism, and opined that it committed the well-trodden sin of turning a comedic side-character into the star – an \"increasingly desperate one-man show.\"[24] Alissa Wilkinson of Vox reported that audiences in North America have been critical to Disney's promotional strategy of prescreening the short before the main attraction. Additionally, she suggested that the featurette would be better off broadcast to television as originally planned instead.[25][26]\n\nAccolades [ edit ]\n\nOlaf's Frozen Adventure received three nominations at the 45th Annie Awards. The development of the featurette was nominated for the Best Animated Special Production. Christopher Hendryx, Dan Lund, Mike Navarro, Hiroaki Narita, and Steven Chitwood were nominated for Animated Effects in an Animated Production for their contributions to the project. Elyssa Samsel, Kate Anderson, and Christophe Beck were nominated for Music in an Animated Feature Production for their musical performance incorporated on the featurette.[27]\n\nHome media [ edit ]\n\nThe featurette was released as a Tesco-exclusive DVD in the United Kingdom on December 7, 2017[28] with a digital format release on the following 19th.[29][30] A Blu-ray/DVD was released in the US and Canada on November 13, 2018.[31] The 2017 digital format release and the 2018 Blu-ray/DVD release included six additional Disney short films: Polar Trappers (1938), Winter (1930), The Hockey Champ (1939), The Art of Skiing (1941), Once Upon a Wintertime (1954), and Pluto's Christmas Tree (1952).[30]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Frozen_Logo_Black.svg/150px-Frozen_Logo_Black.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Animation_disc.svg/20px-Animation_disc.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Mad_scientist.svg/20px-Mad_scientist.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/9/93/Olaf%27s_Frozen_Adventure_poster.jpeg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/93/Olaf%27s_Frozen_Adventure_poster.jpeg/220px-Olaf%27s_Frozen_Adventure_poster.jpeg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Magic_Kingdom_castle.jpg/15px-Magic_Kingdom_castle.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/9/93/Olaf%27s_Frozen_Adventure_poster.jpeg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Olaf%27s_Frozen_Adventure", "title": "Olaf's Frozen Adventure", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/9/93/Olaf%27s_Frozen_Adventure_poster.jpeg", "width": 640, "height": 946}, "title": "Olaf's Frozen Adventure - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}