{"url": "https://www.hollywoodreporter.com/live-feed/tim-allens-last-man-standing-officially-revived-at-fox-1110400", "text": "It’s official: Fox has revived Tim Allen’s Last Man Standing for a seventh season a year after the comedy was surprisingly canceled at ABC.\n\nAllen has signed on and has been — with producers 20th Century Fox Television — the driving force behind the revival. Stars Nancy Travis, Jonathan Adams, Amanda Fuller, Christoph Sanders and Jordan Masterson have also locked in deals to return. A return date and episode count for the series, originally created by Jack Burditt, have not yet been determined.\n\n“Excited? Team LMS was in the sixth inning, ahead by four runs, stands were packed and then for no reason, they call off the game. It leaves you sitting in the dugout, holding a bat and puzzled. Now we get the news from Fox that it’s time to get back out on that diamond — hell yes, I’m excited!” Allen said in a statement announcing the news Friday. “When I heard the offer to create more episodes of Last Man Standing, I did a fist pump so hard I threw my back out. It’s the fans! I could not be more grateful for the fans who wrote petitions and kept up the passion and incredible support for the show. And a fist pump, ouch, for Dana Walden and Gary Newman at Fox for not only listening to the fans, but for making the bold move to bring Last Man Standing back. I’m sure audiences will be curious to see what we look like after all these years. Oh, has it only been one year? Well, just goes to show you — a lot can happen in a year.”\n\nThe formal decision comes after Fox canceled single-camera comedies Brooklyn Nine-Nine, The Mick and The Last Man on Earth. Still to be determined are the fates of bubble shows L.A. to Vegas (could go either way) and Ghosted (not looking good), which are both also single-camera comedies. Last Man Standing joins a Fox 2018-19 roster that could include all multicamera live-action comedies a year after the network exited the genre. Fox’s two new series orders — The Cool Kids and Rel — are both multicams.\n\n“Last Man Standing ended too soon and the outcry from the fans has been deafening,” said Gary Newman and Dana Walden, chairmen and CEOs at Fox Television Group. “We’ve wanted to put the show back together since its final taping a year ago, and Tim never gave up hope either. Thanks to its millions of devoted viewers and the irrepressible Tim Allen, we haven’t seen the last of Last Man Standing.”\n\n20th TV, attempted to find the series a new home after ABC’s cancellation of the show last year. Viacom-owned niche country-music-themed cable network CMT airs reruns of the show in syndication.) Fox’s move to revive Last Man Standing comes after Allen and the network’s studio counterpart,TV, attempted to find the series a new home after ABC’s cancellation of the show last year. Viacom-owned niche country-music-themed cable network CMT was in talks to bring the show back for a seventh season for either a short-order or multiple-season/20-episode revival. But those negotiations ultimately broke down , given the sizable price tag that came with the series. (airs reruns of the show in syndication.)\n\nSpeaking with The Hollywood Reporter after last year’s upfronts, 20th TV’s Howard Kurtzman singled out Last Man Standing as the most disappointing and surprising pass. “If there’s a way to bring it back, we will explore those opportunities,” he said.\n\nAt the time of Last Man‘s cancellation, ABC Entertainment president Channing Dungey stressed that the show’s ownership structure — the network had to pay a sizable licensing fee to 20th TV — was behind her decision to drop it. Also playing a role in its cancellation was the fact that Allen’s contract was up after season six, and a new deal would have increased the cost of the aging series at a time when ABC was poised to shoulder a larger share of the price tag on the show. Dungey emphasized that the cancellation had nothing to do with Allen’s political affiliation after the actor compared being a conservative in Hollywood to ” ‘30s Germany.” The actor has since voiced his support for President Donald Trump (and attended his inauguration).\n\nThe renewal, at least for now, gives Fox ownership of the comedy, though that could change if regulators approve Disney’s $52.4 billion deal to buy Fox assets — including 20th TV. That would mean Disney would find itself in the opposite situation of where it was last year: owning the show on an outside network, with Fox having to pay the Mouse House a licensing fee.\n\nWhen Last Man Standing was canceled last May, it ranked as ABC’s second-most-watched comedy (behind only Modern Family). Since then, the TV landscape has changed following the blockbuster ratings success ABC found with its Roseanne revival. Roseanne‘s ratings have illustrated the larger value of programming shows for middle America. Starring Roseanne Barr, who has been vocal about her support for the current president, the Roseanne revival has made the debate over Trump part of its storyline, as it looks to explore issues facing working-class America and open a larger dialogue. Dungey, for her part, has been vocal about ABC’s need to program to audiences that go beyond affluent white viewers via series including Roseanne. (Fox also recently picked up a pilot about a family set in middle America that is in contention for midseason.)\n\nAsked following the Roseanne revival’s spectacular ratings if she had plans to revive Last Man Standing — which could have been paired with Roseanne for a multicamera comedy block with conservative stars — Dungey said the network “had talked” about it, but there were no immediate plans to bring it back.\n\nRoseanne was ABC’s lone multicamera comedy during the 2017-18 season, as the network made a decision to take a step back from the format. Multicamera comedies are less expensive to produce — a boon in an era of dwindling viewership and ad dollars — and faster to produce. Roseanne and The Big Bang Theory are the two most watched comedies on broadcast TV this season — and both are multicams. Following a pilot season where the genre heated back up again, multicamera orders have already topped last year, when only four were picked up.\n\nFor his part, Allen — who played conservative Mike Baxter, the father of three girls, on the family comedy — has remained vocal about his disappointment over ABC’s cancellation of his show. “I always wanted Last Man Standing to be like [All in the Family‘s] Archie Bunker,” Allen said in September. “Archie Bunker pushed boundaries, but Carroll O’Connor was not that guy at all. I am a version of that guy. But there is nothing more dangerous, especially in this climate, than a funny, likable conservative character. He is mitigated on the show by a family of women who had a difference of opinions, but [Mike Baxter] was a likable guy and a principled guy about work and ethics and all this stuff.”\n\nThe actor, who previously spent eight seasons starring as Tim “The Tool Man” Taylor on ABC’s Home Improvement, also took the broadcaster to task, noting that the network “could not have handled [the cancellation] worse,” He added, “Second biggest show, [ABC] hadn’t won a Friday night in 15 years. They put us out to pasture on Friday and we won Friday. Big night for us. Big night for them. I would have put Roseanne after us. Use us just to launch shows, if nothing else.”\n\nKeep track of all the renewals, cancellations and new show orders with THR‘s scorecards for ABC, CBS, Fox, NBC and The CW and of all the latest pilot pickups and passes with our handy guide. For complete coverage, bookmark THR.com/upfronts.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "http://www.hollywoodreporter.com/sites/default/files/custom2/Banners/THR_upfronts-embeds2x.png", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/140515_77271_-_h_2017.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/140515_77271_-_h_2017.jpg?w=1296&h=730&crop=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/140515_77271_-_h_2017.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/tim-allens-last-man-standing-officially-revived-at-fox-1110400/", "title": "Tim Allen’s ‘Last Man Standing’ Officially Revived at Fox", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The castmembers, including Nancy Travis, have inked deals to return.", "news_keywords": "Fox Entertainment, Last Man Standing, Tim Allen, Upfronts", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1110400, "title": "Tim Allen's 'Last Man Standing' Officially Revived at Fox", "published_at": "2018-05-11 12:45:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/140515_77271_-_h_2017.jpg?w=1024", "comment_count": 0, "tags": "Upfronts", "topics": "TV News", "body": "It's official: Fox has revived Tim Allen's Last Man Standing for a seventh season a year after the comedy was surprisingly canceled at ABC.\r\nAllen has signed on and has been — with producers 20th Century Fox Television — the driving force behind the revival. Stars Nancy Travis, Jonathan Adams, Amanda Fuller, Christoph Sanders and Jordan Masterson have also locked in deals to return. A return date and episode count for the series, originally created by Jack Burditt, have not yet been determined.\r\n\r\n\t\"Excited? Team LMS was in the sixth inning, ahead by four runs, stands were packed and then for no reason, they call off the game. It leaves you sitting in the dugout, holding a bat and puzzled. Now we get the news from Fox that it’s time to get back out on that diamond — hell yes, I’m excited!\" Allen said in a statement announcing the news Friday. \"When I heard the offer to create more episodes of Last Man Standing, I did a fist pump so hard I threw my back out. It’s the fans! I could not be more grateful for the fans who wrote petitions and kept up the passion and incredible support for the show. And a fist pump, ouch, for Dana Walden and Gary Newman at Fox for not only listening to the fans, but for making the bold move to bring Last Man Standing back. I’m sure audiences will be curious to see what we look like after all these years. Oh, has it only been one year? Well, just goes to show you — a lot can happen in a year.\"\r\n\r\n\t \r\n\r\n\t\r\nThe formal decision comes after Fox canceled single-camera comedies Brooklyn Nine-Nine, The Mick and The Last Man on Earth. Still to be determined are the fates of bubble shows L.A. to Vegas (could go either way) and Ghosted (not looking good), which are both also single-camera comedies. Last Man Standing joins a Fox 2018-19 roster that could include all multicamera live-action comedies a year after the network exited the genre. Fox's two new series orders — The Cool Kids and Rel — are both multicams.\r\n\r\n\t“Last Man Standing ended too soon and the outcry from the fans has been deafening,” said Gary Newman and Dana Walden, chairmen and CEOs at Fox Television Group. “We’ve wanted to put the show back together since its final taping a year ago, and Tim never gave up hope either. Thanks to its millions of devoted viewers and the irrepressible Tim Allen, we haven’t seen the last of Last Man Standing.”\r\n\r\n\t \r\n\r\n\tFox's move to revive Last Man Standing comes after Allen and the network's studio counterpart, 20th TV, attempted to find the series a new home after ABC's cancellation of the show last year. Viacom-owned niche country-music-themed cable network CMT was in talks to bring the show back for a seventh season for either a short-order or multiple-season/20-episode revival. But those negotiations ultimately broke down, given the sizable price tag that came with the series. (CMT airs reruns of the show in syndication.)\r\nSpeaking with The Hollywood Reporter after last year's upfronts, 20th TV's Howard Kurtzman singled out Last Man Standing as the most disappointing and surprising pass. \"If there's a way to bring it back, we will explore those opportunities,\" he said.\r\nAt the time of Last Man's cancellation, ABC Entertainment president Channing Dungey stressed that the show's ownership structure — the network had to pay a sizable licensing fee to 20th TV — was behind her decision to drop it. Also playing a role in its cancellation was the fact that Allen's contract was up after season six, and a new deal would have increased the cost of the aging series at a time when ABC was poised to shoulder a larger share of the price tag on the show. Dungey emphasized that the cancellation had nothing to do with Allen's political affiliation after the actor compared being a conservative in Hollywood to \" '30s Germany.\" The actor has since voiced his support for President Donald Trump (and attended his inauguration).\r\n\r\nThe renewal, at least for now, gives Fox ownership of the comedy, though that could change if regulators approve Disney's $52.4 billion deal to buy Fox assets — including 20th TV. That would mean Disney would find itself in the opposite situation of where it was last year: owning the show on an outside network, with Fox having to pay the Mouse House a licensing fee.\r\nWhen Last Man Standing was canceled last May, it ranked as ABC's second-most-watched comedy (behind only Modern Family). Since then, the TV landscape has changed following the blockbuster ratings success ABC found with its Roseanne revival. Roseanne's ratings have illustrated the larger value of programming shows for middle America. Starring Roseanne Barr, who has been vocal about her support for the current president, the Roseanne revival has made the debate over Trump part of its storyline, as it looks to explore issues facing working-class America and open a larger dialogue. Dungey, for her part, has been vocal about ABC's need to program to audiences that go beyond affluent white viewers via series including Roseanne. (Fox also recently picked up a pilot about a family set in middle America that is in contention for midseason.)\r\n\r\nAsked following the Roseanne revival's spectacular ratings if she had plans to revive Last Man Standing — which could have been paired with Roseanne for a multicamera comedy block with conservative stars — Dungey said the network \"had talked\" about it, but there were no immediate plans to bring it back.\r\nRoseanne was ABC's lone multicamera comedy during the 2017-18 season, as the network made a decision to take a step back from the format. Multicamera comedies are less expensive to produce — a boon in an era of dwindling viewership and ad dollars — and faster to produce. Roseanne and The Big Bang Theory are the two most watched comedies on broadcast TV this season — and both are multicams. Following a pilot season where the genre heated back up again, multicamera orders have already topped last year, when only four were picked up.\r\n\r\nFor his part, Allen — who played conservative Mike Baxter, the father of three girls, on the family comedy — has remained vocal about his disappointment over ABC's cancellation of his show. \"I always wanted Last Man Standing to be like [All in the Family's] Archie Bunker,\" Allen said in September. \"Archie Bunker pushed boundaries, but Carroll O'Connor was not that guy at all. I am a version of that guy. But there is nothing more dangerous, especially in this climate, than a funny, likable conservative character. He is mitigated on the show by a family of women who had a difference of opinions, but [Mike Baxter] was a likable guy and a principled guy about work and ethics and all this stuff.\"\r\nThe actor, who previously spent eight seasons starring as Tim \"The Tool Man\" Taylor on ABC's Home Improvement, also took the broadcaster to task, noting that the network \"could not have handled [the cancellation] worse,\" He added, \"Second biggest show, [ABC] hadn't won a Friday night in 15 years. They put us out to pasture on Friday and we won Friday. Big night for us. Big night for them. I would have put Roseanne after us. Use us just to launch shows, if nothing else.\"\r\n\r\nKeep track of all the renewals, cancellations and new show orders with THR's scorecards for ABC, CBS, Fox, NBC and The CW and of all the latest pilot pickups and passes with our handy guide. For complete coverage, bookmark THR.com/upfronts.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Tim Allen’s ‘Last Man Standing’ Officially Revived at Fox", "url": "https://www.hollywoodreporter.com/tv/tv-news/tim-allens-last-man-standing-officially-revived-at-fox-1110400/", "description": "The castmembers, including Nancy Travis, have inked deals to return.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/140515_77271_-_h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-05-11T12:45:00+00:00", "modified_time": "2018-05-20T20:33:55+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Tim Allen’s ‘Last Man Standing’ Officially Revived at Fox", "description": "The castmembers, including Nancy Travis, have inked deals to return.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/140515_77271_-_h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1526042700.0, "source": "https://www.hollywoodreporter.com", "summary": ""}