{"url": "https://www.celebritynetworth.com/richest-celebrities/jill-zarin-net-worth/", "text": "What is Jill Zarin's Net Worth and Salary?\n\nJill Zarin is an American real estate agent and reality television personality who has a net worth of $20 million. Zarin has accumulated her net worth through her time spent in real estate and also as a marketer for her husband's company, Zarin Fabrics & Home Furnishings. She is famous for appearing on the Bravo reality series \"The Real Housewives of New York City,\" which she starred on from 2008 to 2011. In 2010, Jill published the book \"Secrets of a Jewish Mother,\" which she wrote with her mother, Gloria Kamen, and her sister, Lisa Wexler. The book gives advice on everything from dating and marriage to money situations.\n\nJill was married to Bobby Zarin from 2000 to 2018. She has a daughter, Allyson, from a previous marriage. She also has a stepson, Johnathan.\n\nEarly Life\n\nJill Zarin was born Jill Susan Kamen on November 30, 1963, in Woodmere, Long Island, New York. Jill grew up with mother Gloria, father Sol, and sister Lisa, and she attended Lawrence High School and the Simmons College School of Retail Management. After graduating, she got a job at Filenes as an assistant buyer and moved on to become National Sales Manager at Jockey Hosiery.\n\nCareer\n\nAfter marrying Bobby Zarin in 2000, Jill began consulting for Zarin Fabrics, a Manhattan business that was opened by Bobby's father in 1936. She joined the cast of \"The Real Housewives of New York City\" in 2008 and was a regular cast member during the first four seasons. Though she was fired in 2011, Zarin has returned as a guest star several times and has appeared in 65+ episodes as of this writing. She has also done some acting work, appearing in the 2015 television film \"Night of the Wild\" and guest-starring on a 2011 episode of the USA Network series \"White Collar.\" Jill appeared on the hit reality television series \"Celebrity Wife Swap\" in 2014, trading lives with Jenna von Oÿ of \"Blossom\" fame, and she competed on \"Who Wants to Be a Millionaire\" in 2010. Zarin has launched several companies, including Jill Zarin Bedding, Jill Zarin Jewelry, Jill Zarin Rugs, and Skweez Couture Shapewear and Hosiery. She also started a company, Jill & Ally, with her daughter; the company offers apparel and accessories, including face masks, and for every mask sold, they donate one to healthcare and essential workers.\n\nPersonal Life\n\nJill married Steven Shapiro in 1987, and they had a daughter, Allyson, before divorcing. Zarin then wed Bobby Zarin on January 4, 2000, and she is stepmother to his children from a previous marriage, Jonathan, David, and Jennifer. Both Allyson and Jonathan suffer from arthritis, which inspired Jill to found the charitable organization Creaky Joints in 2009. Bobby was diagnosed with thyroid cancer in 2009, and though he underwent thyroid gland removal and radioactive iodine treatment, the cancer came back and spread to his lungs. He was diagnosed with a brain tumor in 2016 and underwent Gamma Knife Radiosurgery. Sadly, Bobby passed away from thyroid cancer on January 13, 2018; when he was hospitalized the previous summer, Jill began knitting a blanket for him, and she finished it three days before his death and draped it over his casket at the funeral. In December 2018, Zarin confirmed on Instagram that she had begun a new relationship with Gary Brody, the owner and president of the men's clothing company Marcraft Apparel Group.\n\nThough there has been speculation over whether Jill has had plastic surgery, she says that she hasn't gone under the knife. She swears by her liquid facelift procedures and a little Botox in her forehead and chin. This liquid facelift is done with injections of Restylane, injected into the jaw and sides of her face. In April 2020, Zarin launched Noshes for Nurses to feed healthcare workers in New York and Boca Raton during the Covid-19 pandemic, and the program has raised over $70,000 and distributed more than 200,000 meals to staff members at hospitals as well as fire and police departments.\n\nReal Estate\n\nAt the time of Bobby's death, the couple was living in a 2,000 square foot apartment that they'd owned for 18 years. Jill sold the three-bedroom Upper East Side home for $3.25 million in June 2019. The Zarins also owned a 7,300 square foot Sag Harbor home, which they sold for $2.85 million in 2007, and a home in Southampton they called Camp Zarin. In May 2018, Jill listed the Southampton home for rent, asking $260,000 for the entire summer or $110,000 for July/$125,000 for August to Labor Day.", "images": ["https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2021/01/Jill-Zarin.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/wp-content/uploads/2010/03/Jill-Zarin.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/wp-content/uploads/2010/03/jz.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/03/jz.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/jill-zarin-net-worth/", "title": "Jill Zarin Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Jill Zarin Net Worth: Jill Zarin is an American real estate agent and reality television personality who has a net worth of $20 million. Jill Zarin has accumulated", "cnw_share_fb_count": 92, "cnw_share_tw_count": 19, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Jill Zarin Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/jill-zarin-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/03/jz.jpg", "site_name": "Celebrity Net Worth", "description": "Jill Zarin Net Worth: Jill Zarin is an American real estate agent and reality television personality who has a net worth of $20 million. Jill Zarin has accumulated"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-07-08T16:27:11+00:00", "published_time": "2021-01-08T19:26:22+00:00", "section": "Richest Celebrities", "tag": "real house wives salaries"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/03/jz.jpg", "title": "Jill Zarin Net Worth", "description": "Jill Zarin Net Worth: Jill Zarin is an American real estate agent and reality television personality who has a net worth of $20 million. Jill Zarin has accumulated"}}, "movies": [], "publish_date": 1610133982.0, "source": "https://www.celebritynetworth.com", "summary": ""}