{"url": "https://en.wikipedia.org/wiki/List_of_most_streamed_songs_on_Spotify#100_most_streamed_songs", "text": "Wikimedia List Article\n\nThe following list contains the top 100 songs with the most streams on the audio streaming platform Spotify. As of June 2022, only two songs have reached 3 billion streams, those two songs being Ed Sheeran's \"Shape of You\" and The Weeknd's \"Blinding Lights\", with \"Shape of You\" ranked in the top position. A total of 19 songs have reached 2 billion streams. As of October 2022, all of the songs on the list have reached 1.4 billion streams. Justin Bieber has the most songs in the top 100 with six entries. Post Malone has the most songs in the top 10 with two entries.\n\nPrior to February 2014, Spotify's most-streamed song was \"Radioactive\" by Imagine Dragons;[1] it was overtaken by Avicii's \"Wake Me Up\", which became the first song to hit 200 million streams on 27 February 2014.[2] \"Wake Me Up\" held the streaming record for over a year before being surpassed on 22 May 2015 by Sheeran's \"Thinking Out Loud\", which became the first song to hit 500 million streams on 12 October 2015.[3] A month later, however, it was surpassed by Major Lazer and DJ Snake's \"Lean On\", featuring MØ,[4] which held the streaming record for 11 months until Drake's \"One Dance\", featuring Wizkid and Kyla, overtook it on 18 October 2016.[5] \"One Dance\" became the first song to hit 1 billion streams on 12 December 2016,[6] and held the streaming record for almost a year before being surpassed by \"Shape of You\" on 21 September 2017, which went on to become the first song to reach 2 billion streams in December 2018, along with becoming the first song to reach 3 billion streams in December 2021. Since July 2021, Spotify has kept a playlist of nearly all songs with over a billion streams. As of October 2022, a total of 306 songs have reached this milestone.[7]\n\n100 most-streamed songs [ edit ]\n\nThe following table lists the top 100 most-streamed songs on Spotify, with streams rounded to the nearest million, as well as the artist(s) and the date it was originally published.\n\nArtists with the most songs in the top 100 [ edit ]\n\nThis is a list of artists with the most songs in the top 100. It includes an artist's solo and featured songs (where the artist is officially credited). Justin Bieber leads the list with 6 tracks.\n\nJustin Bieber is the male artist with the most songs in the top 100, with 6. Dua Lipa is the female artist with the most songs, 4, in the top 100.\n\nHistorical most-streamed songs [ edit ]\n\nThe following table lists the last six songs to become Spotify's most-streamed songs, from 2013 to the present.\n\nCurrent record\n\nMilestones and achievements for songs [ edit ]\n\nWeekly number-one songs [ edit ]\n\nThe following table lists the songs that reached the number one position on Spotify's weekly most-played chart. The table records the number one song starting from issue date 29 December 2016 as the data before that said date is not available on the Official Spotify Weekly Charts.[150] Unholy\" by Sam Smith featuring Kim Petras is the current number-one song on the Spotify Global Top 200 for the week ending 29 September 2022.\n\nCurrent record\n\nAnnual top five most-streamed songs [ edit ]\n\nThe following table lists the five songs that Spotify reported as most-played in each calendar year.\n\nMost-streamed songs in a single day [ edit ]\n\nThe following table lists the 20 songs to get the most streams in a single day, as registered on Spotify Global Daily chart.[220]\n\nMost-streamed songs in a single week [ edit ]\n\nThe following table lists the top 20 most-streamed in a single week, as registered on the Spotify Global Weekly chart.[234]\n\nLongest-running number-one songs by days [ edit ]\n\nThe following table lists the 20 songs with the most days at number-one on the Global Spotify Chart.[234]\n\nMilestones and achievements for albums [ edit ]\n\nMost streamed albums in a single day [ edit ]\n\nThe following table lists the most streamed albums in a single day, registering the total of obtained streams, the artist, the publication of the album and the date in which these streams were reached.\n\nMost streamed albums in a single week [ edit ]\n\nThe following table lists the most streamed albums in a single week, registering the total of obtained streams, the artist, the publication of the album and the date in which these streams were reached.[289]\n\nSee also [ edit ]\n\nNotes [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/12_-_Ed_Sheeran.jpg/190px-12_-_Ed_Sheeran.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/DuaLipaO2020522_%28101_of_110%29_%2852052470251%29_%28cropped%29.jpg/151px-DuaLipaO2020522_%28101_of_110%29_%2852052470251%29_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Justin_Bieber_in_2015.jpg/153px-Justin_Bieber_in_2015.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Spotify_logo_with_text.svg/100px-Spotify_logo_with_text.svg.png", "https://upload.wikimedia.org/wikipedia/commons/f/f8/12_-_Ed_Sheeran.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/f/f8/12_-_Ed_Sheeran.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_most-streamed_songs_on_Spotify", "title": "List of most-streamed songs on Spotify", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/12_-_Ed_Sheeran.jpg/640px-12_-_Ed_Sheeran.jpg", "width": 640, "height": 960}, "title": "List of most-streamed songs on Spotify - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}