{"url": "https://www.nbcnews.com/politics/politics-news/omarosa-manigault-newman-says-she-quit-white-house-job-wasn-n829636", "text": "Former White House aide Omarosa Manigault Newman denied Thursday she had been fired, insisting instead that she left on her own terms — but acknowledged being \"uncomfortable,\" \"upset\" and \"unhappy\" with the way President Donald Trump's first year in office has unfolded.\n\nIn an interview with ABC’s “GMA,” Newman — whom a senior Trump administration official said was forced out of her job — contended that she resigned as she approached one year in the White House.\n\n“I resigned, and I didn’t do that in the residence as reported,” Newman said.\n\n“John Kelly and I sat down in the Situation Room … and we had a very candid conversation,” she said, referring to the president's chief of staff.\n\n“I wanted to make the one-year mark,” Newman continued, \"and then get back to my life.”\n\nNewman, however, also hinted at a high level of discord within the West Wing, saying she was unhappy with the way things had gone so far in the Trump presidency.\n\n\"There were a lot of things that I observed during the last year that I was very unhappy with, that I was very uncomfortable with, things that I observed, that I heard, that I listened to,\" Newman said. She was responding to a question about a report in The Washington Post in which friends of Newman said she wasn't pleased with Trump's response to the riots in Charlottesville, Virginia, in August.\n\n\"I have seen things that have made me uncomfortable, that have upset me, that have affected me deeply and emotionally, that has affected my community and my people,\" said Newman, who was one of Trump's highest-profile African-American female supporters and one of the few black women in Trump's West Wing.\n\n\"And when I can tell my story, it is a profound story that I know the world will want to hear,\" she said. Newman wouldn't elaborate on what she was unhappy about, saying, \"I can’t expand on it because I have to go back and work with these individuals.\"\n\nNewman's description of her account prompted \"GMA\" co-anchor Robin Roberts to deliver an apparent shot at her, after the interview had concluded.\n\n\"She said she has a story to tell, and I'm sure she'll be selling that story,\" Roberts said. \"So yeah, she will. Bye, Felicia,\" she said, referencing a popular phrase from the movie \"Friday.\"\n\nNewman left her White House job this week, but the circumstances of her exit have taken on a narrative fit for reality TV — which is, incidentally, how she and Trump met in the first place.\n\nRelated: Omarosa Manigault Causes Uproar at Black Journalists Convention\n\nA source close to the White House told NBC News on Wednesday night that Kelly made the decision to fire Newman and that she was escorted off the White House grounds after trying to re-enter the residence to debate the terms of her departure.\n\nDuring her interview Thursday, Newman cited tweets by U.S. Secret Service a day earlier that she said backed up her account.\n\n“I think you should take the word of the U.S. Secret service,” she said.\n\nOn Wednesday, the agency tweeted that, “Reporting regarding Secret Service personnel physically removing Omarosa Manigault Newman from the @WhiteHouse complex is incorrect.”\n\n“The Secret Service was not involved in the termination process of Ms Manigault Newman or the escort off of the complex. Our only involvement in this matter was to deactivate the individual's pass which grants access to the complex,” the Secret Service’s official account tweeted.\n\nEarlier Wednesday, White House Press Secretary Sarah Huckabee Sanders said that Newman had left her job as director of communications for the White House Office of Public Liaison \"to pursue other opportunities.\" In addition, a White House official said that she and Trump had a \"nice\" conversation on Wednesday, which the official described as \"very cordial.\"\n\nThe White House also said that Newman's departure would take effect on Jan. 20, exactly a year after Trump was sworn in. It was unclear whether Newman would be allowed to return to the White House to serve out those remaining 38 days in light of Wednesday night's disclosure.\n\nThe timing of Newman's departure was unexpected, said a White House official, who said the president was fonder of her than people realized.\n\nThat's likely due to their long history together.\n\nTrump tweeted Wednesday: \"Thank you Omarosa for your service! I wish you continued success.\"\n\nNewman came to know Trump during her time as a controversial contestant on several seasons of his reality TV show \"The Apprentice.\" Her brash and manipulative persona on the show both endeared her to Trump and made her a must-watch character.\n\nDuring the 2016 presidential campaign, Newman rallied crowds ahead of Trump’s appearances, traveling the country with an informal group of other \"women for Trump\" to make his case.", "images": ["https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_32/2260946/171214-omarosa-mc-1158.JPG", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2018_32/2260946/171214-omarosa-mc-1158.JPG", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-760x428,f_auto,q_auto:best/MSNBC/Components/Video/201712/tdy_news_hallie_omarosa_171214_1920x1080.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-60x60,f_auto,q_auto:best/newscms/2019_27/2923676/190612-adam-edelman-byline-30064.jpg"], "top_img": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_32/2260946/171214-omarosa-mc-1158.JPG", "keywords": [], "authors": ["Https", "Media-Cldnry.S-Nbcnews.Com Image Upload Newscms", "Adam Edelman", "Adam Edelman Is A Political Reporter For Nbc News."], "canonical_link": "https://www.nbcnews.com/politics/politics-news/omarosa-manigault-newman-says-she-quit-white-house-job-wasn-n829636", "title": "Omarosa Manigault Newman says she quit White House job, wasn't fired", "meta_data": {"msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/nbcnews/all-other-sizes-PNG.ico/browserconfig.xml", "robots": "max-image-preview:large", "fb": {"app_id": 10150138890205613, "pages": 1508175089456029}, "og": {"site_name": "NBC News", "locale": "en_US", "url": "https://www.nbcnews.com/politics/politics-news/omarosa-manigault-newman-says-she-quit-white-house-job-wasn-n829636", "title": "Omarosa Manigault Newman says she quit White House job, wasn't fired", "description": "Former White House aide Omarosa Manigault Newman denied Thursday that she had been  fired, insisting instead that she left on her own terms.", "image": {"identifier": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_32/2260946/171214-omarosa-mc-1158.JPG", "secure_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_32/2260946/171214-omarosa-mc-1158.JPG", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@NBCNews", "creator": "NBCNews", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1024-512,f_auto,q_auto:best/newscms/2018_32/2260946/171214-omarosa-mc-1158.JPG", "title": "Omarosa Manigault Newman says she quit White House job, wasn't fired", "description": "Former White House aide Omarosa Manigault Newman denied Thursday that she had been  fired, insisting instead that she left on her own terms.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1, user-scalable=yes", "description": "Former White House aide Omarosa Manigault Newman denied Thursday that she had been  fired, insisting instead that she left on her own terms.", "branch": {"deeplink": {"title": "Omarosa Manigault Newman says she quit White House job, wasn't fired", "description": "Former White House aide Omarosa Manigault Newman denied Thursday that she had been  fired, insisting instead that she left on her own terms.", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_32/2260946/171214-omarosa-mc-1158.JPG", "type": "article", "unibrow": "Politics News", "authorThumbnail1": "https://media-cldnry.s-nbcnews.com/image/upload/newscms/2019_27/2923676/190612-adam-edelman-byline-30064.jpg", "authorName1": "Adam Edelman"}}, "article": {"opinion": "false", "content_tier": "free", "published": "Thu Dec 14 2017 19:57:43 GMT+0000 (UTC)", "modified": "Thu Dec 14 2017 19:57:43 GMT+0000 (UTC)"}, "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x768_scale,f_auto,q_auto:best/newscms/2018_32/2260946/171214-omarosa-mc-1158.JPG", "next-head-count": 101}, "movies": [], "publish_date": 1513281463.0, "source": "https://www.nbcnews.com", "summary": ""}