{"url": "https://www.bustle.com/p/how-to-spend-halloween-if-you-dont-like-dressing-up-in-a-costume-12109073", "text": "There are so many things to love about Halloween: the candy that ends up everywhere, the creepy but adorable decorations all over the place, and the fact that all of your favorite foods suddenly taste like pumpkin. One thing that most people really love about the holiday is the chance to dress up in a costume, to spend a few hours (or different days) as someone you aren't. A lot of Halloween fans love the chance to go all out with the makeup, the clothes, and even the attitude. Because of this, it's easy to forget that not everyone enjoys dressing up — in fact, some people love Halloween, they just don't love wearing costumes. So what are you supposed to do on Halloween if you're an adult who doesn't like dressing up?\n\nLuckily, there are a lot of ways to celebrate Halloween without pretending to be your favorite TV character or movie star. You definitely don't need to be decked out in an expensive outfit you'll probably never wear again, or caking your face in costume makeup in order to be in the spooky spirit of things. After all, that's one of the great things about Halloween - there are so many different ways to celebrate it, and you should definitely embrace all of them.\n\nSo, if you're not a fan of Halloween costumes, try doing some of (or all of!) the below activities to have fun this October 31, and all of the days leading up to it.\n\n1 Make Creepy Treats Half-Baked Harvest One fun way to show everyone how much you love Halloween without wearing a costume is to make some fun and spooky Halloween-themed treats. There are elaborate options, like these monster mash cookies from Half-Baked Harvest, or more simple things (like slice and bake cookie dough from the grocery store!). Either way, they'll be delicious, fun to make, and spooky in the best way.\n\n2 Wear Halloween-Inspired Clothing ASOS ASOS Design Curve Halloween Resting Witch Face Shirt, $19, ASOS Even if you don't like wearing a costume, you can still wear Halloween-themed clothing so that you feel like you're still involved (or just for fun, because most things are really cute). There are tons of options out there, from skeleton shirts to scary movie tees to sassy sayings, like this one from ASOS.\n\n3 Tell Ghost Stories Around A Bonfire Giphy Few things are better than sitting around a warm bonfire on a chilly autumn night. Plan a get-together with a few friends, make a fire, then tell ghost stories in the dark. It's a really cute way to celebrate Halloween.\n\n4 Go To A Haunted House Giphy Creep yourself out by heading to a local haunted house. Sure, they can be pricey and you might have to wait on a long line to get in, but they're undeniably fun, and they're a great way to get into the spirit of things.\n\n5 Wear All Black And Dramatic Makeup Giphy You definitely don't need to wear a costume, but if you want to try to wear something that feels appropriate for Oct. 31, then just wear all black (for some reason, that feels Halloweeny) and put on some dramatic makeup. Voila! You're ready to go out.\n\n6 Do A Halloween Inspired Manicure Giphy Even if you don't like Halloween costumes, you might like the idea of Halloween accessories - like a cool manicure. Try something slightly spooky, or just go the orange and black route. You can do them yourself if you're skill enough, or ask to get a design done at the nail salon.\n\n7 Have A Scary Movie Marathon Giphy Want to celebrate Halloween without going out and being surrounded by people in costume? Invite some friends over, stay in, and have a scary movie marathon. Watch some corny classics and some new scary films as well.\n\n8 Wear A Halloween Pin Etsy Goth Ghost Brooch, $11.99, Etsy Want to wear something that feels right for Halloween? It can be as simple as a small pin. Attach it to your shirt, your jacket, or even your bag.\n\n9 Make Halloween-Themed Drinks Half-Baked Harvest Get in the spirit of things with some Halloween spirits (hehe). You can grab a pumpkin beer and add some cinnamon sugar around the rim, or you can do something more elaborate and make creepy cocktails. This vampire drip cocktail from Half-Baked Harvest is one perfect option.", "images": ["https://imgix.bustle.com/uploads/image/2018/10/1/9120bbdb-f846-42ef-b3cb-d3c205056d04-il_570xn1383082393_52uk.jpg?w=414&h=276&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2018/10/1/f7866a78-b7c9-45eb-85a1-f8bfdfdd6617-screen-shot-2018-10-01-at-11351-pm.png?w=414&h=542&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/4/c3bd8082-f026-4952-ab50-612cae60b882-tiktokhalloween001.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/9/26/c11eda4c-d937-49a0-80e5-474bece8e224-45bd76e4-8a84-476d-b74e-af119cf97842-strangerthings_strangerthings4_8_00_32_47_06_r3.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2022/10/7/c2481add-7032-4e16-9c2f-f108c3e0c1c4-halloweenmocktails001.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2018/10/1/99408783-0c0a-4af0-90b6-4a56ef217a31-vampires-drip-cocktail-4-1.jpg?w=414&h=621&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2018/10/1/90c6956a-61a6-46b6-a2c1-8ae487137868-shutterstock_497983561.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/10/1/90c6956a-61a6-46b6-a2c1-8ae487137868-shutterstock_497983561.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/shutterstock/2022/9/30/c03e15fc-c9d7-44ba-8cf9-98341e0dd981-shutterstock-1959154624.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2018/10/1/eb9f01da-8ff2-448c-b63e-ce4ba9fe0590-monster-mash-cookies-7.jpg?w=414&h=276&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/uploads/image/2018/10/1/90c6956a-61a6-46b6-a2c1-8ae487137868-shutterstock_497983561.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/how-to-spend-halloween-if-you-dont-like-dressing-up-in-a-costume-12109073", "title": "How To Spend Halloween If You Don’t Like Dressing Up In A Costume", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@jboothyy"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/how-to-spend-halloween-if-you-dont-like-dressing-up-in-a-costume-12109073", "type": "article", "title": "How To Spend Halloween If You Don’t Like Dressing Up In A Costume", "description": "There are so many things to love about Halloween: the candy that ends up everywhere, the creepy but adorable decorations all over the place, and the fact that all of your favorite foods suddenly taste like pumpkin. One thing that most people really…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/10/1/90c6956a-61a6-46b6-a2c1-8ae487137868-shutterstock_497983561.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "There are so many things to love about Halloween: the candy that ends up everywhere, the creepy but adorable decorations all over the place, and the fact that all of your favorite foods suddenly taste like pumpkin. One thing that most people really…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}