{"url": "https://globalnews.ca/news/3524066/leah-remini-scientology/", "text": "It’s no secret that former Scientology follower Leah Remini has her sights set on taking down the controversial religion, but in a recent roundtable interview for The Hollywood Reporter, she said it’s her “passion” in life to put an end to it.\n\nAccording to Remini, many members of her personal team, along with her managers, have tried to dissuade her from talking so frequently on the topic, especially since her show, Leah Remini: Scientology and the Aftermath, has taken off.\n\n“Everybody on my team told me not to,” she confessed at the roundtable. “They want me to be an actress. They don’t want me to be known as somebody who does a show about Scientology. I’m like, ‘What am I going to do? Not do it? This is my passion.'”\n\nREAD MORE: 7 shocking things we learned from Leah Remini’s Scientology series\n\n“The Church of Scientology has been in the news, but more so for fodder and a headline,” she continued. “What we are trying to do is show that this is a real thing that’s tearing families apart. People really had no idea. It was like, ‘Oh, this is that crazy thing where Tom Cruise is jumping on a couch and everybody believes in aliens?’\n\nStory continues below advertisement\n\n“I think that worked for a very long time to sell headlines. But we’re showing how a person actually can get there, and that’s what’s resonating. Also, we’re standing up to a bully and, in a culture where people are feeling apathetic, we’re representing a group of courageous people who are saying, ‘No, I’m going to do something about it.'”\n\nRemini, 46, along with ex-elite Scientologist Mike Rinder, 62, are currently shooting Season 2 of the popular exposé show, which seeks to tell the unheard stories of people who’ve managed to leave the religious organization. Along the way, the viewer gets some insight into Rinder’s and Remini’s experiences as well.\n\nBoth of them are now classified by the church as “Suppressive Persons” (SPs) — people who seek to speak ill of Scientology — along with any journalist looking to tell a negative story about the religion. The treatment that befalls SPs is meant to be so unbearable, and in some cases so completely life-ruining, that they’ll cease their crusade to bring down Scientology.\n\nREAD MORE: Leah Remini alleges further Scientology abuses for show’s upcoming second season\n\nSo far, nothing seems to be stopping Remini.\n\n“It’s not me, that’s the thing… I’m telling their stories,” she said. “When [the production staff and I] leave, they go back to their regular lives, and they’re the ones the church goes after. When we air a show, I go, ‘Just know, within minutes your daughter is going to be saying horrific things about you on the church hate website.’ Literally every single person who has done a story about Scientology has a hate website on them.”\n\nStory continues below advertisement\n\nIn fact, both Remini and Rinder have such sites dedicated to them — a common technique Scientology uses. The church has made a website titled “Who Is Michael Rinder?” (Here is a page — in the exact same design format as Rinder’s — dedicated to criticizing Remini’s show.) On the site, Rinder is called “a vicious wife beater,” a “deadbeat,” and a “father from hell.” None of those declarations has been proven.\n\nThis isn’t really a shocking new fact, since Scientology’s practices have been well documented, but what’s jarring is how far the religious organization will go, and what methodology it’ll use to bring someone down once they’ve “disconnected” from the church. Remini, Rinder and several others recounted on Aftermath how private investigators and other agents affiliated with Scientology would follow them endlessly, try to destroy their careers and even threaten their extended family.\n\nREAD MORE: Leah Remini: Tom Cruise could ‘end’ Scientology if he wanted to\n\nDespite the organization’s tactics, Remini is not afraid of whatever repercussions she might personally face.\n\n“Don’t misunderstand me,” she said. “People who know me know that I have a very big mouth, and I have been that way since I was a kid. But I never want to give the organization of Scientology the idea that anybody is scared of them. We are not. And the more they react in the way that they do, it makes me think we’re doing the right thing.”\n\nStory continues below advertisement\n\nIn Season 1 of Aftermath, viewers saw how hostile Scientology members can be when confronted. In many instances, Remini and Rinder were being tailed; when approached, the alleged stalker either denies it or doesn’t say a word before quickly leaving the scene.\n\nWATCH BELOW: The latest on Scientology\n\nThe only thing Remini admits to being scared of is hearing the Scientologists’ stories of abuse and forced separation from family. Every time she gets ready to listen to a story, she says, she’s afraid that it’s going to be worse than she thinks it is — and it often is.\n\nIn an incredible show of trust, Remini says she gives out her personal cellphone number to all guests on her show in case they need to get in touch.\n\nSeason 2 of Leah Remini: Scientology and the Aftermath is slated for Summer 2017 on A&E.\n\nStory continues below advertisement", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=3005670&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://globalnews.ca/wp-content/themes/shaw-globalnews/assets/dist/images/alert-red.png", "https://globalnews.ca/wp-content/themes/shaw-globalnews/assets/dist/images/logo-morty.svg", "https://globalnews.ca/wp-content/themes/shaw-globalnews/assets/dist/images/logo-text.svg", "https://globalnews.ca/wp-content/uploads/2017/06/leah-remini-mike-rinder.jpg?quality=85&strip=all&w=720&h=379&crop=1", "https://globalnews.ca/wp-content/uploads/2015/11/chris-jancelewicz-globalnews-e1602604272262.png?w=136&h=136&crop=1", "https://globalnews.ca/wp-content/themes/shaw-globalnews/assets/dist/images/morty.svg", "https://globalnews.ca/wp-content/themes/shaw-globalnews/assets/dist/images/shield.png", "https://globalnews.ca/wp-content/themes/shaw-globalnews/assets/dist/images/shield-blue.png", "https://globalnews.ca/wp-content/uploads/2017/06/leah-remini-mike-rinder.jpg?quality=85&strip=all", "https://globalnews.ca/wp-content/themes/shaw-globalnews/assets/dist/images/alert.png", "https://globalnews.ca/wp-content/themes/shaw-globalnews/assets/dist/images/ad-choices.png", "https://globalnews.ca/wp-content/themes/shaw-globalnews/assets/dist/images/logo-mobile.svg", "https://d21y75miwcfqoq.cloudfront.net/70c8fc80"], "top_img": "https://globalnews.ca/wp-content/uploads/2017/06/leah-remini-mike-rinder.jpg?quality=85&strip=all&w=720&h=379&crop=1", "keywords": [], "authors": ["Chris Jancelewicz", "Global News"], "canonical_link": "https://globalnews.ca/news/3524066/leah-remini-scientology/", "title": "Leah Remini: Taking down Church of Scientology is ‘my passion’", "meta_data": {"theme-color": "#002F5D", "viewport": "width=device-width, initial-scale=1.0", "title": "Leah Remini: Taking down Church of Scientology is ‘my passion’  | Globalnews.ca", "description": "\"What we are trying to do is show that this is a real thing that's tearing families apart,\" said Leah Remini about the Church of Scientology.", "keywords": "Leah Remini, leah remini interview, leah remini scientologist, leah remini scientology, leah remini scientology and the aftermath, leah remini scientology tv show, leah remini tv show, Scientology, scientology and the aftermath, scientology leah remini, Entertainment", "news_keywords": "Leah Remini, leah remini interview, leah remini scientologist, leah remini scientology, leah remini scientology and the aftermath, leah remini scientology tv show, leah remini tv show, Scientology, scientology and the aftermath, scientology leah remini, Entertainment", "article": {"tag": "Entertainment"}, "og": {"title": "Leah Remini: Taking down Church of Scientology is ‘my passion’  | Globalnews.ca", "description": "\"What we are trying to do is show that this is a real thing that's tearing families apart,\" said Leah Remini about the Church of Scientology.", "type": "article", "url": "https://globalnews.ca/news/3524066/leah-remini-scientology/", "site_name": "Global News", "image": "https://globalnews.ca/wp-content/uploads/2017/06/leah-remini-mike-rinder.jpg?quality=85&strip=all&w=720&h=379&crop=1"}, "twitter": {"title": "Leah Remini: Taking down Church of Scientology is ‘my passion’  | Globalnews.ca", "url": "https://globalnews.ca/news/3524066/leah-remini-scientology/", "description": "\"What we are trying to do is show that this is a real thing that's tearing families apart,\" said Leah Remini about the Church of Scientology.", "card": "summary_large_image", "site": "@globalnews", "image": "https://globalnews.ca/wp-content/uploads/2017/06/leah-remini-mike-rinder.jpg?quality=85&strip=all&w=720&h=379&crop=1"}, "fb": {"app_id": 318812448281278, "pages": 91251252807}, "robots": "max-image-preview:large", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Global News", "application-name": "Global News", "apple-mobile-web-app-status-bar-style": "default", "ia": {"markup_url": "https://globalnews.ca/news/3524066/leah-remini-scientology/?ia_markup=1"}}, "movies": [], "publish_date": null, "source": "https://globalnews.ca", "summary": ""}