{"url": "https://www.billboard.com/articles/columns/pop/8005791/demi-lovato-simply-complicated-documentary-youtube-best-moments", "text": "Demi Lovato peeled back all the layers on Tuesday (Oct. 17) with the arrival of her documentary, Demi Lovato: Simply Complicated, exclusively to YouTube. The documentary was directed by Hannah Lux Davis and is time-capsuled by the creation of her sixth studio album Tell Me You Love Me (Sept. 29). It’s no coincidence that Lovato’s new documentary coincides with her most vulnerable music to date.\n\nExplore Explore Demi Lovato See latest videos, charts and news See latest videos, charts and news\n\nSimply Complicated is just under an hour and 20 minutes long with not a minute wasted. In the first minute, we learn from Demi herself, “I actually had anxiety around this interview because the last time I did an interview this long, I was on cocaine.”\n\nHere are 10 of the most honest, revealing moments from Simply Complicated.\n\nThe opening monologue\n\nWe all knew that the purpose of this documentary was to let every crevice of who Demi Lovato has been and is now breathe, but there’s something quite poignant when hearing Lovato deliver this opening monologue that ensures viewers know the exact tone of what she’s about to show you.\n\n“I am Demi Lovato,” she says over a voiceover while clips from her life flash by. “I’m 25. The last decade has taught me a lifetime of lessons. I’ve learned that secrets make you sick. I’m learning how to be a voice and not a victim. I’ve learned that sex is natural. I’ve learned that love is necessary. Heartbreak is unavoidable, and loneliness is brutal. I’ve learned that the key to being happy is to tell your truth and be OK without all the answers. This is my story. This is Simply Complicated.”\n\nProof that she’s a perfectionist\n\nAll footage of Lovato recording several songs off Tell Me You Love Me features Lovato demanding as many takes as possible until it’s absolutely right — down to every single word recorded.\n\n“I really like this take,” her producer says during a studio session for “You Don’t Do It For Me Anymore.”\n\n“It’s just that last ‘Oh’ needs to be smoothed out,” Lovato responds from the booth.\n\nThe producer shrugs, “Yeah. I mean, in a perfect world, absolutely.”\n\n“Well, this should be a perfect world,” she says matter-of-factly. “It’s my album.”\n\nThe depths of her battles against addiction and bipolar disorder\n\nIt’s revealed — through interviews with Lovato, her mother, a childhood friend and her sister, Dallas — Lovato was bullied intensely in school as a child (by, Dallas says, “this core group of girls who honestly in my eyes were pure fucking evil”). It got to such a point that one girl in particular made a petition for Lovato to kill herself.\n\nShe became friends with one of the popular girls, who encouraged Lovato to start “partying,” which introduced Lovato to the alcohol and drugs (Adderall and cocaine) that she would soon be dependent on to get through days. Lovato says that the first time she used cocaine, when she was 17 years old and working on Disney Channel. “I was scared because my mom always told me that your heart could just burst if you do it,” she says. “But I did it anyways, and I loved it the first time that I did it.”\n\nLovato’s biological father, who was not part of her life since childhood before passing away from cancer in 2013, was an addict and alcoholic. “I guess I always searched for what he found in drugs and alcohol because it fulfilled him, and he chose that over a family.”\n\nThings got completely out of control in her teen years while touring with the Jonas Brothers, touring on her own and working on Camp Rock, touring for Camp Rock. Specifically, while touring for Camp Rock 2, Lovato threw a huge party at a hotel one night where she was drinking and using Adderall. Once she learned the next day that one of her dancers had told on her for using Adderall, she promptly punched that dancer in the face. This resulted in entering treatment for the first time at 18 years old and there, Lovato was officially diagnosed bipolar.\n\nThe treatment didn’t last, though. Once out, Lovato says, “I wasn’t working my program. I wasn’t ready to get sober. I was sneaking it on planes, sneaking it in bathrooms, sneaking it throughout the night. Nobody knew.”\n\nWhat followed was a two-month period where she was using every day. One night, she did cocaine and took Xanax. “I started to choke a little bit,” she says. “My heart started racing, and I remember thinking, ‘Oh my God, I might be overdosing right now.'”\n\nA separate time, in Palm Springs, she actually did almost overdose after locking her bedroom door — and when a nurse was carting her away to the hospital, she defiantly grabbed a bottle containing more pills and downed them all.\n\n“Demi was on a road to suicide”\n\nMike Bayer was contacted by Demi’s manager Phil McIntyre to help him help Demi. Bayer is now Lovato’s personal development coach. In the documentary, Bayer says, “Demi was on a road to suicide. She’d have bags of pills and an 8 ball of coke.”\n\nEither craving drugs or on drugs, she admits, “I was not easy to work with. I was using while I had a sober companion, and I went through about 20 different sober companions. I didn’t feel anything. I didn’t feel guilty. I didn’t feel embarrassed. I would sneak out, get drugs. I would fake my drug tests with other people’s pee, and I’d lie straight to their faces. It’s embarrassing to look back at the person that I was.”\n\nPhil McIntyre almost dropped her\n\nAnd that was the breaking point. “I was fully intending to drop her,” McIntyre says.\n\nEverybody on Lovato’s management team approached her one day to inform her that there was nothing more they could do for her. “It wasn’t a matter of if they were going to leave,” Lovato remembers. “It was, ‘We are leaving. There’s no more we can do for you.'”\n\n“I remember her crying,” Bayer remembers. “Going, ‘What the fuck do I need to do? What do I need to do?'”\n\nMembers of her management team told her to give them her cell phone. Lovato smashed it and dunked into water. “This was the gateway to everything,” McIntyre says while holding the shattered phone. “This was the wrong people, it was drug dealers, it was a lot of the negative influences in her life were coming through the cellphone.”\n\nThey still have that phone, but Lovato has been sober ever since.\n\n“You really have to lean into the people that are trying to support you,” Lovato says. “Like my family, like Mike and Phil. You really have to surrender because that’s when the change is gonna happen.”\n\nBest manager ever @philymack A post shared by Demi Lovato (@ddlovato) on Oct 6, 2017 at 6:47pm PDT\n\nShe used to want to be Amy Winehouse\n\nAs a young girl, Demi’s mother says, Demi had drawn a picture of what she perceived herself to look like in her diary. On the next page was a drawing of what “what I need to look like to be a star.” Demi pulls out a collage from her closet that she had made when she was younger, featuring women with bodies she wanted.\n\n“I wanted to be like them,” she says. “That was the chic look back then. I’ve got Amy Winehouse in there that I looked up to and wanted to be so badly. I wanted to be as thin as her, I wanted to sing like her, I wanted to be just like her.”\n\n“The pictures on her wall,” Lovato’s mother says. “And the pictures. And the models. This isn’t what you need to aspire to be like. This isn’t healthy. I never thought to say those things to her because I didn’t know myself. My desire for perfection, I think I’ve always been that way. I felt I had to be thin and beautiful and successful. … I may have passed that along to my kids.”\n\nShe knew she loved Wilmer Valderrama the minute she first saw him\n\nWhile in the car with one of her sisters and her mother in their home state Texas, Lovato begins crying remembering that the last time they were in Texas was for the funeral of her beloved great-grandmother whom she called Mamaw. Also realizing that it had been a year since she and Valderrama had broken up, she admits that she has never loved anybody the way she loved her ex-boyfriend.\n\n“I still love Wilmer,” she says. They first met when Lovato was 17 years old and he was 29. She remembers that they met on January 11, 2010, at his home for a PSA shoot.\n\n“To be honest, I only did it because I heard it was at his house,” she says, “and I thought he was really cute. I didn’t really care about the census forms. But when I met him and laid eyes on him for the first time, I was in hair and makeup and he came and sat down, and I was like, ‘I love this man, and I have to have him.'”\n\nOnce Lovato turned 18, they began dating — “I think it was love at first sight, and I don’t really believe in that, but I believe that it happened. We connected on a level that I’ve never connected with anybody before. He was just my rock, my everything.”\n\nWhen asked why she thinks they broke up, she says it has nothing to do with being in love but maybe being better as friends. Lovato knew she had some things she needed to take care of on her own without depending on somebody else to heal her loneliness.\n\nLovato and Valderrama are seen in the documentary at a party together seemingly very cordial and still friendly. “I don’t know if I’ll lose him for the rest of my life,” Lovato says. “I think my heart’s always with Wilmer. I think that it was with Wilmer, I think that it is with Wilmer, and I think that it will be. You don’t share six years with somebody and not give them a piece of your heart, and vice-versa. I’m pretty sure that I’m not gonna meet anybody that compares to him, but I’m trying to keep an open heart and an open mind when it comes to that.”\n\nProud to present… #SimplyComplicated. Watch the full documentary now on @YouTube!! Link is in my bio — A post shared by Demi Lovato (@ddlovato) on Oct 17, 2017 at 10:08am PDT\n\nShe is actively dating — even on celebrity dating app Raya — both men and women\n\n“I matched with somebody on Raya just now,” Lovato tells her stylist Avo Yermagyan.\n\nThe camera cuts to just Demi on the couch, where she says, “I am on the dating app with both guys and girls. I am open to human connection, so whether that’s through a male or a female, it doesn’t matter to me.”\n\nShe still struggles with an eating disorder\n\nWhile Lovato is singing “Smoke & Mirrors” (only available on the deluxe version of her album) in the background, she explains that there is still one demon she has not been able to fully conquer.\n\n“I haven’t relapsed in drugs and alcohol,” she says. “That’s something that I’m very proud of. I’m coming up on five and half years of sobriety, and that’s something that’s been difficult at times, but one thing that I haven’t fully conquered is my eating disorder.”\n\nWe then see Lovato in the back of a car with McIntyre, whom she tells that “a few nights ago” she had relapsed — bingeing and purging — triggered because she started to miss Wilmer. “The less I have to think about food, the easier it is for me to go about having a normal life,” she says. “And I don’t want to let anybody down. So when I do have moments when I slip up, I feel very ashamed.”\n\n“When I was in a relationship with Wilmer, I went three years without purging,” she continues. “When we broke up, that’s one of the first things I did. When I feel lonely, my heart feels hungry, and then I end up bingeing, and I don’t know how to figure out how to be alone.”\n\nLovato says that her first addiction was food, she is constantly thinking about food and she is envious of the people who don’t have to struggle with an eating disorder.\n\nMMA and Brazilian jujitsu has become a saving grace for her\n\nThanks to her personal development coach, Bayer, Lovato latched onto Unbreakable Gym just after her breakup with Valderrama. There, she trains in MMA and jujitsu. Her goal is to one day earn a black belt.\n\n“The gym really helps,” she says. “I know that I would be a very dark place without it. Any time I’m able to take my mind off of any of my addictions, it’s very beneficial to me because you’re constantly thinking about what the next move is. The technique, the strategy… Working out is a form of meditation to me because I’m not focused on anything in my head. It can transport you to a totally different place. I’m on a journey to discover what it’s like to be free of all demons.”\n\nYou can watch the full documentary below:", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif", "https://www.billboard.com/wp-content/uploads/media/demi-lovato-simply-complicated-2017-billboard-1548.jpg?w=1024"], "top_img": "https://www.billboard.com/wp-content/uploads/media/demi-lovato-simply-complicated-2017-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Megan Armstrong"], "canonical_link": "https://www.billboard.com/music/pop/demi-lovato-simply-complicated-documentary-youtube-best-moments-8005791/", "title": "The 10 Most Honest Confessions From Demi Lovato’s ‘Simply Complicated’ YouTube Documentary", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "Demi Lovato peeled back all the layers on Tuesday (Oct. 17) with the arrival of her documentary, Demi Lovato: Simply Complicated, exclusively to YouTube.", "news_keywords": "billboard news, demi lovato, TCD", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 8005791, "author": "Megan Armstrong", "pmc-category": "Music,Pop", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-10-18T13:26:26"}, "pmc-tag": "billboard news,demi lovato,TCD", "title": "The 10 Most Honest Confessions From Demi Lovato’s ‘Simply Complicated’ YouTube Documentary", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Megan Armstrong", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 8005791, "title": "The 10 Most Honest Confessions From Demi Lovato's 'Simply Complicated' YouTube Documentary", "published_at": "2017-10-18 13:26:26", "image": "https://www.billboard.com/wp-content/uploads/media/demi-lovato-simply-complicated-2017-billboard-1548.jpg?w=1024", "comment_count": 0, "tags": "TCD", "topics": "Pop", "body": "Demi Lovato peeled back all the layers on Tuesday (Oct. 17) with the arrival of her documentary, Demi Lovato: Simply Complicated, exclusively to YouTube. The documentary was directed by Hannah Lux Davis and is time-capsuled by the creation of her sixth studio album Tell Me You Love Me (Sept. 29). It's no coincidence that Lovato's new documentary coincides with her most vulnerable music to date. Simply Complicated is just under an hour and 20 minutes long with not a minute wasted. In the first minute, we learn from Demi herself, \"I actually had anxiety around this interview because the last time I did an interview this long, I was on cocaine.\" Here are 10 of the most honest, revealing moments from Simply Complicated. The opening monologue We all knew that the purpose of this documentary was to let every crevice of who Demi Lovato has been and is now breathe, but there's something quite poignant when hearing Lovato deliver this opening monologue that ensures viewers know the exact tone of what she's about to show you. \"I am Demi Lovato,\" she says over a voiceover while clips from her life flash by. \"I'm 25. The last decade has taught me a lifetime of lessons. I've learned that secrets make you sick. I'm learning how to be a voice and not a victim. I've learned that sex is natural. I've learned that love is necessary. Heartbreak is unavoidable, and loneliness is brutal. I've learned that the key to being happy is to tell your truth and be OK without all the answers. This is my story. This is Simply Complicated.\"Proof that she's a perfectionistAll footage of Lovato recording several songs off Tell Me You Love Me features Lovato demanding as many takes as possible until it's absolutely right -- down to every single word recorded. \"I really like this take,\" her producer says during a studio session for \"You Don't Do It For Me Anymore.\" \"It's just that last 'Oh' needs to be smoothed out,\" Lovato responds from the booth. The producer shrugs, \"Yeah. I mean, in a perfect world, absolutely.\"\"Well, this should be a perfect world,\" she says matter-of-factly. \"It's my album.\" The depths of her battles against addiction and bipolar disorderIt's revealed -- through interviews with Lovato, her mother, a childhood friend and her sister, Dallas -- Lovato was bullied intensely in school as a child (by, Dallas says, \"this core group of girls who honestly in my eyes were pure fucking evil\"). It got to such a point that one girl in particular made a petition for Lovato to kill herself. She became friends with one of the popular girls, who encouraged Lovato to start \"partying,\" which introduced Lovato to the alcohol and drugs (Adderall and cocaine) that she would soon be dependent on to get through days. Lovato says that the first time she used cocaine, when she was 17 years old and working on Disney Channel. \"I was scared because my mom always told me that your heart could just burst if you do it,\" she says. \"But I did it anyways, and I loved it the first time that I did it.\" Lovato's biological father, who was not part of her life since childhood before passing away from cancer in 2013, was an addict and alcoholic. \"I guess I always searched for what he found in drugs and alcohol because it fulfilled him, and he chose that over a family.\"Things got completely out of control in her teen years while touring with the Jonas Brothers, touring on her own and working on Camp Rock, touring for Camp Rock. Specifically, while touring for Camp Rock 2, Lovato threw a huge party at a hotel one night where she was drinking and using Adderall. Once she learned the next day that one of her dancers had told on her for using Adderall, she promptly punched that dancer in the face. This resulted in entering treatment for the first time at 18 years old and there, Lovato was officially diagnosed bipolar.The treatment didn't last, though. Once out, Lovato says, \"I wasn't working my program. I wasn't ready to get sober. I was sneaking it on planes, sneaking it in bathrooms, sneaking it throughout the night. Nobody knew.\"What followed was a two-month period where she was using every day. One night, she did cocaine and took Xanax. \"I started to choke a little bit,\" she says. \"My heart started racing, and I remember thinking, 'Oh my God, I might be overdosing right now.'\" A separate time, in Palm Springs, she actually did almost overdose after locking her bedroom door -- and when a nurse was carting her away to the hospital, she defiantly grabbed a bottle containing more pills and downed them all.\"Demi was on a road to suicide\" Mike Bayer was contacted by Demi's manager Phil McIntyre to help him help Demi. Bayer is now Lovato's personal development coach. In the documentary, Bayer says, \"Demi was on a road to suicide. She'd have bags of pills and an 8 ball of coke.\" Either craving drugs or on drugs, she admits, \"I was not easy to work with. I was using while I had a sober companion, and I went through about 20 different sober companions. I didn't feel anything. I didn't feel guilty. I didn't feel embarrassed. I would sneak out, get drugs. I would fake my drug tests with other people's pee, and I'd lie straight to their faces. It's embarrassing to look back at the person that I was.\"Phil McIntyre almost dropped her And that was the breaking point. \"I was fully intending to drop her,\" McIntyre says.Everybody on Lovato's management team approached her one day to inform her that there was nothing more they could do for her. \"It wasn't a matter of if they were going to leave,\" Lovato remembers. \"It was, 'We are leaving. There's no more we can do for you.'\" \"I remember her crying,\" Bayer remembers. \"Going, 'What the fuck do I need to do? What do I need to do?'\" Members of her management team told her to give them her cell phone. Lovato smashed it and dunked into water. \"This was the gateway to everything,\" McIntyre says while holding the shattered phone. \"This was the wrong people, it was drug dealers, it was a lot of the negative influences in her life were coming through the cellphone.\" They still have that phone, but Lovato has been sober ever since.\"You really have to lean into the people that are trying to support you,\" Lovato says. \"Like my family, like Mike and Phil. You really have to surrender because that's when the change is gonna happen.\" Best manager ever @philymackA post shared by Demi Lovato (@ddlovato) on Oct 6, 2017 at 6:47pm PDTShe used to want to be Amy WinehouseAs a young girl, Demi's mother says, Demi had drawn a picture of what she perceived herself to look like in her diary. On the next page was a drawing of what \"what I need to look like to be a star.\" Demi pulls out a collage from her closet that she had made when she was younger, featuring women with bodies she wanted. \"I wanted to be like them,\" she says. \"That was the chic look back then. I've got Amy Winehouse in there that I looked up to and wanted to be so badly. I wanted to be as thin as her, I wanted to sing like her, I wanted to be just like her.\" \"The pictures on her wall,\" Lovato's mother says. \"And the pictures. And the models. This isn't what you need to aspire to be like. This isn't healthy. I never thought to say those things to her because I didn't know myself. My desire for perfection, I think I've always been that way. I felt I had to be thin and beautiful and successful. ... I may have passed that along to my kids.\"She knew she loved Wilmer Valderrama the minute she first saw himWhile in the car with one of her sisters and her mother in their home state Texas, Lovato begins crying remembering that the last time they were in Texas was for the funeral of her beloved great-grandmother whom she called Mamaw. Also realizing that it had been a year since she and Valderrama had broken up, she admits that she has never loved anybody the way she loved her ex-boyfriend.\"I still love Wilmer,\" she says. They first met when Lovato was 17 years old and he was 29. She remembers that they met on January 11, 2010, at his home for a PSA shoot. \"To be honest, I only did it because I heard it was at his house,\" she says, \"and I thought he was really cute. I didn't really care about the census forms. But when I met him and laid eyes on him for the first time, I was in hair and makeup and he came and sat down, and I was like, 'I love this man, and I have to have him.'\" Once Lovato turned 18, they began dating -- \"I think it was love at first sight, and I don't really believe in that, but I believe that it happened. We connected on a level that I've never connected with anybody before. He was just my rock, my everything.\" When asked why she thinks they broke up, she says it has nothing to do with being in love but maybe being better as friends. Lovato knew she had some things she needed to take care of on her own without depending on somebody else to heal her loneliness. Lovato and Valderrama are seen in the documentary at a party together seemingly very cordial and still friendly. \"I don't know if I'll lose him for the rest of my life,\" Lovato says. \"I think my heart's always with Wilmer. I think that it was with Wilmer, I think that it is with Wilmer, and I think that it will be. You don't share six years with somebody and not give them a piece of your heart, and vice-versa. I'm pretty sure that I'm not gonna meet anybody that compares to him, but I'm trying to keep an open heart and an open mind when it comes to that.\"  Proud to present… #SimplyComplicated. Watch the full documentary now on @YouTube!! Link is in my bio --A post shared by Demi Lovato (@ddlovato) on Oct 17, 2017 at 10:08am PDT She is actively dating -- even on celebrity dating app Raya -- both men and women \"I matched with somebody on Raya just now,\" Lovato tells her stylist Avo Yermagyan.The camera cuts to just Demi on the couch, where she says, \"I am on the dating app with both guys and girls. I am open to human connection, so whether that's through a male or a female, it doesn't matter to me.\" She still struggles with an eating disorder While Lovato is singing \"Smoke & Mirrors\" (only available on the deluxe version of her album) in the background, she explains that there is still one demon she has not been able to fully conquer. \"I haven't relapsed in drugs and alcohol,\" she says. \"That's something that I'm very proud of. I'm coming up on five and half years of sobriety, and that's something that's been difficult at times, but one thing that I haven't fully conquered is my eating disorder.\" We then see Lovato in the back of a car with McIntyre, whom she tells that \"a few nights ago\" she had relapsed -- bingeing and purging -- triggered because she started to miss Wilmer. \"The less I have to think about food, the easier it is for me to go about having a normal life,\" she says. \"And I don't want to let anybody down. So when I do have moments when I slip up, I feel very ashamed.\" \"When I was in a relationship with Wilmer, I went three years without purging,\" she continues. \"When we broke up, that's one of the first things I did. When I feel lonely, my heart feels hungry, and then I end up bingeing, and I don't know how to figure out how to be alone.\" Lovato says that her first addiction was food, she is constantly thinking about food and she is envious of the people who don't have to struggle with an eating disorder.MMA and Brazilian jujitsu has become a saving grace for herThanks to her personal development coach, Bayer, Lovato latched onto Unbreakable Gym just after her breakup with Valderrama. There, she trains in MMA and jujitsu. Her goal is to one day earn a black belt. \"The gym really helps,\" she says. \"I know that I would be a very dark place without it. Any time I'm able to take my mind off of any of my addictions, it's very beneficial to me because you're constantly thinking about what the next move is. The technique, the strategy... Working out is a form of meditation to me because I'm not focused on anything in my head. It can transport you to a totally different place. I'm on a journey to discover what it's like to be free of all demons.\"You can watch the full documentary below:", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "The 10 Most Honest Confessions From Demi Lovato’s ‘Simply Complicated’ YouTube Documentary", "url": "https://www.billboard.com/music/pop/demi-lovato-simply-complicated-documentary-youtube-best-moments-8005791/", "description": "Demi Lovato peeled back all the layers on Tuesday (Oct. 17) with the arrival of her documentary, Demi Lovato: Simply Complicated, exclusively to YouTube.", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/demi-lovato-simply-complicated-2017-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Demi Lovato: Simply Complicated"}, "locale": "en_US"}, "article": {"published_time": "2017-10-18T17:26:26+00:00", "modified_time": "2017-10-19T13:11:09+00:00"}, "twitter": {"site": "@billboard", "creator": "@meganKarmstrong", "card": "summary_large_image", "title": "The 10 Most Honest Confessions From Demi Lovato’s ‘Simply Complicated’ YouTube Documentary", "description": "Demi Lovato peeled back all the layers on Tuesday (Oct. 17) with the arrival of her documentary, Demi Lovato: Simply Complicated, exclusively to YouTube.", "image": "https://www.billboard.com/wp-content/uploads/media/demi-lovato-simply-complicated-2017-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1508347586.0, "source": "https://www.billboard.com", "summary": ""}