{"url": "www.cosmopolitan.com/entertainment/celebs/a12455476/kylie-jenner-travis-scott-relationship-timeline/", "text": "Kylie Jenner and Travis Scott’s relationship has been a roller coaster of a surprise pregnancies, maybe engagements, cheating rumors, and breakup reports—and honestly, it’s exhausting. But it’s also all kinds of juicy, so let’s go back to the beginning! It’s a wild ride, to put it mildly, so buckle the hell up.\n\nGiphy\n\nApril 16, 2017\n\nKylie and Travis spark romance rumors after being spotted together at a Coachella party. One source tells People that the two have been friends “for a while,” noting that things are not serious and that Kylie has been trying to make her ex-boyfriend Tyga jealous “by hanging out with other guys.” Got it!!!!!!\n\nApril 25, 2017\n\nKylie and Travis are spotted together again, this time sitting courtside at a NBA playoff game in Houston. The pair “definitely looked like a couple cuddled up next to each other among her friends” and were “super handhold-y,” according to one People witness.\n\n\n\nGetty\n\nApril 30, 2017\n\nE! News reports that Kylie and Travis spent the weekend together in Boston, where he was scheduled to perform two shows. According to one source, “they looked really into each other” and were spotted dancing and making out. Hours after E!’s report, Kylie is spotted at Cipriani in New York City for Travis’s 25th birthday party. Innnteresting….\n\nGetty\n\nMay 4, 2017\n\nA blonde Kylie sort of makes things Instagram official in a group photo taken during the 2017 Met Gala. (Travis is the one hiding behind his own hands.)\n\nMay 8, 2017\n\nKylie and Travis hit Miami together ahead of the rapper’s appearance at the Rolling Loud Festival. As seen in photos obtained by E! News, Travis wrapped his arms around Kylie’s shoulders while holding hands and stepping out in matching graphic T-shirts.\n\nJune 12, 2017\n\nTravis writes on Twitter, “Legit happiest day of my life.” (Fans would not associate this with Kylie’s pregnancy for another three months.)\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nLegit happiest day of my life. — TRAVIS SCOTT (@trvisXX) June 12, 2017\n\nJune 13, 2017\n\nAs seen on Snapchat, Kylie and Travis get matching butterfly tattoos, with hers on her right ankle and his on his left ankle.\n\nSnapchat | Kylie Jenner\n\nSnapchat | Kylie Jenner\n\nJuly 8, 2017\n\nKylie joins Kendall Jenner, Bella Hadid, and their friends to watch Travis perform at the Wireless Festival in London, England.\n\nGetty\n\nAugust 6, 2017\n\nAmid rumors of a breakup, Kylie is spotted leaving the Staples Center after watching her boyfriend open for Kendrick Lamar, according to photos obtained by TMZ.\n\nAugust 10, 2017\n\nFollowing another show with Kendrick, Travis pulls out all the stops to throw a surprise party for Kylie for her 20th birthday. In this case, “all the stops” literally means a chocolate fountain, balloons, and an ice sculpture of Kylie’s butt. No, really.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nSeptember 22, 2017\n\nMultiple outlets report that Kylie and Travis are expecting their first child together. TMZ says Kylie began to tell friends in early September, while Page Six reports that the couple is expecting a girl.\n\nMeanwhile, Kylie shares this photo of herself wearing an oversize shirt with her friends on Snapchat. If you squint, you might be able to make out a shape of some sort. Maybe.\n\nSnapchat | Kylie Jenner\n\nOctober 10, 2017\n\nNo confirmation? No problem. Kylie fans continue to speculate on her pregnancy, this time focusing on a Snapchat of pink and blue phone cases. Kylie’s caption, “Which one? I’m thinking blue,” and her blue heart emoji is read by many as her announcement that she’s having a boy.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nBREAKING : Kylie Jenner pretty much confirmed she is having a baby boy #KeepItKardashian pic.twitter.com/t1LsiagRO2 — Michele Calicchio (@micheleecalicc) October 9, 2017\n\nNovember 5, 2017\n\nKylie slams the Daily Mail for publishing photos that she claims were photoshopped and “clearly altered.”\n\n\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nFirst of all if you’re going to photoshop my photos blogs/paps!! Check for the crooked lines in the background.2nd photo is clearly altered pic.twitter.com/c9fi0EyhWB — Kylie Jenner (@KylieJenner) November 5, 2017\n\nThe photos in question show Kylie boarding a private jet with Kendall and Kourtney while wearing a baggy sweatshirt. In response, the Daily Mail says “the pictures have not been digitally altered.” The photographer’s original outlet, X17Online, also added, “100% REAL! No Photoshop, #NoFilter, no additives, no preservatives—all organic and all REAL!” (via People).\n\nJanuary 5, 2018\n\nIn an interview with Billboard, Travis gives a non-answer to the Kylie pregnancy question. Here’s the brief exchange:\n\nBillboard: Have you spoken to your father about becoming a father yourself?\n\nTravis Scott: Uh...for what?\n\nBillboard: There are these rumors that you’re dating Kylie and having a child with her....\n\nTravis: I don’t want to talk about that. They’re just guesses. Let them keep fishing.\n\nFebruary 1, 2018\n\nKylie and Travis welcome their daughter into the world, although they won’t go public with the news for another three days.\n\nFebruary 4, 2018\n\nKylie announces the birth of their child via Instagram, writing:\n\n“I’m sorry for keeping you in the dark through all the assumptions. I understand you’re used to me bringing you along on all my journeys. My pregnancy was one I chose not to do in front of the world. I knew for myself I needed to prepare for this role of a lifetime in the most positive, stress-free, and healthy way I knew how. There was no gotcha moment, no big paid reveal I had planned. I knew my baby would feel every stress and every emotion so I chose to do it this way for my little life and our happiness.”\n\nShe also releases an 11-minute video documenting her pregnancy and the days leading up to the birth of her daughter:\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nTravis confirms the baby news on Twitter:\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n2.1.18\n\n4 ever\n\nNew rager in town. !!! — TRAVIS SCOTT (@trvisXX) February 4, 2018\n\nKylie’s family and friends also share welcome messages for the baby on social media:\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nGod is SO good!! I am so excited and thrilled to welcome another precious baby girl to our beautiful, ever growing family. We are blessed beyond belief! https://t.co/lFrymHVFTs @KylieJenner — Kris Jenner (@KrisJenner) February 4, 2018\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nFebruary 18, 2018\n\nSpeaking to the paparazzi while leaving a nightclub in L.A., Travis is asked about his new baby girl. “She’s beautiful,” he responds, via TMZ. Aw.\n\n\n\nThree days later, Kylie finally tweets about her daughter for the first time since her birth. Responding to an important fan question about how the baby is doing, Kylie reveals that Stormi “looks just like me when I was a baby.”\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nshe’s good 😊 still staring at her all day. she looks just like me when i was a baby 😊 https://t.co/fEFsSeNO6Z — Kylie Jenner (@KylieJenner) February 21, 2018\n\nFebruary 25, 2018\n\nKylie and Travis emerge in public for the first time since becoming parents and their ride isn’t your usual four-wheel anything. As seen on Snapchat, Travis’s push present to Kylie is a $1.4 million Ferrari LaFerrari. “Can’t believe she’s mine,” Kylie writes in one of her social media updates of her new ride. It’s safe to say those words could also be applied to baby Stormi.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMarch 8, 2018\n\nKylie causes a fan freakout after sharing a photo of herself wearing a ring with Travis’s initials (his birth name is Jacques Webster) on her RING finger. You know who also has “JW” for initials though? Former BFF Jordyn Woods.\n\n\n\nKylie Jenner\n\nApril 1, 2018\n\nKylie and Travis celebrate Stormi’s first Easter by sharing the cutest videos ever of their baby girl.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nApril 9, 2018\n\nKylie, Travis, and Stormi jet off to Texas to introduce the 9-week-old baby to Travis’s extended family. According to TMZ, Travis spent a cool $7,145 for the party, which included six floral sculptures that resembled storm clouds and raindrops made out of Swarovski crystals.\n\nApril 28, 2018\n\nKylie celebrates Travis’s 26th birthday early by renting out Six Flags and providing guests with customized Travis Scott hoodies. The cake was the best part though: a custom creation shaped like a roller coaster with Travis, Kylie, and Stormi on top.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMay 3, 2018\n\nKylie and Travis take 3-month-old Stormi on vacation to Turks and Caicos. FOMO, etc.\n\nMay 7, 2018\n\nKylie steps out in Alexander Wang to attend the 2018 Met Gala with Travis, who opts for a matching military-style suit. (The event is the couple’s first red-carpet appearance.)\n\n\n\nGetty\n\nGetty\n\nGetty\n\nMay 15, 2018\n\nKylie shuts down rumors that her bodyguard Tim Chung is Stormi’s biological father. Taking to Instagram, naturally, Kylie shares a photo of herself and Travis at the Met Gala, along with the epic caption, “Stormi’s Parents.”\n\nJune 22, 2018\n\nKylie and Travis head to France with baby Stormi for some R&R. They hit up Virgil Abloh’s first show for Louis Vuitton (and sit with Kimye), drop by Cannes for Travis’s show, and take plenty of photos.\n\n\n\nGetty\n\nGetty\n\ngetty\n\nJuly 17, 2018\n\nKylie and Travis are GQ’s August 2018 cover stars—a first for the couple.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nIn their joint interview, Kylie reveals that Travis isn’t a fan of the attention that comes with dating someone from the Kardashian-Jenner clan. “That’s why we just go the extra mile to keep our relationship super private, or, like, if he has events or something, I won’t come,” she tells GQ. “Because I want him to do his own thing. I want him to be him. I don’t want it to be Kylie and Trav. If people don’t ever see us together, that’s okay with me, because we just do our thing.”\n\nOctober 7, 2018\n\nKylie uploads a video of Travis to Instagram Stories, casually calling him “hubby” in the process. Um…something you wanna tell us, Kylie?\n\nDecember 3, 2018\n\nKylie trolls everyone with a since-expired Instagram of her and Trav, both wearing wedding-day white with a ring emoji atop their heads. Naturally, fans freak:\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nI swearrrrrr Kylie & Travis got married on the sneak @KylieJenner @trvisXX — 🤷🏽‍♀️ (@iLiveFor_Court) December 3, 2018\n\nDecember 4, 2018\n\nFake photos of Travis “cheating” on Kylie surface online, and Travis quickly shuts them down on both Instagram…\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n…and Instagram Stories:\n\nInstagram\n\nWhen the photos are revealed to be a prank, Kylie weighs in, writing, “IDK if this is really a social experiment to some people, but you’re messing with real people, real relationships, real family. I’m happy my relationship is strong because this is getting out of hand. The internet scares me sometimes for real.”\n\nJanuary 18, 2019\n\nKylie and Travis go on a tropical vacation with Stormi and take a cute kissy pic.\n\nJanuary 21, 2019\n\nKylie goes ahead and shuts down rumors that she’s pregnant after teasing a ~surprise~:\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nJanuary 23, 2019\n\nKylie posts an Instagram pic with the caption “extraño a mi esposo,” which means “I miss my husband” in Spanish.\n\nUmm, WHAT ARE YOU TRYING TO TELL US, KYLIE.\n\nFebruary 4, 2019\n\nFollowing rumors that Travis planned to propose at the Super Bowl, he shares a photo of Kylie wearing a massive rock on her ring finger. Ahem!\n\nInstagram\n\nFebruary 11, 2019\n\nKylie and Travis hit up the Grammys, where they go ahead and kiss on the red carpet. ’Cause why the f*ck not.\n\nGetty Images\n\nFebruary 14, 2019\n\nTravis goes ALL OUT for Valentine’s Day, surprising Kylie with an entire house full of roses.\n\nFebruary 18, 2019\n\nKylie reveals what LOOKS to be that engagement ring on Instagram Stories...but still doesn’t confirm anything, sigh.\n\nMarch 1, 2019\n\nReports break that Kylie accused Travis of cheating, prompting him to cancel a show and fly home. Travis’s rep shuts down the claims, saying the rapper “strongly” denies allegations of cheating and that “the reason he stayed home from his show” was “very much because of illness.”\n\nMarch 2, 2019\n\nTravis deletes Instagram, reportedly to prove to Kylie that he isn’t DM’ing other girls.\n\nInstagram\n\nApril 30, 2019\n\nCheating rumors? What cheating rumors? Everything seems totally fine between Kylie and Travis at this point! For Travis’s 28th birthday, Kylie writes a sweet tribute, calling him her “real life bestie & hubby wrapped into one” while hinting at baby number two in the future.\n\nMay 6, 2019\n\nTravis and Kylie kiss at the Met Gala!\n\nKevin Mazur/MG19 Getty Images\n\nAugust 15, 2019\n\nKylie pulls out all the stops for her 22nd birthday, throwing a huge weeklong European vacation party that obviously includes Travis and Stormi (and her mom, but Kylie didn’t invite Kris to her birthday at first, LOL).\n\nKylie Jenner Instagram\n\nAugust 28, 2019\n\nKylie, Travis, and Stormi walked the red carpet together for the first time for the premiere of Travis’s Netflix documentary, Travis Scott: Look Mom I Can Fly.\n\nTommaso Boddi Getty Images\n\nSeptember 13, 2019\n\nIn a special Pleasure Issue of Playboy, Kylie graces the cover and both she and Travis talk about their sex life. As you do!\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nBasically, they say their sex life hasn’t changed a bit since Kylie had Stormi. Kylie also says this:\n\n“You remind me that motherhood and sexuality can coexist and just because you embrace your sexuality doesn’t mean you have loose morals or you’re not a good mother. You can be sexy and still be a badass mom.”\n\nOctober 1, 2019\n\nTMZ reports that Kylie and Travis broke up sometime after their last public appearance on August 27 (which makes those Playboy quotes a little awk in retrospect...).\n\nAccording to the outlet, Kylie and Travis are “both single” and “walking away from their relationship” after “trying to make the relationship work for a while.”\n\nEven so, not all hope is lost! They’ve apparently taken breaks before and “managed to work it out,” so maybe this isn’t the END end.\n\nOctober 16, 2019\n\nKylie might not be sold on dating Travis, but you know who is? Her entire family, apparently.\n\n“Her family wants them to be together. Travis might not be perfect, but he’s a great partner and dad,” a source told People. “Everyone would be upset if Kylie can’t figure things out with Travis.”\n\nOctober 29, 2019\n\nNew sources come out and say that even though Kylie and Travis are cool post-breakup, it doesn’t look like a reunion is in the cards.\n\n“Kylie and Travis are still not back together,” the source says. “It doesn’t look like they will immediately reconcile anymore. They have differing objectives and two different lives.”\n\nA source had previously told the outlet that “Kylie is doing fine since her breakup with Travis” and that they’ve stayed “extremely close” for their daughter, Stormi. “They love each other and they share a daughter that will bind them together for life,” a second source added. “They’ve been great partners in that respect. They are both putting aside any romantic differences to be the best parents in the world for their daughter.”\n\nDecember 2, 2019\n\nKylie and Travis spark reconciliation rumors after getting very ~flirty~ over Thanksgiving. Check out the vid for yourself:\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMarch 25, 2020\n\nMason Disick iconically hops on Insta Live and exposes Travis and Kylie’s relationship status, telling his followers, “No, Kylie and Travis are not back together.”\n\nApril 13, 2020\n\nNews breaks that Travis and Kylie are quarantining together in Palm Springs. Mostly because fans hear his voice in the background of this Instagram (that’s some next-level sleuthing!):\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nApril 30, 2020\n\nKylie shouts out Travis on his birthday, writing a super-sweet Insta post dedicated to him and Stormi:\n\nJune 4, 2020\n\nA source tells Us Weekly that Travis “is still hopeful that there’s a chance [he and Kylie will] reconcile” and apparently “they stay in touch and hang out.” However, the source notes that the former couple “isn't back together” just yet.\n\nJune 21, 2020\n\nKylie and Travis spend Father’s Day with their baby girl, and Kylie goes ALL OUT with the decor.\n\nOctober 17, 2020\n\nTravis and Kylie get the rumor mill churning with a shoot that is equal parts random and thirsty.\n\nFebruary 2, 2021\n\nStill TBD on what Kylie and Travis’s relationship status is, but an E! News source tells the outlet, “Kylie and Travis are still madly in love. You can tell every time they are together that there is a lot of love there. Both of their faces light up when they are together and both seem very happy.”\n\nThe source adds, “Kylie and Travis spend a lot of time together with Stormi as a family and aren’t ruling out getting back together. They aren’t putting pressure on the relationship right now.”\n\nMay 5, 2021\n\nEntertainment Tonight reports that Kylie and Travis are back together! Er…well, kinda. Their source claims they “are messing around and having fun together. They’ve always had a strong connection and chemistry and they’re exploring their relationship romantically again.”\n\nMay 21, 2021\n\nOkay, so ~sources~ are coming through with more intel, but not everything is what meets the eye. TMZ falsely claims Kylie and Travis are in an open relationship, but Kylie herself has a lot to say about that and did not hold back in calling it out as untrue:\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nyou guys really just make up anything. pic.twitter.com/Q0LPxgiRGg — Kylie Jenner (@KylieJenner) May 21, 2021\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\ni’m not discrediting anyone who is in an open relationship but it’s just careless and disrespectful to throw this narrative out there without knowing what’s true. — Kylie Jenner (@KylieJenner) May 21, 2021\n\nJune 15, 2021\n\nKylie and Travis show up at a benefit together with their daughter, Stormi:\n\nCraig Barritt Getty Images\n\nAugust 20, 2021\n\nNews breaks that Kylie and Travis are expecting their second child together!\n\nAugust 28, 2021\n\nA source close to Kylie and Travis tells ET Online they are “in a great place” and “have always wanted to give Stormi a sibling and having another child was always part of their plan.”\n\n“Kylie absolutely loves being a mom and is so excited to be a new mom again. Kylie and Travis are in a great place and really committed to being the best parents possible. Kylie is a super-hands-on mom and is always laughing and smiling with Stormi. Travis loves spoiling Stormi. They both plan on doing the same with their new little one. The whole family is thrilled.”\n\nNovember 6, 2021\n\nKylie and Travis release statements amid the tragic crowd surge at Houston’s Astroworld Festival.\n\n“I’m absolutely devastated by what took place last night,” Travis writes on Twitter. “My prayers go out to the families and all those impacted by what happened at Astroworld Festival. Houston PD has my total support as they continue to look into the tragic loss of life. I am committed to working together with the Houston community to heal and support the families in need. Thank you to Houston PD, Fire Department, and NRG Park for their immediate response and support. Love You All.”\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nKylie also releases a statement on Instagram, saying, “Travis and I are broken and devastated. My thoughts and prayers are with all who lost their lives, were injured or affected in any way by yesterday’s events. And also for Travis, who I know cares deeply for his fans and the Houston community. I want to make it clear we weren’t aware of any fatalities until the news came out after the show and in no world would have continued filming or performing. I am sending my deepest condolences to all the families during this difficult time and will be praying for the healing of everyone who has been impacted.”\n\nFebruary 6, 2022\n\nKylie announces the arrival of her and Travis’s son, who was born on 2/2/22.\n\nMarch 21, 2022\n\nKylie shares a nine-minute mini documentary about her baby boy with home footage of her and Travis:\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nKylie later lets everyone know that her and Travis’s son is no longer named Wolf (the original name they gave him), saying, “FYI our son’s name isn’t Wolf anymore. 😅😅 We just really didn’t feel like it was him. Just wanted to share because I keep seeing Wolf everywhere. 🙏”\n\nMarch 26, 2022\n\nA source tells Entertainment Tonight that Kylie and Travis are “getting used to having two little kids and it’s a day-by-day process, but overall, they are doing great.”\n\n“They were prepared as they could be for this, and both of them wanted it more than anything. Having two kids made a big difference for them as parents and in their own relationship in a positive way. Travis has always been an extremely hands-on dad, and he has been by Kylie’s side. He is a dedicated dad and very protective of their family. Kylie and the rest of the Kardashians and Jenners absolutely adore that about him. He makes sure to show Kylie and their little ones how loved they are in many ways. They are doing well as a couple since welcoming their son.”\n\nMay 15, 2022\n\nKylie and Travis appear at the 2022 Billboard Music Awards looking all kinds of coupled up:\n\nAxelle/Bauer-Griffin Getty Images\n\nAnd they bring Stormi along for the event!\n\nChristopher Polk/NBC Getty Images\n\nMay 27, 2022\n\nA source tells Us Weekly that while Kylie and Travis have “swerved the topic” of engagement for years, the couple have “not ruled it out.”\n\n“The priority has been about taking care of the kids,” the source says. “Keeping things between themselves calm and chilled and setting up boundaries that will give them the best chance of staying together in the long term.”\n\nNoted!\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-and-travis-scott-attend-the-2022-billboard-news-photo-1653313220.jpg?crop=1.00xw:0.752xh;0,0&resize=1200:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/8vhebvzz-1653310377.jpg?crop=1.00xw:0.892xh;0,0&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-and-travis-scott-attend-the-2022-billboard-news-photo-1653313220.jpg?crop=1.00xw:0.752xh;0,0&resize=1200:*", "keywords": [], "authors": ["Peggy Truong", "Entertainment Writer", "Peggy Is Cosmopolitan.Com S Entertainment Writer", "Specializing In Leonardo Dicaprio", "This Is Us", "The Royals."], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a12455476/kylie-jenner-travis-scott-relationship-timeline/", "title": "A Definitive Timeline of Kylie Jenner and Travis Scott’s Relationship", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "A Definitive Timeline of Kylie Jenner and Travis Scott’s Relationship", "description": "“Travis really respects Kylie and worships the ground she walks on.”", "url": "https://www.cosmopolitan.com/entertainment/celebs/a12455476/kylie-jenner-travis-scott-relationship-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-and-travis-scott-attend-the-2022-billboard-news-photo-1653313220.jpg?crop=1.00xw:0.752xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2022-08-10T18:03:44Z", "published_time": "2022-05-27T12:46:00Z", "section": "Celebs", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-and-travis-scott-attend-the-2022-billboard-news-photo-1653313220.jpg?crop=1.00xw:0.752xh;0,0&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Kylie Jenner and Travis Scott's Relationship Timeline", "description": "From Coachella to their baby Stormi, here's how Kylie Jenner and Travis Scott's relationship has blossomed before their breakup.", "keywords": "kylie jenner, travis scott, kylie jenner travis scott dating, kylie jenner travis scott relationship timeline, who is travis scott, kylie jenenr boyfriend, kylie jenner pregnant, kylie jenner baby", "auto-publish": "never", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-and-travis-scott-attend-the-2022-billboard-news-photo-1653313220.jpg?crop=0.668xw:1.00xh;0.268xw,0.00240xh&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,celebs,travis scott,Kylie JEnner", "sailthru.date": "2022-05-27T12:46:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-and-travis-scott-attend-the-2022-billboard-news-photo-1653313220.jpg?crop=1.00xw:0.752xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/kylie-jenner-and-travis-scott-attend-the-2022-billboard-news-photo-1653313220.jpg?crop=0.668xw:1.00xh;0.268xw,0.00240xh", "sailthru.socialtitle": "A Definitive Timeline of Kylie Jenner and Travis Scott’s Relationship", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1653655560.0, "source": "http://www.cosmopolitan.com", "summary": ""}