{"url": "https://abcnews.go.com/GMA/Style/ciara-opens-style-music-level-controversy/story?id=53768035", "text": "In her debut music video, an 18-year-old Ciara introduced herself to R &B music lovers wearing jeans paired with a deep V-neck bodysuit. The sexy, girl-next-door completed the look with a pair of tennis shoes and over-sized gold hoops.\n\nIn the 14 years after the Atlanta-bred singer introduced her glamorous tomboy vibes in her hit single \"Goodies,\" Ciara, now 32, is a married mother of two, steadily working on new music. In fact, after signing with Warner Bros. Records last year, the entertainer told ABC News she's been hard at work on her seventh studio album.\n\nIn one week on social media, Ciara flaunts her fashion range -- from an over-sized long-sleeved boyfriend shirt, to wearing a floor-length emerald gown next to husband, NFL player Russell Wilson.\n\nBut one fashion mainstay is Ciara's love of gold. \"I'm a big fan of gold,\" she gushed while sitting Wednesday on a ruby-colored couch inside the Gramercy Park Hotel in New York City.\n\nSo it makes sense that Pandora Jewelry tapped her for it's Shine Collection, which features gold jewelry.\n\n\"I’m a part of history because it’s the first time they've had 18-karat gold-plated jewellery,\" she said. \"It’s also about inspiring us women to feel bright, to be bright, to shine bright and to express ourselves creatively. And as an artist, I can relate to that.\"\n\nCiara and Russell Wilson are all smiles as they leave Craig's Restaurant after having dinner in West Hollywood, Calif, March 9, 2018. Splash News\n\nCiara sat down with ABC News recently, dishing on her favorite pieces of jewelry, creating her seventh studio album and clarifying what she meant after receiving backlash for posting a clip of Pastor John Gray, which detailed how women can find a husband, with the caption: \"#LevelUp.\"\n\nABC News: What is your favorite piece of jewelry you wear all the time?\n\nCiara: I’ve been obsessed with my new dog tag. I got one for Russ and I. I also have these bracelets that he got me... for Valentine’s [Day] that have [my children] Future and Sienna’s names on there. There’s another bracelet stack that I have that symbolizes some of our sweet sayings that we say to each other.\n\nLike what?\n\nAhhh, I won’t say. (Laughs) If you see the bracelets, you’ll see what the words are.\n\nOK, alright. I’ll zoom in! We have those capabilities now. (Laughs) But you spoke about being an artist, can we expect new music? I know the last time we saw each other, we were in Alicia Key’s studio; and I just loved your last album.\n\nYeah, I’m super, super excited about my album. I’ve been having so much fun working on it. I actually stated recording a little bit of it before I gave birth to Sienna so that was really fun; dancing around with my big belly in the studio. But I’ve been working on it for a little while, and it’s really coming together, and I can’t wait to share it with my fans.\n\nRussell Wilson, left, and Ciara arrives at the Vanity Fair Oscar Party, March 4, 2018, in Beverly Hills, Calif. Evan Agostini/Invision/AP, FILE\n\nIs there a concept in place or do you not want to jinx it by sharing?\n\nThere is some cool stuff going on. (Laughs) No, but once it’s ready I’m definitely going to present it to my fans the best way I know how.\n\nI believe in the philosophy: Act like a queen to be treated like a queen.\n\nWhen you posted the Jon Gray clip where he advises women how to approach finding a husband, people didn’t get it. But you explained why you captioned the clip, \"#LevelUp.\" And so for people who just didn’t get it, what would you want them to know?\n\nIt was simply about loving ourselves. I believe in the philosophy: Act like a queen to be treated like a queen. It doesn’t necessarily mean you have to be in a relationship... it’s not about someone validating you. You validate yourself with how you love yourself -- that validation is important, first and foremost. I identified with what he was saying because I know that woman -- because I was that woman he was talking about. I have people in my crew that are single people and so it would be insane to look down on a person that’s single. To me the greatest thing about it is self-love and understanding the importance of self-love and how powerful self-love is. If I love myself first, I’m taking care of myself and then I can also be loved how I deserved to be loved. It was just to say level up -- level up on how we love ourselves. It’s OK if people don’t understand things. That’s fine, but I know the place that I came from was from a place of love.\n\nYou should really write a book. Women would love to read it and understand what your thought process was in approaching this fresh relationship with Russell Wilson.\n\nI definitely plan to write a book one day. I really believe that a lot of what I’ve gone through in life is for a reason. I’m sure I’ll have more challenges along the way; hopefully different challenges than some of the ones I’ve experienced before. I believe that all that we go through -- the good and the bad -- it all happens for a reason to make us wiser, to make us tougher, to make us stronger.\n\nCiara and her son, Future Zahir, attend the Seattle Seahawks vs. New York Giants game at MetLife Stadium, Oct. 22, 2017 in East Rutherford, New Jersey. Al Pereira/Getty Images, FILE\n\nI would totally read it. As a mom of two, I know you don’t have a lot of time because kids are a lot. Are there style hacks that you use now to speed up the process of getting dressed?\n\nWith kids, you don’t have a lot of time so it’s made me even better with my fashion choices. I’m a believer in sometimes taking your hubby t-shirt and making a dress out of it. You find some of the coolest moments when you’re not overthinking them when you don’t have time to think and you just have to whip it together.\n\nThe interview has been condensed for clarity.", "images": ["https://s.abcnews.com/images/Entertainment/ciara-pandora-event-gty-ps-180315_16x9_992.jpg", "https://s.abcnews.com/images/US/vegas-stabbings_hpMain_20221007-090546_1x1_144.jpg", "https://s.abcnews.com/images/Entertainment/ciara-wilson-oscar-party-ap-ps-180315_4x5_992.jpg", "https://s.abcnews.com/images/US/john-lynch-points-house-damage-abc-jt-221007_1665185645263_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/International/bridge-gty-ml-221008_1665242585018_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/Politics/uvalde-1-gty-er-221007_1665161778549_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/Entertainment/ciara-wilson-hollywood-spl-ps-180315_15x16_992.jpg", "https://s.abcnews.com/images/Entertainment/ciara-son-seahawks-gty-ps-180315_9x7_992.jpg", "https://s.abcnews.com/images/GMA/JOIMARIE-MCKENZIE_1x1_96.jpg", "https://s.abcnews.com/assets/dtci/random/svg/gma_logo.svg", "https://s.abcnews.com/images/Politics/trump-white-house-oval-office-gty-jt-221004_1664919462010_hpMain_1x1_144.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/Entertainment/ciara-pandora-event-gty-ps-180315_16x9_992.jpg", "keywords": [], "authors": ["Abc News"], "canonical_link": "https://goodmorningamerica.com/style/story/ciara-opens-style-music-level-controversy-53768035", "title": "Ciara opens up about style, new music, and that 'level up' controversy", "meta_data": {"description": "Singer Ciara talks with ABC News about her infamous \"level up\" social media post, music and her recent work with Pandora.", "keywords": "Ciara, Pandora, Russell Wilson", "copyright": "2022 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Ciara opens up about style, new music, and that 'level up' controversy", "og": {"site_name": "ABC News", "url": "https://goodmorningamerica.com/style/story/ciara-opens-style-music-level-controversy-53768035", "title": "Ciara opens up about style, new music, and that 'level up' controversy", "description": "Singer Ciara talks with ABC News about her infamous \"level up\" social media post, music and her recent work with Pandora.", "image": "https://s.abcnews.com/images/Entertainment/ciara-pandora-event-gty-ps-180315_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2018-03-16T23:18:26Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/prism-story,53768035", "ipad": "abcnewsipad://link/prism-story,53768035", "googleplay": "https://goodmorningamerica.com/style/story/ciara-opens-style-music-level-controversy-53768035"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Ciara opens up about style, new music, and that 'level up' controversy", "description": "Singer Ciara talks with ABC News about her infamous \"level up\" social media post, music and her recent work with Pandora.", "url": "https://goodmorningamerica.com/style/story/ciara-opens-style-music-level-controversy-53768035", "image": {"identifier": "https://s.abcnews.com/images/Entertainment/ciara-pandora-event-gty-ps-180315_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/prism-story,53768035", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/prism-story,53768035", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/goodmorningamerica.com/style/story/ciara-opens-style-music-level-controversy-53768035", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://goodmorningamerica.com/style/story/ciara-opens-style-music-level-controversy-53768035"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}