{"url": "https://www.usatoday.com/story/life/people/2017/11/10/anthony-edwards-says-gary-goddard-molested-him-for-years/852778001/", "text": "Former 'ER' star Anthony Edwards says Gary Goddard molested him 'for years'\n\nShow Caption Hide Caption Former 'ER' actor reveals he was sexually assaulted Actor Anthony Edwards has revealed that he is a survivor of sexual assault. Edwards claims Gary Goddard, a well-known theatrical director, producer, and theme park designer, sexually abused him when Edwards was a young teenager. USA TODAY\n\nActor Anthony Edwards accused writer/producer Gary Goddard of molesting him in an essay that was published on Medium Friday.\n\nEdwards says he first met Goddard when he was 12, at the beginning of his acting career, which included roles in films like 1982's Fast Times at Ridgemont High and 1984's Revenge of the Nerds. He is best known for the 1986 film Top Gun and the NBC medical drama ER, in which he played Dr. Mark Greene from 1994 to 2008.\n\nThe actor, now 55, said Goddard, 63, taught him \"the value of acting,\" and served as a leader for Edwards' group of friends. Edwards says Goddard also used the void of his emotionally unavailable father to manipulate him.\n\n\"Everyone has the need to bond, and I was no exception,\" said Edwards. \"My vulnerability was exploited. I was molested by Goddard, my best friend was raped by him — and this went on for years. The group of us, the gang, stayed quiet.\"\n\nGoddard directed the 1987 live-action He-Man film Masters of the Universe. He later founded the Goddard Group, an entertainment design firm. It produced 2009's Tony Award-winning revival of the musical Hair as well as several theme-park attractions for Universal Studios and Six Flags.\n\nEdwards said that he came face to face with Goddard at an airport 22 years ago and was able to confront his alleged abuser.\n\n\"I was able to express my outrage at what he had done,\" he wrote. \"He swore to his remorse and said that he had gotten help. I felt a temporary sense of relief. I say temporary because when Goddard appeared in the press four years ago for alleged sexual abuse, my rage resurfaced. At 51 years old, I was directed by a group of loving friends to a therapist who specializes in this kind of abuse.\"\n\nEdwards was likely referring to a pair of 2014 lawsuits accusing Goddard of sexually abusing teenage males. One suit was brought by an anonymous British citizen; the other was filed in federal court in Hawaii by Michael Egan III, who eventually withdrew his complaint against Goddard.\n\nThe ER star continued, \"Only after I was able to separate my experience, process it, and put it in its place could I accept this truth: My abuse may always be with me, but it does not own me.\"\n\nHe concluded, \"I did not go from being a victim to a survivor alone. No one does. I had to ask for help, and I am so grateful that I did.\"\n\nGoddard's press representative Sam Singer put out a statement late Friday \"unequivocally\" denying Edward's charges.\n\n“Gary first met Anthony more than 40 years ago. Gary was a mentor, teacher and a friend to Anthony, which makes this story all the more disturbing to him,\" Singer said in a statement. \"As to the allegations that Mr. Edwards made in his post today, I can unequivocally deny them on Gary’s behalf. Gary played an important role in helping start Anthony’s acting career and acted as his personal manager. He has nothing but the greatest respect for Anthony as a person.\"\n\nSinger added: \"Gary is saddened by the false allegations. The post by Anthony, as well as many of the news stories today reference a legal claim made against Gary approximately four years ago regarding sexual harassment. The complaint was demonstrated to be fraudulent as it was completely fabricated, and ultimately withdrawn by the complainant and his attorneys.”\n\nGoddard's current project, the film Broadway 4D, which he wrote and co-directed with Bryan Singer, is due next year.\n\nYou can read Edwards' essay in its entirety here.\n\nMore: Louis C.K. apologizes for his sexual misconduct: 'These stories are true'\n\nMore: Kevin Spacey scandal: A complete list of the 14 accusers\n\nMore: List: All of the Hollywood power players accused of sexual assault or harassment", "images": ["https://media.gannett-cdn.com/29906170001/29906170001_5642080510001_5642065215001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/-mm-/2122b4743eedadc377af8c86bd425584f602788b/c=1415-162-2902-1002/local/-/media/2017/11/10/USATODAY/USATODAY/636459260905413037-XXX-D03-ER-2SHOT-11-TVNOT.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/2122b4743eedadc377af8c86bd425584f602788b/c=1415-162-2902-1002/local/-/media/2017/11/10/USATODAY/USATODAY/636459260905413037-XXX-D03-ER-2SHOT-11-TVNOT.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Erin Jensen"], "canonical_link": "https://www.usatoday.com/story/life/people/2017/11/10/anthony-edwards-says-gary-goddard-molested-him-for-years/852778001/", "title": "Former 'ER' star Anthony Edwards says Gary Goddard molested him 'for years'", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/people/2017/11/10/anthony-edwards-says-gary-goddard-molested-him-for-years/852778001/life/people", "theme-color": "#ffffff", "og": {"type": "article", "title": "Former 'ER' star Anthony Edwards says Gary Goddard molested him 'for years'", "description": "Former 'ER' actor Anthony Edwards accused entertainment industry veteran Gary Goddard of molesting him\\u00a0in an essay published on Medium Friday.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/2122b4743eedadc377af8c86bd425584f602788b/c=1415-162-2902-1002/local/-/media/2017/11/10/USATODAY/USATODAY/636459260905413037-XXX-D03-ER-2SHOT-11-TVNOT.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Former 'ER' actor Anthony Edwards accused entertainment industry veteran Gary Goddard of molesting him\\u00a0in an essay published on Medium Friday.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1510272000.0, "source": "https://www.usatoday.com", "summary": ""}