{"url": "https://web.archive.org/web/20180330043228/http://ayibamagazine.com:80/exclusive-sope-aluko-on-playing-shaman-in-marvels-black-panther", "text": "Nigerian-born actress Sope Aluko plays Shaman in the most anticipated movie of 2018, Marvel’s Black Panther. Since pursuing acting in Hollywood she has had recurring roles on Netflix’s Bloodline, NBC’s Law & Order SVU, and Parks & Recreation. Sope has made guest appearances on USA Network’s Burn Notice, Graceland, and Lifetime’s Army Wives. Her film credits include supporting roles in blockbusters like Identity Thief, Pitch Perfect 2, The Good Lie and many more. We talk about her global upbringing, Nigerian roots, and everything Wakanda.\n\nYou were born in Nigeria, but have also lived in several countries around the world. Tell us about the different countries you grew up in.\n\nSince my father was in the Nigerian diplomatic service, I had the privilege to live in countries like Kenya, Switzerland, The United Kingdom, Trinidad & Tobago, and Indonesia. However, there came a point when my parents felt that moving around was interrupting my education, so most of my education was in the UK – from the age of 11 through my Masters degrees.\n\nMy years in Trinidad & Tobago, Nigeria, and the UK were most formative. As you can imagine, it was very hard for me to keep sustaining friendships because we moved around a lot. The few close childhood friends I have today stem primarily from my years in Nigeria and the UK.\n\nTrinidad & Tobago was the most exciting, for sure! I got my first taste of Carnival and Calypso music. People were so vibrant; the country was beautiful, and my love for acting really came alive there. My first TV appearance was on a talent show called “Twelve & Under” where kids under 12 performed their talents and the winner got a prize. It was all so exciting, and I was enamored and in awe of the host of the show, Ms. Hazel Ward.\n\nI would have to say Indonesia was the most “foreign.” My father was the first Nigerian Ambassador stationed there, so it was all very new… the people, culture, environment, religion, language (most didn’t speak English).\n\nAside from Nigeria, I’d say Tanzania or Kenya were most like home. Although I was very young when we lived there, the cultural environment was easier to assimilate into.\n\nWhat’s your relationship with Nigeria and your Nigerian culture?\n\nFirst and foremost, I was born in Lagos, Nigeria. In fact, I was born at LUTH hospital. Although we lived in various countries, my parents were very insistent that my sisters and I were deeply rooted in our traditional culture and heritage. They ensured we spoke in our native tongue, Yoruba in their presence at all times. We even had to learn scripture, bible verses and pray in Yoruba. To the point that whenever we went home (Nigeria) for Christmas or other holidays, we noticed we were more versed in our language and culture than some family members who lived there. They chuckled at times because they weren’t subjected to that kind of pressure in their homes. To this day, my husband and I try our best to instill the same values in our kids. We try to visit home as often as we can. In fact, our last family trip was two years ago. We travelled to Nigeria to celebrate my Mother-In-Law’s 80th birthday.\n\nWe are very much connected to Nigeria and our family there.\n\nHave you ever considered acting in Nollywood (Nigeria’s film industry)?\n\nI would absolutely love to work in Nollywood films with notable Nollywood producers, directors, and actors. I just have never been approached. So now it’s officially on the record people! [laughs]\n\nWell, you’re definitely conquering Hollywood, so glad that’s on the agenda. As a woman in Hollywood, what do you think the power of being a woman is, especially in this moment in history with the “me too” movement?\n\nI think we are at a critical time in history where we as a female collective, have to take charge of our destinies, our power, our voices, and our actions.\n\nThe actions we make now are sure to determine the benchmark standards for the future generations. We have a mandate to get it done right. There isn’t a “do over” opportunity.\n\nDo you think Hollywood’s beauty standards are changing and is that something you’ve ever struggled with: feeling like you didn’t fit into the mold.\n\nI personally think we still have a long way to go. There has been some change as of late, but we are not totally there yet.\n\nI still read breakdowns for roles, calling for “ethnically ambiguous” or “mixed ethnicity” or “light skinned Black”. Like really? Why can’t they just say “Black?”\n\nYou’ve been in Hollywood since 2009 and have over 36 credits on popular shows like Mindy Project and Law and Order. How did you get your first break in Hollywood?\n\nI hate to say, but it has been through sheer hard work, consistent training, and making a lot of sacrifices. My personal journey has not been easy, which makes me appreciate all of my credits all the more. And I am still ‘grinding’, because you just have to in this business. I am hoping my role in Black Panther will give me the necessary “break” in Hollywood, as you put it, so I can be considered for other major roles and projects.\n\nSome say Africans are taking over “Black Hollywood.” How do you feel about African actors playing Black American roles and vice versa?\n\nI have no issues with African actors playing Black American roles and vice versa. I just implore Hollywood to cast the most authentic actor for the role.\n\nFor instance, if the role clearly says the character is West African, it is quite unnerving when they cast an actor who is speaking with a South African accent or a mish-mash of an accent which they feel will pass as African.\n\nSo who cares? We the indigenous people of the country or region care! After all, the Africans of that region are going to watch the show or film, and as consumers, they are appalled and feel overlooked and dishonored.\n\nWhat do you think the significance of a movie like Black Panther is – at this point in Hollywood’s history and at this moment in pop culture? What does it mean for you to be a part of this cast?\n\nPersonally, I think the movie Black Panther is most significant now considering the political climate in the USA. The film raises the profile and significance of the African continent in such a way that has never been done before. Although Wakanda is a fictional country, it structurally and aesthetically paints a nation rich in mineral resources, cultural heritage, technological advancement, strength, courage, and power that is sought after by the Western world, but cleverly able to remain under the radar. We see Kings and Queens depicted with such relevance and magnitude. I love it! That’s the African nation that we can proudly show to all the Black youth and generations of Blacks all over the world.\n\nIt meant everything to me to be part of the cast, especially as a mother of two teenage black boys growing up in America right now.\n\nI know they feel so proud that their friends get to see this version of their Africa and that their Mum is part of it. I have to say, I am thankful for the major cool points this film is tallying up for me in my household!\n\nTell us about your character in Marvel’s Black Panther?\n\nMy character in the film is the Shaman. I am a spiritual leader and sort of a conduit between both the supernatural world and the existing world. Zuri (Forest Whitaker’s character) is the King’s spiritual advisor is my teacher, so essentially I am his protégé.\n\nThere is an opportunity for my role to come back in Black Panther 2 based on the storyline, so fingers crossed.\n\nAny interesting stories from the set?\n\nOne fond moment I have is while doing a scene, my earring fell in the water during one of the “Warriors Falls” scenes. I was trying to get it and fix it back on my ear quickly with no success. Well, Forest kindly took the earring from me and was also trying to help out but also with no success, until we had to cut the take and get wardrobe to come and help me out. I was taken aback by how nice he was to make that effort. It just shows what a kind and humble person he is.\n\nAnother moment for me was when (unbeknownst to me) the director, Ryan Coogler had told all the crew to call me by my Nigerian name, which he had insisted to learn at my audition. So I kept hearing my name mumbled by the prop guys, and when I asked them to say my name louder, they shyly owned up to the fact that they had been calling me “SHOCKWAVE”, not Sope. They were too scared to ask for clarification. I thought that was funny and we all laughed about it.\n\nWhich actors do you have scenes with?\n\nI have scenes with all of the main cast, but particularly with Forest Whitaker, Chadwick Boseman, and Michael B Jordan.\n\nWhat was your favourite scene to shoot?\n\nI actually had a number of scenes, but sadly not all made it past the editing floor. However, I would have to say my stunt scene with Michael B Jordan where he chokes me, (which by the way was my first ever film stunt), would have to be my favorite. But, all the scenes are fantastic! The film is breathtaking!\n\nWhat was the mood like on the Black Panther set?\n\nThe mood was exciting, full of energy, and team oriented. We all knew we were participating in something very powerful we wanted to get it right in an honorable way.\n\nPhotographer IRVIN RIVERA\n\nStyling HEMA PERSAD\n\nMakeup ANTON KHACHATURIAN for Exclusive Artists using Tarte Cosmetics\n\nHair ALEXANDER ARMAND for Exclusive Artists using Oribe Haircare\n\nPhoto Asst PHIL LIMPRASERTWONG", "images": ["https://web.archive.org/web/20180330043228im_/https://i2.wp.com/ayibamagazine.com/wp-content/uploads/2018/02/Sope-Aluko_Ayiba-Magazine-Cover-21.jpg?resize=794%2C1123", "https://web.archive.org/web/20180330043228im_/http://i0.wp.com/ayibamagazine.com/wp-content/uploads/2016/11/14881343_10154674729483420_1762711859_o.jpg?resize=180%2C180", "https://web.archive.org/web/20180330043228im_/http://ayibamagazine.com/wp-content/uploads/2012/11/Transparent_logo-e1420218445146.png", "https://web.archive.org/web/20180330043228im_/http://i0.wp.com/ayibamagazine.com/wp-content/uploads/2016/11/simple-twin.jpeg?resize=180%2C180", "https://web.archive.org/web/20180330043228im_/https://i0.wp.com/ayibamagazine.com/wp-content/uploads/2018/02/Sope-for-Ayiba-Mag_features.png?resize=794%2C1123", "https://web.archive.org/web/20180330043228im_/http://i1.wp.com/ayibamagazine.com/wp-content/uploads/2016/11/IMG_0414.jpg?resize=180%2C180", "https://web.archive.org/web/20180330043228im_/https://i2.wp.com/ayibamagazine.com/wp-content/uploads/2018/02/CBY_3429.jpg?fit=801%2C1200", "https://web.archive.org/web/20180330043228im_/http://ayibamagazine.com/wp-content/themes/edition/images/loading-spin.svg", "https://web.archive.org/web/20180330043228im_/https://i2.wp.com/ayibamagazine.com/wp-content/uploads/2018/02/CBY_3429.jpg?fit=1500%2C2248", "https://web.archive.org/web/20180330043228im_/https://i0.wp.com/ayibamagazine.com/wp-content/uploads/2016/07/sammy.jpg?resize=525%2C564", "https://web.archive.org/web/20180330043228im_/https://i2.wp.com/ayibamagazine.com/wp-content/uploads/2013/08/Picture-3.png?resize=525%2C525", "https://web.archive.org/web/20180330043228im_/http://i0.wp.com/ayibamagazine.com/wp-content/uploads/2016/11/IMG_4142-copy1.jpg?resize=180%2C180"], "top_img": "https://web.archive.org/web/20180330043228im_/https://i2.wp.com/ayibamagazine.com/wp-content/uploads/2018/02/CBY_3429.jpg?fit=801%2C1200", "keywords": [], "authors": ["Eyitemi Popo", "Eyitemi Is The Founder", "Editor-In-Chief Of Ayiba Magazine. She Is A Master Of Digital Experience Innovation Graduate The University Of Waterloo", "An Alumna Of Mount Holyoke College. She Also Holds A Graduate Certificate In Digital Publishing New York University."], "canonical_link": "https://web.archive.org/web/20180330043228/http://ayibamagazine.com/exclusive-sope-aluko-on-playing-shaman-in-marvels-black-panther/", "title": "EXCLUSIVE: Sope Aluko on playing Shaman in Marvel’s Black Panther", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "WooCommerce 3.1.1", "og": {"type": "article", "title": "EXCLUSIVE: Sope Aluko on playing Shaman in Marvel’s Black Panther", "url": "https://web.archive.org/web/20180330043228/http://ayibamagazine.com/exclusive-sope-aluko-on-playing-shaman-in-marvels-black-panther/", "description": "Nigerian-born actress Sope Aluko plays Shaman in the most anticipated movie of 2018, Marvel’s Black Panther. Since pursuing acting in Hollywood she has had recurring roles on Netflix’s Bloodl…", "site_name": "Ayiba Magazine", "image": {"identifier": "https://web.archive.org/web/20180330043228im_/https://i2.wp.com/ayibamagazine.com/wp-content/uploads/2018/02/CBY_3429.jpg?fit=801%2C1200", "width": 801, "height": 1200}, "locale": "en_US"}, "article": {"published_time": "2018-02-17T16:46:09+00:00", "modified_time": "2018-02-17T17:04:25+00:00"}, "twitter": {"image": "https://web.archive.org/web/20180330043228im_/https://i2.wp.com/ayibamagazine.com/wp-content/uploads/2018/02/CBY_3429.jpg?fit=801%2C1200&w=640", "card": "summary_large_image", "creator": "@AyibaMagazine"}}, "movies": [], "publish_date": 1518885969.0, "source": "https://web.archive.org", "summary": ""}