{"url": "https://www.shape.com/weight-loss/tips-plans/revenge-body-celebrity-trainers-weight-loss-tips", "text": "If you've ever watched Khloé Kardashian's Revenge Body, you know that each of the celeb trainers on the show has a different approach to tackling their clients' weight-loss goals-both in their bedside manner and in their methods. For example, while some emphasize first changing diet above all else, others are all about getting in a crazy-intense, super-sweaty workout in the gym on day one.\n\nThere's no one \"right\" way to go about it-all the trainers work with celebrities on the reg and have led their contestants on the show to lose impressive amounts of weight in three months. So we rounded up all of their best advice in one place so you can pick and choose what works for you. (Personally, we recommend all five!)\n\nHere, the best weight-loss tips for lasting success, according to the celebrity trainers.\n\nHarley Pasternak: Move outside of the gym.\n\n\"My first piece of advice is always to just get moving,\" says Harley Pasternak, who has trained celebs like Kim Kardashian and Lady Gaga. What differentiates Pasternak from many of the other trainers is the stress he places on what we do *outside* of the gym first and foremost. \"Using a device like Fitbit to track and hit at least 10,000 steps a day is a great way to start.\" (Pasternak is an ambassador for the brand.)\n\nPasternak suggests making small behavioral changes in everyday life to help reach this goal: Park farther away at the grocery store, catch up with your friends by going on a walk instead of sitting on your couch, and set move reminders if you sit at a desk all day so you remain accountable to stay active throughout the day and reach your daily step count goal.\n\nCorey Calliet: Be consistent.\n\n\"Getting in shape and staying in shape requires you to develop a lifestyle that supports your goals. Consistently eat the right foods. Consistently perform the correct movements. Consistently find ways to improve your mental strength and you will be proud of the body goals you worked to create.\"\n\nAutumn Calabrese: Focus on your nutrition first.\n\n\"You can't out-train a bad diet. I have all of my clients follow my Ultimate Portion Fix nutrition program where we focus on three main principals including balanced macro nutrients (40 percent healthy carbohydrates, 30 percent lean protein, 30 percent healthy fat), portion control, and significantly reducing or eliminating overly processed foods. When you combine proper nutrition with exercise the results are nothing short of amazing. It's not a diet, it's a way of life that still allows you to enjoy your food, have a cocktail or glass of wine, and eat dessert—without feeling guilty or setting yourself back in your goals.\"\n\nAshley Borden: Don't be afraid to lift heavy.\n\n\"Pick up some weights and don't be afraid!\" says Ashley Borden, who has trained stars like Christina Aguilera and Mandy Moore, and who recently launched her own app with the \"Revenge Body\" gym routine her participants used on the show. \"Our bodies need heavier weight training or bodyweight training in order to get that HGH and testosterone release. That's what attacks core belly fat and creates a lean, strong body.\"\n\nAs a general rule, if you're doing 10 reps of any major muscle group move (squats, push-ups, shoulder press, or deadlift for example) and you become breathless after your last rep, that's around the weight that will lead to weight-loss success, she says. (P.S. Here are five things that could make a personal trainer stop working with you, according to Borden.)\n\nGunnar Peterson: Schedule specific workouts.\n\nAccording to trainer Gunnar Peterson, who has worked with a laundry list of pro athletes and A-list celebs (including Khloe herself), the most important part for anyone starting a weight loss program is to prioritize their workouts in their weekly schedule—and to be as specific as possible. \"Don't just say, 'I'll work out Monday, Wednesday, and Friday.' Say, 'I'm working out Monday at 7 am at the gym, Wednesday at noon I'm taking a boot camp class, and Friday I'm meeting my friend after work at 5:30 to go for a 3-mile run.' That way it's locked in and you can see it,\" he says.\n\nBy incorporating them into your schedule like you would a work meeting or doctor's appointment, you're also upping your chances of success week after week. \"Left to chance, there's a good chance it gets canceled, bumped, or shorted-and that's harder to make up on the weekends than you think it is.\"\n\nNicole Winhoffer: Pack snacks ahead of time.\n\n\"What you ingest is just as important as physical activity,\" says Nicole Winhoffer, Madonna's former trainer and founder of the NW Method. \"One of the problems with weight gain in America is that there is a lack of preparation.\" While we can't always control our circumstances, we can always be prepared, she says. \"I recommend packing at least two snacks, like trail mix or a protein bar, to keep with you during the day so you don't make poor food choices.\"\n\nLeyon Azubuike: Avoid Liquid Calories\n\n\"The more sugar that you put into your body, the more fat you will store. One of the highest sources of sugar in the average American’s diet comes from beverages. What’s even worse is that liquid calories do not satiate hunger the same way that real food does which means it is that much easier to drink A LOT of extra calories. If you can train your brain to swap a sugary drink with a bottle of water (or a zero-calorie flavored substitute for those that need a little more taste to your beverages than regular water offers), your daily caloric intake will drop tremendously. This, along with moving more, will help you make rapid gains in shedding unwanted pounds.\"\n\nSimone De La Rue: Change your attitude.\n\nIt sounds cliché, but to truly find success, you need to make a fundamental change in your attitude-toward fitness, diet, and your lifestyle generally, says Simone De La Rue, the creator of Body By Simone and trainer to celebs like Reese Witherspoon and Chrissy Teigen. \"If they don't then it won't last, it'll always just be the newest diet or fitness fad,\" she says. \"Ultimately, without the change of mentality, the person will always revert to the old habits that have become ingrained. The change of attitude is key.\"", "images": ["https://www.shape.com/thmb/0dcNkFLgiuvks7sZ9zd-X0Am02k=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/weight-loss-motivation-sq-2000-a953ed1926b94673a1050965be4e684a.jpg", "https://www.shape.com/thmb/W7jeVtm0PrCvZL5gQRsv37V7vwU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x625:1001x627)/lily-rabe-GettyImages-941208370-2000-7d8870fce80b4dcc972083efd3f115d1.jpg", "https://www.shape.com/thmb/LUI_9Nbxpclbl_NwjgYKdXG448I=/75x75/filters:no_upscale():max_bytes(150000):strip_icc()/Author-Headshot-Kylie-Gilbert-2000-36e999dde64e4ddb8f8b0250781a70a2.jpeg", "https://www.shape.com/thmb/ihLfwMcA0kShfcubNhYZ9mj1uOc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/cardio-sq-2000-5b17712c06114514bc270ec191137be0.jpg", "https://www.shape.com/thmb/63kMy7rn6xrq4VV3sV69Jf7_6Ik=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(621x0:623x2)/Erica-Primary-a259bffac765474c9dc9bc63993bdfc2.jpg", "https://www.shape.com/thmb/WKrP8cnLXxViKBQvK49zZF7qsKQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/black-trainers-ed0aff064a864c5a9c8bf7fa1147a3e5.jpg", "https://www.shape.com/thmb/pPn1CYm3ZDnSuRh-HDKeYRrOlZA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/how-to-gain-muscle-promo-2000-3c3229f8de854d979d434cd2982db4fe.jpg", "https://www.shape.com/thmb/5YEIEe-LqzCSwvgLzi51cRFKou0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(621x0:623x2)/rv-living-promo-0dc1ac52e81a4439a98a3099f27e0786.jpg", "https://www.shape.com/thmb/2WQiQikJB0Y6jCw85Ne891Ps_Ds=/1200x630/filters:fill(auto,1)/revenge-body-fb-15f8731ff5fe420c964f705c5460817d.jpg", "https://www.shape.com/thmb/WKkFRlNVsBeQy1_IDJoatXoym1I=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(823x490:825x492)/1-trainers-morning-routine-6fa21c79edf346ac9bce2e2891c00621.jpg", "https://www.shape.com/thmb/Lg5dC8x2fqKKngsPQIXTbWsb2Xs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/snake-diet-daaba17137d840228cd3b4097ef1e37c.jpg", "https://www.shape.com/thmb/mteHiS5eEbGYes0SrmA7G0iFPvw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/weight-loss-rules-woman-39ef2108646345bf862e41d5723f291d.jpg", "https://www.shape.com/thmb/OYyCjKMKZyB5_KkCng84e2OPUmE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(621x0:623x2)/lifting-barbell-promo-4dadfdb91e3840c5bf55cf094e8538e9.jpg", "https://www.shape.com/thmb/VR_AE1O5dfV6pggluch1_Nmo6eU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():gifv()/revenge-body-fb-15f8731ff5fe420c964f705c5460817d.jpg", "https://www.shape.com/thmb/h1KakiASCepLOhkIMnZy8MvUIEQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/change-running-route_0-31c8502c80284a1297e9968daf884ea2.jpg", "https://www.shape.com/thmb/1j5XSmjtkLDGDeigSCQ9J64Gy7g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/keto-butter-2ae884b61f9d4b60a7bfc2ab39824afc.jpg", "https://www.shape.com/thmb/sCu7IMVpcT-xlcoivWNFQwqmYss=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(349x0:351x2)/adam-von-roth-700x700-e7e398b1e57440a28354ea1673b52e65.jpg", "https://www.shape.com/thmb/6AbbiyiJHbrVkrx_Rff9Th1ivQ8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(621x0:623x2)/bulking-promo-f639433213b7480dbc1e8bbb06cf90bc.jpg", "https://www.shape.com/thmb/4Yj7bkGXXCJOQZUp8o0MiRsGVLk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(621x0:623x2)/jumpstart-weight-loss-2-day-plan-c308f311ce304cfa879d9fca41f9bdc7.jpg"], "top_img": "https://www.shape.com/thmb/2WQiQikJB0Y6jCw85Ne891Ps_Ds=/1200x630/filters:fill(auto,1)/revenge-body-fb-15f8731ff5fe420c964f705c5460817d.jpg", "keywords": [], "authors": ["Kylie Gilbert", "Kylie Has Worked In Digital Media For The Past Decade. She Joined Instyle In As The Senior Lifestyle Editor Overseeing The Site'S Wellness Coverage", "Including Health", "Fitness", "Astrology", "Sex", "Relationships. Kylie Is Now The Associate Editorial Director For The Brand", "Where She Works On Cross-Vertical Strategy As Well As Lifestyle", "Wellness Features For The Site", "Instyle'S Digital Issues. Previously"], "canonical_link": "https://www.shape.com/weight-loss/management/revenge-body-celebrity-trainers-weight-loss-tips", "title": "Revenge Body Celebrity Trainers Share Their Top Weight Loss Tip", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "We asked the celeb trainers on the show to share their single best piece of weight-loss advice for lasting results.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "SHAPE", "sailthru.author": "Kylie Gilbert", "sailthru.tags": "lifestyle-mind-and-body,weight-loss-management", "article": {"section": "shape", "author": "https://www.facebook.com/SHAPEmagazine/"}, "fb": {"app_id": 165082593548215, "pages": 10053803772}, "og": {"type": "article", "site_name": "Shape", "url": "https://www.shape.com/weight-loss/management/revenge-body-celebrity-trainers-weight-loss-tips", "title": "Revenge Body Trainers Share Their Top Weight-Loss Tip", "description": "We asked the celeb trainers on the show to share their single best piece of weight-loss advice for lasting results.", "image": "https://www.shape.com/thmb/2WQiQikJB0Y6jCw85Ne891Ps_Ds=/1200x630/filters:fill(auto,1)/revenge-body-fb-15f8731ff5fe420c964f705c5460817d.jpg"}, "twitter": {"card": "summary_large_image", "site": "@Shape_Magazine", "title": "Revenge Body Trainers Share Their Top Weight-Loss Tip", "description": "We asked the celeb trainers on the show to share their single best piece of weight-loss advice for lasting results.", "image": "https://www.shape.com/thmb/2WQiQikJB0Y6jCw85Ne891Ps_Ds=/1200x630/filters:fill(auto,1)/revenge-body-fb-15f8731ff5fe420c964f705c5460817d.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.shape.com", "summary": ""}