{"url": "https://en.wikipedia.org/wiki/Look_What_You_Made_Me_Do", "text": "2017 single by Taylor Swift\n\n\"Look What You Made Me Do\" is a song recorded by American singer-songwriter Taylor Swift. It was released on August 24, 2017, by Big Machine Records, as the lead single from her sixth studio album, Reputation (2017). Swift wrote and produced the song with Jack Antonoff. Released after a year of her public hiatus, several publications have noted the song as one of pop music's most memorable comebacks, buoyed by its accompanying music video.\n\nThe single is a dance-pop, electropop, and progressive pop song with lyrics about various events that contributed to the tarnish of Swift's repute. Right Said Fred members (Richard Fairbrass, Fred Fairbrass, and Rob Manzoli) received songwriting credits since the hook interpolates the melody of their 1991 song \"I'm Too Sexy\". Upon release, the song polarized music critics, some of whom complimented Swift's new direction and praised it as a fierce return, while others were disappointed with her change of style.\n\nBreaking a string of records, \"Look What You Made Me Do\" became Swift's fifth number-one single on the US Billboard Hot 100 and one of the most dominant number-one hits in the chart's history. It amassed the most plays in a single day on Spotify and topped the Hot 100 for three consecutive weeks. It also debuted atop the Billboard Digital Song Sales and Streaming Songs charts, with 353,000 song downloads and 84.4 million streams. The song debuted and peaked at number-one in several countries worldwide, including Australia, Canada, Ireland, Japan, Malaysia, New Zealand, the Philippines, Scotland and the UK.\n\nThe music video, directed by Joseph Kahn, premiered at the 2017 MTV Video Music Awards, three days after the song's release. Upon its release on YouTube, the music video garnered 43.2 million views in its first 24 hours, breaking the record for the most views in its first 24 hours of release, at that time; it also broke the 24-hour Vevo record, which is now held by Swift's own 2019 single \"Me!\". The video garnered critical acclaim, and was ranked by Billboard and Rolling Stone as one of the best music videos of 2017. As of July 2018, \"Look What You Made Me Do\" is certified 4× Platinum by the Recording Industry Association of America for exceeding 4 million units in the US. The song has also received platinum or multi-platinum certifications in Australia, Belgium, Canada, Denmark, Italy, New Zealand, Norway, Poland, Portugal, Sweden, and the United Kingdom, and a diamond certification in Brazil.\n\nPromotion and release [ edit ]\n\nOn August 23, 2017, Swift announced that the first single from her upcoming sixth album, titled Reputation, would come out the following night.[1] The song was released to streaming services on August 24,[2] and earned over eight million streams within twenty-four hours of its Spotify release, breaking the record at the time for the highest first-day streaming for a single track.[3] Since then, the record has been surpassed by four songs. \"Look What You Made Me Do\" was then released the next day onto iTunes for digital download through Big Machine Records[4] and onto Italian contemporary hit radio.[5] It impacted American contemporary hit radio on August 29, 2017.[6] A CD single release followed in Germany on October 27, 2017.[7]\n\nA lyric video heavily based on the Saul Bass imagery used in the film Vertigo was released through Swift's official Vevo account on August 25, 2017.[8] The video was produced by Swift and Joseph Kahn and directed by ODD.[9] It gained more than 19 million views during its first 24 hours on YouTube, surpassing \"Something Just Like This\" by the Chainsmokers and Coldplay as the most viewed lyric video within that time period.[10] As of August 2022, the lyric video on YouTube has amassed over 140 million views.[11]\n\nRegarded as her comeback, \"Look What You Made Me Do\" was released after a year of Swift's hiatus from public spotlight, which followed the immense media and internet scrutiny she faced due to her highly publicized disputes. Mainstream media interpreted the song as Swift \"claiming her narrative\" back.[12][13] The song, and its release, is considered as one of pop music's most memorable moments, spurred by its music video and the numerous records that were broken.[14][15][16] Prior to the song's release, Swift blacked out her website and her social media, including Facebook, Instagram and Twitter. Two days after blacking out, cryptic and glitchy snake videos were uploaded to her social media, leading to the announcement of the song and her new album, Reputation.[12]\n\nComposition and lyrics [ edit ]\n\n\"Look What You Made Me Do\" was written and produced by Swift and Jack Antonoff, and runs for 3 minutes and 31 seconds.[17][4] Music critics have described the track as a dance-pop,[18] electropop,[8] and progressive pop song.[19] It emphasizes the blame that is placed on an enemy, in particular the line \"I've got a list of names and yours is in red, underlined\", which was inspired by Arya Stark's kill list in the television series Game of Thrones.[20] The middle eight of the song features Swift saying, \"I'm sorry, the old Taylor can't come to the phone right now / Why? / Oh, 'cause she's dead!\". \"Look What You Made Me Do\" is performed in the key of A minor with a tempo of 128 beats per minute.[21] Swift's vocals span from G 3 to F 5 .[21]\n\nBrittany Spanos of Rolling Stone noted a \"nightmarish aesthetic\" present in the song, and believed it to be a continuation of the \"antagonistic persona\" from \"Bad Blood\".[18] Richard Fairbrass, Fred Fairbrass and Rob Manzoli, the members of the British dance-pop group Right Said Fred, are credited as songwriters because the song interpolates the melody of their song \"I'm Too Sexy\".[22][23] According to Fred Fairbrass, he and his brother were contacted one week before the release of \"Look What You Made Me Do\" and were asked whether a \"big, contemporary female artist who hasn't released anything for a while\" – whose identity they were not told – would be able to use a portion of their song for her latest single.[24] Although the brothers agreed to a deal, they did not officially find out that the artist in question was Swift until the morning after the song was released, but had deduced that it was her based on the description they were given.[24] Both of the Fairbrass brothers said that they enjoyed \"Look What You Made Me Do\"; Fred Fairbrass told Rolling Stone, \"I like the cynical aspect of the lyric, because 'I'm Too Sexy' is a cynical song, and I think she channeled that quite well.\"[24] A representative for Swift confirmed that the song interpolated the melody from \"I'm Too Sexy\", but did not include sampled audio from the earlier song.[25]\n\nCritical reception [ edit ]\n\nUpon release, \"Look What You Made Me Do\" received polarizing reviews from critics, with some calling it a fierce return, and some a disappointment.[26][27][28] USA Today said that the polarizing reaction to the song illustrated Swift's position as a \"ubiquitous cultural force\".[29] The Telegraph's Randy Lewis praised the song, deeming Swift and Antonoff's work as \"blowing past the production clichés of clap tracks and hiccuped syllabic hooks that have proliferated across Top 40 fare in recent years with boldly inventive textures and fresh melodic, rhythmic and sonic accents\". He also added how the track musically and sonically shifted alongside the lyrics.[30] Sarah Carson of the Los Angeles Times wrote a positive review of the song, saying: \"The reverberating crescendo builds and ever more delicious is the wickedness of Swift's menacing protagonist\", praising Swift for her successful embrace of the villain character the media has portrayed her as previous to the song's release.[31] Variety's Chris Willman also praised Swift's embrace of a darker-styled pop music and the stylistic conflict between the song's pre-chorus and chorus.[32] Mark Harris, writing for Vulture, thought of Swift's song as a pop art anthem for the Trump era in how she reappropriates her public feuds as empowering badges of honor without acknowledging her own responsibility or blame.[33]\n\nMaura Johnston of The Guardian wrote a negative review of the song, faulting the \"sloppy\" lyrics and blaming Swift for not giving a clear context in the lyrics.[8] Lindsay Zoladz of The Ringer said, \"Unleashed on a deeply confused public late Thursday night, the song is a strange collage of retro reference points: mid-aughts Gossip Girl placement pop, the soundtrack to Disney's live-action Maleficent, and — yes, really — Right Said Fred's 'I'm Too Sexy', except devoid of the self-effacing humor and wit. Yes, the new Taylor Swift song just made me compliment Right Said Fred.\" Brittany Spanos of Rolling Stone believed that the song marked a continuation of the feud between Swift and rapper Kanye West; the latter had previously name-dropped Swift in his song \"Famous\" by using the line, \"I feel like me and Taylor might still have sex / Why? / I made that bitch famous\". The single was noted as being darker and angrier than what Swift had done before.[18][34] Meaghan Garvey from Pitchfork referred to it in a review as \"a hardcore self-own\" track.[35] In 2019, Slant listed \"Look What You Made Me Do\" as one of the 100 singles that defined the 2010s decade.[36]\n\nConsidered as Swift's comeback after a one-year public hiatus, bolstered by its accompanying music video, the song broke records on several platforms.[15][16]\n\nCommercial performance [ edit ]\n\nThe single became one of Swift's biggest hits.[37] In the United States, \"Look What You Made Me Do\" debuted at number 77 on the Billboard Hot 100, powered by its first three days of airplay.[38] It also sold slightly under 200,000 digital copies within its first day of sales in the country, where it became the fastest selling download since Ed Sheeran's \"Shape of You\".[39] One week later, the song ascended from number 77 to number one on the Hot 100 after its first full week of tracking, becoming the fifth-largest rise to the top position and Swift's fifth number-one single in the United States. Ending the record-tying 16-week reign of Luis Fonsi's \"Despacito\", \"Look What You Made Me Do\" became one of the most dominant number-one hits of all time, leading ahead of \"Despacito\" with more than double the Hot 100 points.[40]\n\nThe song also topped the nation's Streaming Songs chart with 84.4 million streams, becoming its most streamed song within a week by a female artist at the time and second overall behind the 103 million that Baauer's \"Harlem Shake\" gained in 2013. The track also had more weekly streams in the US than any other song in 2017. The song stayed atop the charts for three consecutive weeks, tying with American rapper Cardi B's \"Bodak Yellow\" as the longest-running female at the number one spot on the charts in 2017.[40]\n\nWith 353,000 copies sold in its first week, \"Look What You Made Me Do\" opened atop the US Digital Songs chart and had the country's biggest sales opening since Justin Timberlake's \"Can't Stop the Feeling!\" in 2016 as well as the best weekly sales for a song by a female artist since Adele's \"Hello\" in 2015. The track also became the country's first number-one song by a female artist since Sia's \"Cheap Thrills\" (both in 2016). It additionally was the first solo song by a female to top the US charts since \"Hello\".[40] It remained atop the Hot 100 and Streaming Songs charts for a second week with 114,000 copies sold and 61.2 million streams. That week, it was bumped to number two on the Digital Songs chart by Swift's track \"...Ready for It?\", which debuted at number one with 135,000 digital copies sold. As a result, Swift became the first artist to have two tracks sell over 100,000 digital copies in the nation within a week since Sheeran did so with \"Shape of You\" and \"Castle on the Hill\". It also became the first time a female had two songs within the top five of the Hot 100 since 2015 when Swift's songs \"Blank Space\" and \"Shake It Off\" respectively were at numbers four and five on the chart.[41] The single also topped the Mainstream Top 40 chart, becoming Swift's eighth single to do so.[42] However, a week after reaching number one on the Mainstream Top 40, it moved to number 7—the largest fall from the top in the chart's history; and from number 5 to number 20 on the all-format Radio Songs chart.[43] It also spent a total of eight weeks in the Hot 100's top ten.[44]\n\nIn the United Kingdom, \"Look What You Made Me Do\" sold 20,000 copies and was streamed 2.4 million times in less than a week.[45] The song debuted at the top the UK Singles Chart on September 1, 2017 – for the week ending date September 7, 2017, with opening sales of 30,000 copies and 5.3 million streams within the week and becoming Swift's first chart-topping song in Britain.[46] It spent two weeks at the top spot.[47] As of April 2019, \"Look What You Made Me Do\" has sold over 700,000 combined units in the UK.[48]\n\n\"Look What You Made Me Do\" also debuted at number one on the Irish Singles Chart on September 1, 2017, and became Swift's first song to top the chart in Ireland. \"Look What You Made Me Do\" opened at number one in Australia on September 2, 2017, becoming her fifth track to top the ARIA Charts.[49] It spent another week at the summit.[50] The song has been certified Platinum by the Australian Recording Industry Association (ARIA) for shipments of 70,000 units.[51] After debuting at number one on the Canadian Hot 100,[52] \"Look What You Made Me Do\" was also certified Platinum by Music Canada for shipments of 80,000 units on September 14, 2017.[53] In New Zealand, \"Look What You Made Me Do\" entered at the number one spot on September 4, 2017, becoming Swift's fourth chart-topping single there.[54] In the Philippines, \"Look What You Made Me Do\" debuted at number seven on the Philippine Hot 100 in its first week. A week later, it ascended to the number one spot, ending the ten-week reign of \"Despacito\".[55]\n\nMusic video [ edit ]\n\nProduction and release [ edit ]\n\nPreparation for the music video began in January 2017, while the shooting took place in May.[56][57] The dance was choreographed by Tyce Diorio, who had previously worked with Swift on the video for her 2014 single \"Shake It Off\".[56] Swift's makeup as a zombie was done by Bill Corso.[57] Post-production of the video lasted until the morning of its release.[57] A 20-second music video teaser was released on Good Morning America on August 25.[58]\n\nThe song's music video premiered on August 27, 2017, at the 2017 MTV Video Music Awards.[59] The video broke the record for most-watched video within 24 hours by achieving 43.2 million views on YouTube in its first day.[60] It topped the 27.7 million Vevo views Adele's \"Hello\" attracted in that timeframe, as well as the 36 million YouTube views of Psy's \"Gentleman\" video.[61][62][63][16] It was viewed at an average 30,000 times per minute in its first 24 hours, with views reaching over three million views per hour.[60]\n\nIt was also reported that the diamonds used in a scene were authentic. The diamonds, loaned from celebrity jeweler Neil Lane, were said to be worth over $10 million, hence triggering tight security measures.[64] The video, widely considered to be Swift's best and one of pop music's most iconic comebacks, was named the fifth-best music video of 2017 by Rolling Stone[65] and seventh-best music video of 2017 by Billboard.[66] In 2019, it was ranked as the most iconic pop video of the 2010s by PopSugar.[15] In 2020, Parade ranked the video 20th on the list of 71 Best Music Videos of All Time.[67] As of now, the video has amassed over 1.29 billion views.[68]\n\nSynopsis [ edit ]\n\nThe bathtub scene in the music video. The diamonds used were said to be authentic and worth over $10 million, and a lone dollar bill can be seen.\n\nSwift has said that part of the premise of the video is rooted in the idea that, \"If everything you write about me was true, this is how ridiculous it would look.\"[69] It is a satirical send-up of media theories about her true intentions that have little validity. The video begins with a zombie Swift crawling out of a grave wearing the dress from her \"Out of the Woods\" music video, where the headstone reads \"Here Lies Taylor Swift's reputation\", and digging another grave for her Met Gala 2014 self. The next scene shows Swift in a bathtub filled with diamonds, with a necklace spelling out No next to a ring, supposedly sending up tabloid press rumors of past romantic relationships. She is then seen seated on a throne while snakes surround her and serve tea. Swift later crashes her golden Bugatti Veyron on a post and sings the song's chorus holding a Grammy as the paparazzi take photos. She is also seen swinging inside a golden cage, robbing a streaming company in a cat mask, and leading a motorcycle gang. Afterwards, she gathers a group of women at \"Squad U\" and dances with a group of men in another room. Then, she is seen standing on top of the wing of a plane in an airport hangar, sawing off the wing in half and spray-painting \"reputation\" in pink on the side of the plane. At the video's climax, Swift is seen standing on a T-shaped throne while clones of herself (from her past music videos, stage performances and red carpet appearances) struggle and fight against each other trying to reach her. The video concludes with a scene of a line up of surviving Swift clones bowing in the hangar while Swift stands and watches on the wing of the plane. The clones bicker with one another, describing each other as \"so fake\" and \"playing the victim\". The 2009 VMA Swift clone then says \"I would very much like to be excluded from this narrative\", resulting in the other Swifts yelling at her to \"shut up!\" in unison.[70][71]\n\nSeveral scenes from the music video were compared to the works of Croatian singer Severina, particularly the scene with the group of women at \"Squad U\" and the scene with the T-shaped throne. The former was compared to her 2016 music video for \"Silikoni\", and the latter was compared to the performances from her 2013 Dobrodošao u Klub Tour.[72][73][74]\n\nAnalysis [ edit ]\n\nTrue to Swift's tradition, the video contains numerous hidden meanings and references. In the opening scene, there is a subtle \"Nils Sjöberg\" tombstone shown when Swift is digging up a grave, referencing the pseudonym she used for a songwriting credit on Calvin Harris' 2016 single \"This Is What You Came For\".[75] Similarly, Swift—masked as a cadaveric version of herself in the \"Out of the Woods\" music video—was shown digging a grave for herself in the gown worn to the 2014 Met Gala.[76] A single dollar bill in the bathtub full of diamonds that she bathes in was also speculated to symbolize the dollar she was awarded for winning a sexual assault trial earlier in 2017.[75] Interpretations for the bathtub scene were contrasting. Some believe that it is a response to media statements teasing that she \"cries in a marble bathtub surrounded by pearls\" with the necklace spelling no next to a ring sending up tabloid media rumors of her relationships.[77] Others speculate that the bathtub scene is a jibe at Kim Kardashian, the then-wife of Swift's long-time feuding partner, Kanye West. Some viewers took the scene as a reference to Kardashian's 2016 robbery, in which she was robbed of jewelry worth over $10 million while held at gunpoint at a hotel in Paris, France.[78][79]\n\nIn a separate scene, Swift is shown sitting atop a golden throne, where a carving of a phrase \"Et tu, Brute?\" could be seen on the armrest, a reference to William Shakespeare's drama Julius Caesar.[75] Swift's infamous title as a \"snake\" during her hiatus[80] was also represented when a snake slithers onto the throne to serve Swift some tea. The scene where Swift's car crashes and is surrounded by paparazzi was speculated by some to be a jab at Katy Perry, as Swift's hairstyle is similar to Perry's in the scene and the car crash itself is reminiscent of the one in Perry's music video for \"Unconditionally\" (2013). The sports car was also suspected to be a reminder of a car in Perry's \"Waking Up in Vegas\" (2009) video, which Kahn also directed. However, given the video's theme of mocking the media, the car crash scene likely makes fun of the theory that Swift's real fallout with Perry was a dramatized act for publicity and album material. Swift is ridiculing the idea that she would damage her friendships for business gains, with the car crash being a metaphor for her feud with Perry and the Grammy Award in her hands in the wreckage symbolizing the awards won from the songs \"inspired\" by the aforementioned feud. Swift's withdrawal of her entire music catalog from streaming services and the media's claims that she was doing this for greed and to start her own streaming company were hinted when Swift and her crew robbed a streaming company's money vault in the video.[81][82]\n\nSwift leading an army of tall, skinny, and robotic women at a \"Squad U\" gathering poked fun at the media's accusations that her close group of friends were artificial and had unrealistic body shapes.[75] During the second chorus, Swift is seen with eight men, each of whom revealed an \"I Heart TS\" crop top after unbuttoning a jacket at her command. This scene mocks the idea that Swift forced her then-boyfriend Tom Hiddleston to wear an \"I Heart TS\" tank top. During the bridge, Swift stands on a mountain of clones of her past selves, which reiterates that she is leaving behind her \"America's Sweetheart\" image and embracing her newfound role as an evil \"snake\". The clones are wearing various noteworthy outfits that Swift herself previously wore. The shirt that her \"You Belong with Me\" music video clone wears, however, is slightly different from the original one: this time, the names of her current close friends are scribbled on it, including Selena Gomez, Gigi Hadid, Martha Hunt, Lily Aldridge, Lena Dunham (all of whom appeared in Swift's \"Bad Blood\" music video), Blake Lively, Ryan Reynolds, Haim, Ed Sheeran and Todrick Hall.[81][82]\n\nThe video's ending features an assembly of \"old Taylors\" in front of a private jet who are talking amongst one another and making snide references to the many false and exaggerated media portrayals of her over the course of her career. These include claims that Swift fakes her classic surprised face at award shows; that her \"nice girl\" façade masks a truly mean, manipulative personality; accusations that Swift always play the victim instead of taking responsibility for her own actions and decisions; and numerous mentions of her 2016 feud with Kanye West and Kim Kardashian, ignited by the release of his 2016 song \"Famous\". Examples include the \"that bitch\" line in \"Famous\" which Swift had disapproved of, and Kardashian illegally recording and editing Swift's phone call with West.[83] In June 2016, discussing the relationship between her and West after the release of \"Famous\", Swift wrote on Instagram, \"I would very much like to be excluded from this narrative.\"[84] The same line is spoken by the 2009 MTV Video Music Awards Taylor clone just before the video ends.[85][86] She is wearing the same outfit Swift had worn during the actual 2009 MTV Video Music Awards, when West infamously interrupted her acceptance speech for the Best Female Video award and ignited tensions between the two for the first time.[87]\n\nLive performances [ edit ]\n\nSwift performed \"Look What You Made Me Do\" live for the first time as part of the KIIS-FM Jingle Ball 2017 on December 1, 2017, in Inglewood, California.[88] Two days later, Swift returned onstage to perform the song again as part of 99.7 Now!'s Poptopia in San Jose, California with the same setlist.[89] The next week Swift sang the song on three other occasions; the B96 Chicago and Pepsi Jingle Bash 2017 in Chicago, the Z100 Jingle Ball 2017 in New York City and Jingle Bell Ball 2017 in London.[90][91][92]\n\nThe song is also a regular part of her setlist for the Reputation Stadium Tour, with a tilted throne and golden snakes; while there are snakes on the high screen in the back during the part where she sings, \"I don't trust nobody and nobody trust me, I'll be the actress starring in your bad dreams\", a big cobra floating appears on stage with the line from the bridge announcing the death of the \"Old Taylor\" spoken by comedian Tiffany Haddish.[93][94]\n\nAccolades [ edit ]\n\nUsage in media [ edit ]\n\nABC used \"Look What You Made Me Do\" in a promotional video for its Shonda Rhimes' Thursday line-up an hour after its release.[110] ESPN used the song in Saturday Night Football advertisements for the season-opening game between Alabama and Florida State, which was aired on ABC on September 2 along with her other song \"...Ready for It?\".[111] In the South Park episode \"Moss Piglets\", the water-bears in Timmy and Jimmy's experiment for the science fair dance to the song in response to Swift's singing. The song was used in the trailer for the 2019 comedy film Murder Mystery.[112] American actress Reese Witherspoon performs the song for the jukebox musical film, Sing 2, in the role of Rosita.[113]\n\nJack Leopards & the Dolphin Club cover [ edit ]\n\nA cover version of \"Look What You Made Me Do\" was recorded by band Jack Leopards & the Dolphin Club, and produced by Antonoff and Nils Sjöberg, the latter being a pseudonym that Swift first used as a co-writer for the song \"This Is What You Came For\" by Calvin Harris featuring Rihanna. The cover was featured in the opening credits of \"Beautiful Monster\", an episode of the television show Killing Eve that aired on May 24, 2020, and subsequently released on digital music platforms. There is no documentation of the band's existence before the release of the cover.[114][115][116] Fans also interpreted the cover to be Swift's way of bypassing potential licensing issues with her former label Big Machine Records and its owner Scooter Braun, with whom Swift is involved in a dispute regarding Braun's acquisition of the label and, subsequently, the master recordings of her back catalogue.[117]\n\nCredits and personnel [ edit ]\n\nCredits are adapted from the liner notes of Reputation.[118]\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRelease history [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/50px-Gnome-mime-sound-openclipart.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f0/Taylor_Swift_-_Look_What_You_Made_Me_Do_%28music_video_screenshot%29.png/220px-Taylor_Swift_-_Look_What_You_Made_Me_Do_%28music_video_screenshot%29.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/68/Taylor_Swift_-_Look_What_You_Made_Me_Do.png/220px-Taylor_Swift_-_Look_What_You_Made_Me_Do.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/6/68/Taylor_Swift_-_Look_What_You_Made_Me_Do.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/6/68/Taylor_Swift_-_Look_What_You_Made_Me_Do.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Look_What_You_Made_Me_Do", "title": "Look What You Made Me Do", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/6/68/Taylor_Swift_-_Look_What_You_Made_Me_Do.png", "width": 640, "height": 565}, "title": "Look What You Made Me Do - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}