{"url": "https://adage.com/article/news/wake-call-steven-spielberg-nixes-carl-s-jr-s-plans/312898/", "text": "Welcome to Ad Age's Wake-Up Call, our daily roundup of advertising, marketing, media and digital news. What people are talking about today: Carl's Jr. tweeted that it's changing the name of its charbroiled sliders to \"SpielBurgers,\" in tribute to \"Ready Player One\" director Steven Spielberg. It added: \"@StevenSpielberg hasn't signed off yet, but we're pretty sure he'll be down with it.\"\n\nBut Spielberg says he's not OK with it. And he made a selfie video to explain that the burgers are \"pretty good, but … I'm passing. Cease and desist. You can't do it. Sorry guys.\" The supposed food feud is getting a lot of press, though this all smells a lot like a marketing stunt. Carl's Jr. has a licensing agreement on \"Ready Player One,\" as USA Today has pointed out. Eater and the A.V. Club argue that the spat is fake. Though even if that's the case, the A.V. Club writes, \"Carl's Jr. did manage to get Steven Spielberg to do a little plug for its food. Doesn't he have better things to do?\"\n\nBest dad joke-esque tweet about all this: \"Guess 'Taters of the Lost Ark' are out of the question then?\"\n\n'Sometimes, lighter is better'\n\nAd Age's E.J. Schultz looks at the back story on that Heineken campaign everyone's talking about, the one with an ad that Chance the Rapper branded \"terribly racist,\" where the tagline is \"Sometimes, lighter is better.\" The campaign from Publicis ran in Europe as far back as last summer \"without any noticeable backlash,\" as Schultz writes. But markets react differently, and as Schultz adds, \"The larger lesson might be the inherent danger when brands try to import work into the U.S. from abroad.\" Heineken's U.S. devision has pulled the ads.\n\nNBCU tackles Facebook\n\nNBC Universal CEO Steve Burke opened the company's fourth annual Innovation Day berating Facebook after the Cambridge Analytica scandal: \"They have a very serious problem.\" At the same time, as Ad Age's Jeanine Poggi says, Burke praised Snapchat (a company NBCU invested in during its initial public offering.) Thought leaders from Netflix, Google and IBM spoke at the event. Poggi emails a few more details: John Swift, CEO and president of North America investment at Omnicom Media Group, predicted that within the next three years we'll see a completely addressable national TV landscape. Another big prediction: By 2020, 50 percent of all searches will happen through voice, said Katie McMahon, VP and general manager of SoundHound Inc.\n\nAlso: NBC Universal has parted ways with its head of affiliate marketing, Scot Chastain, following an internal investigation, Poggi writes. The company declined to provide details.\n\nReviving \"Roseanne\"\n\nThe \"Roseanne\" reboot debuted on ABC, with the title character having become a Trump supporter since her last TV appearance in 1997. Star Roseanne Barr tells The New York Times that ABC didn't give her any pushback about that decision, though \"everybody else in the world\" did. Showrunner Bruce Helford tells The Hollywood Reporter: \"We're tackling some stuff that most comedies wouldn't go anywhere near but we have a legacy to be that show and I think we're allowed.\" One other important thing to know: John Goodman's character was killed off in the 1990s, but just kidding! He's actually fine.\n\n'No one out pizzas the Hut'\n\nPizza Hut is ending its relationship with Droga5, though they'll continue working together through June. As Ad Age's E.J. Schultz writes, Pizza Hut is launching a search for a new agency just as it's taking over from Papa John's as NFL sponsor. It will continue to use the Droga5-created tagline, \"No one out pizzas the Hut\" (though Domino's recently surpassed Pizza Hut in global sales.) For Droga5, it's another setback: A month ago, it laid off 5 percent of staff in New York across all departments, or about 40 people, as Schultz writes.\n\nJust briefly:\n\nNot there yet: The Association of National Advertisers tallied its members and found that \"only 13 percent of the top jobs are held by people of color, including 5 percent Asian, 5 percent Hispanic/Latin and 3 percent black,\" E.J. Schultz writes.\n\nHe'll speak: Facebook CEO Mark Zuckerberg \"has agreed to testify in at least one congressional hearing over the social network's handling of customer data,\" The New York Times reports.\n\nGIFs: Google just bought Tenor, a popular GIF platform with more users than Twitter, George Slefo writes in Ad Age.\n\nBreitbart News: The right-wing site is getting into the live events business, The New York Times reports. The report notes that Breitbart's upcoming panel in Louisiana about privacy and tech \"will be live-streamed – on Facebook.\"\n\nNumber of the day: $4 billion. H&M has accumulated over $4 billion in unsold clothes, Bloomberg News reports.\n\nCreativity pick of the day: Will Ferrell and Joel McHale ponder the meaning of contemporary art in a video promoting The Hammer Museum at UCLA's new exhibition, \"Stories of Almost Everyone.\" And yes, the video is funny – and it seems surprisingly willing to acknowledge that contemporary art can be confusing. (Ferrell's response to a piece involving \"pillows that have only been slept on by acrobats\" is comic gold.) Read more by Ad Age's Ann-Christine Diaz, and watch it here.", "images": ["https://s3-prod.adage.com/s3fs-public/styles/width_100/public/20221007_Cuisinart_Precision-Master-Stand-Mixer_3X2.jpg", "https://s3-prod.adage.com/s3fs-public/styles/width_100/public/20221006_issaDelta_3x2.jpg", "https://s3-prod.adage.com/s3fs-public/styles/width_100/public/20221006_Milk_3x2.jpg", "https://s3-prod.adage.com/s3fs-public/styles/width_100/public/20221006_ACRA2023-Jury12_3x2.jpg", "https://dc.ads.linkedin.com/collect/?pid=64515&fmt=gif", "https://s3-prod.adage.com/s3fs-public/styles/width_100/public/20220928_Cryptodotcom_illo_3x2b.jpg", "https://s3-prod.adage.com/s3fs-public/styles/width_100/public/20221006_notVoteNoVuck_3x2.jpg", "https://s3-prod.adage.com/s3fs-public/styles/width_100/public/20221004_iStock-458645195_3x2.jpg", "https://pixel.quantserve.com/pixel/p-fbFZFDIZ_p3uo.gif", "https://s3-prod.adage.com/s3fs-public/styles/1200x630/public/GettyImages938497092.jpg", "https://s3-prod.adage.com/s3fs-public/styles/width_100/public/20221007_AgencyEmployment_chart1-b_3x2.png", "data:image/gif;base64,R0lGODlhAQABAIAAAP///wAAACH5BAEAAAAALAAAAAABAAEAAAICRAEAOw==", "https://crain-platform-aac-prod.s3.amazonaws.com/aac_logo.svg", "https://s3-prod.adage.com/s3fs-public/styles/width_100/public/20221005_hispanicTalentPool_3x2.jpg", "https://s3-prod.adage.com/s3fs-public/styles/width_100/public/20221006_TV-Time_iStock-1201089478_3X2.jpg", "https://s3-prod.adage.com/s3fs-public/styles/width_660/public/GettyImages938497092.jpg"], "top_img": "https://s3-prod.adage.com/s3fs-public/styles/1200x630/public/GettyImages938497092.jpg", "keywords": [], "authors": ["Angela Doland"], "canonical_link": "https://adage.com/article/news/wake-call-steven-spielberg-nixes-carl-s-jr-s-plans/312898", "title": "Wednesday Wake-Up Call: Steven Spielberg tells Carl's Jr. to cease and desist with its 'SpielBurgers'", "meta_data": {"robots": "noarchive", "apple-itunes-app": "app-id=1537790720", "description": "'SpielBurgers' are a no-go. NBCU says Facebook has 'a very serious problem.' The 'Roseanne' reboot tackles the Trump era. Pizza Hut and Droga5 part ways.", "abstract": "'SpielBurgers' are a no-go. NBCU says Facebook has 'a very serious problem.' The 'Roseanne' reboot tackles the Trump era. Pizza Hut and Droga5 part ways.", "og": {"site_name": "Ad Age", "type": "article", "url": "https://adage.com/article/news/wake-call-steven-spielberg-nixes-carl-s-jr-s-plans/312898", "title": "Wednesday Wake-Up Call: Steven Spielberg tells Carl's Jr. to cease and desist with its 'SpielBurgers'", "description": "'SpielBurgers' are a no-go. NBCU says Facebook has 'a very serious problem.' The 'Roseanne' reboot tackles the Trump era. Pizza Hut and Droga5 part ways.", "image": {"identifier": "https://s3-prod.adage.com/s3fs-public/styles/1200x630/public/GettyImages938497092.jpg", "url": "https://s3-prod.adage.com/s3fs-public/styles/1200x630/public/GettyImages938497092.jpg"}, "updated_time": "2018-03-28T06:43:22-04:00"}, "article": {"author": "https://www.facebook.com/*", "section": "Marketing", "published_time": "2018-03-28T06:43:22-0400", "modified_time": "2018-03-28T06:43:22-04:00"}, "twitter": {"card": "summary_large_image", "description": "'SpielBurgers' are a no-go. NBCU says Facebook has 'a very serious problem.' The 'Roseanne' reboot tackles the Trump era. Pizza Hut and Droga5 part ways.", "title": "Wednesday Wake-Up Call: Steven Spielberg tells Carl's Jr. to cease and desist with its 'SpielBurgers'", "url": "https://adage.com/article/news/wake-call-steven-spielberg-nixes-carl-s-jr-s-plans/312898", "image": "https://s3-prod.adage.com/s3fs-public/styles/1024x512/public/GettyImages938497092.jpg"}, "google-play-app": "app-id=com.adage.crain", "Generator": "Drupal 9 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1, user-scalable=no", "sailthru.title": "Wednesday Wake-Up Call: Steven Spielberg tells Carl's Jr. to cease and desist with its 'SpielBurgers'", "sailthru.date": "2018-03-28T10:43:22-04:00", "sailthru.tags": "marketing,news,advertising-news,hardwall-archive", "sailthru.description": "Supposedly, Spielberg has a beef with Carl's Jr. But what's really going on here?", "sailthru.author": "Angela Doland", "sailthru.image.full": "https://adage.com/s3/files/styles/width_792/public/GettyImages938497092.jpg", "categories": "Marketing, News, Advertising News"}, "movies": [], "publish_date": 1522233802.0, "source": "https://adage.com", "summary": ""}