{"url": "https://www.gq.com/story/evil-genius-netflix", "text": "True crime is everywhere these days. From podcasts like Serial to documentary series like The Jinx and Wild Wild Country to, well, the daily news, criminal cases are one of America’s favorite cultural obsessions. It might be because streaming TV shows and podcasts provide the space to dive deeply into criminal cases, or it might be because social media makes everyone want to join in debates. Maybe it’s because American politics seems to be one big series of criminal conspiracies. Whatever the reason, Netflix has a new documentary series looking to capture the cultural conversation called Evil Genius: The True Story of America’s Most Diabolical Bank Heist. And it investigates one of the most insane bank robberies of all time.\n\nIn 2003 in Erie, Pennsylvania, a pizza delivery driver named Brian Wells walked into a PNC bank with a collar bomb around his neck. Wells was carrying a gun shaped like a cane and a robbery note demanding a quarter of a million dollars. He grabbed a lollipop from the basket on the counter. The teller gave him less than $9,000. He strolled “out of the bank like Charlie Chaplin swinging the bag and the cane gun”—as an FBI agent puts it in the documentary—before being apprehended by police. A few minutes later the bomb exploded and Wells died. Then things got really weird.\n\nWhat already begins like a crime out of a Batman comic got stranger as police discovered that Wells was being sent on elaborate scavenger hunt in order to defuse the bomb. Wells seemed to be a patsy. The FBI elevated the case to a major case, since “something like this had never happened before in the history of the FBI.” A few days later, one of Wells’s pizza shop coworkers died. And then a man named named Bill Rothstein called the police to report a third dead body in his freezer placed there by the titular “evil genius,” a mentally disturbed woman named Marjorie Diehl-Armstrong who had a string of boyfriends that died in mysterious circumstances. That’s the end of episode one.\n\nThe pizza bomber case has all the ingredients of a great true crime documentary, from compelling criminals to red herrings and law enforcement bungles. The case is truly bizarre, and the shocking details are enough to make Evil Genius worth watching. (Although be warned the documentary shows shocking and perhaps unnecessary footage of Wells dying.) The documentary was directed by Trey Borzillieri, who had corresponded with Diehl-Armstrong for years, and Barbara Schroeder. It was produced by the Duplass brothers, who scored a hit earlier this year with the fantastic Wild Wild Country.\n\nThat said, while Evil Genius has all the right ingredients, something about the proportions are off and the final mixture isn’t as compelling as it could be. Documentaries like Wild Wild Country, Making a Murderer, and Serial ignited great debates about the cases themselves, the larger societal questions, or the failures of the justice system. Evil Genius doesn’t really do any of that. While Diehl-Armstrong, and to a lesser degree Rothstein, are presented as intelligent yet mentally disturbed individuals who got left out of society—both are hoarders and Diehl-Armstrong has a series of mental disorder diagnoses—the documentary doesn’t spend much time interrogating questions of mental health care in America nor do we ever really learn what makes Diehl-Armstrong or Rothstein tick. (Rothstein died of non-Hodgkin's lymphoma a year after the robbery, so all we see of him is archival police footage.) Unlike Serial or Making a Murderer, there’s no feeling that the convicted might be innocent or that police conspired in a cover-up. There are some police missteps, but overall the conspirators either all died over a decade ago or ended up in jail.\n\nAs for the case itself, it is captivating mostly for the minor elements: the cane gun, the insanely long instructions, the collar bomb, the casual way Wells sucks on a lollipop minutes before his death. The robbery was elaborate, but it doesn’t go anywhere and the larger plot the documentary lays out feels surprisingly banal. The only real mysteries to the case are ones of degree: Which of the conspirators decided to use a live bomb in the robbery and how complicit was Brian Wells? A surprise confession in the last episode attempts to answer the latter question, while the former is perhaps unknowable, although the documentary makers are confident enough to call Diehl-Armstrong the “evil genius” who masterminded the crime. At a minimum, she was a co-conspirator who openly admits to killing multiple boyfriends, one of whom was threatening to tell the police about Wells’s death.\n\nWhile Evil Genius might not provoke the wide-ranging discussions of other true crime documentaries, it does explore explore one of the strangest American crimes in meticulous detail. At four episodes, it’s a good true crime binge watch for your weekend viewing.", "images": ["https://media.gq.com/photos/6339c14ac4666d99cf2fe022/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://www.gq.com/verso/static/gq/assets/logo-reverse.2fe772617ee3b7f2fc81c9f7237c17495b42eaee.svg", "https://media.gq.com/photos/6331e26da5866e2436a96659/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://www.gq.com/verso/static/gq/assets/logo-header.d739eb0c2af2cf500d0c7ebecd1d6597474e69aa.svg", "https://media.gq.com/photos/5b0593c0d6e5e40dc237d5fd/16:9/w_1280,c_limit/Netflix-Evil_Genius-GQ-May-2018-052318.jpg", "https://media.gq.com/photos/632e248225a8a5233eee9638/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.gq.com/photos/6320d823f9de08435861b339/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.gq.com/photos/5b0593c0d6e5e40dc237d5fd/16:9/w_2560%2Cc_limit/Netflix-Evil_Genius-GQ-May-2018-052318.jpg"], "top_img": "https://media.gq.com/photos/5b0593c0d6e5e40dc237d5fd/16:9/w_1280,c_limit/Netflix-Evil_Genius-GQ-May-2018-052318.jpg", "keywords": [], "authors": ["Condé Nast", "Lincoln Michel"], "canonical_link": "https://www.gq.com/story/evil-genius-netflix", "title": "Evil Genius Is a True Crime Show About the Strangest Bank Robbery Ever", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "Netflix's new four-part documentary is a perfect binge for the long weekend.", "id": "5b055e146b349604d92f798c", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "5b055e146b349604d92f798c", "parsely-metadata": "{\"description\":\"Netflix's new four-part documentary is a perfect binge for the long weekend.\",\"image-16-9\":\"https://media.gq.com/photos/5b0593c0d6e5e40dc237d5fd/16:9/w_1000,c_limit/Netflix-Evil_Genius-GQ-May-2018-052318.jpg\",\"image-1-1\":\"https://media.gq.com/photos/5b0593c0d6e5e40dc237d5fd/1:1/w_1000,c_limit/Netflix-Evil_Genius-GQ-May-2018-052318.jpg\"}", "og": {"description": "Netflix's 'Evil Genius' is a perfect binge for the long weekend.", "image": "https://media.gq.com/photos/5b0593c0d6e5e40dc237d5fd/16:9/w_1280,c_limit/Netflix-Evil_Genius-GQ-May-2018-052318.jpg", "site_name": "GQ", "title": "The True Crime Show About the Strangest Bank Robbery Ever", "type": "article", "url": "https://www.gq.com/story/evil-genius-netflix"}, "article": {"content_tier": "free", "opinion": "false", "section": "tags", "published_time": "2018-05-23T16:22:31.386Z", "modified_time": "2018-05-23T16:22:31.386Z", "author": "Lincoln Michel"}, "twitter": {"card": "summary_large_image", "creator": "@gqmagazine", "description": "Netflix's 'Evil Genius' is a perfect binge for the long weekend.", "domain": "https://www.gq.com", "image": "https://media.gq.com/photos/5b0593c0d6e5e40dc237d5fd/16:9/w_1280,c_limit/Netflix-Evil_Genius-GQ-May-2018-052318.jpg?mbid=social_retweet", "site": "@gqmagazine", "title": "The True Crime Show About the Strangest Bank Robbery Ever"}, "fb": {"app_id": 606963029328755, "pages": 7962048097}}, "movies": [], "publish_date": 1527092551.386, "source": "https://www.gq.com", "summary": ""}