{"url": "https://www.glamour.com/story/actress-melissa-rauch-announces-pregnancy-and-reflects-on-miscarriage", "text": "Actress Melissa Rauch and her husband, Winston, are expecting their first child in the fall of 2017. In her own words, here is Melissa's emotional and heartfelt story of the long road to parenthood.\n\nHere is the only statement regarding my pregnancy that doesn’t make me feel like a complete fraud: “Melissa is expecting her first child. She is extremely overjoyed, but if she’s being honest, due to the fact that she had a miscarriage the last time she was pregnant, she’s pretty much terrified at the moment that it will happen again. She feels weird even announcing this at all, and would rather wait until her child heads off to college to tell anyone, but she figures she should probably share this news before someone sees her waddling around with her midsection protruding and announces it first.”\n\nDuring the time when I was grieving over my pregnancy loss or struggling with fertility issues, every joyful, expectant baby announcement felt like a tiny stab in the heart. It’s not that I wasn’t happy for these people, but I would think, Why are these shiny, carefree, fertile women so easily able to do what I cannot? And then I’d immediately feel guilt and shame for harboring that jealousy—one might call this “the circle of strife.” (A song I imagine is somewhere deep in the extended director’s cut of The Lion King.) I’ve always been one to keep my eyes on my own paper, but when it came to having a baby, that proved to be a challenge. So when I thought about having to share the news about expecting this baby, all I could think about was another woman mourning over her loss as I did, worried she would never get pregnant again, and reading about my little bundle on the way. It felt a bit disingenuous to not also share the struggle it took for me to get here.\n\n(Just to be clear, I’m not saying everyone who publicly announces cheerful news should also report the crummy journey they embarked on before getting to the other side of it. I personally just wanted to express what I’ve experienced in the hopes that it could—in some small way—help someone going through a similar pain. Ideally, the more we talk about this issue, the more we can chip away at the unnecessary stigma around it, with the end result being that those of us struggling with loss and infertility will feel less alone. Perhaps with increased overall awareness, women dealing with these extremely challenging circumstances won’t feel like they’re getting sucker-punched in the uterus by well-intentioned people.)\n\nGrief, Guilt, Hormones, and Hardcore Sobbing to HGTV\n\nThe miscarriage I experienced was one of the most profound sorrows I have ever felt in my life. It kick-started a primal depression that lingered in me. The image of our baby on the ultrasound monitor—without movement, without a heartbeat—after we had seen that same little heart healthy and flickering just two weeks prior completely blindsided us and haunts me to this day. I kept waiting for the sadness to lift…but it didn’t. Sure, I had happy moments, and life went on, but the heartbreak was always lurking. Inescapable reminders, like the unfulfilled due date, came around like a heavy cloud. A day I had once marked on my calendar with such excitement was now a memorial of a crushed dream. I was constantly wishing that the feeling of being desperately lonely in my own body would dissipate. It didn’t help that I was also fighting against these feelings with thoughts like, You should be over this by now, and People go through a heck of a lot worse, you miserable sad sack! (Can you tell that I am awesome at self-compassion?) What I realized, though, is that because this kind of loss is not openly talked about nearly as much as it should be, there really is no template for how to process these emotions. You’re not necessarily going to a funeral or taking time off from work to mourn, but that doesn’t change the fact that something precious has been unexpectedly taken from your life.", "images": ["https://www.glamour.com/verso/static/glamour/assets/logo-header.aeb2e510354d524c42a87c5d0a97d0a73c5d7581.svg", "https://media.glamour.com/photos/633ef8eaf0197d1ce66b2735/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.glamour.com/photos/633dcb5fa325f3cb9d2d5dcc/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://www.glamour.com/verso/static/glamour/assets/logo-reverse.b2ce20427c8d415381a18834c479e653848cc926.svg", "https://media.glamour.com/photos/632490873601d6d92ab5aa10/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.glamour.com/photos/6329ef0b7dd4256bc1a4491c/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.glamour.com/photos/595ed99576072428dce95de3/master/w_2560%2Cc_limit/melissa-rauch-pregnant-pregnancy-baby-bump-2017-vertical.jpg", "https://media.glamour.com/photos/595ed772f4609a21dfa11396/16:9/w_1280,c_limit/MelissaRiver.jpg", "https://media.glamour.com/photos/632d662c16dae576aaf97bc8/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.glamour.com/photos/633ee90e3030f526e3837d87/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.glamour.com/photos/632484d849f9a667e4ae50a1/1:1/w_350%2Ch_350%2Cc_limit/undefined"], "top_img": "https://media.glamour.com/photos/595ed772f4609a21dfa11396/16:9/w_1280,c_limit/MelissaRiver.jpg", "keywords": [], "authors": ["Condé Nast", "Melissa Rauch"], "canonical_link": "https://www.glamour.com/story/actress-melissa-rauch-announces-pregnancy-and-reflects-on-miscarriage", "title": "'The Big Bang Theory' Actress Melissa Rauch Announces Her Pregnancy and Reflects on the Heartbreak of Miscarriage", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "Melissa Rauch (Bernadette on 'The Big Bang Theory') reveals how the aftermath of a miscarriage changed everything now that she's pregnant with her first child.", "id": "595ed66507290f1509fa1a9f", "keywords": "melissa rauch,miscarriage,pregnancy,celebrity pregnancy,the big bang theory,big bang theory,mission,in her words", "news_keywords": "melissa rauch,miscarriage,pregnancy,celebrity pregnancy,the big bang theory,big bang theory,mission,in her words", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "595ed66507290f1509fa1a9f", "parsely-metadata": "{\"description\":\"Melissa Rauch (Bernadette on 'The Big Bang Theory') reveals how the aftermath of a miscarriage changed everything now that she's pregnant with her first child.\",\"image-16-9\":\"https://media.glamour.com/photos/595ed772f4609a21dfa11396/16:9/w_1000,c_limit/MelissaRiver.jpg\",\"image-1-1\":\"https://media.glamour.com/photos/595ed772f4609a21dfa11396/1:1/w_1000,c_limit/MelissaRiver.jpg\"}", "og": {"description": "In a revealing essay, she writes of her difficult road to parenthood.", "image": "https://media.glamour.com/photos/595ed772f4609a21dfa11396/16:9/w_1280,c_limit/MelissaRiver.jpg", "site_name": "Glamour", "title": "'Big Bang Theory' Star Melissa Rauch Announces Her Pregnancy and Reflects on Previous Miscarriage", "type": "article", "url": "https://www.glamour.com/story/actress-melissa-rauch-announces-pregnancy-and-reflects-on-miscarriage"}, "article": {"content_tier": "free", "opinion": "false", "section": "tags", "published_time": "2017-07-11T16:00:00.000Z", "modified_time": "2017-07-11T16:00:00.000Z", "author": "Melissa Rauch"}, "twitter": {"card": "summary_large_image", "creator": "@glamourmag", "description": "In a revealing essay, she writes of her difficult road to parenthood.", "domain": "https://www.glamour.com", "image": "https://media.glamour.com/photos/595ed772f4609a21dfa11396/16:9/w_1280,c_limit/MelissaRiver.jpg?mbid=social_retweet", "site": "@glamourmag", "title": "'Big Bang Theory' Star Melissa Rauch Announces Her Pregnancy and Reflects on Previous Miscarriage"}, "fb": {"app_id": 101358874221, "pages": 26815555478}}, "movies": [], "publish_date": 1499788800.0, "source": "https://www.glamour.com", "summary": ""}