{"url": "https://www.hollywoodreporter.com/live-feed/bachelor-winter-games-could-become-a-series-says-chris-harrison-1080985", "text": "Chris Harrison is no stranger to hyping up moments on The Bachelor and The Bachelorette.\n\nKnown for his go-to tease about the “most dramatic” episode ever — a promise he has consistently made across the ABC franchise’s 20-plus seasons — Harrison, as both the host and a producer, relies on the upcoming show being able to one-up the drama each season so his phrase continues to hold weight.\n\nWith the forthcoming Bachelor Winter Games spinoff, Harrison has perhaps made his biggest promise yet.\n\n“The whole show overall, I could not have been happier the way it turned out,” he said on Thursday during a press call. “I’ve seen the first couple of episodes. It may be some of the best television we’ve ever produced — which scares me because now, instead of a one-off, we might be doing this every winter now.”\n\nHe later doubled down, saying to those who don’t tune in: “You will probably miss out on the best television of the year.”\n\nWinter Games will unite American and international stars of the Bachelor franchise when it launches Feb. 13 on ABC. The Olympics-timed spinoff will air across two weeks, running simultaneously with the 2018 PyeongChang Winter Games, which will be airing over on NBC, and will finale Feb. 22. In total, 26 eligible singles will be competing for love in winter-themed challenges, trading in the sunny California Bachelor mansion, hopefully, to bundle up together at a Vermont ski resort. Of the cast, 12 recognizable stars hail from the U.S. franchise; the other 14 participants are stars in their own Bachelor outposts of Switzerland, Japan, Australia, China, Canada, Sweden, Finland and the U.K. Despite the competition aspect, Harrison assured The Hollywood Reporter on Thursday: “One thing that we agreed is that no matter what we do, Bachelor Winter Games has to be about relationships at the end of the day.”\n\nFormer Bachelor Ben Higgins, who also spoke to the press, is one of the American faces among the cast. When he signed up for Winter Games, after a big push from Harrison, he said he actually had no information about the series. Harrison confirmed that the producers plotted out the short four-episode series when wrapping production on Arie Luyendyk Jr.’s currently airing season of The Bachelor, and in the barely three weeks they had between The Bachelor wrapping and the cameras beginning to roll for Winter Games.\n\nThe idea, Harrison said, sprouted from the minds behind the Bachelor recognizing the global success of the franchise and asking themselves: “We’ve created this franchise and it’s huge in America, but it’s actually huge around the world. How do we expose everybody to the Bachelor universe?” From the casting process to locking in the new format, Harrison admitted that “for a little show that’s only going to be on for a couple weeks, it took a lot of work.”\n\nWhen asked if the crossover work on Winter Games impacted the result of Luyendyk’s season — which has been met with some criticism, including from THR columnist Kareem Abdul-Jabbar — Harrison once again pulled out his drama card to talk about the season’s ending, which will air in March.\n\n“If you are a critic of Arie’s season, I would tell you to wait. Just wait,” he said, “and prepare to have your mind blown. It will be a phenomenal finish. If there are critics out there, then trust that it’s going to be phenomenal.”\n\nBehind the scenes, the crossover production process on Bachelor and Winter Games is actually similar to how the production team works when going from The Bachelorette, which airs in the spring, to working on Bachelor in Paradise, which airs in the summer.\n\n“It’s kind of like an athlete: We play every game hard; we play every game the same,” said Harrison of the focus they devote to each branch of the reality dating juggernaut. “We were producing and working our butts off with Arie, but at the same time, some of our crew was peeling off and going to Vermont. Towards the end of Bachelorette every year, we start peeling people off so we can seamlessly go from The Bachelorette and move into Mexico [where Paradise films]. When the [contestant] numbers get down at the end, you don’t need as many people on-hand, so we start sending people off so they can move on to the next production.”\n\nStill, Harrison admits that they didn’t have a blueprint for Winter Games, like they do for Paradise. The uncharted territory was both challenging and exciting for a crew that has been working on familiar formats for 16 years of The Bachelor and The Bachelorette.\n\n“To reinvent a show, everything was on the table: let’s be as creative as we can,” he recalled of their thought-process. “Let’s throw it against the wall and see if it sticks — and I can attest to the fact that at times, it felt like we were making things up as we were going. For Bachelor Winter Games, we went into it thinking things were going to go one way, and then they took a different turn. You have to be able to adjust and be ready to go on the fly.”\n\nWinter Games premieres Feb. 13 on ABC at 8 p.m. and airs its consecutive episodes on Feb. 15, Feb. 20 and Feb. 22. The inaugural World Tells All reunion special will air following the finale. Meanwhile, The Bachelor is currently airing Mondays at 8 p.m.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/148311_1429_-_h_2018.jpg?w=1296&h=730&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/148311_1429_-_h_2018.jpg?w=1024"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/148311_1429_-_h_2018.jpg?w=1024", "keywords": [], "authors": ["Jackie Strause"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/bachelor-winter-games-could-become-a-series-says-chris-harrison-1080985/", "title": "‘Bachelor Winter Games’ Could Become an Annual Event, Chris Harrison Says", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "'Bachelor' host Chris Harrison gives a bold tease about 'Winter Games' spinoff: \"It may be some of the best television we’ve ever produced.\"", "news_keywords": "Bachelor Winter Games, Chris Harrison, The Bachelor", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jackie Strause", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1080985, "title": "'Bachelor Winter Games' Could Become an Annual Event, Chris Harrison Says", "published_at": "2018-02-01 12:15:51", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/148311_1429_-_h_2018.jpg?w=1024", "comment_count": 0, "tags": "The Bachelor", "topics": "TV News", "body": "Chris Harrison is no stranger to hyping up moments on The Bachelor and The Bachelorette.\r\nKnown for his go-to tease about the \"most dramatic\" episode ever — a promise he has consistently made across the ABC franchise's 20-plus seasons — Harrison, as both the host and a producer, relies on the upcoming show being able to one-up the drama each season so his phrase continues to hold weight.\r\nWith the forthcoming Bachelor Winter Games spinoff, Harrison has perhaps made his biggest promise yet.\r\n\"The whole show overall, I could not have been happier the way it turned out,\" he said on Thursday during a press call. \"I’ve seen the first couple of episodes. It may be some of the best television we’ve ever produced — which scares me because now, instead of a one-off, we might be doing this every winter now.\"\r\nHe later doubled down, saying to those who don't tune in: \"You will probably miss out on the best television of the year.\"\r\nWinter Games will unite American and international stars of the Bachelor franchise when it launches Feb. 13 on ABC. The Olympics-timed spinoff will air across two weeks, running simultaneously with the 2018 PyeongChang Winter Games, which will be airing over on NBC, and will finale Feb. 22. In total, 26 eligible singles will be competing for love in winter-themed challenges, trading in the sunny California Bachelor mansion, hopefully, to bundle up together at a Vermont ski resort. Of the cast, 12 recognizable stars hail from the U.S. franchise; the other 14 participants are stars in their own Bachelor outposts of Switzerland, Japan, Australia, China, Canada, Sweden, Finland and the U.K. Despite the competition aspect, Harrison assured The Hollywood Reporter on Thursday: \"One thing that we agreed is that no matter what we do, Bachelor Winter Games has to be about relationships at the end of the day.\"\r\n\r\nFormer Bachelor Ben Higgins, who also spoke to the press, is one of the American faces among the cast. When he signed up for Winter Games, after a big push from Harrison, he said he actually had no information about the series. Harrison confirmed that the producers plotted out the short four-episode series when wrapping production on Arie Luyendyk Jr.'s currently airing season of The Bachelor, and in the barely three weeks they had between The Bachelor wrapping and the cameras beginning to roll for Winter Games.\r\nThe idea, Harrison said, sprouted from the minds behind the Bachelor recognizing the global success of the franchise and asking themselves: \"We've created this franchise and it's huge in America, but it's actually huge around the world. How do we expose everybody to the Bachelor universe?\" From the casting process to locking in the new format, Harrison admitted that \"for a little show that's only going to be on for a couple weeks, it took a lot of work.\"\r\nWhen asked if the crossover work on Winter Games impacted the result of Luyendyk's season — which has been met with some criticism, including from THR columnist Kareem Abdul-Jabbar — Harrison once again pulled out his drama card to talk about the season's ending, which will air in March.\r\n\"If you are a critic of Arie’s season, I would tell you to wait. Just wait,\" he said, \"and prepare to have your mind blown. It will be a phenomenal finish. If there are critics out there, then trust that it’s going to be phenomenal.\"\r\n\r\nBehind the scenes, the crossover production process on Bachelor and Winter Games is actually similar to how the production team works when going from The Bachelorette, which airs in the spring, to working on Bachelor in Paradise, which airs in the summer.\r\n\"It’s kind of like an athlete: We play every game hard; we play every game the same,\" said Harrison of the focus they devote to each branch of the reality dating juggernaut. \"We were producing and working our butts off with Arie, but at the same time, some of our crew was peeling off and going to Vermont. Towards the end of Bachelorette every year, we start peeling people off so we can seamlessly go from The Bachelorette and move into Mexico [where Paradise films]. When the [contestant] numbers get down at the end, you don’t need as many people on-hand, so we start sending people off so they can move on to the next production.\"\r\nStill, Harrison admits that they didn't have a blueprint for Winter Games, like they do for Paradise. The uncharted territory was both challenging and exciting for a crew that has been working on familiar formats for 16 years of The Bachelor and The Bachelorette.\r\n\"To reinvent a show, everything was on the table: let’s be as creative as we can,\" he recalled of their thought-process. \"Let’s throw it against the wall and see if it sticks — and I can attest to the fact that at times, it felt like we were making things up as we were going. For Bachelor Winter Games, we went into it thinking things were going to go one way, and then they took a different turn. You have to be able to adjust and be ready to go on the fly.\"\r\nWinter Games premieres Feb. 13 on ABC at 8 p.m. and airs its consecutive episodes on Feb. 15, Feb. 20 and Feb. 22. The inaugural World Tells All reunion special will air following the finale. Meanwhile, The Bachelor is currently airing Mondays at 8 p.m.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Bachelor Winter Games’ Could Become an Annual Event, Chris Harrison Says", "url": "https://www.hollywoodreporter.com/tv/tv-news/bachelor-winter-games-could-become-a-series-says-chris-harrison-1080985/", "description": "‘Bachelor’ host Chris Harrison gives a bold tease about ‘Winter Games’ spinoff: “It may be some of the best television we’ve ever produced.”", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/148311_1429_-_h_2018.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-02-01T12:15:51+00:00", "modified_time": "2018-02-13T11:32:51+00:00"}, "twitter": {"site": "@thr", "creator": "@jackiedstrause", "card": "summary_large_image", "title": "‘Bachelor Winter Games’ Could Become an Annual Event, Chris Harrison Says", "description": "‘Bachelor’ host Chris Harrison gives a bold tease about ‘Winter Games’ spinoff: “It may be some of the best television we’ve ever produced.”", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/148311_1429_-_h_2018.jpg?w=1296"}}, "movies": [], "publish_date": 1517487351.0, "source": "https://www.hollywoodreporter.com", "summary": ""}