{"url": "https://en.wikipedia.org/wiki/Cheryl_(singer)", "text": "English singer and television personality (born 1983)\n\nFor other singers, see Cheryl\n\nCheryl Ann Tweedy[1] (born 30 June 1983) is an English singer and television personality. Born and raised in Newcastle upon Tyne, she rose to fame in late 2002 upon winning a place in Girls Aloud, a girl group created through ITV's Popstars: The Rivals. While still in the group, she began a solo career in April 2009, and between then and 2014, she released four studio albums – 3 Words (2009), Messy Little Raindrops (2010), A Million Lights (2012) and Only Human (2014). Collectively, the albums included ten singles, five of which – \"Fight for This Love\", \"Promise This\", \"Call My Name\", \"Crazy Stupid Love\" and \"I Don't Care\" – reached the top position on the UK Singles Chart. Cheryl was the first British female solo artist to have five number-one singles in the UK, and she held the record for the British female solo artist with the most UK number-one singles until Jess Glynne overtook her in 2018.\n\nCheryl became a judge on the UK show of The X Factor in 2008. She mentored two of the eventual winners of the competition (Alexandra Burke in series five and Joe McElderry in series six), before resigning in 2011 after series seven and joining the panel of the USA show, which she left during the auditions stage. She returned to judge series eleven and twelve in 2014 and 2015[2] of the UK show. From 2019 to 2020, Cheryl was a judge on The Greatest Dancer.\n\nCheryl has become a recognised and photographed style icon, being referred to as a \"fashionista\" by the press. She has been photographed for the covers of British Vogue, Elle and Harper's Bazaar, and fronted cosmetic company L'Oréal from 2009 to 2018. Her net worth was estimated at £20 million in October 2014.[3][4]\n\nEarly life\n\nCheryl Ann Tweedy[5] was born in Newcastle upon Tyne on 30 June 1983,[6] and grew up on council estates in the suburbs of Walker[7] and Heaton. She is the fourth of five children of Joan Callaghan,[8] and the first of her two children with Garry Tweedy following the collapse of her marriage to the father of her three other children. Cheryl's parents were together for more than a decade but never married; they separated when she was 11 years old.[9]\n\nAt the age of seven, Cheryl appeared in a television advertisement for British Gas.[10] Interested in dancing from an early age, she began sequence dancing at the age of four,[11] and participated in a short summer holiday course at the Royal Ballet School's Summer School at the age of nine.[12] She occasionally appeared doing dance recitals on different television shows in the UK, such as Gimme 5, in 1993.[13]\n\nCareer\n\n2002–2009: Popstars: The Rivals and Girls Aloud\n\nCheryl (far right) with Girls Aloud performing at the Capital Radio Help a London Child fundraiser, 2005\n\nCheryl auditioned for the reality television show Popstars: The Rivals in 2002, which aimed to create a boy band and a girl group to compete for the Christmas number one spot on the UK Singles Chart. She sang \"Have You Ever\" in her audition,[14] and was one of twenty contestants (ten girls and ten boys) chosen as finalists by judges Pete Waterman, Louis Walsh and Geri Halliwell. The finalists performed live on Saturday evenings, with one gender performing each week, and each week the contestant polling the fewest phone votes was eliminated, until the final line-ups of the five-piece groups emerged. Cheryl was in danger of elimination twice, surviving over Emma Beard[15] and Aimee Kearsley[16] in consecutive performing weeks. On 30 November 2002, she was the first contestant to qualify for the girl group, and was joined by Nadine Coyle, Sarah Harding, Nicola Roberts and Kimberley Walsh to form Girls Aloud, following the final public vote.[17] The group's debut single \"Sound of the Underground\" peaked at number one on the UK Singles Chart, becoming the 2002 Christmas number one over boy band One True Voice's \"Sacred Trust / After You're Gone\".[18] Girls Aloud hold the record for the shortest time between being formed as a band and achieving a number one single.[19]\n\nGirls Aloud released their debut album Sound of the Underground in May 2003,[20] which entered the charts at number two and was certified platinum by the British Phonographic Industry (BPI) later the same year. Their singles \"I'll Stand by You\", \"Walk This Way\", and \"The Promise\" charted at number one. Two of their albums reached the top of the UK Albums Chart: their greatest hits album The Sound of Girls Aloud and 2008's Out of Control, both of which entered the chart at number one, with over one million copies of the former being sold.[21] They also achieved seven certified albums and were nominated for five Brit Awards, winning the 2009 Best Single for \"The Promise\".[22] The group's musical style was pop, but throughout their career they experimented with electropop and dance-pop. Girls Aloud's collaborations with Brian Higgins and his songwriting and production team Xenomania earned the group critical acclaim,[23] due to an innovative approach to mainstream pop music. The group amassed a fortune of £30 million by May 2010. Guinness World Records listed them as \"Most Successful Reality TV Group\" in the 2007 edition. They also held the record for \"Most Consecutive Top Ten Entries in the UK by a Female Group\" in the 2008 edition, and were credited again for \"Most Successful Reality TV Group\" in the 2011 edition. The group was also named the United Kingdom's biggest selling girl group of the 21st century, with over 4.3 million singles sales and 4 million albums sold in the UK alone.[24][25] Girls Aloud took a hiatus in 2009 in the pursuit of solo projects, saying they would reunite for a new studio album in 2010,[26] but this did not materialise.\n\n2008–2011: Television ventures, 3 Words and Messy Little Raindrops\n\nIn 2008, Cheryl replaced Sharon Osbourne as a judge for the fifth series of The X Factor UK alongside creator Simon Cowell, Dannii Minogue and Louis Walsh. She was given the girls category (made up of female solo contestants aged 16 to 24) and subsequently became the winning judge and mentor when Alexandra Burke was crowned the winner of series five on 13 December.[27] She returned for the sixth series in 2009 and was given the boys category (made up of male solo contestants aged 16 to 24).[28] She was the winning judge for a second consecutive year when Joe McElderry won on 13 December.[29] Cowell referred to her as \"one of the best I've ever worked with.\"[30] Cheryl returned for the seventh series in 2010 and mentored the girls category again.[31] This was the first series in which she was not the winning mentor, when Rebecca Ferguson finished as runner-up to Matt Cardle, who was mentored by Minogue.[32]\n\nIn 2011, Cheryl joined Cowell, L.A. Reid, and Paula Abdul on the judging panel of the USA show of The X Factor.[33] After a three-week stint she departed the series.[34] Cowell said the reason she left was that he offered her a judging seat on the eighth series of the UK show and he felt that she would have been more comfortable there.[35] Cheryl did not return to the UK show, as Tulisa had taken her place on the UK judging panel and Cheryl was unwilling to be a judge on the UK show without Cowell.[36] Nicole Scherzinger replaced her on the judging panel of the American version for the rest of season one.[37] In December 2012, Cheryl sued the American producers of The X Factor for $2.3 million (£1.4m). She received $1.8 million (£1.1m) for the 2011 USA series, and then sued for $2 million (£1.25m) for the second season, plus additional damages.[38] In November 2013, Cheryl won for her settlement, for an undisclosed amount between her and producers Blue Orbit.[39]\n\nCheryl's first solo performance was on American rapper will.i.am's \"Heartbreaker\" in 2008. She was picked to appear as a dancer in the video after taking streetdancing classes during the filming of ITV2 series The Passions of Girls Aloud.[40] She was later asked by will.i.am to sing additional vocals on the track.[41] In April 2009, she started working on solo material,[42] and her debut album, 3 Words, was released in the UK on 26 October.[43] The album spent two weeks at number one,[44] and on 6 November, BPI certified the album platinum, denoting shipments of over 300,000 units; it later tripled this feat.[45] The first single from the album, \"Fight for This Love\", was written by Andre Merritt, Steve Kipner and Wayne Wilkins, and produced by Kipner and Wilkins. Following a performance on The X Factor live results show, \"Fight for This Love\" entered the UK and Irish charts at number one,[46] and in 2010, it went to number one in Denmark, Norway and Hungary,[47] and was later certified platinum in the UK.[45] It also became the fourth best-selling single of 2009 in the UK.[48] Cheryl's second single, \"3 Words\", which features will.i.am, went to number four in the UK and seven in Ireland.[49][50] In 2010, the single was released in Australia and charted at number five, and was certified platinum.[51] The third single, \"Parachute\", charted in the top five in both the UK and Ireland, and was certified gold in the UK.[52][50][45]\n\nCheryl started recording sessions for her second album in February 2010,[53] though in an interview on Alan Carr: Chatty Man, she said that some of the songs submitted for the record dated back to 3 Words.[54] The album was largely produced by Wayne Wilkins[55] and released on 29 October 2010 under the title Messy Little Raindrops. It features guest vocals from August Rigo, Dizzee Rascal, Travie McCoy, and will.i.am,[56] and debuted at number one in the UK, and at number two in Ireland.[52][50] It received generally mixed reviews from music critics, with a positive review of four out of five stars from Jon O'Brien of AllMusic.[57] On 19 August 2011, the album was certified platinum by BPI, with shipments in the UK exceeding 300,000.[45] The album's first single, \"Promise This\", is an up-tempo dance-pop song written by Wilkins, Priscilla Hamilton and Christopher Jackson,[58][59] which was released on 24 October 2010 and became her second number-one in the UK where it was certified gold.[60] \"The Flood\" was released as the album's second single and entered the charts after its official release at number 18.[52]\n\nCheryl was given a one-off television programme for ITV1, Cheryl Cole's Night In, which aired on 19 December 2009.[61] The programme, hosted by Holly Willoughby, featured music and interviews with Cheryl and some of her favourite performers. Alexandra Burke, Rihanna, Will Young, Snow Patrol and will.i.am made appearances.[62] The programme attracted 5 million viewers on its first airing.[63]\n\nFrom May to July 2010, Cheryl was the opening act for the Black Eyed Peas at the British shows (as well as some European dates) of The E.N.D. World Tour.[64][65][66] Cheryl was interviewed during an episode of the fourth series of Piers Morgan's Life Stories, in which she discussed her marriage and divorce with Ashley Cole and her life-threatening battle with malaria. The show, which aired on 23 October 2010, drew an audience of 7.2 million, the highest figure in the chat show's history.[67]\n\n2012–2013: A Million Lights, Girls Aloud reunion and tours\n\nCheryl's third studio album, A Million Lights, was released on 18 June 2012.[68] It debuted at number two on the UK Albums Chart, selling 34,934 copies in its first week on sale, and was her first not to debut at number one in the UK and her first not to sell over 100,000 copies in its first week.[69] Her debut album 3 Words sold 125,000 copies while its follow-up Messy Little Raindrops sold around 105,000 copies.[69] A Million Lights was certified gold in the UK for shipments of 100,000 copies.[45] Its lead single, \"Call My Name\" became Cheryl's third number one single on the UK Singles Chart, with the sales of 152,001 digital copies. The song became 2012's fastest selling number one single on the UK Singles Chart until December of the same year,[70] when the winner of the 2012 series of The X Factor UK, James Arthur, sold 490,560 copies with his cover of Shontelle's \"Impossible\".[71] \"Call My Name\" sold a total of 417,000 copies in the UK, and was the 34th best-selling single of 2012 there.[72] \"Under the Sun\", the second single from the album, was released on 2 September 2012,[73] and peaked at number 13, becoming her seventh consecutive solo top-twenty single. To promote A Million Lights, Cheryl embarked on her first solo concert tour, A Million Lights Tour. The tour ran from 3 to 17 October 2012, and comprised 11 show dates: two in Ireland, one in Scotland and eight in England. She also did a set of meet and greets at each concert. The £350 offer included an autograph, a chance to meet her and a photograph with her backstage, with proceeds going towards her charity, The Cheryl Cole Foundation. The meet and greet ticket drew negative criticism from fans, who complained about the high price.[74][75]\n\nOn 4 June 2012, Cheryl performed a duet with Gary Barlow at the Diamond Jubilee Concert, which was organised and created by Barlow as part of the Diamond Jubilee of Elizabeth II and watched by millions worldwide.[76][77] In 2012, Cheryl returned to The X Factor UK as an assistant for Barlow at the judges' houses stage to help him select his contestants for the live shows of the competition. In November 2012, she was handed her own documentary entitled Cheryl: Access All Areas, which attracted 811,000 viewers on ITV2 and 177,000 on +1.[78]\n\nIn November 2012, after months of speculation, Girls Aloud reunited for the group's 10th anniversary. On 18 November, they released their comeback single, \"Something New\", which was also the official charity single for Children in Need 2012. The single peaked at number two on the UK Singles Chart.[79] The group released their second greatest hits compilation, Ten, on 26 November 2012. The second single taken from Ten, \"Beautiful 'Cause You Love Me\", was released on 17 December.[80] A documentary entitled Girls Aloud: Ten Years at the Top aired on ITV1 on 15 December[81] and attracted 2.3 million viewers, a 10.5% share of the audience.[82] In 2013, the group embarked on Ten: The Hits Tour.[83][84] In March 2013, following the completion of the tour, Girls Aloud released a statement to confirm that they were splitting permanently.[85][86]\n\n2014–2017: Only Human and The X Factor return\n\nIn June 2014, Cheryl debuted the first single from her fourth studio album Only Human, \"Crazy Stupid Love\", which features Tinie Tempah.[87] Later in the month, she performed at Capital FM's Summertime Ball at Wembley Stadium.[88] \"Crazy Stupid Love\" was officially released in July and entered the UK Singles Chart at number one, selling 118,000 copies. It became Cheryl's fourth number one single on the chart, making her the third British female artist to achieve four numbers ones as a solo artist, after Geri Halliwell and Rita Ora.[89] The song also peaked at number one in Ireland.[50] The second single from Only Human, \"I Don't Care\", was released on 2 November and similarly to its predecessor debuted at number one in the UK, becoming Cheryl's fifth number one in the country. This made her the first British female to have five solo number one singles in the UK, and she held the record for the British female solo artist with the most UK number-one singles until Jess Glynne overtook her in 2018.[90][91] Only Human was released on 10 November and became Cheryl's fourth solo album to debut within the top 10 in the United Kingdom and Ireland.[52][50] It was later certified silver in the UK.[45] The album's title track was released as its third and final single in March 2015. The song, which originally peaked at number 70 as an album cut in October 2014, failed to reach the top 100 on the UK Singles Chart upon the single's release, therefore becoming Cheryl's lowest-charting single to date.[92]\n\nIn 2014, the singer also returned as a judge on the UK show of The X Factor for its eleventh series to replace Sharon Osbourne, signing a £1.5 million contract.[93][94] She was joined by Simon Cowell, Louis Walsh and Mel B on the judging panel. She was again selected to mentor the girls category, with her final act Lauren Platt coming fourth. In 2015, Cheryl returned to The X Factor for its twelfth series; she was joined by Cowell and new judges Ora and Nick Grimshaw.[95] She was selected to mentor the groups category for the first time and her last remaining group Reggie 'n' Bollie reached the final finishing in second place. Cheryl announced her departure from The X Factor in April 2016, choosing to focus on her music career and was replaced by Osbourne.[96] She appeared in the fourteenth series as Cowell's adviser during the judges' houses stage.[97]\n\n2018–present: New music and The Greatest Dancer\n\nIn July 2018, Cheryl stated that her fifth studio album was \"pretty much finished\", and revealed that she worked on the record with Naughty Boy and her former bandmate Nicola Roberts with whom she co-wrote every song.[98] Later that year, Cheryl signed with 3 Beat to release new music, and announced that she would release a series of singles before releasing a full-length album.[99] The first single, \"Love Made Me Do It\", was released in November 2018.[100] Upon its release, Cheryl hinted in an interview with The Guardian that if her new material were to underperform she would retire from music.[101] Cheryl's comeback was met with intense media scrutiny, and the single failed to make an impact in the charts peaking at number 19 in the UK and number 32 in Ireland.[50][102][103] Her performance of the song on the fifteenth series of The X Factor UK was widely criticised in the media, with viewers arguing that its \"overtly sexual nature\" was \"inappropriate\" for pre-watershed television.[102][104] The follow-up single, \"Let You\", was released in May 2019 and peaked at number 57 in the UK.[105][52]\n\nCheryl began serving as a dance captain on the BBC One dance competition The Greatest Dancer, which premiered on 5 January 2019.[106][107] In 2020, she returned for its second series,[108] and later that year, BBC One said there were no plans to continue the show.[109] She played music manager Coco Rayne in Sky Cinema's 2020 adaptation of the novel Four Children and It titled Four Kids and It.[110][111] In August 2021, Cheryl launched a 12-part podcast about R&B music titled You, Me & R&B with Cheryl on BBC Sounds, which drew criticism for not being hosted by a black artist.[112]\n\nAfter having released no music since 2019 with the release of the single \"Let You\", Naughty Boy revealed in September 2021 that Cheryl had been working on new music with him and Roberts, stating \"Me, Cheryl and Nicola put a few songs together. They're really incredible songs, but it depends when Cheryl is ready to release it. There's definitely an album there. You can't force these things. Cheryl is a real artist. She's not one of those artists you can force.\"[113]\n\nOther ventures\n\nAs a member of Girls Aloud, Cheryl teamed with Eylure to release five sets of false eyelashes, each set designed by a different member of the group. A range of festival-themed lashes followed in 2010, while limited edition \"10th Anniversary\" lash was released in 2012.[114][115] Similarly, to celebrate their tenth anniversary, each member designed a charm bracelet for Pandora, available as either a complete bracelet or a \"starter\" bracelet.[116] From 2009 to 2018, Cheryl served as the UK spokesperson for L'Oréal.[117][118]\n\nCheryl's first official book, entitled Through My Eyes, was published on 30 September 2010 by Bantam Press.[119][120] Through My Eyes purports to show her in the recording studio, backstage on tour, behind-the-scenes at The X Factor, at photo shoots and at award ceremonies. She said the book is \"filled with pictures that capture those moments, [her] memories and the people [she's] closest to\".[121] She is the subject of several unauthorised biographies,[122][123][124] as well as books detailing her relationship with and divorce from Ashley Cole.[125][126][127] Her autobiography, Cheryl: My Story, was published on 11 October 2012.[128] The book's content was about her childhood, rise to fame as a member of Girls Aloud and her relationships with Simon Cowell and her ex-husband Ashley Cole.[129][130] It has sold 275,000 copies as of February 2013 , generating £2.5 million in sales. In August 2014, Cheryl released her debut fragrance, StormFlower.[131]\n\nPhilanthropy\n\nIn 2004, Girls Aloud released a cover of the Pretenders' \"I'll Stand by You\" as the official single for the BBC's charity telethon Children in Need.[132] In 2007, the group announced a joint release of Aerosmith and Run DMC's \"Walk This Way\" with Sugababes as the official single for the UK's other major charity telethon Comic Relief. The song was recorded at Comic Relief co-founder and trustee Richard Curtis' request.[133][134]\n\nIn March 2009, Cheryl climbed Mount Kilimanjaro in aid of Comic Relief. The climb, organised by Gary Barlow, was also undertaken by fellow Girls Aloud member Kimberley Walsh, as well as Alesha Dixon, Fearne Cotton, Denise Van Outen, Chris Moyles, Ben Shephard, Ronan Keating and Barlow himself.[135][136] Between 3 February and 23 March 2009, Cheryl, Walsh, Barlow, Moyles and Cotton also raised money for Comic Relief by providing the voice for the BT Speaking Clock.[137] All nine celebrities reached the summit of Kilimanjaro on Saturday, 7 March 2009.[138] Cheryl, along with Cotton, Van Outen and Shephard, reached the summit first at sunrise. The trek raised £3.5 million for the charity. In February 2011, Cheryl launched her own charitable foundation with The Prince's Trust following a meeting with The Trust's president, Charles, Prince of Wales. The Cheryl Cole Foundation is meant to provide vital funds for The Trust in the North East, which was set up to help disadvantaged young people from Cheryl's region.[139] On 13 June 2011, she auctioned 20 dresses with ASOS to raise funds for the foundation.[140]\n\nIn September 2011, Cheryl became the latest \"Forces' sweetheart\" when she visited British soldiers in Afghanistan.[141] On 23 January 2015, Cheryl announced the launch of a second charity, once again alongside The Prince's Trust. The charity was named Cheryl's Trust, and was set up with the aim of raising £2 million to build a centre, which will support up to 4000 disadvantaged young people in her native city of Newcastle.[142] To raise these funds, Cheryl has thus far teamed up with Prizeo in March 2015, setting up a styling session competition,[143] and also launched a limited edition Belgian Chocolate Bar with Greggs in August 2015; 5p proceeds from each sale being donated towards the trust.[144] In November 2016, she became the ambassador of the charity Childline.[145]\n\nArtistry and influences\n\nCheryl has a mezzo-soprano range.[146] She spoke about her vocal ability saying, \"I am very aware of my ability, I know I'm no Mariah Carey but I think the emotion in the song is what matters.\"[147] In a review for her debut studio album 3 Words, Tom Ewing of The Guardian opined that \"She's not as full a singer as the belters and divas she presides over each week [on The X Factor], but she's an expressive performer and a less showy backing lets that come through.\"[148] 3 Words is a pop and R&B record which incorporates elements of dance, disco and electropop in some of its tracks,[148] while Messy Little Raindrops was described as a combination of \"anthemic dance and synth-led R&B\".[57] A Million Lights, her third studio album, also incorporates R&B and dance.[149] She incorporated dubstep into A Million Lights, MTV citing \"Girl in the Mirror\" as an example.[150]\n\nCheryl has named Britney Spears and Beyoncé as a few of her inspirations, performance and fashion-wise.[151][152] She spoke on the reason Beyoncé was an influence on her, saying, \"I love Beyoncé, I just think she is such a beautiful person inside and out, apart from what she does on the stage which is obviously incredible and aspirational. I just like her as a woman. She's empowering.\"[153] She has cited Lisa \"Left Eye\" Lopes, a former member of American band TLC, as another influence saying, \"I wanted to be [Lopes] – I used to wear baggy jeans and Timberlands like a tomboy.\"[154] Other influences she has cited are Rihanna, whom she described as \"a perfect pop star\",[155] and Mary J. Blige, saying, \"Mary's voice sounds so grown up and you can hear that she has experienced a lot in her life, her songs help me with every heartache.\"[156] Cheryl has influenced other artists, including Selena Gomez.[157] The 2006 Lily Allen song \"Cheryl Tweedy\" was written about her.[158]\n\nAccusations of lip-syncing\n\nIt has been widely reported that Cheryl lip-syncs during live performances. Whilst performing \"Fight for this Love\" in 2009 on The X Factor, media speculated that the performance was mimed, something that she denied though she admitted to having some pre-recorded vocals to help the live performance.[159] In 2010, during her second performance on The X Factor, in which she performed \"Promise This\", she \"showcased her vocal and dancing skills with an energetic, raunchy routine that earned a standing ovation from her fellow judges.\"[160] Similar to her 2009 performance of \"Fight for This Love\" on The X Factor, the media speculated whether she lip-synced or not. An ITV spokesperson insisted that she did not mime, although the performance was pre-recorded.[161]\n\nIn June 2012, Cheryl performed \"Call My Name\" with live vocals on The Voice UK. It was reported that The Voice executives always edit the vocals for every artist on the show, and they would \"provide some finishing touches to her singing prior to it being broadcast.\" As the performance began, she swan-dived onto her backing dancers before they performed a highly elaborated routine. Following the broadcast, she received mixed comments from viewers, with a few accusing the singer of lip-synching, while others, including pop artists Emma Bunton and will.i.am, praised the performance. In an interview with BBC News, she addressed the negative comments, and said that \"if you think my live vocal sounds so good it must be mimed, I'm happy. I take it as a compliment.\"[162]\n\nPublic image\n\nA wax figure of Cheryl at the museum Madame Tussauds in London\n\nAs a member of Girls Aloud, Cheryl was initially recognised as a teen idol.[163] She mentioned her rise to stardom: \"[...] it was a really difficult transition to go through. Coming in to this industry and being an object. [...] I really struggled with that adjustment.\" She felt \"uncomfortable\" in wearing \"short skirts and some outfits that were quite sexy\" as a member of the group, but said \"it wasn't trying to be sexual. I would never do something I didn't want to do\".[164] Her relationship with footballer Ashley Cole was subject of intense media scrutiny[165] and she was labelled a football \"WAG\",[166][167] a term she found \"derogatory\".[165]\n\nCheryl's popularity grew significantly during her stint on The X Factor in its heyday,[10][102] and the British press called her a \"nation's sweetheart\".[14][168] As a judge, she was noted for her style, \"disarming compassion and sensitivity\".[10][14] The Telegraph's Bryony Gordon dubbed her a \"Princess Diana for the X Factor generation.\"[164] Cheryl also received criticism. In 2010, The Guardian's Simon Hattenstone wrote about the public perception of her: \"One day she might be the stoic saint coping with marital adversity or the Mother Teresa of The X Factor, smiling beatifically as her kids perform for her; the next she might be the hard-nosed bitch who lip-syncs her way through a 'live' TV performance while her X Factor wannabes have to do it for real, and who is happy to advertise L'Oréal shampoo while wearing hair extensions.\"[165] Alice Vincent of The Telegraph remarked that \"Cheryl's career has been pockmarked by tales of demanding behaviour and superciliary attitude\".[102] Gordon, however, described her as being \"self-critical\" and \"very polite about everything\".[164]\n\nCheryl has become a recognised and photographed style icon,[169][170][171] being referred to as a \"fashionista\" by the press.[172] During her television appearances, she wore \"a string of fashion-forward outfits from Givenchy and Preen, to McQueen and Missoni.\"[173] In both 2009 and 2010, she was named the best dressed woman by Glamour Magazine, after 14,000 votes from the magazine's readers were counted.[174] She has been photographed for the covers of British Vogue,[171] Elle and Harper's Bazaar.[13] She has won Glamour Women of the Year Awards for TV Personality and Best Dressed[175] and Style Network Award for Best Dressed Woman and Style Icon of the Decade.[169] In February 2009, she appeared on the cover of British Vogue. The media coverage of her appearance in the magazine boosted the magazine's circulation to 240,000, its best ever February figure.[176] Cheryl topped FHM's 100 Sexiest Women in the World list in 2009 and 2010.[177][178] In March 2010, she was declared by research company Millward Brown as the second most powerful celebrity in Britain.[179] In October 2010, a wax statue of her was added to the gallery of Madame Tussauds in London at a cost of approximately £150,000.[180] The waxwork was removed from public display in August 2019.[181]\n\nPersonal life\n\nRelationships\n\nCheryl began dating England and Chelsea footballer Ashley Cole in September 2004, announcing their engagement after he proposed in Dubai in June 2005.[182] The couple were married at a ceremony at Barnet, north west London on 15 July 2006.[183] They signed an exclusive deal with OK!, reportedly worth £1 million, regarding the rights of the photographs.[184] On 23 February 2010, Cheryl announced she was separating from Cole,[185][186] and on 26 May, she filed for divorce at London's High Court citing \"unreasonable behaviour\" from her estranged husband. The divorce papers state that Cole admitted being unfaithful to Cheryl with a number of other women.[187] She was granted a decree nisi on 3 September.[188] She continued to use her married name, but later began using the mononym Cheryl for her music releases.[165]\n\nOn 7 July 2014, Cheryl married French restaurateur Jean-Bernard Fernandez-Versini after a three-month courtship.[189][190][191] Following their separation, Cheryl began dating singer Liam Payne in early 2016,[192][193] before being granted a decree nisi from Fernandez-Versini on 20 October 2016;[194] the divorce was later finalised.[195] On 22 March 2017, she gave birth to her son with Payne.[196][197][198] Cheryl and Payne announced they had ended their relationship in July 2018.[199]\n\nFamily genealogy\n\nIn December 2016, Cheryl appeared on the BBC One genealogy series Who Do You Think You Are?, during which she researched her maternal family.[200] Research shows that her paternal line is from Tyneside[201] and that there were a number of coal miners amongst Cheryl's forebears. When tracing further back, in one of the branches of her paternal line, researchers find that her ancestry includes several mariners.[201] The investigation into Cheryl's maternal line shows that her grandmother, Olga Ridley, was one of twin girls born to Edith Annie Burton, the housekeeper for a widower named Joseph Ridley who already had a number of children from his marriage. Joseph Ridley had fought in World War I in the Durham Light Infantry as a Pioneer in France and, from an examination of the census, before the war he had been a grocery warehouseman.[201]\n\nAssault conviction\n\nOn 11 January 2003, Cheryl was involved in an altercation with a nightclub toilet attendant, Sophie Amogbokpa, and subsequently charged with racially aggravated assault over the incident.[202][163] At her trial on 20 October she was found guilty of assault occasioning actual bodily harm but cleared of the racially aggravated assault charge,[203] and sentenced to 120 hours of community service. She was ordered to pay her victim £500 in compensation, as well as £3,000 prosecution costs. Judge Richard Howard said, \"This was an unpleasant piece of drunken violence which caused Sophie Amogbokpa pain and suffering.\"[203]\n\nPolitical views\n\nCheryl is a lifelong supporter of the Labour Party.[165][204] She proclaimed her support for same-sex marriage in 2012.[205]\n\nFilmography\n\nDiscography\n\nTours\n\nSolo tours\n\nAs solo supporting act\n\nAwards and nominations", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Wax_figure_of_Cheryl_%28cropped%29.jpg/200px-Wax_figure_of_Cheryl_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Cheryl_Cole%2C_Hastings.jpg/170px-Cheryl_Cole%2C_Hastings.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Cheryl_Cole_and_Simon_Cowell.jpg/250px-Cheryl_Cole_and_Simon_Cowell.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Cheryl_Cole_Cannes_2014.jpg/220px-Cheryl_Cole_Cannes_2014.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/0/01/Cheryl_Cole_Cannes_2014.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Girls_Aloud_at_Rock_On%21_by_David_Jones.jpg/220px-Girls_Aloud_at_Rock_On%21_by_David_Jones.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/01/Cheryl_Cole_Cannes_2014.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Cheryl_(singer)", "title": "Cheryl (singer)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/0/01/Cheryl_Cole_Cannes_2014.jpg", "width": 640, "height": 906}, "title": "Cheryl (singer) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}