{"url": "https://en.wikipedia.org/wiki/Tom_Hanks", "text": "American actor and film producer\n\nThis article is about the American actor. For the seismologist, see Thomas C. Hanks\n\nThomas Jeffrey Hanks (born July 9, 1956) is an American actor and filmmaker. Known for both his comedic and dramatic roles, he is one of the most popular and recognizable film stars worldwide, and is regarded as an American cultural icon.[2] Hanks's films have grossed more than $4.9 billion in North America and more than $9.96 billion worldwide,[3] making him the fourth-highest-grossing actor in North America.[4]\n\nHanks made his breakthrough with leading roles in a series of comedy films which received positive media attention, such as Splash (1984), The Money Pit (1986), Big (1988) and A League of Their Own (1992). He won two consecutive Academy Awards for Best Actor for starring as a gay lawyer suffering from AIDS in Philadelphia (1993) and the title character in Forrest Gump (1994).[5] Hanks collaborated with film director Steven Spielberg on five films: Saving Private Ryan (1998), Catch Me If You Can (2002), The Terminal (2004), Bridge of Spies (2015), and The Post (2017), as well as the HBO miniseries Band of Brothers (2001), and The Pacific (2010) which launched him as a director, producer, and screenwriter. Hanks's other films include the romantic comedies Sleepless in Seattle (1993) and You've Got Mail (1998); the dramas Apollo 13 (1995), The Green Mile (1999), Cast Away (2000), Road to Perdition (2002), and Cloud Atlas (2012); and the biographical dramas Charlie Wilson's War (2007), Captain Phillips (2013), Saving Mr. Banks (2013), Sully (2016), A Beautiful Day in the Neighborhood (2019), News of the World (2020), and Elvis (2022). He has also appeared as the title character in the Robert Langdon film series, and voiced Sheriff Woody in the Toy Story film series (1995–present).\n\nHanks's accolades include two Academy Awards out of six nominations. Hanks has also won seven Primetime Emmy Awards for his work as a producer of various limited series and television movies, including From the Earth to the Moon, Band of Brothers, John Adams, and The Pacific. In 2013, he received a Tony Award nomination for Best Actor in a Play for his performance in Nora Ephron's Lucky Guy. He has received the AFI Life Achievement Award in 2002. He received the Stanley Kubrick Britannia Award for Excellence in Film from the British Academy of Film and Television Arts in 2004.[6] In 2014, he received a Kennedy Center Honor, and in 2016, he received a Presidential Medal of Freedom from President Barack Obama,[7] as well as the French Legion of Honor.[8] In 2020, he received the Golden Globe Cecil B. DeMille Award.\n\nEarly life and family\n\nThomas Jeffrey Hanks[9] was born in Concord, California, on July 9, 1956,[10][11] to hospital worker Janet Marylyn (née Frager)[12] and itinerant[13] cook Amos \"Bud\"[14][15] Hanks. His mother was from a Portuguese family; their surname was originally \"Fraga\".[16] His father had English ancestry,[17] and through his line, Hanks is a distant cousin of President Abraham Lincoln[18][19][20][21][22] and children's host Fred Rogers, whom he played.[23][24] His parents divorced in 1960. Their three oldest children, Sandra (later Sandra Hanks Benoiton, a writer),[25] Larry (who became an entomology professor at the University of Illinois Urbana-Champaign),[26] and Tom, went with their father, while the youngest, Jim (who also became an actor and filmmaker), remained with their mother in Red Bluff, California.[27] In his childhood, Hanks's family moved often; by the age of 10, he had lived in 10 different houses.[28]\n\nWhile Hanks's family religious history was Catholic and Mormon, one journalist characterized Hanks's teenage self as being a \"Bible-toting evangelical\" for several years.[29] In school, he was unpopular with students and teachers alike, later telling Rolling Stone magazine, \"I was a geek, a spaz. I was horribly, painfully, terribly shy. At the same time, I was the guy who'd yell out funny captions during filmstrips. But I didn't get into trouble. I was always a real good kid and pretty responsible.\"[30] In 1965, his father married Frances Wong, a San Francisco native of Chinese descent. Frances had three children, two of whom lived with Hanks during his high school years. Hanks acted in school plays, including South Pacific, while attending Skyline High School in Oakland, California.[31]\n\nHanks studied theater at Chabot College in Hayward, California,[32] and transferred to California State University, Sacramento after two years.[33][34] During a 2001 interview with sportscaster Bob Costas, Hanks was asked whether he would rather have an Oscar or a Heisman Trophy. He replied he would rather win a Heisman by playing halfback for the California Golden Bears.[35] He told New York magazine in 1986, \"Acting classes looked like the best place for a guy who liked to make a lot of noise and be rather flamboyant. I spent a lot of time going to plays. I wouldn't take dates with me. I'd just drive to a theater, buy myself a ticket, sit in the seat and read the program, and then get into the play completely. I spent a lot of time like that, seeing Brecht, Tennessee Williams, Ibsen, and all that.\"[36]\n\nDuring his years studying theater, Hanks met Vincent Dowling, head of the Great Lakes Theater Festival in Cleveland, Ohio.[14] At Dowling's suggestion, Hanks became an intern at the festival. His internship stretched into a three-year experience that covered most aspects of theater production, including lighting, set design, and stage management, prompting Hanks to drop out of college. During the same time, Hanks won the Cleveland Critics Circle Award for Best Actor for his 1978 performance as Proteus in Shakespeare's The Two Gentlemen of Verona, one of the few times he played a villain.[37] In 2010, Time magazine named Hanks one of the \"Top 10 College Dropouts.\"[38]\n\nCareer\n\n1980s: Early work\n\nIn 1979, Hanks moved to New York City, where he made his film debut in the low-budget slasher film He Knows You're Alone (1980)[14][39] and landed a starring role in the television movie Mazes and Monsters.[40] Early that year, he was cast in the lead, Callimaco, in the Riverside Shakespeare Company's production of Niccolò Machiavelli's The Mandrake, directed by Daniel Southern. The following year, Hanks landed one of the lead roles, that of character Kip Wilson, on the ABC television pilot of Bosom Buddies. He and Peter Scolari played a pair of young advertising men forced to dress as women so they could live in an inexpensive all-female hotel.[14] Hanks had previously partnered with Scolari on the 1970s game show Make Me Laugh. After landing the role, Hanks moved to Los Angeles. Bosom Buddies ran for two seasons, and, although the ratings were never strong, television critics gave the program high marks. \"The first day I saw him on the set,\" co-producer Ian Praiser told Rolling Stone, \"I thought, 'Too bad he won't be in television for long.' I knew he'd be a movie star in two years.\" However, although Praiser knew it, he was not able to convince Hanks. \"The television show had come out of nowhere,\" Hanks's best friend Tom Lizzio told Rolling Stone.\n\nHanks made a guest appearance on a 1982 episode of Happy Days (\"A Case of Revenge,\" in which he played a disgruntled former classmate of Fonzie) where he met writers Lowell Ganz and Babaloo Mandel who were also writing the film Splash (1984), a romantic comedy fantasy about a mermaid who falls in love with a human, to be directed by former Happy Days star Ron Howard. Ganz and Mandel suggested Howard consider Hanks for the film.[41][42][43] At first, Howard considered Hanks for the role of the main character's wisecracking brother, a role that eventually went to John Candy. Instead, Hanks landed the lead role in Splash, which went on to become a surprise box office hit, grossing more than US$69 million.[44] He also had a sizable hit with the sex comedy Bachelor Party, also in 1984.[9] In 1983–84, Hanks made three guest appearances on Family Ties as Elyse Keaton's alcoholic brother Ned Donnelly.[45][46]\n\nWith Nothing in Common (1986)—a story of a young man alienated from his father (played by Jackie Gleason)— Hanks began to extend himself from comedic roles to dramatic roles. In an interview with Rolling Stone magazine, Hanks commented on his experience: \"It changed my desires about working in movies. Part of it was the nature of the material, what we were trying to say. But besides that, it focused on people's relationships. The story was about a guy and his father, unlike, say, The Money Pit, where the story is really about a guy and his house.\"[47] In 1987, he had signed an agreement with The Walt Disney Studios where he had starred to a talent pool in an acting/producing pact.[48] After a few more flops and a moderate success with the comedy Dragnet, Hanks's stature in the film industry rose.\n\nThe broad success of the fantasy comedy Big (1988) established Hanks as a major Hollywood talent, both as a box office draw and within the industry as an actor.[9][14][6] For his performance in the film, Hanks earned his first nomination for the Academy Award for Best Actor.[49] Big was followed later that year by Punchline, in which he and Sally Field co-starred as struggling comedians.\n\nHanks then suffered a run of box-office underperformers: The 'Burbs (1989), Joe Versus the Volcano (1990), and The Bonfire of the Vanities (1990).[14] In the last, he portrayed a greedy Wall Street figure who gets enmeshed in a hit-and-run accident. 1989's Turner & Hooch was Hanks's only financially successful film of the period.\n\n1990s: Established star\n\nForrest Gump (1994) Hanks on the film set of(1994)\n\nHanks climbed back to the top again with his portrayal of a washed-up baseball legend turned manager in A League of Their Own (1992).[14] Hanks has said his acting in earlier roles was not great, but that he subsequently improved. In an interview with Vanity Fair, Hanks noted his \"modern era of moviemaking ... because enough self-discovery has gone on ... My work has become less pretentiously fake and over the top\". This \"modern era\" began in 1993 for Hanks, first with Sleepless in Seattle and then with Philadelphia. The former was a blockbuster success about a widower who finds true love over the radio airwaves.[50] Richard Schickel of TIME called his performance \"charming,\" and most critics agreed that Hanks's portrayal ensured him a place among the premier romantic-comedy stars of his generation.[51]\n\nIn Philadelphia, he played a gay lawyer with AIDS who sues his firm for discrimination.[14] Hanks lost 35 pounds (16 kg) and thinned his hair in order to appear sickly for the role. In a review for People, Leah Rozen stated, \"Above all, credit for Philadelphia's success belongs to Hanks, who makes sure that he plays a character, not a saint. He is flat-out terrific, giving a deeply felt, carefully nuanced performance that deserves an Oscar.\" Hanks won the 1993 Academy Award for Best Actor for his role in Philadelphia.[14][52] During his acceptance speech, he revealed that his high school drama teacher Rawley Farnsworth and former classmate John Gilkerson, two people with whom he was close, were gay.[53]\n\nHanks followed Philadelphia with the 1994 hit Forrest Gump which grossed a worldwide total of over $600 million at the box office.[54] Hanks remarked: \"When I read the script for Gump, I saw it as one of those kind of grand, hopeful movies that the audience can go to and feel ... some hope for their lot and their position in life ... I got that from the movies a hundred million times when I was a kid. I still do.\" Hanks won his second Best Actor Academy Award for his role in Forrest Gump, becoming only the second actor to have accomplished the feat of winning consecutive Best Actor Oscars.[55] (Spencer Tracy was the first, winning in 1937–38. Hanks and Tracy were the same age at the time they received their Academy Awards: 37 for the first and 38 for the second.)[56][57]\n\nHanks's next role as astronaut and commander Jim Lovell in the 1995 film Apollo 13 reunited him with Ron Howard.[14] Critics generally applauded the film and the performances of the entire cast, which included actors Kevin Bacon, Bill Paxton, Gary Sinise, Ed Harris, and Kathleen Quinlan. The movie also earned nine Academy Award nominations, winning two. Later that year, Hanks starred in Disney/Pixar's CGI-animated hit film Toy Story, as the voice of Sheriff Woody.[58]\n\nHanks made his directing debut with his 1996 film That Thing You Do! about a 1960s pop group, also playing the role of a music producer.[59][60] Hanks and producer Gary Goetzman went on to create Playtone, a record and film production company named after the record company in the film.[61][62]\n\nHanks then executive produced, co-wrote, and co-directed the HBO docudrama From the Earth to the Moon. The 12-part series chronicled the space program from its inception, through the familiar flights of Neil Armstrong and Jim Lovell, to the personal feelings surrounding the reality of moon landings. The Emmy Award-winning project was, at US$68 million, one of the most expensive ventures undertaken for television.[63][64]\n\nIn 1998, Hanks's next project was no less expensive. For Saving Private Ryan, he teamed up with Steven Spielberg to make a film about a search through war-torn France after D-Day to bring back a soldier.[65] It earned the praise and respect of the film community, critics, and the general public.[66] It was labeled one of the finest war films ever made and earned Spielberg his second Academy Award for direction, and Hanks another Best Actor nomination.[67] Later that year, Hanks re-teamed with his Sleepless in Seattle co-star Meg Ryan for You've Got Mail, a remake of 1940's The Shop Around the Corner.[9] In 1999, Hanks starred in an adaptation of the Stephen King novel The Green Mile.[68] He also returned as the voice of Woody in Toy Story 2, the sequel to Toy Story.\n\n2000s\n\nIn 2000, Hanks starred in Robert Zemeckis's Cast Away, for which he received a Golden Globe Award win for Best Actor and an Academy Award nomination for his portrayal of a marooned FedEx systems analyst.[69][70] Famed critic Roger Ebert of The Chicago Sun-Times wrote of Hanks's performance \"Hanks proves here again what an effective actor he is, never straining for an effect, always persuasive even in this unlikely situation, winning our sympathy with his eyes and his body language when there's no one else on the screen.\"[71]\n\nHanks at Post-Emmys Party, September 2008\n\nIn 2001, Hanks helped direct and produce the Emmy Award-winning HBO miniseries Band of Brothers.[72] He also appeared in the September 11 television special America: A Tribute to Heroes and the documentary Rescued From the Closet.[73] He then teamed up with American Beauty director Sam Mendes for the adaptation of Max Allan Collins's and Richard Piers Rayner's DC Comics graphic novel Road to Perdition, in which he played an anti-hero role as a hitman on the run with his son. That same year, Hanks collaborated once again with director Spielberg, starring opposite Leonardo DiCaprio in the hit biographical crime drama Catch Me If You Can, based on the true story of Frank Abagnale, Jr. The same year, Hanks and his wife Rita Wilson produced the hit movie My Big Fat Greek Wedding.[74][75] In August 2007, he along with co-producers Rita Wilson and Gary Goetzman, and writer and star Nia Vardalos, initiated a legal action against the production company Gold Circle Films for their share of profits from the movie.[76][77][78] At the age of 45, Hanks became the youngest-ever recipient of the American Film Institute's Life Achievement Award on June 12, 2002.[79][80]\n\nIn 2004, he appeared in three films: The Coen brothers' The Ladykillers, another Spielberg film, The Terminal, and The Polar Express, a family film from Zemeckis for which Hanks played multiple motion capture roles. In a USA Weekend interview, Hanks discussed how he chooses projects: \"[Since] A League of Their Own, it can't be just another movie for me. It has to get me going somehow ... There has to be some all-encompassing desire or feeling about wanting to do that particular movie. I'd like to assume that I'm willing to go down any avenue in order to do it right\". In August 2005, Hanks was voted in as vice president of the Academy of Motion Picture Arts and Sciences.[81]\n\nHanks next starred in the highly anticipated film The Da Vinci Code, based on the bestselling novel by Dan Brown. The film was released May 19, 2006 in the U.S., and grossed over US$750 million worldwide.[82] He followed the film with Ken Burns's 2007 documentary The War. For the documentary, Hanks did voice work, reading excerpts from World War II-era columns by Al McIntosh. In 2006, Hanks topped a 1,500-strong list of \"most trusted celebrities\" compiled by Forbes magazine.[83] Hanks also produced the animated children's movie The Ant Bully in 2006.\n\nHanks next appeared in a cameo role as himself in The Simpsons Movie, in which he appeared in an advertisement claiming that the U.S. government has lost its credibility and is hence buying some of his. He also made an appearance in the credits, expressing a desire to be left alone when he is out in public. Later in 2006, Hanks produced the British film Starter for Ten, a comedy based on working-class students attempting to win on University Challenge.[84]\n\nIn 2007, Hanks starred in Mike Nichols's film Charlie Wilson's War (written by screenwriter Aaron Sorkin) in which he played Democratic Texas Congressman Charles Wilson. The film opened on December 21, 2007, and Hanks received a Golden Globe nomination.[85] In the comedy-drama film The Great Buck Howard (2008), Hanks played the on-screen father of a young man (played by Hanks's real-life son Colin) who chooses to work as road manager for a fading mentalist (John Malkovich). His character was less than thrilled about his son's career decision.[86] In the same year, he executive produced the musical comedy Mamma Mia and the miniseries John Adams.[87][88]\n\nHanks's next endeavor, released on May 15, 2009, was a film adaptation of Angels & Demons, based on the novel of the same name by Dan Brown. Its April 11, 2007 announcement revealed that Hanks would reprise his role as Robert Langdon, and that he would reportedly receive the highest salary ever for an actor.[89][90] The following day he made his 10th appearance on NBC's Saturday Night Live, impersonating himself for the Celebrity Jeopardy sketch. Hanks produced the Spike Jonze film Where The Wild Things Are, based on the children's book by Maurice Sendak in 2009.[91]\n\n2010s\n\nIn 2010, Hanks reprised his voice role of Woody in Toy Story 3 after he, Tim Allen, and John Ratzenberger were invited to a movie theater to see a complete story reel of the movie.[92] The film went on to become the first animated film to gross a worldwide total of over $1 billion as well as the highest-grossing animated film at the time.[93][94][95] He was also executive producer of the miniseries The Pacific.[96]\n\nIn 2011, he directed and starred opposite Julia Roberts in the title role in the romantic comedy Larry Crowne.[97] The movie received poor reviews, with only 35% of the 175 Rotten Tomatoes reviews giving it high ratings.[98] Also in 2011, he starred in the drama film Extremely Loud and Incredibly Close.[99] In 2012, he voiced the character Cleveland Carr for a web series he created titled Electric City.[100] He also starred in the Wachowskis-directed film adaptation of the novel of the same name, Cloud Atlas, and was executive producer of the miniseries Game Change.[101]\n\nIn 2013, Hanks starred in two critically acclaimed films—Captain Phillips and Saving Mr. Banks—which each earned him praise, including nominations for the BAFTA Award for Best Actor in a Leading Role and the Golden Globe Award for Best Actor – Motion Picture Drama for the former role.[102][103] In Captain Phillips, he starred as Captain Richard Phillips with Barkhad Abdi, which was based on the Maersk Alabama hijacking.[104] In Saving Mr. Banks, co-starring Emma Thompson and directed by John Lee Hancock, he played Walt Disney, being the first actor to portray Disney in a mainstream film.[105] That same year, Hanks made his Broadway debut, starring in Nora Ephron's Lucky Guy, for which he was nominated for the Tony Award for Best Actor in a Play.[106]\n\nIn 2014, Hanks's short story \"Alan Bean Plus Four\" was published in the October 27 issue of The New Yorker.[107] Revolving around four friends who make a voyage to the moon, the short story is titled after the Apollo 12 astronaut Alan Bean. Slate magazine's Katy Waldman found his first published short story \"mediocre\", writing that \"Hanks' shopworn ideas about technology might have yet sung if they hadn't been wrapped in too-clever lit mag-ese\".[108] In an interview with The New Yorker, Hanks said he has always been fascinated by space. He told the magazine that he built plastic models of rockets when he was a child and watched live broadcasts of space missions back in the 1960s.[109]\n\nIn March 2015, Hanks appeared in the Carly Rae Jepsen music video for \"I Really Like You\", lip-syncing most of the song's lyrics as he goes through his daily routine.[110] His next film was the Steven Spielberg-directed historical drama Bridge of Spies, in which he played lawyer James B. Donovan who negotiated for the release of pilot Francis Gary Powers by the Soviet Union in exchange for KGB spy Rudolf Abel. It was released in October 2015 to a positive reception.[111] In April 2016, Hanks starred as Alan Clay in the comedy-drama A Hologram for the King, an adaptation of the 2012 novel of the same name.[112] It is the second time he was directed by Tom Tykwer after Cloud Atlas in 2012.[113]\n\nHanks starred as airline captain Chesley Sullenberger in Clint Eastwood's Sully, which was released in September 2016.[114] He next reprised his role as Robert Langdon in Inferno (2016),[115] and co-starred alongside Emma Watson in the 2017 science fiction drama The Circle.[116] He voiced David S. Pumpkins in The David S. Pumpkins Halloween Special, which aired October 28, 2017 on NBC, a character he had portrayed in episodes of Saturday Night Live.[117]\n\nHanks reprised his voice role as Sheriff Woody in Pixar's Toy Story 4, which was released on June 21, 2019.[119] Later that year, Hanks portrayed Fred Rogers in Marielle Heller's biographical film A Beautiful Day in the Neighborhood for which he was nominated for his first Academy Award for Best Supporting Actor.[120] The film was released on November 22, 2019, by Sony Pictures.[121][122]\n\n2020s\n\nOn April 11, 2020, Hanks made his first television appearance since his COVID-19 diagnosis by hosting Saturday Night Live.[123] Hanks delivered an opening monologue via his house but did not appear in any of the sketches. This is the first episode of SNL to debut after the show's hiatus due to the COVID-19 pandemic; it features different sketches filmed remotely from the cast members' homes. This is also a first in SNL history, for the show to be made up entirely of prerecorded content before airing, and the second to not be filmed at Studio 8H.\n\nHanks had two films released in 2020. In July 2020, Hanks starred in Greyhound, a war film which he also wrote the screenplay for.[124][125] Initially set to be theatrically released in June 2020 by Sony Pictures, due to the COVID-19 pandemic, distribution rights to the film were bought by Apple TV+, where it was released in July 2020.[126] Later that year, Hanks starred in the western drama film News of the World, re-teaming with director Paul Greengrass, which was released on December 23, 2020.[127][128] Film critic David Rooney of The Hollywood Reporter praised Hanks's performance in his review writing, \"Hanks has built a career out of playing thoroughly decent men, so his casting here is entirely to type. But the soulfulness and sorrow, the innate compassion that ripple through his characterization make this an enormously pleasurable performance to watch, with new depths of both kindness and regret that keep revealing themselves.\"[129]\n\nIn 2021, Hanks starred in the science fiction drama Finch, directed by Miguel Sapochnik,[130][131][132] and released by Apple TV+.[133]\n\nOn March 2, 2022, Connor Ratliff appeared as a guest on Late Night With Seth Meyers,[134] where he revealed that Hanks would at last be interviewed for the season three finale of Ratliff's podcast Dead Eyes. The conversation between Hanks and Ratliff took place 22 years after Ratliff was about to begin filming an episode of Hanks' World War II series Band of Brothers, when he was subsequently fired, allegedly because Hanks believed Ratliff had \"dead eyes\". The 90 minute interview was hailed as a momentous achievement in podcasting, a \"rare show that gives you a perfect conclusion\",[135] \"surprisingly funny and empathetic\",[135] and an event Paul Scheer called \"thrilling\".[136]\n\nIn 2022, Hanks starred as Tom Parker, the sole manager of Elvis Presley, in Elvis, directed by Baz Luhrmann.[137] Shooting commenced in the beginning of 2020 in Queensland, Australia.[138] The film was released in June 2022.[139]\n\nIn November 2018, it was reported that Hanks was in talks to portray Geppetto in Walt Disney Studios' live-action adaptation of Pinocchio.[140] His involvement in the film, which was directed by his longtime collaborator Zemeckis, was officially confirmed in December 2020.[141]\n\nUpcoming\n\nHBO confirmed in January 2013 that it was developing a third World War II miniseries based on the book Masters of the Air by Donald L. Miller with Hanks and Spielberg to follow Band of Brothers and The Pacific.[142] Few details have emerged about the project since, but NME reported in March 2017 that production was progressing under the working title The Mighty Eighth.[143] On October 11, 2019, it was announced that the series would keep the title from the book and that the miniseries will stream on Apple TV+ due to budget constraints at HBO. Masters of the Air is expected to cost $200 million with a duration of at least eight hours.[144]\n\nIn July 2021, it was announced Hanks would set to appear in Wes Anderson's Asteroid City starring Bill Murray, Tilda Swinton, and Adrien Brody.[145] Hanks is also attached to star in an American remake of A Man Called Ove, named A Man Called Otto which will be directed by Marc Forster, and In the Garden of Beasts, an adaptation of the 2011 non fiction book from director Joe Wright about American diplomat William Dodd.[146][147]\n\nIn February 2022, it was announced that Hanks will star in the feature adaptation of Here, a graphic novel by Richard McGuire, directed by Robert Zemeckis.[148]\n\nAwards and honors\n\nIn Hanks's career as an actor and producer, he has received many award nominations. Hanks has received six Academy Award nominations including two consecutive wins for Best Actor for Philadelphia, and Forrest Gump in 1993, and 1994 respectively. Hanks also received a Tony Award nomination for Best Actor in a Play for his performance in Nora Ephron's play Lucky Guy in 2013. Hanks has also received 12 Primetime Emmy Award nominations for his work on television which includes 7 wins for his work as a producer on various limited series and television films including From the Earth to the Moon (1998), Band of Brothers (2002), John Adams (2008), The Pacific (2010), Game Change (2012), and Olive Kitteridge (2015).\n\nHonors\n\nPersonal life\n\nHanks and his wife Rita Wilson at the 1989 Oscars\n\nHanks married American actress Samantha Lewes (1952–2002) in 1978. They had one son, actor Colin (born 1977),[153] and one daughter, Elizabeth (born 1982).[9] Hanks and Lewes divorced in 1987.[9][154] Lewes died in 2002 at the age of 49 from bone cancer.[155]\n\nIn 1981, Hanks met actress Rita Wilson on the set of TV comedy Bosom Buddies (1980–1982). They were reunited in 1985 on the set of Volunteers.[9] Wilson is of Greek and Bulgarian descent, and a member of the Greek Orthodox Church. Before marrying her, Hanks converted to her faith.[156][157] Hanks and Wilson married in 1988 and have two sons. The older, Chester Marlon \"Chet\", released a rap song in 2011 and had recurring roles in Empire and Shameless.[158][159] Their younger, Truman Theodore, was born in 1995.[160] Hanks lives with his family in Los Angeles, California,[161] and Ketchum, Idaho.[162]\n\nHanks actively attends church. He said, \"I must say that when I go to church—and I do go to church—I ponder the mystery. I meditate on the 'why?' of 'why people are as they are' and 'why bad things happen to good people,' and 'why good things happen to bad people' ... The mystery is what I think is, almost, the grand unifying theory of all mankind.\"[29]\n\nIn October 2013, Hanks said he has Type 2 diabetes.[163]\n\nDespite being a fan of the Oakland Athletics and the Raiders when they were based in Oakland, Hanks stated in April 2017 he would boycott the NFL for two years after the Raiders filed for relocation to Las Vegas.[164]\n\nSince 1984, Hanks has been an avid fan of the English Premier League club Aston Villa.[165]\n\nIn November 2019, shortly before the release of A Beautiful Day in the Neighborhood, a drama film in which Hanks portrays Fred Rogers, he learned through Ancestry.com that he and Rogers were sixth cousins, both descendants of Johannes Meffert (1732–1795), who was born in Schöneck, Hesse and emigrated to the United States in the 18th century, settling in Kentucky and changing his last name to Mefford.[166]\n\nHanks is also a distant relative of the 16th US president, Abraham Lincoln. Hanks narrated the 2011 television program Killing Lincoln.[167]\n\nOn December 27, 2019, the President of Greece, Prokopis Pavlopoulos, signed an honorary naturalisation order for Hanks and his family, citing their \"exceptional services to Greece\", thus making him and his immediate family Greek citizens.[152][1][168] Hanks, along with Wilson and their children, were conferred honorary citizenship for their role in bringing global attention and appealing for aid after a devastating wildfire that ripped through the seaside village of Mati, near Athens, in July 2018, which killed more than 100 people.[169][168] Greece's Interior Minister Takis Theodorikakos said Hanks \"showed real interest in the people who suffered from the fire in Mati and promoted this issue in the global media\".[168]\n\nOn July 26, 2020, the Prime Minister of Greece, Kyriakos Mitsotakis, accompanied with his wife, handed over Greek passports to both Hanks and Wilson.[169][170]\n\nPolitics and activism\n\nHanks has donated to many Democratic politicians, and during the 2008 United States presidential election uploaded a video to his MySpace account endorsing Barack Obama.[171] He also narrated a 2012 documentary, The Road We've Traveled, created by Obama for America.[172] In 2016, Hanks endorsed former Secretary of State Hillary Clinton in the 2016 presidential election.[173]\n\nHanks was outspoken about his opposition to the 2008 Proposition 8, an amendment to the California constitution that defined marriage as a union only between a man and a woman. Hanks and others raised over US$44 million to campaign against the proposition, in contrast to the supporters' $39 million,[174] but Proposition 8 passed with 52% of the vote.[175] It was overruled in June 2013, when the Ninth Circuit lifted its stay of the district court's ruling, enabling Governor Jerry Brown to order same-sex marriage officiations to resume.[176] While premiering a TV series in January 2009, Hanks called supporters of Proposition 8 \"un-American\" and criticized LDS Church members, who were major proponents of the bill, for their views on marriage and role in supporting the bill.[177][178] About a week later, he apologized for the remark, saying that nothing is more American than voting one's conscience.[179]\n\nA proponent of environmentalism, Hanks is an investor in electric vehicles and owns a Toyota RAV4 EV and the first production AC Propulsion eBox. He was a lessee of an EV1 before it was recalled, as chronicled in the documentary Who Killed the Electric Car?[180] He was on the waiting list for an Aptera 2 Series.[181]\n\nHanks serves as campaign chair of the Hidden Heroes Campaign of the Elizabeth Dole Foundation. The stated mission of the campaign is to inspire a national movement to more effectively support the military and veteran caregivers.[182][183]\n\nIn 2004, while touring the White House, Hanks learned that the press corps did not have a coffee pot, and shortly thereafter he donated an espresso machine. He again donated new machines in 2010 and 2017. His 2017 donation was accompanied by a note that read \"To the White House Press Corps, Keep up the good fight for Truth, Justice, and the American Way. Especially for the truth part.\"[184][185]\n\nHe endorsed former Vice President Joe Biden in the 2020 Presidential election.[186]\n\nOther activities\n\nA supporter of NASA's crewed space program, Hanks said he originally wanted to be an astronaut. Hanks is a member of the National Space Society, serving on the Board of governors of the nonprofit educational space advocacy organization founded by Wernher von Braun.[187] He also produced the HBO miniseries From the Earth to the Moon about the Apollo program to send astronauts to the moon. In addition, Hanks co-wrote and co-produced Magnificent Desolation: Walking on the Moon 3D, an IMAX film about the moon landings.[188] Hanks provided the voice-over for the premiere of the show Passport to the Universe at the Rose Center for Earth and Space in the Hayden Planetarium at the American Museum of Natural History in New York.[189]\n\nIn 2006, the Space Foundation awarded Hanks the Douglas S. Morrow Public Outreach Award,[190] given annually to an individual or organization that has made significant contributions to public awareness of space programs.[191]\n\nIn June 2006, Hanks was inducted as an honorary member of the United States Army Rangers Hall of Fame for his accurate portrayal of a captain in the movie Saving Private Ryan; Hanks, who was unable to attend the induction ceremony, was the first actor to receive such an honor. In addition to his role in Saving Private Ryan, Hanks was cited for serving as the national spokesperson for the World War II Memorial Campaign, for being the honorary chairperson of the D-Day Museum Capital Campaign, and for his role in writing and helping to produce the Emmy Award-winning miniseries, Band of Brothers.[192] On March 10, 2008, Hanks was on hand at the Rock and Roll Hall of Fame to induct The Dave Clark Five.[193]\n\nHanks is a collector of manual typewriters and uses them almost daily.[194][195] In August 2014, Hanks released Hanx Writer, an iOS app meant to emulate the experience of using a typewriter; within days the free app reached number one on the App Store.[196][197]\n\nAfter contracting and recovering from a COVID-19 infection early in the pandemic, Hanks and his wife donated their blood antibodies for virus research.[198]\n\nHanks is an ordained minister and on March 24, 2022 CBS News reported that he had recently officiated a wedding in Pittsburgh.[199]\n\nBibliography\n\nHanks wrote a collection of short stories inspired by his typewriter collection, Uncommon Type, which was published in 2017.[200][201]\n\nLegacy\n\nHanks is often compared to James Stewart,[202] and has also frequently been referred to as \"America's Dad\".[203] In 2013, when he was starring in Nora Ephron's Lucky Guy on Broadway, he had crowds of 300 fans waiting for a glimpse of him after every performance. This is the highest number of expectant fans post-show of any Broadway performance.[204]\n\nHanks is ranked as the fifth-highest all-time box office star in North America, with a total gross of over $4.9 billion at the North American box office, an average of $100.8 million per film.[205] Worldwide, his films have grossed over $9.96 billion.[206]\n\nAsteroid 12818 Tomhanks is named after him.[207]\n\nIn 2003, Hanks was voted Number 3 in Channel 4's countdown of the 100 Greatest Movie Stars of All Time,[208] and he is number 22 on VH1's list of the \"200 Greatest Pop Culture Icons of All Time\".[209] He was included on Forbes' list of the top ten most powerful celebrities in the world, in 2000, 2002 and 2003.[210] As of January 2019, Hanks is currently voted #1 on Ranker's \"The Best Actors in Film History\".[211]\n\nHanks was the guest on BBC Radio 4's Desert Island Discs (in the footsteps of John Huston, Arthur Rubinstein, Luciano Pavarotti, and more than 2,500 other celebrities who were \"castaways\" (guests on the show) since 1942) on May 8, 2016, giving a 45-minute interview with insights into his personal life and career.[212][213]\n\nHanks was interviewed five times on WHYY-FM by Terry Gross on the radio show Fresh Air in Philadelphia. Topics included two segments on his lead role in Captain Phillips, a movie about the real life story of a ship's captain hijacked by Somali pirates. Two interviews are about the 12 part miniseries From Earth to the Moon, for which Hanks was executive producer and which was nominated for 17 Emmy Awards. The last interview segment comprises anecdotes shared by Hanks about his acting career.[214]\n\nSee also\n\nFurther reading\n\nGardner, David (1999), Tom Hanks: The Unauthorized Biography , London, ISBN 978-1-85782-327-1\n\n, London, ISBN 978-1-85782-327-1 Gardner, David (2007), Tom Hanks: Enigma , ISBN 978-1-84454-428-8\n\n, ISBN 978-1-84454-428-8 Pfeiffer, Lee (1996), The Films of Tom Hanks , Secaucus, New Jersey, ISBN 978-0-8065-1717-9\n\n, Secaucus, New Jersey, ISBN 978-0-8065-1717-9 Salamon, Julie (1991), The Devil's Candy: The Bonfire of the Vanities Goes to Hollywood , Boston, ISBN 978-0-385-30824-3\n\n, Boston, ISBN 978-0-385-30824-3 Trakin, Roy (1995), Tom Hanks: Journey to Stardom , ISBN 978-0-312-95596-0\n\n, ISBN 978-0-312-95596-0 Wallner, Rosemary (1994), Tom Hanks: Academy Award-Winning Actor, Edina, Minnesota", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/P120714PS-0497_%2815953217940%29.jpg/220px-P120714PS-0497_%2815953217940%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Tom_Hanks_2008a.jpg/170px-Tom_Hanks_2008a.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Tom_Hanks_-_footprint.JPG/220px-Tom_Hanks_-_footprint.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/TomHanks1989.png/170px-TomHanks1989.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/P052511PS-1339_%285836460582%29.jpg/220px-P052511PS-1339_%285836460582%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/TomHanksForrestGump94.jpg/170px-TomHanksForrestGump94.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Steven_Spielberg_%26_Tom_Hanks_at_National_World_War_II_Memorial_for_premiere_of_The_Pacific_2010-03-11.jpg/220px-Steven_Spielberg_%26_Tom_Hanks_at_National_World_War_II_Memorial_for_premiere_of_The_Pacific_2010-03-11.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/19px-Video-x-generic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Tom_Hanks_the_Presidential_Medal_of_Freedom_2016.jpg/220px-Tom_Hanks_the_Presidential_Medal_of_Freedom_2016.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Tom_Hanks%2C_February_2004.jpg/220px-Tom_Hanks%2C_February_2004.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/19px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/26th_Tokyo_International_Film_Festival-_Tom_Hanks_from_Captain_Phillips%2C_Yakusho_Koji_from_The_Kiyosu_Conference%2C_Prime_Minister_Abe_Shinzo_%2815403635119%29.jpg/220px-26th_Tokyo_International_Film_Festival-_Tom_Hanks_from_Captain_Phillips%2C_Yakusho_Koji_from_The_Kiyosu_Conference%2C_Prime_Minister_Abe_Shinzo_%2815403635119%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Tom_Hanks_TIFF_2019.jpg/220px-Tom_Hanks_TIFF_2019.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/USMC-100311-M-1318S-196.jpg/220px-USMC-100311-M-1318S-196.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Tom_Hanks_and_wife_Rita_Wilson_836.jpg/170px-Tom_Hanks_and_wife_Rita_Wilson_836.jpg", "https://upload.wikimedia.org/wikipedia/commons/a/a9/Tom_Hanks_TIFF_2019.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Tom_Hanks_TIFF_2019.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tom_Hanks", "title": "Tom Hanks", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Tom_Hanks_TIFF_2019.jpg/640px-Tom_Hanks_TIFF_2019.jpg", "width": 640, "height": 890}, "title": "Tom Hanks - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}