{"url": "http://time.com/5300396/jimmy-fallon-speech-stoneman-douglas-graduation/", "text": "Thank you very much. Thank you, Principal Thompson, the parents and staff, family and friends. And most of all, thank you to Marjory Stoneman Douglas High School Class of 2018.\n\nWhen you think of commencement speakers, you think of people who are inspirational, people who are eloquent, people who have changed the world. When you think of high school students, you think of people who are a little immature and slightly awkward and still learning to be an adult. Welcome to opposite day.\n\nToday you’re graduating from high school. You should feel incredibly proud of yourselves. That doesn’t mean you should rest on your laurels — or your yannys. Some of you will grow up to hear yanny, some of you will grow up to hear laurel. But the most important thing to know is that neither of these things will matter by the end of the summer. Here’s what will matter: You, the Class of 2018, will have graduated, and you won’t be classmates anymore. You’ll be adults who Facebook search each other at 2 in the morning for the next 10 years.\n\nBut more important than that, you’ll be out in the real world. So before you go, I wanted to share a few thoughts with you. Not advice necessarily, just a few things I’ve learned that helped me along the way. The first thing is this: When something feels hard, remember that it gets better. Choose to move forward, and don’t let anything stop you. I met many of you earlier this year at the March for Our Lives in Washington, D.C. It was an amazing day. Thank you for your courage and your bravery and for giving amazing speeches I could never possibly live up to. My wife and I brought our two little girls because we wanted them to see what hope and light looks like. And as I was standing there watching you guys, in awe, I was lucky enough to stand with a lot of your teachers. And let me tell you something: Your teachers are so proud of you. Really, they were like, “I taught him! I taught her! I taught them history!” And now you’re making history. It’s pretty cool. And that’s just a few of you I was able to meet. I can only imagine what the rest of this class is accomplishing and will be able to accomplish. And your teachers, everyone, they’re all so proud of you.\n\nMy teachers weren’t really proud of me like that. I wasn’t really the best student. I wouldn’t say I was dumb; I just had “other strengths.” I didn’t always feel like studying, so I had to go to summer school. My Mom and Dad were like, “Look at you, Mr. Smart Guy, huh? Now you’re going to go to summer school. How does that make you feel? Ruin your whole summer now?” It made me feel awful. I went to my bedroom. I cried. But here’s the thing, I got up and went to summer school, and I met 15 versions of myself. Everyone was funny and slightly dumb, and I loved it. I loved summer school. It was fantastic. I met my people.\n\nSo my point is — a lot of you already know this — every bad experience can have something good that comes out of. Sometimes things that seem like setbacks can take our lives in totally new directions and can change us in ways we don’t expect and they make us better and stronger. You guys have already proved that to everyone. You took something horrific, and instead of letting it stop you, you started a movement — not just here in Florida, not just in America, but throughout the whole world. The whole world has heard your voice, and that was you making a choice. That was you choosing to take something awful and using it to create change. That was you choosing hope over fear.\n\nAnother thing I want to say is: Keep making good choices. I’m not saying it because I think you need to learn it. I’m saying it because you already taught it to all of us. I can’t promise you that life will be easy, but if you make good choices and keep moving forward, I can promise you that it will get better in ways that we haven’t even thought of yet\n\nThat brings me to another thing I want to tell you guys, which is: We have no idea what the future holds, and that’s OK. Don’t get too hung up on it. My advice to you is don’t think about what you want to do. Think about why you want to do it, and the rest will figure itself out. I love what I do. I get to tell jokes and make people laugh and it’s awesome. People always ask me, “What’s the best part of your job?” And I say, “I get to make people happy.” You know, it’s great. I’ll give you an example. About six or seven months ago, I ran into this girl on the street. She came up to me and she said, “Oh I just want to let you know that I was going through a tough time. I was very depressed, and you got me through my depression. And I’ve watched all your clips on YouTube, and I just want to thank you so much for getting me through such a tough time.” And then we talked for about 20 minutes. And then she goes, “Can I get a selfie?” I go, “Yeah, of course.” So we take a selfie, and then she goes, “Can we get one more for Snapchat?” And I go, “Yeah, yeah of course.” So we take another one, and then I said goodbye to her, and as she’s leaving, she said out loud, “Oh my God, I just met Jimmy Kimmel.” The point is: I love my job, and I know I could make her laugh if she knew who I was.\n\nA question people ask me a lot is, “What would you tell your younger self?” And there’s so many things I’d say, but the first one would be: Lay off the carbs. The second, I would say, is listen. Listen to everyone around you. Hear other voices. There are so many different voices in the world, and we’re all different voices, different flavors, different colors. But we’re all on the same rainbow. And we need red just as much as we need yellow and purple and orange and blue and green and burgundy. There’s good in everyone, so find what’s good in people. If we listen to each other, we can find it. Another thing I’d tell my younger self is: Work hard for everything. Put one foot in front of the other, and keep going — day by day, moment by moment. You always have the chance to be building something, working on something, pushing something up the hill, practicing every day — rain or shine, in the mood or not. It’s not easy, but you have to keep trying and keep failing and having goals and pushing them ahead every day.\n\nI’d also say, take good care of yourself. Check in with yourself every day. Put your phone down, and be silent for a moment or two. And be kind, and think ahead, and have courage. Try new things. Remember the past, but don’t stay there. Honor your fellow humans. Keep laughing. Celebrate anything you can as often as you can — because it’s fun. Write letters and send them with a stamp in the mailbox. Try that. Say hello to people. Smile more often. Be kind to people who wait on your table, bag your groceries, move your furniture. And when you dance, dance from the inside.\n\nIf I could give you one last piece of advice, it would be this: Don’t ever get off your parents’ wireless plan. Ride that train as long as possible because you don’t know how expensive data is.\n\nOn our show, we write out thank you notes every Friday. For the most part, they’re funny or at least they try to be. But today, I want to say a real thank you. I want to thank you guys, personally, for showing us what it looks like to have integrity and courage and bravery in the face of terrible tragedy. Thank you for showing me and the whole world that there is hope. Most commencement speakers, they’ll get up here and they’ll talk in the future tense. “You will succeed. You will make us proud. You will change the world.” Most commencement speakers, they say, “You are the future.” But I’m not going to say that because you’re not the future. You’re the present. You are the present. You are succeeding. You are making us proud. You are changing the world. So keep changing the world, and keep making us proud. Thank you so much for having me, and congratulations to the Marjory Stoneman Douglas Class of 2018.", "images": ["https://api.time.com/wp-content/uploads/2021/02/ocean-underwater.jpg?quality=85&w=160&h=106&crop=1", "http://time.com/img/icons/metamask.png", "http://time.com/img/loading-circle.gif", "http://time.com/img/icons/crypto-wallet.png", "https://api.time.com/wp-content/uploads/2018/05/2018-commencement-speakers-quotes-advice.jpg?quality=85&w=160&h=106&crop=1", "http://time.com/img/icons/wallet-connect.png", "https://api.time.com/wp-content/uploads/2018/06/jimmy-fallon-speech-parkland-graduation.jpg?quality=85&w=1200&h=628&crop=1"], "top_img": "https://api.time.com/wp-content/uploads/2018/06/jimmy-fallon-speech-parkland-graduation.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Katie Reilly"], "canonical_link": "https://time.com/5300396/jimmy-fallon-speech-stoneman-douglas-graduation/", "title": "Read Jimmy Fallon's Full Speech to Parkland Graduates", "meta_data": {"robots": "max-image-preview:large", "format-detection": "telephone=no", "viewport": "width=device-width, initial-scale=1", "description": "Jimmy Fallon delivered a surprise commencement address to Marjory Stoneman Douglas High School graduates Sunday. Here's everything he said", "og": {"title": "Here's Everything Jimmy Fallon Told Parkland Graduates", "type": "article", "site_name": "Time", "url": "https://time.com/5300396/jimmy-fallon-speech-stoneman-douglas-graduation/", "description": "\"Thank you for your courage and your bravery\"", "image": {"identifier": "https://api.time.com/wp-content/uploads/2018/06/jimmy-fallon-speech-parkland-graduation.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5300396/jimmy-fallon-speech-stoneman-douglas-graduation/", "description": "Jimmy Fallon delivered a surprise commencement address to Marjory Stoneman Douglas High School graduates Sunday. Here's everything he said", "media": "https://api.time.com/wp-content/uploads/2018/06/jimmy-fallon-speech-parkland-graduation.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5300396/jimmy-fallon-speech-stoneman-douglas-graduation/", "title": "Here's Everything Jimmy Fallon Told Parkland Graduates", "description": "\"Thank you for your courage and your bravery\"", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2018/06/jimmy-fallon-speech-parkland-graduation.jpg?quality=85&w=1200&h=628&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}, "recaptcha-key": "6LfZrtgZAAAAAJ8n221oa1YgG6cVvoOPgamCm6oT"}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}