{"url": "https://www.etonline.com/tinsley-mortimer-reacts-to-luann-de-lesseps-relapse-106336", "text": "Another one of Luann de Lesseps' Real Housewives co-stars is weighing in on her decision to return to rehab.\n\nOn Watch What Happens Live Wednesday night, Tinsley Mortimer opened up about de Lesseps' decision to check herself into rehab for a second time, following the completion of an alcohol treatment program back in January.\n\n\"[I was] totally in shock because I was so proud of her,\" Mortimer, 42, told host Andy Cohen. \"I had a mugshot in Palm Beach too, and I just feel like I turned it around.\"\n\nThe Palm Beach mugshot that Mortimer alluded to is from de Lesseps' arrest for disorderly intoxication, resisting arrest and battery on a law enforcement officer in December. The reality star was charged with felony resisting an officer with violence as well as misdemeanor charges of trespassing and disorderly intoxication in January.\n\n\"I felt like she was doing that and the cabaret show is just so amazing and I was just so proud of her and it's just sad,\" Mortimer said. \"I wish her the best and I hope she can work everything out.\"\n\nOn Monday Bravo confirmed that 53-year-old de Lesseps had checked into rehab in a statement to ET.\n\n\"Bravo supports Luann's decision to focus on her health,\" a network spokeswoman said in the statement. \"She is part of the Bravo family and we continue to stand by her as she copes with this challenging situation. At this time, we hope everyone will respect her privacy.\"\n\nBethenny Frankel, another Real Housewives of New York cast member, told Peoplethat de Lesseps would not be at the highly anticipated reunion special taping this week.\n\n\"This weekend, Luann was surrounded by her girlfriends and decided -- with their support -- that in light of recent circumstances, it is the healthiest choice for her not to attend Tuesday’s reunion taping so that she can continue in her healing process,\" Frankel, 47, told the outlet. \"Luann is now surrounded by a core group of people who truly have her best interests at heart and who are working to make sure she gets the help she needs.\"\n\n\"Bravo has been very supportive of Luann during this time,\" Frankel continued. \"It’s a brave and honest decision by her, and everyone is rallying around her and wants the best for her.\"\n\nEarlier this month the mom of two celebrated six months sober with her ex-husband, Count Alexandre de Lesseps. Following that happy announcement, the Count and their two grown children -- Noel and Victoria -- sued the reality star.\n\nET caught up with de Lesseps back in April, where she opened up about her sobriety and time in rehab.\n\n\"I was using alcohol to numb myself, and now that I'm aware of that, I don't foresee that I am going to have this problem again,\" she said at the time. \"Right now, I'm just not into drinking, because I feel so much happier without it.\"\n\nHere's more on that story:\n\n'RHONY' Star Luann De Lesseps Admits Her Arrest Was an 'Out of Control Moment' This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page.\n\nRELATED CONTENT:\n\nAndy Cohen Reacts to Luann de Lesseps Returning to Rehab\n\nLuann de Lesseps Checks Herself Into Rehab for Second Time\n\nLuann de Lesseps Sued By Her Ex-Husband and Their Kids\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/840x470/public/images/2018-08/kristen_bell_like_father_premieregettyimages-1008695098.jpg?h=fd0ec38d&itok=Rwqxvx3M", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-10/Kaye_GettyImages-1429667472_300.jpg?h=6c83441f&itok=79-eWDg7", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-10/Screen%20Shot%202022-10-08%20at%202.01.34%20PM.png?h=597e033f&itok=1KV1Fu0Z", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-07/tinsleyluann.jpg?h=a8cc8d13&itok=KXr4hZYH", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-07/tinsleyluann.jpg?h=a8cc8d13&itok=ZzJIemEH"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-07/tinsleyluann.jpg?h=a8cc8d13&itok=ZzJIemEH", "keywords": [], "authors": ["Paige Gawley"], "canonical_link": "https://www.etonline.com/tinsley-mortimer-reacts-to-luann-de-lesseps-relapse-106336", "title": "Tinsley Mortimer Reacts to Luann de Lesseps' Relapse", "meta_data": {"article": {"opinion": "false"}, "apple-mobile-web-app-capable": "yes", "robots": "index", "description": "\"[I was] totally in shock because I was so proud of her.\"", "keywords": "News, Luann de Lesseps, The Real Housewives of New York City", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/tinsley-mortimer-reacts-to-luann-de-lesseps-relapse-106336", "title": "Tinsley Mortimer Reacts to Luann de Lesseps' Relapse", "description": "\"[I was] totally in shock because I was so proud of her.\"", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-07/tinsleyluann.jpg?h=a8cc8d13&itok=ZzJIemEH", "width": 1280, "height": 720}}, "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "twitter": {"card": "summary_large_image", "description": "\"[I was] totally in shock because I was so proud of her.\"", "site": {"identifier": "@etnow", "id": 23603092}, "title": "Tinsley Mortimer Reacts to Luann de Lesseps' Relapse", "creator": "Paige Gawley‍", "url": "https://www.etonline.com/tinsley-mortimer-reacts-to-luann-de-lesseps-relapse-106336", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-07/tinsleyluann.jpg?h=a8cc8d13&itok=ZzJIemEH"}, "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": ["https://www.youtube.com/embed/-jo6OQTjxkI?feature=oembed"], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}