{"url": "https://web.archive.org/web/20180711151743/http://time.com:80/5328337/prince-louis-christening-dress/", "text": "On July 9, it was time for Prince Louis, the third child of the Duke of Cambridge Prince William and Duchess of Cambridge Kate Middleton, to make his big public debut. The occasion? His christening. The attire? For most, the usual formal daywear — and for little Louis, an elaborate white gown. Louis, who was born April 23 in London, will be officially baptized into the Church of England in the traditional christening ceremony on July 9 at the Chapel Royal in St. James’s Palace, also in London. Like his siblings Prince George and Princess Charlotte before him, Louis will be dressed up in an article of clothing that carries the weight of history.\n\nHere’s the story behind the christening gown he will wear for the big day.\n\nWhat did Prince Louis wear?\n\nPrince Louis was decked out in the same christening gown that Prince George and Princess Charlotte have worn before him. It’s much more than just a casual hand-me-down, however: the gown, handcrafted in 2004 of lace and satin, is a replica of a historic garment that dates back to the Victorian era.\n\nLike George in 2013, Louis wore his wearing his finery to the Chapel Royal at St. James Palace; and like with both George and Charlotte, the Archbishop of Canterbury Justin Welby will be performing the christening honors. (Charlotte’s ceremony took place at St. Mary Magdalene Church, in Sandringham, instead.) Kate Middleton herself also received communion at the Chapel Royal just before her wedding to Prince William.\n\nWhat’s the history behind the gown that was used since 1841?\n\nThe tradition of this particular christening gown harkens back to Queen Victoria, who commissioned the garment for the royal baptism of her daughter Victoria in 1841; you can glimpse one of its earliest representations in a painting of the event from the era. White gowns, or “robes,” were christening fashion going back to the 1700s, according to the archives at the Victoria and Albert Museum. The elaborate gown commissioned by Queen Victoria — made of “a white Honiton point lace robe and mantle over white satin,” as she is said to have described it in her personal diary — was ultimately worn for more than 60 baptisms by children in the ensuing decades, including Princess Victoria’s little brother Edward, who would go on to become King Edward VII in 1901. As the palace further explains, “the original gown was subsequently worn for all Royal christenings, including The Queen, her children and her grandchildren.”\n\nWith both fabrics sourced from U.K. locations, and a local seamstress chosen to craft the piece, Queen Victoria supported local industries through her fashion choice. Meanwhile the design, although reminiscent of a lady’s flowing dress (and reportedly made to reflect Queen Victoria’s own wedding gown), was considered unisex and graced both male and female babies. It was carefully washed with spring water after use and stored in a dark room, the Telegraph reported, to keep it in its best condition. But ultimately time got the best of it.\n\nSo in 2004 one of Queen Elizabeth’s aides was tasked with coming up with a replica to match the original, which required working with a team of expert craftspeople to recreate the garment, hewing as closely as possible to the now-traditional fabrics and design. The first baby to wear the new version was James, Viscount Severn, at his christening in 2008, the palace noted; he is the youngest of the Queen’s eight grandchildren.\n\n“It was made from scratch, from sketching it out, to embroidering the lace on a special silk-based tulle,” aide Angela Kelly told PEOPLE. On Monday just before the christening, the palace confirmed that the gown would be worn by Louis once more to continue the royal tradition.\n\nWhat did Princess Charlotte wear?\n\nCatherine, Duchess of Cambridge and Princess Charlotte of Cambridge arrive at the Church of St Mary Magdalene on the Sandringham Estate for the Christening of Princess Charlotte on July 5, 2015. WPA Pool—Getty Images\n\nAt her christening on July 5, 2015 at the Church of St. Mary Magdalene on the Sandringham Estate in Norfolk, Princess Charlotte wore the very same christening gown. (This church has its own significance for the royal family: it was where Charlotte’s late grandmother, Princess Diana, was herself baptized.) Also at her christening, Charlotte’s five godparents were officially named, including some of her parents’ nearest friends and relative.\n\nWhat did Prince George wear?\n\nThe Duke of Cambridge and his wife Catherine, Duchess of Cambridge, arrive with their son Prince George at Chapel Royal in St James's Palace in central London on October 23, 2013, ahead of the christening of the three month-old prince. AFP—AFP/Getty Images\n\nAt his christening on Oct. 23, 2013 at the Chapel Royal at St. James’s Palace in London, Prince George was dressed up in the newly made replica of the classic Victorian christening gown. He was accompanied by his parents, of course. During the ceremony, his seven godparents were also named, including Prince William’s cousin Zara Tindall and many of their closest friends.", "images": ["https://web.archive.org/web/20180711151743im_/http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://web.archive.org/web/20180711151743im_/https://timedotcom.files.wordpress.com/2018/07/prince-george-christening.jpg", "https://web.archive.org/web/20180711151743im_/https://timedotcom.files.wordpress.com/2018/07/prince-william-kate-louis-lindo.jpg?quality=85", "https://web.archive.org/web/20180711151743im_/http://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://web.archive.org/web/20180711151743im_/http://assets.time.com/images/dianomi-logo.png", "https://web.archive.org/web/20180711151743im_/https://timedotcom.files.wordpress.com/2018/07/princess-charlotte-christening.jpg", "https://web.archive.org/web/20180711151743im_/https://timedotcom.files.wordpress.com/2017/09/time-newsletter-tout-footer.png", "https://web.archive.org/web/20180711151743im_/https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg", "https://web.archive.org/web/20180711151743im_/http://assets.time.com/images/idealmedia.svg"], "top_img": "https://web.archive.org/web/20180711151743im_/https://timedotcom.files.wordpress.com/2018/07/prince-william-kate-louis-lindo.jpg?quality=85", "keywords": [], "authors": ["Raisa Bruner"], "canonical_link": "https://web.archive.org/web/20180711151743/http://time.com/5328337/prince-louis-christening-dress/", "title": "Prince Louis Christening Outfit: All the Details Explained", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "the christening pictures of prince louis, prince louis christening gown, prince louis Christening outfit, prince louis christening photos, prince louis christening gown, princess charlotte christening dress, princess charlotte christening gown, princess charlotte christening outfit, christening gown for prince louis", "news_keywords": "the christening pictures of prince louis, prince louis christening gown, prince louis Christening outfit, prince louis christening photos, prince louis christening gown, princess charlotte christening dress, princess charlotte christening gown, princess charlotte christening outfit, christening gown for prince louis", "description": "Prince Louis will wear a christening outfit for his baptism like Prince George and Princess Charlotte. Here’s the history behind the outfit.", "og": {"title": "Here's Why Prince Louis Is Wearing a Christening Dress", "type": "article", "site_name": "Time", "url": "https://web.archive.org/web/20180711151743/http://time.com/5328337/prince-louis-christening-dress/", "description": "At Prince Louis's christening on July 9, it's all about his historic costume", "image": {"identifier": "https://web.archive.org/web/20180711151743im_/https://timedotcom.files.wordpress.com/2018/07/prince-william-kate-louis-lindo.jpg?quality=85", "width": 1024, "height": 709}}, "pinterest": {"url": "http://time.com/5328337/prince-louis-christening-dress/", "description": "Prince Louis will wear a christening outfit for his baptism like Prince George and Princess Charlotte. Here’s the history behind the outfit.", "media": "https://timedotcom.files.wordpress.com/2018/07/prince-william-kate-louis-lindo.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://web.archive.org/web/20180711151743im_/http://time.com/5328337/prince-louis-christening-dress/", "title": "Here's Why Prince Louis Is Wearing a Christening Dress", "description": "At Prince Louis's christening on July 9, it's all about his historic costume", "site": "@TIME", "image": "https://web.archive.org/web/20180711151743im_/https://timedotcom.files.wordpress.com/2018/07/prince-william-kate-louis-lindo.jpg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}