{"url": "http://wikinetworth.com/celebrities/fiona-loudon-wiki-husband-kids-relationship-net-worth-age-family.html", "text": "Fiona Loudon is a British actress who is best known as the former life partner of real-life James Bond, Daniel Craig. She had a divorce with her then-husband just after two and a half years of marriage. She is a London native who lives a secluded life with her adorable daughter Ella Craig. She summons her net worth from her career in acting. She lives a peaceful life with her family and daughter.\n\nFiona Loudon is a British actress who is best known as the former life partner of real-life James Bond, Daniel Craig. She had a divorce with her then-husband just after two and a half years of marriage. She is a London native who lives a secluded life with her adorable daughter Ella Craig.\n\nHow Fiona Derives Net Worth?\n\nThe Scottish origin actress Fiona derives the majority of her net worth from her acting stint. She is primarily involved in theatres in London from which she summons her fortunes. Her former husband has a grand net worth of $95 million.\n\nHe has contributed his roles in various movies, but his role as a James Bond gave him the abundance of success in his basket. His portrayal of James Bond began in 2006 with a blockbuster movie Casino Royale. The film made a grand collection of $594,239,066 worldwide.\n\nHe simultaneously did another three massive blockbuster movies Quantum of Solace (2008), Skyfall (2012), and Spectre (2015) which brought him enormous fame and wealth. With such professional affluence, he resides in an $8 million mansion in London and enjoys his lavishing life with his present wife and kids.\n\nDivorced With Daniel Craig? All About Ex-Husband And Kid\n\nFiona Loudon and Daniel Craig shared wedding vows in 1992. The couple has a gorgeous daughter named Ella Craig who was born the same year in 1992. Her daughter is also an actress and is known for Maneater (2017), and Trauma is a Time Machine (2018).\n\nThe couple’s roller coaster relationship could not sustain the tornado of the fate. They parted their ways in opposite direction after a divorce in 1994. Their daughter Ella lives with her mother, Fiona in London.\n\nFiona with her husband Daniel Craig in 1990's (Photo: Pinterest)\n\nHer daughter Ella of age 26 is pretty close to her father. She was spotted with her father Daniel in New York City on 3 April 2014. The James Bond, who stands at the height of 1.77 meters (5' 10'') looked shorter than his daughter who has a stunning height. The father-daughter duo was having a serious conversation while walking the streets of New York in 2014.\n\nFionna's daughter Ella with former husband Daniel Craig in New York Street in 2014 (Photo: dailymail.co.uk)\n\nFionna lives a low-key life with her daughter. Ella was one of the four special guests to attend her father’s wedding in June 2011 with Betrayal actress Rachel Weisz. Daniel has a stepson named Henry with Rachel from her past relationship with the director Darren Aronofsky. The couple is happily married to each other and announced that they are expecting their new child together on 24 April 2018 as per E! Online.\n\nShort Bio\n\nThe British actress Fionna was born in 1968 and currently ages 50 as per wiki. She has kept her birth details secluded. She has an English nationality and belongs to white ethnicity. As an actress, she has a decent height with modest body figures. She currently lives in London with her daughter.", "images": ["https://wikinetworth.com/uploads/fiona-loudon.jpg", "https://wikinetworth.com/userfiles/images/wn/wiki-logo.png", "https://wikinetworth.com/userfiles/images/wn/fav-icon.png", "https://wikinetworth.com/frontend/images/socialmedia/popup.png", "http://wikinetworth.com/uploads/Fionna.JPG", "https://images.dmca.com/Badges/dmca_protected_sml_120f.png", "http://wikinetworth.com/uploads/fionnann.JPG", "https://wikinetworth.com/userfiles/images/wn/wn-mobile-text-logo.png"], "top_img": "https://wikinetworth.com/uploads/fiona-loudon.jpg", "keywords": [], "authors": ["Wn Writer"], "canonical_link": "https://wikinetworth.com/celebrities/fiona-loudon-wiki-husband-kids-relationship-net-worth-age-family.html", "title": "Fiona Loudon Wiki: Husband, Kids, Relationship, Net Worth, Age, Family", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "twitter": {"card": "summary_large_image", "site": "wikinetworth", "creator": "@wikinetworth", "title": "Fiona Loudon Wiki: Husband, Kids, Relationship, Net Worth, Age, Family", "image": "https://wikinetworth.com/uploads/fiona-loudon.jpg"}, "og": {"site_name": "wikinetworth", "type": "blog", "locale": "en_US", "title": "Fiona Loudon Wiki: Husband, Kids, Relationship, Net Worth, Age, Family", "url": "https://wikinetworth.com/celebrities/fiona-loudon-wiki-husband-kids-relationship-net-worth-age-family.html", "image": {"identifier": "https://wikinetworth.com/uploads/fiona-loudon.jpg", "secure_url": "https://wikinetworth.com/uploads/fiona-loudon.jpg"}}, "google-site-verification": "wz9L4Xrb4KcYidM8zhr7TwrMnCxXjxmIPTQNLI8cgMM", "robots": "all"}, "movies": [], "publish_date": null, "source": "http://wikinetworth.com", "summary": ""}